{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1.04,"end":65.66,"speaker":"Announcer","text":"He will be a staff for the righteous, with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":67.74,"end":168.37,"speaker":"Fr Andrew Stephen Damick","text":"Good evening all of you dragon slayers, giant killers, slayers of serpents, and stompers on scorpions. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana, where it's probably 100 degrees right now. And I'm Father Ranger Stephen Damick in Emmaus, Pennsylvania, where we still have winter and we are live. And if you are listening to us live, you can call us at 855-237-2346, just like the voice of Steve just said, and you can talk to us live. We're going to get your calls starting in the second half of the show and our own beloved Monteska Trudy will be taking your calls. So our Catholic friends and some of our Protestant friends, more and more of you, as I understand it, and also our fellow Orthodox Christians in Finland, the place where I quite want to be, have already begun Lent this year. And while it's still a few weeks away from most Orthodox, it is on our minds for sure the Triodean is about to begin. That said, there are some Christians, and you know who you are, who think that great Lent is a medieval invention with no basis in the Scriptures, that the seasonal asceticism of fasting in particular is some kind of attempt at earning one's way to heaven. Although we firmly established before in this podcast that we believe in works righteousness. But what if we told you that Lent and its constituent practices are very firmly rooted in the Scriptures? And what if we told you that its endpoint might not be what you think?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":168.85,"end":174.61,"speaker":"Fr Stephen De Young","text":"And what if we Told you that Gavin Rossdale is way more talented than his ex wife and Bush is a great band."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":176.85,"end":178.45,"speaker":"Fr Andrew Stephen Damick","text":"I would agree with that for sure."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":180.53,"end":185.21,"speaker":"Fr Stephen De Young","text":"Maybe the other two questions you're shaky on, but that one I've got."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":185.21,"end":200.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you know, I'm still, I'm still a little. I didn't sleep very well last night and so like my Morpheus voice is not. I couldn't do the, you know what if I told. It's just not coming for me tonight. So I'm a little off my game."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":200.23,"end":204.55,"speaker":"Fr Stephen De Young","text":"But I can only assume that if you didn't sleep at all last night, you were thinking about Almond Delight."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":206.15,"end":208.39,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that seems reasonable to assume."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":208.39,"end":212.39,"speaker":"Fr Stephen De Young","text":"Yeah. I don't know if you could even still buy it. So I mean, that might keep you up."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":212.71,"end":216.47,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I'm going to look that up real quick. I'll get back to you."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":217.43,"end":218.71,"speaker":"Fr Stephen De Young","text":"Live radio, everybody."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":218.79,"end":222.92,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Almond Delights cereal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":223.48,"end":310.94,"speaker":"Fr Stephen De Young","text":"But so, yeah, there may be some folks out there, especially among our Protestant friends, who think Lent is that special time of year when Catholics quit smoking or briefly give up chocolate Friday Fish fries. Yeah. If you're down here in southern Louisiana, it's all of a sudden there are fish fries everywhere on Fridays. But great Lent in all of its details as it's celebrated in the Orthodox church actually has a history reaching back into the apostolic period that we're going to talk about tonight. There are various reasons why it morphed a little bit in the West. I remember 20 odd years ago now there was a. I don't know if he's still living or not, but there was a Franciscan friar on EWTN and he was from Brooklyn and very much from Brooklyn. And at the beginning of Lent he was talking about Lent and he kind of went on this rant doing the whole, why can't you Catholics fast? The Orthodox, they fast. Why can't you fast?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":311.1,"end":311.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":311.46,"end":339.07,"speaker":"Fr Stephen De Young","text":"This whole thing that I still remember and a lot of, a lot of the things still surrounding Lent even in the west, imply more of the Orthodox practice. Right. So carnival literally comes from Carnis meet and vale Farewell in Latin."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":339.07,"end":376.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean here, here in the Lehigh Valley we have something called Fastnachts, which I know exists outside Lehigh Valley as well. And it's literally a donut that you can get the day before Ash Wednesday. And I remember seeing some news article or something, you know, one of these little human interest articles where the writer said something like some say this has to do with the beginning of Lent. I'm like, the name Literally means fasting Eve. What do you mean? Some say, like, the whole point of these donuts is, like, use up all of the lard and the butter and, you know, whatever the day before."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":377.37,"end":384.6,"speaker":"Fr Stephen De Young","text":"Yeah, well. And of course, there are some small, reserved, private family celebrations down here in Louisiana called Mardi Gras."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":387.48,"end":389.24,"speaker":"Fr Andrew Stephen Damick","text":"I've heard of that. Yes. Which."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":391.16,"end":520.37,"speaker":"Fr Stephen De Young","text":"Very religious and very pious. Always. But that's French for Fat Tuesday. Right. For the same reason. Right. You didn't have refrigeration, so you ate everything, threw parties and ate everything before Ash Wednesday. Right. So that. Because it wouldn't keep. And you weren't going to eat it during Lent. But so that said, there's. There's a. There's a lot of things tied up in. Why, for some, if not many, if not most, of our Protestant friends, why Lent seems like some kind of weird accretion. And we're going to get into that over the course of tonight, kind of understanding what asceticism is, what the purpose is, where it comes from. To begin here, though, in our first half, we're going to talk about the number 40, because, of course, great Lent goes for 40 days. It's the 40 days before holy Week, before Pascha, before the Passover. Yet I'm sure at some point during Lent on this show, I will go into my rant about why we don't just translate the word Pascha as Passover in our hymns and that kind of thing so that they will make sense to people. But that's not tonight. So we're going to talk about this. This number 40 and 40 days and the significance of that. This is one of these biblical numbers that when you read through, you don't even have to get very far in the Old Testament before you start noticing that lots of things come in sevens and lots of things come in 40s and lots of things come in 12s. Lots."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":521.08,"end":521.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":521.24,"end":526.52,"speaker":"Fr Stephen De Young","text":"For example, and then 70 or 72."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":526.52,"end":526.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":526.84,"end":593.53,"speaker":"Fr Stephen De Young","text":"There are these certain numbers that keep recurring, and one of those. One of those, of course, is 40. So before we get into a big list of examples of where 40 shows up in the Scriptures and start working through and talking about some of those and the themes that emerge out of that, we have to talk for a minute about the number 40 itself. So we've talked about on several occasions the number 70 on the show and how it's like 70, sometimes 72, that there is this sort of wiggle between 70 and 72 and how a lot of that has to do with when you don't have Numerals, which neither Hebrew nor Greek have numerals. And those, of course, are the languages in which the scriptures are written. Aramaic also. No. Numerals."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":593.69,"end":596.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they just use letters to designate numbers."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":597.21,"end":628.27,"speaker":"Fr Stephen De Young","text":"They use letters to indicate numbers. And that means de facto, even if you want to, you can't be that precise. This is one of the problems with the modernist version of a literal reading of the Old Testament that tries to take every number literally. You very quickly find that, for example, between the Greek and the Hebrew, there are radical differences every time there's a number."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":628.75,"end":630.75,"speaker":"Fr Andrew Stephen Damick","text":"Yes. How tall is Goliath, for instance?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":631.26,"end":638.78,"speaker":"Fr Stephen De Young","text":"Yeah. Six. Six or nine. Nine. And across the board, every place where you find numbers, they're different."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":638.78,"end":639.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":639.42,"end":653.34,"speaker":"Fr Stephen De Young","text":"And even I pointed this out in another context recently. Even the Romans, Romans, kind of renowned for their record keeping, had Roman numerals and everything."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":654.22,"end":654.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":655.74,"end":659.1,"speaker":"Fr Stephen De Young","text":"How many troops was a centurion in command of?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":660.81,"end":661.21,"speaker":"Fr Andrew Stephen Damick","text":"100."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":661.61,"end":662.65,"speaker":"Fr Stephen De Young","text":"This is a trick question."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":662.81,"end":670.49,"speaker":"Fr Andrew Stephen Damick","text":"80. 80. Dang it. Right? Etymology fails me again."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":670.49,"end":676.33,"speaker":"Fr Stephen De Young","text":"Exactly. Yes, exactly. No, but that's what it is. It's a commander of a hundred. And he didn't have 100 people under him."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":676.57,"end":677.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":677.93,"end":684.41,"speaker":"Fr Stephen De Young","text":"They had another position called Achillearch a thousand. He had six centurions under him."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":686.9,"end":692.26,"speaker":"Fr Andrew Stephen Damick","text":"So 480 plus those centurions, man. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":693.22,"end":696.42,"speaker":"Fr Stephen De Young","text":"So all this is to say, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":696.5,"end":700.34,"speaker":"Fr Andrew Stephen Damick","text":"Numbers don't mean mathematical numbers the way that we mean them."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":700.42,"end":720.94,"speaker":"Fr Stephen De Young","text":"Right. In the ancient world, they didn't feel the need for that kind of precision on these things. Right. Things get rounded. They get rounded up and down a little bit. Right. So saying 70 and saying 72, there was not a huge difference or need for precision in that regard. Right. In the ancient world."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":722.78,"end":723.42,"speaker":"Fr Andrew Stephen Damick","text":"Same is true."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":723.42,"end":743.59,"speaker":"Fr Stephen De Young","text":"With 40, because you also get 40 and 42 doing the same thing. And just like with 72, which is six times 12, 42 is six times seven. It's six sevens."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":744.15,"end":744.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":746.71,"end":756.79,"speaker":"Fr Stephen De Young","text":"Seven. As we've talked about on the four on the show, seven is seen to be a number that represents completion or wholeness."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":757.19,"end":759.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is why we have seven days in a week."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":760.15,"end":770.89,"speaker":"Fr Stephen De Young","text":"Right. But the reason why seven is that number is because there are seven planets, counting the sun and Moon. I'll just leave that there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":772.33,"end":774.33,"speaker":"Fr Andrew Stephen Damick","text":"Did you just deplanetize Pluto again?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":774.97,"end":777.41,"speaker":"Fr Stephen De Young","text":"Oh, I just depleted a whole bunch."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":777.41,"end":779.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know. Yeah, I know, I know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":780.89,"end":785.97,"speaker":"Fr Stephen De Young","text":"So, because we're talking about early astronomy, slash astrology, right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":785.97,"end":788.49,"speaker":"Fr Andrew Stephen Damick","text":"The stuff you can see without powerful telescopes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":788.89,"end":838.41,"speaker":"Fr Stephen De Young","text":"And so the distinction there was between, right, the quote unquote, fixed stars in their constellations that Followed this orderly pattern, and then those are there. And then there are also these other objects, right, in the heavens that they didn't think of as objects. There are other beings, frankly, in the heavens that did not follow the same kind of orderly path with the stars. And those were the sun, the moon, Mercury, Venus, Mars, Jupiter and Saturn that were observed. So they. They saw these moving around."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":838.89,"end":839.61,"speaker":"Fr Andrew Stephen Damick","text":"Wanderers."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":840.57,"end":901.9,"speaker":"Fr Stephen De Young","text":"Yes. So and that's what planets means. Right. Planetes in Greek means wanderers. So they said, oh, well, there's these other. These other bodies that wander through the heavens. But if you have all seven of them, right, then that's completion. And so you get the seven branched candlestand in the tabernacle and later in the temple. Seven lights, Right. That's the cosmos. Right. That's the sky. It's that connection. So if you had seven sevens, right. Seven times seven, seven sevens, 49. That would be sort of complete completely. But if you have six sevens, 42 or 40."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":902.46,"end":902.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":902.78,"end":913.5,"speaker":"Fr Stephen De Young","text":"If you have six sevens, then that's not so much incompletion as sort of. We're nearing the end of the cycle. Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":913.58,"end":914.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":914.06,"end":929.55,"speaker":"Fr Stephen De Young","text":"Something is being prepared for. Yeah, Almost there. Stay on target. Poor Porkins. Dead too soon and done wrong by being given the name Porkins. Let me. I know, like, Right. How politically correct is that?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":930.99,"end":932.67,"speaker":"Fr Andrew Stephen Damick","text":"And he's the overweight guy. I mean."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":932.67,"end":933.79,"speaker":"Fr Stephen De Young","text":"Yeah. Like, just."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":933.79,"end":935.15,"speaker":"Fr Andrew Stephen Damick","text":"Come on. George Lucas."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":937.15,"end":940.11,"speaker":"Fr Stephen De Young","text":"I mean, George Lucas is not exactly skinny himself, right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":940.11,"end":940.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":940.35,"end":941.07,"speaker":"Fr Stephen De Young","text":"I mean, this is."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":941.31,"end":943.51,"speaker":"Fr Andrew Stephen Damick","text":"I mean, although back then he was."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":943.51,"end":1042.02,"speaker":"Fr Stephen De Young","text":"Even then he wasn't that skinny, but. Yeah. So there is this. You get to the end of the sixth seven and there is then this anticipation, Right. Of sort of, now we're going to begin this final cycle. Now we're going to bring this to completion. And so you have this sense of preparation and anticipation and something that's about now to happen it. So we'll start now with some examples in the scriptures. So one of the first really prominent uses of 40 happens in Genesis 7 and 8 with the. The flood story. So God, of course, creates the world in Genesis 1 and the first couple verses of chapter two in seven days, right. Really creates it in six. And then rests on the seventh day, he's enthroned. So there is this completion there. Right. But then with the flood, God unmakes the world. So if you read the language of the flood, all of the things that happen in the first three days fall apart. So first, on day three, God had separated the dry land from the water. The flood comes. That is gone right on the second day, God had separated the waters above, like the sky and the waters below the sea."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1042.5,"end":1042.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1042.86,"end":1069.55,"speaker":"Fr Stephen De Young","text":"That separation disappears. Right. The gates of the heavens are open, the gates of the deep are opened and water. And so the world gets uncreated but for the sort of microcosm of the creation that exists within the ark. Noah and his wife and his sons and their wives and the animals."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1069.95,"end":1070.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1071.07,"end":1090.12,"speaker":"Fr Stephen De Young","text":"That little microcosm of creation survives. And the flood goes on for 40 days and 40 nights. And then once the 40 days are completed, now there is this anticipation."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1090.84,"end":1091.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1091.8,"end":1119.24,"speaker":"Fr Stephen De Young","text":"Now the preparation is complete. Now the world is going to be recreated. It's going to begin again with Noah and his family and the animals. The. From the ark. Another example of this from Genesis comes in Genesis 50, verse three. And that is the mummifying of Jacob."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1120.44,"end":1127.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although usually that's not the word. The word you see in most translations, I think it's embalming. Embalm."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1128.2,"end":1133.32,"speaker":"Fr Stephen De Young","text":"But I think. Did you claim mummifying Jacob as a band and. Or album name?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1133.88,"end":1134.72,"speaker":"Fr Andrew Stephen Damick","text":"Oh, absolutely."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1134.72,"end":1136.84,"speaker":"Fr Stephen De Young","text":"During our previous discussion. Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1137.08,"end":1140.28,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah. That's totally my next band. Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1141.72,"end":1144.04,"speaker":"Fr Stephen De Young","text":"Once you break up with that last band, then, well."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1145.96,"end":1149.32,"speaker":"Fr Andrew Stephen Damick","text":"It could be a side project. So, like audio slave."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1149.56,"end":1157.56,"speaker":"Fr Stephen De Young","text":"Yeah, There you go. Actually, Soundgarden broken up at that point and so it Rage against the machine. So complete fail. That was not a side project."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1157.56,"end":1158.2,"speaker":"Fr Andrew Stephen Damick","text":"Makes me very."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1158.2,"end":1217.21,"speaker":"Fr Stephen De Young","text":"A perfect circle side project. Mr. Bungle was a side project. Anyway, so, right, Jacob, Israel, the person has died in Egypt after going there to escape the famine that came on the land of Canaan. But Jacob had his son's promise that he would be buried in Canaan with his fathers, Abraham and Isaac. And so Genesis 53, Jacob is mummified in Egypt so that he can be brought back to Canaan. Right. And this wasn't typical Egyptian mummification in the sense that it didn't serve the same purpose."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1218.09,"end":1235.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It wasn't about, you know, making him alive in some way in the world of the dead, you know, or big, you know, like burial in a. In a big royal tomb or, you know, there is no pyramid of Jacob, you know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1235.17,"end":1238.65,"speaker":"Fr Stephen De Young","text":"Right. It was. It was for the purpose of being able to transport his body."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1239.26,"end":1245.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because you can't, frankly, you can't move bodies over long distances Right. After someone's died and the bodies stay intact."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1245.98,"end":1247.74,"speaker":"Fr Stephen De Young","text":"Right. Unless they're embalmed in some way."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1247.74,"end":1248.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1248.1,"end":1259.66,"speaker":"Fr Stephen De Young","text":"And that's actually. I don't know if, you know, this fun fact, everybody. That's when embalming the whole Embalming industry really took off in the United States was at the end of the civil war."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1260.86,"end":1268.52,"speaker":"Fr Andrew Stephen Damick","text":"No. Because you had to move a lot of bodies. Yeah. From. From the battlefield to where they're going to bury him. Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1271,"end":1298.67,"speaker":"Fr Stephen De Young","text":"But there's this 40 day preparation period. Right. Where his body is prepared to make this final journey to rest with his fathers. Then moving into Exodus, of course, famously, Israel spent 40 years wandering around the Sinai Peninsula. Insert joke about GPS."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1298.91,"end":1299.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1299.31,"end":1310.51,"speaker":"Fr Stephen De Young","text":"But that's not actually why. Of course, the reason why was because of their. Their sin."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1310.75,"end":1315.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, they showed up at the promised land and like, oh, giants."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1315.39,"end":1315.75,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1315.75,"end":1316.99,"speaker":"Fr Andrew Stephen Damick","text":"No, we don't need to obey God."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1317.56,"end":1319.8,"speaker":"Fr Stephen De Young","text":"Hard pass. Yeah, exactly."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1320.2,"end":1323.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay, fine. Your kids are going to get it. Off you go."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1324.12,"end":1353.02,"speaker":"Fr Stephen De Young","text":"Even though it hadn't been spelled out yet, the fact that they were going to wander for 40 years is first mentioned in Exodus 16:35. And so this introduces another element in terms of the 40 day period we've been talking about the anticipation and the preparation. In this case, it's not anticipation and. Or preparation for these people to enter the land. Because they're not going to enter the land."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1353.5,"end":1355.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1355.34,"end":1383.13,"speaker":"Fr Stephen De Young","text":"It is for one generation of these people to die. Right. So there is in view here the idea of atonement for sin. Atonement in what sense? Atonement in the sense that the nation of Israel, which is made up of all of these people, has to be purified of certain wicked members."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1383.69,"end":1387.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, purifying by basically making it."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1387.57,"end":1399.37,"speaker":"Fr Stephen De Young","text":"An intergenerational move shift by letting them die. And this is merciful in the sense that these people got to live out their lives."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1401.43,"end":1401.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1401.83,"end":1414.23,"speaker":"Fr Stephen De Young","text":"With God feeding them and clothing them and caring for them in the wilderness, they got to live out their lives. He didn't have them all killed. He didn't kill them all. The ground didn't open and swallow them all for their sin."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1414.95,"end":1417.19,"speaker":"Fr Andrew Stephen Damick","text":"All actual options in the Old Testament."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1417.19,"end":1421.47,"speaker":"Fr Stephen De Young","text":"Yes. All things that happened in the immediate vicinity in the Torah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1421.47,"end":1421.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1421.99,"end":1512.69,"speaker":"Fr Stephen De Young","text":"Other people who did things. But in this case, Right. They're given this mercy of being able to live out their lives. But the Israelites as a whole have to be purified. And that's what atonement is really about, is about purification. And so they have to be purified by the deaths of these members. But that has now sin and purification in view with this 40 day or with a 40 with the number 40 in this case, probably the. The most important example is the one we're going to talk about next. At least the most important For Lent, for what we're talking about in terms of Lent. Because a lot of the Future references to 40 are going to come back to this one. And that has to do with, with Moses at Mount Sinai. And the number 40 comes up here twice. Because Moses goes up the mountain twice. In the first case, Moses goes up the mountain, he's there for 40 days, he receives, he writes down the book of the covenant, right? He gets the tablets from God."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1513.97,"end":1514.37,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1515.17,"end":1613.79,"speaker":"Fr Stephen De Young","text":"And he comes down and he finds the people with the golden calf. We've talked about that on the show before. We won't go back into detail, but you could go back and listen to our idolatry episode to get all the gory details of what they were actually doing. The tablets are smashed, signifying that they've already broken the covenant that they agreed to. So that first 40 day period is Moses preparing to receive the law, to receive the covenant, to receive the Torah, to deliver the Torah to the people. Right? It has this preparatory element. But now, after all that's been broken, after Moses meets out justice for the golden calf incident, right? We come to this point where God is at the point after the golden calf incident where he says to Moses, you know what, let's just wipe out these folks and we'll start over. Moses, with your descendants, you'll be like the new Abraham, right? We'll just restart this and I'll give you and your seed the land of Canaan, right? You're descended from Abraham. So. And Moses intercedes for the people despite their sin, and he goes back up the mountain and he spends another 40 days. And during this 40 days, in the second visit, Moses does not eat any food or drink any water for the whole 40 days."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1614.03,"end":1616.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes, he fasts. Yeah, he's fasting."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1617.79,"end":1624.95,"speaker":"Fr Stephen De Young","text":"And he's fasting as part of this intercession for the people, for the sins."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1624.95,"end":1627.23,"speaker":"Fr Andrew Stephen Damick","text":"Of the people, prayer and fasting, right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1627.55,"end":1634.91,"speaker":"Fr Stephen De Young","text":"He is essentially repenting for them, right? He's taking actions of repentance for them. He was up on the mountain, he didn't worship the golden calf."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1635.57,"end":1642.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not unlike his brother. He's not implicated in what went on down there at the bottom of the mountain."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1642.13,"end":1772.55,"speaker":"Fr Stephen De Young","text":"Right? But he is on their behalf and he's mind in solidarity with him, hoping they're also fasting and repenting. Right, on their behalf. And what emerges out of that second trip up the mountain is a reassurance of forgiveness. Is God again giving the tablets to Moses and saying, no, this story isn't over. This is going to Continue. Right. And so there is both a preparatory element. Because at that point, it's okay, now leave Mount Sinai, right, and head for Canaan. Right? We're going to do this now. So there's that preparatory anticipatory element, but there's also that element of repentance. In that 40 days, those become connected. And in Deuteronomy, chapter nine, Deuteronomy, the book of Deuteronomy is Moses sort of last lengthy sermon or homily or proclamation, whatever we want to call it, to the people of Israel before his death. And In Deuteronomy, chapter 9, specifically in verses 11 and 18, he mentions these two visits to the top of Mount Sinai. But in that chapter, in general, he's narrating these events and talking about what he did, reminding them of what happened. Because the people he's talking to, the generation that did that, is gone. And he's talking to the next generation and saying, remember, this is what happened. And talking about his own fasting and his own repentance and seeking forgiveness for the people there. So then some more Examples in numbers 1325, and numbers, of course, is everyone's favorite book of the Bible."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1774.71,"end":1776.71,"speaker":"Fr Andrew Stephen Damick","text":"There's some cool stuff hidden in there, people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1777.11,"end":1779.99,"speaker":"Fr Stephen De Young","text":"There is. There is really important stuff in there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1780.15,"end":1781.19,"speaker":"Fr Andrew Stephen Damick","text":"In between the numbers."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1781.43,"end":1782.07,"speaker":"Fr Stephen De Young","text":"In between."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1782.23,"end":1787.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the numbers are important too, but it's not as obvious how and why they're important."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1787.67,"end":1995.6,"speaker":"Fr Stephen De Young","text":"There are chunks of it that are not an easy read, we'll put it that way. So when the spies are sent to go and check out the land of Canaan, they're sent for 40 days, right? 40 days. Again, this is anticipatory. This is preparatory. They're going and seeing what's there as preparation to go in. And so part of the problem there, part of the short circuit there that's identified as sinful. And a real problem is, is that most of the spies come back and say, yeah, we need to call this off. So for them, that preparatory period is not a preparatory period. Right? Because what they were preparing for, they want to call off, they want to abandon. Right? It's only Joshua and Caleb who. Who agree with everything else the other spies reported, but said, no, with God on our side, we got this. So then In Joshua, Joshua 14:7, in particular, Joshua is speaking to the people, and he mentions that when he went as a spy to spy out the land, he was 40 years old. So his life up to that time had sort of prepared him for then. This part he was going to play. We also see this with Moses Age, by the way, Moses lived to be 120, and that's three 40s, the first 40 years of his life, he was living in Pharaoh's household, which was preparatory for the second 40 years of his life when he was living with Jethro, his father in law, and taking care of his herds, which was preparatory for the last 40 years of his life when he led the people out of Egypt. So leading the people of Israel out of Egypt was Moses third act that he started when he was 80. That's when he got down to, you know, what we all remember Moses for. So, but it's these three, these three periods of 40 years in the early part of the Book of Judges. We've talked before about the Book of Judges on this show. There's no more popular topic among listeners to this show than the Book of judges, especially 14 through 16. But. And we've talked about how in Judges, the, the pattern of the Book of Judges is that it's showing this decline, this rather steep decline of religion and morals in Israel to show the necessity of Israel having a king, of a king emerging and specifically of a king from the tribe of Judah, specifically pointing to David. That's how Judges is written. But so the early judges, the first few judges, you're still near the top of the slope, right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1996,"end":1997.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not quite as bad."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":1998.16,"end":2038.47,"speaker":"Fr Stephen De Young","text":"Yeah. And then it's going to roll down from there down the hill. That is a Sisyphus reference. And the great thing about Sisyphus jokes is you could tell them over and over again and they get funnier each time. But Judges, when you look at the first few judges, and you can see this in judges 3, 11, 5, 31 and 8, 28, I'm Jack Van imping it up tonight, just throwing out the references. But you look at those early judges every time they're done with their work judging Israel. And Israel has rest for 40 years."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2041.59,"end":2041.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2042.39,"end":2044.79,"speaker":"Fr Stephen De Young","text":"That's one of the marks that this was a good judge."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2046.39,"end":2046.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2048.71,"end":2089.85,"speaker":"Fr Stephen De Young","text":"Things are going to go more awry later. And speaking of people who judged Israel, 1st Samuel, 4, 18, this is after Eli the high priest has fallen over and died. He was the judge of Israel for 40 years. And if you're reading in first Samuel, you know that Samuel, when he was given by his mother to God, went and stayed with Eli the high priest."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2090.25,"end":2091.45,"speaker":"Fr Andrew Stephen Damick","text":"He becomes his mentor."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2091.85,"end":2113.13,"speaker":"Fr Stephen De Young","text":"Yeah. And so Eli's term is sort of this preparatory period for the prophet Samuel to take over and become the judge of the judge of Israel. When we talked about this earlier, Father Andrew was not Aware of the way in which First Samuel makes fun of Eli."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2114.34,"end":2118.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It's. It's a joke that you can only get if you look at the Hebrew."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2118.82,"end":2125.3,"speaker":"Fr Stephen De Young","text":"Yeah. And once again, maybe this is where George Lucas got the idea, but."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2127.14,"end":2128.18,"speaker":"Fr Andrew Stephen Damick","text":"Sure. Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2128.74,"end":2138.58,"speaker":"Fr Stephen De Young","text":"So Eli, the way he dies is he falls over in his chair and breaks his neck because he is very obese."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2138.82,"end":2142.5,"speaker":"Fr Andrew Stephen Damick","text":"It's. Yeah, it's not a. Not a very dignified ending."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2142.82,"end":2168.9,"speaker":"Fr Stephen De Young","text":"Yes. Because he is quite obese. And so there's a baby born after Eli dies, and the reason he fell over the chair is because he heard that the Ark of the Covenant had been captured. And so after we're told about Eli's death, we're told that this baby is born and is named in English, like in the King James translation, Ichabod."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2169.92,"end":2171.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Like Ichabod Crane."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2172,"end":2196.57,"speaker":"Fr Stephen De Young","text":"Yeah. Which is Ichavod in Hebrew. And we're told that he's named Ichabod because the glory had departed from Israel when the ark was captured. And chavod is indeed a word that means glory, but the root meaning of chavod is heavy or weighty."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2197.05,"end":2201.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thus the phrase the C.S. lewis book, the weight of glory."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2202.09,"end":2202.65,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2202.97,"end":2203.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2203.69,"end":2212.89,"speaker":"Fr Stephen De Young","text":"It's this idea of sort of substance, of heaviness. And so ichavod, in addition to meaning the glory has departed, also means the fat guy's gone."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2215.93,"end":2218.33,"speaker":"Fr Andrew Stephen Damick","text":"Can you imagine? That's his name, Ichabod."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2218.81,"end":2228.06,"speaker":"Fr Stephen De Young","text":"Yeah. After Eli dies. So even the Bible picks on poor."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2228.14,"end":2228.62,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2228.78,"end":2235.98,"speaker":"Fr Stephen De Young","text":"Poor Eli. There are lots of puns and stuff like that in the Hebrew."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2236.3,"end":2236.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2237.34,"end":2271.99,"speaker":"Fr Stephen De Young","text":"That don't get carried over well into English. And so the English Bible, way less fun takeaway for tonight. So later in First Samuel, when Goliath is coming out with the Philistine army and cutting promos on Saul and the Israelite army, issuing his challenge for someone to fight him, he does that for 40 days."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2274.56,"end":2274.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2277.36,"end":2301.53,"speaker":"Fr Stephen De Young","text":"Why is that so significant? Right. Well, the way this functions in the telling of the story, when you drop in that detail of him, this going on for 40 days, or 42, or roughly 40. Right. This goes on for 40 days. That's again, setting up this expectation, setting up this sense of anticipation."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2302.49,"end":2302.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2302.93,"end":2306.25,"speaker":"Fr Stephen De Young","text":"He did it for 40 days. Oh. Something very important is about to happen then."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2306.33,"end":2310.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Something's coming. That's what the 40 is an indication of."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2310.65,"end":2351.84,"speaker":"Fr Stephen De Young","text":"And that something, in this case is David. And then David, once he becomes king, he's going to reign as king for 40 years. His son Solomon is going to reign for 40 years. That's not just important in terms of the parallel with the judges. Right. So the judges, having granted that rest, that peace for 40 years. Right. It's still anticipatory because within the book of Judges, the early judges, the good judges, are pointing to what the king who comes is going to be like in a positive way."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2352.33,"end":2352.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2352.65,"end":2358.97,"speaker":"Fr Stephen De Young","text":"In an anticipatory way. The later judges are going to also show us what the king is going to be like, but in a reverse."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2358.97,"end":2362.33,"speaker":"Fr Andrew Stephen Damick","text":"Way, be like anybody but these guys."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2362.33,"end":2365.85,"speaker":"Fr Stephen De Young","text":"Yeah. He's not going to be like this. He's going to be like the opposite of this. Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2365.85,"end":2366.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2369.05,"end":2391.94,"speaker":"Fr Stephen De Young","text":"So in the same way, Right. Even now that we have David and even now that we have his son Solomon, the fact that they reign for 40 years. Right. That it's six sevens, not seven, it's not 49 years, it's 40 years, shows that even their reigns are anticipatory of something else."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2392.18,"end":2397.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're pointing beyond. It's not, oh, finally, David is here. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2398.02,"end":2458.97,"speaker":"Fr Stephen De Young","text":"And this is part of how the idea of the Davidic Messiah develops. Right. Because you could read the covenant with David in 2 Samuel, I believe, 2 Samuel 7, you could read that covenant with David as just, oh, one of your sons will sit on the throne forever. Right. So just your dynasty isn't going to have an end period. Right. But when you bring in this idea of him reigning for 40 years, there's this idea of incompletion, but also anticipation. So it's not just that the line of David is not going to have an end, it's just going to be a line shooting off into infinity, but that it is going to culminate. The line of David is leading somewhere and is going to culminate with someone."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2461.34,"end":2461.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2462.94,"end":2539.14,"speaker":"Fr Stephen De Young","text":"That's part and parcel of the Messianism. And this understanding of the number 40 is part of how that comes into Jewish tradition later in reflection on David and on Solomon and on David's line in 1 Kings 19:8. This is where the prophet Elijah, St. Elias, had his big victory at Mount Carmel over the prophets of Baal and then falls into this kind of isolated depression where he says to God, you know, there's no one left but me, who still serves you. Why don't you just go ahead and kill me? We'll call it a day. Right? And God, of course, talks to him about the faithful remnant that he has preserved at that time and at all times. But then he goes further than that and he has the prophet Elijah clean himself up, wash himself up, eat a little food, take this journey of 40 days."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2540.82,"end":2544.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. With with food. That lasts for 40 days too, as I recall."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2546.02,"end":2619.41,"speaker":"Fr Stephen De Young","text":"Yeah. To take this journey for 40 days. Because at the end of that journey, God is going to reveal himself to the prophet. And then it's at the end of that 40 day journey that he has that experience where there's the fire, and God's not in the fire, and there's the earthquake, and God's not in the earthquake, and then there's the. In the King James, the still small voice. Right. The quiet. Right. And that's the place where he encounters God. But there is this preparatory period, and this is deliberately set up with the prophet Elijah to make us think back to Moses and the 40 days on the mountain before this encounter. But he's preparing to meet God, and there's this preparatory period in Jonah. You could look, for example, in Jonah 3, 4, where Jonah is finally preaching in Nineveh after finally getting there. And Jonah's preaching, remember, is in 40 days, the city's toast. Right. Nineveh will be overthrown."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2619.41,"end":2622.6,"speaker":"Fr Andrew Stephen Damick","text":"Overthrown, yes. Yes. Toast is good, though."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2622.6,"end":2622.96,"speaker":"Announcer","text":"I mean."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2623.12,"end":2627.88,"speaker":"Fr Stephen De Young","text":"Yeah. Well, I mean, what does overthrown really mean? Like, tossed? Like what? You know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2627.88,"end":2628.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2628.88,"end":2630.48,"speaker":"Fr Stephen De Young","text":"The city's done for in 40 days."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2630.48,"end":2635.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it doesn't. And it doesn't say exactly how God's going to pull that off either, you know?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2635.04,"end":2635.28,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2635.28,"end":2635.48,"speaker":"Fr Andrew Stephen Damick","text":"He could."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2635.48,"end":2636.72,"speaker":"Fr Stephen De Young","text":"Sodom and fire from heaven."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2636.72,"end":2639.52,"speaker":"Fr Andrew Stephen Damick","text":"Like Sodom and Gomorrah could be, you know, invasion."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2640.08,"end":2640.48,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2640.48,"end":2649.61,"speaker":"Fr Andrew Stephen Damick","text":"Earthquake. Yeah, yeah. Flood, fire. The sword, gnats, pestilence, bugs, rats. So."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2649.61,"end":2663.97,"speaker":"Fr Stephen De Young","text":"But they have 40 days. They have 40 days. And people may want to point out. Right. That Jonah doesn't actually tell them to repent. And we know from reading the book of Jonah, that's because Jonah didn't want them to repent."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2665.09,"end":2668.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He wanted them to be overthrown."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2668.13,"end":2683.41,"speaker":"Fr Stephen De Young","text":"He was looking forward to the fireworks, and so he didn't say that. But the very fact that God sent him there before the fact to announce it implies the possibility of repentance."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2685.89,"end":2686.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2687.73,"end":2693.49,"speaker":"Fr Stephen De Young","text":"If they were really at the point where God was just going to destroy them, why warn them?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2693.81,"end":2696.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2697.49,"end":2709.57,"speaker":"Fr Stephen De Young","text":"Right. Sodom and Gomorrah didn't get a warning. God sent the angels in to get Lot and his family out before it happened, but they didn't go around warning the people of Sodom and Gomorrah what was coming."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2709.97,"end":2711.97,"speaker":"Fr Andrew Stephen Damick","text":"It's crazy that even Ahab got a warning."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2712.45,"end":2713.01,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2714.45,"end":2718.05,"speaker":"Fr Andrew Stephen Damick","text":"It's almost like he's super merciful. Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2718.29,"end":2721.89,"speaker":"Fr Stephen De Young","text":"But so Nineveh. Well, if you know anything about The Assyrians."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2722.77,"end":2726.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, they're pretty bad."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2726.09,"end":2726.45,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2727.01,"end":2727.41,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2727.73,"end":2741.79,"speaker":"Fr Stephen De Young","text":"But they're given this 40 days of warning, and so they use that 40 days to repent. They spend that 40 days repenting, much to Jonah's consternation."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2742.51,"end":2743.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2743.95,"end":2759.08,"speaker":"Fr Stephen De Young","text":"Jonah ends up telling God, I knew. I know what kind of God you are. I knew if they repented, you'd let them off the hook. Right. But. So there's 40 day period. Again, this is that repentance element."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2759.48,"end":2759.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2763.4,"end":2777.8,"speaker":"Fr Stephen De Young","text":"Then jumping to the New Testament, right? Matthew, in St. Matthew's gospel, he. He structures his genealogy around three sets of 14 generations."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2777.96,"end":2780.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you get 42."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2780.92,"end":2809.11,"speaker":"Fr Stephen De Young","text":"Right. And there's ready as 14 generations from Abraham to David, 14 generations from David to the exile. 14 generations from the exile to the birth of Jesus. And if you go through those genealogies, you see that in order to get those three sets of 14, St. Matthew has to play a little fast and loose with the Old Testament genealogies."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2809.75,"end":2814.95,"speaker":"Fr Andrew Stephen Damick","text":"There's a few guys he skips, but I mean, they're pretty skippable if you look at who he skips."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2815.27,"end":2817.81,"speaker":"Fr Stephen De Young","text":"But also he's deliberately got these numbers in mind."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2817.89,"end":2820.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because he wants to present a 42."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2820.37,"end":2831.81,"speaker":"Fr Stephen De Young","text":"Yeah. And so, yeah, he finds the most skippable people to skip. But. So why does he do that?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2833.17,"end":2833.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2833.65,"end":2846.06,"speaker":"Fr Stephen De Young","text":"Well, again, contrary to the modernist literal reading of the Bible, he's not trying to give an exact genealogical account."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2846.38,"end":2848.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not trying to pull a fast one on anybody."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2848.62,"end":2884.31,"speaker":"Fr Stephen De Young","text":"Right. No, no. He's mentioning the specific people he mentions for various reasons. And he set up this set of six sevens, right. 42. Preparation. Building up to something. Anticipation. It's all leading up to the birth of Jesus. Right. Everything from Abraham is building up to the birth of Jesus. Everything from King David is building up to the birth of Jesus. Everything from the return from the Babylonian exile is building up to the birth of Jesus. That's the point he's making."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2884.47,"end":2897.27,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of dramatic tension throughout the whole Old Testament. If you look for all the 40s, which we have been doing. Yeah, yeah, yeah. Like something's coming. Something's coming. Okay. Still something is coming. Oh, by the way, something is coming."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2897.74,"end":2898.06,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2898.38,"end":2899.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2899.98,"end":2904.22,"speaker":"Fr Stephen De Young","text":"And in many cases, based on what's coming, you probably should be repenting. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2904.22,"end":2904.62,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2906.14,"end":2933.02,"speaker":"Fr Stephen De Young","text":"Yeah. One of the most famous, in fact, if I, if I think if we asked the average churchgoer what's an example of something that, that goes on for 40 days and 40 nights in the Bible, probably the most common answer we'd get would be about Christ fasting in the wilderness, in the desert, maybe after the flood."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2933.42,"end":2939.14,"speaker":"Fr Andrew Stephen Damick","text":"I think if you say 40 days and 40 nights, probably at least the people who know the Old Testament a little bit would probably."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2939.14,"end":2961.3,"speaker":"Fr Stephen De Young","text":"I think more people know the New Testament than the Old Testament, frankly, among average churchgoers, I want to believe. And so you can find this in Matthew 4:2, Mark 1:13, Luke 4. 2. Thanks, Rexella. Where it mentions the 40 days and 40 nights."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2961.3,"end":2961.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":2962.58,"end":3000.3,"speaker":"Fr Stephen De Young","text":"And we talked a little bit in the last episode about how on one level, Christ is here sort of recapitulating the experience of Israel. Israel spent 40 years in the wilderness. They spent it there grumbling and complaining about things like food. Right. Christ faced these same tests in the wilderness. Christ succeeds where they failed. But this is also a callback to Moses, right? This is also a callback to Moses, specifically him fasting from fruit and water on the mountain."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3000.78,"end":3001.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3001.98,"end":3042.14,"speaker":"Fr Stephen De Young","text":"How so? Well, this is telling us something about what Jesus is about to do, because when we talked about Theophany, we mentioned all this language of the Jordan river parting and splitting and turning back, right? Which, as we were pointing out, did not literally happen at the point when Christ was baptized, because if it had, he wouldn't have actually gotten baptized because he wouldn't have gotten wet. But that, that language in our hymns and readings and that kind of thing was intended to help us connect that event of Jesus baptism in the Jordan."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3042.46,"end":3042.86,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3045.18,"end":3117.3,"speaker":"Fr Stephen De Young","text":"The Jordan parting in front of the Israelites with Joshua when they came in to conquer the land, and how part of what's going on in Theophany is that with his baptism, Jesus is entering the land to take it back to sort of a reconquista of. Of the land. But this fasting period, which is in each case directly associated in the Gospel narrative with his baptism, tells us something about how he is going to retake Israel. Meaning what some of at least some of the Judeans were would have been expecting Jesus to do as the Messiah would have been all Those people who St. John the 400 just baptized, he's going to gather them up and turn them into an army and go start killing Romans and Jewish collaborators while he's at it. Right? That. That would have been one view, Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3117.3,"end":3117.74,"speaker":"Fr Andrew Stephen Damick","text":"Clean out."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3117.74,"end":3171.58,"speaker":"Fr Stephen De Young","text":"Yes. He's going to retake the land by killing the Gentiles, taking out the enemies of the people. But what this shows us, this callback to Moses that second time on Mount Sinai, not eating or drinking anything for 40 days. Right. Why did he do that? Why Was he up there? He was repenting for the sins of the people, sins he didn't participate in personally, but repenting for their sins. And so that shows us that this retaking of Israel that Christ is about to do is going to have a very different mode than it did under Joshua than anything you read about in First Maccabees."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3172.06,"end":3172.3,"speaker":"Announcer","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3172.7,"end":3175.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is like Moses. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3176.3,"end":3193.74,"speaker":"Fr Stephen De Young","text":"Like the prophets, he's going to come and he's going to bring the forgiveness of sins to these people. Not just the Israelites who are otherwise righteous, not just the collaborators, the tax collectors. Right. The sinners. But even to the Romans."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3196.54,"end":3196.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3196.9,"end":3219.59,"speaker":"Fr Stephen De Young","text":"Even to the hated Romans, he was going to bring the possibility of forgiveness of sins another 40 days. If we didn't say 40 days and 40 nights, if we just said 40 days, probably an answer that would be high up the list would be the time from Christ's resurrection to his ascension among churchgoers."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3219.99,"end":3220.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3222.15,"end":3232,"speaker":"Fr Stephen De Young","text":"Christ's ascension is 40 days after his resurrection. During that period of time, he is appearing to people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3232.72,"end":3233.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3234,"end":3278.95,"speaker":"Fr Stephen De Young","text":"But that it's 40 days again tells us something. Right? It tells us something. It tells us there's some kind of anticipatory element, that there's something more coming. And we're going to end up talking about this more our second and third halves tonight. But Christ's resurrection itself, even the ascension itself, is anticipatory of something else that is coming. And then just to sort of round out our tour through the Bible with the number 40, so we could say we went from Genesee to revelation."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3282.28,"end":3282.52,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3282.6,"end":3292.92,"speaker":"Fr Stephen De Young","text":"Revelation 11, 2 and 13, verse 5. The period of time where the Antichrist has power, the beast has power, is 42 months."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3295.96,"end":3301.64,"speaker":"Fr Andrew Stephen Damick","text":"Sitting here counting how many verses we've looked at and hoping it's 42. But I don't think it is."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3304.2,"end":3307.77,"speaker":"Fr Stephen De Young","text":"We could round a little bit. We could, you know, have to be precise."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3307.93,"end":3311.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. 36, you know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3313.53,"end":3318.81,"speaker":"Fr Stephen De Young","text":"Right. And so again, that's anticipatory of what's going to come after. Right. And the end."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3319.13,"end":3319.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3319.49,"end":3337.34,"speaker":"Fr Stephen De Young","text":"Of that rule that it is not the ultimate right rule or authority. So we've gone through all these stories in the Bible, all these verses, all these passages. What does it all mean? Seriously, Colin, with your ideas."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3337.34,"end":3341.3,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no. Yeah. Because otherwise I get to just go home today."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3341.62,"end":3417.48,"speaker":"Fr Stephen De Young","text":"Yeah. So the key thing here is what we've seen from all these examples, hopefully, is a couple of themes emerging. Number 1, 40, 40 days being emblematic in the Scriptures for a period of preparation, of anticipation of something coming, something happening, and then in addition to that, related to that is this idea of 40 days as a period of repentance, often connected directly with fasting as a means of repentance, a discipline of repentance, and that these ideas and elements are sort of mixed together around the idea of 40 days in the scriptures. And so when we come back in the second half, we're going to start talking about how this connects to the idea of baptism beyond what we've already talked about."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3418.36,"end":3422.52,"speaker":"Fr Andrew Stephen Damick","text":"Man. Spoilers usually don't give big spoilers like that at the end of the first test."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3422.92,"end":3427.64,"speaker":"Fr Stephen De Young","text":"Well, I want to keep them. I want to keep them around. They might have been tempted to wander off somewhere."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3428.12,"end":3428.68,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3429.32,"end":3430.2,"speaker":"Fr Stephen De Young","text":"Change that channel."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3430.84,"end":3431.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3432.04,"end":3435.16,"speaker":"Fr Stephen De Young","text":"We're about to go to a commercial break. People flip channels during commercials."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3435.24,"end":3446.51,"speaker":"Fr Andrew Stephen Damick","text":"Don't adjust that dial. Yeah, no, this is actually this first commercial is going to be big announcements. So, yeah, we're gonna go ahead and take our first break, and we'll be right back with the second half of Lord of Spirits."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3447.15,"end":3463.47,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3486.52,"end":3516.11,"speaker":"Fr Andrew Stephen Damick","text":"Blessed are the legend makers with their rhyme of things not found within recorded time. J.R.R. tolkien. Since the very dawn of humanity, myth, legend and story have communicated history, meaning, identity, and the highest truths about the world, both seen and unseen."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3517.39,"end":3524.42,"speaker":"Fr Stephen De Young","text":"Who are we as human beings? Who is God? What is the true shape of our great cosmos?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3524.74,"end":3526.94,"speaker":"Fr Andrew Stephen Damick","text":"Who are the gods, the heroes, the."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3526.94,"end":3529.94,"speaker":"Fr Stephen De Young","text":"Monsters, the angels, the demons, the spirits."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3530.26,"end":3555.23,"speaker":"Fr Andrew Stephen Damick","text":"That inhabit and touch our world? Both in ancient Israel and from when the Christian church arose in the first century, continuing to our own day, the people of God have not only told their own tales, but but also recorded, preserved, rewritten, commented on, and found edification in the great epic tales of the pagan nations."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3556.83,"end":3558.71,"speaker":"Fr Stephen De Young","text":"No less a church Father than St."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3558.71,"end":3562.51,"speaker":"Fr Andrew Stephen Damick","text":"Basil the Great said that the prophet Moses studied Egyptian learning."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3563.07,"end":3570.51,"speaker":"Fr Stephen De Young","text":"The prophet Daniel studied Chaldean lore, and he demonstrated his own extensive familiarity with Greek paganism."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3571.22,"end":3573.42,"speaker":"Fr Andrew Stephen Damick","text":"Through this, he said, we can trace."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3573.42,"end":3576.74,"speaker":"Fr Stephen De Young","text":"The silhouette of virtue in the works of paganism."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3578.18,"end":3584.9,"speaker":"Fr Andrew Stephen Damick","text":"Have you ever wondered why the ancient myths and legends survived when their religions died out centuries before?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3585.54,"end":3587.94,"speaker":"Fr Stephen De Young","text":"Or what shaped Christian monster lore?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3588.18,"end":3615.23,"speaker":"Fr Andrew Stephen Damick","text":"Or why Saint Paul quoted pagan Greek authors? Or why the legend of King Arthur keeps being revived? I'm Father Andrew Stephen Damick. And I'm Richard Roland. In this video podcast, we'll read the Myths. We'll recount the legends and we'll ask how they point us in one way or another to the most high God and to his son, Jesus Christ."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3617.47,"end":3620.03,"speaker":"Fr Stephen De Young","text":"Welcome to the great tales."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3624.74,"end":3638.74,"speaker":"Fr Andrew Stephen Damick","text":"Coming fall 2024 from Ancient Faith Radio. Subscribe now on YouTube or wherever you get podcasts."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3642.9,"end":3659.02,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3660.62,"end":3666.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Longest commercial ever. Pretty sure Father Stephen went out for Kane's Chicken. Did you get me any?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3667.26,"end":3673.5,"speaker":"Fr Stephen De Young","text":"No. And I still can't believe you're unilaterally canceling Lord of Spirits to do that shit with that Rick Roll guy."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3676.26,"end":3685.22,"speaker":"Fr Andrew Stephen Damick","text":"I know. I've had all these. Yes. People are excited. People get excited when we talk about canceling podcasts."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3685.38,"end":3685.94,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3688.66,"end":3689.3,"speaker":"Fr Andrew Stephen Damick","text":"Now the room."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3689.46,"end":3693.06,"speaker":"Fr Stephen De Young","text":"Let that sit out there. That's amazing, man. You're going to get some emails."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3693.22,"end":3700.42,"speaker":"Fr Andrew Stephen Damick","text":"Oh, totally. Yeah. People just have to check, you know, in two weeks, like, is there another episode coming, you guys?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3700.42,"end":3707.08,"speaker":"Fr Stephen De Young","text":"Or like, I want to keep doing it, but you're like, no, no, I'm done. I want to hang out with Ricky Rahal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3707.08,"end":3708.76,"speaker":"Fr Andrew Stephen Damick","text":"I'm going to cancel you before you."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3708.76,"end":3711.28,"speaker":"Fr Stephen De Young","text":"Cancel me, if that is his real name."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3713.36,"end":3755.24,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah, it's Richard Roland. Who. I mean, the world's only living Rick Roll. I mean, he's an actual Rick Roll. Like, his parents made him into that, which, I mean, that's incredible. Yeah, yeah, yeah. All right. Well, anyway, welcome back, everybody. So the first half, we talked about the number 40 and showed the many places that it shows up in both the Old especially and New Testaments and that 40s and 42s designate preparation for something coming and also are associated in many cases with fasting and repentance and forgiveness of sins. So. All right, so what are we doing this half, Father?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3756.6,"end":3757.32,"speaker":"Fr Stephen De Young","text":"I forget."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3757.72,"end":3758.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3758.52,"end":3759.08,"speaker":"Fr Stephen De Young","text":"Oh, no."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3759.24,"end":3760.12,"speaker":"Fr Andrew Stephen Damick","text":"Good night. So."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3762.12,"end":3765.12,"speaker":"Fr Stephen De Young","text":"I mean, that was a long commercial. Like, it was."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3765.12,"end":3766.04,"speaker":"Fr Andrew Stephen Damick","text":"Longest one ever."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3766.12,"end":3774.12,"speaker":"Fr Stephen De Young","text":"Yeah. Like, I wrote a book and got a master's degree during that commercial, as one does. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3776.04,"end":3776.44,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3777.16,"end":3837.3,"speaker":"Fr Stephen De Young","text":"Right. So now we're moving on, as mentioned, to talk about how this relates to baptism and how repentance relates to baptism, or at least the fact that it does. Right. Is probably fairly obvious to people when we first encounter baptism as such in the New Testament. And if you want more on this, you can go back to our baptism episode in terms of the difference between baptism as such and Jewish ritual, washings in general. Right. When we first encounter baptism as such, it's St. John the Forerunner, St. John the Baptist, or St. John the Baptizer, as I see people liking to put now, just because they can't bear to use the term Baptist."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3837.3,"end":3839.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They don't want me be a Baptist."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3841.66,"end":3846.22,"speaker":"Fr Stephen De Young","text":"We're looking out for you, our Baptist friends. We'll still call him St. John the Baptist sometimes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3847.26,"end":3850.06,"speaker":"Fr Andrew Stephen Damick","text":"We're not St. John the Presbyterian, I'll tell you what."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3850.3,"end":3863.03,"speaker":"Fr Stephen De Young","text":"Yeah. Or Methodist, for that matter. So it's with St. John, and we're explicitly told right off the bat, like in Mark 1, verse 4."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3864.39,"end":3864.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3864.75,"end":3869.35,"speaker":"Fr Stephen De Young","text":"That John comes. He's preaching a baptism of repentance and the forgiveness of sins."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3869.51,"end":3869.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3870.23,"end":3991.16,"speaker":"Fr Stephen De Young","text":"Like in those words, that's what his baptism is all about. Baptism is all about repentance and the forgiveness of sins. They say the people went down into the water confessing their sins. Right. Publicly, he's baptizing sort of notorious sinners, which is why a lot of the Pharisees aren't happy about it or at least accept themselves from it, because they are not notorious sinners in their minds at least. And so they are not like those people. But that is. That is what. What baptism is, is all about. What when. And of course, there's an obvious. Pretty obvious. When you're reading any of the Gospels, presentation of what St. John is doing as preparatory, as leading to something else. Right. It is everywhere the Gospel is presented as. This is leading up to Jesus appearing on the scene, being baptized by St. John Christ, then having his ministry. Right. And the Gospels go from there. So that's obvious. Preparatory element, calling him St. John the Forerunner kind of emphasizes that preparatory element. But this isn't just something that the Gospel writers do. And it's important to say this because the presentation you get from, even to this day, from most New Testament scholarship, tries to present St. John, the historical St. John. Right. As a rival of the historical Jesus. This is what they're going to try and sell you on. And they're going to point to the Mandians, which are a small, obscure cult. Gnostic."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3991.16,"end":3992.12,"speaker":"Fr Andrew Stephen Damick","text":"Really obscure."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":3992.28,"end":4024.25,"speaker":"Fr Stephen De Young","text":"Yeah. Small, obscure Gnostic cult that held that. That St. John was the Messiah and hold that out as evidence of something in the first century and say. Yeah. And so they're going to say that what the gospels say about St. John is revisionist history. That they're sort of making up these stories where St. John was like, oh, no, no, not me, him. Right. To try and persuade people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4024.65,"end":4025.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4025.01,"end":4028.01,"speaker":"Fr Stephen De Young","text":"To. To follow Jesus instead."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4028.17,"end":4028.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4030.01,"end":4040.81,"speaker":"Fr Stephen De Young","text":"Excuse me. So all that is of course, bunkum. Right. There is, There is no basis for that other than just a hermeneutic of suspicion."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4041.69,"end":4053.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And I think the Mandeans, I mean, it's been a long time since I researched them, although merchandising moment. They are mentioned in the 2017 edition of Orthodoxy and Heterodoxy."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4055.62,"end":4057.14,"speaker":"Fr Stephen De Young","text":"Shameless self promotion department."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4057.14,"end":4076.08,"speaker":"Fr Andrew Stephen Damick","text":"There you go. I mean, if I'm the Stan Lee of Orthodoxy online, then Excelsior. Yeah. I mean, the Mandeans, as far as I recall, like the. I think some of the earliest mentions of them that are, that anyone knows of is like medieval. I mean, it's, it's not that far back, honestly."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4076.4,"end":4083.2,"speaker":"Fr Stephen De Young","text":"Yeah. And there are also gnostic sects that had like Hercules as the Messiah and stuff."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4083.2,"end":4085.84,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, there's all kinds of fun stuff."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4086.08,"end":4128.56,"speaker":"Fr Stephen De Young","text":"I suppose this means the historical Hercules anyway. Right. But there is of course this hermeneutic of suspicion, the practice of which was very popular in the latter half of the 20th century especially. I think people are starting. But that may be wishful thinking on my part that people are collectively starting to get away from it now. But I see a trend of people starting to get away from it now. Which is just to say what I mean by hermeneutic of suspicion is that when you read the text of scripture, you assume that the person writing it has some kind of agenda."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4129.08,"end":4132,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're lying to you or trying to manipulate you in some way."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4132,"end":4137.64,"speaker":"Fr Stephen De Young","text":"Right. Well, even if they're not outright lying, they have a goal. And that is I need to convince you of X. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4137.8,"end":4145.16,"speaker":"Fr Andrew Stephen Damick","text":"I can't remember where it was, but I think it was CS Lewis who said something like, if you see through everything, then you're actually seeing nothing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4146.04,"end":4146.6,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4146.6,"end":4147.64,"speaker":"Fr Andrew Stephen Damick","text":"Which I like that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4148.2,"end":4151.96,"speaker":"Fr Stephen De Young","text":"Yeah. It's like if Superman's X ray vision went crazy, he couldn't see anything."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4152.76,"end":4154.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4155.06,"end":4181.54,"speaker":"Fr Stephen De Young","text":"Whereas. So there's. There's this story, this, this great Superman story where the Joker like kidnaps Lois Lane and Perry White and Jimmy Olsen and he says, ah, I'm gonna hide them in lead lined cassette cast caskets so Superman can't find them. But see, that's dumb because like when Superman turns on his X ray vision, he can't see through lead, so that's like the only thing he can't see."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4183.82,"end":4184.98,"speaker":"Fr Andrew Stephen Damick","text":"But he can pull it apart with."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4184.98,"end":4189.9,"speaker":"Fr Stephen De Young","text":"His super strength, so he finds them very quickly."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4190.14,"end":4190.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4190.54,"end":4190.86,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4191.9,"end":4196.18,"speaker":"Fr Andrew Stephen Damick","text":"Curses. We actually do have a caller, by the way, who has questions."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4196.18,"end":4197.42,"speaker":"Fr Stephen De Young","text":"I hope it's not about that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4198.06,"end":4211.01,"speaker":"Fr Andrew Stephen Damick","text":"No, no, it's. I mean, I'm trying to figure out. So this is Nathaniel, who's here in Pennsylvania. I am trying to figure out if Nathaniel's question is a Douglas Adams reference. So Doug."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4211.49,"end":4214.21,"speaker":"Fr Stephen De Young","text":"I hope so, Douglas. I hope so."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4214.45,"end":4219.89,"speaker":"Fr Andrew Stephen Damick","text":"So, Nathaniel, are you there? I mean, are you. Is this Hitchhiker's Guide to the Galaxy kind of thing or."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4221.09,"end":4223.33,"speaker":"Nathaniel","text":"Yeah. Good evening, fathers. Father's bless."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4223.65,"end":4225.01,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. God bless you."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4226.93,"end":4237.09,"speaker":"Nathaniel","text":"And I'm actually hailing not from Pennsylvania, unfortunately, but neighboring cbn, so extra blessings are needed down here."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4238.23,"end":4240.47,"speaker":"Fr Andrew Stephen Damick","text":"Well, your phone is from Pennsylvania. I'll just say that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4240.87,"end":4251.67,"speaker":"Nathaniel","text":"Yeah, yeah. Phone is from Pennsylvania, that's for sure. Yeah, I guess I'll start with Douglas Adams reference. In light of the first half."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4253.43,"end":4253.79,"speaker":"Fr Andrew Stephen Damick","text":"Can."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4253.79,"end":4258.63,"speaker":"Nathaniel","text":"We determine what the meaning of life is? And that is 42."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4260.39,"end":4272.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, to me it seems like Douglas Adams doesn't know everything we just said in the first half. In fact, that's the meaning that would. That, you know, the 40, 42 is our preparation or."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4272.91,"end":4281.39,"speaker":"Fr Stephen De Young","text":"Or is the answer being 42 preparatory to the finding of the question."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4284.67,"end":4287.39,"speaker":"Nathaniel","text":"There it is. Awesome."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4287.55,"end":4296.74,"speaker":"Fr Andrew Stephen Damick","text":"Wibbly, wobbly, timey wimey stuff to bring it. Okay, thank you. Yes. I think you had a more serious question along with that one."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4297.94,"end":4300.26,"speaker":"Fr Stephen De Young","text":"No, one question per person. Thanks, Nathaniel."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4301.22,"end":4307.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, gosh, man, you wasted it 6 billion years or whatever."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4311.14,"end":4332.12,"speaker":"Nathaniel","text":"So the other question had to do with the number seven, naturally. And that is why the number of heavenly bodies is used as the number for fulfillment. Or maybe better put, why the number of the divine council uses the number to symbolize fulfillment."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4335.32,"end":4337.8,"speaker":"Fr Andrew Stephen Damick","text":"I think I know what you're saying, but I'm going to just go ahead and punt."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4338.68,"end":4342.93,"speaker":"Fr Stephen De Young","text":"Well, yeah, the number of the vine council is 70 or 72, right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4343.41,"end":4347.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, because of the nations. The number of the nations. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4347.89,"end":4402.32,"speaker":"Fr Stephen De Young","text":"Well, it actually goes the other way, but yeah, yeah, so. So I mean, those are related, obviously. 70 and seven, right? You have seven tens and then seven. And if you look at. So cuneiform doesn't really have numerals either. You didn't know this is where this was going to go. But cuneiform writes, when you look at like a. A barter list or a trade document that's in cuneiform on a clay tablet. The way they do numbers is not with letters because it's pictographic. So they put like hash marks. They don't cross at five."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4403.92,"end":4404.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4404.32,"end":4414.88,"speaker":"Fr Stephen De Young","text":"You know what I mean by hash marks? Right. You do 1, 2, 3, 4, and then you do the fifth one across. They don't go across at five. So it's just like hash, tally marks. Right. All the way across. There could be 12 of them, 50 of them."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4414.96,"end":4417.6,"speaker":"Nathaniel","text":"Right, but they're all working on prison time."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4417.84,"end":4423.52,"speaker":"Fr Stephen De Young","text":"Yeah. Marking on the wall, that's ones and then tens were circles."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4427.28,"end":4427.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4428.24,"end":4438.4,"speaker":"Fr Stephen De Young","text":"So on a cuneiform tablet, 7 of something would be 7 hash marks, 70 of something would be 7 circles."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4442.64,"end":4443.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4443.6,"end":4449.76,"speaker":"Fr Stephen De Young","text":"So the way these were written. Right. And expressed and the way things were counted."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4450.55,"end":4450.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4451.19,"end":4480.87,"speaker":"Fr Stephen De Young","text":"Made a tight connection between those two things. So I think if you asked an ancient person, like, why seven for the heavenly bodies rather than 70 for the gods, they would say some version of porque no los dos in Akkadian. They would not see why there needed to be an or there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4482.71,"end":4483.27,"speaker":"Nathaniel","text":"I see."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4485.19,"end":4485.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4487.67,"end":4489.51,"speaker":"Nathaniel","text":"So whenever I hear seven rings."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4492.39,"end":4492.95,"speaker":"Fr Stephen De Young","text":"That'S."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4493.91,"end":4495.99,"speaker":"Fr Andrew Stephen Damick","text":"For the Dwarf Lords and their halls of stone."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4496.95,"end":4504.07,"speaker":"Nathaniel","text":"That or Marvel's Seven Rings movie. Oh, but preferably the seven Rings."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4504.7,"end":4507.02,"speaker":"Fr Stephen De Young","text":"That's ten. The Mandarin has ten rings, my friend."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4509.26,"end":4511.94,"speaker":"Nathaniel","text":"I'm not cut up on my Marvel lore."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4511.94,"end":4512.58,"speaker":"Fr Andrew Stephen Damick","text":"Busted."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4512.58,"end":4519.74,"speaker":"Fr Stephen De Young","text":"See, I thought you were referring to the legend of the seven rings, which is digging in the crates. Tabletop gaming. Right there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4522.86,"end":4525.34,"speaker":"Nathaniel","text":"I'll take my dwarven rings over that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4526.06,"end":4530.31,"speaker":"Fr Andrew Stephen Damick","text":"Although some of them were consumed by dragons, so just."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4530.79,"end":4534.47,"speaker":"Nathaniel","text":"I mean, we'll just consider. We'll just consider that. All them fallen."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4534.71,"end":4547.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay. There you go. All right, Well, I hope that helps. Yeah. All right, good night. Thank you. Okay. Well, that went in all kinds of fun places."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4548.15,"end":4548.63,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4549.27,"end":4549.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4552.31,"end":4554.63,"speaker":"Fr Stephen De Young","text":"Doesn't know how many rings the Mandarin has, though. That's."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4555.6,"end":4556,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4556.32,"end":4556.76,"speaker":"Fr Stephen De Young","text":"Crime."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4556.76,"end":4558.48,"speaker":"Fr Andrew Stephen Damick","text":"And Y. Pete, Total amateur."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4558.88,"end":4578.16,"speaker":"Fr Stephen De Young","text":"Yeah. Next thing you're telling me a beholder has seven eyestalks, so. Right, so we're talking about how St. John's baptism kind of had both elements that we were talking about with 40. It had this preparatory element."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4578.88,"end":4579.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4579.44,"end":4766.74,"speaker":"Fr Stephen De Young","text":"And obviously it's a baptism of repentance. But for example, St. Paul in Acts 19, verse 4, which is one of his defenses when he's on trial, he talks about St. John baptizing and how that was preparatory to the coming of Christ. Which is further evidence, by the way, that this is part of the apostolic preaching and not the product of some kind of historical rewrite that. That we should be suspicious of. But there's also this contrast made by St. John himself between the baptism that he's performing in the Jordan river and the baptism that the Messiah, the Christ who is coming, is going to perform. And you could see that, for example, in Matthew 3:11, Mark 1, verse 8, Luke 3:16, order your VHS copy of Mark of the Beast 2 from Chuck Olstead, our announcer. There's like 12 people who just had flashbacks. So those. But in all of those, there is this comparison made where Christ the Messiah is going to baptize with the Holy Spirit and. Or fire, where this element is going to be added to baptism, or there is going to be this second baptism. And what we see early on in the Book of acts, in Acts 2. 38, when St. Peter is preaching, he says, be baptized for the forgiveness of your sins, and you will receive the Holy Spirit. So he has drawn those two things together. He's drawn together the meaning and significance of the baptism that St. John is doing and this baptism that Christ is going to do. Pulled them together in Christian baptism already very early, right. On the day of Pentecost, St. Peter has pulled these together. So we sometimes lose sight of the fact that baptism is preparatory. Baptism itself, being baptized is preparatory. What do I mean by that? Well, especially among our Protestant friends, there is a tendency to see salvation as something that happens at a point, an event."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4767.3,"end":4794.4,"speaker":"Fr Andrew Stephen Damick","text":"And I think it's probably more characteristic of Protestants that would be kind of defined as sort of low church. But still, I mean, some of the higher church ones will just use the word justification. And it's just as much as of an event as the, you know, baptized and saved, once saved, always saved, you know, kind of. Kind of."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4794.4,"end":4794.8,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4795.12,"end":4796.73,"speaker":"Fr Andrew Stephen Damick","text":"Kind of thing. Yeah, right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4796.73,"end":4847.83,"speaker":"Fr Stephen De Young","text":"And then. And then, depending on where you are, right. In the wild, wild world of Protestantism, people will have different views of how that event, whether that they call that event justification or call it just salvation or call it being born again or whatever you want to call that event, how that event is related to your baptism. So if you're in a church like the Lutheran Church that believes in baptismal regeneration, they're kind of the same thing, Right. Baptism is where that event happens. If you're in a more low church setting, then baptism might just be a symbol or a public proclamation that the event has happened."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4848.32,"end":4849.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4849.2,"end":4866.96,"speaker":"Fr Stephen De Young","text":"That follows on the event. But in all of those cases, right. Regardless of how exactly baptism is related, baptism either is the thing or it's the mark after the fact that the thing has happened. And so now that's kind. That part is done."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4868.72,"end":4869.12,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4869.68,"end":4968.97,"speaker":"Fr Stephen De Young","text":"That part is done. But that's not really the perspective of the Scriptures, particularly the New Testament, particularly St. Paul, on what's going on in baptism in places like Romans 6, 4 and Colossians 2, verse 12, and lots of other places. But those are two examples, St. Paul, in talking about baptism, talks about it in terms of death and resurrection, both the death and resurrection of Christ and then our death and resurrection, that in our baptism we die and then we rise again to new life. Right. But even that way of framing it. Right, that way that St. Paul frames it means that it's not that baptism is something unto itself or that baptism is the end of something or the testimony to something that has already happened, but that it's the beginning of something. It is precisely the beginning of a new life. Right. A new. And not just a new life in the sense of, oh, now you're going to have eternal life in the age to come, but the beginning of a new life lived differently here in the world, within the church community, within the Christian community, in the world, in your family, that baptism marks this beginning of that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4969.37,"end":4975.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're not just waiting until you get raptured out or, you know, great tribulation comes or whatever."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4976.25,"end":4992.15,"speaker":"Fr Stephen De Young","text":"Right. And I think the common evangelical rejection of infant baptism is precisely related to this. If you see baptism as an ending, as a culmination of something."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4993.99,"end":4994.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":4994.55,"end":5008.08,"speaker":"Fr Stephen De Young","text":"Then administering it to an infant who hasn't done anything, thought anything, agreed to, anything, believed anything, thought much. Right. Doesn't make a lot of sense."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5008.64,"end":5013.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's what's culminating in the life of a newborn baby."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5014.4,"end":5019.24,"speaker":"Fr Stephen De Young","text":"Right. I mean, technically, they just had the culmination of gestation, but that's about it. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5019.24,"end":5019.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5024.64,"end":5082.06,"speaker":"Fr Stephen De Young","text":"Whereas if you understand baptism to be the beginning of a new life, of a new way of life, a new way of living and being in the world of being in community, of being in a Christian family, of living as a Christian, if it's a beginning, then it makes perfect sense for Christian families to baptize their children. Right. It makes perfect sense for their life as a Christian to begin right there. Because they're living in a Christian family, as part of a Christian community going to church. Right. Why would they live as a heathen for some period of time? Right. It doesn't make sense if you're viewing it from that perspective. But so let's talk more about how baptism is presented as preparatory, as a beginning."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5082.3,"end":5082.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5083.58,"end":5094.87,"speaker":"Fr Stephen De Young","text":"So to flesh out when St. Paul is using these terms of death and resurrection, the end of an old life and the beginning of a new life."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5094.95,"end":5095.35,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5097.91,"end":5136.98,"speaker":"Fr Stephen De Young","text":"The idea of death and the end of that old life is really the idea of repentance. It's a way of talking about repentance. And he's going to use this language of putting off the old man and even killing it. Right. And this is one of these places where kind of dumb. Dumb level gender inclusivity does us wrong interpreting the Bible. There are places. There are places even in the Bible where being a little bit gender inclusive makes sense."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5138.26,"end":5138.5,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5138.9,"end":5155.06,"speaker":"Fr Stephen De Young","text":"Right. You know, because there, for example, there are different words in Greek for a man, a male human. Right. An adult male human. Right. A man, and the word for, like, mankind. Humanity."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5155.3,"end":5155.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5155.7,"end":5160.66,"speaker":"Fr Stephen De Young","text":"Right. Now, yes. Both mankind and humanity include the word man in them."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5161.22,"end":5161.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5162.02,"end":5175.42,"speaker":"Fr Stephen De Young","text":"But I don't think translating it as humanity is some kind of weird liberal, progressive something or other when we're talking about anthropos. It's a way of distinguishing it in English."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5175.66,"end":5176.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5176.14,"end":5179.58,"speaker":"Fr Stephen De Young","text":"From an ear, a man, a male human."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5179.82,"end":5180.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5183.5,"end":5193.18,"speaker":"Fr Stephen De Young","text":"So, yeah. Let me tell you my favorite story, though, as a digression about gender inclusivity gone awry."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5193.7,"end":5194.18,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5195.06,"end":5196.1,"speaker":"Fr Stephen De Young","text":"There is an amazing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5196.5,"end":5199.18,"speaker":"Fr Andrew Stephen Damick","text":"Let's say not. Not where I thought we were going tonight, but I'm up."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5199.18,"end":5220.74,"speaker":"Fr Stephen De Young","text":"Yeah. I'm just gonna throw this out because I find it richly entertaining. So a lot of this. The gender inclusivity thing started in the 1970s. I know many of you were not alive then, but you started getting this whole thing where, you know, someone would say, you know, when a man does this, I say, well, or a woman."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5221.17,"end":5221.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5221.41,"end":5222.53,"speaker":"Fr Stephen De Young","text":"You know, you'd get that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5222.61,"end":5222.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5222.93,"end":5225.41,"speaker":"Fr Stephen De Young","text":"That was sort of how the gender inclusivity thing started."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5225.73,"end":5226.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5226.17,"end":5232.21,"speaker":"Fr Stephen De Young","text":"And so people kind of got trained by the culture to just say, a man or a woman."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5232.69,"end":5233.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5233.17,"end":5291.23,"speaker":"Fr Stephen De Young","text":"When a man or a woman becomes a doctor, you know, whenever. Right. And so there was this great moment where this football player named Deacon Jones, famous footballer, and part of what he was famous for was he'd line up opposite somebody, and then when the play started, he would just take his hand and smack the side of their helmet to knock them off balance Right. As the play started to give him an advantage. So there was this moment where someone, an interviewer, asked Deacon Jones about this, and Deacon Jones said, well, whenever you go upside the head of a man or a woman. Wow. Yes. And sort of it got very quiet in the interview as he kind of realized what he said."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5291.71,"end":5292.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5292.67,"end":5299.07,"speaker":"Fr Stephen De Young","text":"So, see, you don't always have to be gender inclusive. It can go very wrong for you."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5299.71,"end":5306.9,"speaker":"Fr Andrew Stephen Damick","text":"According to the interwebs, he coined the term sack to refer to that particular maneuver in football."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5306.9,"end":5307.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5307.78,"end":5308.82,"speaker":"Fr Andrew Stephen Damick","text":"How about that? So."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5309.38,"end":5338.94,"speaker":"Fr Stephen De Young","text":"So, yes, gender inclusivity can go very badly. And it does us wrong here, too. Getting back to the topic at hand, because. And I've even seen this in some recent Orthodox service books like, why am I going off on a little rant about gender inclusivity? Because I've seen this in recent Orthodox service books where, like, in the baptismal liturgy, it will use this language of St. Paul's about putting off the old man."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5339.66,"end":5340.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5341.18,"end":5344.78,"speaker":"Fr Stephen De Young","text":"And you get people who are like, well, what if you're baptizing a girl or a woman?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5346.86,"end":5347.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5350.14,"end":5369.56,"speaker":"Fr Stephen De Young","text":"But the point here is, is St. Paul is not just referring to, like, the old person, the person you used to be. And let me say, killing off the old person does not read well in liturgical text. We don't want to sound like we're promoting euthanasia in the Orthodox Church."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5370.12,"end":5370.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5370.44,"end":5371.4,"speaker":"Fr Stephen De Young","text":"We're not Canadians."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5371.64,"end":5372.4,"speaker":"Fr Andrew Stephen Damick","text":"Ooh, cheap."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5372.4,"end":5386.05,"speaker":"Fr Stephen De Young","text":"Oh, but Right. But the old man in this case is a reference to Adam. Yeah, the old Adam."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5387.25,"end":5388.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5388.69,"end":5492.05,"speaker":"Fr Stephen De Young","text":"So Adam, as we've talked about on the show, right. Receives the garments of skin. He receives mortality. Right. Mortal flesh. And we all are born in the likeness of Adam. Of the old man, we are born in his likeness. We also are mortal. We're conceived mortal. And because of our mortality comes our weakness to the sinful passions. How does that relate? Well, because I am mortal, there are things that I need, because if I don't get them, I will die, right? If someone is immortal, they don't need anything. They're immortal. They won't die. But if you're mortal, you need certain things or you will die. So I need to eat to stay alive. Hunger by itself is what we call a blameless passion. It is not sinful to get hungry, right? It is normal because of my mortal flesh, right? But the fact that I need to eat opens up the temptation to the sinful passion of gluttony. Because I am mortal, I need to sleep. Getting tired is a blameless passion. There's nothing sinful about getting tired, right? But getting tired and needing to rest opens up the sinful passion of sloth, of laziness."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5494.05,"end":5494.37,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5494.37,"end":5501.01,"speaker":"Fr Stephen De Young","text":"It opens up that temptation. Immortal people don't need to make more people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5502.05,"end":5503.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5504.37,"end":5566.13,"speaker":"Fr Stephen De Young","text":"The world must be peopled. Therefore, mortal people must make more people. Right? There is nothing sinful about a husband and wife making more people. But needing to do that opens up this temptation to the sin of lust. And we can go on and on, Right? I need to have money to pay for shelter and clothing. That opens up greed. Right? On and on. Our mortality makes us prone to sin and to indulging these desires, these desires of the flesh, right? And so the old man, the old life, Right. Pre Baptism, pre Christ, pre death, in the death and resurrection paradigm, is a life that's lived seeking to fulfill the desires of the flesh and even go beyond fulfilling them to indulging them."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5566.21,"end":5567.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5569.9,"end":5572.3,"speaker":"Fr Stephen De Young","text":"So then if that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5574.62,"end":5574.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5574.98,"end":5576.94,"speaker":"Fr Stephen De Young","text":"If that life, that old man."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5577.42,"end":5577.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5578.86,"end":5596.01,"speaker":"Fr Stephen De Young","text":"That dies, then there's a new life. And that new life that begins at baptism, St. Paul will refer to as the new man. Specifically, you put off the old man. You put off on the new man."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5596.41,"end":5599.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is again where the gender inclusivity thing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5599.85,"end":5600.25,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5601.13,"end":5603.93,"speaker":"Fr Andrew Stephen Damick","text":"Messes it up. Because it's not the new person."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5604.65,"end":5608.61,"speaker":"Fr Stephen De Young","text":"Right. The new person or the new woman. Right. You're a whole different person now."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5608.61,"end":5616.57,"speaker":"Fr Andrew Stephen Damick","text":"Right? I'm a new woman. Yeah. No, it's. It's Christ. Christ is the new man and Adam is the old man. Like there's. These are specific men."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5617.29,"end":5656.69,"speaker":"Fr Stephen De Young","text":"Yes. And so when we're born of water in the Spirit, to quote Christ referring to baptism, then we are born in his likeness, not the likeness of the old man. And so in Christ there is a new humanity. Not new in the sense that it's a completely different species or different creature. New in the sense that new is pretty much always used in the scripture. Meaning renewed. Right, Renewed. Because of course, the image in which the old man, the image in which Adam was created, was Christ."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5659.25,"end":5659.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5659.81,"end":5719.19,"speaker":"Fr Stephen De Young","text":"So that is renewed in Christ himself. Right. And so this new humanity is a renewed humanity. That means we get A, as St. Paul will say, a new nature, which is again, a renewed nature. But we've talked about what nature means. Nature, like body, is a nexus of powers and potentialities. And so there is a renewed and new set of powers and potentialities that a person has in Christ that they didn't have before. Potentials like immortality. Right. Like eternal life. And so that culminates in a new body in the full orbed sense. Right. In the resurrection."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5720.87,"end":5721.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5721.27,"end":5760.37,"speaker":"Fr Stephen De Young","text":"Which again, we believe in the body, resurrection, bodily resurrection. That new body is a renewed body. Renewed, restored, but now with a new set of powers and potentialities. And so this new way of life, St. Paul is going to talk about as living according to the Spirit, the Holy Spirit, capital S. Spirit, not spiritual in some vague sense, but the Holy Spirit, the Spirit of God dwelling within us. And that old life is walking according to the flesh."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5761.01,"end":5761.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5761.65,"end":5772.77,"speaker":"Fr Stephen De Young","text":"Following the flesh, seeking to indulge its desires. And so after our baptism, the new life that begins, we have these two ways that we can follow."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5774.13,"end":5868.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And this is made explicit by St. Paul in Romans 8. So I'm going to read verses 3 through 13. For God has done what the law weakened by the flesh, could not do, by sending his own Son in the likeness of sinful flesh. And for sin, he condemned sin in the flesh in order that the righteous requirement of the law might be fulfilled in us who walk not according to the flesh, but according to the Spirit. For those who live according to the flesh set their minds on the things of the flesh. But those who live according to the Spirit set their minds on the things of the Spirit. For to set the mind on the flesh is death, but to set the mind on the Spirit is life and peace. For the mind that is set on the flesh is hostile to God, for it does not submit to God's law. Indeed, it cannot. Those who are in the flesh cannot please God. You, however, are not in the flesh, but in the Spirit. If in fact, the Spirit of God dwells in you. Anyone who does not have the Spirit of Christ does not belong to him. But if Christ is in you, although the body is dead because of sin, the Spirit is life because of righteousness. If the Spirit of Him who raised Jesus from the dead dwells in you, he who raised Christ Jesus from the dead will also give life to your mortal bodies through His Spirit who dwells in you. So then, brothers, we are debtors. Not to the flesh, to live according to the flesh. For if you live according to the flesh, you will die. But if by the Spirit you put to death the deeds of the body, you will live."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5872.48,"end":5889.53,"speaker":"Fr Stephen De Young","text":"And so these concepts are important to understand what it means when we're talking about asceticism and when we talk about the mortification of the flesh."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5891.21,"end":5891.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5891.77,"end":5911.69,"speaker":"Fr Stephen De Young","text":"Mortification. You could probably tell if you know any Latin at all. Mort is dead. Right. The putting to death of the flesh. So a lot of people now, when they hear mortification of the flesh, they interpret that as, oh, this is some kind of gnostic thing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5912.72,"end":5930.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like it's anti body, anti material, you know, and. And sometimes it's. It's distorted to like, you know, I have to hurt myself, you know, like self flagellation, which is. I mean, that's a real thing that exists, existed especially in the Middle Ages in the West."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5931.36,"end":5954.34,"speaker":"Fr Stephen De Young","text":"Right. That that's a fict. Inflicting pain or suffering on yourself physically, that somehow the physical is bad, all of these things. And so with that understanding the mortification of the flesh, then asceticism is looked at in that way that asceticism is about saying the material is bad. Right. Or sinful or evil."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5954.5,"end":5963.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it's about handing over control to the spirit of God versus the desires of the fleshly body."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5963.8,"end":5977.8,"speaker":"Fr Stephen De Young","text":"Right, Right. And so what? When the Orthodox Church at least talks about putting the death, the flesh, the mortification of the flesh, they're getting that from what we just heard from St. Paul, he used that language."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5978.36,"end":5979.08,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":5979.72,"end":6010.67,"speaker":"Fr Stephen De Young","text":"And it's talking about subjecting, controlling, right. In one place. St. Paul says he beats his body with blows. He doesn't mean that literally. In this self flagellation, inflict pain on yourself, since it means he gets it under control. It's why St. Paul is always using these athletic metaphors, right. About training and physical discipline. Right. You have to get your mortal flesh under control so that you're not indulging its desires, you're controlling those desires."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6010.83,"end":6011.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6012.11,"end":6016.11,"speaker":"Fr Stephen De Young","text":"And this is a very, this is a very practical thing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6017.31,"end":6017.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6018.23,"end":6046,"speaker":"Fr Stephen De Young","text":"So if we're talking about just looking at some of the examples I gave, right. If we're talking about food, right. We need to eat to live. That opens us up to this temptation to overindulge, right. In eating. How does one overcome that? How does one begin to discipline that desire and bring it under control to get self control and self mastery? How does that happen? Fasting."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6047.76,"end":6048.16,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6048.16,"end":6123.71,"speaker":"Fr Stephen De Young","text":"Fasting is how you do that. You take control of what you eat for a period of time and that helps build that discipline. You don't starve yourself to death. You don't starve yourself to death. This is one of the things that you really notice when you read the Church Fathers. Well, when you read some of the works of the Church Fathers that people don't normally read, and everyone wants to read the works of the Church Fathers that are about like the Trinity and Christology, so they can have online debates about it. But when you read the works of the Church Fathers that are dealing with the Christian life, which is most of it, and when they're comparing the way Christians live to the way various heretical groups and pagan groups live, what you find is if your view of asceticism is harming yourself, right, then the Manicheans, the Gnostics, these people have it all over Christians, these groups would literally fast to the point of death. They would walk around pale and weak and they considered that a mark of their holiness."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6126.76,"end":6127,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6127.08,"end":6137.8,"speaker":"Fr Stephen De Young","text":"Modern people who get into Gnosticism for some reason always ditch the asceticism. It's sort of like there was back in the 90s, there was this whole Celtic spirituality fad."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6138.44,"end":6139.84,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6139.84,"end":6171.85,"speaker":"Fr Stephen De Young","text":"With like people just got really into Enya or something and Decided they needed to make a religion out of it. It was vaguely Christian. Wow. So stop me when I tell a lie. Anyway, what was fascinating to me about it, or one of the things at least, was that if you actually look at Celtic Christianity, it had one of the most brutal penitential systems in the history of Western Christianity. And for some reason, the Celtic spirituality folks had none of that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6172.09,"end":6179.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. No one's standing in freezing rivers the whole night long reciting the Psalter from memory. That's not a thing that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6179.88,"end":6207.87,"speaker":"Fr Stephen De Young","text":"No, no, no, no, no, no, no, no. Can't smoke weed while you're doing that. So that tends to get left out. Right. So there's a big difference between that and not eating meat and dairy for 40 days. Yeah, right. Those are. They're not remotely the same thing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6208.51,"end":6208.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6208.87,"end":6265.36,"speaker":"Fr Stephen De Young","text":"It's not going to harm you, especially if you live in southern Louisiana and there's seafood everywhere and it's delicious. And like crawfish season is during Lent every year. But even for the rest of you who are not so blessed as to live in God's country, it's not going to kill you. Some people even eat better and eat healthier during Lent and some people eat nothing but carbs. But it's either way, right? This isn't harming yourself, Right. This is. This is about discipline, right. And sleep laziness, right? You have vigils, right? You have going to church more. You have spending more time in prayer, Right? Giving alms. Right? Giving to the poor, making a special effort to do that. Right? Helps you discipline how you spend your money."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6268.16,"end":6268.56,"speaker":"Announcer","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6269.68,"end":6284.81,"speaker":"Fr Stephen De Young","text":"How you spend or waste your time, Right? These are all means of developing discipline and self control and putting to death the sinful desires of the flesh in order to follow the Spirit instead."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6285.45,"end":6285.85,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6286.73,"end":6313.25,"speaker":"Fr Stephen De Young","text":"And another good. I mean, St. Paul talks about this a lot, but another good place, part of which is, I think, familiar to people. He talks about this in Galatians, and he talks about these two ways that you can go in terms of the fruit that they produce, in terms of what you have in your life when. When you either follow the desires of the flesh or you follow the Holy Spirit."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6313.73,"end":6398.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, this is where the rubber meets the road, people. All right, so this is Galatians 5, 1624. But I say walk by the Spirit and you will not gratify the desires of the flesh, for the desires of the flesh are against the Spirit, and the desires of the Spirit are against the flesh. For these are opposed to each other to keep you from Doing the things you want to do. But if you are led by the Spirit, you are not under the law. Now, the works of the flesh are evident. Sexual immorality, impurity, sensuality, idolatry, sorcery, enmity, strife, jealousy, fits of anger, rivalries, dissensions, divisions, envy, drunkenness, orgies and things like these. I warn you, as I warned you before, that those who do such things will not inherit the kingdom of God, but the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self control. Against such things there is no law. And those who belong to Christ Jesus have crucified the flesh with its passions and desires. It's a great, great passage."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6399.29,"end":6508.41,"speaker":"Fr Stephen De Young","text":"Yeah, so. And you also, in the middle there, described my typical Saturday night. No, I'm kidding. I don't engage in idolatry, which verse. So. Yeah, so baptism, right, is about making this beginning before baptism, right? Someone in Galatia, especially someone who's not Jewish in Galatia, right, is living a life as a pagan, following their passions and the desires of their flesh, right? Engaging in all those things he talked about, including idolatry and sexual immorality, sorcery, all those things, right? Now they're coming and they're going to be baptized and that flesh is going to die and they're going to come to new life when they receive the Holy Spirit and they're going to begin a new life. But even after they're baptized and they begin this new life, it's going to be possible for them to yield and start following the desires of the flesh again. You may have noticed this, listeners who have been baptized, that even afterwards, right, you are still tempted and even fall into sin, right? And so there's still, yeah, there's still this choice that has to be made on an ongoing basis, not just once, right, but over and over again to continue to follow the Spirit and not yield to the desires of the flesh, right? But as these people approached baptism."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6510.49,"end":6510.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6510.85,"end":6553.27,"speaker":"Fr Stephen De Young","text":"As they were get going to be baptized, they were going to be beginning this new life. They're going to be changing the whole way in which they live in the world, the whole way in which they see things, the whole way in which they understand the world and other people and their famil. They're going to be joining this new community. They're going to be worshiping a different God and worshiping in a completely different way. All of these things are about to change. And so that necessitated a period of repentance, that necessitated a period of preparation for baptism to prepare to Begin this new life."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6554.38,"end":6554.62,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6555.58,"end":6560.46,"speaker":"Fr Stephen De Young","text":"And that is what originally catechesis was all about."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6561.18,"end":6563.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It wasn't Orthodoxy 101."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6564.38,"end":6569.1,"speaker":"Fr Stephen De Young","text":"Right. It wasn't memorizing dates. It wasn't when things happened."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6569.42,"end":6579.5,"speaker":"Fr Andrew Stephen Damick","text":"It was. It was a training and a way of living. You know, like, this is how you repent. This is how you put aside, you know, the fleshly desires."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6579.99,"end":6580.27,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6580.27,"end":6581.27,"speaker":"Fr Stephen De Young","text":"This is what sin is."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6581.75,"end":6583.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6584.79,"end":6590.95,"speaker":"Fr Stephen De Young","text":"This is what needs to change. This is how you worship the true God. This is what the true God is like, unlike the ones you're used to worshiping."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6591.19,"end":6596.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's about how you live. How you live like what makes a good Christian. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6596.87,"end":6598.31,"speaker":"Fr Stephen De Young","text":"And how you see the world."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6599.03,"end":6599.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6599.39,"end":6631.03,"speaker":"Fr Stephen De Young","text":"The renewing of your mind, your noose. Right. How you see the world, how you understand the world, how you understand what happens to you. And all of that is going to come to this culmination at the peak of your baptism, when you receive the Holy Spirit and begin to be able to walk according to the Spirit. And so there's this period of preparation and because early on in the history of the church, people were received into the church. They were baptized on Pascha, on the Passover."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6632.26,"end":6632.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6632.66,"end":6648.5,"speaker":"Fr Stephen De Young","text":"That's when it happened. You have this 40 day period, a period of preparation, of repentance, of purification for those who are about to receive baptism, receive the Holy Spirit, begin this new life."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6648.82,"end":6659.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. All right, we're going to go ahead and take our second and final break. And we right back with the third half, the Lord of Spirits, Father Andrew."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6659.39,"end":6675.03,"speaker":"Announcer","text":"Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2-346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6679.91,"end":6687.03,"speaker":"Announcer","text":"How do you explain the sacraments? It's easy to say they're mysteries that we have to take on faith or on the authority of tradition."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6687.12,"end":6687.28,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6687.43,"end":6748.76,"speaker":"Announcer","text":"But that is not how the early Christians understood them. To them and to all ancient people, the idea that physical objects had spiritual power was very intuitive. Whereas modern people tend to find this difficult, bizarre, or even unchristian. This is because we live in an era shaped by secularism, a way of viewing a world that's incompatible with sacramental thinking. Because secular ideas are at the heart of our culture, modern people tend to think in secular ways without realizing it. Even the most well meaning of us. How then do we live in, but not be of a secular culture? We need to understand the enchanted sacramental way that the early Christians viewed the world. But we also need to understand secularism. What is it really? Where did it come from? And how does it influence how we think about religion? Journey to Reality Sacramental Life in a Secular Age breaks down these important issues in accessible, non academic language and is an ideal introduction for young readers, catechumens and seekers, as well as for any Orthodox Christians who want to deepen their understanding of the sacraments."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6750.2,"end":6769.97,"speaker":"Announcer","text":"Now available@store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7234. That's 855 AF radio."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6771.25,"end":6785.97,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. It is the third and final half of this episode. Is it the final episode of the Lord of Spirits podcast? Yeah. I mean, it seems kind of weird to make the last episode about Lent, but."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6787.65,"end":6790.93,"speaker":"Fr Stephen De Young","text":"Yeah, it would seem like this episode would be leading up to something."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6795.02,"end":6821.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Well, during our first half, we talked about 40 and 42, what all of that is about, preparation, forgiveness, repentance. And in the second half, we talked about baptism, how it connects to all of that. This episode is about Lent. You might think that it is going to end with an explication of the Christian Passover, AKA Pascha, AKA Easter, but that is not what we're ending it with, is it?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6822.32,"end":6822.72,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6823.04,"end":6825.84,"speaker":"Fr Andrew Stephen Damick","text":"The big shocker at the end. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6825.84,"end":6883.13,"speaker":"Fr Stephen De Young","text":"Yeah, we're gonna zig. When you thought we were gonna zag. Just when you think you have all the answers, I changed the questions. So, yeah, as we mentioned. Right. At the end of the second half, almost like it was a segue or something. Someone's baptism culminates in their receiving the Holy Spirit in Chrismation. We did a whole episode on that, too. But that is the culmination of the rite. In fact, the baptism is preparatory for it. Right. The baptism is purification to receive the Holy Spirit. So if then, as we talked about, the apostles see baptism as connected to the death and resurrection of Christ."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6884.97,"end":6885.29,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6885.29,"end":6900.56,"speaker":"Fr Stephen De Young","text":"That is preparatory to the receiving of the Holy Spirit, then that would mean that Pascha and the Ascension are preparatory to Pentecost."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6902.64,"end":6903.44,"speaker":"Fr Andrew Stephen Damick","text":"Big reveal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6904.4,"end":6906.96,"speaker":"Fr Stephen De Young","text":"So here in the third half, we're talking about Pentecost."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6907.84,"end":6908.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6908.56,"end":6911.76,"speaker":"Fr Stephen De Young","text":"And we're going to look at it. I think we did a Pentecost episode."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6913.04,"end":6913.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6913.4,"end":6915.44,"speaker":"Fr Stephen De Young","text":"Or I might just be thinking of the Chrismation episode."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6915.92,"end":6927.57,"speaker":"Fr Andrew Stephen Damick","text":"No, we did. I'm trying to remember the name of it now. I think it's called An Immaculate Dwelling Place. So we did we did do. Oh, yeah, last episode. But it was about tabernacles and temples and stuff."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6927.57,"end":6929.93,"speaker":"Fr Stephen De Young","text":"Yeah. Well, now we're coming at this from a different angle."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6930.09,"end":6930.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6931.45,"end":6933.85,"speaker":"Fr Stephen De Young","text":"Because we're coming at this from the angle of observance."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6933.93,"end":6934.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6935.61,"end":6937.37,"speaker":"Fr Stephen De Young","text":"And so it may sound weird."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6938.33,"end":6938.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6938.69,"end":6951.7,"speaker":"Fr Stephen De Young","text":"Pascha is the feast of feasts. Right. Passover is the feast of. And Passover in the Torah, obviously. Well, maybe not obviously, but is presented. You know, this will be for you, the first of months."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6951.78,"end":6952.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":6952.1,"end":7007.24,"speaker":"Fr Stephen De Young","text":"This is the beginning of the. This is. This is the day. The idea that that's preparatory to another feast, especially one that a lot fewer people attend. Frankly, yes. Because later in the summer when they're on vacation, may seem counterintuitive and odd, but let me say that it maybe should not be so. Because, for example, when Christ in St. John's gospel, before his death and resurrection, is talking to his disciples, soon to be apostles, about what comes next, he talks to them about going away. And he's not talking about going away, that is dying, and then he's going to rise again. He's talking about going away as in the Ascension."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7007.56,"end":7007.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7007.96,"end":7015.72,"speaker":"Fr Stephen De Young","text":"As in returning to His Father, being enthroned in the heavens. And he presents this not as."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7017.48,"end":7017.8,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7017.8,"end":7023.72,"speaker":"Fr Stephen De Young","text":"Okay. Then everything will be done and will be complete. But he presents that as preparatory to something else."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7025.57,"end":7029.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He says essentially it's going to be better. Superior."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7030.05,"end":7030.53,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7031.17,"end":7112.33,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. So this is what he says. This is John 16, starting in verse 4. But I have said these things to you that when their hour comes, you may remember that I told them to you. I did not say these things to you from the beginning because I was with you. But now I am going to him who sent me. And none of you asks me, where are you going? But because I have said these things to you, sorrow has filled your heart. Nevertheless, I tell you the truth, it is to your advantage that I go away. For if I do not go away, the Helper will not come to you. But if I go, I will send him to you. And when he comes, he will convict the world concerning sin and righteousness and judgment concerning sin, because they do not believe in me concerning righteousness, because I go to the Father. And you will see me no longer concerning judgment, because the ruler of this world is judged. I still have many things to say to you, but you cannot bear them. Now when the Spirit of truth comes, he will guide you into all the truth, for he will not speak on his own authority, but whatever he hears, he will speak and he will declare to you, the things that are to come, he will glorify me, for he will take what is mine and declare it to you. All that the Father has is mine. Therefore, I said that he will take what is mine and declare it to you. So he's talking about what will happen when the Holy Spirit comes, among other things."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7112.33,"end":7120.69,"speaker":"Fr Stephen De Young","text":"The Holy Spirit comes. Yeah. And that is better than him remaining in this world with the disciples."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7121.25,"end":7121.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7121.97,"end":7131.58,"speaker":"Fr Stephen De Young","text":"So Christ himself is presenting what he is about to do as preparatory to the coming of the Holy Spirit, Right? To. To dwell in people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7131.66,"end":7132.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7132.7,"end":7151.82,"speaker":"Fr Stephen De Young","text":"And of course, the Holy Spirit comes 50 days after Pascha, after the Passover on Pentecost. Hence Pentecost, Right. That's where the name comes from, that it's 50 days. 50 days is right. You have 49, which is seven sevens."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7153.34,"end":7153.74,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7154.37,"end":7211.1,"speaker":"Fr Stephen De Young","text":"So Christ's ascension happens on the 40th day. Meaning it's preparatory to something. It's leading to something. See, we teased this third half all the way back in the first half. Christ ascension is preparatory to something, right? Then we have the seven. Seven. And on the 50th day, right? Think about the Sabbath years in the Torah. In the Torah, you don't just have the Sabbath day, but you have Sabbath years. Every seventh year is a Sabbath year when they were supposed to let the land rest and trust in God to provide for them. We know from later in the Hebrew scriptures that the Israelites literally never did this, but they were supposed to on every seventh year, and then every seventh, seven after every 49 years. The 50th year was to be the jubilee year."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7211.98,"end":7221.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where all the slaves get freed, all the land goes back to over. It belongs to. All the debts get canceled. Big reset."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7221.98,"end":7235.2,"speaker":"Fr Stephen De Young","text":"Right? And so after the seven sevens, you get this day. So the cyclical pattern of years in Israel, if they had followed this, would have culminated in this 50th year."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7236.24,"end":7236.64,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7237.36,"end":7242.96,"speaker":"Fr Stephen De Young","text":"So the idea here is that the Holy Spirit coming is the culmination of all of this."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7243.12,"end":7243.52,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7245.36,"end":7254.16,"speaker":"Fr Stephen De Young","text":"But of course, the Feast of Pentecost, right? The feast that's celebrated there is not a new one."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7255.68,"end":7256.08,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7256.8,"end":7266.01,"speaker":"Fr Stephen De Young","text":"This isn't. The Holy Spirit came 50 days after Jesus rose again. And so there came to be this feast of Pentecost. This is a Jewish feast."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7266.49,"end":7270.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah. Just like. Just like Pascha is, AKA Passover."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7271.13,"end":7275.53,"speaker":"Fr Stephen De Young","text":"This is Passover. This is. This is a feast from. From the Torah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7275.85,"end":7276.25,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7276.33,"end":7327.83,"speaker":"Fr Stephen De Young","text":"And so to sort of fully understand what's going on here, we have to understand the first Pentecost that will help us understand the Second Pentecost in the same way that if you understand the first Passover, it helps you understand. Understand what's going on with the second Passover and second Pascha and Christ's death and resurrection. So the first Pentecost is 50 days after the Exodus at Mount Sinai when the Israelites received the Torah. Right. It is the liturgical reenactment and participation in that event. When Moses first received. Received the Torah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7328.07,"end":7328.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7329.35,"end":7333.75,"speaker":"Fr Stephen De Young","text":"Again, we talked about this event back in the first half and how sort of paradigmatic it is."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7334.31,"end":7334.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7336.47,"end":7353.82,"speaker":"Fr Stephen De Young","text":"And about Moses fasting before the second time. Right. That he received it. But this annual celebration brought the people back to that. Well, how did the people participate in it? So we've talked about on the show before with the way the Passover was celebrated."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7354.54,"end":7354.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7354.94,"end":7375.35,"speaker":"Fr Stephen De Young","text":"And how is this night different than every other night? This is the night when God brought us out of Egypt, right? Not our ancestors, us. Us. So they dress like they're about to go on a journey. They make unleavened bread like they're about to go on a journey. And they don't have time for the doterrais. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7375.35,"end":7377.91,"speaker":"Fr Andrew Stephen Damick","text":"All of the things stand. Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7378.79,"end":7396.37,"speaker":"Fr Stephen De Young","text":"So they are participating in that liberation from slavery in Egypt by celebrating the Passover. So what were they participating in in particular? Right. They're not participating in going up the mountain with Moses because the people didn't go up the mountain with Moses. They were terrified."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7396.69,"end":7397.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7397.97,"end":7406.77,"speaker":"Fr Stephen De Young","text":"What they were participating in was when Moses read to them the book of the covenant and they said all of these things you have said, we will."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7406.77,"end":7409.49,"speaker":"Fr Andrew Stephen Damick","text":"Do, which they didn't."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7409.57,"end":7463.91,"speaker":"Fr Stephen De Young","text":"Which they didn't. Spoilers. But when they agreed, right. And your average Israelite or your average Jewish person in the Second Temple period, right. Likewise had at many points in their life, agreed that they would be faithful to God's covenant with them, that they would be faithful to the Torah. And guess what? Spoilers they hadn't been, right. But on that day, the day of the Feast of Pentecost, by participating in that feast, they could come back and reaffirm, right? No, I'm going to reaffirm. I'm going to rededicate myself to living my life according to the Torah, to doing those things that God has commanded me to do, to not doing those things that God has commanded me not to do, to being faithful."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7464.07,"end":7464.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7464.43,"end":7597.18,"speaker":"Fr Stephen De Young","text":"As God has always been faithful to us. Right. I'm going to commit now again to be faithful to him. So there's this kind of renewal of the covenant or reaffirmation of the covenant is what they were participating in. And so the second Pentecost, the Pentecost, that's related to us in the Book of Acts, right? When. When the Holy Spirit comes and indwells all of the followers of Christ, it's described in Acts using language from the New Covenant passages of the old testament, Jeremiah 31, Joel 2, Ezekiel, other places that talk about there being a new covenant again. New here really means renewed, made new again. But that's connecting this idea. And a very important part of that New Covenant language was that the Spirit would write the Torah on people's hearts. Instead of the Torah being written on tablets of stone, instead of the Torah being written in a scroll, the Torah would be written on the human heart. And that's a move from external to internal. And if you don't understand this in the New Covenant prophecies, you won't understand what St. Paul is doing when he talks about the Torah, right? This move from external to internal. Because for St. Paul, that's the difference you may have noted in the second half when Father Andrew was reading those passages from Romans and Galatians, the Torah kept coming up. I think in that translation it said law, right? But let's talk about the Torah. The Torah kept coming up, right? And St. Paul says, look, if you're living according to the flesh, if you're living to gratify your flesh, you can't keep the Torah. Why? Because if you're following the desires of your flesh, it's impossible for you to please God."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7599.82,"end":7600.22,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7600.54,"end":7607.02,"speaker":"Fr Stephen De Young","text":"And so St. Paul's assuming that keeping the Torah is pleasing to God, right? Kind of. Because God said it was, but."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7607.98,"end":7608.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7609.02,"end":7656.41,"speaker":"Fr Stephen De Young","text":"So you can't do it, right. You juxtapose that with what he says about, like, the fruit of the Spirit, all of these things that will come into your life when you're following the Spirit, against which things there is no law, there's no commandment against them, Right? You will keep the Torah, right. Without trying. Not as a list of rules, written rules, the letter of the Torah that is external to you, trying to just follow these observances as best you can, but because it's written in your heart and you're following the Spirit, right? And he's leading you to produce these things. At one point, St. Paul says, the one who loves keeps the whole Torah. That's just the first of the fruit of the Spirit."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7658.57,"end":7658.97,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7659.85,"end":7676.22,"speaker":"Fr Stephen De Young","text":"But that's at the core. And St. Paul is not saying something really new there, right? Like Deuteronomy says that and Christ quoted Deuteronomy saying that, right? This sums up all the law, the prophets. Love the Lord your God with all your heart, with all your mind, with all your strength."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7676.46,"end":7676.86,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7677.02,"end":7680.94,"speaker":"Fr Stephen De Young","text":"And then from Leviticus, love your neighbor as yourself. St. Paul's just saying the same thing."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7682.46,"end":7682.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7684.06,"end":7692.22,"speaker":"Fr Stephen De Young","text":"But that makes this distinction, and that was a distinction that was already present in the Torah itself when it talks about in Deuteronomy, circumcising your heart."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7694.86,"end":7695.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7695.67,"end":7715.83,"speaker":"Fr Stephen De Young","text":"Contrast. Yes. You have this external thing. You've been circumcised in the flesh, if you're male and you're an Israelite. Right. You've been circumcised outwardly, but that's not what's important. It's a circumcision of the heart that's important. This is just these same ideas."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7716.31,"end":7716.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7717.35,"end":7731.84,"speaker":"Fr Stephen De Young","text":"And so even though when you read St. Paul, he makes this clear distinction and talks about, you know, following the Spirit is the way you actually fulfill what the Torah demands of us."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7733.04,"end":7733.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7735.04,"end":7756.54,"speaker":"Fr Stephen De Young","text":"The narrative of the Holy Spirit coming and indwelling people on Pentecost that we read in Acts is saying the same thing. If you understand this background, this background of the Feast of Pentecost, that that's when the Torah was given and the idea of the New Covenant and this move from external to internal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7757.34,"end":7757.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7761.74,"end":7767.02,"speaker":"Fr Stephen De Young","text":"And the importance of this feast and its celebration."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7768.06,"end":7768.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7768.86,"end":7780.63,"speaker":"Fr Stephen De Young","text":"That had already been seen in its practice as a sort of culmination, not as sort of. It tends to be looked at as an epilogue to Pascha."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7782.55,"end":7788.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The end of the festival cycle. Now, back to, quote, unquote, ordinary time."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7789.19,"end":7794.07,"speaker":"Fr Stephen De Young","text":"Right? Yeah, yeah. That's how a lot of people tend to look at Pentecost. Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7794.15,"end":7794.55,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7798.47,"end":7818.91,"speaker":"Fr Stephen De Young","text":"I mean, it's harder to look at it that way in the Torah. But, I mean, I think people managed to do it, looking back on it retrospectively, to say that, well, Passover is the really important thing. I think when you're reading through the Book of Exodus, it's pretty clear that the giving of the Torah is what the Exodus from Egypt is building up to."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7819.23,"end":7829.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the narrative. Yeah, Right. Like, you leave Egypt, not so that you leave Egypt, you leave Egypt so that you get to Sinai."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7830.11,"end":7850.2,"speaker":"Fr Stephen De Young","text":"Right, Right. But so that was. That was seen in how Pentecost was celebrated. This is testified to by the fact that when we get to Acts 2 and the Holy Spirit comes at Pentecost, why are there thousands of Jewish people in Jerusalem from all these other countries and other places?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7850.2,"end":7852.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's because it's Pentecost. Big deal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7853.24,"end":7904.35,"speaker":"Fr Stephen De Young","text":"Right. Because It's a big deal. So thousands upon thousands of people came to Jerusalem for that feast. Right. So the while we may be able to look back and see that clearly, right. In Exodus, it's far rarer, I think, that we understand that in the New Testament, that we understand that Christ's death and resurrection and ascension are building up to the coming of the Holy Spirit, that the coming of the Holy Spirit is the climax of that story, not an epilogue to it. The Holy Spirit coming and dwelling in us is not something to tide us over until Jesus comes back. I say that very confidently because Father Andrew read Christ saying that in St. John's gospel."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7904.43,"end":7904.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7906.59,"end":7934.25,"speaker":"Fr Stephen De Young","text":"I'm going out on a limb. I know, but I'm going to say Christ was right. So what then is going on with our annual celebration of Pentecost? Or at least should be going on with our annual celebration of Pentecost in the church. Right. As opposed to seeing it as an epilogue, we should be seeing this as the climax of the feasts."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7934.65,"end":7935.05,"speaker":"Announcer","text":"And."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7935.9,"end":7936.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7936.14,"end":7957.02,"speaker":"Fr Stephen De Young","text":"If Pentecost was being celebrated as the renewal of the Old Covenant, then we should understand Pentecost as the renewal of the New Covenant. Right? Not that we receive the Holy Spirit again and again and again, once a."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7957.02,"end":7957.26,"speaker":"Fr Andrew Stephen Damick","text":"Year."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":7959.1,"end":8043.74,"speaker":"Fr Stephen De Young","text":"After we were Chrismated, but that any more than they received the Torah over and over again. But that we recommit to living according to the Spirit, to walking according to the Spirit, year after year after year. Because guess what? Just like those Israelites, you and I commit to that a lot and don't pull it off. We go after the indulgences of the flesh over and over again and need to come back and recommit. So just to give some examples, and a lot of this is because our audience, I know, likes learning about obscure Second Temple Jewish stuff, some stuff about the importance of the Feast of Pentecost in the Second Temple period. Right. The great importance. So in the Book of Jubilees, in the Book of Jubilees, Pentecost is presented as the most important feast of the year. Of the year, which might be surprising. Right. Meaning it's presented as more important than Passover, more important than the Day of Atonement."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8045.1,"end":8045.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8045.5,"end":8097.58,"speaker":"Fr Stephen De Young","text":"It is the most important feast of the year. And it was celebrated by the taking and renewal of oaths. Right. Related to the Torah. But a lot of jubilees takes place before the Torah was given. Right. That's why it's oaths in general. But the way Jubilees presents the Feast of Pentecost is that the Feast of Pentecost is eternally happening in heaven. That is, the feast that is eternally happening in heaven is the feast of Pentecost. Well, what does that mean? The giving of the Torah is eternally happening in heaven? Well, what they meant by that is that God's commitment to be faithful to the Torah, God's commitment to be faithful to his covenant is eternal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8098.71,"end":8100.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's doing it."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8100.63,"end":8142.64,"speaker":"Fr Stephen De Young","text":"Right. Remember what we said about the divine energies a few episodes ago, right? God is eternally faithful, eternally committed to his covenant. Right. We obviously are not. We obviously are not, but he is. So it's eternally happening in heaven. And then that eternal celebration in heaven touches human time and space reality. And in the view of Jubilees, that happens at particular points in time, like when God makes his covenant with Noah. That is, Noah coming to participate in this eternal covenant faithfulness, eternal hesed of God."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8144.48,"end":8144.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8146.8,"end":8167.93,"speaker":"Fr Stephen De Young","text":"And then all of the other covenants, obviously, the giving of the Torah at Mount Sinai is a. Is a preeminent example of this. But. But then this is also true at the celebration of Pentecost. Every year in the cycle, humans enter into this moment where God is eternally faithful, and then we again pledge."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8168.97,"end":8169.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8169.37,"end":8213.96,"speaker":"Fr Stephen De Young","text":"To be faithful to God in response at those manifestations in time and space, those points of connection. Right? So that's how Jubilees presents. The book of Jubilees presents Pentecost, as you might expect, based on that, from the documents we have from Qumran, because Jubilees is the fourth most prevalent text in the Dead Sea Scrolls, had a major influence in the community in Qumran. And so scholars argue whether it was the most prominent feast in Qumran. There's an argument to be made for that. There's an argument to be made for Passover. It's one of the two."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8214.52,"end":8214.92,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8214.92,"end":8312.64,"speaker":"Fr Stephen De Young","text":"Those are the two big ones. And then scholars argue over which one was on top. But we have. Actually, it's fragmentary, but we have some fragmentary prayers that they used at the feast of Pentecost that all involve this reaffirming not only of the covenant with God related to the Torah and other covenants, but also the sort of internal covenant of the community. The bond that that particular community had and its structure was seen as sort of an internal covenant that they were party to. And that was reaffirmed on the day of Pentecost. Philo talks about a group, a Jewish sect in Alexandria called the Therapeutae, which, if your Greek is really, really bad, I will tell you, means healers. And so this group that was Focused on healing again. For them, Pentecost was the greatest feast of the year. And what they would do on that day is they would have a massive meal, just this ongoing feast, right, throughout the evening and the night. And during that feast, they would have this marathon Torah study and exposition match. People just reading and preaching on the Torah and studying and arguing about the Torah over this huge, expansive meal."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8313.13,"end":8314.09,"speaker":"Fr Andrew Stephen Damick","text":"Big preach off."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8314.65,"end":8326.89,"speaker":"Fr Stephen De Young","text":"Yeah, because that's what the Torah was given, right? So those are all windows into the popularity and give you some background as to why those thousands of people were there, were there in Jerusalem."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8326.97,"end":8327.37,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8328.01,"end":8454.43,"speaker":"Fr Stephen De Young","text":"And so there is this emphasis, right, at Pentecost, there's this reaffirmation of repentance, of the putting off of the old life, right? Of the death of the old man, the crucifixion of our sinful flesh in community together. There is a reaffirmation of our baptisms. Not only that death, but then also the new life that comes afterwards, that death and resurrection not only of Christ, but of us in Christ, right. Through baptism, there's a reaffirmation of the new covenant as we pledge ourselves again to walk according to the Spirit, right? To live according to the Spirit, not according to the flesh and its sinful desires. And already in Second Temple Judaism, these kind of community reaffirmations were accompanied by public fasting. Public fasting is when people fast together, Right. As opposed to private fasting, which is when I fast about something by myself. Right. Periods of community fasting. And we can see how this idea and these understandings get incorporated into great Lent. That is, as we talked about at the end of the second half, there's this 40 day period of preparation, of repentance, of purification, in which those about to be baptized engaged before this whole cycle of events, beginning with Christ's death and then his resurrection and then his ascension and then the receiving of the Holy Spirit. Right. They already received the Holy Spirit in their Chrismation on that day. Right. Sort of proleptically."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8454.43,"end":8454.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8455.59,"end":8531.24,"speaker":"Fr Stephen De Young","text":"But this preparation for that, now we can see, hopefully, now that we've talked a little more here in this third half about this sort of public and communal act of reaffirmation, of concelebration, of Pentecost, how the church as a whole began to join in solidarity with those preparing. This was a natural thing coming out of Judaism at the beginning of the church, right. That this would be understood in this way, that, well, yes, I was baptized X years ago, right. I'm not preparing to be baptized this year. Right. These people are But I'm going to join with them in their fasting and in this period of purification and in this period of expectation in order to renew and reaffirm what happened in my baptism and what happened in my Chrismation and where I'm supposed to go after that. Right. What. The life that. That was intended to begin that I have faltered in."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8531.72,"end":8563.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and this is. This is one of the reasons why it's a good idea to. To go to baptisms and Chrismations, even if it's not somebody that you know. Right. I mean, and I'm sure a lot of people, like a lot of married people, for instance, have had the experience of going to a wedding, and it sort of reconnects you to your own wedding and makes you think about your marriage and all that kind of stuff, you know, like, that's all there. You're re. Participating in that for yourself."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8564.62,"end":8572.3,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Let me be controversial. Let me be controversial. Baptisms are not family events."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8572.7,"end":8574.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, no, no."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8574.94,"end":8576.54,"speaker":"Fr Stephen De Young","text":"They are community events."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8576.78,"end":8579.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because the person is being introduced into the community."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8579.58,"end":8581.34,"speaker":"Fr Stephen De Young","text":"Yeah. Your whole parish should be there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8581.74,"end":8618.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And. And I mean, just on a. On a practical level, for a lot of, you know, most Orthodox Christians, I think this is probably correct to say most Orthodox Christians get baptized when they're little babies, and so they have no, you know, conscious memory of the experience. And that's another reason why it's a good idea to go, is to renew that experience so that you actually do have a conscious memory of what all that is like. And. And you will hear again those words that were said when you were baptized and know that that has been done to you as well. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8618.13,"end":8627.09,"speaker":"Fr Stephen De Young","text":"And that's no obstacle to receiving a sacrament, by the way. I have. I have, like, zero conscious memory of my wedding."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8627.57,"end":8631.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8631.77,"end":8653.49,"speaker":"Fr Stephen De Young","text":"Those of you who are married may be able to identify. I remember. I have. I have grueling near PTSD about the wedding planning, and then the day itself is a blur. Right. And then I was married, so. Yeah. Right. Even if you've had an Orthodox wedding, you need to go to another one so you could actually hear the prayers."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8653.89,"end":8654.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8654.69,"end":8662.77,"speaker":"Fr Stephen De Young","text":"And think about them. So that's not something unique to babies being baptized. There's lots of sacraments that go by as a blur."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8663.39,"end":8665.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Ordination."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8667.23,"end":8669.55,"speaker":"Fr Stephen De Young","text":"Yeah. I don't remember that either."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8669.95,"end":8670.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8671.07,"end":8686.43,"speaker":"Fr Stephen De Young","text":"I remember that the people were singing Axios too fast. This is my only memory of my relation to the priesthood. The people were singing Axios too fast. And so I was, like, desperately struggling to Keep up in putting on the pieces of vestment."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8690.04,"end":8691.72,"speaker":"Fr Andrew Stephen Damick","text":"They'Re going to give me all axio'd out."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8691.88,"end":8701.32,"speaker":"Fr Stephen De Young","text":"Yes. That's the only conscious memory I have is that people were moving way too quickly and the bishop kept handing me pieces of vestment that I was like, they're tying this, trying to get them all on. Yeah."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8701.32,"end":8702.52,"speaker":"Fr Andrew Stephen Damick","text":"Where's the sub deacon?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8705.48,"end":8719.97,"speaker":"Fr Stephen De Young","text":"Yeah. So lots of them are a blur. Right. But, yeah, so this is something we do together as a community in solidarity with the people who are getting baptized as this reaffirmation, this recommitment as a group."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8721.49,"end":8722.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8722.37,"end":8723.73,"speaker":"Fr Stephen De Young","text":"As a group, as a whole."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8729.81,"end":8747.02,"speaker":"Fr Andrew Stephen Damick","text":"And that brings us to great Lent. Although, I mean, to me, like, if you've listened to the last 2 hours and 25 minutes and you didn't connect any of that to Lent, we have to lay that out for you. I would question whether you were really listening."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8747.34,"end":8749.74,"speaker":"Fr Stephen De Young","text":"Yes. So go back and listen to the whole thing again."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":8750.06,"end":9318.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly, exactly. But, yeah, I mean, it's. Yeah, yeah, exactly. So. Well, I mean, to bring some thoughts in here at the end, I remember years ago reading for the first time Father Alexander Schmemann's lovely book called Great Lent. And also, actually, it's been a long time since I've read it, and it's been a long time since I've read his book for the Life of the World. And so I might be mixing some stuff up, but they have a lot of common themes between them, as I recall. But I think one of the things that he says in one of those books, and maybe in both of them, is that a lot of people have the sense that the purpose of Christianity, of quote, unquote, religion, is to help. He uses that word to help. Right. Like, if you ask a lot of people, even a lot of orthodox people, what's the purpose of Lent, what's the point of it? They might say something like, well, it's, you know, makes me become a better person. Something like that. It's about becoming better. And, I mean, on a certain level, that's not wrong. Right. I hope that people emerge from the other end of Lent in a better state than they were in at the beginning. But I think that the problem with that framing of what's going on is that it looks at it as a kind of program that fits within the story of my life. And I understand that. I mean, we're all living in our own lives, and it's. The modern world trains us to think of our lives as being a story about ourselves that I'm the main character. I'm the hero of this epic tale. But that's just not true. It's just not. I mean, one of the things about learning to live the Torah in the heart is learning to live in humility. Humility is that key, key virtue from which all the other ones flow. And if you learn in humility, then you know that if you live in humility, then you know that the story is not about you. It's not about me. It is Christ's story, right? And so seeing that Lent is pointing towards Pentecost, that it's preparatory towards Pentecost, towards being enlivened by the Spirit, that it's this great sweep that is about what Christ is doing for us, to us, for the world, atonement, for the whole world, right? That it's that it's that that gives a different understanding of what's going on. And then the question is not, you know, how does this make me better? But rather, where do I fit into this story that is happening without me? Like it's happening whether I'm in it or not. But I can become part of it. I can participate in it, right? And one of the experiences that I've had and I know other people have had because I served in pastoral ministry for 13 years and I still work with people, you know, because I'm a member of a parish and I'm still a priest in the parish, is that when you conceive of great Lent or any of the disciplinary practices of the Church as being about getting better, as being about self improvement, it's really easy to get bogged down and discouraged because you try and you try and you might see some, some progress, maybe, but you might see none. You might see back and forth, one step forward, two steps back, and it's easy to become discouraged. This is true not just in great Lent. It's true in the other ascetical stories of our life. Marriage probably number one for those who are married. And I've never been a monk, but I've had monks tell me, nuns tell me that it can be that way for them. Parenting often feels like one step forward, two steps back. Or, you know, one step forward, two steps left, two, three steps right, whatever it might be. All kinds of relationships, all kinds of pursuits can become very discouraging when we think of it in terms of this is my story, but it's not my story. Listener, it's not your story. Actually, it's much better. I have much better news. It's Christ's story, and that Means that even if in my life, whether it's my experience of Lent, my experience of my marriage, my experience of parenting, my experience of friendship, my experience of ministry, whatever it might be, whatever it is, whatever is your experience, even though at certain points, or maybe even the apparent overall arc can be discouraging, right? I mean, it's likely that most of us, when we die, will feel like there was a lot left undone, didn't win at the end, not winning now, whatever it might be, however that goes, the point is so that we can enter into preparation for life in the Spirit, in this life, and ultimately in the life of the age to come in the resurrection, right? This life is about getting things in order so that we are prepared for that life. But it's not about simply waiting until that life starts. It's about becoming righteous now through the enlightenment of the Holy Spirit, who gives us the ability to do that, having the Torah, the law, the way of God, written in our hearts. A big piece of that is to know the Scriptures. I mean, if you had to ask me what the point of our whole podcast is about, is that people would want to know the Scriptures. And the more that you know the scriptures, like way deep down in your bones, the more the path opens up clearly in front of you. It doesn't make you walk the path. You can. You can learn about this book and not actually do what's in it, but it becomes clear as to what you should do. But also, it's not just a manual on the things that you should do. It's the story, the story, the great story, the last story, the first story. It's all those things all at once. And as we are, most of us, probably most of you listening to this right now, still a few weeks away from Lent this year in 2024, it starts on March 18, a few weeks away from Lent. As we begin to enter into that journey, look through it. Look towards Pascha, yes, we're looking for that, but also towards Pentecost, the life in the Spirit, and know that that's the point of renewal, true renewal. And now we're preparing ourselves for that. And I think that you will discover that whatever ups and downs, whatever detours, whatever sidetracks, deviations, failures, you experience between now and then, and I hope to God you experience triumphs as well, right? God give you that consolation that whatever happens, even if we have to drag ourselves across the finish line, Pentecost, that we know that we are doing it because we want to participate in Christ and his story and his Kingdom shall have no end. That's what I have to say about that."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9323.45,"end":9419.98,"speaker":"Fr Stephen De Young","text":"So one of the things I have to tell people over and over again in confession during Lent, and you get a lot of people who come to confession during Lent who don't always come to confession other times. But one of the things I have to tell them over and over again that surprises a lot of people at first is when I tell them that Lent is set up for you to fail. And they kind of say, what? Right? Because invariably those are the first things you get confessed, right? When you're hearing confessions, it's, well, I messed up keeping the fast and I didn't, etc. Etc. And so I point out that it's set up for them to fail. What would succeeding even look like? I mean, hypothetically, there could be a person out there who keeps the fast perfectly every moment of Lent, comes to every single service in their parish community, empties out their savings account and gives it to the poor, prays during every waking moment for the entirety of Lent, sleeps three hours a night because they're keeping vigils, staying up late, praying for all of Lent. Hypothetically, there could be such a person. I don't think I've met them. They'd have to do it all in secret, too. So, I mean, maybe I have, and they just. And they don't come to confession because they don't sin. But I don't think that person is out there."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9420.3,"end":9420.7,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9420.94,"end":9582.56,"speaker":"Fr Stephen De Young","text":"But let's say, hypothetically, that person did exist and that was you. Would keeping Lent perfectly like that be good for you? It would, at minimum, present a great temptation to pride about how well you've kept it compared to everyone else. At the very least, there would be that temptation also. That kind of prompts the question, if it's set up for us to fail, then why would you set up rules that pretty much everyone is going to fail in some way, in different ways and to different degrees, but everyone's going to somehow fail. Well, we have to ask again, what is the goal? And we talked about this sort of in the middle of the. In the middle of the show tonight. The goal here is self mastery. That's really the goal of the Christian life, right? To master yourself so that you can be mastered by the Holy Spirit. Because you can't really, as much as we say it over and over again in the liturgy, to really offer our whole selves to God, to really be able to do that, we have to first master ourselves. Because if there's some part of my Life, some part of my heart, some part of my soul, some part of my mind that is out of my control. I can't offer that to God. It's out of my control. Meaning it's probably deep into following the sinful desires of my flesh. So self control, that last fruit of the spirit. I think that may be why it's listed last. Because it's the hardest one, right? It's the hardest one. So how do you develop that? How do you take control of these things? Well, we talked about that too, right? If my gluttony is out of control, how do I counter that? Well, by fasting. If my laziness is out of control, how do I counter that? Well, by vigils, by staying awake, by denying myself the kind of rest and leisure that I want to indulge in."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9583.52,"end":9583.88,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9583.88,"end":9622.15,"speaker":"Fr Stephen De Young","text":"How do I discipline my spending habits? How do I discipline how I waste time? Lent gives us opportunities to do all of that and to fail at it. And by giving us that opportunity to fail, it shows us the areas where we're weak. It shows us the areas where we're still out of control. As an example, one of the questions I get about fasting invariably is, oh, when it says we can't have wine and oil, does that mean no alcohol."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9622.23,"end":9623.43,"speaker":"Fr Andrew Stephen Damick","text":"Or just no wine?"}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9625.67,"end":9961.85,"speaker":"Fr Stephen De Young","text":"And I always tell people that means all alcohol. Regardless of what the Russians say, that means all alcohol. And I say to them, here's why I say that. Because if you can't go 40 days without alcohol, that'll tell you something about your relationship with alcohol. You will learn something about yourself. Because self mastery begins with self knowledge. So does repentance. If we don't really know ourselves, we can't get control of ourselves and we can't really repent. And you say, well, how could I not know myself? We're in denial about a lot of things. We lie to ourselves a lot. But when it comes down to it, right, I can say, oh, I'm in control of myself. All I want. I can say, no, I make my choices. No, I'm not controlled by passions. No, I'm not, you know, I'm not mastered by anything. And then you ask me to eat a peanut butter and jelly sandwich for lunch instead of a ham and cheese sandwich. And I'm like, I can't do it, right? I've been lying to myself. So Lent gives us this opportunity to see all of our weaknesses, to see just how much our life, the rest of the year is out of control. And by gaining that knowledge, to begin to get a handle on controlling it. I sometimes, when I'm talking to people, compare great Lent to boot camp in the military. No one in the military continues to keep the level of discipline that they have in boot camp for their entire military career. It would kill them, right? You can't do it. Boot camp is deliberately this ultra intense period of time. In the same way that we don't tell people, no, you need to keep great Lent all year round. That would not be a good thing. That would not be a good thing for you. But if you go through boot camp in the military and then when it's over, you forget everything you learned about yourself and you discard all of the discipline you developed completely and go to see that it was a waste, it was a waste of time, there was no reason to do it. Same is true of great Lent. If you get to Pascha and we all feast at Pasca, we all have a party at Pascha. Nothing wrong with that. We're celebrating, right? But if everything you learned about yourself during Lent, if all the weaknesses you learned about, if all the places where you need to do some work, you forget about it, then Lent was a waste and you shouldn't have bothered. But on the other hand, if we remember that we now have sort of a spiritual curriculum for the next year, we now have a better idea of what's wrong, where we need to work, where we need to ask for God's help, where we need to focus our attention, and we have this curriculum to get us through to the next year. And then the next year there will be great Lent again and there will be another test. And sometimes we'll find out we're still weak in some of the areas where we thought we were doing a lot better. And in some cases we'll do better in some areas and then worse in others. Because this isn't a one time thing where, okay, now I've got it licked. No more sin in my life. But it is an ongoing thing of struggling to continue to walk according to the Spirit and not walk according to our flesh. And Lent is this time of focus, of renewal, of recommitment that can shape our whole year and through shaping the years of our life, end up shaping our whole life. You will get as much out of this great Lent and every great Lent as you're willing to put into and commit to it. If you decide to ignore the fast, if you decide to ignore the extra services, if you decide to ignore all these things, you're not going to get it with the lightning bolt. You're not going to go to hell for it, but you'll be missing out on a whole set of blessings that you could have in your life. You'll be missing out on the fruit that living according to the Spirit can bring in your life. You'll be missing out on peace. You'll be missing out on joy. You'll be missing out on love that could be in your life if you are working to follow the Spirit. So each of us has a choice to make a series of choices during great Lent. Hopefully what we've talked about tonight in various ways will help all of us as we come to this great Lent to make the right choices and the harder choices and help us all commit to failing, sometimes failing spectacularly and in interesting ways in order to learn about ourselves, to continue to grow, and to recommit to following the Holy Spirit who's leading us to Christ."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9963.77,"end":9990.94,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that's our show for tonight. Thank you very much for listening everybody. If you didn't happen to get through to us live tonight, we'd still like to hear from you. You can email us@lordofspiritscientientfaith.com you can message us at our Facebook page, leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help finding a parish, head over to orthodoxintro.org and join us for our."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":9990.94,"end":10000.43,"speaker":"Fr Stephen De Young","text":"Live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. If I saw something new I guess I wouldn't worry. If I saw something new I guess I wouldn't care."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":10001.15,"end":10010.91,"speaker":"Fr Andrew Stephen Damick","text":"If you are on Facebook you can follow our page, you can join our discussion group, leave reviews and ratings everywhere, but most importantly share the show with a friend who is going to love it."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":10011.87,"end":10026.76,"speaker":"Fr Stephen De Young","text":"And finally be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. You said you're always sleeping, but if so I'll be leaving. It's just that I'm always falling and it makes me feel bad. Shoegaze for you people."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":10027.16,"end":10031.16,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night, God bless you and a blessed lent to you."}
{"episode_id":"LOS - #087 - 2024-02-22 - The Season of Virtue","start":10037.24,"end":10074.46,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
