{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":0.32,"end":64.94,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall and he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5 the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":66.7,"end":250.15,"speaker":"Fr Andrew Stephen Damick","text":"Good evening all of you out there in radio land, all of you giant killers, dragon slayers, stretchers of serpents, stompers on scorpions, whatever is required. You're listening to the Lord of Spirits Podcast. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Steven Damick in Emmaus, Pennsylvania, where the leaves are starting to turn and we are live. So if you're listening to us live, you can call us at 855-237-2346 and talk to us and we're going to get to your calls in the second half of the show and Matuska Trudy will be taking your calls. So the Lord of Spirits Podcast is brought to you by our listeners with help from Lore Coffee Roasters. Lore Coffee Roasters is a specialty coffee company owned and operated by two Orthodox Christian families working to glorify God in all things. The Lore team is focused on sourcing and roasting the highest quality coffee from all over the earth and having it delivered to your door in a seamless experience. They have built a subscription platform on their website, making it easy for you to choose your coffee, how much of it you would like, how often you want it delivered. They are also equipped to provide wholesaling solutions for selected partnerships. Help support Lord Spirits by choosing Coffee from Lore Coffee Roasters, an Orthodox specialty coffee company, and be part of the story behind Good Coffee. View their coffee library and subscription plans@loreroasters.com youm can follow them on Instagram and Facebook at Lore Coffee roasters and for 10% off of your first order, you can use the discount code LOS10. So that's LOS10. And I should, I should tell, you know, everybody that they, they sent me a sample of the coffee because I don't just want to talk about them, like, you know, want to have some coffee? Pretty good. Also, probably the only bag of coffee that you buy that has seraphim on the packaging. So that's kind of cool. So get your coffee, everybody. That's Laura's an L O R E, which is a good old English word meaning knowledge. Anyway, tonight we are completing the two parter that we started last time, which was all about idolatry. Last time. Tonight's episode is about iconography. There is a lot of confusion out there about the relationship between these two things, with a lot of people thinking that if you just do over the top icon veneration, then you can slip over into idolatry. To a lot of modern people, icons and idols seem awfully similar. Are they really though? Are the Orthodox dancing close to idolatry and some poor illiterate peasants accidentally stepping over the line, whoops, you did an idolatry. To understand that, we need to talk about iconography. So idolatry and iconography really just have two things in common. Right. Images and religion. Is that right, Father?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":252.31,"end":252.71,"speaker":"Fr Stephen De Young","text":"Actually."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":254.55,"end":257.11,"speaker":"Fr Andrew Stephen Damick","text":"Already know. I'm actually here at the beginning of the episode."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":257.11,"end":259.07,"speaker":"Fr Stephen De Young","text":"Yes, already, man."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":259.07,"end":260.63,"speaker":"Fr Andrew Stephen Damick","text":"I'm already feeling demoralized."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":261.19,"end":306.09,"speaker":"Fr Stephen De Young","text":"It's Thursday night. You know what that means? So, yeah, we kind of implied that last time. Yeah, right. But as we get into it, even that is going to break down a little bit. But so I think a lot of the problem in these discussions between Orthodox folk and other folk regarding iconography, as we mentioned last time, is that these things are seen to be idolatry, and iconography are seen to be essentially one phenomenon."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":306.73,"end":307.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":308.49,"end":336.23,"speaker":"Fr Stephen De Young","text":"And I think a lot of, for example, our Protestant friends think that this is just word parsing. So, like when pagans do it, it's called idolatry. When Jewish people of the Old Testament did it, because they weren't supposed to, it was idolatry. And then when the Orthodox Church does it, we say, no, it's iconography. It's a totally different thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":336.47,"end":341.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, you get the sense sometimes with some of the criticism that we're really just trying to pull a fast one on everybody."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":342.47,"end":382.92,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And what we really have set out to do in these two episodes, as we mentioned last time, and I think will become increasingly clear now as we go through the second, the two phenomena is that they are separate phenomena. They are two different things. Right. So last time we talked about pagan idolatry, we talked about Israelite idolatry, We talked about how idolatry still goes on among Christians and in Christian churches as a phenomenon. And now this episode may be unexpectedly to a lot of people, we're going to talk about pagan iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":383.32,"end":383.96,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":384.76,"end":389.16,"speaker":"Fr Stephen De Young","text":"Yes, And Israelite iconography. And Christian iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":389.32,"end":397.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it turns out that iconography and idolatry exist alongside each other in the same community. There are people who are doing both."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":398.2,"end":465.47,"speaker":"Fr Stephen De Young","text":"Yes. And doing one or not the other. Yeah. But yes, and this is what you. If these are, as we've been claiming, if these are two separate phenomena, that is what you would expect to find. Right. You would expect to find both phenomena existing in a variety of places. It would look a little suspicious if everywhere other than the Orthodox Church there was this one thing, idolatry. And then in the Orthodox Church, we were saying, oh, no, there's this other thing, iconography. Right. But that's not the case. Right. So within idolatrous pagan communities, there's also iconography. It's distinguishable from idolatry. Right. As a separate phenomenon, even there. And that's where we're sort of starting out tonight. But also because of that, I have to. I'm actually you. On that introductory point. Right. Because obviously images, visual images are involved in both, right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":465.47,"end":466.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":466.19,"end":479.02,"speaker":"Fr Stephen De Young","text":"That's not actuallyable. Right. Yes, there is artisanship involved in the production of both. Right. But at that point, we're in a really broad range, Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":479.02,"end":479.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":480.22,"end":487.58,"speaker":"Fr Stephen De Young","text":"Right. So, I mean, idolatry and pornography are also involve imagery."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":487.98,"end":488.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":489.26,"end":495.66,"speaker":"Fr Stephen De Young","text":"There are many, many now distinguishable phenomena involving imagery that everyone would want to distinguish from one another."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":496.03,"end":497.63,"speaker":"Fr Andrew Stephen Damick","text":"McDonald's Happy Meals, for instance."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":497.79,"end":502.35,"speaker":"Fr Stephen De Young","text":"Yes, I would. I would distinguish. Well, you know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":504.67,"end":506.43,"speaker":"Fr Andrew Stephen Damick","text":"Do people. McDonald."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":507.23,"end":515.31,"speaker":"Fr Stephen De Young","text":"Well, I have a certain. I have a certain latent childhood affection for the Happy Meal, even though the Happy Meal is a shadow of what it once was."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":516.03,"end":517.39,"speaker":"Fr Andrew Stephen Damick","text":"That is very true."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":517.79,"end":519.79,"speaker":"Fr Stephen De Young","text":"You don't get the cool box anymore."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":519.95,"end":522.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kids will never understand the way Happy Meals used to be."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":523.29,"end":535.53,"speaker":"Fr Stephen De Young","text":"Yeah, you don't get the cool box anymore with the puzzles and games on the outside. No, no, the toy is just like. Is cheap, has like zero points of articulation, is trying to get your parents to take you to see a movie."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":535.85,"end":537.13,"speaker":"Fr Andrew Stephen Damick","text":"Food is even smaller."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":537.53,"end":551.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, it's. Yeah. And. And worst of all, from my perspective, is the whole like, oh, we'll give you apple slices instead of French fries."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":554.33,"end":556.65,"speaker":"Fr Andrew Stephen Damick","text":"No one goes to McDonald's for healthy food."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":556.89,"end":567.37,"speaker":"Fr Stephen De Young","text":"Yes, exactly. Why are you there? And they even betray their own premise because they give you the apple slices with caramel dip. Right. So, like. Right, you've already."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":568.57,"end":574.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like, I didn't know this was the rant we were gonna start off with, but here we go."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":574.29,"end":581.29,"speaker":"Fr Stephen De Young","text":"Yes. So you know the classic Happy Meal wither. The classic Happy Meal, Alas."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":581.45,"end":581.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":581.85,"end":583.89,"speaker":"Fr Stephen De Young","text":"We hardly knew you, but, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":583.89,"end":585.77,"speaker":"Fr Andrew Stephen Damick","text":"So there's other kinds of iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":585.85,"end":586.33,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":586.57,"end":586.97,"speaker":"Daniel","text":"So."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":587.13,"end":595.53,"speaker":"Fr Andrew Stephen Damick","text":"So the second and the. I was gonna say the other thing is like, the idea that there is this separate thing called religion is a very modern notion."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":596.17,"end":601.29,"speaker":"Fr Stephen De Young","text":"Right. And that's the second category. That's the. They both involve religion parts."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":602.02,"end":602.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":603.22,"end":620.02,"speaker":"Fr Stephen De Young","text":"And the problem there is basically. Well, it's. It's twofold. On one hand, it's using this modern category of a religion. Right. Where religion is sort of its own independent variable."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":620.74,"end":621.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":622.26,"end":703.26,"speaker":"Fr Stephen De Young","text":"Which is very modern. Right. Because before the modern period, identity with a people, with a people group. Right. With a tribe, a clan. What gets translated now somewhat anachronistically as a nation was sort of a holistic kind of identity. So it involved a way of life. It involved the food you ate. It involved the gods you worshiped and how you worshiped them. It involved a whole cycle of feasts, festivals, things attached to the harvest and things attached to the spring. And all of these things were all bound up together as sort of one whole. Right. So you talk about the ways of a given people, and that gets broken down when we get into the modern period and you start forming what really ends up forming. There are any number of things that could have potentially been a rallying point around which people formed identity. One of them could have been religion. But the Thirty Years War happened, and folks in Europe decided that was a bad idea."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":703.5,"end":704.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":705.74,"end":732.19,"speaker":"Fr Stephen De Young","text":"Because you had Protestants and Catholics murdering each other. So what it ended up becoming was nationalism. It ended up becoming the nation state. And when it became the nation state. Right. This means that identity with the nation has to be absolute. And then everything else becomes an independent variable. Religion becomes an independent variable, for example."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":732.19,"end":733.59,"speaker":"Fr Andrew Stephen Damick","text":"You can do that at home, if you like."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":733.91,"end":783.07,"speaker":"Fr Stephen De Young","text":"Right. Politics becomes an independent variable. All these things are second to whatever you are. You can sort of plug in whatever into religion. So now we have this idea of religion or a religion and of religious beliefs. And it's mostly considered in terms of beliefs because we're dealing with early modern Northern Europe here. So mostly Protestant, but also practice. We could throw in practices. Right. Religious beliefs and practices as this Separate thing. And so then you can put things in that box. Right. So if you're approaching it from that view. Okay. Most of what gets called iconography in the Orthodox Church. Right. Orthodox iconography would obviously, because I had to specify orthodox, be in the religion basket."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":783.79,"end":784.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":784.59,"end":796.07,"speaker":"Fr Stephen De Young","text":"Idolatry would be in the religion basket. Right. But iconography is a category without that qualifier. Covers a whole lot of things. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":796.07,"end":797.79,"speaker":"Fr Andrew Stephen Damick","text":"So what could that be? Uncle Steve?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":798.19,"end":799.15,"speaker":"Fr Stephen De Young","text":"Ronald McDonald."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":801.53,"end":802.09,"speaker":"Fr Andrew Stephen Damick","text":"Grimace."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":802.41,"end":809.45,"speaker":"Fr Stephen De Young","text":"Not. Yes, Grimace. Who somehow is connected to shakes. But that's a whole other. Yeah, there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":809.45,"end":809.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":809.81,"end":812.17,"speaker":"Fr Stephen De Young","text":"Not the time for all my McDonald's rants all at once."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":813.93,"end":816.33,"speaker":"Fr Andrew Stephen Damick","text":"I had no idea that you had like a cash if."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":816.65,"end":818.17,"speaker":"Fr Stephen De Young","text":"Oh, yeah, McDonald's rants."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":818.41,"end":818.97,"speaker":"Daniel","text":"The whole."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":818.97,"end":824.21,"speaker":"Fr Stephen De Young","text":"The whole McDonald's mythos. Makes no sense. Makes no sense."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":824.21,"end":829.14,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the figures are very strangely, like the only thing that links them is that they're putting them together."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":830.82,"end":832.5,"speaker":"Fr Stephen De Young","text":"Are the fry guys made of fries?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":833.14,"end":833.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":834.34,"end":846.58,"speaker":"Fr Stephen De Young","text":"Do they cook the fries? Why are they hanging out with a hamburglar who's stealing hamburgers? He's not going to eat them as a side. Anyway. Okay, back to the topic. So, Ronald McDonald, Mickey Mouse."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":846.58,"end":846.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":848.5,"end":893.89,"speaker":"Fr Stephen De Young","text":"Zooogy's iconography. But even more pertinent to the dynamic we were just talking about the iconography that becomes sort of foremost during that same period, including taking to itself a lot of religious iconography is the nation state. Nationalism sort of adopts iconography and. Right. We can. We could all come up with a. A thousand examples of this. Right. In the United States, obviously, there's a lot of prominent iconography of the nation state. The American flag."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":894.13,"end":902.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's number one. Right. But also, like, you've even got mythological figures like Uncle Sam or, you know, George Washington, basically mythological figure."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":902.33,"end":904.37,"speaker":"Fr Stephen De Young","text":"Now the bald eagle."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":905.17,"end":905.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":905.57,"end":910.4,"speaker":"Fr Stephen De Young","text":"Right. And on and on and on. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":912.4,"end":912.8,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":915.04,"end":942.64,"speaker":"Fr Stephen De Young","text":"That while sometimes it has flirted with religion. Right. And we talked last time about how there are idolatrous uses of that sort of thing. Even if we're talking very strictly the way we talked about the state being able to become an idol last time is different than just viewing the iconography of the state."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":943.52,"end":944.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":944.8,"end":968.25,"speaker":"Fr Stephen De Young","text":"Right. So there's. There's a difference between making the American state an idol, where it's what you're putting your trust in. Right. And it's what you see as. As having the power to control your destiny. Right. And going to a fireworks show on the Fourth of July. And I think we know intuitively that these are different things."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":968.41,"end":969.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":970.25,"end":1038.27,"speaker":"Fr Stephen De Young","text":"Right. I think we know intuitively the difference between those two. One can Certainly do both, but it's also possible to do one or the other. There's a good book about this called Earthly Powers that has a lot of photos and visual examples showing religious iconography in Europe from before the French Revolution and then the way in the 19th century, leading up to World War I, the various nation states of Europe started adopting and repurposing a lot of that religious iconography as iconography of the state. And I will go ahead and throw this out there. So in addition to thinking that idolatry and iconography are sort of this one single phenomenon. Right. Another part of the related criticism is that veneration and worship are the same thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1039.15,"end":1055.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, you can even see, like, mocking memes, usually aimed at Catholics, God bless them, you know, saying it's just quote, unquote, veneration. Like, we all know that you're worshiping Mary. You're just calling it veneration, you know?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1055.97,"end":1060.21,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Because either those are the same thing or they're on a plane. Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1060.21,"end":1060.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1060.57,"end":1104.7,"speaker":"Fr Stephen De Young","text":"Like we said last time, you venerate too hard and do an idolatry. But allow me to submit, especially if you're one of those folks, since we just brought up the iconography of the state. So when someone goes to a ball game, and right before the ball game begins, they stand up and they put their hand over their heart, and they stand and look at an icon of the nation state, namely the American flag, and they sing a hymn about how beautiful and wonderful America is. Is that veneration or worship?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1107.18,"end":1107.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1108.22,"end":1118.96,"speaker":"Fr Stephen De Young","text":"I'm not saying this to say it's worship. I'm saying this to say it's veneration. They are venerating the floor."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1119.11,"end":1119.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1119.31,"end":1135.67,"speaker":"Fr Stephen De Young","text":"They are venerating the flag. But so if you need an intuitive place, if the religious place isn't intuitive enough for you to make that distinction. Distinction doesn't make sense in your gut. Here's a place where I think it will."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1136.31,"end":1174.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or, I mean, like, another example I like to give is the way that people behave in cemeteries. Right. Traditionally, people go in there, they go quiet. They, you know, come up to the grave of their loved one. They might put flowers there. They might talk to that person at the grave. They certainly would not spit on it or, you know, desecrate. Like, they wouldn't treat it disrespectfully. Like, there's a sense that I need to treat this rock respectfully. Right. And. And yet there's not a sense of, oh, I'm worshiping this dead spirit."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1175.29,"end":1178.09,"speaker":"Fr Stephen De Young","text":"Everybody knows that's. Not the same thing as ancestor worship."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1178.17,"end":1186.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. If I put flowers next to this or light a candle next to it or whatever, it's not ancestor worship."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1186.57,"end":1189.85,"speaker":"Fr Stephen De Young","text":"Yeah. Ancestor worship is a thing, but it's a different thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1190.09,"end":1191.01,"speaker":"Fr Andrew Stephen Damick","text":"It's not that thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1191.01,"end":1201.96,"speaker":"Fr Stephen De Young","text":"Yeah, that's not the thing. It is. Yeah. For a minute there, I was worried that you were going to talk about how people behave in seminaries, which is scandalous for all parties involved."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1202.12,"end":1203.72,"speaker":"Fr Andrew Stephen Damick","text":"There is a lot of overlap."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1205.72,"end":1209.72,"speaker":"Fr Stephen De Young","text":"In my experience. No, there isn't. People are very respectful in cemeteries."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1210.68,"end":1212.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I was talking about the death part, but."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1212.92,"end":1213.88,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1214.52,"end":1215.72,"speaker":"Fr Andrew Stephen Damick","text":"It will bury you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1217.16,"end":1222.2,"speaker":"Fr Stephen De Young","text":"There are people who are sad. Yes. There's a lot of weeping, occasional gnashing of teeth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1222.2,"end":1223.56,"speaker":"Fr Andrew Stephen Damick","text":"Weeping teeth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1225.81,"end":1226.05,"speaker":"Daniel","text":"So."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1229.09,"end":1294.97,"speaker":"Fr Stephen De Young","text":"That said. Right. That iconography is not purely a religious phenomenon. Right. And so really the only connection between the two phenomena of idolatry and iconography is that they both involve images. Right. What then? If we're going to talk about, like last time we talked about the phenomenon of idolatry, sort of in its origins, how it works, we're going to try tonight now, for the rest of the night to talk about, do the same for iconography. And hopefully along the way everybody will, if they don't already start seeing the difference, that these are two different things, the difference between these two phenomena. And so to get into iconography and its origins, we have to talk about the relationship between myth and image. And to talk about the relationship between myth and image, we kind of have to define myth first."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1295.37,"end":1298.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Let's do a little bit of review, everybody."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1298.09,"end":1313.1,"speaker":"Fr Stephen De Young","text":"Yeah. So we have talked about this before, but I think it's been a while. So unless you're one of those folks who's a long haul trucker and just did their fifth re. Listen to the whole. The entire show, all what, 200 plus hours of it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1313.26,"end":1319.1,"speaker":"Fr Andrew Stephen Damick","text":"200 hours? Yeah. Which is a thing. I mean, we hear from some long haul truckers that have listened to this."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1319.58,"end":1379.75,"speaker":"Fr Stephen De Young","text":"Yeah. So those folks will be familiar. But for everybody else. So myth, a myth, mythos literally means story in Greek. But it's not just any story. It's a particular type of story. It's a story that has a sort of ongoing life. Sort of ongoing life. Anybody can write stories, anybody can make up stories. Anybody can relate events in the past from a perspective as a story. Right. But a myth is a story that has a particular ongoing significance and it has that ongoing significance within a community, a community of people. So a myth is not just a story that like. So I might Have a story about me and my dad doing something when I was a kid. That has ongoing significance to me."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1380.47,"end":1381.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1381.83,"end":1388.95,"speaker":"Fr Stephen De Young","text":"But that doesn't have. And maybe even to some of my family members. But that's not really a myth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1389.11,"end":1389.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1389.47,"end":1427.92,"speaker":"Fr Stephen De Young","text":"It becomes a myth when it has an ongoing importance to a wider community. That story from my childhood, while it might be interesting or even have some valuable lesson for the people, say, in my parish, right. If I used it as a sermon illustration or something on a Sunday, that story would not be a story that they then go and repeat and gets repeated and goes on for generations. And if it did, it would become a myth. So that's. That it would be a myth. Right. So that ongoing significance means it continues to be passed down, generally generationally."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1428.4,"end":1428.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1430.24,"end":1443.6,"speaker":"Fr Stephen De Young","text":"And it continues to have a ritual life. And we'll talk about that more here in a second. But it's important we also mention the difference between myth and mythology."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1444.78,"end":1457.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Mythology is basically when the participation drops out and it's no longer a story that kind of defines a people. It's sort of just a story."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1459.02,"end":1462.78,"speaker":"Fr Stephen De Young","text":"Right. A myth dies. And so now you can dissect it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1463.42,"end":1463.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1464.3,"end":1480.47,"speaker":"Fr Stephen De Young","text":"Now you can look at it, take it apart, try to figure out how it worked. Right. What purpose it was serving. You can compare it to other stories. You can see if it has a half life somewhere else or something, but by that point, it is dead."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1480.87,"end":1485.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not like it's not a driving force behind who your community is."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1486.47,"end":1495.83,"speaker":"Fr Stephen De Young","text":"Right. So this is. This is the difference between reading Homer in the second century BC and reading Homer today."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1496.88,"end":1498.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1501.52,"end":1521.12,"speaker":"Fr Stephen De Young","text":"Or reading Hesiod and reading Edith Hamilton's mythology. These are. These are different things. And it's from the latter category, mythology, that the common modern use of myth to mean something not true comes from. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1521.12,"end":1523.04,"speaker":"Fr Andrew Stephen Damick","text":"Like people say, that's just a myth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1523.93,"end":1603.34,"speaker":"Fr Stephen De Young","text":"Right. And so mythology, it is true. That mythology isn't true because it's not true anymore because it has no connection to the real world of existing people anymore. But all myths, while they're alive, have at least a certain kind of truth to them. That doesn't mean they're, quote, unquote, literally true. Right. Or, you know, strap on a GoPro and get in a Tardis. Right. Like you could find a place where these events actually happened exactly the way they happened in a particular telling of the story that. Not that modern kind of truth, which, as we've said, that kind of objective idea of truth doesn't actually exist, but a truth in that the story Actually had an effect in the world through its ritual life in the lives of actual people who exist in the world. And it shaped and motivated their actions in the world in a way that produced those effects. And that's real. So that's true in that sense."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1603.58,"end":1606.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's an actual experience people are really having."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1606.78,"end":1630.46,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. So as we said, the way in which myth. This myth has life in this community of people in this ongoing, even generational way is through ritual. And we've talked about ritual before. This is a broad definition of ritual."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1630.88,"end":1631.04,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1631.04,"end":1632.88,"speaker":"Fr Stephen De Young","text":"Rituals, obviously, repeated behavior."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1633.44,"end":1633.84,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1636.48,"end":1672.68,"speaker":"Fr Stephen De Young","text":"And in this case, repeated communal behavior. There are some very obvious ways in which myths get ritualized. Probably the most obvious is ritual storytelling. Right. There's a time and place and circumstance repeatedly in which that story is told, and it is generally told by a particular person and told even in a particular way. Now, when I say in a particular way, I do not mean that all the details are the same in each telling."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1674.68,"end":1675.72,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1676.68,"end":1760.49,"speaker":"Fr Stephen De Young","text":"So you can read. I mean, you can read if you're a nerd. You read sociological studies of storytelling in oral based cultures. Right. And they found, for example, that you can have two stories. Like I said, there's usually a particular person who does this, whether that person is some kind of what we would call clergy figure or whether it's a paternal figure who tells the story or whomever. Right. There's generally a designated storyteller, and you could take it in oral culture, two designated storytellers who regularly tell the same story, and where one tells the story and it's say 45 minutes long in his telling, and another one tells it, and it's 25 minutes long in his telling. You could have the 45 minute long storyteller listen to the 25 minute storyteller and ask him, so did he get the story? Right? And he'll say yes. They'll ask him, did he leave anything out? Nope. And of course, the western people doing the study, the sociologists, are like, you Left out like 20 minutes, man, for the way you tell it. Like, what do you mean he didn't leave anything out?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1760.81,"end":1765.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Because we think quantitatively about these kinds of things."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1766.05,"end":1766.25,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1766.25,"end":1767.17,"speaker":"Fr Andrew Stephen Damick","text":"You know? Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1767.17,"end":1768.77,"speaker":"Fr Stephen De Young","text":"And we're not an oral based culture."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1769.17,"end":1773.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. A story, this pile of stuff. This exact pile of stuff."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1774.13,"end":1774.61,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1775.01,"end":1808.64,"speaker":"Fr Andrew Stephen Damick","text":"You know, whereas like, I mean, like a really good example, for instance, since you mentioned northern Europe earlier, you know, there's a story called the Volsunga Saga, the saga of the Volsungs, and there are multiple Versions of it in different Germanic languages. And they do not all line up. Like you can't make them work perfectly with each other. And yet that set of traditions is the Volsinga saga. You know, it just is, even though the details are not. Are not exactly the same from one version to another."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1810.32,"end":1814.48,"speaker":"Fr Stephen De Young","text":"Right, right. And that it's fundamentally different once you get to a text based society."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1814.96,"end":1816.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1816.12,"end":1821.17,"speaker":"Fr Stephen De Young","text":"So now Peter Jackson comes along and tells a story and everybody's like, bro, you left out Tom Bombadil."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1821.4,"end":1823.32,"speaker":"Fr Andrew Stephen Damick","text":"How dare you, sir? Yes, I did."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1823.4,"end":1828.92,"speaker":"Fr Stephen De Young","text":"Right. So, but that's because. That's because there's a written text."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1829.4,"end":1830.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That people can look at."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1830.92,"end":1857.95,"speaker":"Fr Stephen De Young","text":"There's a written text people could refer to and say, you left out this. This is now the real version of the story because it's been enshrined in text. Right. But in oral culture there isn't. Right. So the way of telling a story that I'm talking about that makes it ritual is not all the details and all the words being the same words in the same order. Right. But it's the overall thrust and purpose of the story."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1859.23,"end":1859.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1859.87,"end":1889.05,"speaker":"Fr Stephen De Young","text":"Because remember, ritual does something. So the telling of this story is supposed to do something. It's supposed to create a state of consciousness in the people who are participating in the storytelling. Right. And so if it does that, then it has been done correctly. If it fails to do that, then there's been a failure somewhere in the process. Right. So, yeah, ritual storytelling is the most obvious."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1889.77,"end":1890.09,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1890.09,"end":1895.45,"speaker":"Fr Stephen De Young","text":"Way in which a story can be ritualized, I think. But also, of course, this includes reenactment."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1895.93,"end":1896.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1896.37,"end":1898.41,"speaker":"Fr Stephen De Young","text":"Various forms of ritual. Reenactment of the story."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1898.97,"end":1904.57,"speaker":"Fr Andrew Stephen Damick","text":"Doing things like, you know, a Palm Sunday procession to actual reenactment."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1904.57,"end":1908.33,"speaker":"Fr Stephen De Young","text":"Yeah, Right. Or the Passover meal."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1908.81,"end":1909.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1909.21,"end":1949.72,"speaker":"Fr Stephen De Young","text":"Right. Everyone dresses as if they're about to flee from Egypt, even if they're living in Brooklyn. Right. Like you're reenacting this thing and thereby participating in it in that story. But also something we may not think about singing the story. Most of these stories, Homer. Right. These were sung and taking something and singing it rather than saying it in sort of a prose style serves to elevate it, serves to give it a different character."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1951.49,"end":1951.73,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1952.45,"end":1972.45,"speaker":"Fr Stephen De Young","text":"To the public, participation in it and yields new ways. Right. If you think about someone, you know, picks up a guitar, picks up a piano. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1973.25,"end":1974.61,"speaker":"Fr Andrew Stephen Damick","text":"Put it down. Put it down, Father."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":1974.61,"end":2024.06,"speaker":"Fr Stephen De Young","text":"Yeah. And starts to. Starts to sing something. Right. The fact that they're singing, the people who are around that person are able to participate in that. In A different way than if he just started telling a story. Right. Even if you don't know the words, you'll kind of get the hang of the melody after a while. Right. And so singing a story is another way to ritualize it, sort of in this way, in this collective setting. But germane to our topic tonight, another way of ritually reenacting a story is through visual depiction."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2024.54,"end":2032.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Paint it on the wall, paint it on a panel, make it into a statue, carve it in a frieze."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2032.86,"end":2051.14,"speaker":"Fr Stephen De Young","text":"Right? Because then when someone, right, the viewer or the group or the people stand in front of it, right. And look at it, right. They are reconnected with that story. If it's a story they know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2054.34,"end":2054.74,"speaker":"Fr Andrew Stephen Damick","text":"Or."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2054.74,"end":2152.83,"speaker":"Fr Stephen De Young","text":"In particularly well done iconography, it can tell the story all by itself, even if they don't know it. Or it could be used in conjunction with the telling of a story. Right. And so, and so this is. There's ritual activity on both sides of producing iconography. The production of it is a ritual activity because you are taking, right, that story and you are giving it visual form in the same way that telling it or singing it, right. Or participating and acting it out would be a ritual activity. Right. That's giving reality and ongoing life to that story. And then on the other side, those who are viewing it, there is an ongoing ritual activity there. Right. And these are not. Right. So this is part of why we had to disambiguate the religion thing at the beginning. Right. Because of course, in the ancient world, these things aren't separated. In the modern world, they are. But when big groups of people get together to see the same movie over and over again in theaters, right. It's a ritual. They're doing the same thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2153.15,"end":2157.79,"speaker":"Fr Andrew Stephen Damick","text":"And sometimes, depending on the movie, they might, like, dress in a special way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2158.11,"end":2158.67,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2158.67,"end":2161.07,"speaker":"Fr Andrew Stephen Damick","text":"Like go to a Star wars premiere. You will see."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2161.55,"end":2167.79,"speaker":"Fr Stephen De Young","text":"Allow me to be the first one, I think, in the history of ancient faith to mention the Rocky Horror Picture show on air."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2168.03,"end":2171.83,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes. I can't admit to knowing anything about that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2171.83,"end":2179.69,"speaker":"Fr Stephen De Young","text":"But to which people have been going to midnight showings for decades, decades. Dressing up as characters. They've memorized all the lines."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2180.41,"end":2181.61,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2181.93,"end":2190.17,"speaker":"Fr Stephen De Young","text":"Right. And this is ritual activity, Right? This is stuff that's built into how we work as humans."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2190.49,"end":2197.13,"speaker":"Fr Andrew Stephen Damick","text":"Some cases they'll even have a cast acting out the thing on a stage while the movie is playing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2197.45,"end":2199.37,"speaker":"Fr Stephen De Young","text":"Yeah, that's."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2199.45,"end":2199.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2201.81,"end":2205.89,"speaker":"Fr Stephen De Young","text":"So this is all functional ritual activity."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2205.89,"end":2206.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2206.93,"end":2261.39,"speaker":"Fr Stephen De Young","text":"So as Christians, we believe that like all properly human activity, it has its ultimate focus on bringing us closer to God. And that's its correct usage. Right. The correct usage of ritual, including iconography, is right. To bring us closer to God. But because it is properly human, it is kind of ubiquitous and could be used for all kinds of things, good and bad. But any of these ritual functions are unavoidable because they're built into us and how we function as humans. So when we look now, going back, all the way back, it's been a while since we did this in the first half, going all the way back to the Neolithic era."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2261.95,"end":2266.91,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's been a while. Visited those sites in Turkey and Syria, again."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2271.23,"end":2288.73,"speaker":"Fr Stephen De Young","text":"Where we're talking about the origins of pagan iconography. The earliest kind of things we see are in the earliest human settlements we've found. So, as always, my proviso, if you think this is older than the earth, is adjust accordingly. It's fine."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2289.77,"end":2291.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not about the dates."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2291.77,"end":2300.57,"speaker":"Fr Stephen De Young","text":"We love just about everybody here at Lord of Spirits. I'll say that for myself. Father Andrew probably loves everybody."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2301.13,"end":2303.09,"speaker":"Fr Andrew Stephen Damick","text":"I probably love about 5 more people."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2303.09,"end":2314.76,"speaker":"Fr Stephen De Young","text":"Than you do, probably. Yeah. Now, he only loves everybody because God says he has to, But I don't like everybody. Yeah. I do think he actually loves everybody, unlike me."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2317.72,"end":2318.12,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2320.12,"end":2348.21,"speaker":"Fr Stephen De Young","text":"But the earliest site, the common dating of it of Gobekli tepe is about 10,000 BC, and we've talked about it before. Gobekli Tepe is this oldest known human site, but we've also talked about it in the context of the fact that this begins as a site of religious pilgrimage and only later becomes a human settlement."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2349.25,"end":2349.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2350.21,"end":2410.39,"speaker":"Fr Stephen De Young","text":"So this begins as a place where nomadic people assemble at certain times of the year for religious ritual and then eventually develop sort of a standing community as the Neolithic revolution progresses and people begin to be able to plant and harvest crops. So the standing stones that we have at Gobekli Tepe, that seems to have served an astrological purpose, have reliefs card into them and their animal forms. I think there's a human form or two also, but mostly animals. Right. And so here, earliest known, verifiably religious site in the world, again, however you want to date, it, has iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2411.76,"end":2411.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2411.96,"end":2420.48,"speaker":"Fr Stephen De Young","text":"And these are reliefs and forms carved into standing stones used for astrological observation."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2421.68,"end":2424,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of a Stonehenge of sorts."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2424.4,"end":2430.24,"speaker":"Fr Stephen De Young","text":"Right. So these are not like an idol at the center of a shrine like we talked about last time."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2430.32,"end":2432,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no altar next to them."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2432.4,"end":2441.8,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So there is no evidence of any ritual activity directed toward these images."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2442.12,"end":2449.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they're they're like, relatively speaking, off to the side, you know, as compared to, as you said, like an idol at the center of a shrine."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2450.12,"end":2470.24,"speaker":"Fr Stephen De Young","text":"Right. And so this is why we're categorizing this as pagan iconography. This is within a sacred space and attached to a sacred space. And clearly, for the people who put it there, part of what makes it sacred space, but is not the object of ritual and worship."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2470.48,"end":2472.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not the focal point."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2473.68,"end":2502.45,"speaker":"Fr Stephen De Young","text":"Right. And if you want to go back potentially earlier than that, again, not arguing about dates with anybody, we have Neanderthal caves in Spain and France. We know they're Neanderthal caves because there's Neanderthal bones there. I'm also, as someone who, as a Northern European, possesses a large amount of Neanderthal DNA, not going to argue about that whole thing. So."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2504.53,"end":2505.73,"speaker":"Fr Andrew Stephen Damick","text":"Right. Our cousins."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2506.53,"end":2510.61,"speaker":"Fr Stephen De Young","text":"Yes, yes. So these are my forefathers, and by."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2510.61,"end":2513.81,"speaker":"Fr Andrew Stephen Damick","text":"That I mean yours are my cousins, not humanity's cousins."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2513.89,"end":2529.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Some of you may have no Neanderthal DNA whatsoever, but I got. I got some relatives back there. Apparently Neanderthals, based on the shape of their throat, had incredibly high pitched voices."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2529.95,"end":2530.43,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2530.67,"end":2535.23,"speaker":"Fr Stephen De Young","text":"Which just fascinates me, given our typical visual image of a Neanderthal."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2535.31,"end":2540.95,"speaker":"Fr Andrew Stephen Damick","text":"I feel like there's a Michael Jackson reference we can make here that it's just not coming to me, but that's okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2540.95,"end":2556.68,"speaker":"Fr Stephen De Young","text":"Yeah. But in reference to our topic this evening, that's in these Neanderthal caves. And again, we know they're Neanderthal caves because there's dead Neanderthals there. They're buried there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2557.24,"end":2558.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2559.16,"end":2566.04,"speaker":"Fr Stephen De Young","text":"Right. So, you know, whatever you want to say about Neanderthals, they buried their dead."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2569,"end":2569.96,"speaker":"Fr Andrew Stephen Damick","text":"Which is interesting."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2570.45,"end":2642.16,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Which kind of points toward humanity, I would say, and is a. An activity that we would now put in the religion basket. Right. And accompanying these burial sites is some of the earliest iconography we have, which is paint on cave walls, which we could tell from handprints in some of these cave walls was done by a person dipping their finger hand in some kind of dye or resin and then using it to make animal forms and human forms on walls, which also sounds like human behavior to me, just for the record. And so the whole development of idolatry that we traced last time and the beginnings of the developments of iconography that we've just started tracing this time, these are things that are happening contemporaneously. Right. These are two parallel tracks here at the beginning."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2643.76,"end":2648.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Because, I mean, this is the earliest known stuff Humans."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2648.8,"end":2667.16,"speaker":"Fr Stephen De Young","text":"So going tracing both of these back to the Neolithic era, they're two separate parallel things. Right. So if you want to hypothesize some kind of convergence in some kind of even earlier prehistoric era, go ahead. But you got no evidence to go on."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2667.24,"end":2669.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's nothing that has been dug up yet."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2670.44,"end":2676.84,"speaker":"Fr Stephen De Young","text":"Yeah. So we see something similar."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2678.05,"end":2678.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2678.93,"end":2755.53,"speaker":"Fr Stephen De Young","text":"These two things existing in parallel at Ketal Haoyuk, the other super ancient site that we talked about, we've talked about in the past, when we're talking about the origins of pagan religion in Ketal Hauk, in the dwellings near the place. So in, in the dwellings in Kittlehoyuk, when someone in the family died, they were buried in the quote unquote floor, because it's a dirt floor of the family home, they're buried sort of underneath the house, thereby continuing to recognize them as part of the family in some ongoing way. So again, this is clearly religious activity. And near the portion of these dwellings where there are these burials in the homes, there are bullhorns mounted on walls, usually on walls. And those bullhorns are clearly iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2756.09,"end":2765.14,"speaker":"Fr Andrew Stephen Damick","text":"We talked about this before, connected to the bull worship. That is kind of the level of idolatry in almost every single world culture."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2766.1,"end":2792.06,"speaker":"Fr Stephen De Young","text":"Yeah. Which we connected to where we talked about behemoth. Behemoth. Right. Bull of heaven, bull, baal. We talked about all these things. So you have those. Right. But that is not like a full on idol, because there are, elsewhere in the site, there are sort of bull statues, Statues of bulls that were being used as idols."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2792.46,"end":2796.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because there's altars near there, evidence of sacrifices being offered there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2797.34,"end":2811.67,"speaker":"Fr Stephen De Young","text":"Right. So in Cataloic, there's idolatry going on with a bull. Right. But there's also religious iconography connected to that going on. Right, but that is a distinguishable phenomenon."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2813.19,"end":2813.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2813.99,"end":2866.75,"speaker":"Fr Stephen De Young","text":"And that iconography that's going on with the horns is attached to the place where what we would today call private or family worship or whatever, whatever practices are going on, whatever religious ritual practices are going on in the home are happening there with the. Where the iconography is. Right. So it's still religious iconography again, but it's not that the horns aren't the same thing as an idol, because there are idols and they could have. Right. We could have found small clay bull statues instead of the antlers in the private homes. Right. In which case we would say, oh, that was idolatry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2866.75,"end":2867.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2870.91,"end":2917.76,"speaker":"Fr Stephen De Young","text":"So this of course develops over millennia, centuries, and what becomes very common, the most common iconography in the ancient near east, whether we're talking about Egypt or we're talking about Babylonian civilization, Assyrian civilization, even into the. The Persian period, the most common thing we find are reliefs. So carved images in walls or painted images on walls, like both of those we find in Egypt. Sometimes the painted ones are now gone for a variety of reasons."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2918,"end":2921.2,"speaker":"Fr Andrew Stephen Damick","text":"I mean, mostly because paint doesn't last forever."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2921.36,"end":2973.3,"speaker":"Fr Stephen De Young","text":"Yeah. And many of the ones that were carved also had paint on them at one point. So we don't know whether that paint was just enhancing the carved figures or whether there would have been additional information if the paint was still there. Right. Like if there were inscriptions or other figures that weren't carved but were painted around the carved figures. Right. That's not something super knowable. But we find this incredibly commonly. It mostly moves in the Greek and Roman period to painted frescoes. There tends to be less wall carving and more wall painting when you get into Greek civilization. And the Romans basically kind of do great, great value. Greek civilization. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2973.38,"end":2973.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2973.78,"end":2975.38,"speaker":"Fr Stephen De Young","text":"And I mean, like, their whole thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2975.62,"end":2996.83,"speaker":"Fr Andrew Stephen Damick","text":"Most of us, when we think of the ancient classical world, we think of, you know, big white pillars and marble buildings, but. And. And statues even. But these things actually were mostly painted like, it would have been very polycraped. You know, Ancient Rome was not gleaming white buildings. It was painted."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2996.83,"end":2999.55,"speaker":"Fr Stephen De Young","text":"Yeah. Everything was covered in brightly colored paint."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":2999.79,"end":3000.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3001.47,"end":3025.05,"speaker":"Fr Stephen De Young","text":"Statues were covered in brightly colored paint. The ones we now see as just sort of marble. And we know that not just from finding paint samples on things, but, I mean, places like Pompeii that are pretty well preserved. Right. We could see that just about every inch of the inside and outside of buildings, including people's homes, were just covered in frescoes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3025.93,"end":3026.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3026.73,"end":3040.09,"speaker":"Fr Stephen De Young","text":"We're just covered in imagery. And the greater portion of this imagery was. Was depicting scenes and figures from myth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3040.73,"end":3042.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3042.65,"end":3043.29,"speaker":"Fr Stephen De Young","text":"On the wall."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3043.29,"end":3045.13,"speaker":"Fr Andrew Stephen Damick","text":"And. And many of them were quite obscene."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3045.69,"end":3046.25,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3047.03,"end":3047.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3047.35,"end":3050.79,"speaker":"Fr Stephen De Young","text":"There's a lot of Goose Zeus, by our standards. Let the reader understand."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3051.11,"end":3052.15,"speaker":"Fr Andrew Stephen Damick","text":"Goose Zeus."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3052.23,"end":3107.76,"speaker":"Fr Stephen De Young","text":"Or the listener, I guess, readers of the transcript. Yes. Goose Zeus. Yes. Or the Origin of the Minotaur. See, I'm being euphemistic here. So. Yes. So they're just these depictions. Right. And they're everywhere. They're on every wall. Right. It's like a teenager's bedroom with posters. Right. Like the. So it's not like you can isolate and say, oh, okay, right. Like. Like we talked about last time with idolatry. Right. Here's the hearth, here's the center. Here's where they have the. The images of the. The household gods. Here's where they come to do religious activity that's going on. But also this pagan iconography is all over the entire house."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3108.8,"end":3109.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3109.92,"end":3113.52,"speaker":"Fr Stephen De Young","text":"Right. So this makes a very clear distinction."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3113.92,"end":3134.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not like sacrifices are being offered next to all the walls. It's not like sacrifice being offered everywhere. And oh, by the way, there's this one place has a statue in it. What's up with that? It's clear. This is the sacrificial spot. This is where the worship happens. And there's also this other imagery. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3134.98,"end":3153.3,"speaker":"Fr Stephen De Young","text":"So the fresco of goose. Zeus has. Zeus is a goose. And Zeus is a pagan God. Right. So religious iconography, but there is no. The family worship, the offering of sacrifice, offering of incense, primarily in the home, is not happening over there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3154.16,"end":3154.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3154.36,"end":3158.16,"speaker":"Fr Stephen De Young","text":"That's in the latrine. It's happening at the hearth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3159.12,"end":3159.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3160.08,"end":3275.64,"speaker":"Fr Stephen De Young","text":"Where the. Where the idols are. Right. So not just. These aren't just distinguishable phenomena, these are distinct phenomena. Right. Anyone who lived in one of these homes, any one of these people in the ancient world, intuitively knew the difference. They weren't confused. They weren't like, hey, why do we go over there where you have the little statue of Zeus? Instead of just standing here next to the picture of Zeus, they intuitively knew the difference between an idol and this iconography that surrounded them. Even when it's depicting the exact same figures. Right. The exact same divine figures. These are two different things. And everyone in the ancient world just understood it because both were going on simultaneously. Both had their own traditions, both had their own thing. Now, I said most of it is scenes from myth, of course, scenes and persons from myth. There's also then depictions of family members. So sometimes depictions of family members in the pagan world cross over into the quote unquote, religion category. Right. Meaning unambiguously. If we were going to do the modern basket thing, we'd put them in the religion basket. I mean, one can say having a depiction of a departed loved one is always kind of. There's always sort of a religious element to it. Right. Like. Yeah, you have to have a very strict definition of religion, but. Right. What I mean by that is sometimes we're dealing with, you know, your great, great, great, great, great, great grandfather who founded the city."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3276.76,"end":3277.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3277.72,"end":3280.68,"speaker":"Fr Stephen De Young","text":"Who has a shrine adjoining the God's temple."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3281.48,"end":3281.88,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3282.04,"end":3309.38,"speaker":"Fr Stephen De Young","text":"And you have a depiction of him in your house. Right. So that's. That's clearly one kind of thing. Right. But there's also just. There comes to be across a wide Variety of cultures. This isn't ubiquitous, but across a wide variety of cultures, you have people making death masks, which sometimes are plaster masks of various modes of creation made from dead bodies."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3309.94,"end":3316.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like they might put, like, a dead person put plaster on their face, wait for it to kind of harden, and then pull it off."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3316.63,"end":3333.19,"speaker":"Fr Stephen De Young","text":"Right. And sometimes when a person is embalmed and wrapped for burial, these would be painted onto the wrappings of the face to attempt to make it resemble the person. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3333.19,"end":3338.87,"speaker":"Fr Andrew Stephen Damick","text":"Or there's like, you know, super stylized ones, like the ones you see in Egyptian royal burials."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3339.42,"end":3339.66,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3340.38,"end":3342.22,"speaker":"Fr Andrew Stephen Damick","text":"King Tutankhamun and so forth."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3342.54,"end":3384.23,"speaker":"Fr Stephen De Young","text":"Yeah. But this development then also led to the parallel development of keeping images of departed loved ones and sometimes just keeping them on the walls. And this was. And I know this is gonna date me, but when I was a kid, we had these things called cameras, and you couldn't call or text on them. And not only that, but you had to, like, take it with you. And then you'd aim it at things and push a button and it would take photos. But you weren't sure what they looked like."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3384.47,"end":3385.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. You didn't know if it was good."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3385.79,"end":3411.26,"speaker":"Fr Stephen De Young","text":"Or bad until you had no idea much later on. Yeah. And you had to go and take it to a place or mail it to a place. This roll of film from inside the camera. And they would then develop that film and send you copies of all the pictures along with the negatives so you could get more copies made. And half the time they all stunk."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3412.3,"end":3413.02,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3414.62,"end":3443.18,"speaker":"Fr Stephen De Young","text":"They were all lit wrong, or someone was moving, or everybody had their eyes closed in the photo. Right. And there was nothing you could do because this is like three weeks later now that you got the photos. I know times were strange in the past, but when that was the case, people kept photo albums. They had big books of all those photos. Go check with your grandparents, kids."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3444.22,"end":3448.26,"speaker":"Fr Andrew Stephen Damick","text":"That phrase is still used, like, on. On Facebook. They have albums. Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3448.26,"end":3451.34,"speaker":"Fr Stephen De Young","text":"No, these. Yes. We have to clarify. These were physical books."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3451.77,"end":3453.69,"speaker":"Fr Andrew Stephen Damick","text":"Yes. You could flip through. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3453.93,"end":3456.09,"speaker":"Fr Stephen De Young","text":"Sometimes with faux leather covers."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3457.13,"end":3457.69,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3458.25,"end":3468.01,"speaker":"Fr Stephen De Young","text":"With little pages with little plastic pockets into which you would slide the paper photographs so you could gauge through them."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3468.25,"end":3469.93,"speaker":"Fr Andrew Stephen Damick","text":"Getting me in all the feels right now."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3470.41,"end":3488.14,"speaker":"Fr Stephen De Young","text":"Yeah. But very commonly, the purpose these served, these effectively served, was I'm going to go look at the pictures of my kids when they were little. I'm going to go look at the pictures of my departed loved ones."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3488.38,"end":3490.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And at some level, you feel like you're there again."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3491.58,"end":3492.14,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3492.3,"end":3499.1,"speaker":"Fr Andrew Stephen Damick","text":"Or. Or maybe you weren't there. When the thing happened. But you are participating in it in some indirect way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3499.66,"end":3603.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Or this is sometime in the past, Right? Some trip, some, you know, kind of. Oh, here, you know. Yeah. And so, again, this is one of those very human things, right? One of these very human things. And so we find in a lot of the iconography these images of people, right, who are now gone as a means of sort of preserving them, which is its own kind of mythic activity, Right. Of keeping them alive. Right. Within the context of the family as community. So because of this relationship between, as we said, pun intended. Iconography draws together a story and sort of reality. Right. Sort of people. The people, the viewer and the event. The viewer and the person. Right. Pulls them together and unites them. When we're talking about looking at and interpreting iconography, pagan or otherwise, we've got to move past a lot of modern categories in order to understand it in this ritual kind of context. Right? So a lot of us have in our head, and we went after this in the how to Read the Bible episode, and I'm sure we're gonna have to do a sequel to that episode because that topic comes up a lot."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3603.93,"end":3607.21,"speaker":"Fr Andrew Stephen Damick","text":"Probably a good idea. Yeah, probably a good idea."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3607.69,"end":3610.97,"speaker":"Fr Stephen De Young","text":"We're gonna have to do how to Read the Bible to Electric Boogaloo."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3613.46,"end":3613.7,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3616.02,"end":3640.98,"speaker":"Fr Stephen De Young","text":"We have to get past, like, the categories of literal versus allegorical. Right. Because it's not going to make sense. Right. No one who was standing there in their parlor looking at the fresco of goose, Zeus was like, are they trying to say that Zeus literally became a goose?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3642.47,"end":3646.55,"speaker":"Fr Andrew Stephen Damick","text":"You know, Zeus. Goose is going to be the big takeaway for a lot of people from this episode."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3646.63,"end":3649.27,"speaker":"Fr Stephen De Young","text":"Yes. Goose, Zeus. Yeah, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3649.91,"end":3650.27,"speaker":"Fr Andrew Stephen Damick","text":"Was."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3650.27,"end":3654.87,"speaker":"Fr Stephen De Young","text":"Was goose act. Was Zeus actually a goose? Was a goose actually Zeus."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3656.71,"end":3659.59,"speaker":"Fr Andrew Stephen Damick","text":"In Top Gun 1 was good. Wait."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3659.67,"end":3732.95,"speaker":"Fr Stephen De Young","text":"Yeah. Does Dr. Seuss have a goose? No. So, yeah, they weren't sitting there wondering when was this Anybody got a. Got a date on when Zeus became a goose and how long was he a goose and where exactly was this? And right. So no one was trying to figure out if it was literal. And also there was not someone standing next to him arguing, oh, no, no. Goose is an allegory. You see, the goose represents going on something. That's not at all how this works. Right? That's not how this works. And that is this whole idea we have of, on the one hand, real? Like, is this real or is this symbolic? Right. Somewhere Jonathan Peugeot just heard the sound of a billion voices screaming and then suddenly cut off because I use the word Symbolic to mean not real. But that's how it's used by a lot of folks today. It comes out of eucharistic debates. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3733.19,"end":3734.07,"speaker":"Fr Andrew Stephen Damick","text":"Just a symbol."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3734.87,"end":3755.68,"speaker":"Fr Stephen De Young","text":"Right. That's not how people thought about these things. The iconography is a means of communicating a spiritual reality. Right. A reality that can be participated in, that can be ritually participated in."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3755.76,"end":3763.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just sort of studied. You're part of it. It's part of you in some way. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3764.32,"end":3796.89,"speaker":"Fr Stephen De Young","text":"And so this means that the kind of viewing that has always been done with iconography, that's part of what makes it iconography. Right. Is that it's an active kind of viewing. Right. It is an active viewing of meditation upon the image. Right. Of. Of becoming present in the event or with the person portrayed in the image."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3797.37,"end":3820.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it should even be said, like, even within. Within the Orthodox Church. Sure. People do venerate. And we'll talk about this more, but people do venerate icons by kissing them, by doing various things. But most of the experience of an icon is in looking at it. It's the visual contact."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3821.76,"end":3826.4,"speaker":"Fr Stephen De Young","text":"Active viewing. Yeah. Active viewing is most of what the word veneration means."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3827.43,"end":3827.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3828.31,"end":3842.55,"speaker":"Fr Stephen De Young","text":"That's most of what we're talking about when we talk about veneration. And that's very different than worshiping something. Right. That's not even. That's not on a plane with worshiping something. That's not. It is a fundamentally different activity."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3843.43,"end":3843.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3843.95,"end":3856.76,"speaker":"Fr Stephen De Young","text":"Right. No one thinks that someone is worshiping a movie by viewing it in an active way and getting it, quote, unquote, getting into it or quote unquote, getting involved in it. Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3856.76,"end":3857.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3857.12,"end":3870.32,"speaker":"Fr Stephen De Young","text":"That doesn't mean there's nothing wrong with doing that with certain movies. There certainly is. Right, Right, right. Or doing that with pornography. There's certainly something wrong with that. Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3870.32,"end":3871.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Very, very wrong."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3872.32,"end":3881.6,"speaker":"Fr Stephen De Young","text":"Right. But that is an activity of veneration, not of worship. And it's an activity that's being misdirected to the wrong object."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3882.46,"end":3882.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3883.66,"end":3889.82,"speaker":"Fr Stephen De Young","text":"Right. And that is a big part of what makes it different."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3890.62,"end":3904.86,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right. Well, our first half was about pagan iconography, and our second half is going to be about Israelite iconography, just to give it away. But before we get to that, we're going to go ahead and take our first break. So we'll be right back with more."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3904.86,"end":3922.25,"speaker":"Announcer","text":"Lord of Spirits, Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the of the Lord of Spirits. Give them a call at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3926.89,"end":3943.56,"speaker":"Fr Stephen De Young","text":"Ancient Faith Radio is brought to you by our listeners with help from Faith Tree Resources. Have you ever felt distracted or disengaged in church but weren't quite sure what to do about it? Divine the greatest invitation is the newest video course brought to you from faithtree."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3943.56,"end":3945.76,"speaker":"Announcer","text":"Resources and will help you better understand."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3945.84,"end":3952.44,"speaker":"Fr Stephen De Young","text":"And experience the peace God offers to us in the Divine Liturgy. This four part series, taught by some."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3952.44,"end":3954.72,"speaker":"Announcer","text":"Of the church's most respected leaders, will."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3954.72,"end":3975.3,"speaker":"Fr Stephen De Young","text":"Equip you with resources and tools to help you more deeply encounter the one true God. Whether you're a parent hungry to teach your children, a pastor looking to equip your faithful, or someone who wants to learn how to actively be present in the Divine Liturgy, this course is for you. Go to faithtree.org to get your copy today. That's faithtree.org."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3980.34,"end":3996.43,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":3997.95,"end":4011.47,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for that. Voice of Steve. It's the second half of the Lord of Spirits podcast here on October 12th, two weeks from today, we're at the Lord of Spirits conference. Are you pumped, Father Stephen?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4014.2,"end":4025.08,"speaker":"Fr Stephen De Young","text":"I guess. Oh, I mean, sure. With my plane travel luck lately, hopefully, Lord willing, I'll be there Thursday."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4030.04,"end":4031.24,"speaker":"Fr Andrew Stephen Damick","text":"Just as soon as you said that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4031.24,"end":4037.72,"speaker":"Fr Stephen De Young","text":"Ellie had a heart attack somewhere this podcast. But I mean, I got to be honest, you know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4039.64,"end":4048.77,"speaker":"Fr Andrew Stephen Damick","text":"Ellie, who is, who is running the whole event and doing a, a glorious job so far even though it hasn't started yet. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4049.41,"end":4053.57,"speaker":"Fr Stephen De Young","text":"Yeah. So yeah. Hopefully I also got to figure out what I'm going to say."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4054.37,"end":4055.33,"speaker":"Fr Andrew Stephen Damick","text":"That would be nice."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4056.21,"end":4075.48,"speaker":"Fr Stephen De Young","text":"Let me give a tease though. Let me give a tease though, to everybody. Like months ago I sent in a topic of what I was going to talk about. I'm not talking about anything remotely related to that topic, but I'm pretty sure there's nobody out there who bought a ticket who was like, I'm only going because Father Stephen said he's talking about this particular topic."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4075.63,"end":4078.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I'm really interested topics."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4078.83,"end":4087.07,"speaker":"Fr Stephen De Young","text":"Yes. That's the only reason I'm coming. If Father Steven talks about something different, I'm going to be mad and demand. So yeah. So I don't think that's going to happen."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4087.15,"end":4088.27,"speaker":"Fr Andrew Stephen Damick","text":"So yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4088.27,"end":4093.95,"speaker":"Fr Stephen De Young","text":"Plus it's me like you not listen to the show right you expect and."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4093.95,"end":4114.36,"speaker":"Fr Andrew Stephen Damick","text":"I should say there's at least as of this moment, there are some, some spaces that have opened up. So it's late in the game folks, but if you send a desperate but respectfully worded email to ellie@ancientfaith.com you might be able to still come. I'm just putting that out there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4114.52,"end":4117.32,"speaker":"Fr Stephen De Young","text":"So does she want flattery and or bribes?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4119.32,"end":4129.57,"speaker":"Fr Andrew Stephen Damick","text":"Ellie is a very, very tough person, actually. She's very kind, she's very nice, but she is very, very tough. So I don't think you can switch sway her with stuff like that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4130.93,"end":4133.25,"speaker":"Fr Stephen De Young","text":"Anyone can be swayed by a big enough bribe."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4134.29,"end":4135.77,"speaker":"Fr Andrew Stephen Damick","text":"It's just a matter of what the price is."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4135.77,"end":4140.53,"speaker":"Fr Stephen De Young","text":"Like I'm pretty sure if someone offers her $10 million, she'll be like, cool, you could have my room."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4140.69,"end":4141.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4141.17,"end":4141.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4145.09,"end":4148.85,"speaker":"Fr Andrew Stephen Damick","text":"Please make a donation. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4149.57,"end":4153.65,"speaker":"Fr Stephen De Young","text":"You guy who's willing to pay $10 million to get a room where there's technically one or two available."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4154.28,"end":4159.56,"speaker":"Fr Andrew Stephen Damick","text":"I mean we should love man, he really wants to be there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4159.8,"end":4160.28,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4160.68,"end":4175.08,"speaker":"Fr Andrew Stephen Damick","text":"So yeah, before we, so yeah, before we dive into Israelite iconography, this is a live call in show and we in fact do have a live caller. On the other end of the line we have Daniel calling from Florida. Daniel, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4176.68,"end":4183.06,"speaker":"Daniel","text":"Hello Fathers, this is Florida man and friend of the show, the Danimal Florida man."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4183.94,"end":4189.14,"speaker":"Fr Stephen De Young","text":"I do hope that this is a live caller because it's too early in October for the dead to start to call in."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4191.38,"end":4202.02,"speaker":"Daniel","text":"Oh no. This is one of many Florida men. But I do have a serious question about iconography and then a follow up question depending on how the first is answered."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4202.1,"end":4204.98,"speaker":"Fr Stephen De Young","text":"Okay, if it's hard, we're going to punt it to Pageau."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4205.94,"end":4275.45,"speaker":"Daniel","text":"Okay, maybe the second question. I don't know. We'll start with the easy one. So I traveled to Meteora and Athens earlier in the year and I noticed a particular icon that I said, huh, that doesn't seem right. And after looking at some of the canons of the church, it seemed to violate the canons of the Synth Ecumenical Council. So it was one of the father depicted as an old white man and a beard, Christ and the Holy Spirit. I did happen to see the earliest icon I could find of it was in the 1500s by like @ one of the museums there. So my question is if you're going to a parish and you see something that clearly violates the canons, like what is the proper response? You just go up to the priest afterwards, kind of like in Matthew, like the priest and be like, hey, I don't Think we should actually have this up here? Or, like, you know, what is the proper response when you find stuff that clearly violates the rules on that?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4276.49,"end":4277.61,"speaker":"Fr Stephen De Young","text":"Set it ablaze."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4279.13,"end":4280.57,"speaker":"Fr Andrew Stephen Damick","text":"That was gonna be my joke."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4280.65,"end":4281.53,"speaker":"Fr Stephen De Young","text":"Oh, sorry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4282.17,"end":4294.71,"speaker":"Daniel","text":"Now, see, that's my first reaction, but I'm like, there's something that seems wrong about breaking an image, Right? We're all broken images. So, like, may someone can just, you know, rewrite it and salvage it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4295.11,"end":4365.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. So, I mean, the reality and we talked about this was this. I'm trying to remember. This was, like, one of our earliest episodes, I think, when we were doing the Christology series, Right. When we did, we were talking about the. The Son of Man and the Ancient of Days and so forth. I don't remember which one that was, Father. But yeah. So here's a reality. There are rules against depicting God the Father in Orthodox iconography. There are many icons that depict God the Father in Orthodox iconography. I mean, you saw them on Matera. I saw them all over Mount Athos. Like, they've got them in lots of places on Mount Athos. And, you know, you want to know one that's even weirder? There is a Trinity icon that exists on Athos, where it's basically, you know, a man with three faces. I mean, that is way weirder than the old man with a white beard. What do you do about that? I mean, here's the thing. If it's not. If you're not the bishop of that parish."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4367.52,"end":4368.96,"speaker":"Fr Stephen De Young","text":"Which, presumably. Or not."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4369.44,"end":4370.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4371.2,"end":4376.54,"speaker":"Daniel","text":"I'm at the bottom of the totem pole. I'm pretty sure the janitor has a higher pecking order than I, so."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4376.54,"end":4450.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, there are a couple of bishops here in the United States named Daniel, but you don't sound like either one of them. I've met both of them. Yeah. You know, if you're not the bishop, I mean, even if it is a real problem. Right. It's not your responsibility. It's just not like it's, you know, like, you know, you have in mind this. Right. I mean, I've been to parishes where things happen. I'm like, oh, what's going on here? Nope, nope, nope. Not my circus, not my monkeys. You know, that's just a reality. You know, you're going to see things that happen in churches that are off. I mean, you know, if you're on monophos, would you say, excuse me, I need to find the abbot. I have to report this, you know. No, no, because that's not. Not. Not Your job, you're not the one responsible. There's a lot of things that are off in this world, and unless you're the one responsible for. For writing it, then you're probably only going to make things worse by attempting to do that, you know, I don't know. Father Stephen, do you have anything you wanted to add besides, you know, set it on fire?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4452.02,"end":4465.14,"speaker":"Fr Stephen De Young","text":"Yeah, I've gone on record with that. Yeah. So where this actually came from, there's a really good book about this called the Image of God the Father."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4465.3,"end":4469.31,"speaker":"Fr Andrew Stephen Damick","text":"Orthodox tradition. Yeah. Even Bigham, Bingham."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4469.47,"end":4569.48,"speaker":"Fr Stephen De Young","text":"Bingham, yeah. Is they. There was an earlier icon called the Paternity. That was an icon that depicted Abraham and Isaac with Isaac sitting on Abraham's lap. That was very. Is very similar to the way you'll see icons of Christ as a child sitting on the lap of the Theotokos. But the idea was sort of like Rublev's Trinity icon was, see, Abraham and Isaac. This represents. Right. Sort of the paternity of God the Father. Right. God the Son. Emphasis on the represents. And then over time, that whole represents thing faded off into the background. And the way you track that fading off into the background is that you start getting different kinds of halos or nimbuses on the two figures. So it stops being two nimbuses for saints like Abraham and Isaac and starts to turn into nimbus with the cross in it on the child. Right. That it's Christian. And then under Western influence, you get the. Throw in a bird. And now it's the Trinity thing. When these things show up at my parish, as they do occasionally, they end up in my office. I'm actually sitting right next to a few of them right now, rather than on public display."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4569.8,"end":4571.72,"speaker":"Fr Andrew Stephen Damick","text":"Weird. Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4571.72,"end":4572.28,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4574.04,"end":4579.32,"speaker":"Fr Andrew Stephen Damick","text":"If you start moseying around in the storage areas at a church, you find all kinds of."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4580.04,"end":4580.48,"speaker":"Fr Stephen De Young","text":"Oh, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4580.48,"end":4581.56,"speaker":"Fr Andrew Stephen Damick","text":"Things that come."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4582.36,"end":4611.36,"speaker":"Fr Stephen De Young","text":"So. Yeah. And I mean beyond. I mean, what Father Andrew said is correct. When you're someplace like Mad Athos is. Yeah. Like, you got to kind of know your role and shut your mouth. But in parish life, it can get really thorny and naughty. Right. Because, for example, the priest of the parish you're at that has one of those on public display may hate the thing and want to, you know, bury it somewhere, but be waiting."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4611.36,"end":4612.56,"speaker":"Fr Andrew Stephen Damick","text":"Waiting for the donors."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4613.04,"end":4642.61,"speaker":"Fr Stephen De Young","text":"Right, exactly. But it was donated by some prominent family in the church, and so he kind of can't. Right. For the sake of the peace of the community. And by the way, I'm not saying that priest is a wimp. I'M saying that priest is probably in that case exercising good pastoral judgment. Because the goal of a priest in a church is not to enforce a list of rules. What the role of a priest in a church is to help the actual humans who make up that parish find salvation."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4644.29,"end":4645.65,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4646.21,"end":4659.33,"speaker":"Fr Stephen De Young","text":"And so sometimes what they need to help them find salvation is some mercy and some grace with some things that aren't technically correct. Confronting everything wrong isn't always the best way to handle these things."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4662.22,"end":4668.3,"speaker":"Fr Andrew Stephen Damick","text":"Or as our dogmatics professor at St. Tikon's would say, you got to be cool like Sam Basil."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4671.34,"end":4675.34,"speaker":"Fr Stephen De Young","text":"You remember that? I don't know. I don't know, man. That's not my notes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4675.74,"end":4683.62,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Thank you for that callback. Sorry, we're doing in jokes on the air here, Daniel. I'm sorry about that, but we never."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4683.62,"end":4684.54,"speaker":"Fr Stephen De Young","text":"Do that on this show."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4684.54,"end":4687.3,"speaker":"Daniel","text":"Apologize. Just please, just keep being yourself."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4687.86,"end":4725.86,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that's a thing now at this point. And you've got places where, for example, they've got iconography of God the Father painted up in a dome, you know, where it's going to cost thousands of dollars to change that, you know, and this kind of thing. So things have happened, they're not correct. Lots of good folks are out there trying to work overtime pastorally to correct them. And so we've all got to just show each other a little grace while that happens."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4726.34,"end":4729.14,"speaker":"Fr Andrew Stephen Damick","text":"There you go. So you said you had a follow up question, Daniel?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4729.94,"end":4764.74,"speaker":"Daniel","text":"Yes, and actually, Father Andrew, you kind of lead into that with that weird image of God with three faces. So I'm not saying we should make an icon of this, but I've been. When you're trying to describe the trinity, right. Like St. Patrick used a three leaf clover. Well, most kids don't even go outside or know what grass goes like under their feet, so they don't know what a clover is. But what about King Ghidorah from Godzilla? It's got three heads. It's always referred to in the skin. Gator. It's King Ghidorah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4764.98,"end":4771.74,"speaker":"Fr Stephen De Young","text":"Is this really William Lane Craig? Did William Blade Craig call this show under an assumed name?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4775.82,"end":4794.95,"speaker":"Daniel","text":"So is that an appropriate or a heretical analogy for the Trinity? Granted, all analogies break down and if anyone is concerned about these sort of questions, you can email my priest, Father David Galloway, @southorthodoxorlandomail.com oh man."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4794.95,"end":4796.87,"speaker":"Fr Andrew Stephen Damick","text":"He just threw his old priest under the bus."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4797.43,"end":4806.15,"speaker":"Fr Stephen De Young","text":"Yes. Wow. Wow. I was going to tell them to send the hate mail to Father Andrew, but wow."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4806.47,"end":4811.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So is a Three headed monster. An appropriate symbol of the Trinity. I'm going to go out."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4812.15,"end":4813.83,"speaker":"Fr Stephen De Young","text":"No, Bill. No, it's not."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4814.15,"end":4821.27,"speaker":"Fr Andrew Stephen Damick","text":"No. Oh man, I didn't know this is going to be this much fun tonight. This is great."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4824.37,"end":4828.77,"speaker":"Daniel","text":"For the record, this is my, my analogy. This was not in the catechism class."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4829.49,"end":4830.37,"speaker":"Fr Andrew Stephen Damick","text":"Okay, good, good."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4830.69,"end":4832.49,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, we don't need to, we."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4832.49,"end":4937.49,"speaker":"Fr Andrew Stephen Damick","text":"Don'T need to actually contact your priest and say, excuse me, Father, we have some concerns anyway. Yeah, you know, here's, here's what I say to a lot of that stuff is like, look, use the things that the church has always used. You know, pray the way the church prays, speak the way the church speaks. Yes, there are sometimes is good space for new expressions to try to explain the things we've always believed, new ways of talking about things we've always believed and always taught. But particularly when you're talking about core things like trinitarian dogma, you got to be careful. You got to be careful. And I think the best thing, if people say, look, I just can't swallow this philosophically. Three persons, one God, say, look, it's actually ultimately not a philosophical question. It's an experience of prayer. I was raised as an Evangelical Protestant who believed in the Trinity. But I would say that my experience of the Father, Son and Holy Spirit only really became truly fulsome within the context of Orthodox Christian liturgy and life. And it wasn't because I altered my views. I believed the same thing. But the way that we pray in the Orthodox Church really brings that home. So, I mean, I know I was just laughing a little bit earlier, but, but that, but I am serious about this. The, the, the actual experience of prayer really does, really does do that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":4940.37,"end":5059.83,"speaker":"Fr Stephen De Young","text":"So, and, and I would recommend. So part, part of the thing here with, with all of this stuff is that the reason people are confused and trying to find analogies is that generally they've received a very bad presentation of the Trinity. The typical American presentation, regardless of where you are. Right. The typical thing you get is, well, there's these three persons, that they're all God, but there's only one God. Well, yeah, that's confusing, right? That's not the doctrine of the Trinity. That's not what's in the Nicene Creed. The doctrine of Trinity is there's one God, the Father, from whom the Son is eternally generated outside of time, from whom the Holy Spirit proceeds outside of time. And so the Trinity, the triad is the three persons who share one nature and one will and one energy. This is straight from St. Gregory of Nyssa, the Nicene Creed, St. Basil the Great, St. Gregory of the Theologian. So I think rather than looking for good analogies because they all break down horribly, as you said, we should just go back to basics and just. It's really not as hard to understand as people have told you it is. They've just explained it to you badly. And when you asked follow up questions, said, well, it's impossible to understand because they don't understand it. So yeah, if you do, if you go on the Google, right, and you search for monarchical Trinity or on the YouTubes, right. Especially if you find Dr. Bo Branson, you can find a lot of material explaining this. It's really something that pretty much any Christian can understand if it's explained well."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5063.83,"end":5067.59,"speaker":"Fr Andrew Stephen Damick","text":"All right, Daniel, thank you very much for calling the Lord Spirits podcast tonight."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5068.63,"end":5070.39,"speaker":"Daniel","text":"All right, thank you, fathers. God bless."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5070.95,"end":5071.51,"speaker":"Fr Stephen De Young","text":"All right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5071.67,"end":5095.76,"speaker":"Fr Andrew Stephen Damick","text":"All right, Moving forward now with Israelite iconography. Yeah, I hear Dr. Harry in my head play it cool, like say, you know, the context was that someone said, like it was literally this context. What if you get to a parish and you know, they've got one of these uncanonical icons? First thing he says, you tear that down and he's like, no, no, you play it cool like Sam Basil."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5098.8,"end":5099.16,"speaker":"Fr Stephen De Young","text":"God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5099.16,"end":5102.48,"speaker":"Fr Andrew Stephen Damick","text":"Bless you, Dr. Harry over there in Thessaloniki. God bless your retirement."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5103.28,"end":5108.64,"speaker":"Fr Stephen De Young","text":"And Daniel. And Daniel, among Florida men, he is clearly one of the good ones."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5111.25,"end":5114.41,"speaker":"Fr Andrew Stephen Damick","text":"The Danimal himself, he said, unlike the."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5114.41,"end":5120.21,"speaker":"Fr Stephen De Young","text":"One who I recently read about, who threw an alligator onto the roof of a building to teach it a lesson."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5120.85,"end":5123.81,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I wonder what the alligator learned from that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5124.29,"end":5136.85,"speaker":"Fr Stephen De Young","text":"I do not know. But good times, good times. All right, so now Israelite iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5137.33,"end":5139.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Israelites head iconography, it turns out."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5140.48,"end":5156.72,"speaker":"Fr Stephen De Young","text":"Yes. So last time we, we talked about all the Israelite idolatry that went on, right? Because of course, despite the fact that they weren't supposed to be doing it, you can't swing a dead cat in the Old Testament without hitting an Israelite worshiping an idol."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5159.68,"end":5160.96,"speaker":"Fr Andrew Stephen Damick","text":"Or a dead elegant. That."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5161.04,"end":5276.34,"speaker":"Fr Stephen De Young","text":"That wasn't technically a mixed metaphor, but it was weird anyway. So if we're going to talk about Israelite iconography, we have to start on the first page of the Bible, right? Because man and woman are created in the image of God in the Greek translation as the icon of God in the world. And we've talked in the show about how the way in particular in Genesis 2 that the creation of man is described is this sort of inversion of the way in which an idol was installed at the end of the dedication of a pagan temple. So rather than this image being crafted of the God and then a ritual taking place to place the spirit to open its nostrils and place the spirit of the God within the idol so that it could be manipulated and worshiped through it. God creates humanity in his image, and he breathes life. He breathes his spirit into the human person to make it his living image, to act on his behalf, and through which for him to act in his creation. So it is an exact inversion and reversal of the idol making that went on in the construction of pagan temples and in the pagan world. So icon making here at the beginning of Genesis is the inversion, the opposite, the antithesis of idol making."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5276.66,"end":5278.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, a rebuke, really?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5278.82,"end":5279.3,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5279.62,"end":5280.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5280.42,"end":5287.14,"speaker":"Fr Stephen De Young","text":"And that means there is a distinction between idolatry and iconography from the first."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5287.14,"end":5291.3,"speaker":"Fr Andrew Stephen Damick","text":"Page of the Scriptures, a distinction made by God himself."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5291.62,"end":5367.65,"speaker":"Fr Stephen De Young","text":"Yes. These two things are distinguished at the very beginning of Scripture. Right. They're not on a continuum. They're not the same thing. The one is the opposite of the other. These two things stand opposed. And so when we get a little later on in the Torah and we get to the point that the tabernacle is being designed and being built, right, There are cherubim all over the place. There are cherubim sown into the. Effectively the walls of the tabernacle. There are cherubim in the most holy place around, where the Ark of the Covenant that we'll talk about in a minute is going to be. Right. And this is because this iconography, right, this is iconography of the divine council, the angelic beings surrounding the throne of God, because the cherubim inside the holy place are the ones that form the throne of God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5368.21,"end":5373.81,"speaker":"Fr Andrew Stephen Damick","text":"Now, are the gigantic cherubim statues, Are those in the tabernacle? Or do you have to wait to the temple to get those?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5374.21,"end":5377.94,"speaker":"Fr Stephen De Young","text":"Well, they get more gigantic in the temple, but those are the ones I'm referring to."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5378.18,"end":5379.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5379.3,"end":5420,"speaker":"Fr Stephen De Young","text":"Right in the holy place. This represents the throne of God right at the high place, Right. Who is seated upon the cherubim. So this is iconography of the divine council surrounding him. Right. And this is not just, oh, a nice decoration or, oh, theologically significant because we go, oh, this is representing that place of the most holy place is the throne of God on an intellectual level. But Hebrews8.5 points out that the tabernacle itself as a whole is an icon of the heavenly sanctuary."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5421.92,"end":5422.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5423.04,"end":5490.98,"speaker":"Fr Stephen De Young","text":"The place of the throne and presence of God into which Moses entered when he was on Top of Mount Sinai. So the entire structure, this is not a structure with some iconography in it. The entire structure is an icon. Its entire purpose is to be an icon to allow for ritual participation in heavenly worship. That is the whole purpose and function of the tabernacle. If you take away a concept of iconography, the tabernacle doesn't make sense anymore. Right. This is its primary function of its whole design, which chapters and chapters and chapters are spent on in Exodus. This design. And one of the places where in the whole construction of the tabernacle that this distinction between iconography and idolatry becomes most pointed is in the construction of the Ark of the Covenant itself."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5492.26,"end":5495.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is a great example, which is."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5495.9,"end":5516.08,"speaker":"Fr Stephen De Young","text":"Going to go into the most holy place, which is going to be the footstool at the foot of God's throne between those cherubim. And on top of the Ark on the COVID Right. And see atonement episodes for. Why it's just the COVID."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5518,"end":5519.92,"speaker":"Fr Andrew Stephen Damick","text":"Mercy seat."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5520.56,"end":5521.04,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5521.52,"end":5522.24,"speaker":"Fr Andrew Stephen Damick","text":"The lid."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5526.08,"end":5536.64,"speaker":"Fr Stephen De Young","text":"They're commanded to make two literal graven images on it. Two literal graven images of things in the heavens above by God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5536.64,"end":5538.24,"speaker":"Fr Andrew Stephen Damick","text":"Like, this is not a Moses idea."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5538.84,"end":5539.16,"speaker":"Daniel","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5539.24,"end":5540.12,"speaker":"Fr Andrew Stephen Damick","text":"This is God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5540.36,"end":5553.24,"speaker":"Fr Stephen De Young","text":"This isn't Moses giving in. Like, hey, we got a lot of former pagans here. God, can we throw them a bone? Can we incorporate some of their practices? Not to bring up Pachamama. Sorry, sorry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5553.56,"end":5555.72,"speaker":"Fr Andrew Stephen Damick","text":"Oh, shots fire."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5559.8,"end":5608.14,"speaker":"Fr Stephen De Young","text":"Right. But, but, but the way the Ark of the Covenant is designed, like so many things in the tabernacle, we've talked about these before. Right. How all of these things, the imagery, all of these things, the furniture, are things that have relevance to what a pagan would be used to, but they've been changed. Right. So we've talked before about how instead of the priests having to come in and feed the God. Right. There is the table of the showbread from which God feeds his priests. Right. So these pagan things are taken and inverted and changed to make a point."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5608.54,"end":5611.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's always flipped over, turned around, reversed, whatever."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5611.98,"end":5623.79,"speaker":"Fr Stephen De Young","text":"Yeah. So the Egyptian equivalent of the Ark of the Covenant. So the Ark of the Covenant does follow an Egyptian design, but in that Egyptian design, as I say, it's not."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5623.79,"end":5625.55,"speaker":"Fr Andrew Stephen Damick","text":"A brand new, unique thing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5626.11,"end":5656.76,"speaker":"Fr Stephen De Young","text":"Right, right. And that Egyptian design are these barks. They were often put on boats, sailed up and down the Nile and this kind of thing. And on these barks on the lid, there would be these two winged goddesses, usually Isis and Nephthys, Right. On either side, extending their wings over those wings were sheltering in the Center. An idol of a God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5657.72,"end":5660.36,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And sacrifice would be offered to that idol."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5660.6,"end":5710.53,"speaker":"Fr Stephen De Young","text":"Right, Right. And so in this Egyptian version, we have here a good pagan example. We have an idol that's used for idolatry there at the center. And then it is surrounded by religious iconography. Right. Just like if you walked into an Egyptian pagan temple, there's an idol there at the center of the God. But there's all kinds of religious iconography painted on the walls. Right. So iconography, when you look at the Ark of the Covenant, the one God commands them to build, you have these two winged cherubim that aren't given names because they're not to be treated as other gods. Right. And then in the center, between their wings, overshadowed by their wings, you have nothing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5711.25,"end":5714.01,"speaker":"Fr Andrew Stephen Damick","text":"Nothing. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5714.01,"end":5750.11,"speaker":"Fr Stephen De Young","text":"Right. So you have the iconography without the idol. Right. The distinction between the Ark of the Covenant and its pagan equivalent is precisely the removal of the idol. Right. Two different things. Right. Two different things. Iconography and idols. And by the way, just because this is a bugbear that comes up every so often, they did not think God lived inside the Ark of the Covenant. The Ark of the Covenant was never a box with God in it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5750.51,"end":5755.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Our God is in heaven and on earth. He does whatsoever he wills."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5755.63,"end":5758.19,"speaker":"Fr Stephen De Young","text":"He. It was the footstool of his throne."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5758.83,"end":5759.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5759.63,"end":5843.59,"speaker":"Fr Stephen De Young","text":"Meaning it's the place if you're going to approach God, the great king of creation. You come up to his footstool and you bow and you make reverence there to speak to them. So the Ark of the Covenant is the place where. It's the point of contact. Is the point of contact between God and our world. Right. Is the point of contact is where on the day of atonement every year. Right. Remember, Yahweh, the God of Israel appeared above the Ark of the Covenant, meaning with his feet on it, his throne appeared. Right. He appeared there. And so, yeah, he's not inside it. He's not inside it. Now, interestingly, right, in all this, we just discussed about the tabernacle and the Ark of the Covenant here in Exodus, coming as it does right after the Ten Commandments. And the second commandment about not making a graven image and bowing down to it and serving it, funnily enough, there's no distinction made here between iconography and idolatry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5845.83,"end":5848.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because people know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5848.87,"end":5914.75,"speaker":"Fr Stephen De Young","text":"Yeah. There's no sort of explanation or clause. There's no place where Moses says, like, okay, hey, guys, remember that thing I said about not making a gray image of everything in heaven? And then I Just told you now to make the cherubim on the ark. Okay, here's how that all works. Right. It's okay in this case because God said so, or. Well, it's okay. But, guys, just don't go too far with the veneration thing and do an idolatry. Right. Doesn't do that. Doesn't disambiguate it. Just like St. Athanasius doesn't disambiguate it that we talked about last time. Right. There's why. Why we, as modern readers, we ask, we look at that, we say, like, that looks like a contradiction. Well, it means for the Bronze Age people who received it, the Iron Age people who read it over and over again and meditated upon it for their entire lives. It was a distinction that didn't need to be made. They understood it. They got it. They knew what iconography was, and they knew what an idol was."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5915.15,"end":5915.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5916.27,"end":5960.37,"speaker":"Fr Stephen De Young","text":"Because there are people worshiping idols. They're surrounded by iconography of various kinds. Everybody knew these were two different things. They didn't think they were related in any way. Right. It's like, I don't have to go and present you an argument as to why chalk and cheese are two different things. Right. If I said chalk and cheese are just alike, you look at me like I'm a nut. Right. For someone to really be confused about whether chalk and cheese are the same thing, they'd have to either have never seen cheese or never seen chalk. Right. And that's kind of why we now have to make these distinctions."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5961.41,"end":5966.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because people don't know what idolatry is. They've never seen it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5967.02,"end":5990.38,"speaker":"Fr Stephen De Young","text":"People these days haven't seen real literal idolatry. We talked about other kinds of idolatry last time. Metaphorical idolatry that we've certainly seen, but the real literal stuff. Right. Most of us have never seen. Right. And that's a good thing. I don't recommend going and attending pagan rituals around idols, but, yeah, we don't really know what it is."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":5992.09,"end":6003.33,"speaker":"Fr Andrew Stephen Damick","text":"Now. Suddenly imagining someone going up to some pagan temple. Hey, so I heard about this on this podcast. Can I see what y' all are doing in there? Yeah, don't do that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6003.33,"end":6054.77,"speaker":"Fr Stephen De Young","text":"Well, most of the time, those are gonna be revived in the Western world. There's gonna be this revived paganism stuff, which also is not the same thing. Right. It's very Protestant paganism, you know, where they're definitely not sacrificing any animals. Cause half the members are vegan, so. Right, that's true. Yeah. So. But yeah. So for people who are immersed in this world, it was just apparent to them that these are different things. And that includes everyone from the original heroes of the Torah all the way up through the church fathers. Right. They knew what went on in pagan temples in terms of idolatry. They understood pagan religious iconography, and they understood Jewish and Christian iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6055.25,"end":6055.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6057.01,"end":6081.8,"speaker":"Fr Stephen De Young","text":"They didn't think they were the same thing. Right. They understood these are just two different things. Right. So a sort of case study of this. And this is a good case study because it's an example of iconography, an example of idolatry that involve the same physical object."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6082.68,"end":6083.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6084.2,"end":6092.44,"speaker":"Fr Stephen De Young","text":"Right. In the context of the Israelites of their history. So the first one of these is from everybody's favorite book of the Bible, Numbers."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6093.24,"end":6093.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6095.32,"end":6100.6,"speaker":"Fr Stephen De Young","text":"Probably the most well known story in Numbers, because Christ himself refers to it in St. John's Gospel."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6101.23,"end":6101.55,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6102.03,"end":6104.11,"speaker":"Fr Stephen De Young","text":"About the bronze serpent."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6104.35,"end":6177.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this is from Numbers, chapter 21, starting with verse four and going through verse nine. From Mount Hor, they set out by the way to the Red Sea to go around the land of Edom. And the people became impatient on the way. And the people spoke against God and against Moses. Why have you brought us up out of Egypt to die in the wilderness? There is no food and no water, and we loathe this worthless food. Then the Lord sent fiery serpents among the people, and they bit the people so that many people of Israel died. And the people came to Moses and said, we have sinned, for we have spoken against the Lord and against you. Pray to the Lord that he take away the serpents from us. So Moses prayed for the people, and the Lord said to Moses, make a fiery serpent and set it on a pole, and everyone who is bitten when he sees it shall live. So Moses made a bronze serpent and set it on a pole, and if a serpent bit anyone, he would look at the bronze serpent and live. So that's use. Correct. Use doing the thing that God said to do with this icon of fiery serpent, everybody. Seraph."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6178.55,"end":6180.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Right. And so."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6182,"end":6182.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6182.2,"end":6211.3,"speaker":"Fr Stephen De Young","text":"God again tells them to make a graven image. Right. But how is it being used? Right. It's being used as an instrument through which God heals people. Yeah. Notice the direction of the action. Right. From back in Genesis, what makes Adam different than an idol? Right. Adam is there to cooperate with God so that God can work through him in creation."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6211.94,"end":6212.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6212.34,"end":6224.74,"speaker":"Fr Stephen De Young","text":"So this is God working healings through this image that he commanded them to make. Right. That's the direction of the action, is From God to people through image."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6225.22,"end":6225.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6227.06,"end":6236.64,"speaker":"Fr Stephen De Young","text":"Now, later on, they held on to this snake. And centuries later, something else happens in second kings or fourth kingdoms."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6237.19,"end":6284.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Chapter 18, verses 1 through 4. In the third year of Hoshea, son of Elah, king of Israel, Hezekiah the son of Ahaz, king of Judah, began to Reign. He was 25 years old when he began to reign, and he reigned 29 years in Jerusalem. His mother's name was Abi, the daughter of Zechariah. And he did what was right in the eyes of the Lord, according to all that David, his father, had done. He removed the high places and broke the pillars and cut down the Asherah, and he broke in pieces the bronze serpent that Moses had made. For until those days, the people of Israel had made offerings to it. It was called Nehushtan. So same object being treated in a very different way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6284.75,"end":6288.99,"speaker":"Fr Stephen De Young","text":"Right. So we're told here the Israelites are making offerings to it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6290.07,"end":6290.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, That's."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6290.99,"end":6346.36,"speaker":"Fr Stephen De Young","text":"And calling it. Yeah. And they gave it a name notice Nehushtan, which means the great serpent. Right. So they've now taken this. They're treating it as the embodiment of this great serpent, and they're going and making sacrifices to the great serpent through it. So the action is going from humans toward a spirit that is not God. Right. Through the idol, which they believe embodies that spirit, and therefore it has to be destroyed. So these are two very different types of actions. They are opposite actions, just like iconography and idolatry are opposites. At the beginning of Genesis, they're opposites here. The action is moving in either direction. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6347.64,"end":6354.84,"speaker":"Fr Andrew Stephen Damick","text":"You can take one object and use it in very different ways. One can be a good and holy way, and the other can be a dark, evil, sinful way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6355.48,"end":6365.64,"speaker":"Fr Stephen De Young","text":"Yes. Right. And that doesn't mean, you know, the Puritan argument, therefore we get rid of all of the object."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6367.01,"end":6367.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6368.21,"end":6370.77,"speaker":"Fr Stephen De Young","text":"So that no one can do the bad thing with it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6371.57,"end":6373.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6373.65,"end":6390.21,"speaker":"Fr Stephen De Young","text":"You know, everybody talks about the Pharisees trying to build a fence around the law. It's the Puritans who tried to build a fence around the law. Right. No dancing because of what it might lead to. Right. You can't touch alcohol because someone might get drunk."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6391.17,"end":6391.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6393.82,"end":6403.5,"speaker":"Fr Stephen De Young","text":"Right. These are not good arguments. These are the kind of rules that St. Paul refers to when he talks about rules that say, do not taste, do not touch."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6404.3,"end":6404.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6404.74,"end":6406.62,"speaker":"Fr Stephen De Young","text":"Right. And how those are people to be avoided."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6407.74,"end":6415.82,"speaker":"Fr Andrew Stephen Damick","text":"So, as I say, so speaking of flaming serpents, we actually have a caller, and I Think this is probably someone who is known to you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6417.75,"end":6419.03,"speaker":"Fr Stephen De Young","text":"Are they a flaming serpent?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6419.19,"end":6419.75,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6419.75,"end":6421.35,"speaker":"Fr Stephen De Young","text":"We'll find out in a second."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6421.43,"end":6428.03,"speaker":"Fr Andrew Stephen Damick","text":"And what are you doing on the phone, Seraph? We have Jules from Louisiana."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6428.03,"end":6433.75,"speaker":"Fr Stephen De Young","text":"Oh, boy. Jules, welcome."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6433.75,"end":6440.07,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, isn't he your priest? Couldn't you just talk to him at church? Why are you calling the podcast shows?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6440.55,"end":6444.47,"speaker":"Fr Stephen De Young","text":"It's the hubris of thinking that this question is going to enlighten the general public."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6446.33,"end":6453.45,"speaker":"Daniel","text":"No, no, this is not an enlightenment. This is merely. I'm just sitting in my apartment and I have a question."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6453.93,"end":6459.37,"speaker":"Fr Stephen De Young","text":"Oh, you're sad and lonely. Okay, fair enough. Talk to us, caller."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6459.85,"end":6460.73,"speaker":"Fr Andrew Stephen Damick","text":"We're listening."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6460.73,"end":6485.83,"speaker":"Daniel","text":"Okay. My question is, in a lot of iconography, you'll. Especially with, like, St. George slaying the dragon and way back in the longer times about dragons basically being seraphs, you know, but also in all of Byzantine. You say."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6486.79,"end":6487.59,"speaker":"Fr Andrew Stephen Damick","text":"I said. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6488.79,"end":6489.35,"speaker":"Daniel","text":"Okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6489.51,"end":6491.75,"speaker":"Fr Andrew Stephen Damick","text":"I'm being encouraging. Go ahead, go ahead."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6492.95,"end":6503.09,"speaker":"Daniel","text":"Thank you. I appreciate that. In all the Byzantine iconography I've seen of the seraphim, it always depicts them sort of with a human head with wings around them."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6503.41,"end":6503.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6504.29,"end":6516.21,"speaker":"Daniel","text":"So what distinction other than one's an angel and one's a demon? Like, what wisdom can we gain from the differences of those depictions?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6517.97,"end":6543.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, number one, I'm going to say I think you need to get out a little bit more, and I'm not commenting on your social life tools. I have no idea what that's like. But the reason I say that is because I have seen iconostasis with dragons incorporated into them, and they're not being depicted like being defeated by saints or angels or whatever they are in honorable places."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6544.34,"end":6545.14,"speaker":"Fr Stephen De Young","text":"Bishop staff."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6545.86,"end":6590.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, there you go. On the bishop staff, you've got serpents on the bishop's staff as well. So. So it's not that the bad guys always appear in one way and this and good guys always appear another way. It's just that what happened is there's this other way of depicting seraphim developed largely because of this association of the serpent in Genesis 3, you know, but still the serpentine imagery persists, you know, so how do you know the difference? It's really about context. If you see St. George stabbing it, that's a bad one. You know, if you see it on iconostasis or on vestments or on the bishop's staff, that's a good one. You know, the context makes it clear."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6590.94,"end":6601.74,"speaker":"Fr Stephen De Young","text":"Also, the other depiction, four of the wings are covering their body. Oh, yeah. So, I mean, they could have a serpentine body."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6603.34,"end":6608.7,"speaker":"Daniel","text":"Okay. This humble, More of a. Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6608.86,"end":6613.66,"speaker":"Fr Andrew Stephen Damick","text":"So, okay. All right. Does that answer your question, Jules, from Louisiana?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6614.78,"end":6621.74,"speaker":"Daniel","text":"That is sufficient to answer my question. It's more about whether or not there's a sword going through it or a spear going through it than scales."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6621.82,"end":6628.22,"speaker":"Fr Andrew Stephen Damick","text":"I mean, again, it's. It's really. Yeah, It's. It's about context, what's happening in this picture, you know?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6628.78,"end":6629.18,"speaker":"Daniel","text":"All right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6629.18,"end":6630.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So thank you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6630.26,"end":6631.18,"speaker":"Fr Stephen De Young","text":"Enjoy Cleveland."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6633.72,"end":6646.68,"speaker":"Fr Andrew Stephen Damick","text":"Enjoy Cleveland. Thank you very much, Jules. All right. Yes. So, yeah, we were saying the difference between, you know, differences in the actions."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6646.68,"end":6665.21,"speaker":"Fr Stephen De Young","text":"Whether something that we can see just with the. Just with the serpent. Yeah. And then there is not to go with the puritans and get rid of images. Right. Like, well, see, I know puritan types who take it this far where they won't even have a cross in their church because somebody might decide to worship it somehow."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6667.53,"end":6670.25,"speaker":"Fr Andrew Stephen Damick","text":"Sneak up to it, offer some sacrifices."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6670.41,"end":6673.53,"speaker":"Fr Stephen De Young","text":"Yeah. I don't even know exactly how that would work, but."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6673.85,"end":6675.21,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6676.25,"end":6724.88,"speaker":"Fr Stephen De Young","text":"But, you know, like, I'm thinking. I'm thinking more of like in the. In the first Brendan Fraser mummy movie, right? There's the scene with the guy where the mummy's coming at him, and so he pulls this cross on a chain out of his shirt and, like, holds it up, and the mummy doesn't stop coming. So he, like, pulls out a crescent moon, and then he pulls out a Star of David, and then he pulls, like, he's got, like, to cover all of his bases, Right. Hoping you'll find one that will ward off the mummy. Right. So it's like, sure, there could be a guy like that who's not a Christian even, and is just using the cross as a magic amulet or something. Right. That doesn't mean Christians should stop wearing crosses. Yeah, right. Like."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6726.72,"end":6737.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you know, it's that old. It's that old Latin phrase, abuses non toilet usam. I'm sure I'm mispronouncing it. Sorry, Latin teachers, but, you know, the abuse of something does not negate the use."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6738.4,"end":6759.21,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so. And, you know, if this isn't just, again, us arguing. Right. There's nothing in Second Kings to indicate, oh, man, God made a big mistake when he had Moses make that serpent because it led all those people into idolatry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6760.09,"end":6760.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6762.57,"end":6844.27,"speaker":"Fr Stephen De Young","text":"Right. There's not a whiff of that in the Hebrew scriptures. Right. The blame here is entirely on the people for what they did. Right. So. Yeah. And so we find. Because this distinction is ingrained throughout, like, iconography is one thing that we do, and idolatry is this other thing that we shouldn't do, but a lot of us do within Israel. Right. And then Judah. It's not surprising that when we excavate the earliest synagogues we found, they're full of iconography. There are tons of mosaics. We have piles. Piles is the wrong word to use. We have a number of first century synagogue ruins. Piles of ruins just did sound right from the first century because the Romans went around destroying them in Galilee. Right. And so we have. And a lot of them, we have the floors. Right. And the mosaics in the floors that have the zodiacs. We talked about in our episode about astrology. You have one of my favorite episodes of all time, actually, if you do say so yourself."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6844.35,"end":6844.99,"speaker":"Fr Andrew Stephen Damick","text":"I do."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6845.55,"end":6939.13,"speaker":"Fr Stephen De Young","text":"Yeah. You're telling me the other day how you thought you were particularly ingenious and on point during that episode. And, you know, besides just the zodiacs. Right. Sacred maps. Right. Meaning maps of sacred geography, where you have sort of spiritual locations and material locations, as we would call them, sort of mixed together in these mappings. And of course, just representations of biblical figures and biblical narratives. Iconography of Moses. Yeah, Iconography of David, Jonah. I mean, like, it just goes, Jonah, Samuel. Yeah. And scenes from biblical narratives. Right. Being being depicted iconographically. Right. And then, of course, in synagogues, post exilic synagogues, you have the development of Moses seat. Right. The seat of Moses, which, when there's no one actually sitting in it with teaching authority, is itself serving a kind of iconographic function of representing the authority of the Torah within the community. Right. As a physical depiction. Right. And so there's kind of within. Within Jewish iconography as we're coming to the time of. As we're coming to the time of Christ. And as I said, we know this from these Galilean synagogues. These are the synagogues that we read in the Gospels about Christ going and preaching in them."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6940.09,"end":6946.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He would have been standing amidst big mosaics of the zodiac amongst them, standing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":6946.57,"end":7128.38,"speaker":"Fr Stephen De Young","text":"In the midst of all this iconography. Right. And there really are kind of two main categories, we could say types, and those are sort of religious depictions being specifically scriptural depictions, really, in this case, of persons and events from the Scriptures and then cosmic depictions. Right. So depictions of the heavenly realms or cosmic geography, these kind of things. Right. Things structured to show, like even the zodiacs are structured to give an image of the night sky, which is the heavens. Right. Which they believed was a means God used to communicate with us. Right. So we can kind of talk about those two broad. Those two broad categories, and they seem to have come into. Right. Because of course, the, the, the iconography we talked about in the tabernacle gets adapted in the temple. But the synagogue iconography, which is somewhat different in the ways we just described, seems to have been developed out of the decoration of various shrines and grave sites. Right. Where the relics of prophets and saints were. Jewish prophets and saints in the post exilic period. Those are the first places where we start finding these kind of things. And then they kind of flower within the synagogues where you go to, you know, the grave site of the prophet Jonah. Right. Unfortunately, recently destroyed by Isis. And there are. Right. Iconographic depictions of Jonah and, you know, him being swallowed by a fish and these sort of things. Right. Yes, I know Leviathan, but these scenes from his life, him, you know, preaching at the overthrow of Nineveh. Right. We find those depictions there. Right. At the tombs of the prophets. And Christ even references this at one point when he talks about how the Pharisees adorn the tombs of the prophets. These are the kind of adornments that were on the tombs. That were on the tombs of the prophets. And we never see Jesus saying that there's a problem with this anywhere, even though it's all around him and going on in the synagogues. He never expresses a problem with synagogue worship. Right. Says this stuff's bogus, you should really be doing temple stuff. And that's it. Right. We never see that. Right. And this is why the early Christians just take over synagogue worship as Christian worship. Right. Follow the same pattern. But he also never says anything negative about decorating the shrines or, by the way, going to the shrines and the."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7128.38,"end":7128.82,"speaker":"Fr Andrew Stephen Damick","text":"Relics."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7130.74,"end":7133.7,"speaker":"Fr Stephen De Young","text":"Of Jewish saints to pray. Never says anything negative about that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7134.02,"end":7148.96,"speaker":"Fr Andrew Stephen Damick","text":"He makes a contrast. Like he says, you know, you adorn the tombs of the prophets. Right. But you, you know, but your behavior is garbage. Which the point is, the reason why that's a contrast is because. Okay. And good. To adorn the tombs of the prophets."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7148.96,"end":7185.97,"speaker":"Fr Stephen De Young","text":"Yeah. That. It's good. Yeah, yeah, yeah. But you aren't like them. Yeah. And in fact, your forefathers hated them and in some cases killed them and put them in those tombs. Yeah. So that, that seems to be sort of the direct line. So to finish up here talking about Israelite iconography, I want to point to a particular story in the life of Christ that's largely misunderstood, I think."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7186.61,"end":7194.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you'll have to follow closely here, folks, because this is probably a little different than people are used to thinking about the passage we're about to read."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7194.45,"end":7222.4,"speaker":"Fr Stephen De Young","text":"Yeah. Well, and it's because. Partially because of how it appears in translation, partly because of just a history of interpretation that really doesn't make sense if you think about it for two seconds. And partially because of a lack of understanding of this principle of iconography. And this is when in St. Matthew's Gospel, Christ gets asked by the Pharisees about paying taxes to Caesar."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7222.56,"end":7298.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this is Matthew, chapter 22, and I'm going to read verses 15 through 22. Then the Pharisees went and plotted how to entangle him in his words, and they sent their disciples to him along with the Herodians, saying, teacher, we know that you are true and teach the way of God truthfully, and you do not care about anyone's opinion, for you are not swayed by appearances. Tell us then, what you think. Is it lawful to pay taxes to Caesar or not? But Jesus, aware of their malice, said, why put me to the test, you hypocrites? Show me the coin for the tax. And they brought him a denarius. And Jesus said to them, whose likeness and inscription is this? They said, caesar's. Then he said to them, therefore, render to Caesar the things that are Caesar's and to God the things that are God's. When they heard it, they marveled, and they left him and went away. So the weird thing is a lot of people come away from this with the idea of Jesus saying, yeah, you should pay your taxes. You should pay your taxes. And then it says. And they marveled like, whoa. He said, pay your taxes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7299.8,"end":7309.85,"speaker":"Fr Stephen De Young","text":"Right? And so the whole point here is that they're trying to pull something by asking this question. They're trying to entangle him in his words, right? They're plotting against him."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7310.25,"end":7310.77,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7310.77,"end":7321.53,"speaker":"Fr Stephen De Young","text":"And so this is a setup question, right? The setup is if Jesus says, yeah, pay your taxes, then, right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7322.01,"end":7322.41,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7322.65,"end":7367.54,"speaker":"Fr Stephen De Young","text":"The disciples of the Pharisees and the Herodians, right, who are up to this, could say, hey, look, this guy's a Roman collaborator, right? Right. He's on the side of the Romans. He's no good. Right? And get all the people who hate the Romans for a variety of reasons that are obvious, if, you know Roman history will all get riled up against Jesus, and if he says, no, you shouldn't pay your taxes, then they can run to the Romans and say, hey, this guy's out there getting big crowds together and telling them not to pay their taxes. Right? So this is the trap, right? This is how they're trying to Entangle him. Right? So if Jesus answer was just, yeah, you should pay your taxes. Why would they marvel and be amazed?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7367.94,"end":7369.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They'd be like, gotcha."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7369.7,"end":7381.86,"speaker":"Fr Stephen De Young","text":"Yeah. Ha ha. Go get the local centurion. Right? And right. The Pharisees turning. Turning Jesus over the Romans would be a scandal, but the Herodians didn't care."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7383.46,"end":7383.94,"speaker":"Announcer","text":"That's."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7384.62,"end":7444.45,"speaker":"Fr Stephen De Young","text":"They're all collaborators. Right? So that's clearly. We're clearly misunderstanding if we think that the answer that Jesus gives. And so part of this is the way verse 20 in particular is translated in English. That's where Jesus says to them, whose. As it was in English, likeness and inscription. Is this the word that's used for likeness? There is icon. So it's literally the word icon. Whose icon is this? Whose image is this? Right. And so he. Christ is throwing this back at them because there's a play on words here. So on one level, okay, yeah, that's a picture of Caesar. Right? That's a picture of Caesar. That's Caesar's image."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7444.77,"end":7445.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7445.17,"end":7446.05,"speaker":"Fr Stephen De Young","text":"It's on the coin."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7446.37,"end":7447.41,"speaker":"Fr Andrew Stephen Damick","text":"Caesar's icon."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7447.89,"end":7456.13,"speaker":"Fr Stephen De Young","text":"Right, but whose icon is Caesar? Caesar is a man."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7457.33,"end":7459.93,"speaker":"Fr Andrew Stephen Damick","text":"And therefore, as we said earlier, he."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7459.93,"end":7461.17,"speaker":"Fr Stephen De Young","text":"Is the icon of God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7461.25,"end":7463.43,"speaker":"Fr Andrew Stephen Damick","text":"An icon of God, Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7464.15,"end":7487.11,"speaker":"Fr Stephen De Young","text":"And that's why Christ follows it up by saying, render to Caesar the things that are Caesar's and to God the things that are God's. Right? Sure. Caesar minted this coin, right? If he wants it back, give it back to him. But what belongs to God?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7489.04,"end":7490.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this coin and everything else."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7491.04,"end":7496.48,"speaker":"Fr Stephen De Young","text":"Everything including Caesar and the coin. Right, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7496.72,"end":7507.6,"speaker":"Fr Andrew Stephen Damick","text":"So, sure, you can't use this coin, like, if you're in the temple, because it's got this. Caesar being a God of the Romans, it's got a false God on it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7507.92,"end":7533.79,"speaker":"Fr Stephen De Young","text":"Right, Right. So it was considered. Yeah, yeah. So the idea here is, give Caesar back his coin. Give God everything. And they're like, okay, yeah, he got us back. Right. We can't turn that around on him. Right. But. Right, yeah. As you mentioned, this is a coin that couldn't be used in the temple because of the image of Caesar on it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7533.87,"end":7535.71,"speaker":"Fr Andrew Stephen Damick","text":"That's why there's money changers out front."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7535.95,"end":7567,"speaker":"Fr Stephen De Young","text":"There's money changers in the temple because they had separate coinage that was used internally in the. In the temple treasury. Right. And so Christ's answer here is deliberately playing on this distinction between idol and icon because Caesar himself is an idol. Right. He's an idol because they believe he's an embodiment of the God, and they."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7567,"end":7568.28,"speaker":"Fr Andrew Stephen Damick","text":"Offer sacrifice to him."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7568.49,"end":7584.89,"speaker":"Fr Stephen De Young","text":"And they offer sacrifice to Him. Right. And to the state. Right. That's an idol. Right. And Christ is pointing out by making this distinction that actually, no, he's called to serve as an icon because everything, including him, belongs to God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7585.53,"end":7603.18,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. So in a few minutes, we're going to take a break, but we actually do have a caller that I thought we would talk to before we take our next break, and that is James calling from Nevada. So, James from out there in the deserts of western Western United States, welcome to Lord Spirits podcast."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7603.82,"end":7607.66,"speaker":"Daniel","text":"Thank you. It's an honor to be here. Long time listener, first time caller."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7608.46,"end":7621.9,"speaker":"Fr Andrew Stephen Damick","text":"Wow. You know, the funny thing is, is on our very first episode, we had someone say that on our very first episode. And I kind of wondered at the time, like, is someone going to still say that, like years from now? And here we are three years later, and it's you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7622.63,"end":7631.27,"speaker":"Daniel","text":"So I will tell you that people who live here will say it's pronounced Nevada and Nevada, but not Nevada. Tomato, Tomah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7631.91,"end":7648.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you know, for a long time I was pronouncing the town that Father Stephen had lived in as Lafayette, because that's the more kind of French way of saying it. But they say it Lafayette. And he corrected me. So if you listen to the early episodes, you can hear me say Lafayette. So I'm willing to be corrected and say Nevada."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7648.83,"end":7756.54,"speaker":"Daniel","text":"Okay, wonderful. Well, thanks. Thanks so much for having me. So I really appreciated the earlier illustration of the bronze serpent. You know, it's right usage and its wrong usage. And as a former Protestant, my, my experience in Orthodoxy has been, you know, there's always the Protestant objections, sort of that outsider way of thinking where certain, certain objections might come up. And so in regards to, I think, kind of a parallel modern example, that is, I actually have a good friend of mine, he was recently baptized Fenurios. And as, as I'm sure you're well aware, there's a practice of praying to St. Fenarias. When you, when you've lost something, when you do find it, then bringing, I forget, I forget what it's called, but you're basically bringing, right? You bake cakes and you bring it as sort of this offering, right? So as, as an orthodox Christian, I know this isn't a form of idolatry, but I could see a lot of outsider, non orthodox people saying, well, wait a second, you know, this is you praying to somebody other than God. And then when you, you know, getting in a sense, your answer, now you're offering this hospitality to this person. Now you're, this is an offering. How is this not idolatry. Kind of like, you know, they might point to the illustration how, you know, the wrong usage of the bronze serpent. So I would love to hear kind of your response on how you would counter that way of thinking to those. So please do enlighten me and anyone else who may think that as well."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7756.86,"end":7815.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so this thing is called a fanuropita. That's the cake, the St. Fenurios cake. Right. So, I mean, we've talked a bunch of times about asking the saints for their help, so we probably don't need to kind of roll through that again. But. But, yeah, yeah. But, yeah, the part that probably might make people go, wait a minute, especially if they've been listening to this podcast, wait a minute, they're putting food in front of that icon? What's going on here, buddy? Right. So there's a lot of important dissimilarities. One really important dissimilarity is that in idolatry, the offerings are made in order to get the result that you want. And if you make the offerings in the correct way, then. Then you're guaranteed, you know, the result. So it's a kind of religious technology."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7815.92,"end":7816.56,"speaker":"Daniel","text":"Okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7816.88,"end":7946.78,"speaker":"Fr Andrew Stephen Damick","text":"You know, so that's, that's one distinction, you know, with, with the. It's, it's. It's blessed as a. As a way of saying thank you to something that has already been received. Right. So there was simply a request made, and the answer could be no, you know, and, you know, the tradition for those who have never heard of this, is St. Fenurios, who himself was a sort of lost saint, like he was forgotten by the church. And then his icon was discovered in Rhodes, and he appeared to the. I think it was a bishop that discovered the icon, and they didn't really know anything about his life other than the images that were on the icon, because it was what they call a life icon, which has sort of scenes from the life. And so apparently at the time, St. Fernando said to him, you know, if someone's. Because I was lost, if someone loses something, I will help them find it. But, you know, in exchange, I'm going to ask them to say a prayer for my mother and to offer this cake as a memorial as part of that. So, I mean, you know, we have other memorial food, right? We have koleva that we offer in the church when we pray for the departed, which is so sort of fundamentally what the is. It's food that's blessed as part of a memorial for someone, but importantly, it is not brought in a procession it is not divided up between the priests and the people. It is not placed on an altar. It is not offered up to a spirit as to a God. I mean, it goes on and on. Think about all the things that go into sacrificial ritual, both pagan sacrificial ritual and Christian Eucharist has all those things that I just mentioned in common. Has the practice of blessing of. Doesn't have any of that in common. Yeah, I mean, it has way more in common with Happy birthday. Here is a cake that we have made to celebrate you and to be thankful for all that you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7947.6,"end":7948.16,"speaker":"Fr Stephen De Young","text":"You are."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":7948.4,"end":8009.05,"speaker":"Fr Andrew Stephen Damick","text":"And we're going to pray over it and bless it and divide it up amongst everybody here. Like, has way more in common with birthday cake, you know, so just because a piece of food is put in front of an image doesn't make it a sacrifice. There's a whole set of ritual that goes along with it. That, that goes along with sacrifice that is simply not there in the tradition of the. Even like when I was much younger in the Orthodox Church, I knew someone in my parish, not the parish that I'm in now. This is a long, long time ago. Who, I mean, God love her, this woman must have lost her keys every single day and got St. Fenurius to help her find it or whatever because, like she was bringing Faranopa to the church. It seemed like once a week almost. Sometimes I was like, oh, I guess she lost something again. You know, get her one of those things where you whistle and your keys beep at you. I don't know. But even then, even like when it's sort of almost kind of semi obsessive like that, it's still not idolatry. It's still not."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8009.45,"end":8010.09,"speaker":"Daniel","text":"That's good."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8010.81,"end":8011.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8011.45,"end":8019.61,"speaker":"Daniel","text":"So I guess my follow up would be then you're telling me that celebrating birthdays is not a pagan ritual."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8020.89,"end":8022.25,"speaker":"Fr Andrew Stephen Damick","text":"It depends on how you do it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8022.73,"end":8024.97,"speaker":"Fr Stephen De Young","text":"Sorry. Watchtower Bible and Traxicide."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8024.97,"end":8026.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8026.81,"end":8027.29,"speaker":"Daniel","text":"That's right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8027.61,"end":8036.33,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. Jehovah's Witnesses. No, no, it's. I mean, yeah, I mean, we celebrate the birthday of the Lord."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8036.73,"end":8041.49,"speaker":"Daniel","text":"That's right. So that was, that was just more of an aside comment, but that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8041.49,"end":8042.01,"speaker":"Fr Andrew Stephen Damick","text":"I hear you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8042.01,"end":8042.29,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8042.29,"end":8059.7,"speaker":"Daniel","text":"Both disambiguing that. So I, I appreciate that, that clarification. So, so thanks for. Thanks for that and for all that you guys do. So. Huge fan of what you guys do and it's been a huge part of my journey through Orthodoxy as well. So thank you."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8060.02,"end":8062.82,"speaker":"Fr Andrew Stephen Damick","text":"Thank God. Please, please remember us in your prayers."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8064.1,"end":8066.54,"speaker":"Daniel","text":"Yes, happily too all righty."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8066.54,"end":8069.78,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, James from Nevada. All right, Nevada. Nevada."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8069.94,"end":8071.66,"speaker":"Fr Stephen De Young","text":"Before the break. Before the break."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8071.66,"end":8073.06,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, go ahead, Father."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8073.86,"end":8131.32,"speaker":"Fr Stephen De Young","text":"And related to that. So imagine somebody gets a cancer diagnosis, and it's not a good one. And so they ask a group of their friends to pray for them. And over the next months, while they're getting treatment, all their friends are praying for them. And then at the end of the treatment, they find out they've gone into remission. And so they throw a party, and they invite all those people who are praying for them over, and they say, thank you so much for praying for me. It's so wonderful what God has done in healing me. And we've set out this big spread, so everybody eat and enjoy. Right? Now, imagine thinking that's idolatry, because that's kind of what I hear when a Protestant asks that kind of question about St. Fenurios."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8132.62,"end":8133.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8133.26,"end":8172.87,"speaker":"Fr Stephen De Young","text":"Because there's an underlying assumption there that the saints, these actual Christian people who actually lived, who continue to live in Christ and who are still part of our church community, we're part of theirs, are somehow more comparable to pagan gods than. Than to our fellow Christians, which is what they actually are. Right. The question presupposes that St. Fenurius is some kind of pagan God. It's not arguing it, it's presupposing it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8174.07,"end":8174.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8174.43,"end":8226.15,"speaker":"Fr Stephen De Young","text":"Because if this person is like my Christian uncle who I asked to pray for me for something and then invite him to eat with me to give thanks to God that the prayers were answered, no one in their right mind would call that idolatry. Right. So this is about a weird pathology that's been ground into a lot of our Protestant friends. To think of Christians from former genera, past generations of the church, as somehow pagan or as somehow. Right. They're spirits. They're the spirits of the righteous made perfect in Christ. They're not demonic."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8226.47,"end":8228.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. It's kind of the opposite."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8229.59,"end":8231.75,"speaker":"Fr Stephen De Young","text":"That's not right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8234.23,"end":8242.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right. That said, we're going to take our second and final break, and we'll be right back with the third half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8243.06,"end":8259.3,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8270.26,"end":8289.84,"speaker":"Fr Andrew Stephen Damick","text":"It's easy to shy away from talk about the good creation, as if that implicates a consumerist approach to the world or some kind of hedonism but when the early Christians discussed the goodness of creation, they meant that the world has a purpose and that the earth is a real theophany of heavenly order."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8291.92,"end":8294.08,"speaker":"Fr Stephen De Young","text":"I'm Robin Phillips, and my recent book."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8294.24,"end":8315.41,"speaker":"Fr Andrew Stephen Damick","text":"Rediscovering the Goodness of Creation walks through God's plan for the earth. Through the teaching of scripture and the saints, we discover that God's purpose for the world is not to destroy it, nor for us to spend eternity disembodied in heaven. Rather, God plans to one day resurrect the earth so we can experience the world as we were meant to."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8315.81,"end":8331.69,"speaker":"Fr Stephen De Young","text":"This has implications for how we live today, including how we work, raise our families, appreciate art, approach marriage, and work with technology. Rediscovering the Goodness of Creation is available@store.ancient faith.com."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8334.97,"end":8351.14,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-A radio."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8351.94,"end":8357.06,"speaker":"Fr Andrew Stephen Damick","text":"Hey, everybody, welcome back. It is the third half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8357.46,"end":8362.18,"speaker":"Fr Stephen De Young","text":"That commercial will prove to be apropos by the end of this half."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8362.26,"end":8380.18,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true. Eerily appropriate. Nice choice, Montesqua Trudy, for that, that commercial there. You know, it's funny in our, in our YouTube stream, someone commented, you know, in the chat, third half, and I'm like, oh, he must be new."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8380.34,"end":8386.58,"speaker":"Fr Stephen De Young","text":"Yeah, you're new. Welcome. There was once and only once so far, a fourth half."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8387.22,"end":8392.82,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's true. There was a fourth half that was a double, double show."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8393.3,"end":8395.38,"speaker":"Fr Stephen De Young","text":"We were firing on all cylinders."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8396.18,"end":8422.69,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right, so in the first half, we talked about pagan iconography. Second half, Jewish, Israelite, I should say. Israelite iconography. Sorry, Jewish is just a subset of Israelite Israelite iconography. And now here in Act 3, finally, Christian iconography. So, yeah, this just pops out of nowhere, just suddenly invented by some kind of idolatrizing 4th century Christians in Syria, maybe?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8423.09,"end":8428.37,"speaker":"Fr Stephen De Young","text":"Yes, clearly. Oh, no, the opposite of that."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8428.53,"end":8428.93,"speaker":"Daniel","text":"No."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8431.98,"end":8434.54,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, there's precedent."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8435.74,"end":8456.78,"speaker":"Fr Stephen De Young","text":"So literally, what we find is the earliest Christians, as with so many things, just take over what's being done in Second Temple Jewish communities and specifically synagogues, and continue it, but in a Christian context."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8457.35,"end":8458.15,"speaker":"Fr Andrew Stephen Damick","text":"Keep doing it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8458.71,"end":8505.2,"speaker":"Fr Stephen De Young","text":"So you continue to have the same types of iconography that you had in synagogues, in Christian churches, obviously with the person of Jesus Christ taking a sort of supreme prominence in that iconography, but also his mother prominently being featured. St. John the Forerunner. Right. Saints Peter and Paul, other figures, because we have more scriptures now. And so we start to see other figures appearing in the iconography, but the iconography is continued. And those figures and events from the Hebrew scriptures don't go away either. They're just added to. Yeah, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8505.28,"end":8506.64,"speaker":"Fr Andrew Stephen Damick","text":"The story continues."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8506.96,"end":8573.45,"speaker":"Fr Stephen De Young","text":"Yeah. And so that. Yeah. Function just continues. As churches start to be constructed and decorated, they follow the same pattern of the tabernacle as forming this iconographic function themselves as a space. Right. Reproducing this divine council, the heavenly throne room. Right. The. The presence of God which is being entered into. And so the fundamental problem that faces the iconoclast, ancient or modern, although at least the ancient one didn't have archaeology, etc. So this becomes an even more pointed problem for the modern iconoclast is that the modern iconoclast has to argue that Christianity in particular was iconoclastic. They have to argue that Christians came along and removed Jewish iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8575.13,"end":8575.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8575.61,"end":8605.74,"speaker":"Fr Stephen De Young","text":"Said no, no, no icons. We're Christians now. Right. For some reason. Right. That Christianity is iconoclastic over. Against Judaism, which makes no sense. In light of the Incarnation. In light of our understanding of the Incarnation, if anything, based on the Incarnation, you would expect Christianity to be less iconoclastic."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8606.06,"end":8608.62,"speaker":"Fr Andrew Stephen Damick","text":"Yes. More icons."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8609.58,"end":8636.9,"speaker":"Fr Stephen De Young","text":"Right. The icons would be more prominent or more important. Right. And this is the line of argument that all of the church fathers of the iconoclastic period who are arguing against iconoclasm make. They point to the Incarnation. Right. They point to the Incarnation. They point to the matter that made up Christ's body."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8638.9,"end":8639.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8639.7,"end":8731.11,"speaker":"Fr Stephen De Young","text":"The matter that made up the cross on which he was crucified. Right. The physical matter. The physicality of the Incarnation, of our salvation. Christ's human mother, who is a human person. That's what they point to. Because if anything, again, Christianity would be less iconoclastic. So if you can frame an argument that while Second Temple Judaism was fine with iconography, Christianity for some reason was iconoclastic. If you can find a theological way to frame that argument, I'd love to hear it because I've never heard anyone even attempt it. Right. Modern iconoclast, their only argument is an argument from silence, a series of arguments from silence. But we don't have evidence yet. We haven't dug anything up yet. We haven't. Right. There's not a lot of comments about it in this or that church, Father. Right. Like the argument we mentioned last time. Right. Saint Athanasius doesn't mention it. These are all just a series of arguments. From silence to make the iconoclastic point with the knowledge of history that we have, the archeology we have, you have to make a theological argument that based on the theology of the New Testament, early Christians became iconoclastic over against the Judaism of the time."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8732.23,"end":8734.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That it was a reform movement, effectively."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8735.51,"end":8737.43,"speaker":"Fr Stephen De Young","text":"When it came to iconography. Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8737.43,"end":8738.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8738.87,"end":8747.91,"speaker":"Fr Stephen De Young","text":"And like I said, I'd love to hear it because I don't think you've got a snowball's chance and you know where of making that argument."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8748.15,"end":8756.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I'm going to talk now about some of the actual, some of the actual real things that have been archaeology prove that this is true."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8756.73,"end":8830.44,"speaker":"Fr Stephen De Young","text":"But it's important. See, one of the things that assumes there are a couple assumptions that were made when we're talking about. So we talked about ancient iconoclasts and we talked about contemporary iconoclasts. You got the mid range people, you got your John Calvin's. Right. And when you look at John Calvin's arguments against iconography, you could see where they just went wrong. Right. So he says there was absolutely no iconography before 500 AD. Sorry, there was. We know now for a fact you like, you can't make that argument. Yeah, right. Like we literally have proof that that's not true. Right. But hey, arguments from silence. Right. They never get you into trouble. But also, but also they were based on this assumption and we've talked about this a lot on the show that people made in the early modern period and some people even make to this day that the Judaism at the local synagogue, even if it's a Reformed synagogue, frankly, the Judaism at the local synagogue is identical to what was going on in the second Temple period, which it's not."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8831.16,"end":8832.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8833.24,"end":8876.13,"speaker":"Fr Stephen De Young","text":"Jewish iconoclasm. Right. The Jewish by and large rejection of images. Right. Was a reaction against the Christian. Against Christian iconography, Christian use of iconography. There was a Reform movement within Rabbinic Judaism in the post Christian period that was iconoclastic. Right. But Calvin didn't know that. Right. John Calvin thought, oh, Jewish people don't use iconography, don't have iconography. So at the time of Christ they didn't have iconography. Christians started doing it at some point."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8877.01,"end":8877.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8878.37,"end":8926.93,"speaker":"Fr Stephen De Young","text":"As far as he knew that was true. But we now know it's not true. That the opposite is true. That the synagogues at the time of Christ were full of iconography and were full of iconography for some time afterward, like centuries afterward. Right. And that movement happened over there on the rabbinic Jewish side, not on The Christian side. Right. The Christian side is in continuity with that. So Christians didn't start using iconography ever. They were always using it. That's why here and there, as you pick through some of whom are legitimately fathers and some of whom are definitely not, some of whom are just early Christian writers, as you pick through people in the early centuries, you here and there find someone who's kind of iconoclastic in some sense."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8927.57,"end":8927.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8927.97,"end":8934.97,"speaker":"Fr Stephen De Young","text":"Those are the outliers. The people who don't comment on it are surrounded by it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8936.09,"end":8941.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not an argument being made for it because it's not a controversial question."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8942.89,"end":8943.37,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8944.25,"end":8944.81,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8945.53,"end":8946.01,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8946.57,"end":8955.69,"speaker":"Fr Andrew Stephen Damick","text":"It's like, you know, well, when was the last time at your Baptist church someone actually argued for using a hymnal? You know, like it's not argued for."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8955.69,"end":8957.21,"speaker":"Fr Stephen De Young","text":"It'S just the thing that everybody does."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8957.77,"end":8958.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8958.49,"end":8981.21,"speaker":"Fr Stephen De Young","text":"And let's say hymnals were abolished at some point in favor of overhead projectors or PowerPoint. Right? Right. And then somebody might come many years later. Right. And be like, oh, well, this person in the 19th or 20th century doesn't say anything about hymnals, so they must not have had them."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8981.53,"end":8988.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then the problem is, then you dig one up, which is what happens."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":8988.05,"end":9168.95,"speaker":"Fr Stephen De Young","text":"Right. And then you find. Right. Yeah, yeah. In New Jersey there are people arguing I should be able to pump my own gas in Louisiana. No one ever makes that argument because everybody pumps their own gas. Right, right, right. When it's, when it's just the normal thing, you don't talk about it much. Right. You only talk about it when somebody's coming to argue with you against it. Right. Or someone's doing something weird. You might find something about whether people should pump their own gas in Louisiana. If some guy starts going to gas stations and spraying gas everywhere, like Zoolander. Right. Like then it might show up in the local paper. Right. But so. Right. I pointed to evidence that this was an ongoing thing within Judaism and was present in early Christianity. Some of the best evidence we have comes from the city of Dura Europos, because it was pretty well preserved after its destruction in the latter part of the 3rd century AD during Europa was as a city. And it gives us a snapshot of a pre Constantine 3rd century Roman city in Syria. And in that city in the. What that's been excavated is a synagogue. This is a synagogue prior to. And the church. We're going to talk about everything we're talking about. This is prior to the legalization of Christianity. This is why Christianity is still an illicit religion, albeit only Sporadically persecuted. This synagogue is covered in iconography still. And the Synagogue dates around 244 AD. 244. Covered in iconography. When I say covered in iconography, I mean an icon of Samuel anointing David King. Right. The kind of iconography you see in an Orthodox church today, but grounded in the Hebrew Bible. And again, we know because of the first century synagogues we've excavated that this is not, oh, this weird synagogue in Syria decided to copy the Christians. Yeah, right. Christianity is still an illicit religion, number one. And number two, we have those earlier synagogues that follow the same pattern. So the Dere Europo synagogue has just continued as a synagogue in non Christian rabbinic Judaism to use a wealth of iconography in their worship space. There is also a house church there from 235. And part of that house church, it's a big house, it's like an estate. And a portion of it has been made into a Christian worship space and is covered in Christian iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9169.03,"end":9213.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we should mention, like sometimes when people think of house churches in the early church, they think of suburban living rooms and sitting around a coffee table with a guitar or whatever. No, this is, this is so much a church that it like has a, a permanent baptistery in it, you know, and an altar. Yeah, yeah, exactly. In an altar. Yeah. And. And you know, by the way, you know, you, you guys, you can Google up images of this dura D U R A europos E U R O P O S Look this up. You can see pictures of the synagogue, you can see pictures of the church. And look at the iconography. Like it's there for everybody to see. Don't take our word for it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9214.24,"end":9273.46,"speaker":"Fr Stephen De Young","text":"Yeah. And so, yes, this assumption again, that house church being simple. Oh, they're just meeting in people's houses. Right. Poor people didn't have houses. Right. Like this, where a big group of people could meet. This is the wealthy guy's estate where he takes a room or a whole building and converted it for Christian worship. That's what this is. And when we say converted it for Christian worship, you have to remember what this would have looked like when said guy was a pagan. Right. We got to get rid of goose Zeus. We're not going to have goose Zeus in a Christian worship space. Right. And they don't just come in and whitewash it. Right. This is what's important. Right. If they were iconoclasts, they would have come in and whitewashed it. Right. It would have just been no iconography. They get Rid of the pagan iconography and they replace it with Christian iconography. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9273.7,"end":9284.58,"speaker":"Fr Andrew Stephen Damick","text":"So when we say that the space was converted, we don't mean that it was renovated, you know, by some carpenters and whatever. I mean, maybe, but we mean converted, like a religious conversion."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9285.26,"end":9285.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9285.9,"end":9290.46,"speaker":"Fr Andrew Stephen Damick","text":"It used to be that this God was worshiped here, and now we're worshiping the true God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9291.18,"end":9310.54,"speaker":"Fr Stephen De Young","text":"Right, right. And to sort of accentuate this point, right, so we've got the synagogue with iconography. We've got the house church with similar iconography, but Christianized. Right. There's also a Mithraeum in Dura. Europos."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9310.83,"end":9312.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Place where you worship Mithras."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9312.83,"end":9333.87,"speaker":"Fr Stephen De Young","text":"Mithras, right. The Mithras cult. And guess what's there? Statuary of Mithras, like slaying the bull and stuff. With altars in front of them for off making sacrificial offerings."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9334.67,"end":9335.23,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9335.95,"end":9352.19,"speaker":"Fr Stephen De Young","text":"Okay. So over here at the Mithraeum, idolatry is going on at the synagogue and at the church, idolatry is not going on, but iconography is."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9353.07,"end":9356.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they've got. And the Mithraeum is iconography too."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9356.51,"end":9356.99,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9357.23,"end":9361.95,"speaker":"Fr Andrew Stephen Damick","text":"There's a BAAL temple also there as well, if I remember correctly. In the same city."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9362.39,"end":9362.71,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9364.39,"end":9365.83,"speaker":"Fr Andrew Stephen Damick","text":"Idolatry happening there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9366.15,"end":9419.76,"speaker":"Fr Stephen De Young","text":"Yeah. So some of our contemporary iconoclasts. Right. Who are aware of this. Right. Who are aware of this whole thing, but don't. I think they have a firm idea that iconography is bad. And so they're just trying to make arguments. They're not trying to actually look at this evidence and learn from it and potentially change their opinion. That's the only way I can explain it, because I don't know how you can look at what we just laid out, especially with the Mithraeum and the other pagans and this distinction and the similarity between the synagogue and the church. I don't know how you can look at that and come to an iconoclastic presuppose conclusion. It literally doesn't make sense to me how you could do that. So I have to say, just they're making an iconoclastic argument. Someone presents this as counter evidence. Right. And they want to neutralize it. And the place they take it is, well, this is where iconography started."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9420.8,"end":9424.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This must be the earliest known piece of iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9424.8,"end":9442.16,"speaker":"Fr Stephen De Young","text":"This is a Syrian phenomenon. This is just something that starts in Syria. So it starts in Syria. Iconography starts in Syria in the third century, weirdly, also including the synagogue, and then somehow spreads to literally every Christian."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9442.16,"end":9446.45,"speaker":"Fr Andrew Stephen Damick","text":"Church on earth with very few objections."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9447.25,"end":9491.23,"speaker":"Fr Stephen De Young","text":"Yes. With very few objections. And to churches that aren't in communion with each other. Yeah, right. Because this has to go to the Church of the East. This has to go to later on as it's spreading to Chalcedonian and non Chalcedonian churches. Iconography everywhere. Let me add, from what we know, the Aryans even use iconography. So throw them in too. Less than a century later, after it supposedly started. That. That argument makes no sense. I'm sorry, but it's ridiculous."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9493.23,"end":9493.63,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9493.95,"end":9527.59,"speaker":"Fr Stephen De Young","text":"It's ridiculous. It is at best special pleading. Right. A bizarre kind of special pleading, but like that. That it doesn't hold water. I'm sorry, Right. The only, you know, this may be jumping the gun. We're not done with the half yet. But frankly, the only feasible, rational, iconoclastic argument you can make is just that the whole Christian church was wrong for 1500 years."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9528.15,"end":9530.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, we've heard that argument before."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9530.79,"end":9533.67,"speaker":"Fr Stephen De Young","text":"Right. There are Protestant folks willing to make that argument."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9533.67,"end":9534.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9534.03,"end":9541.19,"speaker":"Fr Stephen De Young","text":"And if you're one of them. Right. Then throw in iconography to your list of things the church was wrong about for 1500 years."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9541.59,"end":9544.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, at least a consistent argument."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9544.39,"end":9555.68,"speaker":"Fr Stephen De Young","text":"Yeah, but I mean, and even then, even then, right. You got a lot of problems with Christ in first century synagogues."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9556.96,"end":9557.6,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9557.6,"end":9630.02,"speaker":"Fr Stephen De Young","text":"And the apostles. You still have a lot of trouble even with that argument. But at least it's internally consistent, I guess. Yeah, yeah. So, I mean, this other stuff, it just does not work, folks. So. And as we talked about with the shrines and relics and burial sites in the Jewish context, we of course also find iconography in the catacombs in the Christian burial spaces. There's people now wanting to argue about how much and how often they were used as worship space. But either way, right. The areas where the relics are. Right. So we talked back in the first half about what veneration is. We said that most of what veneration is is this kind of active viewing. Right. This kind of participatory viewing. Right. So I mean, veneration strictly. I mean, we're just defining the word. It means to pay the due honor or respect to something or someone."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9630.72,"end":9639.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's about honor and respect. That's really what it's. We're not lying. That's really what the word means. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9639.84,"end":9663.85,"speaker":"Fr Stephen De Young","text":"And so way back at the beginning of the episode, remember, I gave the example of people, you know, saluting the flag and singing the national anthem, and I said, that's veneration. Yeah, Right. The idea there is the people who are doing that, are doing that to show honor and respect to the nation by venerating its iconography. That's what they're doing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9664.17,"end":9671.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there are literally laws against disrespecting certain elements of the American iconography."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9671.37,"end":9681.53,"speaker":"Fr Stephen De Young","text":"Because it's almost like the honor you pay to an icon passes to its prototype in secular American thought. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9681.87,"end":9685.15,"speaker":"Fr Andrew Stephen Damick","text":"Like, if you do that, you're disrespecting America."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9685.23,"end":9696.83,"speaker":"Fr Stephen De Young","text":"Right. Yeah. But so the other piece, and this is the piece where the rubber meets the road for a lot of contemporary iconoclasts is kissing."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9697.07,"end":9700.03,"speaker":"Fr Andrew Stephen Damick","text":"It's the kissing. Is this a kissing book?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9700.43,"end":9728.96,"speaker":"Fr Stephen De Young","text":"Yeah, I've got it. And again, I've got to be honest. Right. And Protestant friends, please join me in being honest about this. A lot of Protestant objections to stuff in the Orthodox Church is just that this or that gives them the heebie jeebies. It's okay to have the heebie jeebies. It's okay to feel weird doing something. Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9728.96,"end":9729.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9730.12,"end":9761.35,"speaker":"Fr Stephen De Young","text":"But that's different than an actual rational objection. Feeling weird about kissing something. Feeling weird about being in the presence of a saint's hand. Feeling weird about the Theotokos because you've had, like, anti Roman Catholic stuff about Mary drilled into your head your whole life. That's fine. Right. There's nothing. There's nothing wrong with you feeling that and experiencing that. Right. But that doesn't mean there's something wrong with it. That just means you have the heebie jeebies about it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9761.82,"end":9775.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so kissing everybody in America, we kind of like, you don't say hi by. By kissing someone. Kissing a woman's hand is considered to be."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9777.74,"end":9778.78,"speaker":"Fr Stephen De Young","text":"Quite continental."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9779.66,"end":9781.74,"speaker":"Fr Andrew Stephen Damick","text":"It's quite continental. There we go."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9782.7,"end":9783.18,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9783.18,"end":9801.58,"speaker":"Fr Andrew Stephen Damick","text":"Like. Or, like super formal. Super duper, duper formal, you know, or, you know, a romantic gesture. Right. But like, kissing in a lot of the world is just a way of showing respect, like, you know, in somebody."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9801.58,"end":9803.58,"speaker":"Fr Stephen De Young","text":"On both cheeks to greet them. Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9803.58,"end":9811.74,"speaker":"Fr Andrew Stephen Damick","text":"In France, that's. That's pretty. In the Middle east, they do that, too. Kissing on both cheeks, sometimes two times, sometimes three times, depending on where you go."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9812.06,"end":9816.34,"speaker":"Fr Stephen De Young","text":"In the Middle east, adult men who are friends walk around holding hands."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9816.82,"end":9817.86,"speaker":"Fr Andrew Stephen Damick","text":"Oh, my goodness."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9818.02,"end":9823.94,"speaker":"Fr Stephen De Young","text":"That gives everyone in the United States heebie jeebies. It's okay that it gives you heebie jeebies, but that doesn't mean there's something wrong with it per se."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9823.94,"end":9844.62,"speaker":"Fr Andrew Stephen Damick","text":"Not just heebies. Also jeebies. Yes. You know, and here's the thing. Here's the thing, kids. In the Old Testament, there's Kissing. Going on with stuff. Kissing Torah scrolls. Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9844.62,"end":9846.38,"speaker":"Fr Stephen De Young","text":"Jewish circles. Kissing the Torah scrolls."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9847.02,"end":9848.18,"speaker":"Fr Andrew Stephen Damick","text":"Kissing the Torah scrolls."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9848.18,"end":9849.18,"speaker":"Fr Stephen De Young","text":"People kiss each other."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9849.5,"end":9854.46,"speaker":"Fr Andrew Stephen Damick","text":"People kiss each other. You know, St. Paul says, greet one another with a holy kiss."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9856.7,"end":9865.58,"speaker":"Fr Stephen De Young","text":"Greeting with a kiss was a liturgical act throughout Christian history from St. Paul until the present day, frankly. Although the kiss of peace has gotten greatly watered down."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9866.34,"end":9866.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9866.74,"end":9869.74,"speaker":"Fr Stephen De Young","text":"It's now like the handshake of peace or the nod and grunt."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9869.74,"end":9870.7,"speaker":"Fr Andrew Stephen Damick","text":"The handshake of yo."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9870.7,"end":9871.06,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9874.18,"end":9891.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. So, I mean, kissing is. It's just a reality throughout the world that this is very, very normal way to greet, to show respect. You know, it's not part of American culture really, but it's part of almost every other culture."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9892.24,"end":9892.48,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9892.64,"end":9898.24,"speaker":"Fr Stephen De Young","text":"It's a show of friendship and respect and never, never an act of worship."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9898.8,"end":9904.4,"speaker":"Fr Andrew Stephen Damick","text":"No. Idolaters don't offer worship to their idol by kissing it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9904.64,"end":9911.6,"speaker":"Fr Stephen De Young","text":"Yes. They did not form a line, and I'll go kiss the statue. That never happened in paganism."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9911.92,"end":9918.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're making sacrifices to it. You know, that's what's going on with."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9918.89,"end":9919.13,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9919.13,"end":9920.09,"speaker":"Fr Andrew Stephen Damick","text":"With idolatry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9920.33,"end":9926.49,"speaker":"Fr Stephen De Young","text":"I've seen lots of people kiss their spouse. I never thought they were worshiping their spouse."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9926.81,"end":9927.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9927.45,"end":9931.93,"speaker":"Fr Stephen De Young","text":"I've seen them kiss their children on the forehead. I never thought they were worshiping their child."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9932.41,"end":9938.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. So, I mean, if kissing is worship, then that means you should never kiss anything except God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9938.57,"end":9940.25,"speaker":"Fr Stephen De Young","text":"God. And how do you do that?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9941.45,"end":9947.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. That's. I mean, I don't. How would that work?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9948.46,"end":9954.46,"speaker":"Fr Stephen De Young","text":"Yeah. So the idea that somehow kissing something is worshiping it is just bizarre."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9955.34,"end":9955.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9956.3,"end":9974.44,"speaker":"Fr Stephen De Young","text":"Right. Like, that's not how idolatry works. That's not how paganism works. I'm sure. I'm sure there is some religion or cult somewhere that found some way to make kissing an act of worship. And I'm sure someone will send us an email telling us about it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9974.44,"end":9975.92,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9976.8,"end":9979.12,"speaker":"Fr Stephen De Young","text":"Exception to the rule. Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9980.24,"end":9982.64,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of. Lot of weird stuff out there."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9982.96,"end":9996,"speaker":"Fr Stephen De Young","text":"Yes. Yes. So I'm sure there's somebody. Right. But again. And if it gives you the heebie jeebies, all good. Right. Yeah. But again, heebie jeebies doesn't make it wrong. Except there is one exception to this, by the way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9996.24,"end":9997.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, what is it?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":9998,"end":10014.85,"speaker":"Fr Stephen De Young","text":"No grown man should ever wink at another grown man. This is wrong. Universally wrong. Thinking about it trans historically, trans culturally, no adult man should ever wink at another grown adult man."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10015.65,"end":10020.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, there is that Monty Python sketch. No. Mean wink, wink, nudge, nudge. No more."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10020.57,"end":10024.53,"speaker":"Fr Stephen De Young","text":"Well, see, you could say, wink, wink, nudge, nudge. Oh, okay. Actually wink."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10024.69,"end":10025.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay, okay."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10026.05,"end":10031.23,"speaker":"Fr Stephen De Young","text":"At. He's also sitting beside the person, right. Not looking at him and winking at him."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10031.71,"end":10035.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yes. What about."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10035.31,"end":10038.83,"speaker":"Fr Stephen De Young","text":"Okay, so what about universal abomination? Anyway, Anathema."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10039.31,"end":10070.15,"speaker":"Fr Andrew Stephen Damick","text":"What about. And we got this question in our group recently, like, what about wonder working icons? Someone asked, like, you know, you put beautiful clothing on a wonder working icon. You sometimes will put flowers. Like, are these offerings being. Are these being made offerings to us like an idol? You know, like clothing and feeding and, you know, bathing an idol. You know, so how about that? I mean, is that. Is that the. The Achilles heel of this whole icon of Dulic thing we got going on?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10070.79,"end":10075.51,"speaker":"Fr Stephen De Young","text":"So, yeah, first of all, putting those things around it, right. Is just decorating it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10075.83,"end":10076.63,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10077.11,"end":10091.47,"speaker":"Fr Stephen De Young","text":"And the worship space itself, as we said from the tabernacle on, has had an iconic function. Right. Therefore, if there's a problem with decorating an icon, there would be a problem with decorating a worship space or decorating anything."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10092.27,"end":10094.47,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah, because, I mean, again, like."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10094.47,"end":10097.43,"speaker":"Fr Stephen De Young","text":"If you're going to say that decorating yourself, you're the icon of Christ."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10097.43,"end":10101.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. If you're going to say decorating is worship, then you can't have decoration."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10101.79,"end":10120.98,"speaker":"Fr Stephen De Young","text":"So don't take care of yourself, people. It's idolatry. Yeah, but I mean, even. Even your most whitewashed plain Baptist church on earth, right? They. They decorate it a little. You get the felt banners or something, right? You get the."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10120.98,"end":10121.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10121.82,"end":10153.78,"speaker":"Fr Stephen De Young","text":"You know, and people dress up to go to church. But more importantly than that, right. A wonder working icon is by definition an icon through which God has done things specifically worked wonders, I think, through which God has worked. Right. So this is very firmly the snake in the wilderness, not the snake in 2 Kings."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10154.42,"end":10158.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. The snake in the wilderness is literally a wonder working icon."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10159.3,"end":10241.71,"speaker":"Fr Stephen De Young","text":"Yes. It is an image, a sacred image through which God worked healings. It was God doing the healing. Right. But he did it. He chose for his own reasons to do it through that image. Right. And we believe this is basic Christianity. Right. God works through means. God does things in the world through people. Right. This is man being made in the image of God. So God works through people. He works through the saints, even when they're not physically alive anymore. He works through material things. See, our whole sacrament series, right? That's what the sacraments are all about. It's God working through material things. Baptism, he works through water, the Eucharist, he works through bread and wine. God works through us in the world. And God can work through icons, if he so chooses and has a history of doing it. See Book of Numbers, right? And that's if we exclude people as icons, which of course they are. Right? And really ultimately what this comes down to is our old enemy Platonism again, right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10242.19,"end":10244.51,"speaker":"Fr Andrew Stephen Damick","text":"Curses, Platonized again."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10248.75,"end":10367.65,"speaker":"Fr Stephen De Young","text":"Because the real iconoclast arguments, right. Are ultimately not Christian arguments. Not that those people aren't Christians. That's not what I'm saying. Some of them maybe not, I don't know, but that's not what I'm saying. That's not what I'm getting at. I'm getting at. They're not arguments that proceed from Christianity as such, right? So I can say, make an argument from the Bible about whether something is ethically right or wrong or I can make a different type of argument, right? I can do a Kant and I can say, right, well, categorical imperative, right? What would happen if everyone did that? You know, society would descend into chaos. So if we don't want everyone to do that, then that means you shouldn't do that. Right? That's not a Christian argument, Right. That's not saying it's anti Christian or evil or something, right? Right. I don't know that it holds up, but. Right. It's not a Christian argument, a Christian argument against, say stealing, right? Let's say that's what we're doing, right? If everyone stole, everything would fall over. So you shouldn't steal. Right. If I come to you with a Christian argument against stealing, I might point to one of the Ten Commandments and then I might say, right. To quote Christ, talking about, you know, not being concerned, right? About somebody tells me they're going to steal because they're worried they don't have enough money. And I say, well, do not worry about what you'll eat or what you will wear, right? Seek first the kingdom of God. And to seek the kingdom of God you need to keep the commandments of God. That's a Christian argument, right? So that's what I mean when I say they're not Christian arguments, right? Christian arguments go the other way, Right. The Incarnation goes the other way. There's no one saying because of the Incarnation we can't use iconography anymore."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10369.09,"end":10369.49,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10370.69,"end":10413.28,"speaker":"Fr Stephen De Young","text":"Those aren't the arguments. The arguments are essentially non Christian arguments. And I'm not including here arguments that are just made out of ignorance. Like people who, like Calvin who just didn't know a bunch of things about history because he couldn't, because he lived in the 16th century in Switzerland. Right? So there's arguments Made out of ignorance. Right. Of people who are trying to make Christian arguments, but they just lack data and information. And there's kind of a. It's kind of a think of the children argument, but it's, you know, oh, think of the idiots."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10413.36,"end":10413.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10414.08,"end":10418.76,"speaker":"Fr Stephen De Young","text":"We can't have any iconography because there's people out there so stupid they'll do an idolatry."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10418.76,"end":10419.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10419.04,"end":10494.72,"speaker":"Fr Stephen De Young","text":"So there's that. Which is also not per se a Christian argument, but the core of these iconoclastic arguments, when you really get into the meaty ones, right. The serious ones, they're grounded in Platonism. They're grounded in a rejection of, for example, the. The ability of the divine, of God to work through and be represented by the material. Right. Including in the Incarnation. And that's why. That's where the rubber sort of meets the road. Because the Incarnation is one of the things that wrecks Platonism. Yeah, Right. Because Christ. Right. When Christ is standing before the apostles, the person they're seeing with their eyes and hearing with their ears and touching with their hands. Right. Is not the shadow of an image of God, which is what he would have to be if you're a Platonist."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10497.84,"end":10498.24,"speaker":"Daniel","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10500.48,"end":10531.76,"speaker":"Fr Stephen De Young","text":"So the Incarnation destroys Platonism, destroys all those Platonic arguments again. That's why the church fathers, who knew their stuff way better than me, went there to attack the iconoclastic arguments. Right. It's a rejection of the sensory. It's a rejection of what we can see and hear and touch. Right. This is what St. Gregory of Palmas got into with Barlaam. Right. Barlaam says, no, no, no, no. You can't see the vision of Christ with your eyes."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10532.56,"end":10535.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10535.01,"end":10535.93,"speaker":"Fr Stephen De Young","text":"It's with your mind."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10536.33,"end":10538.33,"speaker":"Fr Andrew Stephen Damick","text":"When your mind, forget the body."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10538.49,"end":10548.73,"speaker":"Fr Stephen De Young","text":"Forget the body. Right. You're grounded in rejection of the goodness of creation. Ultimately. Shout out to Robert Phillips book."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10549.05,"end":10549.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10551.77,"end":10556.73,"speaker":"Fr Stephen De Young","text":"Right. Of the material creation in which iconography exists."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10559.13,"end":10559.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10560.65,"end":10590.58,"speaker":"Fr Stephen De Young","text":"Why is it a rejection of the material creation? Material creation is where iconography exists. It's experienced with our physical eyes. Right. And the iconoclastic arguments fundamentally say that what I see with my eyes, even when looking at iconography and what iconography can depict and what I can meditate on and participate on thereby, is an obstacle, an obstacle to some kind of spiritual or intellectual ascent toward God."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10590.98,"end":10599.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It gets in the way. I mean, this is one of the objections as well to the communion of saints, is that they get in the way."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10600.5,"end":10645.86,"speaker":"Fr Stephen De Young","text":"Right, Right. And that's Platonic thinking. It's always either or, it can't be both. And Diversity, you always have something better and something worse, and the worst should be rejected in favor of the better. And that's why it lends itself to the kind of aristocratic rationalism we've talked about before, right? Where you get the people who are like, well, okay, maybe iconography, because there's all those dumb people who might need to look at pictures, half of them are probably illiterate. But those of us who have elevated ourselves to this higher level of insight."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10645.86,"end":10665.42,"speaker":"Fr Andrew Stephen Damick","text":"And intellect or the other way, like, well, we who are educated can understand how iconography and venerating it is not idolatry. But I bet a lot of those peasants, those uneducated people, they're probably being idolaters and they don't really know it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10666.3,"end":10668.14,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10668.38,"end":10682.3,"speaker":"Fr Andrew Stephen Damick","text":"But again, like as we, as we mentioned, you know, in the ancient world where almost everybody's illiterate, everyone understood this distinction without any problem, right?"}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10683.1,"end":10751.74,"speaker":"Fr Stephen De Young","text":"And what all of these kind of taxon, all of these Platonic metaphysics, what, what all of them have in common, what all of them do is they undermine the incarnation, they undermine the reality of the faith that it is worked out in real time in the world, both in the sense of the events of scripture not being real and going forward in the sense that my salvation is not worked out in real time with how I relate to other humans, but is some kind of intellectual manner, matter of ascent, right? Or in some cases I don't even have to do anything. Right? But however, that scene, it definitely is not something that plays out in real time in material terms on this earth, where me giving a cup of cold water to someone in need is what's going to bring about my salvation and potentially allow me someday to see God, which would be what scripture says."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":10758.46,"end":11250.01,"speaker":"Fr Andrew Stephen Damick","text":"You know, as we were talking about, particularly about wonder working icons, I started thinking about the several. Well, I, I mean, I think maybe at this point in my life I can say many, the many wonder working icons that I've been around. I mean, there was one, there was one monastery on Mount Athos that had seven wonder working icons in that one monastery. And of course we venerated many when we were there. But, but we have them here in the US Too. You know, there's the, the Cardiotisa and Taylor, Pennsylvania, just about an. An hour from where I live, the Hawaiian Ivan icon that tours around, it's from Hawaii, but gets around a lot. And both these icons are mer streaming, meaning that they give off this light, fragrant oil that often when people are anointed with it with prayer, they are Healed of diseases, sometimes really intractable diseases. Priest who is the keeper of one of those icons, he has notebooks upon notebooks filled with the miracle stories that he's been told related to that particular icon. And, you know, I get asked sometimes, like, is that. Is that real? Occasionally people will say things like, there must be some kind of mechanism pumping that stuff out. And, I mean, has it ever been faked? Yes, there are fakes. There have been fakes, but they are not all. Indeed, I have been present with Mir streaming icons multiple times, and in a couple of cases, watched as the flow of myrrh sped up during a church service and then slowed down when the service was over. In one case, it was exuding so much myrrh that we had to continually mop it up off the table where the icon was, was resting so that it wouldn't just simply all dump on the floor. That much myrrh was coming off of it. And in several cases, you know, in many, many cases, these icons are kept in. In cases, wooden cases that open and close basically to protect them, and so they're easier to transport. And also, frankly, so that the myrrh doesn't just dump everywhere. Right. And there's been a couple of times where I've seen the icon in its case with the lid closed, and the lid, of course, is glass on the front so that people can see the icon still and venerate it through the glass. And, you know, since I was one of the serving priests, I was standing right next to it, I was looking at it, and I watched myrrh form on the glass, not, like, stream down on top of it, but like, form in the middle of it and then drip down. And I don't know how you can get glass to do that through some kind of artificial means. I don't know how you could do that. You know, that's the real deal. It's the real deal. And, you know, I've been asked, like, well, why. Why does. Why is this a thing? Why does this happen? And it's not. It's not to prove anything. It's simply a gift from God. His love for his people, his healing for his people, Right? And all of this points to one of the central points of our discussion about iconography and why it is so radically different from idolatry. Idolatry is about the spirit of a God becoming located in an object. And so then, therefore, the object is worshiped because it is understood to be the body of that God, right? So everything is focused on that object. It's localized in the object. The worship goes into the object and sort of stops there because that's where the God is. The God is inside it. Right? Iconography is not a stop. The honor does not stop at the icon. Any honor that's paid to it does not stop there. The very clear theology of the Orthodox Church is that the honor paid to the icon passes to the prototype. In other words, the icon functions as something through which we show our love and respect and honor to, to God, to his saints, whatever. But also, and this is apparent especially through these wonder working icons, it is something through which again, through which the love and the power and the healing and the salvation of God comes. God acts through it. We don't believe that wonder working icons are like magical talismans that have power within them. You know, they are rather something through which God acts. It all comes from God. The healing is from God, the love is from God, the miracle is from God. It's not located in the item. It's not. And so I think that, you know, as we said, that that iconography in the Christian context, in the biblical context, is really a rebuke of idolatry, because idolatry is profoundly stupid. Because idolatry thinks that gods live inside objects and that you can control them through those objects. That's what idolatry is. Whereas, as it says in scripture, God does not dwell in temples made by hands. He doesn't dwell in anything made by hands. Not in the sense of like being trapped inside it. That's why he says that. He's not saying God doesn't dwell in temples made by hands to say that God, God is everywhere except in that temple. Right? Because God is everywhere. And indeed God. God makes himself known in that temple in a particular way and is present and dwelling indwelling in that temple in particular way. But when we say. And when he says that God does not dwell in temples made by hands is to say that God cannot be trapped by idolatry. That's what that means. Right? And so since we know that God acts through icons, and again, you can set aside all of the post, you know, New Testament icons, you can set aside all of that and just simply look at the fact that this happens in the Old Testament, the bronze serpent, the ark, the tabernacle and so on. God does act through icons. And it is a rebuke of idolatry. It's a rebuke of idolatry. It is a restoration of the creation the way that God made it to be that the creation would be a conduit of God's love for us and that we would show him our love through the way that we relate to him, through that creation. To all of it, yes, in general, but especially to the original icon of God, our fellow humans. Father."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11253.77,"end":11428.82,"speaker":"Fr Stephen De Young","text":"So the idea of doing these last two episodes on idolatry and iconography respectively kind of spun out of some commentary. We did somewhat on the side, not entirely during the episode on the Last Judgment in our eschatology series. And in that context we were talking about how the principle at work in the parable of the sheep of the goats, the parable of the last judgment in St. Matthew's Gospel is that of iconography, that every human, because they are the icon of God, whatever you have done or you haven't done to the least of these, you have done, you have done to Christ, who is the judge. And so we talked about that in that context, how whatever we do to or fail to do for any of our fellow human beings, we are doing or failing to do for God. And St. John in 1 John 4:20, you can insert your own joke there, but he says very seriously that the person who says that he loves God but hates his brother is a liar. And then he goes on to say, because if you cannot love your brother whom you have seen, how will you love God who you have not seen? And that latter part is kind of counterintuitive if we really stop and think about it. Because most people, I think, if we're honest, would have to say, well, no, I think it's way easier to love God than to love a lot of my fellow human beings, right? Like, if I can't love this guy who's an annoying jerk who's rude to me or says or does these horrible things to me, if I can't love him, I can't love God. That doesn't make any sense, right? God created me, God loves me, right? It's easy to. To love God. But so that disjunction between what St. John is saying and what we're saying, and St. John uses that argument as proof for something else he said. So he acts as if it should be self evident reveals something terrible to."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11428.82,"end":11429.1,"speaker":"Fr Andrew Stephen Damick","text":"Us."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11431.42,"end":11650,"speaker":"Fr Stephen De Young","text":"Reveals something terrible to us. If we find it very easy to love God or to love Jesus, it's probably because the God or the Jesus whom we find it so easy to love isn't real. The God we say we love, the God that we've attached emotional feelings of affection to or to whom we run when we get into trouble, isn't the actual God who exists and created the universe. It's some abstraction. It's some concept. We talked last episode about how concepts can become idols in our head, and we've made it very lovable, very friendly. We may have, like those icons the caller asked about, turned him into this kindly old man who just loves everybody and wants to give us a big hug. Or the Jesus in our head may well be our own personal Jesus. Who cares? It never has a harsh word for us, let alone anybody else, except maybe once in a while for some people we don't like or who make us mad. That, as I said, is terrible. To realize that is something that should fill us with the deepest kind of concern. Why is it that in actuality, it's hard to love God if we can't love our neighbor? Well, in order to love God, we first have to come to know him, not know things about him, not come to an idea of him, not formulate a concept of him, but come to actually know him, come to actually know Christ. And to do that, we have to encounter him, we have to meet him, we have to meet him, and we have to spend time with Him. Where do we meet Him? We meet him in his icons. Who are those other people who are all around us? And so if I can't bring myself to love the person who I meet out on the street, who smells bad and is asking me for money and is probably just going to spend it on something he shouldn't spend it on, if I can't love that person in a concrete way by trying to actually do something to help them, by giving them a little of my time and attention, by giving them a little bit of love, and if I continue to have that inability throughout my life, I can go through my whole life without ever meeting God, doesn't matter what I believe about him or think about him, or claim to know about Him, I never will have met Him. Since I haven't met Him, I won't know Him. And since I don't know Him, I can't love Him. On the other hand, when I see every interaction I have with other people as interactions with icons of God, then every one of them is an opportunity for me to meet God, for me to encounter him, for me to spend time with him, for me to come to know him over the course of my life, through doing this over and over and over again, as the saints."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11650,"end":11650.28,"speaker":"Fr Andrew Stephen Damick","text":"Did."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11653.56,"end":11775.74,"speaker":"Fr Stephen De Young","text":"And as I meet him, over and over again, as I spend time with him, as I come to know him and come to know him, ever more deeply. Then I can start to love him. Then I can start to truly love him, truly experience his love in return. But the medium through which that happens is my fellow human beings. The medium through which that happens are his icons who surround me every day. And that's why that these day to day, very material, very simple, very sensory encounters, that's where my salvation is worked out. Not in some Platonic realm of ideas, not in holding all the right opinions, theological and otherwise, not in being a scholar, not by going to the right church. But that's where, that's the arena where my salvation is worked out, which puts a lie to all those other things. This is why it's possible for someone, as we're told in the Gospels, to go and work miracles and preach and cast out demons in the name of Christ and be told, be gone. I never knew you. This is also why it's possible for anyone, regardless of where and when they were born, their abilities, mental and physical and otherwise possible for everyone to instead hear Christ say, well done, thou good and faithful servant, to come to that day when we stand before him and we come to know him well and to share in his love. So those are my thoughts."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11776.62,"end":11801.51,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's our show for tonight. Thank you for listening everyone. If you didn't get through to us live, we'd like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or need help finding a parish, head over to orthodoxintro.org and join us."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11801.51,"end":11810.47,"speaker":"Fr Stephen De Young","text":"For our live broadcast in the second four Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific. You know, I've been looking so long at these pictures of you that I almost believe that they're real."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11810.79,"end":11822.08,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, unlike Father Stephen, follow our page, Join our discussion group, Leave ratings and reviews in all the appropriate places. Most importantly, share this show with a friend who is going to benefit from from it."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11822.4,"end":11834.72,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air. I've been looking so long with my pictures of you that I almost believe that the pictures are all I can feel."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11835.68,"end":11842,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless you always. And we'll see you in two weeks at the Lord of Spirits conference."}
{"episode_id":"LOS - #077 - 2023-10-12 - Image of the Invisible","start":11848.41,"end":11885.46,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worship worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
