{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1.12,"end":65.71,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":67.87,"end":212.85,"speaker":"Fr Andrew Stephen Damick","text":"Good evening and welcome back to the Lord of Spirits podcast and welcome to our first anniversary episode. It's been a whole year. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855 AF radio. That's that's 855-237-2346. Bobby will be taking your calls tonight, which we will get to in the second part of today's show. So before I get to my intro, Father Stephen and I wanted to take a moment to mention why our regular engineer Matuska Trudy is not with us tonight. This past Sunday, her husband, Father Anastasi Richter, known familiarly as Father Father Stacy, as he was preparing to serve the Divine Liturgy, collapsed in the altar at St. Elizabeth Orthodox Church in Chesterton, Indiana, where he was the pastor. He was rushed to the hospital but soon pronounced dead. He was just 52 years old and leaves behind not only Matuska Trudy, but their three daughters as well as a shocked and grieving parish. It if you would like to help the family in this time of sudden grief, a GoFundMe page has been set up for you to make donations. We've shared the link on our Facebook page, but you can also go to the GoFundMe website and do a search on Richter that's spelled R I C H T E R and you should see the fundraiser come up. Whatever else you can do, please say a prayer for the resting of his soul and also for the comfort of his family, his friends and his parish. Thanks, everyone. So we've been on the air for a full year now, and for this episode, we are going to be talking about the great biblical patriarch, Abraham. And as we love to do on Lord of Spirits, we are heading deep into the ancient world, to more than 2,000 years before the birth of Jesus Christ. For Abraham lived about as distant from that event as we ourselves do. Now, usually when people think of the ancient world, they might picture a time of primitives, you know, people living in caves. Caves. Tribes of hunter gatherers. Lucky. Get a spark of fire from banging two sticks together and rocks, that kind of thing. But is that the kind of world that Abraham lived in? Father Steven?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":214.37,"end":214.77,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":215.09,"end":215.49,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":217.97,"end":228.82,"speaker":"Fr Stephen De Young","text":"So, yeah, in star Picard season two, they're traveling back to the 21st century A.D. hmm. We're going back to the 21st century B.C."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":229.3,"end":229.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":230.18,"end":235.14,"speaker":"Fr Stephen De Young","text":"So that means we're better and you could stream this for free."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":235.46,"end":236.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":236.74,"end":238.42,"speaker":"Fr Stephen De Young","text":"So you can't beat that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":240.66,"end":241.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":241.62,"end":280.96,"speaker":"Fr Stephen De Young","text":"So it's actually quite the. Quite the opposite of that. We tend to not realize just how organized and efficient and interconnected the ancient world was. Like the giant's episode, we talked about the Bronze Age collapse. This is. We're now going even further back than that. But already civilization is a thing that exists. And so the period that Abram or Abraham lived in is referred to as the ur3 period."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":281.6,"end":282.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":282.48,"end":285.6,"speaker":"Fr Stephen De Young","text":"Sometimes also called the Sumerian Renaissance."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":286.24,"end":294,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which makes me kind of wonder, like, where is the Sumerian Ren fair? Like, why is there not a. Yeah, yeah, Renaissance Fair."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":294.4,"end":299.12,"speaker":"Fr Stephen De Young","text":"There's not a Sumerian word for huzzah, I think, is the issue."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":299.2,"end":301.12,"speaker":"Fr Andrew Stephen Damick","text":"How do you know that's not a Sumerian word?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":301.12,"end":302.48,"speaker":"Fr Stephen De Young","text":"Not one that we've discovered."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":303.41,"end":303.65,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":305.49,"end":315.17,"speaker":"Fr Stephen De Young","text":"Yeah, so this. This period, it ran from circa 2112 to about 2004 B.C."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":315.81,"end":316.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":316.69,"end":317.17,"speaker":"Fr Stephen De Young","text":"So this."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":317.25,"end":324.21,"speaker":"Fr Stephen De Young","text":"This really is sort of as far back before Christ as we are after Christ."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":325.25,"end":325.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":325.61,"end":340.8,"speaker":"Fr Stephen De Young","text":"21St century BC versus 21st century AD and to sort of explain what the UR3 period is about. And this is still going to be kind of weird and confusing even after we kind of explain what it's about."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":341.92,"end":344,"speaker":"Fr Andrew Stephen Damick","text":"But that's what we do on this podcast, right?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":344.48,"end":445.05,"speaker":"Fr Stephen De Young","text":"Sort of some. Some basics of ancient Mesopotamian politics. This is why you come here. The region of Mesopotamia, right. In Greek, which is Greek for between the rivers, between the Tigris and Euphrates rivers as they flow it down into the Persian Gulf. There were two main regions. Sumer, which was the southern region, really southeastern, near where the rivers meet the Persian Gulf, and then the northern Region, which is really sort of northwest, which is Akhad A K K A D for people keeping track. And so these two regions contain some of the earliest city states in the world. These individual city states were ruled over by kings who are seen to be gods, so sort of God kings who are also the priests of the deity of that city, which. Who was worshiped generally in a central ziggurat within the city. We've talked about ziggurats before. And then what happens is politically, various cities in, in those two regions in either region would become sort of politically ascendant at different times."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":445.45,"end":476.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And if folks are interested in kind of the big grand sweep of the civilization of this era, we both recommend actually a podcast that we are both fans of, which is the Fall of Civilizations podcast. They did an episode on the Sumerian empire, which, I don't know, it's like three or four hours long, which, you know, really gives us something to reach for. But, but is. Is really, I mean, it's just a really, really well done podcast. So. I mean, it's not a Christian podcast, it's just a history podcast. Yeah, but, but yeah, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":476.54,"end":488.95,"speaker":"Fr Stephen De Young","text":"And it's. It's available both as the original audio podcast and there's also a YouTube version that has some incredibly stunning HD video and photos."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":489.11,"end":489.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":489.59,"end":503.19,"speaker":"Fr Stephen De Young","text":"Like on location in Iraq. And, and so you can see some of these things. So either way, that is. That is worth consuming if you want to spend four hours learning about the whole sweep of the history of Sumer."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":503.19,"end":509.35,"speaker":"Fr Andrew Stephen Damick","text":"And let's face it, people listening to this podcast, there's probably at least a good 50, 50 chance that they are interested in that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":509.35,"end":510.07,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":510.07,"end":510.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":510.51,"end":538.49,"speaker":"Fr Stephen De Young","text":"So that's a place where you. Could you go get all that? Because we're just going to be talking about this little sliver here. Yeah. Of this, this one period. So through the skill and force of charisma, etcetera, Of a given one of these kings, at any given point his city would sort of become ascendant and be able to project its will over the other nearby city states of the region."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":538.81,"end":540.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Make them vassals."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":540.81,"end":541.13,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":541.13,"end":573.56,"speaker":"Fr Stephen De Young","text":"Make them function as vassals to him. And so the, the ur3 period is called the ur3 period because we used to think that it was the third time that Ur had become this sort of ascendant quasi capital city. Now it turns out, upon further archaeological research, this was only the second time. There was no ur2 period."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":573.96,"end":576.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So there's one and then there's three."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":577,"end":579.08,"speaker":"Fr Stephen De Young","text":"Right. But they didn't change the name."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":579.64,"end":580.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":580.36,"end":617.76,"speaker":"Fr Stephen De Young","text":"Because changing it from UR3 to UR2, I guess, would have been too confusing, like having someone on the faculty not named Bruce, so they just left it as ur3. Even though there's no2, it goes from 1 to 3. So there are actually only these two periods where ur was ascended. But what tended to happen was not that. And generally it would be a city in Sumer or a city in Akhad. And culturally, whichever region had the ascendant city would also become sort of culturally ascendant."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":618,"end":618.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":618.96,"end":641.47,"speaker":"Fr Stephen De Young","text":"Because Akad was populated by Semitic peoples with a Semitic language. Akkadian is sort of relates to other Semitic languages, sort of like the way Sanskrit relates to Indo European languages."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":642.43,"end":671.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So, you know, for those of you don't know, that would be stuff like Hebrew and Arabic and, you know, Arabic. Yeah, Syriac. Right, right. Whereas Sumerian is this language isolate, meaning that it's not related, as far as we know, to anything else. And yet these two language groups and cultural groups existed right next to each other and. And borrowed each other's words occasionally, actually. So that's fun. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":671.62,"end":684.97,"speaker":"Fr Stephen De Young","text":"And we're also not sure ethnically what the Sumerians were, so. Right. They're kind of this quasi mysterious group, but they were not aliens, I assure you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":685.45,"end":686.69,"speaker":"Fr Andrew Stephen Damick","text":"Not ancient aliens, everybody."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":686.69,"end":731.82,"speaker":"Fr Stephen De Young","text":"Not at all. They're not aliens. So rather than, you know, one of the other cities sort of rising up in a revolution against the currently dominant cities city, what tended to happen was that sort of the quasi imperial reign of one of these cities would fall to a foreign invasion. There were a number of nomadic peoples both east and west of Sumer and Echad of Mesopotamia. And you have these city states which were gathering wealth from the whole known world at the time in one place. And so those city states would start to make tempting targets."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":731.9,"end":732.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":732.7,"end":745.5,"speaker":"Fr Stephen De Young","text":"For nomadic invaders to come and pillage. Generally when they came and pillaged, you know, they would kind of take control of the area, but it usually wouldn't last long because they weren't like skilled bureaucrats."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":745.9,"end":761.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's. It's one thing to take over a city, it's another thing to. To try to run it. So usually they would just sort of occupy it, take the stuff and then leave. Then the locals would have to kind of rebuild and then meanwhile some other city in the area would become the city."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":762.33,"end":791.11,"speaker":"Fr Stephen De Young","text":"Right, right. And sometimes it would be one of the kings of one of the other city states would sort of drive them out. And then by virtue of being the hero who got rid of the foreign invaders Their city would end up becoming the next ascended city. And that's what we're going to see happen in the. In the ur3 period. Because previous to the ur3 period, there was an Akkadian dynasty, and this is the dynasty that was started by Sargon."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":791.11,"end":793.47,"speaker":"Fr Andrew Stephen Damick","text":"Of Akkad, who was an actual person."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":793.95,"end":794.43,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":794.51,"end":802.27,"speaker":"Fr Stephen De Young","text":"Not. Not the. The quasi political YouTuber, but the actual guy who he named himself after."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":804.35,"end":804.75,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":807.32,"end":883.31,"speaker":"Fr Stephen De Young","text":"And that dynasty collapsed through an invasion by the Gudians who came down from the Zagros Mountains and invaded and managed to basically destroy the supporting infrastructure that allowed the city of Akkad to keep. Keep the other as vassals. Right. You have this interconnected chain of tribute being paid in taxes and that kind of thing, and they disrupted all that. So they only actually occupied the area, though, for about 20 to 25 years. And then a good fellow named Utu Hengal. We just don't have good names anymore. Yeah, Sumerian names. So cool. UDU Hengal came and defeated the Gudian king at the time, whose name was Tiragan. And that then led to Ur Namu, who was the. The king of Ur, coming to. Coming to ascendancy and beginning the third dynasty of Ur, which was actually this. Actually second dynasty."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":883.31,"end":890.92,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Ur Namu figures big in the story that is told on. On that episode of the Fall of Zev podcast. Yeah, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":891.48,"end":915.94,"speaker":"Fr Stephen De Young","text":"And Ur Namu, the part of the reason this is called the Sumerian Renaissance is he was actually apparently a particularly gifted leader, at least materially. So he issues a law code that was very similar to the one that you're probably more familiar with, that Hammurabi issued. Hammurabi is about 500 years later."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":916.66,"end":952.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's worth probably taking a moment to mention that law codes at this point, you know, 4,000 years ago, were not like the law codes that we have now. Like, the whole theory was different. It was not, okay, we're going to establish laws, and everyone has to sort of obey them, and the king's job is to enforce these laws. No, it was. It was. This is the stuff the king expects of everybody. You know, the law was simply just his will on. On paper. So. Well, clay tablets, I guess, usually. Right, Clay tablets. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":952.2,"end":954.2,"speaker":"Fr Stephen De Young","text":"Stone obelisks in the center of town."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":954.2,"end":986.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're more like. They're more like house rules. Just like, you know, parents set house rules and, you know, you know, if you have kids, you probably had the kids attempt to enforce the rules against the parents. Like, no, no, no, that's not how the rules work, son. You know, These rules are an extension of mine, your mother's will. And that's how laws worked in the ancient world. It was like, this is what the King expected. And he could change it at any time. Now, if he was a smart king, he wouldn't constantly change it. But the king is the king, and that's the way that it is. He's not above the law. The Law is part of him, essentially."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":986.71,"end":988.95,"speaker":"Fr Stephen De Young","text":"Yeah, he is the law. Like Judge Dredd."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":989.19,"end":990.55,"speaker":"Fr Andrew Stephen Damick","text":"Just like Judge Dredd."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":991.99,"end":1003.69,"speaker":"Fr Stephen De Young","text":"But yeah. And this is important because it affects how we see Old Testament law too, that we get into discussions of it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1003.69,"end":1004.69,"speaker":"Fr Stephen De Young","text":"We tend to treat it like a."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1004.69,"end":1033.26,"speaker":"Fr Stephen De Young","text":"Law code, like a system of law or a rule of law. There are people who try to pull civil law out of. Right. The Old Testament law, but it was the same thing. Right. This is the king in the case of Old Testament law, Yahweh, the God of Israel. Right. The King says, this is what I expect you as my vassals and my subjects, and this is what I'm going to do to you if I don't get what I expect from you. And this is what I'm going to do for you if I do."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1033.5,"end":1033.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1033.78,"end":1057.72,"speaker":"Fr Stephen De Young","text":"If you're loyal and true and faithful, this is what I will do for you. And that's sort of the covenant structure. The covenant structure that's used in the Old Testament is not just an Old Testament thing. This is a pattern that's followed by, in fact, the book of Deuteronomy follows very closely a particular form of Hittite Suzerain vassal treaty."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1057.72,"end":1058.04,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1060.28,"end":1071.4,"speaker":"Fr Stephen De Young","text":"This is the same kind of thing. When we talk about Ur Namu's law code, it's him saying, here's what I expect from all of you and here's what's going to happen if I don't get it. But then also here are the positive things that I'm promising you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1071.64,"end":1072,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1072,"end":1078.48,"speaker":"Fr Stephen De Young","text":"That he would help aid with their protection from invasion, that he would sort of share the wealth."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1078.72,"end":1079.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1079.12,"end":1123.99,"speaker":"Fr Stephen De Young","text":"That he would help with cultivation and expansion of lands, because that's what a smart king does. Yes. And in terms of expansion, over the ur3 period, the domain controlled from Sumer expanded to stretch from the southeastern part of what's now Turkey, Anatolia or Asia Minor all the way to Iran. And not only did they control territory over into what's now Iran, but they conducted trade, they established trade routes with the civilizations in the Indus River Valley at this time."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1124.07,"end":1130.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is basically parts of modern Turkey, Iraq, Iran, kind of that whole. That whole area."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1131.23,"end":1150.51,"speaker":"Fr Stephen De Young","text":"Yeah. And then yeah. That they were able to set up these sort of stable trade routes to bring things over land all the way from, from India, from what's now India. And he divided the, the regions around each city state into sort of imperial provinces."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1150.67,"end":1151.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1151.11,"end":1152.91,"speaker":"Fr Stephen De Young","text":"Domains of the individual kings."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1152.99,"end":1269.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, and I mean, this is interesting because it's, it's a kind of federalism of sorts. Right. You've got this. Or I mean, may not federalism, but it's almost, you know, you're starting to see complexity of structure the likes of which we usually associate in the ancient world. Only with Rome, which, I mean, that's, you know, centuries upon centuries later, you already have this kind of regional subsidiarity, you know, a real empire. Right. With, with, that's held together with bureaucracy, you know, and so you've got, it's complex, it's organized, there's a whole system of economy, tribute and taxation and all the marks of a great civilization. So you've got, you know, literature. And, you know, this includes stuff like the Epic of Gilgamesh. Right. Which a lot of people are interested in the ancient world would know about, which includes a flood story because of course, all ancient mythologies include flood stories. And, you know, as we've mentioned before on this show, the Sumerian kings list which mentions that Gilgamesh is a giant. Right. Yeah. So, I mean, it's, it's big. And I actually looked this up. So the population of the Sumerian empire at its Height had about 1 1/2 million people in it, but the whole world's population at the time was about 27 million. So that means that roughly one out of 18 people in the world lived in the Sumerian empire. So it was, it was gigantic for that time. You know, it was, it was, it was, it was big. And, and you know, and, and all of this is to say that again, these are not tribes living in caves, Right? This is, these are cities and city states and sort of governorates all functioning together in this vast web. And this is the world that, that Abraham lives in."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1270.08,"end":1279.84,"speaker":"Fr Stephen De Young","text":"Right, right. This is the period when he lives in. So he lived, came of age. I mean, when his story really begins. He's 75 years old."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1280.24,"end":1281.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1281.52,"end":1284.88,"speaker":"Fr Stephen De Young","text":"So this is the civilization he lived in for 75 years."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1286.24,"end":1286.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1286.6,"end":1331.62,"speaker":"Fr Stephen De Young","text":"This is, this is his, his time and, and his era sort of before we actually meet him in Genesis. And then, so then the ur3 period sort of comes to an end by another foreign invasion. The Elamites come and invade. They sort of. So chaos managed to Occupy parts of Sumer for 20 odd years again. And then the Martu people, who you may remember from the giants episode, the Martu means Westerners basically they come from Syria essentially and invade. These are the biblical Amorites."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1332.34,"end":1335.38,"speaker":"Fr Andrew Stephen Damick","text":"Right. People get excited when we talk about Amorites."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1335.46,"end":1358.24,"speaker":"Fr Stephen De Young","text":"Yes. And out of, out of the Martu coming in and taking over ultimately will come the establishment of the, the original Babylonian empire. The original Babylonian dynasty from which our friend Hammurabi, who was a Martu or an Amorite, was king."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1358.48,"end":1360,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1360.32,"end":1361.84,"speaker":"Fr Stephen De Young","text":"In, in Babylon."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1362.16,"end":1378.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so let's, let's talk about the city Ur itself, because this is the actual town that Abraham lived in. He didn't just live in the empire, he lived in, in Ur. Right. So what does that city actually look like in his time? And you know, leading up to that?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1379.25,"end":1381.25,"speaker":"Fr Stephen De Young","text":"Right, this is the capital."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1382.13,"end":1382.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1384.05,"end":1390.09,"speaker":"Fr Stephen De Young","text":"And so this is the central hub of civilization literally in the world at the time. Yeah, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1390.09,"end":1390.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1390.85,"end":1404.25,"speaker":"Fr Stephen De Young","text":"Because even the civilizations that aren't actually a part, that aren't actually under Ur's control, like Egypt and, and the Indus river valley civilizations are trading with and."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1404.25,"end":1404.65,"speaker":"Fr Andrew Stephen Damick","text":"Through."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1407.29,"end":1409.93,"speaker":"Fr Stephen De Young","text":"Ur's dynastic empire."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1409.93,"end":1410.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1410.33,"end":1413.45,"speaker":"Fr Andrew Stephen Damick","text":"All roads lead to Ur, as it were."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1414.17,"end":1421.45,"speaker":"Fr Stephen De Young","text":"So this is, this is the center and this is the hub. And so Ur was already a very old city."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1422.09,"end":1422.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1423.77,"end":1449.7,"speaker":"Fr Stephen De Young","text":"At the time the, that Abraham lived there. So the area was initially settled the period around, and this is very rough because there's sort of an initial settlement that's buried under a layer of sediment. Say that five times fast, that original sediment, which is I guess Ur. Ur, if you will."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1452.28,"end":1452.6,"speaker":"Bryce","text":"Wow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1454.6,"end":1461.64,"speaker":"Fr Andrew Stephen Damick","text":"I don't know why I didn't see that coming, but I really should have at some point in this episode. I, it just, I don't know, I'm getting slow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1462.36,"end":1486.37,"speaker":"Fr Stephen De Young","text":"So it, and the settlement came into existence because at the time it was located at the place where the river Euphrates flowed into the Persian Gulf, where it met the Persian Gulf. So it was a coastal settlement. And because it's sort of in a river delta, the river would cause it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1486.37,"end":1488.61,"speaker":"Fr Stephen De Young","text":"To flood every year. You had very fertile soil."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1489.01,"end":1490.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like Louisiana."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1490.85,"end":1508.44,"speaker":"Fr Stephen De Young","text":"Yeah. Or the Nile Delta or. Yeah. And so this was a good place. Because of the flooding, you could plant crops in the fertilized soil that washed down the river. So the settlement starts somewhere around the middle of the 7th century BC."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1510.44,"end":1510.84,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1512.28,"end":1538.08,"speaker":"Fr Stephen De Young","text":"What first seems to happen is that there was an agricultural settlement. They dug sort of irrigation canals within the delta area and then the city grew up and was structured around those Irrigation canals, because things like defense became needed as it grew. Now, if you go to the remains of Ur today."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1539.92,"end":1541.2,"speaker":"Fr Andrew Stephen Damick","text":"Which is in Iraq."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1541.44,"end":1554.48,"speaker":"Fr Stephen De Young","text":"Which is in Iraq now, and I've seen photos of a number of folks who served in the US military who were deployed over there and got pictures next to the ziggurat."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1555.76,"end":1556.02,"speaker":"Fr Stephen De Young","text":"You."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1556.09,"end":1560.89,"speaker":"Fr Stephen De Young","text":"You go there now and if you've been there, you're probably going, it's in the middle of the desert."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1560.89,"end":1561.49,"speaker":"Fr Stephen De Young","text":"What do you mean?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1561.49,"end":1564.01,"speaker":"Fr Stephen De Young","text":"It's a coastal city."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1564.81,"end":1582.81,"speaker":"Fr Andrew Stephen Damick","text":"Things change when you're talking thousands of years. Yeah. I mean, you know, climate change happens and climate change happens to Ur. It was on the coast and then the Persian Gulf receded a lot, and now it's a long ways from the coast."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1583.19,"end":1588.87,"speaker":"Fr Stephen De Young","text":"The water level in the Persian Gulf since the 21st century BC has gone down about 10ft."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1589.67,"end":1592.07,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is miles and miles of land."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1592.55,"end":1592.87,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1592.87,"end":1593.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1593.59,"end":1619.04,"speaker":"Fr Stephen De Young","text":"And so it is now very far from the Persian Gulf. But at the time it was. It was there where it met. And the original settlers of the area were Semitic people, so more like Ahad. But then the Sumerians showed up from somewhere. They're not aliens. They are not aliens."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1619.68,"end":1622.48,"speaker":"Fr Andrew Stephen Damick","text":"We're not saying it was aliens, but it's not aliens."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1623.12,"end":1635.12,"speaker":"Fr Stephen De Young","text":"Someone out there is going, ah, see? Aliens. They're not aliens. So they showed up from somewhere around 3300 BC."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1635.87,"end":1636.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1637.23,"end":1650.75,"speaker":"Fr Stephen De Young","text":"And they sort of migrated in from somewhere. The only accounts we have of where they came from, which were written in cuneiform, much after the fact, say they came from the sea."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1652.35,"end":1660.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. And just to remind everybody, cuneiform is the Alphabet that was used by ancient Sumerian and for some other languages in the area."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1660.03,"end":1661.23,"speaker":"Fr Stephen De Young","text":"It's not really an Alphabet."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1661.46,"end":1667.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Well, the writing system. Okay. Actually, yeah, thank you. Yes. Writing system. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1667.98,"end":1680.62,"speaker":"Fr Stephen De Young","text":"It's which. Which evolved from pictographs, but cuneiform, especially Sumerian cuneiform, there's like hundreds and hundreds of symbols. It is very difficult to learn. Cuneiform. Take it for me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1680.62,"end":1681.3,"speaker":"Fr Stephen De Young","text":"I've tried."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1683.06,"end":1697.73,"speaker":"Fr Stephen De Young","text":"It. Later on, gets in Akkadian, it gets kind of standardized to about 60 characters that are commonly used. And that's hard enough, but. And when I say characters, I mean it's different patterns of wedge imprints."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1697.89,"end":1702.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they look a lot alike. Yeah, they look a lot like each other."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1703.25,"end":1707.25,"speaker":"Fr Stephen De Young","text":"Three vertical and one horizontal. Three vertical, two horizontal."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1707.25,"end":1707.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1707.97,"end":1710.69,"speaker":"Fr Stephen De Young","text":"Two vertical, two horizontal. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1710.69,"end":1710.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1710.97,"end":1745.62,"speaker":"Fr Stephen De Young","text":"Yeah. But they evolve from sort of pictograph in the same way that you get like Chinese. Yeah. And hieratic in Egypt. Sort of evolves from Pictographs. So. But yeah, those accounts say they came from the water. Probably means somewhere to the east, but we don't, we don't know where and we're not sure what they were. Their language gives us zero clues because it's a language isolate. We don't have, like, Sumerian DNA to test it and see like, what they were ethnically."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1746.34,"end":1747.38,"speaker":"Fr Andrew Stephen Damick","text":"But they're not aliens."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1747.62,"end":1755.5,"speaker":"Fr Stephen De Young","text":"They're not aliens, but they may have been Indo Europeans, right, who came from."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1755.5,"end":1755.94,"speaker":"Fr Stephen De Young","text":"Like, India."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1757.7,"end":1811.02,"speaker":"Fr Stephen De Young","text":"That direction. But we don't know and likely never will. Who knows, but likely we never. So they came and they didn't come and like, conquer Ur. They just sort of moved into the area and intermarried with the, the settlement already there to produce the, the early population of Ur. The Ur 1 dynasty, which does exist, unlike Ur 2, started around 2550 B.C. so about the middle of the 26th century B.C. the city. When Ur Nammu came to power and started the Ur3 dynasty, he did a massive building project in the whole city of Ur to sort of revitalize it and build it up as a capital."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1811.02,"end":1812.1,"speaker":"Fr Andrew Stephen Damick","text":"And a powerful city."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1812.5,"end":1871.1,"speaker":"Fr Stephen De Young","text":"Most prominently, he built the great ziggurat of urban, the remains of which are still there, although it's been repaired a couple times. Thousands of years apart, but a couple times. And that was finished near the end actually of the ur3 period. And that ziggurat, as we've talked about ziggurats, were the Sumerian Gundiggarak, means, you know, gate of the gods. And so this is a sort of human construction of the holy mountain of the mountain of the God to try to draw him down and bring him down there. And in this case used for worship. Right. And in this case it was. The Sumerian name of the God is Nana N a N N A. The Akkadian name is Sin S I N. And which is not related to."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1871.18,"end":1902.34,"speaker":"Fr Andrew Stephen Damick","text":"Which is not related to the English word sin at all. No, no, not, not connected or Sinai or anything. Right, right, right. But yeah, a moon, A moon God. Which is interesting because, you know, in, in anyone who studied mythology, most of the moon deities you run into are usually female. But actually there's a lot of male, you know, moon gods depicted as male in the ancient world. More common than the female gods, I think, in, in that period, if I."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1902.34,"end":1903.46,"speaker":"Fr Stephen De Young","text":"Remember that far back."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1903.46,"end":1904.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah, yeah, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1904.78,"end":1917.34,"speaker":"Fr Stephen De Young","text":"And this one, and this one is male. Even though Nana sounds like a feminine name, that's actually a male. Yeah, a male figure. So that, that's the city of Ur."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1917.42,"end":1919.14,"speaker":"Fr Stephen De Young","text":"Is dedicated to this God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1919.14,"end":1920.62,"speaker":"Fr Stephen De Young","text":"That is God is the God of the city."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1923.03,"end":1923.27,"speaker":"Fr Stephen De Young","text":"As."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1924.47,"end":1941.51,"speaker":"Fr Stephen De Young","text":"As these cities sort of gained and lost power, the gods of these cities were seen to gain and lose power in the heavens. And this would often be connected to astronomical signs."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1941.51,"end":1941.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1941.83,"end":1945.11,"speaker":"Fr Stephen De Young","text":"Because of course, astronomically, those are the gods too."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1945.19,"end":1945.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1947.27,"end":1952.63,"speaker":"Fr Stephen De Young","text":"So those are bodies of the. Of the God too. So the actual moon in the sky is one of the bodies of Nana."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1953.12,"end":1953.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1953.36,"end":1966.32,"speaker":"Fr Stephen De Young","text":"As is the idol on top of the ziggurat in the temple. And so these things are all. These things are all connected. I was about to go on a."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1966.32,"end":1967.28,"speaker":"Fr Stephen De Young","text":"Digression, but I will."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1968.24,"end":1994.18,"speaker":"Fr Stephen De Young","text":"About Enlil. We'll do that another time. Right, but so, so when Ur comes to prominence, so does Ur's moon God. Right, right, right. Over. In terms of the other. The other gods, it's not. We think of these pantheons, Right. Like, we think of the Greek gods, the Greek pantheon as like the Justice League."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1994.18,"end":1994.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1994.5,"end":1998.42,"speaker":"Fr Stephen De Young","text":"It's like the team up of, like, all the gods."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":1998.42,"end":2003.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, right. It's more like a confederation of local deities."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2003.7,"end":2004.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2004.34,"end":2006.22,"speaker":"Fr Andrew Stephen Damick","text":"You know, local to particular places."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2006.22,"end":2006.5,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2006.5,"end":2023.6,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so here's the question. Probably a lot of people might have. I mean, when we encounter Ur in the. In Genesis, it's referred to as Ur of the Chaldees or Ur of the Chaldeans. But actually, that's. No one at the time in Abraham's time would have called it that. Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2023.6,"end":2025.92,"speaker":"Fr Stephen De Young","text":"He had no idea what a Chaldean was."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2026.16,"end":2026.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2026.6,"end":2027.84,"speaker":"Fr Andrew Stephen Damick","text":"Or that he was one."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2028.56,"end":2028.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2029.04,"end":2029.48,"speaker":"Fr Stephen De Young","text":"If he."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2029.48,"end":2030.4,"speaker":"Fr Stephen De Young","text":"If he was one."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2031.2,"end":2031.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2031.56,"end":2031.84,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2032.08,"end":2036.4,"speaker":"Fr Andrew Stephen Damick","text":"That term comes from a lot later. Right. Something like 14 or 1500 years."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2036.64,"end":2048.69,"speaker":"Fr Stephen De Young","text":"1500 years later, yeah. So the Chaldeans proper refers to the Neo Babylonian empire, the New Babylonian empire from the 6th century B.C."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2049.01,"end":2068.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. Which at one point was headed up by our friend Nebuchadnezzar, whose real name was Nabu. Correct me if I get this wrong. Nabu Kuduri Usur. Which means. Oh, yeah, okay. Which means Nabu, watch over my air. It was, you know, the name itself was a prayer to their God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2068.88,"end":2082.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And this is why sometimes in. In more recent English translations, you'll see his name transliterated as Nebuchadrezzar. Trying to get that Kaduri part. But I love."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2082.28,"end":2088.32,"speaker":"Fr Andrew Stephen Damick","text":"I love the Anglicized, Hellenized Nabu Koda Nozor. That's my favorite."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2090.73,"end":2094.81,"speaker":"Fr Stephen De Young","text":"Right. And so, so this is a sort of a wild anachronism."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2095.45,"end":2095.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2097.45,"end":2103.29,"speaker":"Fr Stephen De Young","text":"But there's, there's something theological going on here in Genesis."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2103.85,"end":2104.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2104.21,"end":2126.87,"speaker":"Fr Stephen De Young","text":"Which is the reason why they. The editor at this point puts in this sort of reference of calling it Ur of the Chaldees, is that. Right. Chaldeans were the Neo Babylonian empire. And so this serves to connect the civilization that Abraham came from to Babylon."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2127.35,"end":2130.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even though they're not literally exactly in the same spot."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2131.27,"end":2131.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2131.59,"end":2132.39,"speaker":"Fr Andrew Stephen Damick","text":"It's the same region."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2133.03,"end":2134.63,"speaker":"Fr Stephen De Young","text":"And we're 500 years off."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2135.19,"end":2137.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2137.75,"end":2143.83,"speaker":"Fr Stephen De Young","text":"Before the first Babylonian empire Even, there were 500 years before that. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2146.06,"end":2146.3,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2146.38,"end":2157.42,"speaker":"Fr Stephen De Young","text":"But theologically, right, we're connecting these not to connect it to Hammurabi, but to connect it to Babel."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2157.66,"end":2159.14,"speaker":"Fr Andrew Stephen Damick","text":"The Tower of Babel, Bob."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2159.14,"end":2164.46,"speaker":"Fr Stephen De Young","text":"Eli. The Gate of Heaven. The Tower of Babel."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2164.78,"end":2193.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Right. And this is reflected if you look at the actual biblical text, by the way that the story gets told. So, you know, in Genesis 10, you've got the Tower of Babel story. Right. And then 11. 11. Excuse me, sorry. You've got the Tower of Babel story, and then there's this genealogy. But, but, but it's the, the genealogy actually makes it so that you've got, what, Noah's son Shem, and then, boom."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2194.47,"end":2197.86,"speaker":"Fr Stephen De Young","text":"Abraham's father, and then it goes to Abraham's father."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2197.86,"end":2198.06,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2198.06,"end":2201.1,"speaker":"Fr Stephen De Young","text":"So the genealogy doesn't start at the Tower of Babel."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2201.26,"end":2202.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it actually starts way earlier."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2203.34,"end":2203.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2203.74,"end":2208.46,"speaker":"Fr Stephen De Young","text":"It doesn't go from the Tower of Babel to Abraham. It goes from the Flood to Abraham."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2208.62,"end":2237.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's this whole compression going on without any indication that that's what's happening. You know, but these things are being put together. I mean, in some ways, it's like when. I mean, setting aside all of the theological importance of this, when they refer to Jesus as the son of David, it doesn't mean his father's name was David, but it's connecting him directly to David. Right. And that's a similar kind of narrative way of using this sort of language. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2237.56,"end":2247.76,"speaker":"Fr Stephen De Young","text":"And so this is. This is a way of connecting him directly. We go straight from the Tower of Babel into Abraham's story, and that connects those two stories theologically."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2248.64,"end":2249,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2249,"end":2254.82,"speaker":"Fr Stephen De Young","text":"Rather than going through a narrative of exactly how much time passed, which would serve to then disconnect them."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2254.82,"end":2255.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2255.78,"end":2297.36,"speaker":"Fr Stephen De Young","text":"There's sort of this immediate segue, and there are sort of Jewish legends, and I call them that because these aren't really from Second Temple literature. These are rabbinic stories that get written down. But the rabbinic stories, when they get written down, are finally writing down oral tradition that goes back before it. So we're not sure exactly where they originate. But there's a number of them and a number of variations, but they're canonical, for no one connects Abram directly to the Tower of Babel story."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2298,"end":2313.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's living next to the construction of the Great Ziggurat of Ur, which is then sort of conflated with the Tower of Babel, which is connected then also with the Babylonian empire. All of those things are kind of piled up on top of each other."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2313.99,"end":2328.79,"speaker":"Fr Stephen De Young","text":"Right. And so you get these stories of Nimrod being, you know, angry at Abram because he won't worship the pagan gods and trying to throw him into the brick kiln. And, I mean, there's a whole. There are all these elaborate stories."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2330.77,"end":2331.01,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2332.85,"end":2339.57,"speaker":"Fr Stephen De Young","text":"Yeah, there's. And part of it is riffing off of a really obscure point is that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2340.21,"end":2340.61,"speaker":"Announcer","text":"Ur."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2343.65,"end":2351.01,"speaker":"Fr Stephen De Young","text":"Can actually mean. In old Canaanite and very early Hebrew, Ur could actually mean fire."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2351.97,"end":2352.77,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's fun."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2353.17,"end":2362.84,"speaker":"Fr Stephen De Young","text":"So they decided to translate, you know, when God says to Abram, I saved you out of Ur of the Chaldeans, they translated that as the fire of the Chaldeans."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2363.32,"end":2364.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2364.2,"end":2368.2,"speaker":"Fr Stephen De Young","text":"And then elaborated that into the whole brick kiln story and all of that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2368.6,"end":2369.72,"speaker":"Fr Andrew Stephen Damick","text":"Like the three holy children."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2370.12,"end":2387.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. You can see these different pieces of oral tradition about Abram's life, that he was there when they're building the Great Ziggurat and the Tower of Babel story and the story of the three youths in Babylon all kind of get mingled together in this oral mishmash."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2388.01,"end":2388.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2388.97,"end":2394.09,"speaker":"Fr Stephen De Young","text":"That ends up getting written down in the Rabbinic period. But there's also another connection here."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2394.41,"end":2394.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2394.97,"end":2427.51,"speaker":"Fr Stephen De Young","text":"And that's that I mentioned that there were a couple of periods, many centuries apart, where there were rebuilding efforts for the Great Ziggurat in Ur. And the first of those was actually by Nabonidus, who was the last Neo Babylonian emperor who came and rebuilt it. So the Great Ziggurat of Ur that was first constructed in Abram's time was repaired and rebuilt by the Chaldeans in the Neo Babylonian empire. So that's another connection."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2427.75,"end":2439.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they themselves were actually connecting themselves to this ancient civilization that they. I mean, they were. You know, there was a cultural connection, although with a lot of time passing."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2440.26,"end":2442.42,"speaker":"Fr Stephen De Young","text":"Between, somewhat strained by that point, but."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2442.42,"end":2456.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Exactly. Exactly. All right, well, so having painted that picture of the civilization that Abraham grew up in, we're going to go ahead and go to break, and we'll be right back, and we will take some of your calls. So let's go to break."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2457.46,"end":2473.77,"speaker":"Announcer","text":"Father Andrew. Stephen Damick. And father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2478.89,"end":2489.7,"speaker":"John Maddox","text":"Hi, this is John Maddox. You know, when you support Ancient Faith Radio, you're not only helping to make this ministry possible for you, but also for people like Bryce in Australia."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2490.26,"end":2532.06,"speaker":"Bryce","text":"I'd firstly just like to say that I love your show and what you do. It means a lot to all of us listening. I'm down in Australia and over here Orthodoxy is basically unheard of. I'm not Orthodox. I was raised into an Evangelical Protestant family. However, from a gradual exposure and desire to learn more about Orthodoxy, I've come to agree and see truth in pro pretty much everything the church teaches. The nearest English speaking Orthodox church is several hours away and I feel all alone in my pursuit of the faith here. Currently, my only exposure to Orthodoxy is through Ancient Faith Radio. And my friend, how should I introduce the idea that I may be inquiring into Orthodoxy to my parents? Thanks again, Bryce."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2532.38,"end":2547.59,"speaker":"John Maddox","text":"Would you consider a donation to AFR right now? You can do so on our app or go to our website@ancientfaith.com Support Ancient Faith Radio here for you and for people all over the world."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2565.28,"end":2581.2,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2583.6,"end":2610.52,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second part of our show and it's where we begin to take some of your calls. Just like the voice of Steve just said. You can call us at 855-AF-RADIO again, 855-237-2346. Before we do that, I actually realized that last time when we had our show two weeks ago, I totally forgot to mention, and I don't know if this is like evidence of my staggering humility or. Or what."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2611,"end":2612.76,"speaker":"Fr Stephen De Young","text":"Creeping old age, creeping."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2612.76,"end":2777.48,"speaker":"Fr Andrew Stephen Damick","text":"That's quite likely senility. But I totally forgot to mention that actually just two days before that show that I had a new book is out. So I've got a new book. It's called Arise O the Gospel of Christ's Defeat of Demons, Sin and Death. And it's published by Ancient Faith Publishing. You can get it@store.ancientfaith.com and the point of the book is it's a summary of the gospel from an orthodox point of view and especially if you listen to this show, then you're going to see demons all over it. Because actually, the gospel has a whole lot to do with demons. So what I do in the book is at the beginning, I actually talk about what is a gospel and how it's actually not what most people these days in 21st century American Christianity say that it is. Then talk about what the gospel is first from the actual biblical point of view. And then I ask the question, well, why is there a gospel at all? Like, what's wrong? Why does there need to be a gospel? And then I just describe the actual contents of the gospel and then get to the point where you actually ask, well, okay, wait, what do I have to do to be saved? Because, you know, spoiler alert. The gospel is not. This is how you get saved. The question what do I do to be saved? Is the response to the gospel. And then I talk about what happens when someone actually does respond to it and gets on board. So, you know, I just wanted to mention it because I know that those of you who listen to this show that this will be right up your alley. It is a short book. You can probably read the whole thing in the space of a couple of hours. There's paperback version, there's ebooks. You can get that from orthodoxchristian ebooks.com. it's also on Kindle and there's an audiobook version as well, which you can get through Audible and also Apple Books. So I hope you'll check it out. It's been selling really well the last couple of weeks. Thanks be to God for all of you who have gotten it so far. Thank you. And we'd love to hear from you what you think about it. And please, you know, write a review on Amazon or wherever else you want to write reviews, and that would be helpful so that more people can get to it. And, you know, especially if you're clergy and listening. I just want to suggest to you that this book will be really good for your evangelistic work and also for your catechetical work for people who are coming to your parish for the first time. And then also people that are being raised in your parish and, you know, need to be trained in this core question of what exactly is the gospel? So, yeah, so, yeah, I mean, it's a little bit of an advertisement, but again, if you're listening to this, so you're going to be into this, so do check it out. I know a lot of you have so far. Thanks a lot for doing that. Okay, well, we do actually go ahead."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2777.48,"end":2778.28,"speaker":"Fr Stephen De Young","text":"Allow me to say."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2778.6,"end":2778.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2778.92,"end":2779.31,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2779.94,"end":2782.58,"speaker":"Fr Stephen De Young","text":"Your new book is Lilliputian in size."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2782.74,"end":2783.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It's quite small."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2784.02,"end":2786.38,"speaker":"Fr Stephen De Young","text":"Brobedingian in scope."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2786.38,"end":2787.22,"speaker":"Fr Andrew Stephen Damick","text":"Oh, nice."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2787.78,"end":2791.3,"speaker":"Fr Stephen De Young","text":"And I just wanted to promote it swiftly because."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2791.3,"end":2791.78,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2792.26,"end":2794.38,"speaker":"Fr Stephen De Young","text":"You came to me and told me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2794.38,"end":2795.02,"speaker":"Fr Stephen De Young","text":"You were writing it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2795.02,"end":2801.3,"speaker":"Fr Stephen De Young","text":"And I said, well, that sounds like a modest proposal. And now I'm wondering how long you'll let me keep doing this."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2802.82,"end":2807.93,"speaker":"Fr Andrew Stephen Damick","text":"No, I was. It was beautiful. It was beautiful. While. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2807.93,"end":2815.17,"speaker":"Fr Stephen De Young","text":"Okay. Well, we actually do have Jonathan Swift, Greater Than Sign. Jonathan Edwards. Don't hack me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2815.25,"end":2827.33,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Amen. All right. We do actually have a couple of calls coming in, so one of them is Dolly calling from Atlanta. So, Dolly, are you there?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2828.13,"end":2829.41,"speaker":"Dolly","text":"I am. Hello."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2830.05,"end":2833.17,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the Lord of Spirits podcast. We're glad to have you. What's on your mind?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2834.69,"end":2883.82,"speaker":"Dolly","text":"Well, I have a throwback to eating with the gods and sacrifices of righteousness. And so it really kind of turned my head upside down when you redefined how I thought of worship as a meal with your God. And it made me think about the function of the family table, and it made me want to think about it sacramentally. But then I didn't want to overstep my bounds, theologically speaking. And so I was wondering about, you know, in the kind of. If we're trying to unmodern ourselves and live our lives more in touch with the unseen as well as the scene, what are some ways that we can do that? And, you know, the first thing I thought about was the family table, but other sort of practical ways that we can live in a more sacramental manner."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2884.22,"end":2884.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2885.56,"end":2889.64,"speaker":"Dolly","text":"Other than the obvious, you know, reading your Bible and praying and attending Mass and all that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2890.2,"end":2963.43,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. I mean, that's an excellent question. And I mean, I think that the family table is the place to start, because in a lot of ways, in modern materialist America, it's kind of the last sacrament that might exist for some people, but even that's being torn apart. You know, where many families. A lot of times family mealtime is not family mealtime, it's just people showing up to the table every so often with something they got out of the fridge. But so, you know, I think the pattern that's going on when people worship God by offering sacrifice, especially the Eucharist, within the Christian context, that same kind of thing, although in a different way. It's not identical when you sit down together with your family and have dinner, but. But there's something very similar happening there. And I think that the way to. The biggest way to underline that it is a. I'm trying to think of. The best way to talk about is an enchanted sacramental thing that we're doing. When we do that is, you know, to begin, obviously, I kind of want."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2963.43,"end":2966.43,"speaker":"Dolly","text":"To ask a Pajovian question. What is the symbolism of the."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":2966.81,"end":3032.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Well, I mean, it's. It's about sharing life, right. And becoming like one another and becoming part of one another. I mean, that's what's going on. When you offer a sacrifice to a God, he becomes part of your community, you become part of his. And so when people eat together all the time, they become part of each other and they. They. They change one another. Right? And so part of the reason that we then pray before the meal and then also in Orthodox tradition, after the meal as well, is that it binds it all together with a blessing from God and reveals the meal to be what it truly is supposed to be, which is actually a salvific experience for everybody involved. But, you know, you can transfer that model to almost anything that you do, especially communally. Right. Like if you're going to take a trip together to pray beforehand and after and. And, you know, try to sanctify it along the way as much as possible. I don't know. Father Stephen, is there anything you wanted to add or expand on or actually."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3033.34,"end":3035.5,"speaker":"Fr Stephen De Young","text":"Well, yeah, I mean, just building off of that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3035.5,"end":3035.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3035.82,"end":3047.56,"speaker":"Fr Stephen De Young","text":"I mean, the families eating meals together is one of many things, but sometimes one of the first things we notice in terms of our complete alienation from each other and the rest of creation."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3047.88,"end":3048.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3050.28,"end":3174.53,"speaker":"Fr Stephen De Young","text":"We don't spend time with other humans anymore, that we sit next to them and look at our phones or we sit next to them and one person's reading something and another person's watching television. But we don't actually spend time together doing things. So there are a lot of things that may almost seem quaint and overly wholesome and silly to us now, but, you know, planting a garden and taking care of it together, taking care of animals together, creating things and making things together, this is what people used to do. You know, they would go and make something with wood or make something with fabric or amazing, you know, and doing it together and spending that time together and reconnecting in any way we can, you know, and. And trying to reestablish a sense of community. The best place, the only place to start now for that is our churches. There used to be, you know, 70 years ago, there was the VFW hall and the Union hall and the. The Lions Club and Rotary and lodges and this and that, the other, where people would go out in public and spend time with other humans in community. And there was a problem at the time because those kind of pulled people away from the church community into these other, sometimes secularized, sometimes other kinds of communities. But now those are all gone and we don't have them at all. There is no place now, especially with after Covid, where we go out and spend time in public with other people in our community, except for our churches. And so that's the only place to begin to connect with people, even beyond our immediate family and try to extend those social bonds back out. Because we weren't made to live as alienated, isolated individuals, and we weren't even made to live as nuclear families."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3174.76,"end":3175.16,"speaker":"Fr Andrew Stephen Damick","text":"Families."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3175.56,"end":3175.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3175.88,"end":3203.06,"speaker":"Fr Stephen De Young","text":"The nuclear family is a weird thing that's come up since industrialization. We're made to live in extended families and communities and villages together and be part of each other's lives and be connected to, you know, a hundred other people and to plants and animals and crops and the world around us. So trying to rebuild that, starting with small steps. Steps is the way to go."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3203.22,"end":3208.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, Well, I hope that's helpful to you, Dolly. Thank you very much for calling in."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3208.9,"end":3213.54,"speaker":"Dolly","text":"May I ask quickly, what would a correct blessing look like?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3214.66,"end":3254.96,"speaker":"Fr Andrew Stephen Damick","text":"A correct blessing look like? Well, I mean, so need to include. I mean, there's, you know, there's. There's all kinds of orthodox prayer books which have various meal blessings. So there's a lot of versions of them. Usually, almost always they include some kind of thanksgiving to God and asking that he would bless not just the food, but also the people that are there. But there's short ones, there's long ones. You know, they're all good. All right, thank you very much. Okay, we're going to take one more caller and then we're going to move on. So we've got Salvatore calling from Houston. Salvatore, welcome to the Lord of Spears podcast."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3256.07,"end":3256.47,"speaker":"Announcer","text":"Thank you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3256.47,"end":3286.3,"speaker":"Dolly","text":"Fathers and I also kind of have a throwback to the Eating with the Gods episode. My question is, from the Book of Samuel, everything seems kind of wonky jawed. Samuel doesn't seem to be a priest, but he's offering sacrifice at high places. The Ark of the Covenant's hanging out at someone's house for 25 years. Other priests are raping with women at the tabernacle. God seems to be okay with Samuel offering sacrifice, but not Saul. What's happening?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3287.9,"end":3289.74,"speaker":"Fr Andrew Stephen Damick","text":"I'm going to hand that right to you, Father Stephen."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3289.98,"end":3390.78,"speaker":"Fr Stephen De Young","text":"Right, yeah. Well, so Samuel had two roles. He's kind of unique biblically in this regard in that he was the prophet of God and he was the last judge of Israel. The book of Judges ends. And so sometimes we don't realize that, but if you read the text of First Samuel or First Kingdoms carefully, it refers to it. It says, you know, Samuel judged Israel from this time to this time, right? Several times. That's the verb that's used. So he has this. This sort of unique role. But part of what prophets do and part of what they're called by God to do is. Is to enact a judgment against the corrupt Israelite institutions, right? So like in our last episode when we talked about St. Elias or the prophet Elijah, he was enacting this kind of judgment of God against Ahab and Jezebel, right? And the king, because the monarchy of the northern kingdom had become utterly corrupt. And so this also happens with the temple or tabernacle and the priesthood that sometimes when that has become corrupt. And you point out to one example of how it became corrupt during that period. But there are more because the priesthood had become corrupt, right? God then uses his prophet to enact by having him do the sacrifices and having him do them somewhere else and excluding the priest. That's an act of judgment against that priesthood. God is sort of taking that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3390.78,"end":3391.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3391.1,"end":3420.18,"speaker":"Fr Stephen De Young","text":"And that privilege away from them and giving it to someone else as a form of enacting judgment. And this dynamic sort of happens again in the book of Jeremiah that one of the themes in the book of Jeremiah is that everyone is sort of placing their confidence in the temple, that the place where God's presence is, is where his Spirit is, where he's placed his name is in the temple. And in actuality, the temple was about to be destroyed."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3420.82,"end":3421.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3421.18,"end":3424.54,"speaker":"Fr Stephen De Young","text":"Even though they believed, you know, well, God will never let his own temple get destroyed."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3424.54,"end":3424.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3424.9,"end":3426.18,"speaker":"Fr Stephen De Young","text":"So we'll have to be safe."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3427.62,"end":3427.94,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3427.94,"end":3463.67,"speaker":"Fr Stephen De Young","text":"But in actuality, the. The Spirit, God's presence, God's name had been placed in Jeremiah himself, right? So Jeremiah sort of becomes this temple in a sense as a judgment against the corruption of the temple and the priesthood at the time. So Samuel is sort of the one faithful prophet during a lot of that period, basically, until David shows up. He's about it, Right. And so God's presence is with Samuel. And so the true sacrifices are being offered by Samuel. The true leader of Israel is Samuel."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3464.54,"end":3464.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3465.18,"end":3472.3,"speaker":"Fr Stephen De Young","text":"Because of Saul's faithlessness and shenanigans, Right? So, yeah, so that's, that's, that's how that works."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3473.02,"end":3488.3,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, there you go, Salvatore. Thanks for calling in. All right, well, rolling on. So Genesis 1 through 11, this is where all the bad things in the world come from, right?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3488.54,"end":3488.94,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3488.94,"end":3492.85,"speaker":"Fr Andrew Stephen Damick","text":"You know, death, sin, demons. Oh, buy my book, everybody."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3492.85,"end":3498.33,"speaker":"Fr Stephen De Young","text":"Yeah, because that's more about this. Yeah, exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3498.33,"end":3498.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3498.65,"end":3503.89,"speaker":"Fr Stephen De Young","text":"And of course, there was the. The. We've talked about how there are these sort of three fall events."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3503.89,"end":3504.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3505.17,"end":3578.8,"speaker":"Fr Stephen De Young","text":"And so we're not going to go through all that again right here. But because as we just mentioned before the break, Abram's story really is intended. The way Genesis is constructed is intended to follow directly on after the Tower of Babel. We kind of want to focus on that one just a little bit in that remembering that what's going on there is not just like, oh, hey, now, everybody talks different languages. But that what's going on there is, as we've talked about before, God's presence was with humanity before the flood. And humanity became so sinful that they experienced mass death by holiness through God's own holiness, sort of wiping them out. And so after the flood, he sets his bow in the clouds. He says, I'm no longer going to make war with man. And so he's not going to destroy humanity again in that way. And so then when we come up to. We see Nimrod, we see the giant thing happening again when the Tower of Babel happens, rather than God remaining and destroying humanity, he departs. This is the other option is he can leave. He can depart."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3578.8,"end":3594.4,"speaker":"Fr Andrew Stephen Damick","text":"And he hands over the rule of the nations to angels, who then rule them by proxy. And as we've seen before, of course, they fall because they accept worship. And that's the origin of paganism according to the Bible."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3595.04,"end":3605.36,"speaker":"Fr Stephen De Young","text":"Right. And so this, this third problem, this problem of the. The fallen powers of principalities is set up by the Tower of Babel. And then we immediately go into Abram."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3605.52,"end":3620.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's funny because, like, it's so Genesis 12, it just says, and God talked to Abram again. He doesn't show up and say, oh, hey, hey, I'm. I'm. I'm. I'm. I am. That's. That's who you should call me. And. And, you know, like, there's none of that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3621.63,"end":3628.83,"speaker":"Fr Stephen De Young","text":"I'm Yahweh and I'm the most high God. Right? Yeah. There's no introduction. It's just Yahweh said to Abram."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3628.91,"end":3631.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which indicates, like, he already knows him."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3631.87,"end":3632.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3632.19,"end":3633.79,"speaker":"Fr Andrew Stephen Damick","text":"Abram already knows Yahweh."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3634.11,"end":3685.82,"speaker":"Fr Stephen De Young","text":"Right. That this is. This is a relationship that already exists. Right. So this Means that Abram is our first example, but not the last. There's gonna be another one within Abram's story, that being Melchizedek, who we're going to talk about in our next episode. Yes, but there's Melchizedek also, who are people who, despite what happened at the Tower of Babel, and we talked about, even you could see this in anthropology and sociology texts that gradually the most high God sort of retreats into the background of pagan religion, and the focus all falls to the sort of lesser members of the pantheon, the local. The local gods that Abram and Melchizedek and there could be some others, have remained faithful to the worship of the most high God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3686.06,"end":3710.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One of the questions we sometimes get in regards to this problem of the fall after Babel is that we'll get like, well, did no nation stay, you know, faithful to Yahweh? And the answer to that is no. No nation did. But some people did. Some people did. So the nations have fallen, but there are a handful of people who actually are still worshiping the one true God. And Abram is one of them. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3710.85,"end":3717.69,"speaker":"Fr Stephen De Young","text":"Abram has been. And so even though this story in Genesis 12 is kind of called the call of Abraham."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3718.01,"end":3718.41,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3718.57,"end":3725.85,"speaker":"Fr Stephen De Young","text":"Or the call of Abram, and that might give us the idea that this is something like the calls of the prophets that we're going to see."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3726.26,"end":3726.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3726.42,"end":3727.18,"speaker":"Fr Andrew Stephen Damick","text":"It's not like that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3727.18,"end":3734.74,"speaker":"Fr Andrew Stephen Damick","text":"He doesn't get, like, taken up to heaven. Right. Yeah, yeah. There's no big vision. Yeah, none of that. Right, none of that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3734.74,"end":3741.3,"speaker":"Fr Stephen De Young","text":"And even the language is used later. Yahweh says to him, walk before me and be righteous."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3742.26,"end":3742.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3742.62,"end":3746.34,"speaker":"Fr Stephen De Young","text":"And that walk language is being picked up from earlier in Genesis in the garden."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3746.82,"end":3747.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3747.78,"end":3785.17,"speaker":"Fr Stephen De Young","text":"So there is this ongoing life of faithfulness that Abraham is carrying out. This isn't just an observation St. Paul makes later, like, wow, that Abraham was a really faithful guy. This is the crux of what's going on from his very introduction. But as you just mentioned, these are isolated individuals. So even Abram's own father is set up in the text to not have been a worshiper of Yahweh, the most high God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3785.25,"end":3791.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It mentions that he's a pagan. Actually, in Joshua 24:2, it says that he's. He doesn't worship."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3792.13,"end":3792.53,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3792.53,"end":3794.85,"speaker":"Fr Andrew Stephen Damick","text":"You know, and it's remembered all those years later."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3795.01,"end":3807.74,"speaker":"Fr Stephen De Young","text":"It's. He's singled out. Right. Joshua. Joshua is speaking, and he says, our ancestors lived beyond the rivers, Right. In Mesopotamia and worshiped other gods, including Terah, Abram's father."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3808.14,"end":3808.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3808.5,"end":3869.14,"speaker":"Fr Stephen De Young","text":"So he gets singled out for that. And we see this also in the, in the narrative itself in, in the end of Genesis 11 and Genesis 12, the end of Genesis 11, the end of the genealogy is actually Terah. And what the, what it says at the end of Genesis 11 is that Terah takes his family, which includes Abram and, and Nahor and Lot and Haran, and is going to take them to Canaan, but he stops in Haran and stays there until. Until Terah dies. Then that story gets retold in Genesis 12 where Yahweh comes to Abram and tells him to go to Canaan and Abram stops and stays with his father Terah in. In Har Haran and he dies and then goes on and completes the journey. And it's not a coincidence that Haran is another city, another Mesopotamian city where the same moon God is being worshiped."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3869.46,"end":3905.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this, even though the scripture doesn't say this explicitly, there's almost a suggestion that Terah got this call to make the move but failed to carry it out. And. And Abram is the one who actually then does it. Right. And you know, again, it's not explicit, but. But it's sort of suggested because, like, why, you know, there is this move, you know, in that direction, but he stops and doesn't, doesn't go on. He gets entangled up with the worship of that God that they had been worshiping back in Ur as well. So. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3905.71,"end":3906.11,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3906.27,"end":3915.73,"speaker":"Fr Stephen De Young","text":"And so because of this, because Abram is so different even than his own family. And we're going to see Lot doesn't always do so great."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3915.89,"end":3916.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3919.09,"end":3965.47,"speaker":"Fr Stephen De Young","text":"In the story of Abram and his life, because Abram is sort of different and set apart in this way. This is known, this is built into the text. So in Second Temple literature and other stories where you see the figure of Abram, there's always this incorporated, this kind of enmity and alienation between him and the surrounding world where this kind of evil paganism, this idolatry, sexual immorality, these things are going on. And he's sort of set apart from that. And that creates this enmity between him. There's a hostility of the world. And this is. He sort of talks about this. This. Right, this, this quoted line where he talks about being a stranger in a strange land."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3966.03,"end":3966.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3966.87,"end":3985.63,"speaker":"Fr Stephen De Young","text":"That, that he's sort of alienated. And St. Peter picks up on this saying that we should live that way. We should be like aliens and foreigners in the world because we're, of course all too comfortable compared to Abram in. In civilization. But Abram is sort of set apart because of that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":3986.04,"end":4011.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So he lives out as a nomad, so he's not part of this civilization. The Ur civilization, which, I mean, is also kind of an ascetical image as well, you know, that he's. He's separate from all of the benefits, you know, that are. That are existing in civilization as well. And so then it's in that context, then, that God gives to him these promises. Right, right. Yeah. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4011.24,"end":4011.86,"speaker":"Fr Stephen De Young","text":"And that's."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4012.25,"end":4024.97,"speaker":"Fr Stephen De Young","text":"Before we move on, just to add this is. This is a theme sort of throughout Abram's story. The places where he or someone in his family get in trouble is when they try to go back to civilization."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4025.29,"end":4025.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4025.81,"end":4028.97,"speaker":"Fr Stephen De Young","text":"Two times Abram visits Egypt, he gets into trouble."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4029.21,"end":4029.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4029.85,"end":4033.53,"speaker":"Fr Stephen De Young","text":"When Lot goes and moves down next to Sodom, he gets into trouble."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4033.85,"end":4034.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4034.49,"end":4042.68,"speaker":"Fr Stephen De Young","text":"There's this sort of pull to come back into the world and back into the world. So civilization. And that's leading to destruction."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4043,"end":4097.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Yeah. Okay. So then in Genesis 12, when God speaks to Abram, he initially gives him the first version of the promises to him. And this is in verses two and three. God says, I will make of you a great nation, and I will bless you and make your name great so that you will be a blessing. I will bless those who bless you, and him who dishonors you, I will curse. And in you all the families of the earth shall be blessed. And it's particularly notable here that one of the things that's happening is that God is the God of Abraham and not the God of a place. He's the God of a person, not the God of a place. We talked about this at some length in our Pentecost episode, which was titled An Immaculate Dwelling Place. So if you're interested in that question, go back and. And listen to that. Right. But then the promises get. Get reiterated three times and kind of expanded out. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4098.75,"end":4099.55,"speaker":"Fr Stephen De Young","text":"Fleshed out."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4100.11,"end":4152.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I'm just going to read those real quick in succession, then we're going to talk about what they say. So Genesis 15:5. Then Yahweh brought Abraham outside, saying, look now toward the heavens and count the stars, if you are able to number them. Then he told him, so will your seed be Genesis 22:17. I will surely bless you and greatly multiply your seed, like the stars of heaven and like the sand which is on the shore of the sea. And your seed will occupy the gate of their enemies. And then Genesis 26:4. But I will multiply your seed as the stars of the heavens. And I will give to your seed all these lands, and all the nations of the earth will be blessed in your seed. Okay, so what's going on? What's going on within. There's. There's like several different elements to this promise that God is giving him. Right, Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4152.2,"end":4158.84,"speaker":"Fr Stephen De Young","text":"And so. And little pieces. Every time he reiterates those promises, there are little nuances and pieces and angles."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4159.16,"end":4159.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4159.52,"end":4167,"speaker":"Fr Stephen De Young","text":"That. That get added and. And fleshed out there. So first and foremost, and probably the most obvious one."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4167.33,"end":4167.49,"speaker":"Bryce","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4167.49,"end":4172.05,"speaker":"Fr Stephen De Young","text":"Is that there's a. There's a sort of quantitative element to these promises."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4172.69,"end":4173.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4173.57,"end":4189.21,"speaker":"Fr Stephen De Young","text":"Abram is 75 years old and has no children. And his name, Abram, means great father. And so most likely Tara named him that, referring to himself, of course."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4189.21,"end":4192.61,"speaker":"Fr Andrew Stephen Damick","text":"But he's got a great father, but."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4192.61,"end":4196.06,"speaker":"Fr Stephen De Young","text":"At least it leaves this kind of bitter irony that he's childless."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4196.06,"end":4196.94,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4197.42,"end":4245.23,"speaker":"Fr Stephen De Young","text":"And so there is this. This quantitative element that he's not just going to have descendants, but he's going to have this vast multitude. Right. Like the sands of the seashore. And that nations, plural, are going to come from him. That is part of the promise. Not just Israel, but nations are going to come from him. And all the nations of the world, meaning the 70 nations. Right. Are all going to be blessed through him. That it's through him that God is eventually going to call those nations back who are scattered at Babel. But then there's also, in addition to that quantitative promise, there's also a qualitative element. And so you see that in the first quote that you read from Genesis 15:5, when he says, look at the heavens and count the stars, if you're able to number them, he says, so."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4245.23,"end":4246.31,"speaker":"Fr Stephen De Young","text":"Will your seed be."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4246.49,"end":4253.45,"speaker":"Fr Stephen De Young","text":"He doesn't say, so many will your seed be. So, yeah, your descendants will be like."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4253.53,"end":4256.33,"speaker":"Fr Andrew Stephen Damick","text":"The stars in this way. Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4256.33,"end":4307.61,"speaker":"Fr Stephen De Young","text":"And this isn't just me trying to be tricksy with the original language or something. This is something that our earliest interpreters saw. So exhibit A of this is Philo of Alexandria, who saw this very clearly. And here's a couple citations for you from Philo. He refers to this in his treatise, who is the heir of Divine things in section 17. And he refers to this in Questions and Answers in Genesis book four, section 181, where you can see that. Where he directly talks about the fact that this is referring to Abrams seed becoming like the stars, not as many as the stars."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4307.93,"end":4310.85,"speaker":"Fr Stephen De Young","text":"And this, of course, as we, as."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4310.85,"end":4333.28,"speaker":"Fr Stephen De Young","text":"We talked about earlier, if you're part of the Sumerian renaissance. You understand that the sun, moon and stars in the sky are bodies of the gods, the lower gods, the small G gods. Right. The goal gods who are now reigning over the cities, who Abram doesn't worship, by the way. He worships the most high God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4333.52,"end":4334.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4334.24,"end":4354.56,"speaker":"Fr Stephen De Young","text":"These other beings, these beings who have provoked this hostility between him and the world, they're going to become like them. And that includes then a second element that we see in the prophecy in Genesis 22:17 that you read, that is he would occupy the gates of their enemies."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4354.64,"end":4355.04,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4355.04,"end":4432.32,"speaker":"Fr Stephen De Young","text":"So the city gate was, you know, we, we would think of the city. You know, people get the key to the city and it doesn't actually open anything. Right, but the gates of the city, right, you had. The cities of the ancient world had these protective walls to protect from attack and invasion. And the gates, therefore you had to have them be the strongest part of your defenses. But also the city gate as well, where the administration of the city took place. The elders of the city would sit at the city gates. That's where they would hear cases, equivalent of court cases and side disputes. That's where you'd go to ratify a contract or an agreement. That's where marriages and divorces and these kind of things happened. So all of these things take place at the gate. So the city gate is. Is sort of the center of power of city, not the fringe of the city. And so if you're camping in your enemy's city gates, that means you have taken control of their center of power, you have taken control of their city. And so this adds this element of displacement that they're going to become like them and replace them as they are punished."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4432.4,"end":4498.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. So, okay, well, we're getting, unfortunately, as you guys know, a hurricane hit Louisiana, not that long ago and has kind of done some damage to the infrastructure, the Internet infrastructure there. So we're going to get Father Stephen hopefully switching over to our backup system here. But yeah, so, so, okay, so we were just talking about these promises to Abraham and what the point of all the things going on there, what kind of summarizes some of this is again, this Babel context. Right. So again, remember, the Abraham story follows immediately on the Babel story. Right. And so the Babel story establishes the idea that these hostile fallen principalities are governing mankind now. And so the promises given to Abraham are specifically about judging and displacing those hostile principalities. That's what's going on there. So that's one of the ways that these things are connected. Right, all right. Yeah. Okay, Father, you're there. All right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4500.79,"end":4537.68,"speaker":"Fr Andrew Stephen Damick","text":"And so these two obviously go together, right? The judgment, the replacement, are directly connected to each other. And so the next little piece we have to talk about in these promises, of course, is that there is this sort of other. Right. There's sort of a material element to go with that spiritual element. And sometimes, especially among some of our fellow Christians who aren't necessarily members of the Orthodox Church, that material element tends to take the whole focus."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4538.45,"end":4539.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4539.81,"end":4556.77,"speaker":"Fr Andrew Stephen Damick","text":"Rather than the spiritual element we were just talking about. In fact, that spiritual element is almost gone. That concept of basically theosis that we're talking about is basically gone and replaced with. They're going to have this particular strip of land in Palestine and."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4567.05,"end":4589.21,"speaker":"Fr Andrew Stephen Damick","text":"All right. Father Stephen, did we lose you? Well, it's live radio, everybody. He was connected to my. To mine. Bobby. Sorry, we're, we're. Oh, there's Father Steven. Yeah, welcome back. Okay. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4589.29,"end":4613.83,"speaker":"Fr Andrew Stephen Damick","text":"So I don't know where exactly I got cut, but so the spiritual element we were talking about, which is basically talking about theosis, sort of drops out in a lot of contemporary discussion of the promises to Abraham and is sort of completely displaced by the material element of the land, the physical land and the quantitative element."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4614.07,"end":4615.11,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4616.31,"end":4616.87,"speaker":"Fr Stephen De Young","text":"Of the."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4617.03,"end":4618.95,"speaker":"Fr Andrew Stephen Damick","text":"Lots of descendants, number of descendants."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4619.11,"end":4619.51,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4619.75,"end":4628.71,"speaker":"Fr Andrew Stephen Damick","text":"And so to understand how those two things are related to each other, the material element and the spiritual element of the promises. Because it's not that the material element isn't there."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4629.35,"end":4629.71,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4629.71,"end":4652.77,"speaker":"Fr Andrew Stephen Damick","text":"It's just the spiritual element. We have to kind of understand that the connection between prophecy and signs as it exists in scripture. And so when a prophecy is given, very often an accompanying sign is given."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4653.09,"end":4653.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4653.57,"end":4658.45,"speaker":"Fr Andrew Stephen Damick","text":"Because a prophecy is going to have some kind of fulfillment that is not immediately visible."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4658.53,"end":4665.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a kind of down payment, so to speak. Like, okay, something big is going to happen. I'm going to show you this to prove that it's going to happen."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4666.29,"end":4666.69,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4667.09,"end":4678.53,"speaker":"Fr Andrew Stephen Damick","text":"And a really obvious and well known one, thanks to Linus Van Pelt, is in Luke 2. Yeah. He's a Dutch last name. Did you ever think about that?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4678.53,"end":4683.57,"speaker":"Fr Andrew Stephen Damick","text":"I never thought about that. One of the peanuts was Dutch, but there we go."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4683.97,"end":4684.93,"speaker":"Fr Stephen De Young","text":"So is Lucy."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4684.93,"end":4688.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Right. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4691.57,"end":4710.08,"speaker":"Fr Andrew Stephen Damick","text":"In Luke 2, right after the stars have sung to the shepherds, the angel tells them to go, and he says, this will be assigned to you. He's just announced to them, the Messiah has been born. The Savior of the world has been born. The Messiah is here. They say this will be assigned to you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4710.08,"end":4710.32,"speaker":"Fr Stephen De Young","text":"Go."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4710.32,"end":4718.4,"speaker":"Fr Andrew Stephen Damick","text":"You will find a baby wrapped in swaddling clothes, lying in a manger, lying in an animal food trough. This is not something you normally see every day."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4718.48,"end":4719.52,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4719.6,"end":4753.44,"speaker":"Fr Andrew Stephen Damick","text":"And so when they see this, this odd thing, then they will know that it is true, that this child is the Messiah. This sign will clue them in. And this kind of goes the other way too, because we find over and over again in the Gospels, people coming to Jesus after he preaches and after he teaches what he teaches, and demanding a sign from him, show us some signs so that we may believe you. I don't buy it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4753.44,"end":4753.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4755.6,"end":4757.36,"speaker":"Fr Andrew Stephen Damick","text":"And Christ, of course, refuses."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4757.44,"end":4760.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The only sign I'm going to give you is the sign of Jonah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4761.68,"end":4762,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4762,"end":4773.28,"speaker":"Fr Andrew Stephen Damick","text":"Which is of course his death and resurrection. And so built into that answer is the fact that Christ's death and resurrection then proves that everything he taught and said was. Was true."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4775.6,"end":4776,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4778.25,"end":4810.43,"speaker":"Fr Andrew Stephen Damick","text":"That said, what we have here, in terms of the material element of these promises is that the material element of these promises is the sign of the spiritual element. So the material element of Abram's descendants, the several nations descended from him, which biblically includes not just Israel, but also Edom and Ammon and Moab."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4811.15,"end":4812.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4812.83,"end":4848.74,"speaker":"Fr Andrew Stephen Damick","text":"Them coming into, at different times, into the land that Abram has promised and overthrowing the giants who are there, the spiritual powers of evil, who the giants represent. That on the visible level and the more immediate level, it's still a few hundred years, but on the more immediate level is the proof is the sign that the deification of Abram's descendants, his faithful descendants, and their displacement of the powers and principalities in the heavenly places is also a reality."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4848.82,"end":4907.34,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. Yeah. So it's. I mean, I just want to underline what you just said because this is a super important point in this whole story. Right. So, number one, Abraham has descendants other than Israel. Right. The Edomites, the Moabites and the Ammonites, like these are descendants of people like Esau. And, you know. Right. So it's not that necessarily this. This line, you know, the main heir, but there are other descendants as well, and they also have driven off these demonized giant clans. And this is the sort of immediate sign that is the depiction of what's going to actually ultimately happen. Like, like there is going to be Abraham, your seed, is going to ultimately drive off all these dark powers. And to prove that to you, in the meantime, a bunch of your descendants are actually successfully do this kind of on a local level. Right. So that's part of what's going on in this story."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4908.46,"end":4908.86,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4909.02,"end":4936.16,"speaker":"Fr Andrew Stephen Damick","text":"And we read in Deuteronomy 2. And of course, you could go back to the Giants episode. We went through it in detail, all the different giant clans, how the Edomites drove giant clans out of what became Edom. Likewise with the Moabites, likewise with the Ammonites, likewise with the Kaftari, the Cretans, the Philistines. But you can read more about or listen to more about that on our Giants episode, what the Greeks are doing there."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4937.12,"end":4937.52,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4939.44,"end":4939.84,"speaker":"Fr Andrew Stephen Damick","text":"These."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4939.92,"end":4940.32,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4940.32,"end":4952.67,"speaker":"Fr Andrew Stephen Damick","text":"So the Abrahamites come in, and one of the things that's sometimes pointed out by our friends who still want to focus on that material level of the promises and try to project that out into the future."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4953.95,"end":4955.07,"speaker":"Fr Stephen De Young","text":"You know who you are."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4956.19,"end":4958.19,"speaker":"Fr Andrew Stephen Damick","text":"We're looking at you dispensationalists."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4960.83,"end":4962.59,"speaker":"Fr Andrew Stephen Damick","text":"Dallas is not that far from me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4964.43,"end":4964.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4964.99,"end":4966.11,"speaker":"Fr Stephen De Young","text":"So the."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4969.35,"end":4976.15,"speaker":"Fr Andrew Stephen Damick","text":"What they'll say is, well, God actually promises to Abraham this huge tract of land, and Israel never controlled all that land."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4976.71,"end":4980.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So eventually they need to get it right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":4981.11,"end":5003.84,"speaker":"Fr Andrew Stephen Damick","text":"But if you actually read Deuteronomy and you include all the other Abrahamites, you include the Midianites, who are Ishmaelites and Edomites, you include Edom, you include Moab, you include Ammon, who are descended from lots of. You include all of those groups, all of the Abrahamite groups, they did get that land. But it's not just me saying so."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5004.16,"end":5005.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Joshua says it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5006.24,"end":5007.92,"speaker":"Fr Andrew Stephen Damick","text":"Joshua says so twice."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5008.16,"end":5033.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, yeah, okay. So especially once you get towards the end, you know, towards the end of the book of Joshua, in Joshua 21:45, it says this, right. Explicitly, it says not one word of all the good promises that the Lord had made to the house of Israel had failed. All came to pass. And that was said right after all the land had been claimed, you know, and not just by Israel, but by these other Abrahamite groups as well."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5033.51,"end":5033.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5033.91,"end":5035.99,"speaker":"Fr Andrew Stephen Damick","text":"So promise fulfilled."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5036.55,"end":5053.43,"speaker":"Fr Andrew Stephen Damick","text":"You can look at Joshua 11, 21, 23 and 21, verses 43 through 45, it directly refers to the giant clans being driven out. It directly refers to taking the land and says all the land promises made to Abram were therefore fulfilled. They're done at the end of the book of Joshua."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5053.43,"end":5054.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5055.71,"end":5057.55,"speaker":"Fr Stephen De Young","text":"And so that then."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5059.47,"end":5074.35,"speaker":"Fr Andrew Stephen Damick","text":"Sets that part. The sign therefore is instantiated and is instantiated in the Scriptures. Right. In the earliest layer of the Hebrew Scriptures. And so that then is the guarantee for us that the larger promise is."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5075.47,"end":5076.51,"speaker":"Fr Stephen De Young","text":"Going to come true."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5076.83,"end":5077.55,"speaker":"Fr Stephen De Young","text":"And so."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5079.54,"end":5158.97,"speaker":"Fr Andrew Stephen Damick","text":"It'S this greater promise of the Theosis, or the divinization or the deification, whatever word we want to choose, of the faithful descendants of Abraham who received this through their faithfulness in the way Abram received the promises, through his faithfulness to God in the way he walked and lived his life, and remaining loyal and true to Yahweh, the God of Israel, and not following after idols and these other gods in the same way. This is what St. Paul goes back to when St. Paul talks about salvation, when he talks about salvation, when he sees salvation in Christ. St. Paul's soteriology, right, his theology of salvation is all based around this, is that now in Christ through the incarnation and death and resurrection and ascension of Christ, those promises have now been completed, right? And that's why he goes back to Abraham and talks about his faithfulness. That's why he talks about his inheritance. He talks about being sons of Abraham. He talks about being heirs of the promises, inheritance. All of that language that St. Paul uses to talk about salvation comes from the now spiritual element of those promises, right?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5158.97,"end":5190.55,"speaker":"Fr Andrew Stephen Damick","text":"That salvation is bound up, frankly, in spiritual warfare. And not just warfare and defeating those dark powers. But then the ascending of the descendants of Abraham. Yeah. Yeah. Okay. Well, we're going to take a quick break and we'll be right back in a second. We're going to talk about something that a lot of you have asked us about, and that is Abraham and Isaac and exactly what they were doing up on top of that mountain. So let's take a break."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5191.11,"end":5207.43,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5212.47,"end":5281.52,"speaker":"John Maddox","text":"This is an ancient Faith radio public service announcement. The Mental Health Task Force of the assembly of Canonical Orthodox Bishops has recently launched two mental health a National Directory of Orthodox Mental Health Professionals and an Orthodox Mental Health Needs Assessment that are available at www.assemblyofbishops.org. mental Health the Directory of Orthodox Mental Health Professionals features licensed Orthodox Christian clinicians across the US who are available to serve as resources to those seeking mental health care, substance abuse care and or professional consultation. While the Orthodox Mental Health Needs Assessment is an anonymous survey for all Orthodox jurisdictions, clergy and LayPeople across the US the aggregate data from this survey will help the task force better understand and address the mental health needs of Orthodox faithful through the development of ministry resources. Once again, that web address is www.assemblyofbishops.org Mental Health. This has been a public service announcement of Ancient Faith Radio."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5281.6,"end":5297.69,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Daemick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 8-855-AF radio."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5301.77,"end":5363.33,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third part of Lord of Spirits. So we were the third half. The third half. Excuse me. That is correct. It is the third half of Lord of Spirits because this is a show and a half, everybody. So we just finished talking about the promises made to Abraham, and we wrapped it up with the conclusion about what St. Paul has to say about salvation and how that connects to all of that. So now we're going to be talking about Abraham and his son Isaac. And of course, this is an issue that actually we've got a lot of questions about, because when we started talking about sacrifice really explicitly a few months ago, many of you then thought, well, wait, what about Abraham and Isaac? What's going on there? So now we're going to go ahead and talk about Abraham and Isaac, and we're going to begin with St. Paul. So, so, Father, what does St. Paul have to say about this particular, you know, this, this, this, this scene, this image of, of, of Abraham and Isaac."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5364.13,"end":5412.31,"speaker":"Fr Stephen De Young","text":"Right. So there's this, there's this one element left over from those promises that we didn't really focus in on, and that's that over and over again. As you read those, those quotes from Genesis where, where God is reiterating the promises to Abram, the word seed is used. Right. The promises are directed toward his seed. Yeah. And in, in Hebrew, it's ambiguous whether seed is singular or plural because it's a collective noun. Zoraza. Collective noun. So it can be used for singular or for plural. It's sort of like, you know, fish in, in English, you could have one fish, two fish, red fish, blue fish."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5412.31,"end":5429.27,"speaker":"Fr Andrew Stephen Damick","text":"I mean, and, and, and, you know, and seed in English even functions that way. Like we use it both as a collective noun and then also as a singular in our, in English. And it also can function as singular plural. But I was thinking of moose, actually, when you. Yeah. Moose."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5429.27,"end":5430.07,"speaker":"Fr Stephen De Young","text":"Isn't it mees?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5430.47,"end":5430.91,"speaker":"Fr Stephen De Young","text":"It is."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5430.91,"end":5434.23,"speaker":"Fr Andrew Stephen Damick","text":"It is not. It is not. In fact, mees. I know."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5435.44,"end":5462.16,"speaker":"Fr Stephen De Young","text":"False friend there. So there are places in the, in the promises we read where it's very clearly taking a plural form because it will say, for example, talk about his seed, and they will camp in the gates of their enemies. Right. So this is third person Plural. So we know that seed, there is plural."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5462.47,"end":5462.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5462.63,"end":5503.55,"speaker":"Fr Stephen De Young","text":"But there are other places where it's more ambiguous and it could be plural or singular. And there is a preexisting, this predates St. Paul, a pre existing tradition of interpretation that several of these are actually singular. Then in addition to the sort of quantitative promise that we were talking about of having many descendants, that there's also one particular descendant in view through whom these promises will come to fruition for the plural seed, for all of the descendants. Seed and seeds."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5503.71,"end":5504.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5504.91,"end":5528.88,"speaker":"Fr Stephen De Young","text":"And so this tradition of interpretation is reflected in the Greek translation itself of several of these promises. Because in Greek, sperma is. Is not a collective noun. You could, you can decline it as singular or you can decline it as plural."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5528.88,"end":5531.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes, spermata. Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5531.96,"end":5568.1,"speaker":"Fr Stephen De Young","text":"And so they had a choice to make when they translated it and in several cases chose the singular. And St. Paul points to this singular, points to this, for example, in Galatians 3, verse 16, as a, as a sort of key part of his argument when he says that now the promises were made to Abraham and to his offspring, it does not. And this is, of course, seed, Abraham. And to his seed, it does not say and to seeds referring to many, but referring to one and to your seed who is Christ."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5568.5,"end":5579.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. So St. Paul is. He's explicitly using both the singular and plural of the Greek and making a point based on that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5580.34,"end":5589.14,"speaker":"Fr Stephen De Young","text":"Right. So he is treating the Septuagint here as authoritative."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5589.22,"end":5592.18,"speaker":"Fr Andrew Stephen Damick","text":"As an authoritative interpretation of the Hebrew."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5592.58,"end":5620.7,"speaker":"Fr Stephen De Young","text":"Right, right. He's saying this is. And when I say authoritative, it's because he's just pointing to it. And here in Galatians he's arguing with fellow Judeans about the specific application of the Torah. So he clearly expects this Greek translation choice to carry authoritative weight with them. Otherwise this is a pointless argument."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5620.7,"end":5621.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5622,"end":5694.09,"speaker":"Fr Stephen De Young","text":"Because if his fellow Judean Pharisees did not accept those decisions as authoritative, they could just laugh this argument off and say, well, that's not what the Hebrew says. The Hebrew could be plural. Right. And take a different interpretation. But so St. Paul obviously is applying this directly to Christ, right? Saying that Christ is this singular seed. He is the singular son through whom those larger spiritual promises we talked about are now coming to fruition. But before that, this was direct, most directly applied to Isaac, Isaac as the singular son of Abraham, even though Abraham had other children. Right. So by applying it to Isaac, you have both that element of, yes, there are other children, but there is this singular son. There is this singular seed, the singular descendant who is the heir and through whom the other children will receive the inheritance."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5694.25,"end":5711.07,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there this emphasis then on Isaac in particular, which then, I mean, this is going to sort of set us up then, for who is Isaac in terms of how he's understood in Second Temple literature and frankly in the New Testament and the whole Christian tradition. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5711.55,"end":5748.38,"speaker":"Fr Stephen De Young","text":"And St. Paul explicitly uses this whole line of argumentation in Romans 9, right, where he's talking about how the promises were not just evenly generically distributed to all of the biological descendants of Abraham. Right. But that there was a single. And he points to Isaac and he points to Jacob, Jacob and not Esau. Right. Not that, as we were just talking about in terms of the land. Not that Esau and Ishmael and these inherited nothing. Right. But they received the promises through the air, through this singular son."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5748.38,"end":5770.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because of the way that inheritance works in this time and place, which is the heir, who is usually the firstborn son. But as we saw with Jacob and Esau, not always. Right. The heir is the one who inherits everything from the father and then distributes to his brethren and sister of that promise that inheritance given to him."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5771.96,"end":5786.2,"speaker":"Fr Stephen De Young","text":"Right. And so this firstborn is a status, right, that. That you have. And you don't have to have any other children for them to. For the one child, you have to have the firstborn status. Yeah, There are people out there who know why that's important."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5787.16,"end":5787.56,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5790.97,"end":5802.37,"speaker":"Fr Stephen De Young","text":"And in the case of, like you pointed out, Jacob, it doesn't necessarily mean you're the chronologically firstborn. It means you have that status. Yeah, your first birthright, as it's translated in the King James."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5802.37,"end":5860.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because first, I mean, first in Greek, and we use this in English in some ways too. Like first doesn't necessarily mean, as you said, chronologically first. It just means the, you know, the first among them, the one who is preeminent. You know, it's a place, it's not necessarily a time. You know, I mean, there's a relationship between the two. Like liturgically, for instance, the protos is the one who is actually celebrating the. The church service, and then everyone else is his conselebrants. And usually the protos is the one who is the most senior, which is often related to time. Right. Like, if you've been a priest longer than another priest who's of your same rank, then you are the senior between the two. But not necessarily like, so someone could get elevated to a rank higher than a priest who has been senior to him in time, and then he becomes, you know, he would be the appropriate Protos to serve when they were con. Celebrating together."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5862.44,"end":5921.41,"speaker":"Fr Stephen De Young","text":"Right, right. And so this is the thrust of what St. Paul is doing in Romans 9 is that, you know, faced with people who are saying, well we're the children of Abraham, he's saying, yes, but the sort of singular son is Christ. And so if you are not in this relationship of faithfulness with Christ, you're not going to inherit just by virtue of being. Right. A a descendant. But so be. What St. Paul is doing is he's taking a whole set of imagery and understanding and interpretations of Isaac and applying them to Christ. And these Isaac related traditions come out of the text of Genesis and then pre exist. Right. And are developed and then St. Paul takes them to show how. See, this is where, how you connect Christ to this narrative."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5921.41,"end":5937.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Isaac, Isaac becomes then a prefiguration of Christ in this particular way in terms of being the heir, the seed of the promise through whom the promises made to Abraham are then going to be distributed to all the brethren."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5938.35,"end":5942.35,"speaker":"Fr Stephen De Young","text":"Right. And in terms of that sign, prophecy relationship we were talking about."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5943.15,"end":5943.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5943.55,"end":5954.52,"speaker":"Fr Stephen De Young","text":"Then Isaac, the physical son of Abraham and Sarah, Isaac as a person becomes a sort of sign to Abraham of the eventual seed who is coming."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5954.84,"end":5955.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5955.2,"end":5958.04,"speaker":"Fr Stephen De Young","text":"Especially will bring the fulfillment of those spiritual promises."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5958.2,"end":5964.64,"speaker":"Fr Andrew Stephen Damick","text":"Especially because Isaac was not, you know, what to expect when you're not expecting to expect, you know."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5964.64,"end":5965.64,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5966.52,"end":5968.6,"speaker":"Fr Stephen De Young","text":"Isaac was 100, age 90."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5969,"end":5973.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Yeah, he's definitely a sign."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":5974.2,"end":6006.07,"speaker":"Fr Stephen De Young","text":"Right. And so, and this is the, the term that's used that the King James translation in many places, this is not 100% but the Greek word mono yinis is kind of ambiguous and it was interpreted in many places by the King James version somewhat incorrectly in that it was taken to be only begotten pretty much every time it's used."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6006.67,"end":6026.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, I mean, so let's take the word apart for a second and just sort of explain why that might be the case. Because. So you got mono, right. Which is solitary or only or single. And then yenis, which can mean, it can mean your, your child, but it can also mean like a kind, you know, like it's."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6026.23,"end":6037,"speaker":"Fr Stephen De Young","text":"It can mean, it can mean, ye know, there, there are two possible roots for the yanis part. Right. Monos is clear. That's only or one."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6037,"end":6037.96,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6039,"end":6045.32,"speaker":"Fr Stephen De Young","text":"But the yanis can come from yanos, which is like where we get genus."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6045.32,"end":6048.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, and genetics and that kind of thing."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6048.2,"end":6054.76,"speaker":"Fr Stephen De Young","text":"Yeah. Where we get genus. So a kind of type. Right. That it becomes a species kind of idea."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6054.76,"end":6055.08,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6056.28,"end":6062.46,"speaker":"Fr Stephen De Young","text":"Or it could come from the verb yanao, which is to beget. Yeah, Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6062.94,"end":6081.98,"speaker":"Fr Andrew Stephen Damick","text":"Obviously those two words are related to each other. You know, those, those words have a common, have a common root with each other. And actually then our cognate and you know, this is where Richard Roland will write in, if I'm getting this wrong, I'm pretty sure our cognate with English words like kin and kind, actually, these are all, these are all connected."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6082.38,"end":6099.19,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So, so when you put it together to mano yanis, it's depending on the conjugation or the declension. And where it is in a sentence, it could kind of be either in a lot of cases, so either only."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6099.19,"end":6101.75,"speaker":"Fr Andrew Stephen Damick","text":"Begotten or one of a kind."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6102.47,"end":6102.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6102.83,"end":6103.31,"speaker":"Fr Andrew Stephen Damick","text":"Unique."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6103.31,"end":6122.8,"speaker":"Fr Stephen De Young","text":"And so in many places, though, and so the King James. And so because of that, in a lot of people's brains, even people who aren't King James only, like, that's now the traditional thing if they're English speakers. Right. So any questioning of it is questioning tradition."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6123.04,"end":6163.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's worth pointing out that the King James translation, which I love, although again, I'm not a KJV only person, I love it for many reasons, not for every reason, because that's the way it's translated there than a lot of other texts, patristic texts that got translated into English, you know, in say, the 19th century, for instance, which is where the big bunch that were first translated into English came from. They then kind of imitate the King James language in many cases for translations of patristic texts as well, thus carrying forward this English translation. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6164.25,"end":6194.96,"speaker":"Fr Stephen De Young","text":"And so in many cases, mono yanis really should be Translated as unique. John 1 is a case of this, the unique God who is in the bosom of the Father there, for example. But one of the reasons why that unique son would be used is not just to differentiate Christ as the Son of God from other beings who are called sons of God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6195.12,"end":6195.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6195.48,"end":6224.89,"speaker":"Fr Stephen De Young","text":"That's one reason. But then also on the other side, to connect to this tradition of Isaac as the unique son in terms of the relationship to Abraham. And so you can't. This is a general translation thing, and this is a problem sometimes when people try to work with languages they don't know that well, like using a concordance or that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6225.05,"end":6239.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you can't just, I mean, I, you know, you can't just look a word up in your dictionary and assume that the first thing that it says, or Even maybe all 10 things that it might say in an entry are, are the right thing for whatever it is that you're trying to read or translate."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6239.45,"end":6239.77,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6239.77,"end":6241.69,"speaker":"Fr Stephen De Young","text":"And then just go and plug it in everywhere."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6241.98,"end":6242.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6242.14,"end":6290.51,"speaker":"Fr Stephen De Young","text":"And it must be the same thing in all these places, and all these passages must be connected. That's. That's not true. Right. You have to go by what's being said in each case. So sometimes. And that's where it becomes clear how mono Yunis is being used. Sometimes it's very clear. It means that it's only begotten. And that's the idea. Sometimes it's very clear that it's unique in the sense of differentiating Christ from the angels. Right. And other sons of God. And sometimes it's pretty clear that it's. It's connected to these. These Isaac traditions. And. And those traditions were. This is a less common icon now, for reasons we're about to describe, but they were reflected in some of our iconography."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6291.47,"end":6291.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6292.75,"end":6300.39,"speaker":"Fr Stephen De Young","text":"In. In the form of what was called many centuries ago the paternity icon."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6300.71,"end":6321.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is an icon. Like there's two versions of this. There's the sort of more ancient and dare I say, authentic icon where you've got Abraham as an old man and then in his lap is Isaac as a young. You know, a young child. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6321.6,"end":6326.6,"speaker":"Fr Stephen De Young","text":"And it's sort of parallel to the icons you would see of the Theotokos with Christ on her lap."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6326.6,"end":6381.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Exactly the same basic look. And then there are also. Then. I don't know enough about iconography to say whether they are explicitly uncanonical, but certainly a kind of unconventional, for sure icon. You know, a quote, unquote, Holy Trinity icon where you see the Father depicted as an old man, Christ depicted as a child, and then sometimes in his lap, a bird for the Holy Spirit. Certainly that icon is controversial and from what I understand, probably uncanonical, but I am, again, not an iconographer or an expert on iconography. But don't him. Yeah, yeah. Don't me. But the point being that there are canonical, you know, versions of that that are expressing something that. That is uncontroversial. You know, Abraham and Isaac and the."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6381.31,"end":6386.11,"speaker":"Fr Stephen De Young","text":"Controversial ones seem to be in a line of dissent from the uncontroversial ones."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6386.11,"end":6386.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6386.39,"end":6389.23,"speaker":"Fr Stephen De Young","text":"That the Abraham and Isaac icons were."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6389.23,"end":6390.23,"speaker":"Fr Stephen De Young","text":"Intended to sort of."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6390.23,"end":6401.43,"speaker":"Fr Stephen De Young","text":"In the way that Saint Andre Rublev's Trinity icon is meant to convey the Holy Trinity but not depict the Holy Trinity."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6401.43,"end":6401.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6401.67,"end":6404.43,"speaker":"Fr Stephen De Young","text":"Kind of showing the hospitality of Abraham, in a sense."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6404.43,"end":6423.06,"speaker":"Fr Andrew Stephen Damick","text":"An icon of an icon. Right. That Abraham and Isaac as persons are icons relating to the Father and the Son. And then we make an icon of that of them being that. So it becomes very meta."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6424.18,"end":6455.5,"speaker":"Fr Stephen De Young","text":"Yeah. And in the same way that you will occasionally have people slip a little bit, not quite understand, and say that the. That Christ and the two angels in the Rublev Trinity icon are, you know, well, this is the Holy Spirit and this is the. Well, we know that's not accurate, right. That it's. It's an icon situation. The same thing happened centuries ago with the paternity icons where they. The represent slipped out. People just started saying, oh, well, this is the Father and Christ."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6455.58,"end":6493.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Okay. So we've kind of established what Isaac's place is, but within his story, I mean, he shows up. He shows up like in Jacob's story. But within his story, in scripture, what is he actually doing? What is he accomplishing? There's kind of two things. Right. So the one that everybody immediately goes to, thinks about first, which is totally appropriate, is the sacrifice of Isaac. You know, the sort of attempted sacrifice of Isaac by Abraham. Right. Yeah. I know. It's funny. We call it the sacrifice of Isaac. I'm like, actually, he doesn't get sacrificed, but by the way. But. And then also he gets sort of does."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6493.65,"end":6494.57,"speaker":"Fr Stephen De Young","text":"He sort of does."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6494.57,"end":6495.33,"speaker":"Fr Stephen De Young","text":"Symbolically."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6495.33,"end":6495.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6495.77,"end":6496.37,"speaker":"Fr Stephen De Young","text":"Talk about that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6496.45,"end":6497.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6497.09,"end":6497.49,"speaker":"Fr Stephen De Young","text":"He's."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6497.49,"end":6533.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly. Yeah. And then the other thing is that he gets married, Right. Which, you know, if you've ever been to an Orthodox wedding service, you know that this gets invoked. Blessed on the Lord as thou does, bless Isaac and Rebecca among other, you know, couples in the scripture that are mentioned. So, I mean, let's talk about that first, because the sacrifice is the much bigger elephant in the room, I guess. Yeah. So what's going on? What's going on with the wedding to Rebecca? I mean, what does that mean other than just, oh, hey, Isaac needed to get married so that he could have kids so that this whole big descendants thing could happen. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6533.94,"end":6537.3,"speaker":"Fr Stephen De Young","text":"And he married a Mesopotamian rather than a Canaanite."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6537.54,"end":6537.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6539.54,"end":6548.11,"speaker":"Fr Stephen De Young","text":"They go back to his people. And Abraham going back to his own people actually, in this case means Isaac is married to his first cousin."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6548.19,"end":6549.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6549.79,"end":6566.67,"speaker":"Fr Stephen De Young","text":"But, yeah, that's not the point. It's not about cousin marriage. It is interesting because of what it says. And what it says is something that we gloss over very quickly as sort of modern Western people who have."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6566.67,"end":6567.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6567.62,"end":6570.74,"speaker":"Fr Stephen De Young","text":"Deeply imbibed the idea of romantic love."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6571.62,"end":6581.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It says, and Isaac loved Rebecca, which. That's, you know, that's kind of not even worth mentioning these days."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6581.06,"end":6582.98,"speaker":"Fr Stephen De Young","text":"Of course I got married."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6582.98,"end":6597.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, of course. I mean, he must have loved her. But, like, that was not that. That what is unremarkable now was totally remarkable then. The idea that a husband should love his wife was just not even on the radar. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6597.4,"end":6606.2,"speaker":"Fr Stephen De Young","text":"Yeah. And it was an arranged marriage. I mean, that's the greater part of the story, is that marriage being arranged by Abraham through one of his servants."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6606.44,"end":6614.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There's no point where Isaac says with his brother. There's no point where Isaac is like, I hope I meet somebody. You know, maybe we'll click."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6615.4,"end":6644,"speaker":"Fr Stephen De Young","text":"Yeah. They don't run into each other and find out they have a lot of the same hobbies, grew up watching the same TV shows. Yeah. So why is that important? Well, it's not just that that's rare in the ancient world, that expression of love, but it's rare in the book of Genesis. Right. This is. I mean, you do have Adam and Eve in a monogamous marriage sort of. I mean, marriage."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6644,"end":6644.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6644.72,"end":6647.69,"speaker":"Fr Stephen De Young","text":"But it's kind of dysfunctional."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6648.65,"end":6655.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. We don't really see much about the marriage of Adam and Eve that looks that great. I mean, we don't see most of it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6656.01,"end":6656.37,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6656.37,"end":6658.81,"speaker":"Fr Andrew Stephen Damick","text":"We just kind of see the bad. Mostly the bad parts, actually."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6659.45,"end":6664.09,"speaker":"Fr Stephen De Young","text":"Right. But you even look at Abraham and he's got concubines."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6664.73,"end":6665.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6665.29,"end":6695.32,"speaker":"Fr Stephen De Young","text":"He's got. And Jacob has, you know, two wives and a couple of concubines. All that he has kids with. Esau's marrying pagans. And on and on. Right, on and on. You have Reuben trying to sleep with one of his father's concubines. I mean. Right. So you don't get a lot of solid monogamous marriages in Genesis outside of Isaac and Rebecca."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6695.48,"end":6695.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6696.84,"end":6734.08,"speaker":"Fr Stephen De Young","text":"And so they serve as this sort of icon of. They're the ones in Genesis who do it the way God intended it. Right. I say that's the way God intended it because Christ says that's how God intended it in the Gospels. But that's the image of doing it. Right. And so we have this then, this pattern that after the story, we're about to talk about the sacrifice of Isaac that you then have, then he then gets married. These are the two. This is Isaac's life as his story is presented."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6734.08,"end":6734.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6734.44,"end":6736.76,"speaker":"Fr Stephen De Young","text":"Episode of sacrifice and then his marriage. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6736.76,"end":6751.04,"speaker":"Fr Andrew Stephen Damick","text":"And. Yeah, yeah. And it's important to note the sequence. You know, he. He is offered up and then he gets married. So just hold. Hold that in your mind and. And, you know, let's talk about the sacrifice now. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6751.91,"end":6752.71,"speaker":"Fr Stephen De Young","text":"By popular demand."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6752.79,"end":6756.07,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6760.63,"end":6786.62,"speaker":"Fr Stephen De Young","text":"When we read it Today, and this is partially Soren Kierkegaard's fault. So something was rotten in the state of Denmark, and it ended up kind of fiddling with how we read this story. So we, as wider people, we read the story of Abraham and, And the sacrifice of Isaac. We approach it from Abraham's perspective. Abraham is the character into which we insert ourselves."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6786.62,"end":6811.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The big question being then is, okay, if I'm Abraham and I hear a voice from God saying, okay, go offer your son and kill him and sacrifice him to me, and, you know, especially, you know, listeners to this, this podcast will then think the next thing and wait, am I supposed to eat him? You know, that's. That's the big moral quandary. Right. Like, to kill or not to kill."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6813.15,"end":6813.47,"speaker":"Fr Stephen De Young","text":"What?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6813.47,"end":6814.67,"speaker":"Fr Stephen De Young","text":"You know, by the way, since."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6814.67,"end":6816.35,"speaker":"Fr Stephen De Young","text":"Since he brought all the kindling."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6818.59,"end":6818.91,"speaker":"Fr Stephen De Young","text":"This."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6818.91,"end":6822.11,"speaker":"Fr Stephen De Young","text":"Is the whole kindling issue. Presumably it would have been a whole burn offering."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6822.11,"end":6822.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6822.35,"end":6825.31,"speaker":"Fr Stephen De Young","text":"Just to ease people's minds. He was not thinking about eating Isaac."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6825.39,"end":6825.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6826.51,"end":6827.51,"speaker":"Fr Stephen De Young","text":"That was not the plan."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6827.51,"end":6835.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's, you know, as we've said, there's multiple kinds of sacrifices, and while some of them do involve eating on the part of the people, not all of them do."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6836.06,"end":6838.14,"speaker":"Fr Stephen De Young","text":"Right. So you give the whole thing to God."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6838.3,"end":6881.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right. Yeah. But, but, but then. Then that's not actually the. The angle that Second Temple literature, again, this tradition that exists around the time of the apostles, that's not the way that they tend to look at it. They don't tend to look at it as like, oh, what should Abraham do? You know, how faithful is it a moral dilemma? Yeah. How faithful is he gonna be Abraham's trolley problem? Right. Which, I mean, like, it's not that. That's not an interesting question. Right? It is. Yeah. Yeah. It's not like we shouldn't ever talk about that or whatever, but that the main focus actually is on Isaac. What is Isaac doing as Isaac as the main character in this scene?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6881.18,"end":6882.74,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6882.74,"end":6883.3,"speaker":"Fr Stephen De Young","text":"And that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6883.38,"end":6915.54,"speaker":"Fr Stephen De Young","text":"That the idea was to view the event from the perspective of Isaac. And when you do that, there are several things that sort of emerge. The first and foremost, the one that's the constant source of meditations, not only in sort of Second Temple literature proper, but in prayers from that period that we have preserved. This becomes a major, major emphasis and a way of interpreting other parts of the Old Testament, that they focus on Isaac's silence."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6916.82,"end":6917.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6917.78,"end":6931.06,"speaker":"Fr Stephen De Young","text":"That. That most of us, you know, if someone was trying to tie us up and kill us, would be kicking and screaming. And even if it Was our dad."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6931.06,"end":6940.14,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Reasonable, Reasonable behavior. But yeah, so he's, he's, he's quiet. He asks, you know, he asks a question. But, but that's pretty much it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6940.94,"end":6947.9,"speaker":"Fr Stephen De Young","text":"Yeah. On the way he asks, you know, hey, where are we going to get. You know. But then."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6947.98,"end":6948.46,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6948.54,"end":6964.3,"speaker":"Fr Stephen De Young","text":"And so that silence we talked about in the sacrifice episode that we just answered a couple callers about, we talked about how there was. We find this tradition in sacrifices where the animal sort of voluntarily offers itself."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6964.77,"end":6965.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":6966.13,"end":7025.4,"speaker":"Fr Stephen De Young","text":"And that's how this silence, the silence of Isaac was understood in this, in this context. So that his silence becomes emblematic of obedience and self offering. And that is so firmly embedded by the, by the second Temple period is an understanding of Isaac that the most common interpretation of the suffering servant in Isaiah, all of those passages as a sheep led to the slaughter. Right. As a. Openeth not his mouth. All of those texts, all the texts about the suffering servant were interpreted as being initially about Isaac. Right. Sort of immediately as meditations on Isaac. And there are prayers that we have preserved that I mentioned that are prayed sort of from the perspective of Isaac."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7025.56,"end":7026.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7027.08,"end":7040.92,"speaker":"Fr Stephen De Young","text":"From the, from the second Temple period. And those prayers are interesting because they're hugely controversial because a whole bunch of people want to insist that they have to be Christian."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7041.24,"end":7044.44,"speaker":"Fr Andrew Stephen Damick","text":"Huh. But they're actually before Christ."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7045.4,"end":7049.8,"speaker":"Fr Stephen De Young","text":"Right. Because the way they portray Isaac is so close to early Christian."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7049.96,"end":7050.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7051.25,"end":7062.25,"speaker":"Fr Stephen De Young","text":"Devotion meditation on the death of Christ. That and that Isaiah imagery that they're like, there's no way. But this was being done with Isaac."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7062.25,"end":7067.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I mean, out of curiosity, what texts would you look in to find those prayers?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7069.33,"end":7080.09,"speaker":"Fr Stephen De Young","text":"Well, you'd have to find a very obscure book called Prayers Supposed to be Jewish, published by the Society of Biblical Literature."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7080.09,"end":7081.25,"speaker":"Fr Andrew Stephen Damick","text":"Wow, what a title."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7082.42,"end":7082.74,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7084.42,"end":7085.94,"speaker":"Fr Andrew Stephen Damick","text":"They're supposed to be Jewish."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7086.34,"end":7088.66,"speaker":"Fr Stephen De Young","text":"That's sort of compiling the whole argument."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7088.82,"end":7089.22,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7089.22,"end":7089.9,"speaker":"Fr Stephen De Young","text":"Back and forth."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7089.9,"end":7091.06,"speaker":"Fr Andrew Stephen Damick","text":"That's interesting about."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7091.38,"end":7125.17,"speaker":"Fr Stephen De Young","text":"Yeah, but yeah, so, so Isaac and yes, it is also true that those texts in Isaiah were understood to be talking about the Messiah. And this is true not only pre Christian, but even in Rabbinic Judaism. You could go all the way to Maimonides in the medieval period was still saying that that was about the Messiah. People may be familiar with the more modern Rabbinic Jewish interpretation that that's talking about Israel."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7125.41,"end":7126.25,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7126.25,"end":7198.9,"speaker":"Fr Stephen De Young","text":"Not talking about the Messiah because sort of all messianism has been purged from Rabbinic Judaism or close to it by this point in reaction to Christianity. But even in the Middle Ages that was all the Messiah. But in all of Those cases, they're still going through Isaac to get there. Right. So understanding that as the Messiah, they were understanding that I, this is talking about Isaac, but that Isaac is an image of the Messiah who is, who is coming. And even with the people of Israel, they're, they're, they're really, even in that modern interpretation, they're kind of going through Isaac as representative of Israel. Right. As the forefather, the patriarch of, of Israel being the singular person in that. Yeah, in that, in that text. Right. So it's kind of unavoidable. It's so embedded in Old Testament interpretation and understanding. So then the other big thing that gets talked about here is certain folks, they know who they are, get a little giddy about this story. Because of the ram in the thicket."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7198.98,"end":7200.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7200.18,"end":7204.58,"speaker":"Fr Stephen De Young","text":"Because they think, oh, this is where I could get my substitutionary atonement back in here."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7204.58,"end":7269.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And for those who don't, who maybe not know what that means, substitutionary atonement. It's the idea that comes largely out of the Reformation, that mankind, because of his sins, deserves punishment from God. And so you're born with a sentence of punishment. And then Jesus steps in and says, no, wait, I'll take that punishment, give it to me instead. Because God has to punish sin. God has to be satisfied because of sin. And so this is called substitutionary atonement. So then people look at the sacrifice of Isaac scene and they see the ram that's in the thicket. It's like, okay, that ram, that's Jesus, who's going to step in and take this so that Isaac doesn't have to. Although, I mean, there's all kinds of issues other than just what we're about to talk about in terms of just on its face, it's like, wait, what did Isaac do that he has to be sacrificed as the response."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7270.92,"end":7273.96,"speaker":"Fr Stephen De Young","text":"Where does it say that Isaac is a sin offering?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7274.62,"end":7293.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, yeah. Which goes completely against the whole system of the way. I mean, you know, you don't have the whole Torah yet. Right. But yeah, yeah. So, yeah, just internally it has problems, but actually there's way more going on here."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7293.54,"end":7294.58,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7294.58,"end":7305.98,"speaker":"Fr Stephen De Young","text":"There is something positive going on with the ram that you miss if you go, try to go that direction and just to save you some. Actually. Right. What you were describing coming out of the Reformation is really penal substitution."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7305.98,"end":7307.34,"speaker":"Fr Andrew Stephen Damick","text":"Penal. Excuse me. Yes, yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7307.34,"end":7312.86,"speaker":"Fr Stephen De Young","text":"Which evolves out of satisfaction theory, which has some of those elements. It's usually associated with Anselm."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7313.02,"end":7313.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7313.38,"end":7321.82,"speaker":"Fr Stephen De Young","text":"Five centuries earlier. But this, this Western development of the Idea of substitutionary atonement, of which penal substitution is a species particular case."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7321.82,"end":7333.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Because, I mean, we don't have to go into it, but. But the idea that Christ is a substitute is a thing in patristic commentary. But. But not in certain ways. In this way. Right, exactly. Exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7333.06,"end":7346.46,"speaker":"Fr Stephen De Young","text":"Right. So what's going on with the ram? And the problem is that the presupposition here is that you're coming to it with a presupposition that something has to die and that's the reason why the ram is there."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7346.46,"end":7347.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7347.62,"end":7355.78,"speaker":"Fr Stephen De Young","text":"Right. Isaac has to die. Well, if Isaac isn't going to die, that there's some necessity here. And therefore if Isaac doesn't die, something else has to die in his place."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7356.34,"end":7356.54,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7356.54,"end":7358.66,"speaker":"Fr Stephen De Young","text":"We must have blood for the blood God. Right?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7360.34,"end":7362.34,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7362.58,"end":7390.11,"speaker":"Fr Stephen De Young","text":"That's right. And that presupposition is nowhere in Genesis up to this point. We'll just leave it at that. Right, right. There's nowhere where a reader of Genesis would get that without completely importing it. So where we get at the importance of what's going on here with the ram and why the ram is being offered as a thank offering is the location where this takes place."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7390.51,"end":7390.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7391.07,"end":7410.11,"speaker":"Fr Stephen De Young","text":"So the location where this takes place, the. The mountain to the top of which, the high place to which Abraham takes Isaac to sacrifice him is Mount Moriah. Right, Mount Moriah. And that name literally means the place where Yahweh appears."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7410.11,"end":7412.59,"speaker":"Fr Andrew Stephen Damick","text":"Right, You've got that. Yeah, There on the end."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7413.03,"end":7432.47,"speaker":"Fr Stephen De Young","text":"Yeah, the place where Yahweh appears. So it is not coincidental that this mountain is the mountain where the temple is later built, because the temple is the place where Yahweh appears on the day of atonement."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7432.95,"end":7433.67,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7433.75,"end":7434.07,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7434.07,"end":7488.93,"speaker":"Fr Stephen De Young","text":"We've talked about that at length. Right. That's why they had to. To offer the cloud of incense. And so this isn't just the place where Abraham offers this ram this one time. This is the place where all of the future rams, all of the future bulls, all of the future that are legitimate offerings to Yahweh, as he has said, he desires to be worshiped. This is the place where all of those are going to be offered in the future. Future, Right, right. And so there is a kind of substitution here in the sense that all of these animal sacrifices that are going to take place on this mountain are a substitute for the sacrifice of the unique son."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7489.41,"end":7519.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the substitute actually goes the other way than the penal substitution theory. And so in a very clear sense, then the rams begin to be offered at this point, until such time as the Mono yenis, the unique son Isaac, in his fulfillment, who is Jesus Christ, will be offered."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7520.07,"end":7537.62,"speaker":"Fr Stephen De Young","text":"Right. And so this is why very quickly, very quickly, almost immediately in the New Testament period among the apostles, they stopped sacrificing animals. Right. That's how they understand that as being fulfilled."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7538.66,"end":7539.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7539.06,"end":7554.05,"speaker":"Fr Stephen De Young","text":"The, the, the animal sacrifices, there were, the sin offerings, there were a, a fill in, a substitute for the real thing, a shadow of the real thing, an image of the real thing."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7554.53,"end":7554.93,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7555.33,"end":7589.43,"speaker":"Fr Stephen De Young","text":"And so when the real thing came, you don't need those pointers anymore. But the first pointer is Isaac himself, Right. That it's going to be the unique son who's going to, to fulfill it. And there's one place in the New Testament where there's a sort of meditation on the story of Isaac in general and his relation to the promises, and especially this episode of the sacrifice of Isaac. Directly, a direct, clear reference."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7589.43,"end":7647.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this basically summarizes together in one fairly short passage everything we've just said for this whole episode. Right? Yeah. So this is in Hebrews 11:16, 19. This is what St. Paul writes there. But as it is, they desire a better country, that is a heavenly one. Therefore, God is not ashamed to be called their God, for he has prepared for them a city by faith. Abraham, when he was tested, offered up Isaac, and he who had received the promises was in the act of offering up his only son, of whom it was said, through Isaac, shall your seed be named. He considered that God was able even to raise him from the dead, from which, figuratively speaking, he did receive him back. So what's going on here?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7648.51,"end":7733.12,"speaker":"Fr Stephen De Young","text":"Right, so, well, first, at the beginning there in what's Hebrews 11:16, there's a pointer to this idea we were talking about in the last act in our second half about the idea that the physical land was this sign of the fulfillment of the rest of the promises to Abraham. But then it immediately goes to the fact that those greater promises are going to be received through Isaac. And specifically now it focuses on this, this offering of his only son, through whom his seed would be named. So this is the singular son. This is who the promises are going to come through. And Abraham's being told to now kill him. And so there's this obvious immediate tension there. Right. And so that tension is resolved here in St. Paul's Epistle to the Hebrews by pointing out that Arab had in his head that God was able to raise him from the dead. Right. Which happens by way of a figure, by way of a Symbol by way of a sign."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7733.52,"end":7760.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's worth pointing out here too, by the way, that the word monoyenis is used here to refer to Isaac in this passage. St. Paul uses that word, but we couldn't understand it here. So this is an example of where we can't understand Moni ennis, meaning only begotten. Because Isaac is not Abraham's only begotten son. He's got, in fact, an older brother, Ishmael."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7760.5,"end":7760.86,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7760.86,"end":7763.1,"speaker":"Fr Stephen De Young","text":"He's Sarah's only begotten, but not Abraham's."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7763.1,"end":7773.37,"speaker":"Fr Andrew Stephen Damick","text":"But not Abraham's. Yeah, so. So the only way to read it in this passage is being the, the unique son, the one who is uniquely his son in this particular way."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7774.49,"end":7826.38,"speaker":"Fr Stephen De Young","text":"Right. And so what here Abraham is said to understand is that he is going to receive those promises through the death and resurrection of the unique son. And what happens on that mountain with Isaac is the figure, the symbol, the sign of, of that reality which then manifests itself in our human experience in the person of Jesus Christ in his death, resurrection, ascension. Right. And of course, his incarnation as a whole. That is the means by which those spiritual promises that. And Hebrews is saying Abraham realized that."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7826.62,"end":7827.1,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7828.54,"end":7831.18,"speaker":"Fr Stephen De Young","text":"Abraham realized that through the sign."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7831.58,"end":7855.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's really cool. Sorry, I just have to say that. I mean, I, I mean, I've, you know, I've read this passage my whole life, but. And you know, the idea that this has something to do with Christ, you know. Sure. Okay. You know, there's that, you know, God was able to raise him from the dead. You know, he even says that. But, but just to hear it all kind of brought together like that is, Is just really, really beautiful. Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7857.6,"end":7916.9,"speaker":"Fr Stephen De Young","text":"Yeah. And so that kind of manifests itself in various other ways at other parts of the New Testament. Right. So when, when Christ is talking to the Sadducees about the resurrection. Right. And they of course, do not believe in it. They do not believe the anastasis is going to happen. What does he say to prove it? He says God says he's the God of Abraham, Isaac and Jacob. He's not the God of the dead, but of the living. Right. Meaning he's saying Abraham, Isaac and Jacob have already participated in the resurrection, what St. John will call the first resurrection. Meaning Abraham, Isaac and Jacob had received those spirit, those promises at the spiritual level. They had received that theosis at deification. Right. And we're now. And this is why you usually. This is why you see Abraham depicted in paradise."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7917.78,"end":7918.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7919.54,"end":7934.41,"speaker":"Fr Stephen De Young","text":"In, in, in iconography. And then this is this is mostly a plug here as. As we draw our third half to a close. You should read for Ezra."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7936.01,"end":7936.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7936.73,"end":7938.89,"speaker":"Fr Stephen De Young","text":"Everyone, including Father Andrew."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7938.97,"end":7939.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7943.13,"end":7945.53,"speaker":"Fr Stephen De Young","text":"If you're a Slav, it's in your Bible."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7945.85,"end":7956.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is one of the little differences of the Old Testament canon within the Orthodox Church. The Russian canon has fourth Ezra, but the Greek canon does not."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7957.85,"end":7965.61,"speaker":"Fr Stephen De Young","text":"Yeah. And now someone will try to actually us by saying it's in an appendix. And I will say, okay, what's the canonical status of an appendix?"}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7967.45,"end":7968.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7968.81,"end":7969.53,"speaker":"Fr Stephen De Young","text":"It's in there."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7969.53,"end":7971.29,"speaker":"Fr Stephen De Young","text":"It's in the book. That's all I'm saying."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7971.93,"end":7972.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7972.37,"end":7974.01,"speaker":"Fr Stephen De Young","text":"And that means you should probably read it."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7974.01,"end":7975.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7975.37,"end":7975.93,"speaker":"Fr Stephen De Young","text":"So why."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7976.17,"end":7977.77,"speaker":"Fr Andrew Stephen Damick","text":"Why read 4th Ezra with regards to."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":7977.77,"end":8103.67,"speaker":"Fr Stephen De Young","text":"All of this in this context? One of the. One of the. The book is a series of visions that Ezra has. Ezra the scribe. Like the book of Ezra Ezra, or first and second Esdras, depending on how you number those. Anyway, that Ezra. That Ezra has. And one of them is this vision of the bridegroom that's sort of a parable of the bridegroom. And all of the bridegroom imagery that you see in the New Testament is not taken from 4 Ezra. For Ezra was written too late from that. But it's sort of drawing on the same wells, it's drawing on the same traditions. And so it gives us a glimpse of this. And in it, the bridegroom comes to consummate his. His marriage. And then as he crosses the threshold to. To enter into the bridal chamber and consummate his marriage, he dies. And then there is this mourning that takes place by the people for the bridegroom who died right before he could consummate his marriage. And not only are a number of the parables regarding bridegrooms and Christian portrayal as a bridegroom in the New Testament drawing on some of these same traditions, but especially that mourning for the bridegroom, once you're familiar with it, a lot of what goes on in bridegroom matins and the fact that it's called bridegroom matins at the beginning of Holy Week starts to make a lot of sense because this is. This is that arc that we see in the story of Isaac as a person, when he gets his own story in Genesis, his death and resurrection, and then his. The consummation of his marriage, this sort of idealized iconographic marriage, which of course, everyone would say, oh, well, that marriage points to Christ in the church."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8103.91,"end":8104.99,"speaker":"Fr Stephen De Young","text":"Exactly, exactly."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8104.99,"end":8107.03,"speaker":"Fr Stephen De Young","text":"So does the death and resurrection of Christ."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8107.43,"end":8107.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8108.23,"end":8113.31,"speaker":"Fr Stephen De Young","text":"Death, resurrection of Christ, and then the Consummation of his. Of his marriage to the church."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8113.31,"end":8301.03,"speaker":"Fr Andrew Stephen Damick","text":"That's cool. Yeah. All right, well, just to make some final comments, one of the things that's most valuable to me about everything that we just discussed is one of the kind of meta points of this podcast, which is to try as much as possible to give people a framework within which to understand the whole scripture, right? And then if you understand scripture, you understand Christianity truly, right? If you understand scripture in the right way. And there's multiple ways to do that. So, like, one of the ways, the ark that we chose for this episode is the ark of the story of Abraham. So you've got, you know, Abraham being called out of this. This civilization that is dominated by demons and that he is given promises by God that his descendants would be as the stars, that they would also be numerous, right? That they would receive this land, you know, that they would displace the dark powers, right? All of these promises given to Abraham and then fulfilled through his seed, which in sort of the meantime is Isaac, and then ultimately is Christ, whom then we see, you know, fulfilling what Isaac did, which is who symbolically dies and comes back to life and then is married. Christ truly dies, comes back to life, and then his marriage to the church. So I think this is one of the big arcs. And you might ask the question, well, what's the point in trying to understand the scripture in this way? Well, there's a couple of things that I want to say. Number one, if you understand large arcs of scripture, again, this is not the only one, right? There are multiple arcs that you can use to understand the whole scriptures. But if you understand the large arcs, then actually, then it gives. It makes it easier to understand particular passages as you're reading it. Again, we're trying to point people towards reading the scripture for themselves. And then it makes a lot more sense then, because it's easy kind of get lost in the weeds in scripture if you don't have the plot, so to speak. Now, there's several plots going on, so if you know particular ones, then you can see it more clearly. But aside just from that sort of logistical advantage to being able to read the Bible, better understanding what scripture says helps us to understand who Christ is and what he accomplished, right? And then also then what he expects from us. And this is what the proclamation of the gospel actually is. So we certainly receive the gospel in an initial way and we believe it, and we choose to become faithful to God in response. But we need to be continuously re. Evangelized. I need to receive the gospel, not just sort of over and over, but more and more deeply so that I can be more faithful, so that I can know who Christ is, what he accomplished, what he expects of me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8301.18,"end":8301.42,"speaker":"Fr Stephen De Young","text":"Me."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8301.9,"end":8358.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think that the story of Abraham, as continued then in Isaac and then fulfilled in Christ is really a powerful, powerful way to receive the gospel. And you know, knowing this story, then it's also a powerful way to preach the gospel to people. You know, the whole gospel message is contained within this ark that you see in Scripture. Right. So this is all very practical. Yes. You don't necessarily need to preach the gospel by telling people about, you know, the fact that there's three dynasties of Ur, but really there's only two. Like that's not a critical detail. Right. But nonetheless, having this sense of where Abraham comes from and then all the rest, that is a very powerful way of preaching the gospel. So that's, that's, that's my primary takeaway. Father STEPHEN."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8360.62,"end":8487.08,"speaker":"Fr Stephen De Young","text":"So we had a, we had a caller tonight asking about sacramental living. And I think what I want to kind of focus on for a minute is this relationship that we talked about between sign and prophecy, between sign and the things signified, between the material and immediate sign, and then the greater spiritual fulfillment, spiritual reality, because that's the core of, of what sacramental or I guess mysterious would be the, our super orthodox version. What, that, what that is getting at. Right. That, that, that there is a complete union between the sign and the thing signified between the two. But it's very uncommon for us as modern Western people to keep that union in our brain for very long. And there's lots of places where this can go sideways. So on one side you have the more materialist side, where the focus shifts almost entirely to the material side, until sometimes that's sort of functionally, even if you don't come out and say that you're denying the reality of the spiritual, functionally, you're only interacting on the material side. This takes lots of forms. We already took a mean spirited shot at our poor dispensational friends earlier for, for focusing on the sign part, the physical land part of Abraham's promises, rather than on the spiritual side. But this is far more extensive than that in religious life in North America. The idea that Christianity gets reduced to like a prosperity gospel or even among people who are more mainstream in terms of their theology."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8487.65,"end":8487.77,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8487.77,"end":8732.95,"speaker":"Fr Stephen De Young","text":"On the conservative side, it's very easy for Christianity to get reduced to a kind of private or personal morality. I don't do certain things Because I'm a Christian and I do a couple of things, but not many like go to church, right? But I don't do a bunch of my personal morality. That's, that's what I'm doing to be a Christian. And then on the more liberal side, it gets reduced to a kind of more corporate or community morality, more social justice kind of morality where we're doing good in the world, and that's what it means to be a Christian is to go and do these good things in this world and that's it. Or you can go in the other direction where you begin to ignore the material. And this may be a temptation that, that maybe we experience more as orthodox Christians where we want to talk about theosis all the time and, and prayer rules and contemplative prayer and hesitant. And where we shift away that material, we shift away the sign completely. We ignore the sign and we want to go just straight to the spiritual, as if we can just sort of dive into it and comprehend it without, without the material sign or participate in it without the material sign. And so then, you know, we, we sort of don't care about the fact that we drove past five homeless people on, on the way to church because we're going to church and we're going to celebrate the liturgy and have these great feelings of the presence of Christ and the Holy Spirit and we're going to receive the sacraments. Not that any of those things are bad. It's just we're ignoring a whole other field and, and the truth and the reality of Christianity is found in. So he said that sacramental level of realizing that those are the same thing. So when Christ went and fed people, when Christ went and healed people of physical illnesses, right, Those same people were going to die of something else later. But when he. He healed the sick, he healed the paralyzed, he healed the disabled, he fed people. Those were signs of the coming of the kingdom. Those were, were concrete actions and experiences that made the kingdom and made the gospel and made who Christ was in his promises real to those people, just as the gospel became real to Abraham, as he actually stood on a mountain ready to kill his son, but received him back alive. And so this is, this is the place where we need to go when we start to, as modern people as we're prone to have doubts about the spiritual side. Is this spiritual stuff really true? The whole doctrine of the Holy Trinity is fun to argue about online, but is it true? Are these things real? You will find they're real when you start participating in the signs of their reality. When you start giving a cup of water to one of Christ's little ones in his name, not that that is an end in itself. Not that that is a good work that's going to earn you salvation or something, but that is the place when you show love for someone. That's the place where you will experience Christ's love and it will become real to you. All of these things become real through those signs and our behavior and actions in this world toward other people at an individual level and at a community level, at a social level and privately, by ourselves, with our families, with our communities, with our church out in public, this is where we have endless opportunities to actively participate in and see the reality of the spiritual through the physical and the material and our own lives and the lives of other people."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8733.75,"end":8756.86,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, so this was our anniversary episode. It's been a whole year of Lord of Spirits. We estimate that we actually now have about 12,000 regular listeners, which, I mean, that's just amazing. We're so grateful you're here. Occasionally we get asked if we're planning to wrap up the show soon, but actually we've got a pretty endless list of ideas, so. Onward and upward, Excelsior."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8757.58,"end":8769.82,"speaker":"Fr Stephen De Young","text":"I am Jack the King Kirby in this, this analogy. And so I accept it. But I'm also here for, you know, you may be here for the 12,000 regular listeners. I'm here for all the irregular ones."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8772.14,"end":8793.03,"speaker":"Fr Andrew Stephen Damick","text":"That is our show for today. Thank you very much everyone for listening. If you didn't get a chance to call in during this live broadcast, we'd love to hear from you, either via email at Lord of Spirits or you can message us at our Lord of Spirits podcast Facebook page. We do read everything, but we can't respond to everything. And we do save some of what you send for possible use in future episodes."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8793.27,"end":8800.15,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8800.15,"end":8811.75,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, you can like our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it or hate."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8811.75,"end":8820.31,"speaker":"Fr Stephen De Young","text":"Listen to it regularly. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8820.31,"end":8829.87,"speaker":"Fr Andrew Stephen Damick","text":"On the air and buy my new book, Arise, O God, and also Father Stephen's book Religion of the Apostles at store.ancient faith.com thank you, good night, and God bless you."}
{"episode_id":"LOS - #027 - 2021-09-10 - From Ur of the Chaldeans","start":8831.31,"end":8868.53,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
