{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":0.96,"end":65.54,"speaker":"Voice Of Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free, free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":67.14,"end":145.98,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much. Voice of Steve. Good evening. Giants Killers. And I said giants Killers. Oh boy. Like the New York giants. Giant Killers. Dragon Slayers. You're listening to Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me from Cajun Country, Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in exile in Yankee country in Emmaus, Pennsylvania. If you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. Montesh Kha Trudy, as usual, will be taking your calls this evening, which we're going to get to in the second part of our show. Before we get to that, though, on October 26th through 29th, 2023, at the Antiochian Village in Western Pennsylvania, we are going to be holding the first ever Lord of Spirits conference. Father Stephen and I are going to both be there. We're going to be giving talks and also we'll be there. Fathers David Subu and Lucas Christensen. And we are also very happy to announce that his Eminence Archbishop Alexander Gallitzin will be speaking as well. And there is going to be an RPG tournament, which is the only part that really matters to Father Steven."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":146.7,"end":154.46,"speaker":"Fr Stephen De Young","text":"First, it's a Dungeons and Dragons tournament. Don't bury the lead. We're not playing Mutants and Mastermind."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":156.78,"end":157.9,"speaker":"Fr Andrew Stephen Damick","text":"We're not going to play Merchant."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":158.7,"end":161.18,"speaker":"Fr Stephen De Young","text":"It's the only part that really matters. Period."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":161.5,"end":203.97,"speaker":"Fr Andrew Stephen Damick","text":"Period. Yeah. Well, the schedule is going to be is still being worked on, but you can find all the current details and you can register by going to store ancientfaith.com events. It's going to Be fun. I'm hoping at least one person will be wearing a bat costume. Never know. Seems possible. Anyway, that being said, tonight we're going to be talking about the holy mystery of ordination, the actual ritual act that makes a man part of ordained ministry. This is now the fourth in our series on the sacraments of the church. But how many episodes will there be? 5? 7?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":204.09,"end":204.61,"speaker":"Fr Stephen De Young","text":"9?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":204.73,"end":215.23,"speaker":"Fr Andrew Stephen Damick","text":"23. Who knows? So, Father Stephen, this episode, though, is all about the priesthood, right? No, no, we did that one already."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":215.39,"end":218.11,"speaker":"Fr Stephen De Young","text":"We already did that one. And like you just said what it was about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":218.43,"end":222.19,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But people say ordination, priesthood. So this is."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":222.27,"end":226.03,"speaker":"Fr Stephen De Young","text":"This is the latest we need to. We're going to be meeting our listeners."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":227.07,"end":229.23,"speaker":"Fr Andrew Stephen Damick","text":"That's true. They're going to actually see us in person."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":229.73,"end":255.01,"speaker":"Fr Stephen De Young","text":"Right. And so I feel like we need to begin now to be more transparent. Right. Like about the strains in our interpersonal relationship, because I don't know if you don't. I don't know if you hear the talk, but they say we've got nothing in common. No common ground to start from."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":256.31,"end":256.59,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":256.59,"end":274.43,"speaker":"Fr Stephen De Young","text":"And we're falling apart. Wow. But as we were talking about it earlier today, I said, hey, what about Breakfast at Tiffany's? And you said, I think I remember the film. As I recall, we both kind of liked it. And, you know, that's one thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":274.43,"end":275.19,"speaker":"Fr Andrew Stephen Damick","text":"One thing we've got."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":275.35,"end":276.87,"speaker":"Fr Stephen De Young","text":"Yeah. Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":277.43,"end":283.41,"speaker":"Fr Andrew Stephen Damick","text":"That's gotta be what it was, that 1995. 96. I'm trying to remember when that song came out."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":283.81,"end":287.85,"speaker":"Fr Stephen De Young","text":"Somewhere around there. Yeah, man, you got a reference, too."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":287.85,"end":291.65,"speaker":"Fr Andrew Stephen Damick","text":"So there one hit wonder. I did. This will be the one I get for the show."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":291.97,"end":298.45,"speaker":"Fr Stephen De Young","text":"Yeah. That's got to be a. That's got to be a. A bingo square. Right. Father Andrew gets a reference."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":298.53,"end":301.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. I feel like people should get a Lord of Spirits bingo square for that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":301.89,"end":310.3,"speaker":"Fr Stephen De Young","text":"Yeah. So, yes, this episode is not about the priesthood as such."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":311.18,"end":311.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":312.22,"end":321.14,"speaker":"Fr Stephen De Young","text":"Because we already did that. Been there, done that. Available for download at your local ancient faith.com for free."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":321.14,"end":328.38,"speaker":"Fr Andrew Stephen Damick","text":"By the way, all you guys who complain like this is free, no one's making you pay to listen. Just saying."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":330.14,"end":332.69,"speaker":"Fr Stephen De Young","text":"Are there people out there complaining they have to pay for podcasts?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":332.84,"end":339.32,"speaker":"Fr Andrew Stephen Damick","text":"I. I don't think they're complaining they have to pay. They're just complaining about the podcast, you know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":339.48,"end":342.12,"speaker":"Fr Stephen De Young","text":"Oh, well, you get what you pay for that. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":342.28,"end":342.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":342.92,"end":421.51,"speaker":"Fr Stephen De Young","text":"So you get three hours of free something. So you can go and listen to that one if you want a refresher. There will be some things tonight that connect with that. So that might Be a worthwhile thing to do if you're caught up. If you want an excuse to have headphones in during a family gathering over the holidays this weekend. And then when they ask what you're listening to, you can sound spiritual instead of antisocial. Right. It's a life hack. So we're not talking about priesthood. We're also not when we say that this episode, we're talking about ordination. We not talking about like contemporary American practice or elsewhere of like how that works, like how seminaries work and how pastoral education is done and that sort of thing. Mainly because none of that existed before 400 A.D. and as longtime listeners know, that's when I lose interest in the world. And we're also not. And a bunch of people may tune out now. This is also not going to be how to get yourself ordained."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":422.39,"end":428.87,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. I can't just go on to universal life church.com and well, you can Shaman Pope or something like that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":429.43,"end":437.19,"speaker":"Fr Stephen De Young","text":"And that'll be worth the paper it's printed on. You won't be able to perform weddings in Pennsylvania."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":437.51,"end":438.63,"speaker":"Fr Andrew Stephen Damick","text":"I think that is true."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":439.12,"end":495.49,"speaker":"Fr Stephen De Young","text":"Ordained online like that. So especially if you're planning on doing weddings in Pennsylvania. Not the road to take. But we're not going to tell you what the road to take is because that's not what the episode's about. What we are talking about is ordination itself. Ordination is a rite as a ritual, as a sacrament, as a mystery of the church. And obviously that directly relates to priesthood. Right. Especially as we get started. A lot of what we're going to be talking about tonight is going to grow out of Aaron and his sons. Aaron is the first high priest, his sons as priests, the other Levites, these are the first folks who get ordained in the scriptures. And we have a lot of detail of how exactly that happened."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":495.89,"end":498.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we're going to go over that. It's deeply weird, you guys."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":500.37,"end":507.17,"speaker":"Fr Stephen De Young","text":"In great detail. There will be, you know, the fatty portions above the kidneys. They're coming, they're flying through the air."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":507.41,"end":511.73,"speaker":"Fr Andrew Stephen Damick","text":"And also prehistoric bacon buns just putting that out there."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":511.73,"end":512.37,"speaker":"Fr Stephen De Young","text":"It's true."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":514.05,"end":516.29,"speaker":"Fr Andrew Stephen Damick","text":"All you Lithuanian Americans know what I'm talking about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":517.87,"end":562.37,"speaker":"Fr Stephen De Young","text":"So this, so this actual ratio, what is being done to someone when they get ordained, when a man gets ordained, what is being done to them? And so that means that our discussion is going to sort of start. One of the reasons we're starting with Aaron and his sons, sort of there's going to be a little preface, but is that in order to have an ordination rite, you have to Have a formal priesthood as such."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":563.81,"end":567.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because you have to be being ordained into something."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":568.13,"end":606.28,"speaker":"Fr Stephen De Young","text":"Right. So one of the things we really emphasized on the priesthood episode was that before the Levitical priesthood, before the priesthood of Aaron, that the priestly role was a role played by the father or the head of the household or the head of a clan or the head of a tribe. Right. That it was a role within a family structure rather than this man here is a priest, this other man over here is not a priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":606.36,"end":608.92,"speaker":"Fr Andrew Stephen Damick","text":"It's just, you know, it's just what dad does."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":609.64,"end":675.53,"speaker":"Fr Stephen De Young","text":"Right. And so that requires a priesthood. Right. As such, not just a concept of the priest or the role of offering sacrifice, but an actual priesthood. So that the ordination is making a person who previously was not one of those into one of those. And we probably should mention now, even though we haven't talked about this before, but what does that ever stop me from springing things on Father Andrew? So this series, as was mentioned, is sort of our series on the sacraments or mysteries of the church. And this is one that our Protestant friends. Well, you can never say all Protestants, but this is almost all, at least don't see ordination as a sacrament."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":676.09,"end":693.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I think, you know, for even the ones that do see things as sacraments, because a lot of Protestants don't see anything as a sacrament. There's just baptism in the Eucharist. You know, for a lot of them, it's just those two and everything else is not."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":694.04,"end":696.68,"speaker":"Fr Stephen De Young","text":"And if you're a Lutheran, you kind of have absolution."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":697.48,"end":697.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":698.04,"end":728,"speaker":"Fr Stephen De Young","text":"As an extra one, I don't think two and a half. But yeah, but, but yeah, ordination is not. That said, that said, and we'll talk about this a little more later on. There is actually, though many of our Protestant friends would be loathe to call it a ritual, there is actually ritual attached to them. Setting apart somebody to ordained office."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":728.4,"end":734.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. There's often laying on of hands. I mean, that's a thing that is being done in a lot of cases."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":735.16,"end":768.88,"speaker":"Fr Stephen De Young","text":"Yeah. And later on tonight, we're going to talk about the difference in how ordination is seen, which is really a difference in how the sacraments in general are seen that are probably, or at least hopefully will kind of make plain why you would have Protestant groups who are doing something that looks a lot like a rite of ordination, but not wanting to call it a sacrament. But we will. We will get to that as we move on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":769.2,"end":771.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes. The night is young."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":771.6,"end":790.42,"speaker":"Fr Stephen De Young","text":"Yeah. So as we were mentioning, the. The priesthood starts out as just a function and this is sort of quick review of that other episode. A function of fatherhood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":791.3,"end":791.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":792.1,"end":797.94,"speaker":"Fr Stephen De Young","text":"And fatherhood broadly considered. Because, remember, we're not talking about nuclear families."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":799.06,"end":799.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":800.26,"end":855.93,"speaker":"Fr Stephen De Young","text":"Nuclear families are what families get whittled down to in the industrial revolution and urbanization, but we're talking about broad extended families, clans, tribes. Think of Abraham and his wife and later on, children and servants and herdsmen and his nephew Lot, and Lot's family and herdsmen and. Right. The big extended family. And there is someone who had the patriarchal role. Right. And patriarchy is just the first father or the highest father or the right sort of the father of the whole. Right. And that was the one who was offering sacrifices for the family. And we see that with Abraham, we see that with Isaac, we see that with Jacob, we see that with Job."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":856.41,"end":856.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":857.37,"end":939.97,"speaker":"Fr Stephen De Young","text":"Right. And there's also, as we talked about, as you start to get groups of tribes and clans in Israel. So this really starts in Egypt. Right. As that grows from sort of one big extended family in the second two thirds of the Book of Genesis into nations. So you have tribes, clans within the tribes, families within the clans. Right. You have. That evolves into eldership, where the person who has that patriarchal role in a given family is then part of a group of leaders within a clan. Right. And then groups of leaders in the tribe. So you get the elders of the people. And as we also talked about in that previous episode about priesthood until the time of the golden calf. Right. Those were the ones who were still offering sacrifices, which means there wasn't during that period, until we get to the tabernacle and Aaron and his sons, there wasn't just this single sanctuary, this single place where sacrifices were offered."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":940.05,"end":953.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was just something that was done within either the precincts of the family or the larger family unit or whatever. There wasn't like a temple or a tabernacle or shrine, you know, that everybody went to. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":953.34,"end":1004.49,"speaker":"Fr Stephen De Young","text":"And when we're dealing with nomads, like we see in the patriarchal narratives in Genesis, they're building altars in particular places and offering sacrifice there. So when these things happen that we described in that episode, where the priesthood is taken away from Moses and given to Aaron, and it's taken away from the elders as a group and given to the Levites in particular, at the time of the golden calf, there is this shift. Right. So there is a split between fatherhood and eldership and a particular kind of priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1005.4,"end":1008.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what kind is that then?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1009.08,"end":1012.44,"speaker":"Fr Stephen De Young","text":"Right. Well, specifically, the sacrificial priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1012.68,"end":1017.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Yeah. Because there's still like priestly role of intercession, for instance."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1018.44,"end":1025.16,"speaker":"Fr Stephen De Young","text":"Right. And leadership and these other things. Yeah, right, right, right. And Moses maintains the leadership of the people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1026.12,"end":1026.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1027.32,"end":1045.8,"speaker":"Fr Stephen De Young","text":"And we talked to that previous episode. That's why you have a separate king and high priest. Right. John Hyrcanus accepted after that. Right. Those, those two things are, are split and spoilers for the end of that episode, those come back together."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1046.04,"end":1046.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1046.44,"end":1114.69,"speaker":"Fr Stephen De Young","text":"In Christ. But so the elders of the tribes are no longer performing that priestly function. That priestly function is given over to the Levites and Aaron as high priest, his sons as priests, their descendants as priests. The other Levites assisting them are now playing the role for the other tribes in relation to the other tribes that previously the leadership within each tribe played for that tribe sacrificially. Right. And so that move is also what produces the single sanctuary. Right. That, that the Levites now who are doing this for everyone. There's not going to be a separate shrine and a separate altar in the territory of each of the tribes because the Levites are doing it. Or there wasn't supposed to be, we'll put it that way."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1114.77,"end":1116.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1116.37,"end":1119.33,"speaker":"Fr Stephen De Young","text":"See Bethel and Dan got their calves and that kind of thing happened."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1119.33,"end":1121.65,"speaker":"Fr Andrew Stephen Damick","text":"See Jeroboam. Yeah, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1122.05,"end":1170.39,"speaker":"Fr Stephen De Young","text":"But the, the concept within the Torah, shall we say, that there should be this one, this one altar where sacrifice was offered to Yahweh is connected to the idea that there's one high priest and one central priesthood connected to it. These things go hand in hand. So before we just did all this building up to Aaron, but before we can get into Aaron, we have to do that preface. We have to roll back a little bit as is our want to actually. All the way to Adam."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1171.19,"end":1173.27,"speaker":"Fr Andrew Stephen Damick","text":"Oh, all the way to Adam. That's a surprise."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1173.67,"end":1197.52,"speaker":"Fr Stephen De Young","text":"Yeah. So. And this is again a reminder of some things we've already talked about on the show. But one of the things that's going on in Genesis with Adam is that Adam is used as the model for priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1198.48,"end":1198.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1199.6,"end":1209.52,"speaker":"Fr Stephen De Young","text":"He is from the perspective of Moses, where the priesthood is being instituted. Right. Adam represents a prototype."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1210.25,"end":1212.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although not like ordained."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1214.09,"end":1224.89,"speaker":"Fr Stephen De Young","text":"Right. There was not a ceremony. He was not so for example, he was the only dude. So it was not him instead of some other non existent person."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1225.13,"end":1235.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. And then when we see like we see Cain and Abel offering sacrifices, but there's not a, you know, it's not Father Cain and Brother Abel, you know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1235.97,"end":1237.49,"speaker":"Fr Stephen De Young","text":"Right, right. They both do it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1237.73,"end":1238.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1238.89,"end":1339.8,"speaker":"Fr Stephen De Young","text":"It's not Adam offering it. Right. On their behalf. But Adam is, and this is one of the important details in the text of Genesis that often gets overlooked. Adam is created from the ground and then taken and placed in Eden. So there is a sense where even Adam, even though he's not called out of a mass of people, right. He is taken out of the world and put into this. This holy place. Right. Which is what sanctuary literally means. Right. Put into this holy place, this walled garden paradise, which is the place where God is. Where God dwells, Right there to serve. And we've talked about before, I know, in multiple episodes of the show, how Genesis 1 follows this structure of the building of a temple in the ancient Near East. And we've talked at least a couple of times about the way in which Adam's creation in Genesis 2 sort of inverts the typical ending of that story, where the culmination of that story in the ancient near east, usually after a bunch of people have gotten killed and their blood has purged, the sanctionary dedicated sanctuary, but the enemies of the God and all this kind of thing. But at the, at the end of that story of the building and consecration of sanctuary, the last step is that the image of the God is placed in the sanctuary."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1340.04,"end":1340.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1341.4,"end":1354.55,"speaker":"Fr Stephen De Young","text":"And the rituals performed to open its mouth or its nostrils, depending on what you're eating, so that the spirit of the God can come in and dwell in it and it becomes sort of a hypostasis of the God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1355.51,"end":1360.55,"speaker":"Fr Andrew Stephen Damick","text":"And see the idolatry episode for all of this in greater detail, if you're interested."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1361.75,"end":1401.86,"speaker":"Fr Stephen De Young","text":"And then now, right, you've got the God there in the temple and it can be, you know, fed, watered, washed, clothed, right. By people. And in return, if the rituals are performed correctly, it will hypothetically do things for you, like allow you to have children and give you good crop yields, victory. And this is part of the. Yeah, part of the basic Jewish critique here is, okay, so it can't wash itself or dress itself, but it could give you crops and shelter. There's a flaw here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1402.5,"end":1406.26,"speaker":"Fr Andrew Stephen Damick","text":"That's why there's just so much anti idolatry smack talk in the scriptures."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1406.58,"end":1475.6,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. It tips over and you have to set it back up. Right? Yeah. And so Adam is the reverse of that. God makes Adam as his image, rather than Adam making an image of Yahweh, the God of Israel, to use instrumentally. God makes Adam and breathes the spirit into his nostrils and places him in the sanctuary as his image. And so that placement, right, that enlivening that placement in the Sanctuary effectively is Adam's ordination. That may seem like a super big stretch right now, but by the end of the episode, right, as we go forward and look at Aaron and ultimately Christ, I think this will start to fit together."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1475.92,"end":1477.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Stick with us, everybody."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1478,"end":1506.71,"speaker":"Fr Stephen De Young","text":"Yeah. It's a long road getting from there to here. Anyway, so when we see Aaron as the high priest right there, we're immediately greeted by this imagery that is deliberately evocative of paradise and of Adam in paradise."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1506.71,"end":1520.79,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's worth pointing out that the tabernacle first and then, of course, later, the temple is not four bare walls in a sermon. It's got a whole lot of stuff that's supposed to remind you of Eden."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1521.91,"end":1526.87,"speaker":"Fr Stephen De Young","text":"In fact, there'd be kind of no point of preaching a sermon in there as there'd be like, maybe one other priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1527.29,"end":1536.49,"speaker":"Fr Andrew Stephen Damick","text":"Right? That's true. No one goes in there except the priest. That's true. Yeah, yeah. Don't push my analogy too far. Come on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1536.49,"end":1538.01,"speaker":"Fr Stephen De Young","text":"Okay, sorry, sorry."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1538.17,"end":1542.61,"speaker":"Fr Andrew Stephen Damick","text":"It's the four bare walls that I was really kind of trying to emphasize. Okay, okay. So it's not bare walls. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1542.61,"end":1557.98,"speaker":"Fr Stephen De Young","text":"Okay. Right, right. You have in the tabernacle, you have the embroidered cherubim. You have the sculpted cherubim on the Ark of the Covenant. Right. Who are the throne guardians in heaven?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1557.98,"end":1561.06,"speaker":"Fr Andrew Stephen Damick","text":"Pomegranates, greenery, foliage."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1561.94,"end":1578.9,"speaker":"Fr Stephen De Young","text":"Yeah. Especially in the temple, the fruit trees. Imagery of the fruit trees. And remember, you know, there's the cherub, the caruf, with the flaming sword at the gates of paradise. Right. So this is all this imagery."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1579.54,"end":1590.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which gets carried over into modern Orthodox churches, by the way. Everybody, just about everything we mentioned gets used in Orthodox churches, including the fruit and the vines and all that kind of greenery stuff."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1591.54,"end":1656.4,"speaker":"Fr Stephen De Young","text":"Right. And the priests and the high priest especially. Right. The whole purpose of them being consecrated and offering the sin offerings for themselves and for the people in all of this is to allow them to enter in. So re. Entry into paradise is a basic element of this. They're going to come into the presence of God, into the place where God dwells, back into paradise from which Adam had been cast out. And we see the same kind of pattern in terms of the high priest is taken, Aaron is one of the people, Moses, brother. And he's taken, and he is made the high priest and placed in the sanctuary. And as we said, there'll be great deal of detail about that later on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1656.72,"end":1657.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1657.92,"end":1700.62,"speaker":"Fr Stephen De Young","text":"And that placement. Right. Constitutes his ordination that we're going to read about. And he's now there as the image of God. And we'll get into that more in a minute. And so the high priest is set up as a new Adam. Right. Who is now going to re. Enter only tentatively, only really enter in once a year to the most holy place."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1700.78,"end":1701.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1703.02,"end":1715.01,"speaker":"Fr Stephen De Young","text":"And always with, you know, with blood to purify, with offerings for his own sins and those of the people. All that stuff Hebrews talks about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1715.41,"end":1729.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's all this sense of there's the loss of paradise, and so there's this kind of temporary approaching and entering and approaching, you know, like it's sort of trying to get back to paradise is what's happening in the tabernacle and temple."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1730.21,"end":1787.41,"speaker":"Fr Stephen De Young","text":"Right. And the Hebrews thing is important. Right. Because there's going to be a running theme through this episode just to tip people off. Now, there are probably several, but one of them is going to be that a lot of times we're missing huge swaths of stuff in the scriptures because we're so obsessed with, in particular, our atonement theories. So if you hear someone discuss Christ is the great high priest in Hebrews, I'll go ahead and say 9 times out of 10, 8 times out of 10 may be more fair, but you get the point. They're going to be talking about atonement. Christ making atonement. How does it work? How does Christ make atonement?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1787.49,"end":1788.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1789.65,"end":1799.6,"speaker":"Fr Stephen De Young","text":"And first and foremost, they're missing this imagery that connects Christ as great high priest and Christ as new Adam."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1801.04,"end":1801.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1802.16,"end":1803.6,"speaker":"Fr Stephen De Young","text":"And the return to paradise."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1803.76,"end":1807.36,"speaker":"Fr Andrew Stephen Damick","text":"A lot more complexity and depth going on in all of this."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1808.08,"end":1856.58,"speaker":"Fr Stephen De Young","text":"Right. And not an image of paradise made with human hands on earth like the tabernacle and the temple, but actual paradise, the actual presence of God in the heavenly places, as Hebrews says. So there could be several places here where we're going to ultimately be connecting some of these things to Christ's fulfillment, where that fulfillment is obscured by this focus on this or that atonement theory, trying to prove it over against other ones and that kind of thing. So while that will come up several times in the episode, we're not talking about atonement this episode. We already did that episode too."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1856.82,"end":1857.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1857.62,"end":1901.19,"speaker":"Fr Stephen De Young","text":"So we're gonna set that aside and try to look at all these other things that we might miss if we're focused on that tonight. But so, yeah. So Aaron, then, is this pattern of a new Adam. Right. An outline, a suggestion, a shadow. This is the kind of language that the New Testament uses. Right. And then Christ comes and fulfills that Right. Fills it in, fills it up to overflowing. And is the new Adam in a truer sense, is the high priest in a truer sense. And those in some sense mean kind of the same thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1901.67,"end":1909.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, all of those. All of those things, including Adam himself, are ultimately pointing towards Christ, who is all of it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1910.55,"end":1911.03,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1912.15,"end":1912.95,"speaker":"Fr Andrew Stephen Damick","text":"And so."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1915.83,"end":1941.68,"speaker":"Fr Stephen De Young","text":"So one of the stories about Aaron that gets referenced a lot. It gets referenced a lot in our orthodox liturgics. It gets referenced a lot in. When people are talking about, I'm going to ruin your Sunday School quote, unquote, the contents of the Ark of the Covenant."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1942.08,"end":1945.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh, it's so hard to remember that stuff."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1946.8,"end":1969.94,"speaker":"Fr Stephen De Young","text":"So you may have been taught in Sunday school that there were three things in the Ark of the Covenant. Well, technically four, but one of them is a set of two things. A jar of manna, the two tablets of the Covenant, and Aaron's rod that budded."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1970.82,"end":1971.22,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1971.54,"end":1974.5,"speaker":"Fr Stephen De Young","text":"Right, right. Not actually."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1975.14,"end":1975.86,"speaker":"Fr Andrew Stephen Damick","text":"Not true."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1976.02,"end":1989.49,"speaker":"Fr Stephen De Young","text":"The only thing in the Ark were the two tablets of the law. Two tablets of the Covenant, which, as I already previously ruined your Sunday school, are two copies of the same thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":1990.05,"end":2000.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes. If you take the COVID off and you put your hand in there and there's a bowl of dust, it'll melt your face off. I learned."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2000.05,"end":2007.49,"speaker":"Fr Stephen De Young","text":"That is true. That is true. I saw it happen in some newsreel footage to some. Some Germans who seemed like pretty nasty people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2007.99,"end":2015.71,"speaker":"Fr Andrew Stephen Damick","text":"They said it was beautiful. But no, not 19th century Germans. Yeah, early 20th century German."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2015.71,"end":2036.55,"speaker":"Fr Stephen De Young","text":"Early 20th century Germans. Mid 20th century Germans. The worst kind. So the, the. But so the other two things, Aaron's rod that budded, that we're about to talk about more, and the jar of manna, were kept in the sanctuary in the most holy place."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2037.33,"end":2039.33,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so they're kind of nearby, near."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2039.33,"end":2040.41,"speaker":"Fr Stephen De Young","text":"The Ark of the Covenant."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2040.41,"end":2041.25,"speaker":"Fr Andrew Stephen Damick","text":"Near the Ark, Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2041.25,"end":2059.17,"speaker":"Fr Stephen De Young","text":"Right. They were the contents of the Holy of Holies, not the Ark itself. Also, just because I know I mentioned this in an old episode, but God did not live inside the Ark of the Covenant. It was his footstool."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2059.65,"end":2066.34,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. It's not his little house."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2067.86,"end":2075.38,"speaker":"Fr Stephen De Young","text":"So all these references to Aaron's rod that budded or the budding of Aaron's rod which designateth the priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2075.54,"end":2080.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yes, that's in the canon. It's like the cataphic of the Canon of the Cross, actually."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2081.06,"end":2106.11,"speaker":"Fr Stephen De Young","text":"Right. Is all referring to a story that's in numbers 17. And people don't read the Book of Numbers a lot. I think if most people made a Torah tier list, numbers would be five out of five. Right. It'd be the lowest on the list, probably tier list for a lot of people. I don't know why you would make a Torah tier list."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2107.23,"end":2108.67,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's all of a piece."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2109.23,"end":2133.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And I'm assuming that you can't assign multiple books to the same tier, which would be hard because, like, let's face it, Genesis and Exodus, both S tier. But you get the point. Numbers, it's not people's favorite book to read. People usually don't even get there because somewhere in Leviticus, they lose interest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2133.35,"end":2138.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. They lose track of all the butchering instructions and how to deal with mildew and stuff."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2139.11,"end":2144.87,"speaker":"Fr Stephen De Young","text":"Yeah. And if they were thinking about skipping ahead to numbers, they saw some genealogies and punched right out. Right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2146.11,"end":2148.91,"speaker":"Fr Andrew Stephen Damick","text":"But there's narrative in numbers, people. There's narrative as well."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2149.47,"end":2166.27,"speaker":"Fr Stephen De Young","text":"Yes. And number 17, shockingly, comes right after number 16. And we talked about number 16 at a couple of points in the Priesthood episode. I believe in another episode when we talked about the sons of Korah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2166.43,"end":2172.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the Korah rebellion. I think we talked about it in one of the episodes where we talked about the underworld."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2172.98,"end":2173.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2173.46,"end":2176.82,"speaker":"Fr Andrew Stephen Damick","text":"Because they get sucked down into Hades, Sheol, really."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2177.14,"end":2187.22,"speaker":"Fr Stephen De Young","text":"Right. But we haven't really Talked about number 17, which is in the aftermath of that. And yes, understanding that it's in the aftermath of that is sort of key to understanding what's going on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2187.46,"end":2189.14,"speaker":"Fr Andrew Stephen Damick","text":"You won't believe what happens next."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2189.3,"end":2211.95,"speaker":"Fr Stephen De Young","text":"Yeah. So. So there had just been. Just a really briefly summarize. Right. At this point, Aaron is already the high priest. He's been ordained as the high priest. He's offering sacrifices. That happened back in Leviticus. We're going to go back there."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2212.19,"end":2220.35,"speaker":"Fr Andrew Stephen Damick","text":"And that's why Korah and company are complaining, because they're like, hey, what makes him so special? Aren't we all priests?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2220.67,"end":2221.07,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2221.07,"end":2222.91,"speaker":"Fr Andrew Stephen Damick","text":"We all believers. Aren't we all equal?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2223.15,"end":2225.39,"speaker":"Fr Stephen De Young","text":"Yes. Is not all of Israel holy?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2225.63,"end":2225.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2225.79,"end":2228.99,"speaker":"Fr Stephen De Young","text":"Are we not holy? Why is he lording it over us? Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2229.07,"end":2229.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2231.39,"end":2240.67,"speaker":"Fr Stephen De Young","text":"So, yeah, democracy finds its beginning. Anyway, I vote for Korah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2243.39,"end":2245.07,"speaker":"Fr Andrew Stephen Damick","text":"All the way with Korah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2248.43,"end":2250.27,"speaker":"Fr Stephen De Young","text":"So Aaron's already the high priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2250.91,"end":2251.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2251.47,"end":2254.19,"speaker":"Fr Stephen De Young","text":"And this is already done. But there's been this challenge."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2254.88,"end":2255.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2256,"end":2277.92,"speaker":"Fr Stephen De Young","text":"And when you read what Korah says, it kind of veers back and forth between Korah thinks Korah ought to be the high priest, or barring that, we just shouldn't have one priesthood of all believers. Right. Or at least the heads of all the clans. Because he was the head of a clan. Yeah, yeah. The old status quo. He was a conservative."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2280.24,"end":2281.28,"speaker":"Fr Andrew Stephen Damick","text":"In the British sense."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2281.44,"end":2308.83,"speaker":"Fr Stephen De Young","text":"Yeah. So this story in number 17 is about God making a public testimony, a public affirmation. Right. And an ongoing public affirmation that he had made. He had given the priesthood to Aaron."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2309.23,"end":2323.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the way this works in case it's been a while since he read number 17 is God tells Moses, you know, talk to the heads of all of the. Talk to all the chiefs and get there."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2323.58,"end":2324.46,"speaker":"Fr Stephen De Young","text":"Of the tribes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2324.62,"end":2332.86,"speaker":"Fr Andrew Stephen Damick","text":"The tribes, yeah, the heads of the tribes get their 12 staffs together because they've each got one as this sort of symbol of authority."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2332.94,"end":2333.94,"speaker":"Fr Stephen De Young","text":"Right, the rod."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2333.94,"end":2374.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the rod, yeah. And then line them all up in the tabernacle. Right. I'm trying to. Yeah, in the tent of meeting. Yes, the tabernacle. Right. And then God says, I'm going to cause one of these staffs to sprout and they will have a detail I left out. Write everybody's name on their staff. Right. So we know whose is whose, you know, and he's going to cause one of them to bud and that'll prove that God has chosen that man to be priest. Right. So it's, you know, this one buds out of all the 12, and that. That proves it. And of course, it's Aaron's. Aaron's is the one that actually begins to sprout."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2375.04,"end":2380.64,"speaker":"Fr Stephen De Young","text":"Right, right. And Moses is reminded to put Aaron's name on the staff of Levi, not his own."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2381.12,"end":2384.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Sorry, Moses, you don't have it because."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2384.4,"end":2418.77,"speaker":"Fr Stephen De Young","text":"There'S another piece of that. The priesthood having been taken away from him. Yeah. And in the esv, it says it sprouted forth fresh almonds. That sounds just delightful, but. Right, so this, this rod buds to new life and then that budded rod is taken and it's put into the sanctuary to be this continuing ongoing testimony to the fact that it's Aaron and Aaron's line."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2419.65,"end":2424.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Who have as a kind of relic to prove the thing that happened."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2424.93,"end":2458.56,"speaker":"Fr Stephen De Young","text":"Right. To testify. So it literally says in number 17, when God says why he's doing it, he's like, I'm saying this to stop the grumbling, so that they will stop grumbling. Like the word grumbling appears like three times in one sentence. Right, Right. Just like, no more of this. Right. This is going to be settled once and for all and you're going to have this symbol. But so then the question is, why this particular symbol? Right. I mean, God could have just spoken with a loud thunderous voice. It said, Aaron is the high priest. Right. Like there's."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2458.95,"end":2459.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2459.67,"end":2487.31,"speaker":"Fr Stephen De Young","text":"You know, There are any number of things God could have done. Why does he choose this particular thing? Right. And so the rod, and the reason why it's important that it's the rod is that the rod is the symbol of judgment. Right. And this is judgment in the sense that we've always talked about it on the podcast. Right. Not judgment in the sense of condemning people. It's not the rod you use to beat people to death when they."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2487.31,"end":2490.95,"speaker":"Fr Andrew Stephen Damick","text":"Putting things in order, putting things in their. Right. Arrangement."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2491.27,"end":2493.67,"speaker":"Fr Stephen De Young","text":"Putting things out of whack, back into whack. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2495.43,"end":2496.15,"speaker":"Fr Andrew Stephen Damick","text":"In whack."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2498.31,"end":2517.12,"speaker":"Fr Stephen De Young","text":"And sometimes you do that by whacking somebody. No. So the rod, remember, is what's used to send the plagues upon Egypt. The rod is what is used to split the Red Sea."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2517.28,"end":2523.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. That makes the water come out of the rock. Right. Also held up, you know, to defeat Amalek."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2523.84,"end":2524.24,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2524.56,"end":2526.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All kinds of rod action."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2526.8,"end":2540.37,"speaker":"Fr Stephen De Young","text":"This rod is that symbol. Right. Of sort of the restoration of order, of good order. Right. But a rod is also a dead piece of wood. Right. It's not alive."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2541.25,"end":2542.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2544.61,"end":2638.17,"speaker":"Fr Stephen De Young","text":"And so a rod budding combines that order, that restoration of order, that judgment, that restoration of justice with the blossoming forth of new life. And so this is Edenic injury imagery. Right. So, yeah, we've talked before. Fill the earth and subdue it. Right. The two commandments to Adam are to continue God's work of creation. Right. To establish order and fill it with life. And man and woman cooperate to do that. So the staff, the priest. Right. With the priest with the butted rod. This is the one through whom God is working to continue his work of establishing order and bringing forth new life. So everybody, all those other elders from the other tribes still had their authority in terms of order, in terms of governance, in terms of rendering judgment and establishing justice within their tribes and clans. But they did not have this special priestly authority that Aaron had that allowed it to bring forth life, to fill that order."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2638.97,"end":2640.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To make things Edenic Again."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2641.62,"end":2648.5,"speaker":"Fr Stephen De Young","text":"Right. And here's the piece that, again, we sometimes miss because we're obsessed with our atonement theories."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2649.22,"end":2649.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2649.94,"end":2654.5,"speaker":"Fr Stephen De Young","text":"As you mentioned, this is in the Caravacea for the cross."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2655.14,"end":2655.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2656.42,"end":2674.83,"speaker":"Fr Stephen De Young","text":"Right. And especially in St. John's Gospel, Christ repeatedly refers to his crucifixion. And the narrator, St. John, refers to Christ's crucifixion as when he is going to be glorified."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2675.39,"end":2678.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the hour when he is."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2678.43,"end":2684.11,"speaker":"Fr Stephen De Young","text":"Going to be revealed, when he is going to be glorified. And so the cross."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2684.91,"end":2685.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2685.23,"end":2719.8,"speaker":"Fr Stephen De Young","text":"The dead Wood of the cross that blossoms forth through Christ's death and resurrection with new life is what marks him out as the great high priest, as the new Adam. And so when we're writing hymns about the cross, this is not just like Nietzsche said, oh, here's a stick of wood in the Bible. Let's say it's the cross. Right. Because there's more connections than just these things are both wood. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2720.23,"end":2722.63,"speaker":"Fr Andrew Stephen Damick","text":"Have a little imagination there, Friedrich. Come on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2726.79,"end":2753.52,"speaker":"Fr Stephen De Young","text":"But that the cross becomes this symbol and this marker ongoing in the same way that the rod was kept in the sanctuary, the blossoming rod was kept in the sanctuary as this ongoing testimony of to whom God gave the high priesthood. The cross as symbol now becomes the ongoing testimony of the identity of Jesus as the Christ, as the Messiah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2753.92,"end":2759.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is part of why we display it everywhere as Christians."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2759.92,"end":2772.88,"speaker":"Fr Stephen De Young","text":"And St. Paul meditates a lot on how that's an inversion, because for your average Jewish person at that time, getting crucified by the Romans was the mark that you were a false messiah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2773.53,"end":2778.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And literally at the very, very, very, very bottom of society."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2779.13,"end":2787.21,"speaker":"Fr Stephen De Young","text":"Yeah. Like, that's what happened when a guy claimed up. Showed up and claimed to be the Messiah, and he wasn't the Messiah. The Romans crucified him. That's what happened."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2787.53,"end":2788.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2788.41,"end":2792.41,"speaker":"Fr Stephen De Young","text":"Right, Right. And this is why, where he gets into the."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2792.81,"end":2793.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2793.13,"end":2830.86,"speaker":"Fr Stephen De Young","text":"It's a scandal for the Jewish version. It's foolishness to the Greeks. Right. That it has been. The symbol has been inverted in this way. But if we understand what's going on with Aaron in number 17, then we should also understand what's going on with the cross. This is why Christ is always kind of chastising the authorities and the scribes and stuff who come against him of. You know, if you guys really understood Moses, who you're reading all the time, you'd get this."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2830.94,"end":2831.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2834.78,"end":2835.18,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2835.74,"end":2836.58,"speaker":"Fr Andrew Stephen Damick","text":"But they don't."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2836.58,"end":2838.94,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Well, some did."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2839.42,"end":2841.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Some believed."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2841.42,"end":2865.62,"speaker":"Fr Stephen De Young","text":"Yeah. And so Aaron, his sons, the Levites, at this point, are being sort of permanently designated to this. That particular altar in that particular ministry. Right. That particular sense of priesthood. And it's also important here that priesthood is repeatedly characterized as a gift."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2866.98,"end":2870.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not something that Aaron got because he was the best."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2871.54,"end":2873.14,"speaker":"Fr Stephen De Young","text":"Right. Not an achievement."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2873.22,"end":2875.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He and his sons accomplished some great act."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2875.94,"end":2885.45,"speaker":"Fr Stephen De Young","text":"Right. Or it's an award or. Right. He was just the smartest guy in Israel. Or he was the holiest guy in Israel."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2885.61,"end":2886.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2886.13,"end":2908.82,"speaker":"Fr Stephen De Young","text":"Or. Right. There is none of that. It's given to him as a gift. Right. And his Sons and grandsons and great grandsons or whoever happens to be born into that line. And some of them we're gonna see later are ne' er do wells. Some of them are righteous men and some of them are wicked men."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2909.14,"end":2910.22,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2910.22,"end":2945.98,"speaker":"Fr Stephen De Young","text":"Right. But they still have this gift that they're then going to be held responsible for how they use. So our last big element here in terms of Aaron and the high priest in general going forward in Israel, being presented as a new Adam. Right. As the image of God, as the one who images God or is to image God comes in taking a look at his vestments."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2947.1,"end":2961.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is pretty involved if you look at the actual scriptural passages. This isn't just, you know, wear a nice suit, Aaron, three piece suit. Those are the vestments of the Baptist preachers that I grew up listening to."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":2962.05,"end":3008.81,"speaker":"Fr Stephen De Young","text":"Nice set of clean clothes. Yeah, yeah, right, yeah. So there are specific vestments. Before we're done tonight, we're going to get into even how those vestments were consecrated and treated. But for now, we just want to talk about the vestments themselves. And those are described twice in the book of Exodus, the second half of the book of Exodus is everything twice. And frankly, sometimes people don't even get to Leviticus because the second time they read about what kind of goat hair was used for the tabernacle panels, they punch out. Right. And the reason everything gets repeated is first everything gets described. Here's how you're to make everything related to the tabernacle."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3008.81,"end":3009.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3009.29,"end":3017.4,"speaker":"Fr Stephen De Young","text":"And then they describe making everything for the tabernacle exactly according to those plans. And. And so it's just a repeat. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3017.64,"end":3018.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3019.24,"end":3023.88,"speaker":"Fr Stephen De Young","text":"And so the vestments of the high priest are in Exodus 28 and Exodus 39."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3024.52,"end":3025.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3027.08,"end":3057.98,"speaker":"Fr Stephen De Young","text":"And you could go to either of those places because it's a repeat. And the, the sort of overall pattern, as I know we've mentioned, I don't think we went into a lot of detail on it before, but we mentioned before is that the vestments for the high priest are strikingly similar. When we read accounts of the dressing of idols in the ancient near east, very similar to the way in which idols were vested."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3058.38,"end":3065.26,"speaker":"Fr Andrew Stephen Damick","text":"Now, how do we know? I mean, so we're looking at like ancient pagan religious texts that describe this kind of thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3065.66,"end":3073.97,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah, yeah. And descriptions of just temples and. Right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3074.21,"end":3080.05,"speaker":"Fr Andrew Stephen Damick","text":"So the high priest of Israel would look to someone in the ancient near east like a walking, talking idol."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3081.65,"end":3082.13,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3082.45,"end":3085.09,"speaker":"Fr Andrew Stephen Damick","text":"Effectively, you know, one of their idols."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3085.17,"end":3112.74,"speaker":"Fr Stephen De Young","text":"Yes. Now these are also very similar vestments to what a A, A priest king in the ancient near east, like especially Mesopotamian priest kings, what they would have worn when they were exercising priestly sacrificial functions. But there's a reason for that, and that's that those priest kings were actually considered God kings."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3113.54,"end":3114.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3114.98,"end":3140.5,"speaker":"Fr Stephen De Young","text":"So they were considered a God. So yeah, they would be dressed the same way an idol would be dressed because in their point of view, the idols of God, the kings of God, how God's dress. Right. But this is an inversion of that. Right. In that Aaron is not going to be sacrificed to."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3141.3,"end":3143.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't receive worship."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3143.86,"end":3192.97,"speaker":"Fr Stephen De Young","text":"Right. He has a fundamentally different relationship. He is not a God. Right. He is going to have this imaging role in the same way that that imaging role was given to Adam in the first place of serving as the image of God. And so as we go through here, sort of the elements of those vestments, we'll start to see that in, in more detail. The first, probably the most famous, probably the most famous part of the vestments is the, the, the ephod or ephod, depending on how you want to pronounce that. O."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3194.89,"end":3196.17,"speaker":"Fr Andrew Stephen Damick","text":"Sort of breastplate."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3197.85,"end":3201.53,"speaker":"Fr Stephen De Young","text":"Well, there's another thing that's sort of that, that's usually called the breastplate."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3201.61,"end":3206.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true. Yeah, yeah, yeah. Which, I mean, so like an ephod. I, I was just."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3206.73,"end":3207.93,"speaker":"Fr Stephen De Young","text":"It's a linen thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3208.25,"end":3234.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. I, I looked this up and you can buy them on ebay. Like you can go look up an ephod and there's not only things that are designed to be like a full size ephod or whatever, but also you can get like little ephod pendants, you know, little tchotchkes that are ephod, like, so I can't endorse any of those particular sellers. I don't know if they're good sellers or whatever."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3234.54,"end":3238.18,"speaker":"Fr Stephen De Young","text":"But I'm just saying you can get darn near anything on ebay except human domains."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3238.82,"end":3248.58,"speaker":"Fr Andrew Stephen Damick","text":"It's true. You can buy ePods on eBay. There should be. I mean, if they get enough of them, enough people selling these things, they should have their own separate site like Ephod Bay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3248.98,"end":3255.62,"speaker":"Fr Stephen De Young","text":"Well, if they have putting that out there, what's that? Bible theme park. Do they have somebody dressed as a high priest walking around?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3255.7,"end":3263.01,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, I bet you they do. That's maybe that's where people, they got to supply those guys, you know, High priest cosplay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3263.33,"end":3268.85,"speaker":"Fr Stephen De Young","text":"There's gotta be somebody going around doing presentations like at Christian schools."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3269.41,"end":3270.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3270.85,"end":3273.01,"speaker":"Fr Stephen De Young","text":"Stuff, you know, like this is how the high priest dress."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3273.01,"end":3282.61,"speaker":"Fr Andrew Stephen Damick","text":"Like, it's a little minor industry that needs to have ephod supplied to it. Yeah, Just, you know, it's a business opportunity. I'm just putting that out there for everybody."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3283.58,"end":3300.7,"speaker":"Fr Stephen De Young","text":"So what the. What the ephod is most famous for, though, is probably the 12 stones on it. The 12 precious stones that had 12 symbols on them. Right. That represented the 12 tribes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3301.9,"end":3302.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3303.18,"end":3314.99,"speaker":"Fr Stephen De Young","text":"And the. Yes. The colors of the stones and the symbols on them is related to Jewish astrology. Hey, it's Christmas time. We have to talk about Jewish astrology."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3317.07,"end":3318.83,"speaker":"Fr Andrew Stephen Damick","text":"It always gets me in the Christmas mood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3320.83,"end":3363.17,"speaker":"Fr Stephen De Young","text":"We mentioned this in our first Christmas episode, Days of Yore, and talked about how you get some of this in the Testament of Jacob at the end of the book of Genesis, where you see this animal imagery, his prophecies to his 12 sons. And that was the. The association of particular tribes with particular constellations in the zodiac. And so that symbolism is carried out sort of in the. In these stones that are held in the. The ephod."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3363.33,"end":3363.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3364.61,"end":3370.29,"speaker":"Fr Stephen De Young","text":"But the core importance of them is not the particularity of each of the 12."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3371.25,"end":3371.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3373.73,"end":3379.41,"speaker":"Fr Stephen De Young","text":"The. The important element is the weight."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3380.69,"end":3388.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you know, some of these ephods you can get on Amazon and at the Holy Land Mall."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3392.22,"end":3397.34,"speaker":"Fr Stephen De Young","text":"I'm sorry, you're just obsessed with it. Just get yourself an ephod. Okay. Just do it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3398.14,"end":3400.06,"speaker":"Fr Andrew Stephen Damick","text":"There's one like. Like the chain guy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3400.06,"end":3401.38,"speaker":"Fr Stephen De Young","text":"Treat yourself at Christmas to it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3401.38,"end":3423.58,"speaker":"Fr Andrew Stephen Damick","text":"There's one. The chain guy wears it on and it looks like Flavor Flav, you know, except like it's an ephod instead of a big clock. But, yeah, they're these big pieces of metal. I mean, so they do look heavy. So, like, the weight thing is, I think, playing into these modern ephods that you can get, you can become your own high priest. Get yourself an ordination on Universal."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3423.58,"end":3425.14,"speaker":"Fr Stephen De Young","text":"He's a high priestly hype man."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3427.86,"end":3429.7,"speaker":"Fr Andrew Stephen Damick","text":"So what a word."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3431.06,"end":3433.14,"speaker":"Fr Stephen De Young","text":"You've gone all the way down this rabbit trail."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3434.26,"end":3435.62,"speaker":"Fr Andrew Stephen Damick","text":"I love Bible kitsch."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3435.62,"end":3436.26,"speaker":"Fr Stephen De Young","text":"I'm sorry."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3436.34,"end":3438.26,"speaker":"Fr Andrew Stephen Damick","text":"It's just so fun."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3439.62,"end":3525.98,"speaker":"Fr Stephen De Young","text":"But so that weight is important because we're going to be coming Back to numbers 18, the chapter after the budding of Aaron's rod. We're going to be coming back to that later on. But one of the first things mentioned there and that we're going to develop later this evening is this idea of the high priest bearing, carrying the sins of the people into the sanctuary. And so that weight of the stones representing. Right. The people is a part of that. And The. This ephod with the stones is part of one element of that imaging and that priestly role of the priest sort of being the representative of Israel. Right. He is sort of the summing up of Israel there, representing Israel before God. So that's that element. Another reasonably well known piece of these vestments is what's called the breastplate where the Urim and Thummim are kept. We've mentioned those before on the show. No, we don't know how they worked."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3526.7,"end":3538.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it doesn't say. Although, once again, you can buy these things online. But it's just a total guess, though. Like what do they. Yeah, like what were they?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3539.02,"end":3548.94,"speaker":"Fr Stephen De Young","text":"We know they were two stones. We know that when there was some case where they really couldn't figure out what they should do in terms of the will of God, they would cast them in some way."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3549.42,"end":3549.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3550.06,"end":3557.02,"speaker":"Fr Stephen De Young","text":"And they would divination. People assume it's some kind of casting lots or something."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3557.42,"end":3560.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It just. The description just isn't there in the Bible."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3561.1,"end":3563.02,"speaker":"Fr Stephen De Young","text":"Right. So we just. We don't know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3565.18,"end":3565.58,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3565.98,"end":3581.99,"speaker":"Fr Stephen De Young","text":"But that was sort of the function. And so the Urim and Thummim are probably better known than the breastplate that they were kept in, but they're there. So then there's sort of the main robe that the high priest would wear, which had bells on it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3582.39,"end":3583.03,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3583.83,"end":3594.79,"speaker":"Fr Stephen De Young","text":"And you were overjoyed when I told you this because this is. I believe. Correct me if I'm wrong, but this is one of the dumbest things I think you had heard."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3596.23,"end":3599.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is one of the dumbest things I think I've heard in my life."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3599.75,"end":3600.95,"speaker":"Fr Stephen De Young","text":"Yes. Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3600.95,"end":3606.15,"speaker":"Fr Andrew Stephen Damick","text":"I love learning really dumb things that people say. Seriously, I don't know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3606.87,"end":3607.27,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3607.27,"end":3609.11,"speaker":"Fr Andrew Stephen Damick","text":"It's sort of like linguistic kitsch."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3610.43,"end":3618.51,"speaker":"Fr Stephen De Young","text":"Yeah. So this. Why are there bells on the high priest rope? What are the bells for?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3619.87,"end":3648.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, the kind of, like, urban legend that I had always heard growing up was the priest is in there. He's got the bells jingling. As long as he's moving around, and if you hear the bells stop, then that means that God has struck him dead because of something that he did. And so then you need to pull him out by the rope that's supposedly tied around his ankle, which, by the way, is never mentioned anywhere in the Bible."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3648.92,"end":3649.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3649.28,"end":3657.16,"speaker":"Fr Andrew Stephen Damick","text":"Yet. It's a thing that gets passed down. And people say this like, that's the bit that I was raised with, which is probably not true."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3657.8,"end":3663.16,"speaker":"Fr Stephen De Young","text":"Yeah, there may have. That may have been a late, like, second temple practice. But we're not even sure."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3663.78,"end":3682.74,"speaker":"Fr Andrew Stephen Damick","text":"It might be a kind of an ancient thing, but again, not mentioned in Scripture. There's no rope tied around the high priest's ankle. But that, even if that is completely wrong, does pales in comparison to this very dumb thing that you informed me about. So now everybody else gets to know it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3683.06,"end":3693.7,"speaker":"Fr Stephen De Young","text":"So one little dedicated to that. The problem with that, from the perspective of the text is the text says that in some way these bells are to keep the high priest from dying."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3695.06,"end":3695.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3695.62,"end":3697.78,"speaker":"Fr Stephen De Young","text":"Not notify you when he has died."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3698.58,"end":3701.54,"speaker":"Fr Andrew Stephen Damick","text":"Which presumably you could tell that because there'd be a big thump."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3702.34,"end":3702.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3703.22,"end":3705.86,"speaker":"Fr Andrew Stephen Damick","text":"So he just doesn't come out after a while."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3706.82,"end":3717.22,"speaker":"Fr Stephen De Young","text":"So people, scholars, these are legit scholars, have put this forward, okay? People with doctoral degrees, people with PhDs."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3718.02,"end":3721.71,"speaker":"Fr Andrew Stephen Damick","text":"Advanced degrees, actual academics, the sort of."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3721.71,"end":3747.51,"speaker":"Fr Stephen De Young","text":"Folk who cite what I'm about to tell you as coming from the P source very confidently. They say, p says what I'm going to tell you. So they say, well, so what does this mean? That the bells are there to in some ways keep the high priest from dying. Okay, Here is what these scholars say. You're not prepared, I'm not prepared even."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3747.51,"end":3748.59,"speaker":"Fr Andrew Stephen Damick","text":"To hear it a second time."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3749.67,"end":3772.31,"speaker":"Fr Stephen De Young","text":"The bells are on the high priest's garments so that when he goes to go into the sanctuary, God will hear him coming. Because if he didn't and he came in there disturbed the divine rest unannounced, God might smite him accidentally."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3776.64,"end":3782.08,"speaker":"Fr Andrew Stephen Damick","text":"See, I just made sure all those reviews we get where people say there's too much giggling, it's just the anticipation was just too much."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3782.24,"end":3788,"speaker":"Fr Stephen De Young","text":"Yes. People with pH. People who spent like a decade of their life studying the Bible."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3788.56,"end":3789.04,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3789.84,"end":3791.68,"speaker":"Fr Stephen De Young","text":"In general. And the Torah in particular."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3792.16,"end":3793.76,"speaker":"Fr Andrew Stephen Damick","text":"Don't scare God, you guys."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3793.92,"end":3811.66,"speaker":"Fr Stephen De Young","text":"Yes. Don't startle God. He might kill you and he can't bring you back to life or anything. Right. Even if God somehow did. Oopsie. Kill someone because they woke him up out of a sound sleep."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3812.78,"end":3820.3,"speaker":"Fr Andrew Stephen Damick","text":"I know the dissertations have to be written and journal articles have to be published, but come on, guys, come on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3820.86,"end":3826.38,"speaker":"Fr Stephen De Young","text":"This isn't just like some guy's cockeyed theory. People cite this as settled fact."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3827.18,"end":3827.66,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3827.82,"end":3848.52,"speaker":"Fr Stephen De Young","text":"As the teaching of the P source. I'm telling you. Yes. So, yeah, once again, I find myself in this weird, liminal space where I accept most people's critiques of academia, but I'm also kind of involved in it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3849,"end":3849.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3851.08,"end":3867.13,"speaker":"Fr Stephen De Young","text":"But that, of course, is preposterous. Right. There's a much simpler read here. Right. The bells are on the garments to keep the high priest attentive."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3868.57,"end":3868.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3870.65,"end":3880.81,"speaker":"Fr Stephen De Young","text":"Most people who listen to this show are not priests, but it is possible for a priest to kind of go into automatic mode and do things by rote."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3881.21,"end":3883.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It is possible to zone out a little bit."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3884.37,"end":3915.56,"speaker":"Fr Stephen De Young","text":"Yes. To zone out and lose focus, just like with any other human activity. Right, right. And so the bells, if every time you moved there was a bell chime, Right. There was some kind of chiming sound or rattling sound or something. Right. That would help keep you attentive and focused and keep you on task. Right. And if you're in the presence of God, that can be the difference between living and death by holiness."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3916.36,"end":3919.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3920.36,"end":3941.21,"speaker":"Fr Stephen De Young","text":"And it's a continuation of this, by the way, that causes our bishops to still have bells on their vestments. It's true, though I have often joked that it's to keep them from sneaking up and ordaining you, but I don't think ordination by stealth actually happens that much."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3943.21,"end":3943.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":3946.17,"end":4068.75,"speaker":"Fr Stephen De Young","text":"So then one of the most important elements of the high priest vestments is what's called the diadem, and that's sort of a crown. It had a metal band and then sort of in the front had a plate, and on the plate was written the name Yahweh. And so this is sort of the other half of the ephod. Right. If the ephod shows us the high priest representing the people to Yahweh, having the name of Yahweh inscribed on the diadem was part of the high priest representing Yahweh, the God of Israel, to the people, to the people of Israel, this mediatorial role that he's playing. And it also served as a reminder to the people that Israel as a whole bore the name of Yahweh. And so the people as a whole, the people as a collectivity, had a responsibility to image who God is to the nations. Right. To the world, in the same way that the high priest did to them. Because again, the high priest is sort of this summing up in one place of Israel. Right, right. And so this, of course, once again. Right. Finds its fulfillment, is filled full, is filled out in the person of Christ as the great high priest. Because Christ, of course, is the perfect representation of Yahweh, the God of Israel, the express image."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4068.91,"end":4069.71,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4069.79,"end":4082.12,"speaker":"Fr Stephen De Young","text":"And all the other language that St. Paul and the rest of the New Testament uses. So he represents God perfectly to the world. And he represents the world perfectly."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4083.08,"end":4083.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4083.56,"end":4090.2,"speaker":"Fr Stephen De Young","text":"The people perfectly to God. Why? As Hebrew says, because he also came to share in our humanity."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4090.84,"end":4093.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. And he carries our sins."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4094.92,"end":4110.2,"speaker":"Fr Stephen De Young","text":"He does these two things perfectly. And then the bishop who wears vestments, who we've already commented on a little bit here, are very similar to the high priest vestments that even gets called chief priest or high priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4110.28,"end":4110.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4112.52,"end":4133.61,"speaker":"Fr Stephen De Young","text":"Is the image of Christ. He is vested that way to serve as the image of Christ in the midst of his people and has the responsibility of representing Christ to us, being the image of Christ and representing us to Christ as he shares in Christ's priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4134.57,"end":4153.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So it's all summed up in Christ. And then the bishop is the one who is an image of Christ within the context of the church. All right. Well, that ends the first half of this episode of the Lord of Spirits. We're going to take a quick break and we'll be right back."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4154.52,"end":4206.92,"speaker":"Voice Of Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO, Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4207.38,"end":4215.54,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4215.54,"end":4219.62,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a tovarish you could count on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4220.34,"end":4224.74,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4225.3,"end":4229.9,"speaker":"Fr Andrew Stephen Damick","text":"It surprised me that most of the church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4229.9,"end":4234.99,"speaker":"Fr Stephen De Young","text":"Dervish parish didn't even know her name. It wasn't anything they thought about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4235.79,"end":4262.5,"speaker":"Voice Of Steve","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4263.7,"end":4283.86,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, Voice of Steve. Again. If you have questions about ordination in particular, you can call us at 855afradio. So here we are. It's the second half of Lord of Spirits. We just wrapped up talking about the vestments of Aaron and the High priests that followed him. So what's next, Father?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4285.07,"end":4292.91,"speaker":"Fr Stephen De Young","text":"I should say I will also accept any and all questions about the ordination of Aaron. The Kalamazoo, Michigan punk rock band."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4295.39,"end":4298.11,"speaker":"Fr Andrew Stephen Damick","text":"Is that really the name of a Kalamazoo punk rock band?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4298.67,"end":4301.15,"speaker":"Fr Stephen De Young","text":"It was indeed. Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4302.59,"end":4304.51,"speaker":"Fr Andrew Stephen Damick","text":"Western Michigan. So surprising."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4307.47,"end":4308.75,"speaker":"Fr Stephen De Young","text":"Full of Dutch glory."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4309.39,"end":4316.73,"speaker":"Fr Andrew Stephen Damick","text":"True. There are Damicks up there, by the way. I won't out them by name, but actual close relatives of mine living in western Michigan."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4317.37,"end":4318.89,"speaker":"Fr Stephen De Young","text":"Well, is their name Damick?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4319.21,"end":4320.85,"speaker":"Fr Andrew Stephen Damick","text":"Well, the last name is Damick. It's true."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4320.85,"end":4322.09,"speaker":"Fr Stephen De Young","text":"So you kind of have."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4323.05,"end":4332.01,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Well, if you run into someone up there that's named Damick, it's probably a relative of mine. Not too far from Kalamazoo, in fact."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4334.57,"end":4341.46,"speaker":"Fr Stephen De Young","text":"So now I'm gonna guess. No, I'm. No, I won't guess. We don't need people tracking them down and asking questions."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4341.78,"end":4344.94,"speaker":"Fr Andrew Stephen Damick","text":"Those poor people. They would have no idea what you're talking about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4344.94,"end":4345.38,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4346.18,"end":4346.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4346.82,"end":4376.35,"speaker":"Fr Stephen De Young","text":"What does Father Stephen Damick Young say about this? Yeah. Oh, well, I picture Father Stephen Damick Young. Have you ever seen the composite Superman? Maybe sort of this weird silver age comic book villain who, like, his left side is Superman and his right side is Batman?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4376.67,"end":4378.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4378.27,"end":4381.47,"speaker":"Fr Stephen De Young","text":"And they're both green skinned for no apparent reason."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4381.95,"end":4385.31,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. So sort of a chimera, kind of. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4385.55,"end":4396.99,"speaker":"Fr Stephen De Young","text":"Right. So I'm picturing father Stephen Day McYoung as just half of each of us, like welded together and green."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4397.87,"end":4407.39,"speaker":"Fr Andrew Stephen Damick","text":"That would be deeply weird because even, I mean, number one, you're two inches taller than I am, which is not a lot, but enough. But we have very different body shapes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4408.27,"end":4414.67,"speaker":"Fr Stephen De Young","text":"It's true. So weird. Some of our good online folks, though, are going to meme this now."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4414.91,"end":4416.91,"speaker":"Fr Andrew Stephen Damick","text":"I know. Thanks a lot."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4417.23,"end":4422.85,"speaker":"Fr Stephen De Young","text":"They're going to photoshop this together and I. At least I'm gonna enjoy it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4422.93,"end":4428.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just make it green, people. If it's gonna be canonical, it's gotta be green."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4428.85,"end":4442.97,"speaker":"Fr Stephen De Young","text":"Skin has to be green like the composite Superman. So. Yes. Unless someone has called in while we were just talking about the Kalamazoo, Michigan pumpkin punk band."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4442.97,"end":4443.25,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4445.31,"end":4453.63,"speaker":"Fr Stephen De Young","text":"We'Ll go ahead and move on to Saint Dionysius the Areopagite, because we can."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4454.99,"end":4456.51,"speaker":"Fr Andrew Stephen Damick","text":"The original Areopagite."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4456.75,"end":4474.33,"speaker":"Fr Stephen De Young","text":"Yes. So Saint Dionysius is, of course, for us orthodox folk, Saint Dionysius. In the west, he's more commonly known as Pseudo Dionysius."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4476.01,"end":4476.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4476.53,"end":4519.78,"speaker":"Fr Stephen De Young","text":"Or for people who don't know the difference between his name and the name of the Greek God Pseudo Dionysus. But don't do that. Because there's an iota, there's one iota of difference between the two. So there's Pseudo Dionysius and his works have a long and somewhat sordid history in the West. They were read and interpreted in a particular way. We have in the past referenced Saint Dionysius in regards to two works of his that go together, the celestial hierarchy and the ecclesiastical hierarchy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4520.1,"end":4520.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4521.38,"end":4595.65,"speaker":"Fr Stephen De Young","text":"And usually we've been coming at it from the angle of talking about angels, which he talks about the ranks of angels in his celestial hierarchy. And then we've sort of used some elements of the ecclesiastical hierarchy which he parallels with it to help us understand the celestial hierarchy and understand certain things about angels. Tonight we're going to use him in the reverse direction. So we're going to take some of the things we've talked about about angels and our understanding of how he talks about the nine ranks of angels and apply those to the understanding of ordained office within the Church, which is what he talks about in the ecclesiastical hierarchy. So part of what we have to do, unfortunately, because you know, we're talking to all kinds of folks, some of whom have never heard of Saint Dionysius, some of whom is Pseudo Dionysius, some of whom have a very bad impression of him, some of whom maybe have a good impression of him, is talk a little bit about who he is and why what he has to say is important."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4596.61,"end":4620.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, the base reference of course is from the scriptures that there is a Dionysius who hears St. Paul preach on the Areopagus and is converted to Christ as a result of hearing that preaching. Thus he is called Dionysius the Areopagite, the scriptural figure here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4620.9,"end":4630.67,"speaker":"Fr Stephen De Young","text":"Right. And that saint is the second bishop of Athens."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4631.23,"end":4634.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think isn't Athenagoras is the first."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4635.31,"end":4637.95,"speaker":"Fr Stephen De Young","text":"That was Herotheos. Anyway, Hierotheos."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4637.95,"end":4638.55,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Excuse me."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4638.55,"end":4639.07,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4640.83,"end":4643.39,"speaker":"Fr Andrew Stephen Damick","text":"One of those multi syllabic, dactylic Greek names."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4645.39,"end":4653.15,"speaker":"Fr Stephen De Young","text":"But so there is that figure within Scripture and the early history of the Church, the author."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4654.89,"end":4655.13,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4656.97,"end":4701.52,"speaker":"Fr Stephen De Young","text":"The works that we're talking about, the celestial hierarchy, the ecclesiastical hierarchy and some others, like the divine names, writes as that person. And I'm expressing it that way because that's something everyone can agree to. Right. We can all agree he writes as that person. So then there are folks who argue these works were written by that person in the first century A.D. okay. There's almost no one in the west who does that for the last six or seven hundred years. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4702.16,"end":4708.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But there's also the idea that you know, someone much later wrote them and then put his name on them."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4709.21,"end":4744.84,"speaker":"Fr Stephen De Young","text":"Right. Which is what pretty much everyone in the west has said for the last six or seven hundred years. And then within. Within the. The orthodox world, you have sort of versions of this is actually from the first century and this is later. But so we have a little different relationship. If this in fact was written by someone later in that, we would still not call him Pseudo Dionysius."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4746.04,"end":4750.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that pseudo idea is this notion that someone is lying."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4751.64,"end":4764.99,"speaker":"Fr Stephen De Young","text":"Right? Right. Essentially. Right. And attaching the pseudo in the west historically happened as a way of trying to discredit his writings because of how they were being used in the West."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4769.63,"end":4770.03,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4770.67,"end":4772.91,"speaker":"Fr Stephen De Young","text":"But it is within the realm."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4773.39,"end":4773.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4773.71,"end":4778.99,"speaker":"Fr Stephen De Young","text":"Of orthodox belief that that first century person who's in the Bible is a saint regardless."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4778.99,"end":4779.67,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4779.67,"end":4808.49,"speaker":"Fr Stephen De Young","text":"Right. But it is possible that a later person in the east who was, for example, a monastic, who had Saint Dionysius as his patron saint, wrote as Saint Dionysius, his patron, as a means of displaying humility, essentially not taking credit for his own writings."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4808.49,"end":4819.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's not trying to lie. And there's also another possibility, which is that these writings originated in the first century and then get added to, edited."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4820.06,"end":4917.38,"speaker":"Fr Stephen De Young","text":"Or whatever, updated, tweaked, handed down. Yeah. Much the way Scripture did, as they're passed down through time. So. Right. So in the west, the scholarly and sort of general consensus now is that they probably date to the 5th, 6th century and were probably written in Syria. Of course, this is, this is one of the places where the dissertations have to be written, articles have to be published, works in our favor. Because there's a thousand dissenters to that consensus. Right, yeah. As we said before on the show, this is how academia and scholarship is supposed to work. If there's a consensus, that's a bullseye. Right. We all need to rip it apart. Not, oh, it's a consensus we must all submit. Right. Yeah, but so there's everybody. Right. Questioning it sort of one way or the. Or the other. For my part, I'm not prepared to argue dogmatically that these were written in the first century, but I will say there are significant elements in Saint Dionysius's works that portray a great familiarity with the details of the Greco Roman paganism."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4918.18,"end":4935.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is important to point that out because generally people say this dates from the 5th century or maybe even later. Not later, but 5th century, because that's when quotes first start showing up. But by that point, paganism and the Roman Empire is kind of last week's."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4935.58,"end":4940.18,"speaker":"Fr Stephen De Young","text":"News is gone, frankly. Gone in any real way."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4940.74,"end":4949.3,"speaker":"Fr Andrew Stephen Damick","text":"So the texts indicate that whoever wrote them knew things about paganism that you kind of would need to be there to know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":4949.7,"end":5008.14,"speaker":"Fr Stephen De Young","text":"Yeah. That you wouldn't know at that point. Right. So that at least argues for something earlier than that. Or there being part of the text that's much earlier than the 5th century. You also have the issue with. I do not know of a good example. I'll put it this way. I do not know of a good example. Even though it's very common in scholarship to date something to maybe 30 years before the first time it's quoted that we know of. Right. I do not know of a case where that has turned out to be accurate. Because with something like this. Because people, ancient people, weren't stupid. Right. If someone wrote something and then came and said, this is 500 years old, they didn't buy it automatically."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5008.14,"end":5010.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5010.58,"end":5093.44,"speaker":"Fr Stephen De Young","text":"They knew it was something that had shown up recently. Right. You couldn't just walk into a bishop of the church office one day and say, behold, I have found the writings of St. Paul's disciple, St. Dionysius. Here they are. And the bishop would go, wow, this is wonderful. We need to change our theology to match this because it's so old. I believe you. Right. Like, that's not how this ever worked. And we have all kinds of counter examples, Right. Where, for example, you look at the Muratorian canon, right? And when the Muratorian canon talks about the shepherd of Hermas, it says, the shepherd of Hermas is not in the New Testament because it was written in our own day, in the middle of the second century. Right. And it says, you know, Hermes is Pope Pius Brother. Right. Like they know who wrote it. Like they say it was written by this guy. That's why it's not in the New Testament. But it's worth reading. The moratorian kin is not anti shepherd of firmas. Yeah, right. But they know it was written recently. So if people in the 5th century are quoting it as an ancient document, that means it may not go back to the first century, but it has to go back a good ways before the 5th."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5094.32,"end":5095.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5095.92,"end":5099.52,"speaker":"Fr Stephen De Young","text":"For them to think it was ancient, for them to think it was that old."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5099.76,"end":5112.45,"speaker":"Fr Andrew Stephen Damick","text":"And one of the big problems about all literature from that period is that as far as we can tell, the vast majority of the stuff that was written in that period in those first few centuries of church life is simply gone."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5113.17,"end":5115.09,"speaker":"Fr Stephen De Young","text":"That's not as far as we can tell, it's gone."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5115.41,"end":5115.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5116.05,"end":5118.53,"speaker":"Fr Stephen De Young","text":"We have lists from ancient libraries of works."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5119.09,"end":5120.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they're just gone."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5120.61,"end":5123.97,"speaker":"Fr Stephen De Young","text":"We have less than half of Plato. We have a tiny fraction of Aristotle."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5124.37,"end":5138.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's entirely possible that there's whole worlds of people quoting things or whatever that just didn't make it just over the history, you know, the vicissitudes of history. It just didn't get to our time."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5138.93,"end":5182.77,"speaker":"Fr Stephen De Young","text":"Right, right. And so all that is to say, while, you know, it's a modern and even a little pre modern project. Right. The years I gave for the change in consensus is not coincidental. Has to do with the rise of Modernism. Has to do with the beginning of the Protestant Reformation. And the Protestant Reformation trying to weed out what were and weren't authentic apostolic texts in the west, where there were lots of forgeries and stuff. Right. So different standards start getting applied in things and there's more of a suspicion and dubiousness of anything that claims to be ancient in the west."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5185.28,"end":5185.44,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5185.44,"end":5191.36,"speaker":"Fr Stephen De Young","text":"And one of the ways to try to discredit something is to historicize it in that way, to try and peg it as a late date."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5191.84,"end":5192.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5193.52,"end":5267.32,"speaker":"Fr Stephen De Young","text":"This is why our 19th century German friends were always trying to put the writing of New Testament books into the second century, Right. Make it as late as possible. And then later ON in the 20th century, you had scholars wanting to try to make the gospel of Thomas 100 years earlier than it was written, because the closer the apostles you could get it, the older you can make it, the more authoritative. So anything you don't like, you make late. Anything you do like, you make old. But that's a ploy, right? It's an obvious ploy. And so even if we have no mentions, let's say for the sake of argument, right, Just for the sake of argument, that, yes, some Syrian monk named Dionysius wrote all of the writings of Saint Dionysius the Areopagite in the 5th century. That wouldn't change the way in which the Church received and has used them theologically since."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5268.74,"end":5286.98,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. I mean, ultimately it kind of doesn't matter exactly when they were written because the Church has received them in a particular way and been using them all this time. And it's not been a blip on the radar. It's been persistent and consistent for centuries upon centuries upon centuries."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5287.62,"end":5288.02,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5288.42,"end":5289.54,"speaker":"Fr Andrew Stephen Damick","text":"It's not some fad."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5290.34,"end":5296.02,"speaker":"Fr Stephen De Young","text":"Right. It's not the new thing anymore. Right. Even if it was the new thing of the fifth century, it ain't the new thing now. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5296.45,"end":5296.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5298.21,"end":5308.69,"speaker":"Fr Stephen De Young","text":"So, yeah. So that, that is, again, that's Why? I don't feel the need to take any kind of dramatic dogmatic stance that, no, this must go back to the first century. Right. Because ultimately it doesn't matter."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5309.09,"end":5309.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5310.69,"end":5412.94,"speaker":"Fr Stephen De Young","text":"You know how I feel about dates anyway. So why did we go into all this about Saint Dionysus? Well, the place where the rubber meets the road on this is how he is reading. Right. How we're going to read and interpret St. Dionysius. And if you read, if you want the detailed version of this, here's a footnote citation for you. You could read Loski's Mystical Theology of the Eastern Church, where he talks about the Western and Eastern readings of Saint Dionysius, among others. But the west, the modern west, has read Saint Dionysius as a Neoplatonist. And this was a problem for various theological reasons that we're going to get into a little bit here for the Protestant Reformers and their children in the 17th century. And so rather than taking a different reading of Saint Dionysius, it was discredit these writings by having them be from another author, having them be late, et cetera, et cetera, et cetera. You also have to have them be late for him to be a Neoplatonist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5414.14,"end":5417.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because Neoplatonism doesn't rise in the first century."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5417.82,"end":5481.59,"speaker":"Fr Stephen De Young","text":"Right. Right. So realistically, it's got to be at least third century for someone, especially someone in Syria, to be influenced by Neoplatonism. Because you're talking about Plotinus and, And Porphyry. And why is, why is that important, the Neoplatonist element? Well, as we mentioned, the two works that we're talking about tonight that we've talked about before are the celestial hierarchy and the ecclesiastical hierarchy and the hierarchy, if you're a Neoplatonist, if you have serious. A serious case of Plato, brain means a hierarchy of being, ultimately. Right. So within Platonism, you have this polarity between being and becoming."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5483.22,"end":5483.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5484.26,"end":5492.02,"speaker":"Fr Stephen De Young","text":"That which is in flux, that which is changing, that which is imperfect, that which is impure. On the one hand."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5492.42,"end":5493.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of lower."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5494.34,"end":5500.42,"speaker":"Fr Stephen De Young","text":"And that which is eternal, unchanging, pure, whole. Right. On the other."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5501.38,"end":5501.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5502.02,"end":5506.34,"speaker":"Fr Stephen De Young","text":"And hierarchies, all hierarchies."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5507.63,"end":5507.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5507.79,"end":5530.27,"speaker":"Fr Stephen De Young","text":"Are ultimately hierarchies of being in this sense. Right. Because if we're talking about a hierarchy of perfection. Right. Well, then that becomes obvious. But if we're talking even about a hierarchy of like, good. Right. Purity is better than impurity. Right. Wholeness is better than lack."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5530.43,"end":5530.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5531.71,"end":5571.97,"speaker":"Fr Stephen De Young","text":"And so what ends up happening, and this happens in Western theology through the influence of Plato and the Platonic period in Western theology, which is roughly, give or take, the beginning of the 6th through probably the late 12th, early 13th century. You get God posited at the top of this hierarchy as pure being or as being itself. And then everything descending down the hierarchy from God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5573.17,"end":5573.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5573.97,"end":5589.47,"speaker":"Fr Stephen De Young","text":"Partakes of being, which is God in relative degrees, and then also partakes of becoming or lack or these kind of things, impurity purely by virtue of not being God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5592.91,"end":5593.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5595.63,"end":5634.2,"speaker":"Fr Stephen De Young","text":"And so if you take that kind of idea and apply it to Saint Dionysius celestial hierarchy, for example, what you essentially get is a sort of Gnosticism, because the ranks of angels become these sort of emanations of God working their way down toward humans. Right. Each one less perfect than the last, each one less pure than the last."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5635.16,"end":5635.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5635.52,"end":5668.88,"speaker":"Fr Stephen De Young","text":"As you work your way down. But you also get a kind of pantheism, or at least panentheism, where the being of beings, not to go all Heidegger on everybody, but the being of beings becomes God, which goes further than, say, St. Augustine, who was plenty Platonists. So St. Augustine would say everything is good in that it exists, that existence is good."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5669.12,"end":5669.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5669.44,"end":5680.4,"speaker":"Fr Stephen De Young","text":"This is how Anselm's ontological argument works for your real nerds. But he would not say everything is God in that it exists."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5681.36,"end":5683.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5684.4,"end":5689.2,"speaker":"Fr Stephen De Young","text":"That's moving from just a kind of Platonism into Neoplatonism."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5689.84,"end":5691.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5691.6,"end":5718.34,"speaker":"Fr Stephen De Young","text":"And. And that creates a deformed view. And then if you take that reading of the celestial hierarchy and then parallel it to the ecclesiastical hierarchy, the hierarchy of offices within ordained offices within the Church, right now, you're going to get something really interesting, right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5718.74,"end":5729.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, what you get is basically that bishops are. Are a different kind of thing, like an ontologically different thing than la."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5731.21,"end":5743.61,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. And it's also helpful, Right. To the West. Right. In particular, because of course, they have a single head of the visible church."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5744.01,"end":5744.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5744.73,"end":5746.97,"speaker":"Fr Stephen De Young","text":"It's which, if you're a Platonist. Right. One."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5748.1,"end":5749.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Oneness is always good."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5749.46,"end":5750.58,"speaker":"Fr Stephen De Young","text":"Oneness is very good."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5751.06,"end":5751.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5751.7,"end":5769.3,"speaker":"Fr Stephen De Young","text":"So you have this one at the peak. And so the grace that Saint Dionysius talks about that distinguishes the levels of this hierarchy gets thought of in these ontological terms."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5770.5,"end":5770.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5771.46,"end":5821.32,"speaker":"Fr Stephen De Young","text":"These terms of being. Right. That. And so when we're talking about ordination, Right. Then we're talking about the person ordained being turned into something else, into another kind of thing. Right. And so. And that even though we may not have been aware of it right before we started, maybe on this show for a Lot of listeners. When we started talking about the celestial hierarchy in those terms, you may have thought, well, a cherubim is a different thing than a seraphim. No, it's a different thing. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5821.72,"end":5822.12,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5824.12,"end":5830.34,"speaker":"Fr Stephen De Young","text":"This is where sort of that rubber meets the road. But we'll get into that more deeply here in a minute."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5830.58,"end":5841.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Because we actually have someone calling from Tennessee, I believe so. I'm sorry, William, I don't know where you're calling from. Where are you calling from? William, are you there?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5842.58,"end":5844.66,"speaker":"William Of Tennessee","text":"Yes, I am. And it's William of Tennessee."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5844.98,"end":5845.94,"speaker":"Fr Andrew Stephen Damick","text":"You are of Tennessee."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5845.94,"end":5846.74,"speaker":"Fr Stephen De Young","text":"Okay. All right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5846.74,"end":5847.34,"speaker":"Fr Andrew Stephen Damick","text":"Well, all right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5847.34,"end":5848.9,"speaker":"Fr Stephen De Young","text":"Were you born on a mountaintop?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5850.26,"end":5852.34,"speaker":"William Of Tennessee","text":"Well, the green estates and land of the free."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5852.66,"end":5853.94,"speaker":"Fr Stephen De Young","text":"Yeah. So there you go."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5855.08,"end":5858.84,"speaker":"William Of Tennessee","text":"I was raised in the woods, but unfortunately I do not know every tree. It's very sad."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5859.48,"end":5862.52,"speaker":"Fr Stephen De Young","text":"Did you kill a bar when you were three?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5863.48,"end":5865.96,"speaker":"William Of Tennessee","text":"I was five, actually. They exactly things."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5866.84,"end":5870.92,"speaker":"Fr Andrew Stephen Damick","text":"Late bloomer. So what's on your mind, William of Tennessee?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5873.24,"end":5916.26,"speaker":"William Of Tennessee","text":"So talking about ordination and of being, it sounds like taken and set apart into something else. I was wondering how that relates to Israel being a nation of priests in Exodus 19:5 and 6. Is that like the entire nation of Israel is ordained or the individual people ordained? Because to me it sounds like if Israel is a nation of priests, that requires some sort of ordination to be going on with either all the individuals or the nation as a whole, or both at the same time. So first, is there an ordination going on and either the nation itself or all the people or both? And if so, what is that ordination?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5917.19,"end":5946.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, in this language, right? This idea of a kingdom of priests, a holy nation, this gets repeated then in the New Testament to refer to the church as well. So it's an interesting question. And I mean, my short answer is going to say, no, they're not ordained to be priests in that sense of an ordained priesthood. But there is something like that going on here, right, Father."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5948.61,"end":5948.85,"speaker":"Fr Stephen De Young","text":"Actually."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5949.41,"end":5950.61,"speaker":"Fr Andrew Stephen Damick","text":"All right, good. Let's have it on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5950.61,"end":5952.45,"speaker":"Fr Stephen De Young","text":"Actually, I'm going to say yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5952.85,"end":5960.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yes. But also yes and yes. I mean, sort of. Right. They don't go through the stuff that Aaron and sons go through."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5962.45,"end":5968.13,"speaker":"Fr Stephen De Young","text":"And as we continue tonight, we're going to get more into this. But there are types of priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5968.61,"end":5969.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5969.85,"end":5971.97,"speaker":"Fr Stephen De Young","text":"Right. There are different sorts of priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5971.97,"end":5972.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":5973.25,"end":6047,"speaker":"Fr Stephen De Young","text":"And so when it talks about Israel being a kingdom of priests or when St. Peter talks about the church being a royal priesthood, that's a priesthood in relationship to the rest of the world, to those outside, and that has a primarily collective meaning. So we're used to as modern people thinking of things very individualistically. But if we take priest in the sense we've already been talking about it tonight, of representing God to the world and the world to God. Right. Israel as a whole was called as a whole in their life as a community, in keeping the commandments of the Torah through that communal life to represent God to the world, to be a light to the nations. Right. To the Gentiles. And they were called in their festivals. Probably the best example of this is at the Feast of Tabernacles or the Feast of Booths, when they offered the 70 bulls for the 70 nations."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6047.08,"end":6047.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6047.4,"end":6102.8,"speaker":"Fr Stephen De Young","text":"One for each nation to represent the nations to God. And so we collectively as a church have a royal priesthood that St. Peter talks about where we as the church and the way we live in community together, the way we love each other. Right. St. John says by this all men will know, right. You love one another. That we represent who Christ is to the world. And then when we come and we gather and celebrate the Eucharist, we're offering the Eucharist for the life of the world and for its salvation. Right. Which is Christ's sacrifice. So there is a collective level of priesthood there. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6103.12,"end":6114.88,"speaker":"Fr Andrew Stephen Damick","text":"It's almost like the phrase should rather be, rather than being translated like a kingdom of priests, rather a royal priesthood or even a priestly kingdom."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6115.04,"end":6117.35,"speaker":"Fr Stephen De Young","text":"Right. Royal priesthood is how it's done in Greek."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6118.06,"end":6118.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6118.7,"end":6167.95,"speaker":"Fr Stephen De Young","text":"That's why St. Peter's quote gets translated that way. Right. Citing the Greek. And so a person becomes a part of that priesthood. This is the ordination part. Right. In the Old Covenant by becoming a part of the people of Israel. So circumcision, eating, the Passover and then everything else that goes with that. Right. The commandments of the Torah, all that in the New Testament. And we'll see this in particular in the third half tonight. This is baptism Chrismation that we talked about in the last episode, that anointing, right. That you enter is in a sense an ordination in that you now enter into that collective priesthood. Does that make sense?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6169.48,"end":6172.44,"speaker":"William Of Tennessee","text":"It does. A follow up though."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6172.76,"end":6173.16,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6173.16,"end":6198.86,"speaker":"William Of Tennessee","text":"So if the nation itself is sort of the, the entity, is the priestly nation, an ordination, a priest isn't reordained. Every time they serve the Divine Liturgy, it seems that there's an event that's the entrance into the priesthood. So what is the ordination event for Israel? Is it the Exodus? Is it the Ten Commandments? What. What's that?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6198.86,"end":6209.58,"speaker":"Fr Stephen De Young","text":"Or is there one for the, for the collective? It would be the, the. The complex of Events from Passover to Pentecost."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6211.5,"end":6211.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6211.9,"end":6218.3,"speaker":"Fr Stephen De Young","text":"That begins with passing through the Red Sea and ends with the sprinkling of blood at the ratification of the covenant."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6220.87,"end":6221.43,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6221.59,"end":6222.87,"speaker":"William Of Tennessee","text":"Okay, and."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6222.87,"end":6225.11,"speaker":"Fr Stephen De Young","text":"And stay tuned for the third half."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6225.67,"end":6229.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, leave. I mean, I know it means staying up late, but you know, that's, that's the show you. Or."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6229.91,"end":6245.51,"speaker":"Fr Stephen De Young","text":"Yeah, or listen to the recording tomorrow of the third half, as the case may. May be for you. I don't know your time while you're in Tennessee, so. But yeah, because I, I know that may seem a little odd now, but we're going to get to something where I think it'll click."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6247.03,"end":6248.07,"speaker":"William Of Tennessee","text":"All right, thank you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6248.55,"end":6260.87,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you very much for calling William of Tennessee. Okay, so now that we've said that, and also a lengthy discursus about Saint Dionysus the Areopagite and how one ought."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6260.87,"end":6263.31,"speaker":"Fr Stephen De Young","text":"To read him and don't be a Neoplatonist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6263.31,"end":6264.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't be a Neoplatonist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6266.47,"end":6276.84,"speaker":"Fr Stephen De Young","text":"Yeah, that was the, that was the negative part. The negative part was don't be idioplatonists. We're going to, we're going to come back to here in a little bit to Saint Dionysius and talk about the better way to read him."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6277,"end":6285.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It does all have a point, everybody. It was not just a rambling bit of things about Dionysius the Areopagite."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6286.52,"end":6296.28,"speaker":"Fr Stephen De Young","text":"One last little bit about Neoplatonism also is that, of course, Neoplatonism was an attempt to make Platonism Christian. Ish."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6297.16,"end":6307.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Whereas the way that it's read a lot of times these days is that Christianity was Neoplatonized. Like, actually it goes the other way, guys."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6308.26,"end":6366.23,"speaker":"Fr Stephen De Young","text":"Right, right. That is. I mean, Porphyry, Plotinus, like that's what they were doing. Right. In the same way that Gnosticism was an attempt to take the status quo ideology of Greco Roman paganism and throw a Christian veneer on it during the early rise of Christianity. Neoplatonism is the same kind of move by, you know, I don't know if Plotinus actually was a member of the academy, but anyway, by Platonism, by philosophical schools. Right. To kind of try to appeal to the growing Christian market. Right. Don't run after this new Christianity thing. Right. What we've got is still good. What are the things that are attracting you to Christianity? Well, we've got those too. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6366.39,"end":6367.03,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6368.63,"end":6390.8,"speaker":"Fr Stephen De Young","text":"Or we can make it sound like it at least. Yeah. So when you see things in very early Christian texts and you jump to the conclusion, oh, this looks Gnostic often. That's because it's something that Gnosticism took and sort of pirated."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6391.6,"end":6392.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6393.84,"end":6402.81,"speaker":"Fr Stephen De Young","text":"Right. It's like if you've only ever heard Ice, Ice, baby, and all of a sudden someone plays under pressure, right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6403.85,"end":6404.49,"speaker":"Fr Andrew Stephen Damick","text":"You might not."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6404.49,"end":6411.13,"speaker":"Fr Stephen De Young","text":"You're like, oh, man, I know. Queen and David Bowie, they went and stole Vanilla Ice's sample."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6411.53,"end":6415.13,"speaker":"Fr Andrew Stephen Damick","text":"Except I think, what is it predated by, like 20 years or something like that?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6415.13,"end":6419.53,"speaker":"Fr Stephen De Young","text":"Exactly, right. Perfect analogy. Okay. So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6421.45,"end":6424.41,"speaker":"Fr Andrew Stephen Damick","text":"I didn't know that we'd go to Vanilla Ice tonight, but here we are."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6424.49,"end":6429.95,"speaker":"Fr Stephen De Young","text":"That whole bit just clicked for everyone. They know exactly what I'm talking about now because of that analogy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6432.83,"end":6433.23,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6437.07,"end":6494.89,"speaker":"Fr Stephen De Young","text":"We'Re gonna go back to the Book of Numbers. There's gonna be more Book of Numbers tonight than most people have had in many a year. Now we're going to numbers 18. I said we were going to come back there. This is the chapter after the rod budding, and chapter 18 is after the rod buds. Then God explains to Aaron what his job is. It's the short version, the very short summary of numbers 18. And the first bit of that, as we already mentioned, is this idea of bearing the sins of the people, carrying the sins of the people, Right? And what that means is that he is going to come into the sanctuary again as the representative of Israel. Right. As sort of the embodiment of Israel."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6494.97,"end":6495.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6497.77,"end":6540.02,"speaker":"Fr Stephen De Young","text":"He's going to come in with the sins of the people, to atone for the sins of the people. Right. To make atonement there with blood on the day of atonement, to offer the sacrifices, the sin offerings. Right. This is going to be his task. He is going to repent for the people in the sense that he is going to lead them in repentance. Right. And again, as we were just saying to our caller, we tend to think very individualistically."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6540.82,"end":6541.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6542.1,"end":6546.34,"speaker":"Fr Stephen De Young","text":"We tend to think very individualistically about sin. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6546.58,"end":6550.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're responsible for your sins, I'm responsible for mine. And it's not my."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6550.62,"end":6550.98,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6551.38,"end":6551.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6551.82,"end":6559.62,"speaker":"Fr Stephen De Young","text":"Right. And you know, hey, if I didn't do anything, right, then I don't need to repent of it. And this kind of thing, right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6560.04,"end":6560.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6560.52,"end":6654.12,"speaker":"Fr Stephen De Young","text":"And more than that, right. We being sinful, tend to justify ourselves. I did nothing wrong. Right. If you just understood the situation, you would see that I did the only logical, rational, good thing I could do. We want to defend ourselves. We want to rationalize. We want to justify ourselves. Right. All of these things. And so part of priestly leadership is leading in Repentance. And sometimes that can literally mean confessing things you didn't do, but that the other people did. Right. He's going and offering sin offerings for the sins of the people. His own also, but also all the people, all the things. Right. And he is repenting of them. And he's working to help repair. And repentance, as we've said, means he's working to help repair the damage done. He's leading them in doing that. And that's the core of what it means. Right. Enacting that healing, enacting that restoration, taking the leadership role in doing that is what it means to bear for Aaron to bear these sins. So again, sometimes we get distracted by our atonement theories."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6654.36,"end":6655.24,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6655.88,"end":6662.84,"speaker":"Fr Stephen De Young","text":"And Isaiah 53 is a passage of the Old Testament where people get very distracted by their atonement theories."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6662.92,"end":6672.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the one where it says Christ bore our sins and he was bruised for our iniquities. Bruised for our iniquities. Right. The suffering servant passage. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6672.08,"end":6706.34,"speaker":"Fr Stephen De Young","text":"Right. One of them. Yeah. One of the servant songs. Suffering servant. Right. And this turns into a whole thing about penal substitutionary atonement and this and that. And how do we read it? Right. But there is a much more basic reading of this, once again, that focuses on Christ as high priest. Right. Christ is high priest. Christ as high priest, as the one who leads and repents, as the one who represents humanity before God can lead them in repentance without being guilty of anything himself."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6707.62,"end":6709.14,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6710.98,"end":6727.01,"speaker":"Fr Stephen De Young","text":"And if we understand that connection, if we understand this bearing of sins as the role of the high priest, then what St. Matthew does in Matthew 8, 14, 17 makes sense."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6727.73,"end":6751.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, in that passage, it talks about Jesus healing various people of different kinds of ailments, of a fever, of sicknesses, of demon possession. And then he references Isaiah and says, thus it was written. You know, he bore our sins, and I'm blanking on the exact phrasing, but our diseases."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6751.25,"end":6756.32,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah. He took our quotes, Isaiah 53, and says, Thus it was fulfilled."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6756.72,"end":6757.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Exactly."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6758.08,"end":6758.44,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6758.44,"end":6762.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. St. Matthew says this fulfilled it when he healed these people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6762.96,"end":6774.16,"speaker":"Fr Stephen De Young","text":"If you try to make that work in St. Matthew's Gospel with some kind of atonement theory, what are you going to say? Christ healed someone's fever and he got a fever?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6774.72,"end":6778.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or he cast out a demon and became demon possessed."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6778.81,"end":6781.69,"speaker":"Fr Stephen De Young","text":"Yeah. It doesn't make sense."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6782.01,"end":6782.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6782.65,"end":6785.77,"speaker":"Fr Stephen De Young","text":"So minimally, that's not how St. Matthew is reading the passage."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6785.93,"end":6787.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. At the very least."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6787.29,"end":6831.61,"speaker":"Fr Stephen De Young","text":"Right. At the very least, St. Matthew is not reading Isaiah 53 that way. Right. And I think understanding bearing sin as part of the high priestly role makes sense of how St. Matthew reads it. And so there's this idea of, again, repentance as a collective activity. Right. Because going back to the spirits episode, Right. If a spirit, you know, sort of animates and motivates a collective. Right. And has agency, then it can sin, it can do evil."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6832.58,"end":6833.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6834.02,"end":6836.02,"speaker":"Fr Stephen De Young","text":"People do evil as groups."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6837.62,"end":6841.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. There is such a thing as systemic evil."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6841.62,"end":6864.39,"speaker":"Fr Stephen De Young","text":"Right. There is collective sin. I don't understand how someone could read the Old Testament prophets and not see this. Right. Like, was every single human in the Northern kingdom of Israel guilty of all of the sins that the prophets list and therefore worthy of being destroyed by the Assyrians individually?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6864.95,"end":6865.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6867.11,"end":6875.35,"speaker":"Fr Stephen De Young","text":"Right, right. Did being personally innocent give you plot armor where you could just walk past Assyrians who are gutting everyone else?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6875.51,"end":6881.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, people suffer for evils committed by other peoples all the time."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6881.75,"end":6895.18,"speaker":"Fr Stephen De Young","text":"Yes, all the time. And you can structure your society in a way. You can live as a community in a way that is evil and that victimizes people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6895.82,"end":6898.46,"speaker":"Fr Andrew Stephen Damick","text":"Yep. I mean, that's basically human history."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6898.86,"end":6909.34,"speaker":"Fr Stephen De Young","text":"Yes. This is. This. I mean, this is just abundantly obvious. Right. Until we start speaking theologically, then we become super individualistic of who's guilty, who's to blame."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6909.74,"end":6971.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the other thing is, like, what is repentance? Right. It's not just, I did a bad thing and so I'm sorry, it's about putting things in the proper order. Like, it's, you know, it's. It's healing things. Right. So someone can do that without being personally guilty of having caused the harm. Right. So. So it's possible for a nation, generations after some evil that their ancestors did, to repent, which means that they're putting things in the proper order. They're making right what was made wrong, even if they're not personally guilty of the evil. You know, I mean, we could also look at it from another direction, which is, as it says in Scripture, if you know to do good and you don't do it, that's a sin. You know, that you didn't do good is a sin. Not just that you did a bad thing, it's that you didn't do a good thing. That's sin, and we need to repent of that too."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":6972.06,"end":7034.95,"speaker":"Fr Stephen De Young","text":"Right. And when you're doing evil as a collective, you have to repent as a collective and therefore change and transform as a collective. Right, right, right. So if you have a society where Everybody at age 30 has to go on the run because they get executed. There's a reference, five people died anyway. Then you're a little hungry, Father. You have to dismantle that society and rearrange it. That's murdering people at a certain age. If I don't know, you've got a society where for your economy to function, you have to have a certain level of unemployment. And so you have some kind of central bank that deliberately drives up the unemployment rate for the health of other parts of the economy and impoverishes people and immiserates them. At some point you need to do something about that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7035.83,"end":7037.35,"speaker":"Fr Andrew Stephen Damick","text":"That sounds fictional, Father."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7037.59,"end":7181.55,"speaker":"Fr Stephen De Young","text":"Yes. I've just made up two completely unrealistic examples there, or cited Logan's run and then another completely unrealistic example. So this happens at this collective. This collective level. Right. And this is part of what we're talking about with the caller. Right. That part of why this collective priesthood is important, because one individual by himself cannot show the world, let alone just a community, a completely different way to live a communal life. But a community can. Yeah, right. A church community that becomes a real family and fulfills what due to everything in society, families are no longer able to fulfill. When that gets fulfilled in the extended family of the church, that shows the outside world that there's another way to live and another way to do things that's grounded in the love of Christ. Right. And can be transformational. But you can't, you can't do that by yourself. This one random individual, Right. He could protest or she could protest what's going on in the community. Right. But you can't demonstrate in the way that a community can. So slight digression, but not a worthy one, I think. Yeah. So then back to numbers 18. So then the second part of numbers 18 gives the other sort of central. And there's actually more ink spent on this than on the sin bearing part. So this is sort of the main job that Aaron is given in numbers 18 is essentially for the high priest to serve as a throne guardian."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7182.83,"end":7184.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7184.79,"end":7203.51,"speaker":"Fr Stephen De Young","text":"The idea is that he's going to protect sacred space of the tabernacle, in the case of Aaron, later the temple. And it's not coincidental that in Saint Dionysus the Areopagite, in the celestial hierarchy, it's the seraphim and the cherubim, the throne guardians, who are at the top."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7204.55,"end":7205.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7205.35,"end":7207.03,"speaker":"Fr Stephen De Young","text":"Parallel to the high priest at the top."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7207.99,"end":7243.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we actually got recently someone asked this question in our Facebook group, why does God need Throne guardians, right? It's like God doesn't need to be protected. It's not, it's not God being protected because obviously God does not need to be protected. It's us being protected in a sense from God. Not that they're like standing there holding them back, like, don't do it, don't do it. You know, that's not what's going on. It's that as humans enter into the presence of God, if we do it in an unworthy manner, then it destroys us."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7244.49,"end":7245.45,"speaker":"Fr Stephen De Young","text":"Death by holiness."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7245.61,"end":7266.81,"speaker":"Fr Andrew Stephen Damick","text":"Death by holiness. Right. So throne guardians are there actually to guard us in a sense from the throne, just as the angel that guards paradise after the expulsion from paradise of Adam and Eve. They're not guarding paradise from being sullied by Adam and Eve, they're guarding Adam and Eve from destroying themselves by entering back into Paradise. Paradise. That's what's going on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7266.81,"end":7285.17,"speaker":"Fr Stephen De Young","text":"Drawing near to the Tree of Life. They're keeping them away from the Tree of Life so they won't live forever in their evil state. Yeah, right, yeah. And so it's repeated several times in numbers 18 that, that, that Aaron and his sons are going to be there. Right. To draw near to God and so that the other people won't do that and die."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7285.89,"end":7288.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7288.69,"end":7332.8,"speaker":"Fr Stephen De Young","text":"This is the central. This is the central chop. And so this. I don't know if it's just the circles I'm quote unquote traveling in or if this is on the rise or if it's just something I've seen a lot lately at random. And I'm being anecdote Andy, but there has been a lot of talk from non Orthodox folk when talking about the Orthodox Church that something they don't like about the Orthodox Church is that the Orthodox Church will not just give the Eucharist to anyone who identifies as a Christian."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7333.68,"end":7334.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7336.56,"end":7360.14,"speaker":"Fr Stephen De Young","text":"And often the rejoinder, and this is the correct rejoinder, is pointing people to 1 Corinthians 11:27 through 30, where St. Paul talks about the one who approaches in an unworthy manner. Right. Is eating and drinking judgment. And this is why some of you have gotten sick and some of you have died. Right. And so that is the right place to point people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7361.18,"end":7361.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7362.06,"end":7429.68,"speaker":"Fr Stephen De Young","text":"But what we can see here in numbers 18 is that this is a primary. I would say the primary, this is Job one of the priesthood is that the priest is the one through whom people are able to worthily draw near to God safely and that others that need to be protected. So not giving the Eucharist to Anyone who I don't know is approaching in a worthy manner is my primary job as a priest. Not having meetings, not doing counseling. Right. Not leading prayers, blessing food at coffee hour. Right. What gets called in the west in Protestant circles, fencing the table. That's job one for the precinct. Fencing the table according to the Bible. Wow."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7429.68,"end":7534.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and there is within the Orthodox ordination of a presbyter, a priest, there's a part that happens kind of after the ordination proper. The man is already a priest. But there is an element that happens where after the bread and the wine are consecrated to become the body and blood of Christ, that the bishop will take that consecrated bread, the body of Christ, and place it in the hands of the newly ordained priest and will say, I'm sure I'm going to be paraphrasing a little bit, but he basically says, receive this pledge and guard it and keep it until the dread day of the second coming of Christ when he will ask you to give an account for it or something to that effect. Which is. Has the very big, long, complicated Greek term, the parakatathiki, which often gets translated as the charge. I think in modern Greek it means something like a deposit. So it's the same kind of idea. You know, this is a. A guardianship that's being handed over to this priest. And the guardianship is not. I mean, on the one hand, it is, yes, don't let anything harm the body and blood of Christ. You know, see that it's treated with reverence and so forth. But also it is, as you say, there's a sense of guardianship of those who approach it to make sure that they're approaching God in a way that is going to be beneficial for them and not harmful for them."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7535.17,"end":7546.77,"speaker":"Fr Stephen De Young","text":"Right, Right. I don't refuse people communion. Anyone who wants to could come into my parish and receive the Eucharist. There are certain things you're going to have to do first."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7547.73,"end":7549.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7549.41,"end":7553.25,"speaker":"Fr Stephen De Young","text":"But you are invited to do those things and then receive the Eucharist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7553.81,"end":7557.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So if someone doesn't want to do those things, that's on them."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7557.89,"end":7569.78,"speaker":"Fr Stephen De Young","text":"That's their choice. Right. And that's fine. Right. It's your own free will. If you don't want to do those things, don't do those things. Right. But if you're not willing to do those things, then I can't give you the Eucharist because it could destroy you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7570.98,"end":7571.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7571.7,"end":7572.74,"speaker":"Fr Stephen De Young","text":"So I'm not going to do it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7572.82,"end":7576.34,"speaker":"Fr Andrew Stephen Damick","text":"You can get sick, you can die, you can be spiritually destroyed, but I."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7576.34,"end":7580.9,"speaker":"Fr Stephen De Young","text":"Am here to outline what those things are for you. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7583.94,"end":7584.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7584.66,"end":7588.99,"speaker":"Fr Stephen De Young","text":"So back to Saint Dionysius."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7590.99,"end":7591.63,"speaker":"Fr Andrew Stephen Damick","text":"Dennis."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7591.63,"end":7592.03,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7594.67,"end":7595.55,"speaker":"Fr Andrew Stephen Damick","text":"Saint Denis."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7596.11,"end":7598.35,"speaker":"Fr Stephen De Young","text":"There you go. Saint Denis. Yeah. I don't know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7598.35,"end":7604.75,"speaker":"Fr Andrew Stephen Damick","text":"I know it is literally the French version, but I don't know. There's something grander about Dionysius versus Dennis."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7604.99,"end":7608.67,"speaker":"Fr Stephen De Young","text":"Yeah, I don't know. Yeah, well, Dennis is a menace. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7608.67,"end":7609.71,"speaker":"Fr Andrew Stephen Damick","text":"So there's that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7612.6,"end":7669.35,"speaker":"Fr Stephen De Young","text":"So we noted already, right, that this connection between high priest and at the top of the ecclesiastical hierarchy and seraphim and cherubim at the top of the celestial hierarchy is that they have the same job, they have the same task, they have the same role. That is a very different concept than them being the same thing. Right. Because objectively, they are not the same thing. A seraphim and a bishop are not the same thing. Is a human one, is a seraphim."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7669.67,"end":7672.95,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. They're not the same thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7673.67,"end":7769.31,"speaker":"Fr Stephen De Young","text":"So at the level of being this kind of Neoplatonic hierarchy, they are not the same thing. They are not parallel in that way. Nor is there some kind of parallel in a kind of change of being sort of as cherubim is to throne, so bishop is to presbyter, in terms of what they are, some kind of analogy of being. That is kind of hard to even figure out what that would mean. Right. So that Neoplatonic interpretation fundamentally falls apart, unless you want to take Saint Dionysius completely out of the context of Christianity and the Scriptures, which seems odd. So what you have, as we mentioned in Saint Dionysius, is the idea that what separates these hierarchies from each other is grace. And so a lot of what happens between west and east here, and even different parts of the west has a lot to do with how grace is defined. Right. So our Eastern reading of Dionysius would be more like. Because we understand grace to be the divine energies, meaning divine activity, meaning God working."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7770.27,"end":7770.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7771.23,"end":7789.79,"speaker":"Fr Stephen De Young","text":"So for us, the ecclesiastical hierarchy and the celestial hierarchy fundamentally mean that God is working through the different ranks of this hierarchy in different ways. He is doing different things through these beings, whether they're angelic beings or humans."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7789.95,"end":7791.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but it's always God doing it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7792.11,"end":7807.51,"speaker":"Fr Stephen De Young","text":"It is God doing it. It is God working through them. Right. And so this is why we could talk about there being kinds of priesthood, which we already did."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7807.67,"end":7808.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7808.03,"end":7828.56,"speaker":"Fr Stephen De Young","text":"There's a kind of priesthood that even after the golden calf, that the elders of the people still possessed, but there's also a kind of priesthood, the sacrificial priesthood, that they no longer possessed. Right, right. Why God was still working to do certain things through the elders of the people. Like justice."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7829.84,"end":7830.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7830.24,"end":7845.36,"speaker":"Fr Stephen De Young","text":"To render judgment, to resolve disputes, to keep order. Right. God was still working through those people, just in a different way than he was working through Aaron and his sons to accomplish different things than he was accomplishing through Aaron and his sons. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7845.76,"end":7866.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's a really important principle. And I mean, I know I've said this before on the show, that every good thing comes from God. Everything good that is happening is God doing. Doesn't mean that the people who are doing it are not also doing it, but as they do it, they are participating in God's works. There's not any independent good."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7867.16,"end":7874.28,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, this is why God can call good works done by humans good."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7875.48,"end":7875.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7876.69,"end":7878.13,"speaker":"Fr Stephen De Young","text":"Because they're his works."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7878.21,"end":7879.73,"speaker":"Fr Andrew Stephen Damick","text":"Those are his works. Yep."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7880.37,"end":7906.01,"speaker":"Fr Stephen De Young","text":"And so just like at creation, he can look at them and call them good. So when we talk about an ordained priesthood, we're saying that God is working through the ordained man in a particular way. Right. Not that there's this clergy, laity divide where God works through the clergy and does not work through the laity."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7906.65,"end":7907.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7908.41,"end":7979.1,"speaker":"Fr Stephen De Young","text":"God works through some people and not through other people. We mean, God is working through and accomplishing things through the clergy that are different than it's particular things that are happening through clergy. And when we talk about that communal priesthood, there are things that God is doing in and through the community as a whole. Right. That are different than things he does through various individual persons. So this is a sort of critically important distinction because the Western reed. Right. And this is parallel with the Western read of Dionysius is that the Western read, at least going into the Protestant Reformation we should say, was that ordination imparted certain powers and abilities. It changed the character of the human person."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7979.98,"end":7984.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Charisms, gifts, indelible mark."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7985.1,"end":7990.87,"speaker":"Fr Stephen De Young","text":"Right. That this person is now different than he was in an ontological way."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7991.35,"end":7993.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He became a different thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":7993.43,"end":8074.51,"speaker":"Fr Stephen De Young","text":"Yes. The priest is a different thing. And then all the way up to. Right. The bishop of Rome is a different thing. Right. Than even. Because the papacy is a different office than the episcopate for Roman Catholicism. And so at each of those levels there are powers, abilities. Right. I'm using powers in sort of the Aristotelian sense. Right. Dynamis that can be actualized by the person. They can do things. So to give just a very. And we'll elaborate more on this, but just to give a very bare bones example. Right. We would say as orthodox Christians that the Holy Spirit works through the clergy and the laity to make bread and wine, be the body and blood of Christ on the altar in the liturgy. Right. But it's the Holy Spirit that does it. Roman Catholicism teaches that the ordained priest and above the ordained priest has the power by saying the words of institution to consecrate the Eucharist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8075.87,"end":8083.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is why it's indelible, because you can't change back from being."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8083.51,"end":8086.99,"speaker":"Fr Stephen De Young","text":"Even if he's deposed, he could still consecrate the Eucharist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8087.31,"end":8093.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now they would call it valid, but illicit, but still valid. Like it still is the Eucharist."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8093.42,"end":8095.18,"speaker":"Fr Stephen De Young","text":"He has the power to do it. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8095.18,"end":8095.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8096.54,"end":8100.14,"speaker":"Fr Stephen De Young","text":"So that's sort of a where the rubber meets the road example."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8100.78,"end":8101.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8101.9,"end":8108.3,"speaker":"Fr Stephen De Young","text":"And this, this view interacts in interesting ways."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8108.86,"end":8109.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8109.66,"end":8139.77,"speaker":"Fr Stephen De Young","text":"In the history of the West. So a lot of people don't read St. Augustine's anti donatist works. Right. Everybody likes to read the anti Pelagian works and fight about it. Fewer still, I think, read the anti Manichean works. But. So the Donatist argument gets misconstrued sometimes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8140.81,"end":8142.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think the way that most."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8142.89,"end":8143.94,"speaker":"Fr Stephen De Young","text":"Because it gets shorthanded."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8144.41,"end":8171.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The shorthand version is that people say that the Donatists were teaching that if someone, if a clergyman is a sinner, then his sacraments don't work, that they're not real. Right. That basically his moral character stops his sacramental ministry from actually working."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8172.91,"end":8207.79,"speaker":"Fr Stephen De Young","text":"Right, right. And if you can, that would make sense. Right. If the Donatists held to like what's now the Eastern Orthodox view. Right. If the Donatists held to the idea that God was doing this through humans and they were just saying, well, hey, God wouldn't do that through an unworthy human. Right. You could see the argument. They'd still be wrong, but you could see the argument. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8207.87,"end":8211.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. But that's actually not. The argument they were actually making is."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8212.19,"end":8213.31,"speaker":"Fr Stephen De Young","text":"More complicated than that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8213.31,"end":8224.11,"speaker":"Fr Andrew Stephen Damick","text":"A little bit more complicated. Yeah. It's. It's really that if you had been given the power to perform the sacraments, then you would be holy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8225.01,"end":8240.77,"speaker":"Fr Stephen De Young","text":"Right. So grace that came. Yeah, right. The grace that came to you that would empower you. Right. To consecrate the Eucharist or to baptize or to do these things would have a transformative effect on you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8241.57,"end":8261,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it's interesting. There's actually an argument now, I don't think it ever is official, but it is promulgated by a pope in the 11th century, the Dictatus papai, which says that the Pope becomes A saint by virtue of his office. Again, not an official Roman Catholic teaching."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8261.32,"end":8261.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8261.72,"end":8274.04,"speaker":"Fr Andrew Stephen Damick","text":"But it's the same kind of idea. Right. The idea that by virtue of being given this particular grace, there is a transformative effect on the person such that they would not sin in particular kinds of ways."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8274.28,"end":8279.17,"speaker":"Fr Stephen De Young","text":"Right. And so therefore, if they sin in those ways."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8280.37,"end":8280.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8281.01,"end":8287.25,"speaker":"Fr Stephen De Young","text":"Then that is proof that they don't have the grace to do what they're trying to do."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8287.65,"end":8291.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which loops back then to that kind of shorthand version of the way people."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8291.61,"end":8310.71,"speaker":"Fr Stephen De Young","text":"Talk about the righteous. Right, right. So the shorthand is completely wrong, but it's lacking in nuance. Right, yeah, but that's evidence. And so of course, the big issue that precipitated Donatism was those who, under torture or under threat, denied Christ during the persecutions."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8310.95,"end":8322.19,"speaker":"Fr Andrew Stephen Damick","text":"Right. They apostatized in the midst of that. And then the question is, if they repent, can they come back into the church? Are they still clergy?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8322.19,"end":8327.67,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And were their sacraments valid in the first place ever?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8327.67,"end":8330.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. There's a kind of retroactive."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8330.79,"end":8349.75,"speaker":"Fr Stephen De Young","text":"Right. Because clearly they would have had the grace to resist like the martyrs did. Right. If they were holy people. So this is evidence that they were sort of frauds all along. Right. And this is what you get when you believe in irresistible grace. Anyway."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8351.43,"end":8351.83,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8354.39,"end":8421.7,"speaker":"Fr Stephen De Young","text":"Right, so St. Augustine is opposing the donatists. Right. And St. Augustine essentially agreed that grace brought a kind of power. Right. To, to do these things in terms of the, the sacraments. Right. He was in line with the general Roman Catholic, what later became the Roman Catholic view. Right. The Western view, but he actually visited Donatists. He visited Donatists, churches, communities. Right. And while there, he saw genuine love between people within those communities. Right. Even though they were sort of rigorous. So this caused a problem for St. Augustine because he held that view, caused a problem with his ecclesiology because he said, well, wait a minute, humans who aren't, haven't received the grace of God, humans who, who haven't received this grace, they can't love each other like this."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8423.14,"end":8423.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8424.9,"end":8438.08,"speaker":"Fr Stephen De Young","text":"Right. And so that must mean that the Dadatas, even though they're in schism, still have something happening here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8439.04,"end":8439.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8439.48,"end":8462.72,"speaker":"Fr Stephen De Young","text":"Right. And so the way St. Augustine reconciled that is within the anti Humanichaean writings and the anti Donatist writings, he still expresses a lively belief in the freedom of the will. Right. So having a power doesn't mean you utilize that power. Having dynamis doesn't mean you actualize it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8462.98,"end":8466.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So that's how he kind of Works it out."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8467.06,"end":8482.98,"speaker":"Fr Stephen De Young","text":"And that's. And that's part of how he. Right, he works it out. So I am now, I don't know, I feel like I'm fibbing to even say this. I'm gonna. I'm gonna sound briefly like I'm saying something nice about John Calvin and then I'm not."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8484.5,"end":8487.62,"speaker":"Fr Andrew Stephen Damick","text":"Wow. That moment when our Calvinist friends actually."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8487.7,"end":8491.65,"speaker":"Fr Stephen De Young","text":"Become our Calvinist friends, You mean there's a chance now?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8493.09,"end":8494.53,"speaker":"Fr Andrew Stephen Damick","text":"So you're saying there's a chance."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8495.73,"end":8519.92,"speaker":"Fr Stephen De Young","text":"So there is a quotation attributed to John Calvin and you said you've seen it attributed to Luther. So it may just be a meme. Who knows? May just be some kind of Reformation meme. But the idea being that if the devil. This is talking about the whole donatist issue, Right. That if the devil himself baptized you in the name of the Trinity, you'd be baptized."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8520.64,"end":8524.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is the most anti Donatist thing that whoever that wrote said this could think of."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8524.96,"end":8575.05,"speaker":"Fr Stephen De Young","text":"Yes, yes. Which may have been John Calvin or maybe not. So the idea there being that who does it is irrelevant. Right. But now this also, though, when you follow that out and you can see this in Calvin's view of the sacraments and even more so in Calvin's successor's view of the sacraments, because frankly, when you look at a lot of them, I don't think they understood what Calvin said about the Eucharist, for example. I think it confused them. And so they went with Zwingli. And this is going to the sort of opposite pole where the sacraments and God working is not mediated through a human at all."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8576.09,"end":8579.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's just, yeah, me and Jesus."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8580.17,"end":8627.48,"speaker":"Fr Stephen De Young","text":"Right. So while there's a certain sense where kind of all Christians could agree that Christ is ultimately the minister of all sacraments, which is a sort of buzz phrase that comes out of this. Right. A Roman Catholic could agree to that because they could say, well, the priest acts in Persona Christi. So, yeah. And a Protestant could agree with that, coming from this kind of perspective by saying, yeah, God just does it directly. God acts. The human is irrelevant, but they're meaning very different things. So in between this sort of Western polarity of, on the one hand, the priest is invested with these powers to do these things which he can then utilize at his will on the one hand. And on the other hand, God just acts utterly independently of humans."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8628.6,"end":8629,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8629.88,"end":8661.35,"speaker":"Fr Stephen De Young","text":"And doesn't need humans. Well, he doesn't need them, but does not stoop to use and work through humans. Is the orthodox view that God acts through humans. So it is God acting, but it is through humans. That has some consequences. That means that you being the person through whom God acts in certain ways, meaning ordination or calling to any particular thing is revocable."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8663.27,"end":8663.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8664.79,"end":8668.79,"speaker":"Fr Stephen De Young","text":"Right. That a person can be a priest and then not be a priest."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8669.83,"end":8670.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8673.19,"end":8682.92,"speaker":"Fr Stephen De Young","text":"Because it's not a question of a power being given and a power being taken away. That power constituting a change of what something is. Again, the Platonist thing out of here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8683,"end":8691.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a continuity from God within the church. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8691.96,"end":8694.04,"speaker":"Fr Stephen De Young","text":"I mean, the Holy Spirit dwelt in Saul."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8695.24,"end":8695.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8695.56,"end":8698.12,"speaker":"Fr Stephen De Young","text":"And then left him and empowered him to be the king of Israel."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8699.16,"end":8699.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8699.52,"end":8702.04,"speaker":"Fr Stephen De Young","text":"God was working through him to establish justice."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8702.12,"end":8702.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8702.48,"end":8708.26,"speaker":"Fr Stephen De Young","text":"And to exercise his reign over the people of Israel through Saul. And then he didn't."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8709.62,"end":8924.7,"speaker":"Fr Andrew Stephen Damick","text":"The place where it left, which. It's interesting. So there's an interesting case that comes up then of laicization or deposition from the priesthood, which is when someone, when a man who's a priest or a deacon or in some cases a bishop, has that removed from him by the authority over him. Right. Sometimes that's called defrocking. And so they can no longer do the sacraments. Now, in the Roman Catholic tradition, if that happens, then they're not allowed to do the sacraments, but they can do the sacraments. So that's why they have this category of valid but illicit. So it's real. If a defrocked priest does the Mass, the Eucharist is real, but he's behaving illicitly, illegally, essentially within church law. Whereas from the Orthodox point of view, if someone's laicized and he does not have the blessing, he's had his priesthood removed from him by his bishop, or if he's a bishop, his episcopacy removed by his synod, then he can't do those things. I mean, he could go through the motions. Right. He could put on his vestments and say the words and whatever, but it would not be. It would not be real. But then what's interesting, then, in both traditions, there is the possibility for restoration. Right. So you could theoretically refrock, I guess, a defrocked priest in the Roman Catholic Church, to the best of my knowledge, that's possibility. And they would say, well, he was validly a priest the whole time, but now his licitness has been essentially returned to him. For the Orthodox, when that's. The possibility of restoration is there, and that's within the context of someone being deposed unjustly. Right. So there is, within the canonical tradition, the possibility for someone being returned to the priesthood who was deposed unjustly. And when that's done, he's not then reordained. Right. And so one could say, oh, well, you basically believe the same thing the Catholics do. And the answer to that is actually no, that even though someone can be returned to the clerical orders without an ordination that they could not have done, they could not have performed the Eucharist or other sacraments in a way that would be true during that time when they were judged to be deposed. Because the ministry is not something that is contained in the man. It functions within the community of the Church. So that's a pretty significant difference. So a laicized person cannot perform sacraments during that period of laicization, even if it comes to an end at some point in the future, which is theoretically possible, Although doesn't happen that often, but it is a thing people do get restored if the deposition was regarded as being unjust in some cases. Probably not in every single case, but it has a thing that has happened for sure in the past. So this particular case sort of underlines that difference in the way that ordination is understood between the Roman Catholic Church and the Orthodox Church."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8925.1,"end":8938.62,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And this also means that any given person for any given role, including various kinds of priesthood, is interchangeable."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8939.5,"end":8940.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8940.22,"end":8946.62,"speaker":"Fr Stephen De Young","text":"In the sense there is nothing about that person that necessitates them being the one through whom God works."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8946.92,"end":8949.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not De Young sacraments and damic sacraments."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8950.44,"end":8960.92,"speaker":"Fr Stephen De Young","text":"It's a gift. Right. So if I could no longer be a serve as a priest. Right. Another priest would come here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8963.16,"end":8964.28,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8964.6,"end":8972.44,"speaker":"Fr Stephen De Young","text":"Like I am. I am not like the only one. There's not some. It's a gift. There's not something about me. I didn't earn it. I didn't achieve it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8972.74,"end":8972.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8973.38,"end":8981.86,"speaker":"Fr Stephen De Young","text":"Like it's a gift. Someone else could be the same gift. God can do it through anyone. If I just refuse. Right. God will do it through someone else."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8981.86,"end":8982.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8983.22,"end":8994.5,"speaker":"Fr Stephen De Young","text":"Or just directly if we all refuse. Right. He'll do what he'll do. Right. And also, as you mentioned, Right. This is. Priesthood is a role within the community."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8995.38,"end":8995.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":8995.74,"end":9008.5,"speaker":"Fr Stephen De Young","text":"This emphasis on role and task, it's a role within community. So another difference between us and Roman Catholic priesthood is that Orthodox priests cannot celebrate the Eucharist by themselves."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9008.82,"end":9014.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There is no solo Divine Liturgy. It's not a thing. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9015.54,"end":9031.44,"speaker":"Fr Stephen De Young","text":"And so that is because we have to have the community there. We have to have the laity there because we're serving that role in and for the community. It's not just an ability that we have indeed."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9032.64,"end":9040.88,"speaker":"Fr Andrew Stephen Damick","text":"All right. We're going to take our second and final break. And in the third half we'll be back and we will finally actually talk about the actual rite of ordination itself."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9041.12,"end":9042.32,"speaker":"Fr Stephen De Young","text":"So as is our want."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9042.48,"end":9043.68,"speaker":"Fr Andrew Stephen Damick","text":"As is our want. All right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9043.68,"end":9044.8,"speaker":"Fr Stephen De Young","text":"We'll take a break later."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9045.12,"end":9047.04,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And we'll be right back."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9047.28,"end":9099.71,"speaker":"Voice Of Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your call. Calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9100.03,"end":9108.24,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help clean polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9108.24,"end":9112.44,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a tovarish you could count on."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9113.16,"end":9120.24,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9120.24,"end":9122.72,"speaker":"Fr Andrew Stephen Damick","text":"Church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9122.72,"end":9127.8,"speaker":"Fr Stephen De Young","text":"Dervish Parish didn't even know her name. It wasn't anything they thought about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9128.52,"end":9155.4,"speaker":"Voice Of Steve","text":"To find this book and others like it, you can go to store.ancientfaith.com again, that is store.ancient faith.com. we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 855-AFraid Radio."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9157.48,"end":9173.08,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of the Lord of Spirits podcast and we're continuing to talk about ordination. This is the fourth in our series on the sacraments of the Orthodox Church. And this is our final episode before the end of this year. Can you believe it?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9174.84,"end":9176.36,"speaker":"Fr Stephen De Young","text":"Yes, I have a calendar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9179.56,"end":9183.4,"speaker":"Fr Andrew Stephen Damick","text":"Father Stephen's level of incredulity is never at the same height as mine, apparently."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9183.64,"end":9187.67,"speaker":"Fr Stephen De Young","text":"Yeah, it's true. It's true. I face hard facts."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9187.99,"end":9200.15,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep, it's true. Yeah, we'll be back, you know, in the new year, second Thursday of January, of course, although that's going to be a pre recorded episode."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9200.63,"end":9201.15,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9201.15,"end":9203.19,"speaker":"Fr Andrew Stephen Damick","text":"Because you and I are both going to be in."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9203.19,"end":9205.67,"speaker":"Fr Stephen De Young","text":"We're going to be convening in a."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9205.67,"end":9215.36,"speaker":"Fr Andrew Stephen Damick","text":"Special way Right deep in the heart of Texas, I guess. I'm not sure where Dallas is in Texas, actually, because I'm not looking at a map of Texas."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9215.44,"end":9226.72,"speaker":"Fr Stephen De Young","text":"Technically. I don't know if Dallas is technically North Texas. If it's not, it's right on the edge. You go up to Denton, you're definitely in North Texas. So I think Dallas kind of counts as North Texas."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9227.6,"end":9234.64,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, I mean, I'm just hearing the Yellow Rose of Texas in my head right now, but it's okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9235.8,"end":9239.6,"speaker":"Fr Stephen De Young","text":"You know what? That song's actually. No, I don't care about that on air. Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9239.6,"end":9239.96,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9240.92,"end":9242.04,"speaker":"Fr Stephen De Young","text":"So you'll look it up later?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9242.2,"end":9252.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I used to know. I don't want to know anymore now. Right. We're talking about ordination. We're not talking about Texas."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9253.72,"end":9276.87,"speaker":"Fr Stephen De Young","text":"But speaking of Dallas, when in Dallas, I'm going to do a commercial. When in Dallas, Go buy Titan Comics and say hi to Jeremy Shore, the owner and proprietor, Best comic store in what is probably North Texas. We just kind of established. Anyway, I'm just doing all these free commercials now. I'm just."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9276.87,"end":9277.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9277.99,"end":9285.67,"speaker":"Fr Stephen De Young","text":"I would have to come up with one, like, every episode, just potentially completely at random, just for somebody I like, somewhere with the business. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9285.67,"end":9291.23,"speaker":"Fr Andrew Stephen Damick","text":"I know. I should throw out some commercials of my own. I'm just putting that out there as well."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9291.47,"end":9292.43,"speaker":"Fr Stephen De Young","text":"Saturday. Saturday."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9292.51,"end":9292.91,"speaker":"Fr Andrew Stephen Damick","text":"Saturday."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9294.27,"end":9294.99,"speaker":"Fr Stephen De Young","text":"That's right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9296.27,"end":9300.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the actual rite of ordination."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9300.59,"end":9304.83,"speaker":"Fr Stephen De Young","text":"Yes. Now we're actually going to talk about the ordination of Eren and his sons."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9304.91,"end":9307.55,"speaker":"Fr Andrew Stephen Damick","text":"2 hours and 35 minutes into this episode."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9307.87,"end":9308.35,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9308.75,"end":9310.83,"speaker":"Fr Andrew Stephen Damick","text":"That's how we do it, people. That's how we do it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9311.31,"end":9312.59,"speaker":"Fr Stephen De Young","text":"Gotta lay the groundwork."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9312.91,"end":9319.88,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so to the second most popular, least popular book of the Torah in that Torah. Tier."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9320.76,"end":9321.4,"speaker":"Fr Stephen De Young","text":"The tier."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9321.88,"end":9333.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right. Leviticus. Everybody loves Leviticus. Leviticus actually got a lot of. It's got a lot of narrative in it, actually, by the way."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9333.88,"end":9344.2,"speaker":"Fr Stephen De Young","text":"It really does. Yeah, it really does. Once you get to the Holiness Code, less so, mostly commandments, but you got."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9344.2,"end":9347.36,"speaker":"Fr Andrew Stephen Damick","text":"To pay attention to that stuff. Lest the earth swallow you up, or that kind of thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9347.36,"end":9355.12,"speaker":"Fr Stephen De Young","text":"That is very important stuff that people should spend more time with. But anyway, there's a commercial for the Book of Leviticus."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9357.6,"end":9364.8,"speaker":"Fr Andrew Stephen Damick","text":"Have you considered the Book of Leviticus? Turn to chapter eight. Read the scintillating story of Aaron's ordination and his sons."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9364.88,"end":9365.92,"speaker":"Fr Stephen De Young","text":"This is a great story."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9367.15,"end":9369.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. We're gonna go through line by line, right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9369.39,"end":9370.75,"speaker":"Fr Stephen De Young","text":"Yes. Mostly unread."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9371.87,"end":9377.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, by far. All right, shall we begin the slow walk through Leviticus 8."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9377.23,"end":9378.59,"speaker":"Fr Stephen De Young","text":"Let's begin now."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9378.75,"end":9400.6,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Verse 1. The Lord spoke to Moses, saying, take Aaron and his sons with him and the garments and the anointing oil, and the bull of the sin offering, and the two rams and the basket of unleavened bread, and assemble all the congregation at the entrance of the tent of meeting. And Moses did as the Lord commanded him, and the congregation was assembled at the entrance of the tent of meeting."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9401.4,"end":9419.24,"speaker":"Fr Stephen De Young","text":"What I like about the first four verses is that if you've ever read a service text like the ones that come from the Antiochian Archdiocese, there's always this little light. Sometimes it's in smaller print at the beginning. That's aimed at us priests. That is just like this. Like, here's all the stuff you need. Set a table here and put this on it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9419.32,"end":9421.54,"speaker":"Fr Andrew Stephen Damick","text":"The bits in italics or the red, you know?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9421.54,"end":9445.78,"speaker":"Fr Stephen De Young","text":"Yeah. This is the setup, right. For the. For the ordination ritual that's about to take place. And the reason for that is this isn't just a historical recounting of, oh, isn't this interesting how Aaron, way back then was ordained? It's. This is also setting out the practice for future high priests."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9446.02,"end":9461.36,"speaker":"Fr Andrew Stephen Damick","text":"You're going to do it in the future? Yeah, yeah. Yep, Yep. Okay. Verse 5. And Moses said to the congregation, this is the thing that the Lord has commanded to be done. So he's saying, look, I didn't make this up myself, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9461.44,"end":9464.48,"speaker":"Fr Stephen De Young","text":"This is. God said, this now is the time for the Lord to. Oh, wait."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9464.64,"end":9500.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, verse six. And Moses brought Aaron and his sons and washed them with water, and he put the coat on him and tied the sash around his waist and clothed him with the robe, and put the ephod on him, and tied the skillfully woven band of the ephod around him, binding it to him with the band. And he placed the breastpiece on him, and in the breastpiece he put the urim and the thummim, and he set the turban on his head, and on the turban in front, he set the golden plate, the holy crown, as the Lord commanded Moses."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9503.32,"end":9504.76,"speaker":"Fr Stephen De Young","text":"So a couple things to notice here."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9505.96,"end":9506.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9509.4,"end":9513.16,"speaker":"Fr Stephen De Young","text":"First. Right. That part of this is him being vested."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9513.96,"end":9515.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9515.24,"end":9517.6,"speaker":"Fr Stephen De Young","text":"By someone else. By Moses. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9517.6,"end":9518.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9518.2,"end":9521.72,"speaker":"Fr Stephen De Young","text":"Moses vests him. Moses is essentially the officiant of this."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9521.72,"end":9525.36,"speaker":"Fr Andrew Stephen Damick","text":"Ordination, even though not ordained himself, not."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9525.36,"end":9527.96,"speaker":"Fr Stephen De Young","text":"A priest himself, not ordained to this priesthood himself."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9528.14,"end":9529.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but this is."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9529.74,"end":9531.98,"speaker":"Fr Stephen De Young","text":"God said, somebody's got to do the first one."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9532.06,"end":9533.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you got to do it. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9534.3,"end":9537.02,"speaker":"Fr Stephen De Young","text":"Aaron could do the next one, but somebody's got to do the first one."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9537.02,"end":9540.3,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if you pick somebody to do first one Moses seems like a good choice."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9540.38,"end":9554.23,"speaker":"Fr Stephen De Young","text":"Yeah. So. And for Orthodox folks, if you've ever been to an orthodox ordination. Right. The person is vested."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9556.71,"end":9558.87,"speaker":"Fr Andrew Stephen Damick","text":"By the bishop and those assisting him."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9559.03,"end":9590.39,"speaker":"Fr Stephen De Young","text":"Right. By the officiant of the ordination. And for Orthodox folks, you may know that the bishop is vested every time he comes to serve. But also notice the pattern of the procedure here. Right. He's washed. He and his sons. Right. They're washed with water and then they're vested. You may already see a pattern emerging."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9590.95,"end":9593.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes. A baptism of sorts."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9593.75,"end":9599.99,"speaker":"Fr Stephen De Young","text":"Yes. In the baptism service. Right. Washed, vested."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9600.23,"end":9601.43,"speaker":"Fr Andrew Stephen Damick","text":"This is going to continue."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9603.27,"end":9608.5,"speaker":"Fr Stephen De Young","text":"But this is what I was hinting at. Right. With our collar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9608.82,"end":9611.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. A kind of ordination."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9612.34,"end":9614.9,"speaker":"Fr Stephen De Young","text":"Right. A kind of ordination to a kind of priesthood."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9615.06,"end":9615.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9616.82,"end":9619.94,"speaker":"Fr Stephen De Young","text":"And if you think of Israel as a whole, they were baptized into Moses."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9620.9,"end":9623.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Through the Red Sea. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9625.3,"end":9626.66,"speaker":"Fr Stephen De Young","text":"Okay, so verse 10."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9626.98,"end":9663.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay, verse 10. Then Moses took the anointing oil and anointed the tabernacle and all that was in it and consecrated them. And he sprinkled some of it on the altar seven times and anointed the altar and all its utensils and the basin and its stand to consecrate them. And he poured some of the anointing oil on Aaron's head and anointed him to consecrate him. And Moses brought Aaron's sons and clothed them with coats and tied sashes around their waists and bound caps on them, as the Lord commanded Moses. So there's this anointing. Right. I mean, this is just like. So far, in some ways, this is just like an orthodox baptism service."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9664.26,"end":9665.3,"speaker":"Fr Stephen De Young","text":"They get Chrismated."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9665.7,"end":9668.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The washing and then the clothing and then the Chrismation."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9669.38,"end":9684.74,"speaker":"Fr Stephen De Young","text":"Right. And this is also the. We're gonna see this pattern play out as we move on through the chapter where something is done to the altar and then to Aaron and the sons."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9687.54,"end":9688.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9688.74,"end":9713.13,"speaker":"Fr Stephen De Young","text":"So the altar is anointed. The altar is Chrismated. We talked about this a little bit last time. The Chrismation of the elements of the tabernacle. Right. And then Aaron is also connecting Aaron to the altar and the accoutrement of the tabernacle. Right. So that Aaron effectively is being made part of the tabernacle. Is being."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9713.13,"end":9713.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9713.85,"end":9714.37,"speaker":"Fr Stephen De Young","text":"To it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9714.37,"end":9754.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it's. And it's worth pointing out, like, the things that are. The physical stuff, the kind of the. The holy hardware, they're not turned into a different kind of thing than the things that they're like on the outside. Right. Like you know, utensils. So utensils are utensils, but these utensils are set aside for use in the tabernacle. But they're still utensils. They're still made out of whatever they're made out of. Just as Aaron does not become a different kind of species or whatever by being ordained, he's still a man, but he's set aside now for this task."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9755.14,"end":9770.96,"speaker":"Fr Stephen De Young","text":"And dedicated to this purpose. Yeah. So the chalice is not different from my Star Trek Wrath of Khan collector cup because it's mine. Made from metal mined out of the holy mountain. Right, right. It's the purpose for which it has been set aside."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9771.12,"end":9773.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the function. It's the way that it's being treated."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9774.24,"end":9777.52,"speaker":"Fr Stephen De Young","text":"Right. It was about innate holiness. I mean, come on, Ratha Khan."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9780.08,"end":9784.72,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I mean, there's stuff I like about Rathicon for sure, but the."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9785.04,"end":9786.8,"speaker":"Fr Stephen De Young","text":"It's virtually a relic of Shatner."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9786.96,"end":9788.16,"speaker":"Fr Andrew Stephen Damick","text":"The earworm thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9789.92,"end":9795.39,"speaker":"Fr Stephen De Young","text":"Great moment in cinema. Wraps itself around your cerebral cortex."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9795.39,"end":9796.27,"speaker":"Fr Andrew Stephen Damick","text":"Very creepy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9796.35,"end":9797.55,"speaker":"Fr Stephen De Young","text":"Making you suggestible."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9797.79,"end":9814.83,"speaker":"Fr Andrew Stephen Damick","text":"Super creepy. Okay. Verse 14. Then he brought the bowl of the sin offering. And Aaron and his sons laid their hands on the head of the bowl of the sin offering. So what's going on? Are they putting the sins of the people on the."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9814.83,"end":9815.87,"speaker":"Fr Stephen De Young","text":"Don't get excited."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9816.11,"end":9816.59,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9818.52,"end":9826.84,"speaker":"Fr Stephen De Young","text":"With the atonement theories. Sorry, leave off the atonement theories. They do not say anything."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9827.88,"end":9831.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it's a sin offering, but it doesn't have any sins on it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9832.04,"end":9834.52,"speaker":"Fr Stephen De Young","text":"Right. They just put their hands on it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9834.84,"end":9835.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9835.32,"end":9835.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9836.12,"end":9838.2,"speaker":"Fr Andrew Stephen Damick","text":"As if to say this one."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9839,"end":9842.68,"speaker":"Fr Stephen De Young","text":"Right. They're designating this bowl for this purpose."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9842.92,"end":9843.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9843.32,"end":9849.61,"speaker":"Fr Stephen De Young","text":"Designating again. Lots of bulls. This one is going to be the sin offering."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9849.69,"end":9850.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9851.69,"end":9856.33,"speaker":"Fr Stephen De Young","text":"And that'll become even more clear here as we move. Move on into the next bit."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9856.65,"end":9862.81,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Verse 15. And he killed it. No big fancy ritual."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9863.21,"end":9866.65,"speaker":"Fr Stephen De Young","text":"We don't know. Well, we don't know how, we don't know where, we don't know with what."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9867.21,"end":9869.21,"speaker":"Fr Andrew Stephen Damick","text":"Just. The bull is now dead."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9869.61,"end":9871.21,"speaker":"Fr Stephen De Young","text":"But you have to kill it in order to."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9872.14,"end":9889.82,"speaker":"Fr Andrew Stephen Damick","text":"And Moses took the blood. Yes. And with his finger put it on the horns of the altar, around it and purified the altar and poured out the blood at the base of the altar and consecrated it to make atonement for it. For the altar?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9890.22,"end":9893.42,"speaker":"Fr Stephen De Young","text":"Yes, for the altar. He's making the atonement for the altar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9893.58,"end":9895.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because that altar did bad things."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9895.82,"end":9899.1,"speaker":"Fr Stephen De Young","text":"No, wait, there's no sins that the altar committed."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9899.38,"end":9900.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9900.5,"end":9905.86,"speaker":"Fr Stephen De Young","text":"That are being put on the bull. It's the bulls being killed instead. That doesn't make sense."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9905.86,"end":9910.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. It's to clean up the altar from the sins accumulated of the people. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9910.42,"end":9914.74,"speaker":"Fr Stephen De Young","text":"Is part of setting it aside to be the altar of God, that it must be purified."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9915.3,"end":9915.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9915.78,"end":9919.14,"speaker":"Fr Stephen De Young","text":"As we said before previous episodes, life stuff kills, death stuff."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9919.14,"end":9919.86,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9920.26,"end":9931.55,"speaker":"Fr Stephen De Young","text":"Right. So blood is life stuff. Takes care, smears away, wipes away, absorbs however you want to see it or argue about it in your journal article. Right. But it takes care of it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9932.43,"end":9955.49,"speaker":"Fr Andrew Stephen Damick","text":"All right. Verse 16. And he took all the fat that was on the entrails and the long lobe of the liver. I love alliteration. And the two kidneys with their fat, and Moses burned them on the altar. But the bull and its skin and its flesh and its dung, he burned up with fire outside the camp as the Lord commanded Moses."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9956.21,"end":9982.21,"speaker":"Fr Stephen De Young","text":"Right. So an important element of this, for what we were saying before about not putting sins on it. Right. Is that notice there are clean parts of the bowl and unclean parts of the bowl. The dung, the excrement being obviously unclean. Right. The unclean parts of the bowl cannot be put on the altar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9982.67,"end":9984.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You don't give God that garbage."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9984.83,"end":9994.03,"speaker":"Fr Stephen De Young","text":"Right. That gets taken outside the camp and burned. Right. It's not even kept in the camp. Right. It is the good parts."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9994.11,"end":9994.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":9994.51,"end":10002.11,"speaker":"Fr Stephen De Young","text":"So if you put sins on the bull, the bull is now unclean and impure and has sin on it. You can't put any of it on the altar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10002.27,"end":10016.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because remember, when you're offering something to God, you don't give him some dirty, sinful thing. You give him what's good and pure and without blemish. Yeah, yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10016.42,"end":10016.78,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10017.1,"end":10026.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. Verse 18. Then he presented the ram of the burnt offering, and Aaron and his sons laid their hands on the head of the ram."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10027.42,"end":10036.78,"speaker":"Fr Stephen De Young","text":"This is not a sin offering. Yeah, again, but there's still the laying out of hands. And there's two rams there. This one's being designated for the burnt offering."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10037.56,"end":10064.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. And he killed it. And Moses threw the blood against the sides of the altar. He cut the ram into pieces. And Moses burned the head and the pieces and the fat. He washed the entrails and the legs with water. And Moses burned the whole ram on the altar. It was a burnt offering with a pleasing aroma. A food offering for the Lord, as the Lord commanded Moses."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10065.68,"end":10067.76,"speaker":"Fr Stephen De Young","text":"So this is a whole burnt offering."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10068.24,"end":10070,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It means God gets all of it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10070.16,"end":10084.32,"speaker":"Fr Stephen De Young","text":"God gets the whole thing. The whole thing's gonna get burned up. But look at what Moses has to do in the process, in order to offer the whole thing, he has to wash and clean the unclean parts before."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10084.32,"end":10090.02,"speaker":"Fr Andrew Stephen Damick","text":"He can all be purified again. You know, give God something with sin."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10090.02,"end":10092.74,"speaker":"Fr Stephen De Young","text":"In it, which is the opposite. Right. Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10093.86,"end":10136.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, continuing on verse 22. Then he presented the other Ram, the Ram of ordination. And Aaron and his sons laid their hands on the head of the ram and he killed it. And Moses took some of its blood and put it on the lobe of Aaron's right ear and on the thumb of his right hand and on the big toe of his right foot. Then he presented Aaron's sons and Moses put some of the blood on the lobes of their right ears and on the thumbs of their right hands and on the big toes of their right feet. And Moses threw the blood against the sides of the altar. So this is kind of weird."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10138.19,"end":10139.87,"speaker":"Fr Stephen De Young","text":"Really? You've never had that done?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10140.51,"end":10140.91,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10141.65,"end":10143.89,"speaker":"Fr Stephen De Young","text":"Not to join Skull and Bones at Yale, anyway."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10144.93,"end":10147.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Weirdly, I didn't go to Yale. I don't know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10147.65,"end":10172.54,"speaker":"Fr Stephen De Young","text":"So. So we have. Right. Base level, we have this same sort of motif again of something being put on the altar and on Aaron and his sons. Right. Connecting them. Right, right, right. And the particularity here with the blood. Right. Well, first of all, it should be noted that this is unusual."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10173.26,"end":10178.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Usually you don't put blood on people. In the rituals of the Old Testament."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10178.62,"end":10231.44,"speaker":"Fr Stephen De Young","text":"Blood is not put on people. Blood is put on things normally. Right. On the day of atonement, the blood is used to purify things. Not people, the places. There's a few places, a handful of places where blood gets put on people in the Torah. One of them is when the covenant is ratified, Mount Sinai, they get sprinkled with blood. Right. Remember what I said to the caller here in the ordination ritual? And one is here. And so here in particular, the blood that's getting over the altar is put on the right earlobe, the right thumb and the right big toe. The earlobe is. The earlobe was pierced with an awl to mark a slave. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10232,"end":10232.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10233.12,"end":10237.28,"speaker":"Fr Stephen De Young","text":"When that slave was being made sort of a permanent member of the household."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10238.88,"end":10252.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is a kind of ritual wounding, sort of. But they're not actually piercing Aaron's ear, but it's a ritual piercing, so to speak, but not an actual piercing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10252.5,"end":10259.62,"speaker":"Fr Stephen De Young","text":"So he's being made a servant of that altar and he is being brought into the household of God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10260.26,"end":10261.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10261.3,"end":10280.61,"speaker":"Fr Stephen De Young","text":"The economia of God there in the tabernacle, which is another piece of this kind of angelic role. Right. And then. So that's the earlobe, the right thumb."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10281.01,"end":10281.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10281.73,"end":10309.79,"speaker":"Fr Stephen De Young","text":"Your right hand is the. The dexterous one. Pun intended. And right. So that represents the things you do. Right. Your hands and your feet are where you go. Right. Your right big toe. Right. So it's what you do, where you go. He's a servant. Right. And he's part of the household of God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10310.35,"end":10310.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10310.83,"end":10311.71,"speaker":"Fr Stephen De Young","text":"And his sons."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10312.51,"end":10373.99,"speaker":"Fr Andrew Stephen Damick","text":"All right. This is the part where you get to the bacon buns. I'm just telling Everybody now. Verse 25. Then he took the fat and the fat tail and all the fat that was on the entrails and the long lobe of the liver and. And the two kidneys with their fat and the right thigh, and out of the basket of unleavened bread that was before the Lord, he took one unleavened loaf and one loaf of bread with oil and one wafer and placed them on the pieces of fat and on the right thigh. And he put all these in the hands of Aaron and in the hands of his sons and waved them as a wave offering before the Lord. Then Moses took them from their hands and burned them on the altar with the burnt offering. This was an ordination offering with a pleasing aroma, a food offering to the Lord. And Moses took the breast and waved it for a wave offering before the Lord. It was Moses. Portion of the Ram of ordination, as the Lord commanded Moses. So what's the deal with wave offerings?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10374.71,"end":10378.23,"speaker":"Fr Stephen De Young","text":"Right. So they're throwing their lunch in the air and waving like they just don't care."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10378.63,"end":10380.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. But."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10382.82,"end":10383.62,"speaker":"Fr Stephen De Young","text":"They do care."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10384.58,"end":10385.38,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10385.78,"end":10415.55,"speaker":"Fr Stephen De Young","text":"In a normal wave offering and Moses. The Moses bit in verse 29, there is the normal kind of wave offering. Right. Is that the priest's portion of an offering? As we said before, we talked about sacrifice. When the sacrifice is offered, there's a portion of it that goes to the priests. Right. And the priest's portion, nonetheless, before the priest took it to eat, was offered as a wave offering."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10416.03,"end":10421.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which was a give it to God and then go and eat it and receive it back."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10421.71,"end":10422.59,"speaker":"Fr Stephen De Young","text":"Right? Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10422.59,"end":10422.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10423.15,"end":10431.47,"speaker":"Fr Stephen De Young","text":"The idea that even this. That is my portion really belongs to God and God is giving it to me to feed me."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10432.44,"end":10433.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10436.36,"end":10453.56,"speaker":"Fr Stephen De Young","text":"And so with Moses, this is sort of the normal procedure in the particular of the ordination rite. The portion that would have been normally Aaron's and his sons gets burnt and offered to God."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10455.32,"end":10458.2,"speaker":"Fr Andrew Stephen Damick","text":"So Moses gets to eat some because he's not being ordained."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10459.09,"end":10461.13,"speaker":"Fr Stephen De Young","text":"Right. He is the ones who are the ones who."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10461.13,"end":10468.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but the ones who are being ordained, their portion essentially gets given to God and burned."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10468.09,"end":10475.01,"speaker":"Fr Stephen De Young","text":"Right. So if Aaron ordains his grandson, he would get the breast as the officiate. Right?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10476.13,"end":10507.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. Verse 30. Then Moses took some of the anointing oil and of the blood that was on the altar and sprinkled it on Aaron and his garments and also on his son's and his son's garments. So he consecrated Aaron and his garments and his son's and his son's garments with him. So this is another connection with the altar. Right. The blood from the altar and the oil. Blood and oil now. Right. Mixed together are sprinkled in their garments."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10507.62,"end":10511.08,"speaker":"Fr Stephen De Young","text":"We have the sprinkling, like the covenant ratification."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10511.08,"end":10511.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10512.04,"end":10538.99,"speaker":"Fr Stephen De Young","text":"So from the perspective of the preceding portions of the Torah, Israel's history. Right. Of passing through the sea and the cloud and being sprinkled with blood at Pentecost, at Sinai is sort of being recapitulated in the ordination ritual. Right. Because, again, the high priest is the representation of Israel."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10539.55,"end":10540.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10540.35,"end":10558.35,"speaker":"Fr Stephen De Young","text":"Sort of Israel summed up in one person, including in the case of Christ. Most fully in the case of Christ. And then from our perspective, we're looking back at our baptismal ritual, which is also based on the same thing, and seeing those connections there. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10560.03,"end":10645.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, I think it's worth pointing out, like, now there's what I didn't count, but, like, four or five ways that a thing is done to the altar and done to Aaron's sons. So there's this deep, deep connection between them and this altar. And, you know, this persists even into the priesthood of the church, where people are ordained, men are ordained for particular altars. And actually, it's my understanding that the earliest ordination rites, especially for bishops in particular, I think this is still the case with bishops, but even with priests and deacons, part of the ordination rite was actually to say which altar. I mean, it's usually the one that they're at that the man is being ordained for. Right. Like it's for this altar in particular. And early. Early on, there weren't transfers of clergy at all. You were ordained for one altar, and that's the one you serve for your life. Later on, the idea of transferring clergy, but they're still transferred. They're taken from one altar and they're attached to another altar. So they only attach to one altar. And there's no such thing as priests or deacons or even bishops at large roaming free. Yeah, I mean, there is a. There's a lovely Latin term."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10645.91,"end":10647.29,"speaker":"Fr Stephen De Young","text":"There are some, but there shouldn't be."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10648.56,"end":10694.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a lovely Latin term for this, which is episcopi, vagantes, wandering bishops. But yeah, it's not a thing. In the Orthodox Church, where a priest does not exist without an altar, he does not exist without a bishop. That's not a thing. Because again, we don't believe that the priesthood is a kind of power that a man holds on his own. Right. His connection to the altar is a significant piece of the way that we understand priesthood to work and ordination to work as functioning within a community and for the community, by the community. You know, there's no at large clergy. It's just not a thing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10695.18,"end":10699.26,"speaker":"Fr Stephen De Young","text":"There are large clergy, there are large clergy, but not at large."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10699.42,"end":10701.02,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you are not small, my friend."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10701.45,"end":10705.93,"speaker":"Fr Stephen De Young","text":"I am not compared to most other humans."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10708.65,"end":10768.6,"speaker":"Fr Andrew Stephen Damick","text":"I'm slightly smaller, but not a huge amount. I wish I were more smaller, but I'm not. So. Okay. Verse 31. And Moses said to Aaron and his sons, boil the flesh at the entrance of the tent of meeting. And there eat it and the bread that is in the basket of ordination offerings as I commanded, saying, aaron and his sons, and shall eat it. And what remains of the flesh and the bread you shall burn up with fire. You shall not go outside the entrance of the tent of meeting for seven days until the days of your ordination are completed. For it will take seven days to ordain you as has been done today. The Lord has commanded to be done to make atonement for you at the entrance of the tent of meeting. You shall remain day and night for seven days performing what the Lord has charged so that you do not die for. So I have been commanded. And Aaron and his sons did all the things that the Lord commanded by Moses. Seven day ordination."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10771.48,"end":10772.2,"speaker":"Fr Stephen De Young","text":"Week long."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10772.84,"end":10774.52,"speaker":"Fr Andrew Stephen Damick","text":"That's a long ordination service."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10775.08,"end":10787.15,"speaker":"Fr Stephen De Young","text":"But yeah. And so they stay and they live there. And that, you know, verse 34, right to make atonement for you. We have to understand in the same sense as making atonement for the altar."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10787.46,"end":10788.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're being purified."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10789.22,"end":10803.7,"speaker":"Fr Stephen De Young","text":"They're being purified and they're being sort of fully removed from the world and attached to the tabernacle in the way the various objects and other things in the tabernacle are."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10804.26,"end":10805.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10806.5,"end":10814.26,"speaker":"Fr Stephen De Young","text":"And so seven, Right. It's the number of fullness and completion at all because of the seven planets. See previous episodes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10814.57,"end":10817.69,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Jewish astrology, everybody."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10821.85,"end":10895.59,"speaker":"Fr Stephen De Young","text":"Right. And so we commented on our way through, right. On some of the continuities with later ordination. Right. We see already in the pages of the New Testament this Setting apart of people by the laying out of hands by an officiant. So and, and this is connected to that laying out of hands, as we talked about last time in the Chrismation episode was sort of the original means we see in the New Testament of conveying the Holy Spirit. Right. And we see the. The hands being laid in Aaron and his Son's ordination on the animals to designate them for this particular purpose. Right. And so this, both of those are tied together, this idea of God acting through people. In the case of the indwelling of the Holy Spirit, God is going to act through them in this particular way and they are designated for that through the laying on of hands."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10895.99,"end":10898.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10900.23,"end":10922.56,"speaker":"Fr Stephen De Young","text":"So some summary kind of comments. Right, that. So clergy are expected to be separate in the sense of holiness, as we discussed, but in our contemporary world, what that actually means can sometimes be ambiguous."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10922.88,"end":10930.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because people take the word holiness to mean being super good or something like that. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10931.36,"end":10943.52,"speaker":"Fr Stephen De Young","text":"So sometimes people think that means being weird, especially people in seminaries. The raniers are full of weirdos. Especially when I was in one True."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10946.2,"end":10947,"speaker":"Fr Andrew Stephen Damick","text":"Be normal."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10950.36,"end":10958.92,"speaker":"Fr Stephen De Young","text":"And the kind of holiness that clergy should at least aspire to is not making a pretense of piety."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10960.84,"end":10963,"speaker":"Fr Andrew Stephen Damick","text":"Looking big and priestly. Ish."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":10963.4,"end":11001.31,"speaker":"Fr Stephen De Young","text":"Right. From firsthand experience, you're sometimes given that impression in seminary that it's about appearing priestly when in public, talking and walking in a priestly way. And number one that reads is pretty phony to just about everyone eventually. And also if you want something that is criticized continually by the Lord throughout the Gospels, it's publicly acting pious."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11002.27,"end":11002.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11003.95,"end":11024.28,"speaker":"Fr Stephen De Young","text":"They have their reward, say their long prayers, where the right going and making a public show of your piety. Nothing positive is said about that anywhere. Right. In the scriptures, but especially not in the Gospels. So that is definitely not what any clergy person is called to."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11024.68,"end":11043,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, so like, what is it about? It's number one, it's that the clergy are held to a higher standard. Not in the sense that there's different standards, but rather in the sense largely that the enforcement is stricter."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11043.8,"end":11045.16,"speaker":"Fr Stephen De Young","text":"Right. The same rules."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11045.48,"end":11109.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There's not things that are sins for the laity and not sins for the clergy or that are sins for the clergy and not for the laity. Sin is sin. Right. But clergy are the, you know, like the penalty is stricter. So like there's a number of canonical crimes, as it were, that it says if a layman does this, let him be excommunicated, but if a clergyman let him be deposed and in order to understand why what the clergyman is getting in that case is more severe than the layman, you need to know that excommunication is temporary. And the purpose of it is to bring someone to repentance and then they can be returned to communion. Whereas deposition, unless it's unjust, but deposition is permanent, your vocation is over. That's it. It's over."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11109.69,"end":11116.41,"speaker":"Fr Stephen De Young","text":"Right. The church will go on. God will continue to do what he does, but he'll be doing certain elements of it through someone else."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11116.73,"end":11119.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11120.01,"end":11123.77,"speaker":"Fr Stephen De Young","text":"Yeah. And sort of the exhibit A of that is probably divorce."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11124.41,"end":11126.19,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's always a sin."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11126.51,"end":11157.02,"speaker":"Fr Stephen De Young","text":"It's always a sin because you're always doing harm to yourself and to other people. And it's the product of sin. Right. If people weren't sinners, they wouldn't get divorced. Right. Marriages that last also contain two sinners. Right. But that's. So it's always a sin, it's always an issue, it's always a problem. It's always something that requires healing and forgiveness and restoration. Right. But if you're clergy and you get divorced."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11158.22,"end":11158.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11158.62,"end":11161.58,"speaker":"Fr Stephen De Young","text":"That is treated more seriously. And you're going to be deposed."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11162.14,"end":11168.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there are sometimes, I've known of exceptions that are made, but the standard thing is deposition."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11168.62,"end":11172.54,"speaker":"Fr Stephen De Young","text":"Yes. Those are exceptions for a reason. They're exceptional instances."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11172.54,"end":11181.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah. So, I mean, there's a number of things that clergy can do that get them lay aside. Right. Things that they would justly be laicized for."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11182.12,"end":11190.04,"speaker":"Fr Stephen De Young","text":"Right. We're not going to list them because you did that now you can no longer do this. Right. Think of King David not being allowed to build the temple."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11190.92,"end":11219.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. And I mean, I think it's worth pointing out that it doesn't mean that clergy who commit those sins cannot be forgiven. They can be forgiven, but forgiveness does not mean restoration to your priesthood. You know, you can become a saint, you can even become a saint, but that's not the same thing as, you know, serving as clergy. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11220.13,"end":11228.85,"speaker":"Fr Stephen De Young","text":"King David is a saint. He was forgiven of his sins. When he repented, he was not more like, you know, the one to build the temple."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11229.33,"end":11233.31,"speaker":"Fr Andrew Stephen Damick","text":"I mean, Moses. Right. Moses has his priesthood removed and he's clearly a saint."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11234.26,"end":11234.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11234.58,"end":11237.3,"speaker":"Fr Andrew Stephen Damick","text":"You know, and he has it removed because of something bad that he did."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11237.62,"end":11238.02,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11238.02,"end":11239.06,"speaker":"Fr Andrew Stephen Damick","text":"You know, you know."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11239.3,"end":11242.1,"speaker":"Fr Stephen De Young","text":"Yes. There are consequences. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11242.1,"end":11242.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11242.42,"end":11251.78,"speaker":"Fr Stephen De Young","text":"For these things. And. And repentance is not the stuff you have to do to not face the consequences."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11252.66,"end":11253.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11253.54,"end":11268.9,"speaker":"Fr Stephen De Young","text":"Part of repentance is facing the consequences of your actions. Not getting. Not a way to get out of them. Yes. And so as a final note, because we want to end on a very non controversial note."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11268.98,"end":11270.66,"speaker":"Fr Andrew Stephen Damick","text":"I knew you were going to say exactly that."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11271.06,"end":11278.82,"speaker":"Fr Stephen De Young","text":"Yes. When the issue of women's ordination comes up."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11279.86,"end":11280.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11281.06,"end":11299.39,"speaker":"Fr Stephen De Young","text":"It is important. This is a place where it's especially important that we focus on the kind of orthodox view that we've outlined here. Right. Because in a lot of Protestant circles the discussion surrounds women's ability."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11300.59,"end":11303.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Can they do the things that a priest does?"}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11303.95,"end":11330.7,"speaker":"Fr Stephen De Young","text":"She could actually preach really well or she's a really good Bible teacher or she's a really good counselor or she's a. The things that a certain ordained office does, this person is good at. Right. So why shouldn't they do it? Right. Because the things they're good at are gifts given to them by God. Right. So it's key to remember has nothing to do with any ability anybody has."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11331.42,"end":11332.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11332.26,"end":11336.22,"speaker":"Fr Stephen De Young","text":"Anyone who can read. Conserve the Divine Liturgy."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11336.62,"end":11337.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11337.99,"end":11350.39,"speaker":"Fr Stephen De Young","text":"And if you didn't know how to read, you could memorize it. Right, Right. So it's not a question of ability. Right. Who has the ability? It's not something achieved, it's not something. Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11350.55,"end":11359.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you know, even as it is, it's not like there's a singing contest, you know, and if you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11359.55,"end":11361.83,"speaker":"Fr Stephen De Young","text":"I wouldn't be a priest if you want to sing."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11362.15,"end":11369.14,"speaker":"Fr Andrew Stephen Damick","text":"I wasn't going to say anything, but you know, only those who win the singing contest get to be ordained. Like that's not."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11369.54,"end":11450.53,"speaker":"Fr Stephen De Young","text":"I am the William Hung of Orthodox priests over here. So the. Well, Father Edrew collects himself. So the issue of women's ordination again in Roman Catholic circles and some Protestant circles, because again, you can't generalize about Protestantism. It's not just one thing, it's many. It's an issue of authority and power. The church is investing authority and power in males and not females. Again, if your understanding is not that, that it is not based on some granted authority or power, then it becomes about. God has called particular people to do particular things and different people are different. This is St. Paul with the spiritual gifts. God has called different people to do different things and he has called men to. Not just men in general, but specific men to do specific things and specific women to do specific things."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11451.73,"end":11452.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11452.93,"end":11459.17,"speaker":"Fr Stephen De Young","text":"And there are areas where those don't overlap."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11459.97,"end":11460.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11460.41,"end":11467.81,"speaker":"Fr Stephen De Young","text":"I mean, one of them is being a spiritual father or a spiritual mother. Those two things require you to be one or the other sex."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11468.29,"end":11478.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I can't be a spiritual mother and a spiritual mother is not simply the same as a spiritual father, but female. They're two different things."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11478.92,"end":11479.4,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11480.84,"end":11481.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11481.32,"end":11484.84,"speaker":"Fr Stephen De Young","text":"Now I'll really get canceled. A biological male can't give birth."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11486.84,"end":11490.68,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, you say that and we're going to just renew your contract, actually."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11491,"end":11491.52,"speaker":"Fr Stephen De Young","text":"There we go."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11491.52,"end":11492.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11492.36,"end":11494.76,"speaker":"Fr Stephen De Young","text":"Yeah. I didn't say canceled by you."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11494.76,"end":11513.33,"speaker":"Fr Andrew Stephen Damick","text":"There is no contract. Yeah, yeah, that's right. Yeah. This is at will. No, and I mean, it's also worth pointing out. I mean, this might be an uncomfortable thing to say, but it's actually worth pointing out that God never ordained any women. Like, you don't see in Scripture that ever happening."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11513.65,"end":11516.61,"speaker":"Fr Stephen De Young","text":"He could have given the priesthood to Miriam instead of Aaron."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11516.93,"end":11529.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. He totally could have. He could have ordained his mother. Christ could have ordained his mother. But it's not because these women are lesser than men or anything like that. That's not what it's about."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11530.07,"end":11536.79,"speaker":"Fr Stephen De Young","text":"God did some pretty amazing things through the Theotokos, like incarnation that we celebrate in a couple days."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11536.87,"end":11540.51,"speaker":"Fr Andrew Stephen Damick","text":"Better than everybody else. Yeah, right. Yeah."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11540.51,"end":11575.28,"speaker":"Fr Stephen De Young","text":"She's the one human through whom God did that work. Right. Took flesh. Right. So, you know, compared to doing the liturgy kind of wins, but celebrating liturgy is a very high honor. Right. I'm not demeaning that, but I'm saying women particularly. Again, it's particular women and particular men. Particular women have been called to far greater works of God through faithfulness than particular men have."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":11575.92,"end":12011.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Well, let's wrap up. You know, I remembered very clearly when we talked about, for instance, earlier, the parakatahiki, the pledge, you know, where the bishop places the body of Christ into the hands of the newly ordained priest. When I was ordained, which now is a little over 16 years ago, to the priesthood, someone. It was really very nice. Someone took an actual photo of that moment. And so I have a photo of Bishop Antoun, God rest his soul, putting the body of Christ into my hands. And I look at that photo a lot, and I will often reread the prayer, the words that he said. And I remember Bishop Antoun, he had a particular way of saying that bit about where, you know, you're going to be called to an account. I think Bishop Antoun would say it. He's going to ask you about it. Right. And, you know, from a personal point of view, I remember being scared out of my mind at that moment. I don't think I was shaking or whatever, but I just remember hearing Bishop Antoon say that and. And thinking and looking down there at this consecrated body of Christ and just trying to imagine what all of that means. And I recall also the first time that I celebrated the Divine Liturgy, which for me, actually, it just so happened that it was on the feast of St. Raphael of Brooklyn. That was the very first time that I celebrated the liturgy as the celebrant. Obviously, I celebrated it. I con Celebrated it with Bishop Antoun for the rest of the day that he ordained me, you know, but the first time that I actually celebrated it myself was on the feast of St. Raphael of Brooklyn. And I remember thinking a number of times in the course of that event, those events, like, feeling like a fake. You know, what do they call that? Imposter syndrome, Right. And I have to imagine that a lot of clergy probably feel that, especially initially. And I will say, you know, in the, you know, more than decade and a half since then, I have not felt any zap come out of my hands as I served the liturgy or any, you know, magical energy or whatever. But I remember having the feeling of like, I can't believe that I'm standing here and doing this. I can't believe they let me do this. And I try to remember that not so I can just sort of go through a psychological journey again, but rather precisely for the point. One of these points that we've been making is that it's God who does this. It's not me. I mean, when a priest communes himself, or even when he's being communed by the bishop, he refers to himself as the most unworthy presbyter. Right? I'm not worthy. The fact that I was ordained did not turn me into a worthy thing. I'm still the most unworthy. And I say that not to sort of display my humility or whatever. It's just an actual fact that none of us are made worthy in the sense of becoming super Christians or saints or whatever. We are simply set aside to do a particular task. And I revisit those thoughts and I look at those photos, and I think about the things that Bishop Antoun said precisely to remind myself that this does not belong to me. It is Christ's priesthood, and he functions through those who are ordained to do this work. Right. Now, I imagine most of the people listening to this are not ordained clergy and never will be. Right. Those who are ordained were not necessarily special. I'm definitely not. I have known some very holy priests in my day, but I'm not one of them. But if you're listening to this and you think, okay, I just listened to them talk about ordination for the last three hours and 17 minutes, what does that have to do with me. I think one of the big takeaways is that God is always working and he can work and is working through you. And so the question always is, in what way do I need to cooperate with what God is doing right now? And it's usually not a big mystery. It's the good thing you have in front of you to do. That's the thing you should be doing, right? So, as you know, as Father Stephen mentioned, while we're not all ordained as deacons, presbyters, and bishops, we all are, in a sense, ordained into a kind of priesthood. I mean, we saw in the priest in the ordination of Aaron and his sons, basically the basic elements of a baptismal service, right? The washing, the clothing, the Chrismation, all orthodox Christians receive all that. That's all part of who we are. And we're all brought into the order of the laity. And that's not something that clergy leave behind, Right? The most basic garment that we wear, the Sticharion, is the baptismal garment. That's what that is. And it shows that we are brought into the communion of the church to function as the church, to be the church. And of course, as we've talked about many times in this podcast, what is the church? It's the body of Christ. We are Christ's powers, his actions in this world, inasmuch as we cooperate with the Holy Spirit. And that is awesome. That is awesome. And ordained ministry in the clergy is part of that. It's not apart from that. It's not a radically different thing than that. It's simply a part of that. It's a particular role within that, and it's meaningless without it. Clergy don't function without the church. Again, that's why we don't have priests at large. We don't have bishops at large. We don't have deacons at large. None of us are at large with every single canonical orthodox clergyman. He can point you. This is my altar, this is my bishop. This is the synod that this bishop belongs to. Like, these are not big mysteries. And that's because it's God working through us, not God handing a special power over to us. And that's one of the most important concepts, I think, from this episode. Father."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12016.54,"end":12227.36,"speaker":"Fr Stephen De Young","text":"So St. Paul famously, I guess everything he said in the Bible, because it's in the Bible, is famous, I guess, said that not many of you should presume to be teachers. And he had to say that because many people were presuming to be teachers. And that has continued down to the present day. I think undeniably, we as humans have a tendency to follow our desires, to follow the things that we at least think that we want, the things that we think will fill something that's lacking in us or give us some be instrumental to give us something that we want, whether that's power or control or freedom. We see people and choices we make as instruments to gain those things that we think we want, that we think will make us happy and feel fulfilled. And one of those things within the community of the church is ordained office. And that's envisaged in different ways by different people. That some people view it either because it's the teaching of their church or just the way the community functions, or even if it's against the way the community is supposed to function. They view this as a position of power. They view this as a position of, you know, authority. This is a position sometimes in some communities, you have an impoverished community with a local pastor who is at least presents the image of being quite well off and having quite the lifestyle. So this can be money. This could be a way out of poverty. There are all kinds of things that this can seem to entail. Maybe someone is deeply struggling with sin and thinks that devoting themselves more fully to the life of the church is going to be the thing that helps break them out of that and give them victory over that. Just sort of de facto as a sort of trade. Well, if I dedicate my life to God, he'll deliver me from this. And then if, God forbid, those folks do receive ordained office, they find that that struggle just gets worse and real disasters happen. But all of these things are the sort of pursuit of desire. And in the first place, none of them are what the priesthood is actually about. I've never met anyone who has said I want to be ordained as a priest because I want to shoulder the burden of the sins of my community. Because I want to go home at night and have trouble sleeping, because I'm worried about what's going on in this person's marriage or with their kids."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12229.96,"end":12230.2,"speaker":"Fr Andrew Stephen Damick","text":"Or."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12230.92,"end":12656.23,"speaker":"Fr Stephen De Young","text":"Someone who I deeply respected and looked up to came to me in confession today and told me something that I don't even know how to process, that they did it, let alone what I should tell them to do to try to help them. Nobody seems to desire that. Nobody seems to desire the reality that I as a priest, let alone what a bishop, will face at the last judgment when we stand before Christ and have to give an answer not only for ourselves, but for everyone we served and how we interacted with them and how we helped or failed to help or advise or failed to advise those other people. People don't want that responsibility part. And that's what St. Paul was talking about when he said not many of you should presume to be teachers because of the judgment. It's expressly what he said. But more importantly, as much as it's been bred into us, sort of post Freud, that we should all follow our desires or follow our bliss, right? Should we go out seeking that thing that will make us happy, that will fill in our lack, that will, you know, finally make us complete and perfect us? That doesn't work. It never works. When you get the thing you desire, it doesn't make you complete, it doesn't fill the lack. And so one of two things happens. You move on to the next thing, the next most more powerful position, the next level of influence, the next amount of wealth, the next promotion, the next trophy spouse, the next whatever. And eventually after that's happened a few times, it's different for different people. That's when you get truly black pilled. That's when you realize, you know what? Nothing is going to make me happy. Nothing is going to fix this. Nothing is going to make me feel complete. This quest is endless and will never be satisfied, right? And that can be a very dark place to end up if the only way of living life you've ever known is pursuing the things you desire. The flip side of that, the flip side of that has to do with the Holy Spirit and the way we've talked about spirits in general and the Holy Spirit in particular in the last several episodes of the podcast. And that's that the Holy Spirit himself, God has agency, right? God is at work in the world and can be at work through us. And so rather than trying to figure out what it is we want, sometimes we don't even know. Rather than trying to figure out what it is we want what it is that might make us happy. Becoming more sensitive to the Holy Spirit feels a little bit more like doing what we feel compelled to do. Doing what we know is right, doing what we know should be done. And in most cases we do actually know that because it is true, as we talked about last time, that the Holy Spirit has written the commandments upon our heart. We know when we see someone struggling, we should help. We know when we see someone being belittled, we should intervene. We know what we need to do about suffering, about the impoverished person who's asking us for help. We know what we should do. But because We've become insensitive to the Holy Spirit. We don't feel compelled to actually do it. We don't feel the push, right? We don't feel the drive. And that is what, first and foremost, fostering that sensitivity is about. We do that in prayer. We do that by doing hard things, forcing ourselves, even when we don't feel like it, even when we don't feel compelled. But ultimately, the best advice I got in terms of how I ended up being a priest was from actually a Roman Catholic priest who was the. Who had the same last name as me, no relation, who told me that before you become a priest, before you become clergy, you should try to do everything else. You should try and work any other job that you think you might enjoy that might work for you. You should go and get a nice car. You should, right? And in his Roman Catholic context, he said, he told me that he tells people who want to be Roman Catholic priests they should go out and date, do all those things, right? Because if God wants you to be a priest, if that's the particular role he's calling you to, if that's the work he wants to go through you, you won't be able to do anything else. Ultimately, you'll be compelled to do it. You'll be driven to do it right? And you'll find yourself doing things like shouldering burdens and responsibilities and sins of the people that you never would have said you wanted to or desired to. But you'll do it because it's the only thing you can do. This isn't isolated to the priesthood because, as we said, there's lots of different kinds of priesthood. There's a certain priesthood that's practiced by parents in a family. There's a certain priesthood that's practiced as a leader in various other community areas. Even within the church, there are different priesthoods and different ministries, but in all of those, we need to be looking not for the thing we want, the thing we desire, the thing we think will make us happy, but what we feel compelled and driven by the spirit of God to do so. Those are my last thoughts."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12656.96,"end":12674.72,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you very much, everyone for listening. If you didn't get through to us live, we'd still love to hear from you. You can email us@lordofspiritscientientfaith.com you can message us at our Facebook page, or you can leave us a voicemail eakpipe.com lordofspirits."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12675.04,"end":12682.1,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific except the next one which will be pre recorded."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12682.73,"end":12694.57,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And if you are on Facebook you can like our page. You can join our discussion group, leave reviews and ratings in all the appropriate places, but most importantly, share the show with a friend who will be edified by it."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12695.05,"end":12708.42,"speaker":"Fr Stephen De Young","text":"Heck, leave some in inappropriate places. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. But if you listen to those other podcasts, don't tell me because I get a little bit gay. Genghis Khan."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12711.22,"end":12721.38,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much, Good night, God bless you. And hey everybody, Remember, subscribe to the Wolf and the Cross. It's my awesome documentary that's going to release anytime now."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12721.62,"end":12722.5,"speaker":"Fr Stephen De Young","text":"Free commercial."}
{"episode_id":"LOS - #058 - 2022-12-22 - Who's in Charge Here -","start":12727.54,"end":12764.76,"speaker":"Voice Of Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen D. And Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor, honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
