{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":0.48,"end":65.09,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":66.29,"end":102.76,"speaker":"Fr Andrew Stephen Damick","text":"Greetings. Good evening giant killers, dragon slayers, stompers on scorpions and serpents. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick and Emmaus, Pennsylvania. If you're listening to us live, you can call us at 855-AF-RADIO. That's 855-237-2346 and Matushka Trudy, our very own is taking your calls this evening and we're going to get to those in the second part of our show. I take a deep breath to see if Father Stephen's going to interject something before I."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":104.2,"end":105.48,"speaker":"Fr Stephen De Young","text":"No. Why would I do that?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":105.64,"end":175.81,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. So Lord of Spirits is brought to you by our listeners and also by Chrysostom Academy. A lot of you listeners out there, I know you work from home and if you are telecommuting, you can probably live almost anywhere. And if you're a parent of school age kids, you're like me working from a virtual office, then one of your big considerations for where you choose to live is where your kids go to school. I love living in the Lehigh Valley of Pennsylvania. I've been here for 14 years now and part of why I love living here is because my kids go to Chrysostom Academy, which is a pan orthodox classical school with elementary through high school students. It is a beautiful 55 acre campus that it's on. It has very high academic standards and it's focused not just on educating the mind, but actually forming the whole person in Christ. So if you don't live here yet, think about moving to the Lehigh Valley, sending your kids to Chrysostom Academy. And even if you don't telecommute, our local economy is growing and it's producing jobs. We've got eight Orthodox parishes in our metro area, so check out chrysostomacademy.org to see what I'm talking about."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":176.61,"end":189.17,"speaker":"Fr Stephen De Young","text":"So let me ask you this. Do they ship the Pepsi there to put the peeps in it, or do they ship the peeps somewhere to be put in the Pepsi? Wow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":189.89,"end":207.08,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. But that reminds me, of course, of a. And this might seem weird to some people, but I lived in North Carolina for 11 years, and in North Carolina, they will. Some of the people, especially out in the country, will drink Pepsi and they will put salted peanuts in the top of that. Do they do that in Louisiana?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":207.48,"end":219.72,"speaker":"Fr Stephen De Young","text":"I have never seen someone do that with Pepsi. You can barely get Pepsi products here, by the way. If you prefer Pepsi in Texas or Louisiana, you are a pariah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":220.08,"end":221.12,"speaker":"Fr Andrew Stephen Damick","text":"Interesting, interesting."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":221.28,"end":224.56,"speaker":"Fr Stephen De Young","text":"But I have seen people do the peanut thing with Mr. Pibb."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":224.96,"end":228.72,"speaker":"Fr Andrew Stephen Damick","text":"Huh? I've never tried that, but I will now consider it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":229.6,"end":232.48,"speaker":"Fr Stephen De Young","text":"And Mr. Pibb is great value. Dr. Pepper, by the way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":233.04,"end":233.44,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":233.76,"end":236.16,"speaker":"Fr Stephen De Young","text":"Like, didn't finish its degree. That's why Mr. Pibb."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":236.16,"end":252.14,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly, exactly, exactly. It's ABD, which is not a thing, people. So we're continuing our series on the sacraments of the Orthodox Church. This is actually the ninth episode. It's our longest running series yet. But where will it end? End?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":252.38,"end":254.46,"speaker":"Fr Stephen De Young","text":"Tears. It will end in tears."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":256.3,"end":277.3,"speaker":"Fr Andrew Stephen Damick","text":"Tonight we're going to be talking about the holy mystery of monasticism. The actual service of making a monk is pretty brief, really. And the key moment is the cutting of some hair. There's a lot, a lot of history that goes into that haircut. So as is our want, we will be heading back in time, but not to Genesis time. When does our time machine land this."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":277.3,"end":282.61,"speaker":"Fr Stephen De Young","text":"Time, Father Stephen, in your second grade Sunday school class to destroy it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":284.37,"end":285.17,"speaker":"Fr Andrew Stephen Damick","text":"Buckle up."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":285.57,"end":296.69,"speaker":"Fr Stephen De Young","text":"Yes, I do love the tears episodes. Yeah, a lot of people are gonna be upset. Might burn their flannographs in rage."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":298.45,"end":303.01,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that takes me back. Yes, I love the flannel graph."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":303.65,"end":337.14,"speaker":"Fr Stephen De Young","text":"Be careful environmentally about burning a flannagraph. Just for the record. Yeah, some of us learned that the hard way. So actually we're going back to numbers. So we're not going to Genesis, but we are going to the Torah. Because if we're going to talk about. On our way to talking about monastic tonsure, KWA sacrament or mystery of the church. We're going to talk about monasticism. And if we're going to talk about monasticism, we have to start with Old Testament monasticism, which was a thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":338.13,"end":338.61,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":340.29,"end":355.57,"speaker":"Fr Stephen De Young","text":"And I think the reason more people don't know it was a thing is that obviously our Protestant friends, not to take a jab or anything, but."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":357.81,"end":358.09,"speaker":"Fr Andrew Stephen Damick","text":"Our."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":358.09,"end":427.35,"speaker":"Fr Stephen De Young","text":"Protestant friends, right from the get go, Martin Luther, very against monasticism, having been a monk himself. Yes. Rejected it not only for himself and his wife, but for everyone. That general antipathy toward monasticism and toward asceticism, sort of the way we saw in the last episode with the way Puritan sort of reread the institution of monarchy in the Old Testament, caused a reread of some of this. So we have to start here in the Old Testament with Right. Vowed persons, persons who took vows, in some cases lifelong, which impacted their lifestyle, their way of life, their behavior, and consisted of certain forms of asceticism, making it essentially the Old Testament precursor, the tradition out of which Christian monasticism is going to evolve as we are going to see through the rest of this evening."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":427.67,"end":428.31,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":429.67,"end":438.39,"speaker":"Fr Stephen De Young","text":"And so the place where this is sort of first laid out in the Torah is in the Book of Numbers, as I mentioned, everybody's favorite book of the Bible."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":439.27,"end":440.63,"speaker":"Fr Andrew Stephen Damick","text":"Just right after Leviticus."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":442.63,"end":449.19,"speaker":"Fr Stephen De Young","text":"I don't know. I don't know. We should put up a poll. Would you rather read Leviticus or numbers?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":449.99,"end":451.27,"speaker":"Fr Andrew Stephen Damick","text":"That would be interesting to see."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":451.75,"end":455.83,"speaker":"Fr Stephen De Young","text":"Yeah. Because, like, I find Leviticus actually interesting. I'm a nerd."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":456.15,"end":461.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you know, who. Who isn't into exactly what you do with the fatty lobe that's on the liver."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":461.75,"end":470.79,"speaker":"Fr Stephen De Young","text":"Yeah. Whereas even I, with the thing with the Book of Numbers is that it's inconsistent. So there are sections of it that are intensely interesting."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":471.43,"end":471.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":472.15,"end":473.75,"speaker":"Fr Stephen De Young","text":"And then other parts that are not."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":474.79,"end":475.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":475.27,"end":475.59,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":475.59,"end":477.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Big, big lists and."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":477.27,"end":477.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":478.07,"end":479.35,"speaker":"Fr Andrew Stephen Damick","text":"Land allotments and."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":479.59,"end":480.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":480.83,"end":482.79,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it kind of does what it says on the label."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":483.73,"end":491.25,"speaker":"Fr Stephen De Young","text":"But this is one of the more interesting places, I would argue, that is important to understanding a lot of the rest of the Scriptures."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":491.41,"end":505.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is Numbers, chapter six. And I'm going to read kind of a chunk. It's verses one through 21. But this is the key thing that we're basing everything else that we're going to be saying. This is the beginning of all of that. And I think it's really."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":506.05,"end":509.25,"speaker":"Fr Stephen De Young","text":"We're approaching Holy Week, so get used to long Scripture readings, folks."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":509.49,"end":721.75,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Amen. And. And I think we should especially note, I just want everyone to pay attention to this, that you know, the first verse says the Lord spoke to Moses, saying, so that means that what we're about to read is directly from God. So this is not a human institution that we're talking about. This is directly from God. So all right, verse one. And the Lord spoke to Moses, saying, speak to the people of Israel and say to them, when either a man or a woman makes a special vow, the vow of a Nazirite to separate himself to the Lord. He shall separate himself from wine and strong drink. He shall drink no vinegar made from wine or strong drink, and shall not drink any juice of grapes, or eat grapes fresh or dried, all the days of his separation. He shall eat nothing that is produced by the grapevine, not even the seeds or the skins, all the days of his vow of separation. No razor shall touch his head until the time is completed for which he separates himself to the Lord. He shall be holy. He shall let the locks of hair of his head grow long. All the days that he separates himself to the Lord, he shall not go near a dead body, not even for his father, or for his mother, for brother or sister, if they die, shall he make himself unclean, because his separation to God is on his head all the days of his separation he is holy to the Lord, and if any man dies very suddenly beside him and he defiles his consecrated head, then he shall shave his head on the day of his cleansing. On the seventh day he shall shave it. On the eighth day he shall bring two turtledoves or two pigeons to the priest to the entrance of the tent of meeting, and the priest shall offer one for a sin offering and the other for a burnt offering, and make atonement for him because he sinned by reason of the dead body. And he shall consecrate his head on that same day and separate himself to the Lord for the days of his separation, and bring a male lamb a year old for a guilt offering, but the previous period shall be void because his separation was defiled. And this is the law for the Nazirite. When the time of his separation has been completed, he shall be brought to the entrance of the tent of meeting, and he shall bring his gift to the Lord. One male lamb a year old without blemish for a burnt offering, and one ewe lamb a year old without blemish as a sin offering and one ram without blemish as a peace offering and a basket of unleavened bread, loaves of fine flour mixed with oil and unleavened wafers smeared with oil and their grain offering and their drink offerings. And the priest shall bring them before the Lord and offer his sin offering and his burnt offering. And he shall offer the ram as a sacrifice of peace offering to the Lord with the basket of unleavened bread. The priest shall offer also its grain offering and its drink offering. And the Nazirite shall shave his consecrated head at the entrance of the tent of meeting and shall take the hair from his consecrated head and put it on the fire that is under the sacrifice of the peace offering. And the priest shall take the shoulder of the ram when it is boiled, and one unleavened loaf out of the basket and one unleavened wafer, and shall put them on the hands of the Nazirite after he has shaved the hair of his consecration. And the priest shall wave them for a wave offering before the Lord. They are a holy portion for the priest, together with the breast that is waved and the thigh that is contributed. And after that, the Nazirite may drink wine. This is the law of the Nazirite. But if he vows an offering to the Lord above his Nazirite vow, as he can afford in exact accordance with the vow that he takes, then he shall do in addition to the law of the Nazirite. So that's the passage. No grapes, no raisins."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":722.47,"end":723.79,"speaker":"Fr Stephen De Young","text":"No raisins, no raisins."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":723.79,"end":725.11,"speaker":"Fr Andrew Stephen Damick","text":"I know that's what it says."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":725.51,"end":731.25,"speaker":"Fr Stephen De Young","text":"Just plain bran flakes. Not even one scoop, let alone two scoops."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":733.73,"end":737.81,"speaker":"Fr Andrew Stephen Damick","text":"That's just Wheaties now. It's just Wheaties. Sort of. I don't know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":740.21,"end":828.9,"speaker":"Fr Stephen De Young","text":"So, yeah, so this is the institution of the Nazarite vow. And now to sort of. I know that that was sort of the biblical info dump, but now to sort of work through that a little bit. Yes, and talk about a little more. So Nazirite is pretty clearly derived from the Hebrew Nazir, I mean, pretty obviously, which means to set apart or to make holy as a verb. And of course, being made holy means being set apart. We've talked about that before. Right. That's the concept. Right. So this is a person who is setting themselves apart to be holy to God. The Greek translations of the Old Testament are sort of all over the place with Nazirite. So in some places it gets translated usually as either the sanctified one or the vowed one, the one who has taken a vow. Right. For obvious reasons, both of those would apply. Some places it's not translated. It's just transliterated as Nazir in Greek, just in Greek characters. So that's fairly Clear cut. So sorry, Father Andrew, you don't get to do much with etymologies."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":829.06,"end":831.7,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. I can't win them all."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":833.62,"end":857.55,"speaker":"Fr Stephen De Young","text":"So. And then, right, during the period of this vow, right, you've got these three main rules, and you could hear how strictly they're enforced, right? So there's this. No wine and strong drink, but that's enforced so strictly that, like vinegar, a grape skin, grape seed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":857.71,"end":860.03,"speaker":"Fr Andrew Stephen Damick","text":"No seeds, no raisins, no grapes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":860.03,"end":862.19,"speaker":"Fr Stephen De Young","text":"Like, you can't come near it, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":862.43,"end":862.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":863.72,"end":906.95,"speaker":"Fr Stephen De Young","text":"So this. This is right. When you are one of these vowed people, right. Then there's no legal. Like, sometimes we're in Lent, right? So sometimes we get a bit legalistic with the fasting rules as Orthodox people, right? And we're like, well, you know, technically, there's no room for that kind of legalism here, right? This is just anywhere, you know, someone throws a grape at you, you have to dodge it, right? Like, there's no right room for messing around. You also have the. No cutting of the hair."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":907.91,"end":919.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although you have to do a head reset first. Like, you have to shave it all off and then let it grow out so that, like, all the hair you have during that period is the hair of your consecration."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":920.71,"end":973.52,"speaker":"Fr Stephen De Young","text":"Right, right. And that kind of ritual appears in a couple other places in the Torah. Probably the most notable one is in Deuteronomy, if a man wants to make a woman taken in war to be his wife, who is not, therefore not an Israelite, right. He's not allowed to take her as a slave or a concubine. Right. That he can marry her, and in that instance, she also shaves her head at that point. And so this signifies sort of making a new beginning or a new commitment. Right. And of course, that happens on both sides of the vow. Yeah, right. It happens as you begin the vow, and then it happens as the vow ends, where you make this sort of new beginning. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":973.52,"end":977.93,"speaker":"Fr Andrew Stephen Damick","text":"There's no, like, locks of love are, you know, one of those things to."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":977.93,"end":1002.78,"speaker":"Fr Stephen De Young","text":"Donate, where you donate it. Yeah, yeah, yeah. I will also point out for the record, I find that with this. And we're going to be talking about Samson later, everyone always assumes that all these Hebrew folks had long, straight hair. This is not the case. Right, right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1002.86,"end":1007.38,"speaker":"Fr Andrew Stephen Damick","text":"They had. So I don't know what you would call it, but. But, yes, the hair often is curly."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1007.38,"end":1012.18,"speaker":"Fr Stephen De Young","text":"And kind of, you know, what you call it. You just don't want to say it live on the exit. Faith radio."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1012.18,"end":1038.44,"speaker":"Fr Andrew Stephen Damick","text":"No, no, because, I mean, there's no. There's. There's well, see, so I used to know a guy when I. So when I was in college, I knew a guy who is whiter than I am. And I'm. I mean, I'm pretty white and. But he had this kind of fluffy curly hair and when he grew it, it. It grew up and he referred to it as an Anglo. Oh. And. Yeah. Yeah. So I. But I don't know, you know what? The ancient near east with the term. I can't even. I just."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1038.44,"end":1055.68,"speaker":"Fr Stephen De Young","text":"Yeah. So some of these folks growing their hair out, they would have looked more like a basketball player in the 1970s. Right. Than. Than like Fabio. Right, Right. So don't assume. Right. And. And for men, notice it's. It's hair of the head. That included the beard, by the way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1056.69,"end":1061.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. Not just the top of the head, but the whole head."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1061.13,"end":1061.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1061.81,"end":1064.69,"speaker":"Fr Andrew Stephen Damick","text":"What about eyebrows? They shave off the eyebrows too."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1065.33,"end":1067.49,"speaker":"Fr Stephen De Young","text":"This I do not know. I do not think so."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1068.37,"end":1069.97,"speaker":"Fr Andrew Stephen Damick","text":"Nose hairs, given the."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1069.97,"end":1073.17,"speaker":"Fr Stephen De Young","text":"The shaving technology they had. Although the Egyptians did it. But."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1073.57,"end":1074.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1076.69,"end":1084.22,"speaker":"Fr Stephen De Young","text":"So. And then the. The third rule, which again, you can see how rigorously it's enforced, is no corpses."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1085.18,"end":1085.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1085.78,"end":1087.02,"speaker":"Fr Stephen De Young","text":"Even if it's a family member."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1087.42,"end":1090.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or like someone drops dead next to you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1090.46,"end":1093.98,"speaker":"Fr Stephen De Young","text":"Yeah. You have to like, jump away. Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1094.06,"end":1105.9,"speaker":"Fr Andrew Stephen Damick","text":"And it's interesting how, like, if you. With that, right. If someone drops dead next to you, then you have to go and offer sacrifices and then you have to reset. Like, it doesn't."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1105.9,"end":1106.94,"speaker":"Fr Stephen De Young","text":"Your time all over."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1107.1,"end":1111.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have to start all over. It doesn't count for the vow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1111.55,"end":1169.71,"speaker":"Fr Stephen De Young","text":"And this is, if you look in later Jewish rabbinic literature about this. Right. There's no lessening of the strictness. Right. Like it says, a Nazirite cannot be in a house with a dead body. A Nazarite cannot stand in the shade of a tree because there might be a dead body buried under the tree. Amazing, right? So, like, the level to which you're not allowed to come near a corpse. It's also interesting. One of the reasons we know that this didn't just include human corpses. Right. But meant corpses in general is not only just that, you know, the corpses of animals were also considered ceremonial unclean in the Torah. Right. I mean, but is that the actual words that are used here in Hebrew are nefesh mot. It literally means dead souls."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1170.67,"end":1171.47,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1172.11,"end":1185.71,"speaker":"Fr Stephen De Young","text":"So if you want someone to take these dreams away that point you to another day, you're out of luck if you're a Nazirite, because you can't go near dead souls. Father Andrew's Pretending he got that reference."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1185.71,"end":1190.07,"speaker":"Fr Andrew Stephen Damick","text":"But it's okay. I don't need to get every reference."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1190.15,"end":1272.28,"speaker":"Fr Stephen De Young","text":"Someone did. And that person is one of my people. So there are, as we noted. Right. And right when it starts, this is something a lot of folks don't realize either. Both men and women could become Nazarites, could take a Nazarite vow. Yeah, the prominent example. Well, not just prominent examples. All the examples that we have in the scriptures proper. Now, if you go to Jewish tradition about different people who took Nazarite vows. There are women, but in Scripture, all the cases we have are men who take Nazarite vows. But either men or women could do this. This is another connection to later monasticism. Right. And there were both. Right. Temporary and lifelong Nazarites. So there were people who are dedicated either by themselves early in their life to be Nazarites for their whole lives or by their parents. The parent could dedicate someone to be a Nazirite. Now, in later rabbinic literature, there is a rite of refusal once the child comes of age."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1273.11,"end":1273.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1274.07,"end":1283.19,"speaker":"Fr Stephen De Young","text":"Right. So that would be in modern terms when you get bar mitzvahed. Right. If you. You could leave the Nazarite thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1283.59,"end":1295.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I'm thinking about that now. Right. Lifelong Nazarite. Okay. It's one thing, you know, no grapes, no dead bodies, but, like, never, ever cutting that hair."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1297.51,"end":1298.6,"speaker":"Fr Stephen De Young","text":"Yeah, I remember."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1298.6,"end":1301.44,"speaker":"Fr Andrew Stephen Damick","text":"Who was that singer, that country singer that had that incredibly."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1301.44,"end":1302.2,"speaker":"Fr Stephen De Young","text":"Crystal Gale."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1302.36,"end":1308.04,"speaker":"Fr Andrew Stephen Damick","text":"That's her. That's her. Right. She was big in the 70s and 80s. Her hair was, like, down to her ankles."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1308.44,"end":1308.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1309.08,"end":1314.56,"speaker":"Fr Andrew Stephen Damick","text":"Maybe she was a Nazarite. I'm just putting that out there. I had to check if she ever had any grape juice."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1314.56,"end":1324.28,"speaker":"Fr Stephen De Young","text":"Yes. There's a bunch of people typing into Google right now. Was Crystal Gale a Nazarizer? And it's just going to mess with the algorithm. Unbelievably."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1324.65,"end":1325.53,"speaker":"Fr Andrew Stephen Damick","text":"I'm here for it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1330.49,"end":1469.6,"speaker":"Fr Stephen De Young","text":"So if it's a temporary vow. Right. Then the text we heard from Numbers describes the sacrifices that were made at the end of it. So it lists a sin offering, a peace offering, and a whole burnt offering. But then in the context of the peace offering, it also mentions bringing a grain offering and a drink offering. Right. So it's sort of everything. Right. It's sort of the whole slate. Right. Of offerings that you bring at the end of the vow and then added to all of those offerings to God, quite literally, because it's thrown into the fire of the peace offering is all the hair that you grew during the vow. Right. That is thrown in and Burnt. And we've. I know we've talked about before, back when we did the episodes on sacrifice. And I think we probably touched on this in the baptism episode as well, that in animal sacrifices in the ancient near east, including in ancient Greece, one of the last stages before an animal was sacrificed would be cutting off a tuft of its hair and throwing it into a fire, usually a bowl where incense was being burned. Right. Or some other nearby fire. And that was sort of the beginning of the offering of the animal. And that is one of the actions, the sacrificial actions, that in Greek and Roman sacrificial ritual comes to be part get elaborated and emphasized to try to make it so that the animal is offering itself, that you're not killing the animal, that the animal is offering itself to the gods and you're just sort of facilitating things. But that's important because. Right. The context here is it's not that God really likes the smell of burning hair, because, I mean, who does? Right. And you know, I've never gotten through a Lenten Holy Week in the Orthodox Church without smelling it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1469.6,"end":1509.68,"speaker":"Fr Andrew Stephen Damick","text":"At some point, you know, when one of my classmates was ordained to the diaconate, I'm not going to mention his name, but I don't want to shame the poor guy. He is now a fine upstanding priest and has been for many years. But when he was ordained to the diaconate, he was serving as a subdeacon at Arcommen Alma Mater of Saint Tikon Seminary. And he had, you know, decent. He had a decent hair. You know, he had hair. And he was serving as a subdeacon and he was holding up a candle in front of him and the front of his hair lit on fire during that service. And we called him the pyro deacon for some months following the Father Pyrodeacon."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1510.64,"end":1527.3,"speaker":"Fr Stephen De Young","text":"Well, there was a period of my life where on a certain day in Holy Week, I would be holding an icon. People would come by holding candles and venerate said icon. And I would over the course of the evening have all the hair burned off the back of my right hand."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1527.54,"end":1528.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1528.34,"end":1634.24,"speaker":"Fr Stephen De Young","text":"And I am hairy like an ape or some sort of goat man on the back of my hand can confirm. And so this was quite acrid, shall we say. But so, yes, that is not a pleasant smell. That's not what we're going for here. This isn't part of the pleasing aroma of sacrifice thing. This is a self offering. Right, right. This is to symbolize the person offering themself to God, along with the sacrifices, by offering a part of themselves in place of the whole. So when a Nazarite vow was taken temporarily, when it was not a lifelong thing, but was a temporary thing, I'm going to do this for six months or a year or however long. The idea was that this was what might be called a conditional vow. Meaning you would take this vow either because there was something in particular you were praying for, or you would sort of make the vow in advance. You would say you would be praying for something. Right. You'd be praying, say, for. For a family member's healing. And you would vow to God, you know, if. If you heal this person, I will, you know, take the Nazarite vow for a year. Right. And then you would fulfill that vow. Right. So you could do it in advance, or you could be praying for something, repenting of something. Right. And take the vow sort of as part of that. Right. So you're going to spend the year that you're living as a Nazirite praying about that thing or repenting of that thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1635.12,"end":1637.28,"speaker":"Fr Andrew Stephen Damick","text":"Sort of a dedication, as it were."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1638.08,"end":1655.13,"speaker":"Fr Stephen De Young","text":"Right. And so that is sort of tightly tied in with. Than why you're offering these sacrifices at the end of it. Right. That's sort of the culmination. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1656.49,"end":1656.89,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1657.69,"end":1666.97,"speaker":"Fr Stephen De Young","text":"Of the vow itself, which is a sort of sacrifice. So now we have to give a trigger warning."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1667.85,"end":1669.73,"speaker":"Fr Andrew Stephen Damick","text":"We haven't given a trigger warning in a while."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1669.73,"end":1670.17,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1670.57,"end":1672.33,"speaker":"Fr Andrew Stephen Damick","text":"This is not a parental warning, though."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1672.57,"end":1673.93,"speaker":"Fr Stephen De Young","text":"No, not a parental warning."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1674.34,"end":1674.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1676.74,"end":1688.98,"speaker":"Fr Stephen De Young","text":"Mike. Could be, but no, this is. This is not a parental warning. This is. This is. This is a trigger war. There are a lot of people who get deeply, deeply upset when I talk about Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1689.54,"end":1694.06,"speaker":"Fr Andrew Stephen Damick","text":"I know I shouldn't say it's funny, but it's funny, like, odd to me. I don't know. Odd."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1694.06,"end":1694.9,"speaker":"Fr Stephen De Young","text":"Yeah. Straight."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1694.9,"end":1695.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1695.22,"end":1699.78,"speaker":"Fr Stephen De Young","text":"Right. This of all things, like, this is. This is where people just. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1700.47,"end":1704.35,"speaker":"Fr Andrew Stephen Damick","text":"I think it's because people look at him as some kind of superhero. Samson's superhero."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1704.35,"end":1720.55,"speaker":"Fr Stephen De Young","text":"This is my theory. Especially little boys. You go to Sunday school, you learn about Samson. He seems really cool and awesome, Right. He's like an action hero. Right. So we're gonna have some real talk. I'm gonna ruin a lot of Sunday school talk about Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1721.03,"end":1724.63,"speaker":"Fr Andrew Stephen Damick","text":"It turns out that Samson is a very bad monk."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1725.03,"end":1726.71,"speaker":"Fr Stephen De Young","text":"Yes. Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1727.11,"end":1729.63,"speaker":"Fr Andrew Stephen Damick","text":"A really bad monk and kind of."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1729.63,"end":1734.23,"speaker":"Fr Stephen De Young","text":"A mad monk and kind of a meddling monk. Anyway."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1734.23,"end":1735.19,"speaker":"Fr Andrew Stephen Damick","text":"All the alliteration."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1735.43,"end":1760.32,"speaker":"Fr Stephen De Young","text":"Yes. So. Yeah. So be prepared, Right. We're about to say a bunch of things about Samson that are. That are not positive. When we get to the end, Right. We're explaining that none of the non positive things that we're about to say about Samson are original to us."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1760.88,"end":1766.16,"speaker":"Fr Andrew Stephen Damick","text":"No, right. Literally, most of it is just what's in the Bible."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1766.4,"end":1775.36,"speaker":"Fr Stephen De Young","text":"Right. So it's what the scriptures say about Samson. It's what church fathers say about Samson. It's. Right. That's really what we're talking about here."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1775.68,"end":1779.61,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So, well, let's start talking about him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1779.61,"end":1805.88,"speaker":"Fr Stephen De Young","text":"Because people will get upset. Yes. So before we could really dig into Samson himself, right. We. We have to set the stage a little, because when the story of Samson begins with the announcement of Samson's birth, Samson is probably the most famous Nazarite in the Bible. Right, right. Like if somebody says, who's a Nazarite in the Bible? And you can come up with anybody, Samson's probably the first guy you say. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1806.36,"end":1807.64,"speaker":"Fr Andrew Stephen Damick","text":"They remember the hair thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1807.8,"end":1813.52,"speaker":"Fr Stephen De Young","text":"Yeah. So when that story starts of his."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1813.52,"end":1813.88,"speaker":"Fr Andrew Stephen Damick","text":"Birth."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1815.64,"end":1899.41,"speaker":"Fr Stephen De Young","text":"Right off the bat, it talks about the angel of the Lord coming to this married couple in the tribe of Dan. And that doesn't mean a lot to us. Right. As modern people. Right. Even if we're fairly biblically literate. Right. We know. Well, okay, Dan is one of the 12 tribes. It's one of the northern tribes that got destroyed when the northern kingdom of Israel. Right. Got destroyed by the Assyrians. So they vanished off the face of the earth. The name's kind of funny because we probably know some guy named Dan. Right. So you can make some kind of jokes, but we may not know a lot about this tribe, but the original readers of the Book of Judges, they knew all about Dan. Dan has a certain reputation, and a lot of this is coming out of the Torah. Right. So the Torah establishes a certain character for the tribe of Dan. We see that play out in Joshua in Judges. Right. And so even when the story of Samson starts and we find out, oh, this is a dude from Dan, Right. That's a tip off, Right. That's already setting the stage."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1899.73,"end":1909.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's almost like. I mean, not quite the same, but, you know, like if you're a man named Leroy Brown from the south side of Chicago, which is the baddest part of town."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1909.73,"end":1918.44,"speaker":"Fr Stephen De Young","text":"Yeah. And you're the meanest man, right. In the whole town, right? Yeah. It's worse than that, though."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1918.84,"end":1922.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, actually far worse. It's not just a bad neighborhood."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1922.28,"end":1928.68,"speaker":"Fr Stephen De Young","text":"Yes. This is more like setting the stage as it's 1938 in Berlin."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1929.8,"end":1931.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1932.76,"end":1951.53,"speaker":"Fr Stephen De Young","text":"Right. Like there's not, you know, 20th century Germans or seeing Caligula's palace in Rome. Right. Like, there's not going to be, like, happy outside kids. There's not going to be a romantic comedy. Right. That unfolds after that. Right, right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1952.73,"end":1953.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1953.69,"end":1978.98,"speaker":"Fr Stephen De Young","text":"So the first thing we need to know about Dan, historically. Right. So we've mentioned before on the show, and we're not going to go through all the biblical stuff starting in the Torah about this again, but that ancient Israel was not unified in a genetic way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1979.62,"end":1983.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was a collection of different groups of people who all lived the same way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":1984.02,"end":2039.96,"speaker":"Fr Stephen De Young","text":"Right, right. And even coming out of Egypt. Right. We've talked about how there were people there who were ethnically things other than Hebrew. Right. There were people who are literally biologically descended from Abraham. There were people who had married into Abrahamite tribes and clans, and there were people who were just sort of adopted and assimilated into clans and tribes within Israel. Right. And we gave at the time, one of the very prominent examples is Caleb. Right. Who's the big hero, along with Joshua, who starts out as a Canaanite, a Kenizite, to be specific, and ends up being an elder of the tribe of Judah. And his father appears, who is a Kenizite. Right. So he is not biologically descended from Judah. Nevertheless, he ends his life as an elder, one of the clan heads in the tribe of Judah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2040.36,"end":2043.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Dan is like this. Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2043.34,"end":2047.74,"speaker":"Fr Stephen De Young","text":"Dan is one of two tribes, Dan and Gad."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2048.22,"end":2058.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And I mean, now. Now we should say Dan himself as a person, as a son of Jacob, slash Israel. There is a son. One of his sons is named Dan."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2059.02,"end":2059.42,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2059.42,"end":2059.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2059.7,"end":2060.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2060.02,"end":2065.3,"speaker":"Fr Andrew Stephen Damick","text":"You know, but these people are not mostly even descended from him personally."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2065.3,"end":2170.32,"speaker":"Fr Stephen De Young","text":"Right. Dan and Gad are the two tribes that are mostly assimilated from other people who have become the most of their people have become part of Israel, but are not. Most of the humans are not biologically descended from Abraham by our standards. Right. They didn't think that way. As we've talked about before in the ancient world, they didn't know what DNA was. They didn't have heredity tests. Right. You are a member of a tribe based on being a member of a clan, being based on being a member of a family in that clan, in that tribe. Right. It didn't matter. Right. So we talked about Phinehas, who had a different skin color for most of the Israelites. Right. Became the high priest. So this isn't a huge problem. It's there in the Torah to find. We won't go through all of it now. But in particular, most of the Danites became part of Israel after originally being one of the Sea Peoples. So the Sea Peoples were a group of tribes. They're called the Sea Peoples because they tried to invade Egypt from the sea, from the Mediterranean. They were repelled by the Egyptians and then settled along the coast. So some of them settled within the territory of Egypt, some of them, the most prominent ones being the Philistines, settled in the Levant. Right. But so most of the Danites are biologically descended from those resetling Sea Peoples, who, by the way, they originally came from Greece."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2171.2,"end":2171.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2172.72,"end":2200.56,"speaker":"Fr Stephen De Young","text":"We've also talked before about how this weird thing, starting in the Torah, starting in Deuteronomy, but continuing through, like, first Maccabees and stuff, that at least some of the Greeks were said to be descended from Abraham. And that's because of this. Because there were people who were what we would call ethnic Greeks today. Get. It's anachronistic, but what we would call ethnic Greeks, there were people of that extraction who were part of Israel."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2201.44,"end":2203.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Because they lived the life."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2204.64,"end":2205.2,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2205.6,"end":2208.53,"speaker":"Fr Andrew Stephen Damick","text":"Well, as we'll find out about Dan, kind of."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2208.53,"end":2209.65,"speaker":"Fr Stephen De Young","text":"They were supposed to."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2209.65,"end":2210.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2212.17,"end":2260.41,"speaker":"Fr Stephen De Young","text":"Some of them get flushed back out of Israel. But that's. But so that's where the Danites sort of come from. Right. And sort of the first clue that there's something going on with Dan is not about the later tribe. Well, not directly. It is ultimately about the later tribe, but it is part of a prophecy that's given in the Testament of Jacob. So in Genesis 48, Jacob blesses Joseph's sons. In Genesis 49, before he dies, Jacob blesses his own 12 sons. That includes Dan in Genesis 49, verses 16 and 17. Although this is not much of a blessing. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2260.65,"end":2275.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. So this is what he says about Dan. Dan shall judge his people as one of the tribes of Israel. Doing okay so far. Dan shall be a serpent in the way, a viper by the path that bites the horse's heels so that his rider falls backward."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2276.57,"end":2278.65,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that's not good."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2278.81,"end":2280.33,"speaker":"Fr Andrew Stephen Damick","text":"Like, thanks, dad."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2281.21,"end":2282.33,"speaker":"Fr Stephen De Young","text":"Being called a snake."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2282.33,"end":2284.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. Can you imagine that? Your dad is dying and this is."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2284.89,"end":2286.81,"speaker":"Fr Stephen De Young","text":"His last words to. He calls you a pit viper."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2287.18,"end":2287.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2287.46,"end":2295.58,"speaker":"Fr Stephen De Young","text":"And we have to take the context, too. Right. This is the second to the last chapter of Genesis. Think about the third chapter of Genesis and the serpent there. Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2295.66,"end":2296.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2297.9,"end":2334.14,"speaker":"Fr Stephen De Young","text":"So this is saying, hey, Dan's going to be bad. Now, this isn't talking about the guy, his son who's standing there. This is talking about the tribes just like if you read the prophecy about Judah, which we will at great vespers before Palm Sunday. Clue. Right. The. It's all about the Messiah, the future king. Right. Of Israel being descended from Judah, not about Judah, the person. Right. Who was not a king himself."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2334.22,"end":2335.1,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2336.86,"end":2398.57,"speaker":"Fr Stephen De Young","text":"So, yeah, this is. So this is a tip off. Right. Dan is not going to win a prize for being the most faithful tribe. Quite the opposite. And so then when we're, as we mentioned, talking about the Book of Numbers, as the tribes of Israel are entering into the land of Canaan, each tribe was given a land allotment that they were supposed to go and take and get rid of the giant clans that were there and take this land and settle there. And that was going to be granted to them sort of as a permanent land grant. The whole economic system laid out by the Torah, year of jubilees, all of that is based on the idea that the majority of the Israelite people are going to be farming these land grants. That's the way the whole thing is supposed to work."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2399.21,"end":2433.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what happens is that Dan is given a particular piece of land, just as all the tribes are, but they lose it and they decide to go and take another piece of land. So this is what it says in Joshua 19:47, when the territory of the people of Dan was lost to them, the people of Dan went up and fought against Leshem or Laish. And after capturing it and striking it with a sword, they took possession of it and settled in it, calling Leshem Dan after the name of Dan, their ancestor. So they took this other piece of land and then they even renamed it to be Dan. Like, no, this is our place."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2433.44,"end":2436.16,"speaker":"Fr Stephen De Young","text":"Yes. Well, not just a piece of land, a city."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2437.92,"end":2438.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2439.12,"end":2440.8,"speaker":"Fr Stephen De Young","text":"Remember the thing Cain built?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2441.76,"end":2442.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2442.48,"end":2469.19,"speaker":"Fr Stephen De Young","text":"So it's not just that they didn't go get the land God gave them to take. It's that they're rejecting that sort of agrarian way of life. Right. This is in the context of someone who's just read Genesis and the rest of the Torah. And now you're in Joshua, right? Oh, no, we don't want that land to go work it and farm it. We want this city. And so we're going to go and massacre everyone there and take it for ourselves."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2470.95,"end":2471.35,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2471.91,"end":2486.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so by the way, where is. Before we get too far, because I forgot to mention this, the Danae in Homer, same people."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2487.25,"end":2488.29,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2489.41,"end":2509.87,"speaker":"Fr Stephen De Young","text":"That's the same Sea peoples. So. But it's not just the fact that they massacred everyone in this city and took it for themselves. Part of it also is where this city is located. This city happens to be at the foot of Mount Hermon."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2510.51,"end":2511.79,"speaker":"Fr Andrew Stephen Damick","text":"Dun, Dun, Dun."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2512.75,"end":2517.23,"speaker":"Fr Stephen De Young","text":"Yes. See several episodes of this program."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2517.63,"end":2518.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2519.23,"end":2519.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2519.59,"end":2527.71,"speaker":"Fr Andrew Stephen Damick","text":"If you don't know what we're talking about, we'll just say it has something to do with baal kinds of dark evil stuff and gateways to the underworld. And."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2527.95,"end":2533.79,"speaker":"Fr Stephen De Young","text":"Yeah. It's right near Panius or Banius. Right. The spring with the pagan worship. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2533.95,"end":2534.35,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2536.48,"end":2576.98,"speaker":"Fr Stephen De Young","text":"Not far from. Not too far from Bashan. Right. Og. Right. So. So it isn't just a question of urban life versus rural agricultural life. It's they're choosing to essentially displace and replace the Canaanites, but then just be Canaanites. Right. Is the idea here. That's further emphasized later in Judges. Right. This story is briefly retold in. In Judges chapter 18. But also there's this kind of wonky story. So everybody, when you're in Sunday school and you go through Judges, you kind of stop with Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2577.94,"end":2578.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2579.54,"end":2622.7,"speaker":"Fr Stephen De Young","text":"Because after Samson, the story in 17 and 18 gets weird. And then in 19 and 20 it gets like, it turns into like an Eli Roth movie. Like, it's just weird. Like disturbing and weird. Right. But chapter 18 tells this story about how the fighting men of Dan who are going around raiding again, we're not out farming, we're out taking through violence. Right. From the neighbors. And they go and steal an ephod that's being worshiped and some idols and the Levite who is serving them."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2623.74,"end":2626.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What kind of Levite is that anyway?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2627.26,"end":2647.03,"speaker":"Fr Stephen De Young","text":"From a nearby town and take it back to Dan to set up Dan's new state religion around this idol. Right. So all that. Right. When we find out Samson is from the tribe of Dan."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2647.91,"end":2648.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2648.63,"end":2664.15,"speaker":"Fr Stephen De Young","text":"This doesn't bode well. Right. And there's nothing that happens later in the scriptures to kind of fix Dan's reputation. There's no one who comes out of Dan and sort of redeems it. And the old."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2664.49,"end":2665.93,"speaker":"Fr Andrew Stephen Damick","text":"Even Mount Hermon gets redeemed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2666.41,"end":2666.89,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2667.29,"end":2669.61,"speaker":"Fr Andrew Stephen Damick","text":"You know, but not Dan."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2669.69,"end":2677.29,"speaker":"Fr Stephen De Young","text":"Yeah. So not only are they. Are they wiped out by the Assyrians, but hey, so are the other northern 10 tribes. Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2677.53,"end":2678.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2679.13,"end":2699.99,"speaker":"Fr Stephen De Young","text":"But when you get all the way to the book of Revelation, all the way at the end of The Bible, Revelation 7, 4, 8, it lists. This is the 144,000 sealed. Right. 12,000 from each of the 12 tribes. If you read that list of tribes carefully, you'll notice something. Dan's not there."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2700.87,"end":2721.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's still 12. And the reason why there's 12 is because there's a little reshuffling that happens. So throughout the whole Old Testament, there's constant references to the half tribe of Manasseh and the half tribe of Ephraim, who are. Yeah. The two sons of Joseph. Right. So Joseph is the 12th son or the 11th, actually."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2721.14,"end":2721.46,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2723.38,"end":2729.22,"speaker":"Fr Andrew Stephen Damick","text":"But what happens is essentially these two half tribes in this list in Revelation get promoted to being full tribes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2729.22,"end":2812.28,"speaker":"Fr Stephen De Young","text":"So there's still 12 to make up for Dan being booted out. So. Yeah. So all of those prophecies about Israel, about Ephraim, about the northern kingdom being reconstituted and redeemed that we've talked about before on the show, that get made in the. By the Hebrew prophets, none of that apparently includes Dan. Right. So Dan is the one left out. So start to finish. This does not bode well for the Samson story we're about to hear. The other note before we get into the story of Samson property, is that people, of course, have noted certain similarities in the story between the story of Samson and sort of the Ur layer of stories of Heracles, AKA Hercules. Right, right. I say Heracles very specifically because by the time you get to Hercules, you're not at the Ur layer, shall we say. You get lots of different layers of different stories and things. Right. You know, the Nemean lion being sort of the obvious right off the jump. Right. Element that looks similar."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2812.6,"end":2815.16,"speaker":"Fr Andrew Stephen Damick","text":"Aegean Stables or Hydra."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2815.48,"end":2845.41,"speaker":"Fr Stephen De Young","text":"No, a little less so. Right. But the Nemian line jumps out. But there are other things, too. There are other things. The stuff with the foxes and stuff. There's a whole thing about this. Right. And so this is another one of those places. Right. Where you see influence of ancient Near Eastern stories outside of Israel on how stories are told within the Scriptures."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2845.57,"end":2846.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we're not."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2846.13,"end":2848.13,"speaker":"Fr Stephen De Young","text":"And I'm using that language very deliberately."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2848.13,"end":2867.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We're not saying that the. That whoever wrote this is just taking the Heracles. Heracles. That guy, his story, and putting a new name on it. And like, we're saying that this didn't really happen or that's actually a pagan story, but rather, as you said, the way that the story is told."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2867.39,"end":2913.3,"speaker":"Fr Stephen De Young","text":"Right, the way that the story is told. And you can see why you might choose Heracles in particular, given the origin of the Danite people. And so some of the traditional stories, since we've seen very clearly the Danites mostly remain pretty pagan. We're not following Torah, that these are stories that still would have resonated with them. And so part of what's going on here is, again, not saying things are being fictionalized, but you could tell stories in a way. I could tell a story using language and using imagery that will cause you to think of it in terms of another story."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2913.7,"end":2914.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2915.06,"end":2916.58,"speaker":"Fr Stephen De Young","text":"Right. That you are familiar with."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2916.9,"end":2917.38,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2917.38,"end":2926.9,"speaker":"Fr Stephen De Young","text":"Right. And you see this all the time. Well, hey, here's a really on the nose example. The lion, the Witch of the Wardrobe."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2928.26,"end":2928.82,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2929.22,"end":2963.11,"speaker":"Fr Stephen De Young","text":"Right. You're telling a story about a talking lion, but it's a little reminiscent of another story in the Bible just a skosh. Right, Right. So you can tell a story in that way and it's not just a fictional story like the Lie of the Witch of the Wardrobe. You could. You could tell a true story in a way that makes someone sound Christ. Like, for example. Right. I could. I could tell the story of someone's death in a way where I'm trying to convey this person was really laying down their life for their friends."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2964.17,"end":2964.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":2965.13,"end":3038.88,"speaker":"Fr Stephen De Young","text":"Right. Or you could tell the same story without, you know, without lying and just tell it as, oh, this horrible tragedy of how this person died. Right. Like, you could shape how you tell a story to make a particular point, to be reminiscent of other stories, to convey different things. And so that's part of what's going on here is that Samson's story is being told in a way that is trying to, as we've seen with so many times, where some story gets remixed or turned around or shifted slightly, or imagery gets reused in the Old Testament to kind of invert that story and sort of set the record straight, like correct the story. And in this case, you're taking a story which presented Heracles, who, remember, is half human, half divine. Right. Heracles is essentially a giant. Right. One of the mighty men of old, the men of renown, who was presented as this heroic figure. Right. And you're presenting them as a non heroic figure. Not to say again, Samson is Heracles, but to say, no, that kind of figure is not a heroic figure."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3039.84,"end":3040.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3041.04,"end":3042.75,"speaker":"Fr Stephen De Young","text":"Quite the opposite. Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3042.75,"end":3044.59,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Oh, spoilers for everybody."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3045.23,"end":3058.11,"speaker":"Fr Stephen De Young","text":"Quite the opposite. Yeah. Yeah. And this ironically. Ironically, right. A lot of us in Sunday school had Samson presented to us as Hercules."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3059.31,"end":3059.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3060.11,"end":3092.78,"speaker":"Fr Stephen De Young","text":"He's the Christian Hercules as Christian or Jewish Hercules. Right. Where they took the story and shaped it even more to be like the story of Hercules, including trying to make Samson a hero. So, yeah, yeah, we're not gonna be doing that this evening again, honestly. Sorry. Not sorry if you're triggered. So that brings us with this background Right. This brings us to Judges 13 in the story of Samson's birth."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3093.82,"end":3098.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So we know it's in the Dan area, but it's near a particular town."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3098.77,"end":3099.09,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3099.81,"end":3101.49,"speaker":"Fr Andrew Stephen Damick","text":"Named Beth Shemesh."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3101.73,"end":3113.41,"speaker":"Fr Stephen De Young","text":"Yeah. Beth Shemesh is how it's usually done in English. This is Beit Shemesh, which means either the house of Shemesh or Beit can also be used for a temple."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3114.53,"end":3115.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3115.13,"end":3118.41,"speaker":"Fr Stephen De Young","text":"So it could just be the temple of Shemesh, Shemesh being the pagan sun."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3118.41,"end":3121.81,"speaker":"Fr Andrew Stephen Damick","text":"God, just like Beth El Bethel, the house of God."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3122.13,"end":3122.53,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3122.85,"end":3125.54,"speaker":"Fr Andrew Stephen Damick","text":"Because God is in this place, as Jacob said."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3125.62,"end":3172.84,"speaker":"Fr Stephen De Young","text":"Right. So this is the house of the pagan sun God Shemesh, who we've talked about was a major figure the Babylonian pantheon, but also was a particular hypostasis of Shemesh was worshiped in Jerusalem before David took it. Right. Shemesh Tzedekah. Right. So that's also a troubling tip off. Right. So wait, Tribe of Dan living near a temple of a pagan God. And now, even though this is going to be this miraculous birth."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3173.8,"end":3175,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3175,"end":3221.26,"speaker":"Fr Stephen De Young","text":"Where this is an elderly barren couple. Right. We see this a lot in the Scriptures. Right. So this is a setup. You know, we're going to see elderly, barren couple. The angel of the Lord comes to them. See, the angel of the Lord episode says, you are going to have. You're going to have a son. And it's very specific. This is Yahweh. The God of Israel is going to give you this son, miraculously give you this son, even though you are an older barren couple. And when he's born, they name him Shemeshon. They name him after Shemesh, the pagan God."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3224.62,"end":3225.58,"speaker":"Fr Andrew Stephen Damick","text":"What are you thinking?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3226.3,"end":3226.78,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3228.22,"end":3241.21,"speaker":"Fr Andrew Stephen Damick","text":"I think for most of us, the name Shemesh doesn't have a big impact. But like, imagine, you know, imagine, you know, the archangel Gabriel and comes to the Virgin Mary and says, you're going to bear a son. And she. And she decides to name him Zeus."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3241.69,"end":3242.17,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3242.41,"end":3245.21,"speaker":"Fr Andrew Stephen Damick","text":"That's the kind of ridiculousness that this is."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3245.29,"end":3291.16,"speaker":"Fr Stephen De Young","text":"Yes, the cluelessness. Right. And even within the narrative in Judges 13, right. Where Manoah, Samson's father, is talking to the angel of the Lord. Manoah keeps trying to get the angel of Yahweh to tell him his name because he wants to worship both Yahweh and the angel of the Lord, like, as two independent beings. Right. And lest you say, based on our episode, well, if this is Christ. Right. Then. Well, sort of, you know, try to find some way around it. He explicitly says Benoah explicitly says in Judges 13, verse 8 that he thinks the angel of the Lord is a human."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3294.6,"end":3295.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3295.08,"end":3303.72,"speaker":"Fr Stephen De Young","text":"So he's trying to worship Yahweh, the God of Israel and the human who he thinks Yahweh sent as a prophet to tell him this."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3304.28,"end":3309.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he's like, he's some kind of God king kind of figure is how he treats him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3309.56,"end":3309.96,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3310.53,"end":3312.37,"speaker":"Fr Andrew Stephen Damick","text":"Also kind of a pagan thing to do."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3312.93,"end":3344.14,"speaker":"Fr Stephen De Young","text":"Right. Also notice the angel of Yahweh, the angel of the Lord here is presenting himself as a man. But part of this. And now that set up tells us, okay, parents are clueless. This probably isn't going to go well. This kid isn't going to get raised up in the fear of the Lord, shall we say? But what they're told is that God has commanded 13, verse 5 that he's going to be a Nazarite from birth, for life."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3344.86,"end":3348.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this one's set aside for these purposes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3348.78,"end":3352.14,"speaker":"Fr Stephen De Young","text":"Right. So he's going to be set aside as a holy person."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3352.78,"end":3359.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So remember the three vows everybody, because this is important. No wine or even anything grape like. Or grape related."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3359.74,"end":3360.78,"speaker":"Fr Stephen De Young","text":"Grape adjacent."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3360.86,"end":3381.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Nothing grape. Yeah, exactly. You gotta, you know, the hair is not to be cut during the period of the vow. And of course with Samson, that's gonna be the whole life. And no dead bodies. Don't go near any dead bodies. Don't even been in the same house as a dead body. No dead bodies. So these are the three key things for the Nazirite vow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3382.72,"end":3383.16,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3383.16,"end":3387.04,"speaker":"Fr Andrew Stephen Damick","text":"So does he do any, does he successfully live this way?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3387.36,"end":3399.08,"speaker":"Fr Stephen De Young","text":"And those are the specific rules, but also in general, Right. Remember, this is a holy set apart person. Right. He's basically Yahweh, the God of Israel, even though he's named after Shemesh."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3399.56,"end":3414.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, imagine, you know, God, you know, God comes to your parents and says, this one is going to become a monk or a nun from birth and that's going to be the life that they live. Like we have saints lives like this. There's a number of them like this."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3414.2,"end":3418.61,"speaker":"Fr Stephen De Young","text":"Like, like two books later. Samuel."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3419.17,"end":3420.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. Exactly."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3420.93,"end":3425.73,"speaker":"Fr Stephen De Young","text":"Yes. But there's a contrast, shall we say?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3425.97,"end":3426.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3428.93,"end":3429.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3429.29,"end":3430.61,"speaker":"Fr Andrew Stephen Damick","text":"So how does he do?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3432.85,"end":3449.13,"speaker":"Fr Stephen De Young","text":"Well, not great. So right off the jump, the first thing we see adult, young adult Samson doing is defying his parents to go marry a Philistine woman."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3449.45,"end":3456.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is not against the Nazarite vow, but is against the Torah in general. So it sets him up as a."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3456.09,"end":3459.05,"speaker":"Fr Stephen De Young","text":"And he's deliberately disobeying his parents."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3459.13,"end":3461.05,"speaker":"Fr Andrew Stephen Damick","text":"Disobeying his parents. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3461.21,"end":3472.25,"speaker":"Fr Stephen De Young","text":"Right. To go and do this and not really acting holy and set apart, shall we say? So he goes, he marries this woman. He then leaves."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3473.43,"end":3473.67,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3475.99,"end":3487.11,"speaker":"Fr Stephen De Young","text":"The text literally says that later on he comes back and decides he want. Like after a long time he comes back and says he wants to sleep with her."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3489.19,"end":3489.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3490.47,"end":3498.35,"speaker":"Fr Stephen De Young","text":"And her father says, man, you took off. I thought you hated her. I thought you didn't want her. So I married her off to somebody else."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3498.35,"end":3499.11,"speaker":"Fr Andrew Stephen Damick","text":"Somebody else."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3499.35,"end":3504.84,"speaker":"Fr Stephen De Young","text":"Right. And then, you know, Samson gets mad and takes revenge."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3506.76,"end":3509.56,"speaker":"Fr Andrew Stephen Damick","text":"As any good Nazirite would do. Right? Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3510.04,"end":3535.62,"speaker":"Fr Stephen De Young","text":"And so we also then have this episode of him tearing the lion in half. Right. We could argue whether actually killing an animal constitutes coming into contacts with the corpse. Contact with a corpse, because he's making a corpse. Right. But what you can't argue with is that then on the way back he finds the corps of said lion and eats honey out of it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3538.34,"end":3542.86,"speaker":"Fr Andrew Stephen Damick","text":"Which I think everybody finds a little charming because the whole riddle that he does later. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3542.86,"end":3543.3,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3543.54,"end":3550.26,"speaker":"Fr Andrew Stephen Damick","text":"But still no corpses. This is one of the three things you vow. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3550.34,"end":3561.36,"speaker":"Fr Stephen De Young","text":"There is no one listening to this program right now who if they were on Fear Factor and they had to eat honey out of a three day old lion carcass, would be able to do it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3561.92,"end":3562.88,"speaker":"Fr Andrew Stephen Damick","text":"Tough but fair."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3566.32,"end":3595.75,"speaker":"Fr Stephen De Young","text":"But so that's. There's one vow broken. Right. Hanging around a corpse, eating out of a corpse. Right. And then of course he's going to pick up the jawbone of a donkey and kill a bunch of people with it. There's another corpse, right? Yeah. So then, you know, after having abandoned his wife in that whole episode, he goes and he sleeps with a prostitute and then any good Nazarite would. Right, yes. And then goes and starts sleeping with Delilah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3596.39,"end":3596.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3597.75,"end":3613.92,"speaker":"Fr Stephen De Young","text":"And the reason we're pointing to the sexual set again is not because it's explicitly non Nazarite, but we're going to see. This is going to become important later. Literally, this is going to become important later. Samson's bad example sexually. It's gonna become important later in the history of Christian monasticism."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3615.04,"end":3618,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So just hold on to that thought, everybody."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3618.48,"end":3624.08,"speaker":"Fr Stephen De Young","text":"He goes, he gets drunk at a wedding feast. Right. So there goes the wine thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3624.48,"end":3625.04,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3626,"end":3642.54,"speaker":"Fr Stephen De Young","text":"And so then finally when he loses his strength, when he gets taken as a slave, when he gets his eyes gouged out and all this, it's when he lets, you know, lets on about his hair getting cut and his hair gets cut. Why then? Because he's now broken all the vows."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3642.54,"end":3648.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not that there's some kind of magical strength in the hair, despite what he may have said to people, Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3648.94,"end":3649.34,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3649.58,"end":3658.06,"speaker":"Fr Andrew Stephen Damick","text":"Like, you. Like, why do you believe this guy? Why would you believe what he says to, you know, to her, to Delilah? You know, like."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3658.06,"end":3658.86,"speaker":"Fr Stephen De Young","text":"That's right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3659.18,"end":3659.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3659.9,"end":3663.42,"speaker":"Fr Stephen De Young","text":"It's that. That's breaking his fight now. He's broken all the vows."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3664.71,"end":3665.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3665.07,"end":3699.31,"speaker":"Fr Stephen De Young","text":"Right. So what's. The last? Vow's broken. He loses his. Loses his strength. Taken prisoner, eyes gouged out. And so then we have this final scene where he's brought into this party in the temple and he's. Which is probably not just like, hey, let's throw a party. This is a pagan feast, right? Meaning there's sexual activity going on. There's drunkenness going on. All this is going on. He gets between the two pillars and does not repent. If you don't believe me, go read what he says."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3700.43,"end":3710.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't say, I'm sorry, God, or I have sinned in your sight, or any of the kind of I'm repenting kind of language you get in the Bible, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3710.27,"end":3716.99,"speaker":"Fr Stephen De Young","text":"He says, God, give me my strength back one last time so I can get revenge for my eyes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3718.82,"end":3741.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which God does give him strength, Right. But that doesn't mean that he's a repentant guy. And like, there's even the line at one point where it says the Holy Spirit rushed upon him, which is not the same language as being filled with the Holy Spirit. This is, you know, what we call Holy Spirit possession, where God just kind of takes control of somebody and do something, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3742.18,"end":3754.96,"speaker":"Fr Stephen De Young","text":"And so his last words are, let me die with the philistines. The judges, 1630. So he literally uses this last burst of strength for murder suicide, like any."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3754.96,"end":3756.16,"speaker":"Fr Andrew Stephen Damick","text":"Good Nazarite would do."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3756.88,"end":3791.37,"speaker":"Fr Stephen De Young","text":"So what happens over the course of the Book of Judges is that the Judges getting. So it's not just on one level. There's this cycle, right? Israel falls into sin. God brings usually a foreign oppressor, right, to come and oppress Israel. Israel cries out to God, says, we repent. We'll do better. Deliver us. God raises up a judge to set things right. Rinse and repeat, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3791.77,"end":3800.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, Samson gets used by God to set things right, but in spite of himself a lot."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3801.46,"end":3824.34,"speaker":"Fr Stephen De Young","text":"But it's not just a cycle. It's a downward spiral. The judges get increasingly worse. They get increasingly more shifty, Right. The first couple, Othniel, Shamgar are presented as being fine, right? Just men of God with no issues, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3824.34,"end":3826.89,"speaker":"Fr Andrew Stephen Damick","text":"Not a lot of people naming their kids Shamgar noticed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3826.89,"end":3838.69,"speaker":"Fr Stephen De Young","text":"No, no. And if you did. Right. It would be one of those situations where it's like, oh, well, you're Shamgar B and you're Shamgar D. Right. In their kindergarten class. Right. You're the only Shamgar."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3838.77,"end":3839.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3839.09,"end":3850.77,"speaker":"Fr Stephen De Young","text":"They're gonna have to hear some jokes. Shamwow. Right. Some stuff like that. But that's gonna happen anyway. Kids will find something to make fun of your kid about. Just name them Shamgar. Go ahead and."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3855.02,"end":3855.26,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3857.26,"end":3889.36,"speaker":"Fr Stephen De Young","text":"The time you get to Gideon, Gideon is a fairly shifty character. Right. There are these different things. Like, there's the whole episode, which I think you need to know a little bit of Hebrew to understand what's going on. Because they come and they keep accusing him of trying to make himself the king of Israel. And he keeps saying, no, no, I'm not doing that. Why would you say that? That's ridiculous. What do you mean? I'm trying to make myself the king of Israel. And then it mentions his son Abimelech. And Avimelech in Hebrew means my father is king."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3889.84,"end":3893.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Right. Yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3893.44,"end":3897.2,"speaker":"Fr Stephen De Young","text":"Yes. So Gideon keeps doing sort of shifty stuff like that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3897.52,"end":3897.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3898.4,"end":3934.06,"speaker":"Fr Stephen De Young","text":"So you're going, okay, well, not an ideal dude, but. Right. He got the job done with the Midianites. Right. Forgot. Right. Had his issues, but. Right. And then, you know, you have the whole thing with the ephod that becomes a snare for his. Right. So not great. By the time you get to the last judge in the book of judges here, the last individual judge of Samson, things have gotten really bad. Right. Because Judges is an extended case for why Israel needs in particular, the Davidic monarchy."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3935.01,"end":3941.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because, I mean, there's all these references to the time of the judges being the time when everyone did what was right in his own. And there was no king in Israel."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3941.61,"end":3941.97,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3942.05,"end":3943.73,"speaker":"Fr Andrew Stephen Damick","text":"And there was no king in Israel."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3944.05,"end":3983.72,"speaker":"Fr Stephen De Young","text":"Just in case you were thinking Saul was the guy. Right. The Benjamites get put through the wringer in the last couple chapters. Right. It's Judah. Judah is the one we need, David. Right. So, yeah. So Samson is here at the bottom of this. Right. So the theme of this story is that even when you have someone like Samson from a tribe like Dan, God will still deliver his people sort of in spite of themselves. Right. That's the theme here. So now, as I mentioned, there are probably triggered people out there. Our phone lines may be filling up."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":3984.84,"end":4010.35,"speaker":"Fr Andrew Stephen Damick","text":"I know there are. There are, in fact, people whose refer. I mean, I'm not making this up. There are, in fact, people who Refer to him as Saint Samson. And we should say, there are Saint Samson. There's two. There's Saint Samson the Hospitable and there's Saint Samson of Dole D o L. Those are both saints that are named Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4010.99,"end":4011.43,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4011.43,"end":4014.51,"speaker":"Fr Andrew Stephen Damick","text":"But this guy is not one of them."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4014.51,"end":4014.87,"speaker":"Fr Stephen De Young","text":"Not."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4014.87,"end":4020.68,"speaker":"Fr Andrew Stephen Damick","text":"And we're going to explain to you exactly why that's the case. Now, if the. For if the. What we just talked about wasn't enough."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4021,"end":4026.28,"speaker":"Fr Stephen De Young","text":"So if just reading the story of Samson in the Bible isn't enough for you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4026.44,"end":4027,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4027.24,"end":4032.56,"speaker":"Fr Stephen De Young","text":"Because you think the Bible's a magic riddle box no one can interpret where."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4032.56,"end":4035.24,"speaker":"Fr Andrew Stephen Damick","text":"It literally does not say a single good thing that he ever did."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4035.24,"end":4035.72,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4037.16,"end":4037.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4039.8,"end":4078.1,"speaker":"Fr Stephen De Young","text":"Right. So there's only one other place in the Bible where Samson gets sort of explicitly mentioned, and that, of course, is in Hebrews 11. Right. So I know some of the folks out there who are starting to get upset about me saying negative things about Samson are going to run there and say, well, look here, St. Paul in Hebrews says, well, time fails to speak of big long list of people on which Samson occurs. Right, right. When he's talking about faith. Right. There's some basic problems with this. Right. The most obvious being we don't know what St. Paul actually would have said."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4078.42,"end":4083.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he just says, I don't have time to talk about this big list of people. Yeah, that's all it says in verse 32."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4084.02,"end":4091.54,"speaker":"Fr Stephen De Young","text":"Right. He's kind of working his way through the Bible. Right. And he just names like the next. He goes through, like the people of the Book of Judges in order."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4092.98,"end":4106.86,"speaker":"Fr Andrew Stephen Damick","text":"And then he mentions Daniel, David and Samuel and the prophets and then says, you know, who through faith conquered kingdoms before justice obtained promises stop the mouths of lions. It said all these good things, but like, none of the good things that are mentioned in there actually apply to Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4107.42,"end":4130.2,"speaker":"Fr Stephen De Young","text":"Right, Right. You know, and so you can't assume that. Right. Samson was not saw in two. Right. So and if you look at some of the other people on the list, Right. So for example, he mentions Barak. Well, if you've read the Book of Judges, you know that what happens with Barak is Barak is chosen to be the judge of Israel, but is kind of a wimp."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4131.72,"end":4132.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4132.44,"end":4157.49,"speaker":"Fr Stephen De Young","text":"And doesn't go through it. And so God raises up Deborah the prophetess, Right. And jail another woman to sort of do the job. Right. And the whole idea here is the fact that God raised up these women to do it is supposed to shame Barak for being a man and not doing what he was supposed to do."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4159.25,"end":4159.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4159.61,"end":4166.05,"speaker":"Fr Stephen De Young","text":"God Sends a woman to do a man's job. Right. And they do it better than Barak did. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4166.05,"end":4172.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one of the other people in the list, Jephthah, it seems very likely sacrificed his actual daughter."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4172.93,"end":4182.79,"speaker":"Fr Stephen De Young","text":"Right. And so when you look at the history of Jewish and Christian interpretation of the story of Barak, they tend to praise Deborah. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4182.79,"end":4183.55,"speaker":"Fr Andrew Stephen Damick","text":"Not Barak."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4183.95,"end":4195.31,"speaker":"Fr Stephen De Young","text":"And Jael. Not Barak. And when you look at the history of Jewish and Christian interpretation of the story of Jephthah, they tend to praise his daughter who he sacrificed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4195.47,"end":4196.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4197.23,"end":4209.96,"speaker":"Fr Stephen De Young","text":"And see his daughter who obediently went to her death as a type of Christ. Right. As sort of a martyr figure. Right. Depending on who. Whether you're looking at Jewish and Christian interpretation."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4210.28,"end":4210.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4211.32,"end":4217.64,"speaker":"Fr Stephen De Young","text":"So it's entirely likely that if St. Paul, for example, had talked about Barak, he probably would have done the same thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4219,"end":4219.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4219.72,"end":4232.36,"speaker":"Fr Stephen De Young","text":"And the same with Jephthah. Right. Because one of the things you find when you compare how St. Paul reads the scripture to Second Temple Jewish and early rabbinic interpretations of scripture, they line up pretty well."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4233.09,"end":4233.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4233.57,"end":4261.73,"speaker":"Fr Stephen De Young","text":"Weirdly enough, you could find where he's getting this stuff. Right. So he's really not going out on a limb on any of these things. Right. This is. He's interpreting the Scriptures correctly. Right. As we should expect from St. Paul. So we can't jump from a conclusion to this. That. That he would have. That he found something somehow in Judges to say in praise of Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4262.38,"end":4266.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what do we know about what early Christian writers said about."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4268.46,"end":4280.54,"speaker":"Fr Stephen De Young","text":"So the first person at the end of the second century who talks about Samson in any kind of detail is Saint Hippolytus of Rome."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4281.1,"end":4281.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4282.14,"end":4292.62,"speaker":"Fr Stephen De Young","text":"And Saint Hippolytus, and we'll explain what he means, but to put a fine point on it, says that Samson is the forerunner of the Antichrist."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4294.09,"end":4297.85,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go. Not really a great title."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4298.25,"end":4379.02,"speaker":"Fr Stephen De Young","text":"Yeah. Not one you want. So the place where Saint Hippolytus discusses this is he's dealing with the tribe of Dan in general, because Saint Hippolytus argues that the things we were just talking about with Dan, and especially Dan's exclusion from the book of Revelation and the list of the 12 tribes, that he interprets this as prophetic and pointing to the fact that the Antichrist will come from the tribe of Dan. And so in that context, he goes back to Genesis 49 and the prophecy that we read in the Testament of Jacob about Dan, that Dan will judge Israel and describing him. Right. As the serpent, as the viper. Right. And says this is a prophecy. He parallels it with the prophecy given to Judah. The prophecy of Judah is about them. Given to Judah is about the Messiah. The prophecy given about Dan is about the Antichrist. Right. The Anti. Messiah. Right. And so he says in that context, some people say that this bit about Dan judging Israel. Right. That part. And then the subsequent part about the viper and the snake, that. That's talking about Samson. I mean, we could take a timeout right there."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4379.82,"end":4380.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4381.82,"end":4413.59,"speaker":"Fr Stephen De Young","text":"They interpret that about Dan as referring to Samson. Okay. So Saint Hippolytus, it does not enter into his head that anyone would have a positive perception of Samson. Right, right. So he says, some people say that Samson. He says he disagrees. Right. He says that's ultimately a prophecy of the Antichrist, but he says Samson partially fulfills it because Samson is the forerunner of the Antichrist."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4414.23,"end":4420.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he's not the Antichrist. But if you're wondering what the Antichrist looks like, it looks like this guy."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4420.79,"end":4466.98,"speaker":"Fr Stephen De Young","text":"Right. And he makes this comparison. That use of the term foreign forerunner is also deliberate because he's making a contrast between St. John the Forerunner, St. John the Baptist and Samson. Says, we're going to see in the second half, we're going to talk about Nazarites in the New Testament, and probably the most prominent one of those is St. John the Forerunner. So he makes this comparison between Samson and St. John the Forerunner. St. John the Forerunner is the forerunner of Christ. He's saying Samson is the forerunner of Antichrist. Right. These two Nazarites, one who keeps all his vows, one who breaks all his vows. Right. So that's Saint Hippolytus."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4467.14,"end":4470.18,"speaker":"Fr Andrew Stephen Damick","text":"I was saying. What else is there, Uncle? Father Stephen. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4472.34,"end":4503.91,"speaker":"Fr Stephen De Young","text":"So next we could turn to St. Ephrem the Syrian, who at one point in his Hymns on Paradise is describing the contents of hell. And in one of the verses describing the contents of hell, he lists the dead bodies of the Nephilim, Goliath, Samson and OG."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4506.39,"end":4511.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Also not a very sanctified kind of depiction."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4512.7,"end":4516.22,"speaker":"Fr Stephen De Young","text":"So Saint Ephrem the Syrian at least, doesn't think Samson's a saint."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4516.46,"end":4521.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, literally, his body is there with a series of beings that are all giants."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4521.26,"end":4537.48,"speaker":"Fr Stephen De Young","text":"They're all giants. Yeah. That's where St. Ephrem categorizes him. So in the past when I've talked about Samson and people have gotten mad."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4538.6,"end":4539,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4540.6,"end":4699.9,"speaker":"Fr Stephen De Young","text":"There are a couple of things they've tried to counter all of this with. Right now, you'd think already we've got everything Scripture says. We've got Saint Hippolytus, we've got Saint Ephrem the Syrian. Right. Not a lot of other church fathers even talk about Samson. Right. The only one who really goes through his life in detail in terms of preaching that we still have is St. Ambrose. And St. Ambrose, it's all a cautionary tale. It's all, hey, don't go running after women, young men, Right. Like, don't do what Samson did. Right. So you'd think that would represent. You'd be able to say, oh, yeah, tradition says, Samson, not a great guy. But some people love that Sunday school Samson experience, so. And are willing to try and fight for it with anything they have. So the best anybody's done so far, you know, at me, whatever is. So there's. There's this quote from St. John Chrysostom where he's talking about Hebrews. He's talking about that verse in Hebrews where Samson's name is mentioned. And what he says is, basically, some people have faulted Paul for including people like Jephthah and Samson on this list. So again, right off the bat, right off the bat, before we go any further, right, St. John Chrysostom here acknowledging at the end of the fourth, the beginning of the fifth century that pretty much everybody thinks Samson and Jephthah for that matter, are shady characters who should not be held up as role models. Yeah, right. Everyone thinks that. So how does St. John Chrysostom defend St. Paul? Mentioning him here, this verse of Hebrews, he says, well, listen, don't talk to me about their lives. He literally is literally saying, St. Paul is not holding up their lives for emulation. St. Paul is not saying you should be like Samson. Right. He says all St. Paul is doing is that would have done if he'd kept talking about it, is use Samson in some way as an example of faith. Yeah. Or something having to do with his story. And we don't know what."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4700.38,"end":4727.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The other example that people give is that on the Sunday of the forefathers, which is two Sundays before Christmas, there are two hymns that show up in matins, which basically take that list from Hebrews, although sometimes they'll add some other names to it. And in front of that list, you see the phrase, let us laud."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4728.75,"end":4729.11,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4729.11,"end":4746.43,"speaker":"Fr Andrew Stephen Damick","text":"You know, let us praise. And nothing in particular is said about them. It's just let us laud. Right? So, and I mean, I did a pretty thorough look like, when is Samson actually mentioned in church hymns?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4746.67,"end":4747.07,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4747.95,"end":4762.8,"speaker":"Fr Andrew Stephen Damick","text":"And this is it. This is literally it, the Sunday of the forefathers, which is kind of like. So the Sunday, the Forefathers and the Sunday of the genealogy, but especially the forefathers. It's just talking about lots and lots of people from the Old Testament. If you actually read through the hymn."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4762.8,"end":4764.48,"speaker":"Fr Stephen De Young","text":"Long lists. Lots of lists."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4764.48,"end":4887.77,"speaker":"Fr Andrew Stephen Damick","text":"It's lots of long. Yeah, a lot of long lists of names. So you've got these two hymns that say let us laud. Right. So, I mean, let's take that and just read that in the most glowing way possible, that there's two hymns that say, let us lauder a bunch of people, and then Samson's included in that list. Okay. What's interesting about that particular feast day is part of the feast day includes a very long synaxotion. So synaxarion is a list of the saints that are celebrated on that day. You know, on this day we commemorate sins, so and so on this way, we commemorate so and so. If you could read the whole synixonian. It takes. Will take a while. Most of them. It may be a dozen or so names in this one. It goes on for pages. And, you know, the man's big, big pages. It's a big, big book, like a physically very large book. And Samson is not in that list. He's not like almost everybody else. But not Samson and not Jeff, by the way. He's not there either. I looked it up, and even then, you know, what it says is on this day we commemorate, which doesn't necessarily mean that we recognize this person as a holy person. But in any event, he's not even listed in that way. There's no on this day we commemorate Samson. And in fact, he's not on any of the synaxatia for the whole year. Right. Which. That's basically the big list of saints. Now, you could say, well, Father Andrew, maybe he didn't make it into a synag Saudi. And, you know, not all the saints do. Okay, okay, well, what are some other things that we see that would indicate someone's a saint and that the church actually treats them as a saint? Right. Well, there might be icons. There is no St. Samson icon. There are religious paintings of Samson for sure, but there are no orthodox icons of Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4888.33,"end":4889.05,"speaker":"Fr Stephen De Young","text":"Oh, what about."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4889.05,"end":4945.44,"speaker":"Fr Andrew Stephen Damick","text":"Is there a church is named after him, you know, St. Samson Orthodox Church? Once again, no church is named after him. Is he the patron saint of something or someone or some place or. No, he is not the patron saint of anything. And when is his feast day? He does not have a feast day. So, like, all the things that you would look for to indicate, you know. Yeah. Or, you know, what about his hagiography. What is his hagiography? Where's his saint's life? What we got is what's in the Book of Judges, and it sure doesn't look good. You know, that's so like, literally none of the markers of someone being a saint being treated as a saint by the church, like, none of them are there. And I searched this pretty thoroughly because I was like, okay, I want to make sure I really have this down. So, yeah, I mean, don't. You don't have to trust me though, people. Go have a look for yourself. Look at all those sources I just mentioned."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":4945.68,"end":5060.91,"speaker":"Fr Stephen De Young","text":"And so this is not even a case of like, you know, some folks, especially folks who come into the Orthodox Church from a Protestant background, especially from certain types of evangelical Protestant backgrounds, have a tendency to start proof texting saints and things. Right. And liturgics, the way maybe they used to proof text the Bible. And to be. To be fair, I had an old professor who used to say, there's nothing wrong with proof texts as long as the text actually proves what you're claiming it does. Which is rarely the case. But this is a case where it's not. Even when you. When you delve into the Orthodox tradition to try to understand some issue, which is how we as Orthodox Christians should approach issues. Right. You delve deeper into the tradition. You don't just start theorizing and constructing something for yourself. There are some issues that get really complex because there are some places where it seems like, for example, different church fathers seem at least to be saying opposite things or at least things that don't fit together. And sometimes it's not just there's like two camps. Sometimes it's like there's four or five different views expressed in different places. Right. You have places where a single church father seems to contradict themselves sometimes. Right. And that creates this thorny issue where you have to figure out how to try to reconcile this and understand what the tradition is really saying. Right. And really teaching. This is not one of those issues. Yeah, right. This is. On one side you have the Scriptures, the Fathers, Right. Like, and then on the other side, you have a Mattens hymn at best."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5060.91,"end":5066.51,"speaker":"Fr Andrew Stephen Damick","text":"Like, even if we just completely agree that those couple of hymns are saying, he's a holy man."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5066.75,"end":5068.63,"speaker":"Fr Stephen De Young","text":"Yeah, at best. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5068.63,"end":5071.31,"speaker":"Fr Andrew Stephen Damick","text":"But they don't even say what's good about him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5071.79,"end":5085.26,"speaker":"Fr Stephen De Young","text":"And in that case. Right. In that case, taking the approach that, well, we have to find another way to read the Bible against the grain, another way to read all the church fathers who talk about against the grain another way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5085.26,"end":5085.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5085.58,"end":5123.95,"speaker":"Fr Stephen De Young","text":"All the way across the board. We have to figure out how to reinterpret all that so that it fits with this one line in a Matins hymn. Or maybe going out on a limb here, maybe we need to reconsider how we interpret that one line of the Matins him to make it fit with everything else. That's crazy. Yes. Call me crazy. Call me crazy, but. Right. And the reason I'm doing this is not just that I like ruining Sunday school. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5124.11,"end":5125.15,"speaker":"Fr Andrew Stephen Damick","text":"Although you kind of do."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5125.23,"end":5131.56,"speaker":"Fr Stephen De Young","text":"I kind of do. I'm not saying I don't. But that's not really why we're doing this tonight."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5132.28,"end":5132.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5132.64,"end":5165.63,"speaker":"Fr Stephen De Young","text":"Because I've talked about Samson before. This is the first time we've had an extended discussion of Samson on Lord of Spirits. The reason we're doing it tonight is as we're going to see as we get into the second and third halves. If you don't understand what's happening with the interpretation of the story of Samson, you're not going to get what's going on in the very early history like New Testament and immediately post New Testament history of what becomes Christian monasticism. You're not going to get it if you don't get Samson. If you're clinging to the Sunday school version."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5165.79,"end":5177.07,"speaker":"Fr Andrew Stephen Damick","text":"There we go. All right. Well, with Samson's body safely in Hades along with the dead Nephilim, we're going to take our first break and we'll be right back with the next part of the Lord of Spirits."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5177.23,"end":5193.56,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord, Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5197.72,"end":5256.11,"speaker":"Fr Stephen De Young","text":"Ancient Faith Radio is brought to you by our listeners with help from Faith Tree Resources. Are you anxious to grow in your faith but struggle to carve out time for spiritual disciplines like prayer or reading holy Scripture? You're not alone. That's why faithtree Resources created the Encounter App. This completely free app for your iPhone or Android device is designed to make the daily habit of prayer attainable for everyone, no matter how full your schedule is. The app also includes daily scripture readings that allow you to listen to the passages being read aloud. So whether you've got a long commute to work or have your hands full with kids, the Encounter App makes it easy to get into a daily rhythm of prayer and reflection. Join the thousands of Orthodox Christians around the world who gather Daily to pray for the church as the church. Download the free Encounter app today@faithtree.org that's faithtree.org we're back now with the Lord."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5256.11,"end":5270.6,"speaker":"Announcer","text":"Of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5271.72,"end":5332.69,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. It's the second half of the show. Thank you very much, Voice of Steve. You know, in the past week and a half, I've actually seen the face of Steve twice, and I'm gonna see him again tomorrow. It's pretty crazy. Sometimes when I see him in person, which isn't super often, I asked him to do some of these lines just to kind of. I don't know, it just feels very homey, you know? You know what I'm saying, Father? I'm guessing he's not. Yeah. Okay. There he is. Yes. Yes. Yeah. So, okay, Samson, you know what not to do, but are there Nazarites? Yeah, there's Nazarites in the Bible, right? And in the New Testament. Excuse me. Of course they're in the Bible in the New Testament as well. So, yeah, I mean, people not cutting their hair, not drinking the drink, not close with the dead bodies, not hanging."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5332.69,"end":5333.61,"speaker":"Fr Stephen De Young","text":"Out with dead souls."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5333.61,"end":5335.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5335.93,"end":5339.69,"speaker":"Fr Stephen De Young","text":"So I mean, here's the question. Could a Nazirite go to Hot Topic?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5342.49,"end":5344.01,"speaker":"Fr Andrew Stephen Damick","text":"Should a Nazarite go to."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5344.49,"end":5348.85,"speaker":"Fr Stephen De Young","text":"We need a ruling. Does he have to start the vow over if he enters a Hot Topic?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5348.85,"end":5351.77,"speaker":"Fr Andrew Stephen Damick","text":"Are they dead souls? Yeah, it's an interesting question."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5351.77,"end":5442.31,"speaker":"Fr Stephen De Young","text":"If you're a rabbi listening to this, call in and answer that question for us. Give us a ruler. Oh, man, I hope that happens. That would be amazing. So in the New Testament, right? This isn't something that gets jettisoned. We've talked before how there's almost nothing actually from the Old Testament that really fits that category of being jettisoned. But things get transformed, right? They get fulfilled. They get embodied in ways. This is going somewhere. They get embodied in ways that transform them. And so the figure who's going to kind of embody the Nazarite tradition from the Torah in the New Testament in a transformative way, in a fulfilling way, is St. John the Forerunner, St. John the Baptist, who we already mentioned, and we mentioned the contrast between he and Samson that Saint Hippolytus makes. But Hippolytus, again, is not just reaching up and pulling this out of the air. This isn't a peculiarity. Let me just say, since I realized It. In the spirit of self criticism, I just reached my hand into the air and made a motion of grabbing something out of the air."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5445.19,"end":5448.07,"speaker":"Fr Andrew Stephen Damick","text":"Are you one of those people that gestures when you're on the phone with somebody?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5448.31,"end":5448.79,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5449.19,"end":5449.91,"speaker":"Fr Andrew Stephen Damick","text":"You do that?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5450.23,"end":5453.44,"speaker":"Fr Stephen De Young","text":"Yes. Anyway, back to what I was saying."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5453.44,"end":5455.28,"speaker":"Fr Andrew Stephen Damick","text":"You point, look over, wait."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5456.56,"end":5500.49,"speaker":"Fr Stephen De Young","text":"Saint Hippolytus does not. Despite my lonely gesticulations, Saint Hippolytus does not just pull this out of the air. And it's not just a peculiarity of how he interprets Genesis 49. Right. And making a parallel between the prophecy to Judah and the one to Dan. This is also something he's getting from the New Testament. Right. Because when you. When you read, for example, Luke 1, verses 13 through 17, that part of the story of the prediction of St. John the Forerunner's birth, St. Luke is very clearly drawing some deliberate parallels with the story of the announcement of Samson's birth in the Book of Judges."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5500.65,"end":5554.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I'm going to read these verses and people can. You'll hear it now, given everything we just said about Nazarites in the previous half, starting with verse 13. But the angel said to him, do not be afraid, Zechariah, for your prayer has been heard. And your wife Elizabeth will bear you a son, and you shall call his name John, and you will have joy and gladness. And many will rejoice at his birth, for he will be great before the Lord, and he must not drink wine or strong drink. And he will be filled with the Holy Spirit even from his mother's womb. And he will turn many of the children of Israel to the Lord their God. And he will go before him in the spirit and power of Elijah, and to turn the hearts of the fathers to the children and the disobedient to the wisdom of the just to make ready for the Lord a people prepared. I mean, this is like what a judge should have, really should have been in every way, you know, Right. He's setting things up, putting things in right order."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5554.76,"end":5587.31,"speaker":"Fr Stephen De Young","text":"Right. And notice in terms of that fulfillment, we get the verb used there in that he will be filled from the Holy Spirit, even from his mother's womb. And we find out in St. Luke's gospel that he means that very literally, Right. Because he leaps in the womb when the Theotokos enters with Christ in her room. But so again, compare this to the kind of Holy Spirit possession that you see in the story of Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5587.79,"end":5588.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5589.32,"end":5599.08,"speaker":"Fr Stephen De Young","text":"Where the Holy Spirit kind of comes and seizes him to do God's will. But in general, he is not compared to the Holy Spirit coming in and dwelling. St. John the Forerunner. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5599.08,"end":5610.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, there's a line in, like. I mean, there's multiple points. Yeah, multiple points. I'm looking at this now in the Samson story where it says that the spirit of the Lord rushed upon him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5610.36,"end":5611.08,"speaker":"Fr Stephen De Young","text":"Rushed upon."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5611.08,"end":5614.52,"speaker":"Fr Andrew Stephen Damick","text":"I mean, over and over again, three different times, it rushed upon him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5615.39,"end":5625.55,"speaker":"Fr Stephen De Young","text":"Yeah. So this is. This is God grabbing him and doing what he wants to do. It's almost like Samson is a puppet. Like. So Samson is not getting credit for it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5626.59,"end":5627.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5627.39,"end":5671.7,"speaker":"Fr Stephen De Young","text":"Right. He's not even. It's. He's not even that rushed upon. Right. He's not even presented as cooperating, per se. Right. And of course, an obvious contrast, as George mentioned, St. John keeps his vows. Right. And it's even commented upon. Right. Christ comments on it when he's talking about the difference in way of life between himself and St. John. You could check out Matthew 11, 9, where he says, John came neither eating nor drinking. Right. Whereas Christ came eating and drinking. And so they call him a drunkard and a glutton. Right. So this isn't just talking about drinking water."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5672.82,"end":5673.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5673.54,"end":5693.86,"speaker":"Fr Stephen De Young","text":"This is talking about that part of the vow. Right. But in terms of that fulfillment and in terms of his embodiment of the Nazarite tradition and how that tradition gets sort of advanced and transformed in the figure of St. John the Forerunner."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5694.58,"end":5694.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5695.3,"end":5752.15,"speaker":"Fr Stephen De Young","text":"We see him incorporate. And that's already in that prophecy about his birth, incorporating these elements from the prophet Elijah, from St. Elias. And you could go back to our episode, make straight the paths for our God where we're talking about St. John the Forerunner, we get more into that, the relationship between him and the prophet Elijah and St. Elias. But he incorporates those things within his life, within his person. Right. And so that is going to. That idea of the life of the wilderness. Right. Being sort of physically set apart in that way. Some of the other elements of asceticism, and especially. It needs to be noted. And we'll be developing this a little more. This idea of chastity. Yeah, right. Which is this major point of contrast between St. John the Forerunner and Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5752.54,"end":5755.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So we actually have a couple people who've called in."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5755.5,"end":5756.06,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5756.54,"end":5756.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5756.98,"end":5758.54,"speaker":"Fr Stephen De Young","text":"To argue with us about Samson."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5758.7,"end":5759.38,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5759.38,"end":5761.18,"speaker":"Fr Stephen De Young","text":"We'll find out. Okay, we'll find out."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5761.26,"end":5771.82,"speaker":"Fr Andrew Stephen Damick","text":"So first we've got Mark, who is calling from Wisconsin. And Mark wants to talk about Samson's famous murder slash suicide. So, Mark, are you there?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5771.82,"end":5772.7,"speaker":"Fr Stephen De Young","text":"Are you triggered, Mark?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5773.18,"end":5775.34,"speaker":"Mark","text":"Yeah. No, I'm not triggered."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5775.5,"end":5776.06,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5776.54,"end":5778.78,"speaker":"Mark","text":"But I got my gun just in case I am triggered."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5778.78,"end":5782.26,"speaker":"Fr Stephen De Young","text":"Okay, you can't shoot people through the phone, Mark."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5783.06,"end":5821.03,"speaker":"Mark","text":"Okay, I won't do it. Just here, here's my take on that. And then you tell me if I'm way off base or maybe clarify it. So Samson, the bad dude that he is, asked God to give him strength to pull down the pillars. So then Samson has faith that God will grant it. So God gives him what he wants. Therefore he doesn't compromise his free will or free choice, even though it turns out bad for Samson. And that's the consequences of man's free will and choice. Did I get that right, or do you need to clarify that better?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5823.59,"end":5824.47,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5825.27,"end":5826.47,"speaker":"Fr Andrew Stephen Damick","text":"Go ahead, Father. Yeah, go ahead."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5826.63,"end":5831.51,"speaker":"Fr Stephen De Young","text":"I was just gonna say I don't know that faith necessarily enters into it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5832.72,"end":5834.6,"speaker":"Mark","text":"Okay, all right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5834.6,"end":5840.08,"speaker":"Fr Stephen De Young","text":"In that what he literally says is, give me my strength back one time so I can get revenge for my eyes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5841.76,"end":5850.88,"speaker":"Mark","text":"Okay? So, right. I interpreted that as Samson had faith that God would grant him his wish, even though it was for evil."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5852.64,"end":5883.32,"speaker":"Fr Stephen De Young","text":"Well, I mean. I mean, it's hard to psychologize Samson, right? But I would just point that his purpose was not, you know, I mean, he could have prayed a very different prayer. He could have prayed and said, you know, I've broken all my vows, right? I haven't been faithful. Give me my strength back so that I can redeem Israel from these Philistines, okay? And do your will with my last act. Right? Like, he could have said that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5883.96,"end":5885.39,"speaker":"Mark","text":"Yep, yep, yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5885.39,"end":5898.79,"speaker":"Fr Stephen De Young","text":"But his goal was not to kill the Philistines because that's what God had led him to do or directed him to do. It was to get personal revenge for what they did to him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5900.15,"end":5903.91,"speaker":"Mark","text":"Right? And then God granted him that strength to do that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5904.23,"end":5917.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because it serves God's purposes, right? Just like. Just like, you know, as we've seen with this concept of the left hand of God, where demons do their will and God permits them to do it because it serves God's purposes, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5917.96,"end":5933.28,"speaker":"Mark","text":"Like, even, like, if I take that and personalize it, sometimes I'll do stupid things because of my free will and free choice. And God allows that. He doesn't say, no, no, you're not going to do that. I'm not going to let you do that. He goes, you're going to do it, and hopefully you'll learn from it and repent."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5934.16,"end":5943.89,"speaker":"Fr Stephen De Young","text":"Right? And God could bring good out of it. I mean, like the story of Joseph, right? His brother's intent was evil, but God brought good out of it. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5943.89,"end":5973.27,"speaker":"Mark","text":"Okay. And then one last thing. Father Stephen, you were one of the first people I watched on YouTube when I was considering becoming Orthodox. And two Years ago, on August 9, 2020, I was chrismated. I was a former Roman Catholic. I'm Chris mated. So you were kind of the gatekeeper, so to speak. So I want to thank you for that, and I appreciate all that you two guys do for Orthodoxy and everybody."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5974.07,"end":5975.03,"speaker":"Fr Stephen De Young","text":"Well, thank God."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5975.43,"end":5975.95,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5975.95,"end":5976.39,"speaker":"Mark","text":"You bet."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5976.63,"end":5977.67,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for calling, Mark."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5978.31,"end":5979.43,"speaker":"Mark","text":"All right, have a good one."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5979.59,"end":5985.75,"speaker":"Fr Andrew Stephen Damick","text":"You, too. All right, well, we've got Georgia, and her phone number at least says she's in Alabama. I don't know. Georgia, are you there?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5986.79,"end":5988.31,"speaker":"Georgia","text":"I am here. Can you hear me?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5988.55,"end":5992.39,"speaker":"Fr Andrew Stephen Damick","text":"We can hear you. Are you in Alabama or are you traveling with a cell phone?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5993.27,"end":5994.55,"speaker":"Georgia","text":"I am in Alabama."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5995.35,"end":5997.59,"speaker":"Fr Stephen De Young","text":"It's good that you called in, because you were on our mind."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":5998.95,"end":6056.49,"speaker":"Georgia","text":"Yeah, right. Well, we're the sister state of Louisiana, so I had to represent for the South. So my question has to do with hair. And what does this. How should we understand these passages in the Bible which. Which talk about hair? They seem to relate somehow to chastity or sexuality. But there's kind of a lot going on in the Bible with hair, with women having to cover their heads because of the angels. I have no idea what that means. And the Nazarites having to wear their hair long. And then even later, we see iconography of Christ in the early first centuries of Christianity shift from. From having short hair to having kind of a long Nazarite style of hair. So what. How should we interpret this? How will ancient people see this?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6057.69,"end":6058.73,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6059.77,"end":6061.41,"speaker":"Georgia","text":"That's a lot of things to throw at you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6061.41,"end":6117.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I remember. I mean, I'm just going to pass on something that I was told in seminary, but I don't know if it's wrong or not. So I'll be interested to hear what Father Stephen says about this. But I remember one of the conversations I had when I was in seminary class was the idea that hair kind of marks a border place between things. Right. So in the case of a Nazarite vow, or in the case of. As we're going to see with monasticism, but also in the case of baptism, there's moving from one way of life into another way of life. Right. Um, I mean, also, as you mentioned, you know, there's. There's elements of sexuality as well, and. And, you know, without getting. Getting into that, but I mean, that there's a kind of border there. Right. So at least that's that's one way that I. And it makes sense to me. I don't know, Father, what else might there be? Or, you know, do you want to actually."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6117.5,"end":6123.18,"speaker":"Fr Stephen De Young","text":"Me. Well, I'm not going to really. Actually, I. I am going to just go for it though. So fair warning. Here it comes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6123.93,"end":6127.29,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So the parental warning or."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6129.29,"end":6132.25,"speaker":"Fr Stephen De Young","text":"I think I could do this where we won't need one."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6132.57,"end":6133.13,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6133.53,"end":6175.46,"speaker":"Fr Stephen De Young","text":"It'll depend on how many and what kind of follow up questions get asked. So there's really. So there's sort of two layers to this that are both part of your question. Right. So one layer is related to what we've been talking about tonight and that what Father Andrew is. Is pointing to. So there is a. With the, with the shaving of the head sort of. And like I talked about with the, the foreign woman who comes into Israel shaving her head. The. Shaving the head at the beginning and end of the Nazarite vow as being part of this sort of new beginning. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6175.46,"end":6179.66,"speaker":"Georgia","text":"Beginning again, like a trauma haircut sort of thing, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6179.9,"end":6183.26,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And his Father Andrew said, you know, this change in way of life."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6184.54,"end":6185.9,"speaker":"Fr Andrew Stephen Damick","text":"I did a trauma haircut once."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6186.94,"end":6188.94,"speaker":"Georgia","text":"I think we've all done a trauma haircut once."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6192.46,"end":6195.26,"speaker":"Fr Andrew Stephen Damick","text":"I was a much younger man and my girlfriend had broken up with me."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6197.02,"end":6201.26,"speaker":"Fr Stephen De Young","text":"Oh, you did the desperate cry for help haircut. Yeah, Well, I used to be a long."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6201.26,"end":6207.46,"speaker":"Fr Andrew Stephen Damick","text":"I used to be a long haired hippie type when I was a stagehand. And then it was all gone. Not all of it, but, you know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6207.46,"end":6207.94,"speaker":"Georgia","text":"Oh, man."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6208.18,"end":6212.42,"speaker":"Fr Andrew Stephen Damick","text":"The majority of it. Yeah, yeah. I mean, now I couldn't even grow it if I wanted to, but."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6212.98,"end":6221.46,"speaker":"Fr Stephen De Young","text":"Yes. Well, you, you could, I think you could pull off the skull it. Right. The Hulk Hogan haircut. You could grow it out that way anyway."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6224.18,"end":6224.58,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6227.46,"end":6264.56,"speaker":"Fr Stephen De Young","text":"Yeah. And then the, the element of not cutting it right at all. Right. And this is something that's carried through in monasticism, Right. Like after the tonsure. Right. Like male monastics don't cut their hair and their beards. That has an element of sort of vanity to it and concern with that sort of thing. Right. That you're not. Your focus and your concern, your dedication is not to sort of the presentation of your personal appearance."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6265.76,"end":6266.4,"speaker":"Georgia","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6266.64,"end":6316.32,"speaker":"Fr Stephen De Young","text":"When you're talking about what St. Paul says in First Corinthians, right. There's another layer that's coming in here because St. Paul is talking to the people of Corinth who are former pagans and probably first and second Corinthians out of St. Paul's writings that are Included in the New Testament are the ones that are most clearly aimed at former pagans. That's as opposed to Jewish Christians and Christians who were God fearers, who were Gentiles associated with the synagogue. Right. Just straight out, these people were worshiping pagan gods, now they're Christians. That's why there's this unique set of problems in first and second Corinthians and then ongoing. St. Clement has to write to Corinth."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6316.32,"end":6316.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6318.12,"end":6494.49,"speaker":"Fr Stephen De Young","text":"Because you know, they have issues. Right. Your God fearers that your Jewish Christians are could be tempted to go eat meat offered to idols or participate in a feast at an idol's temple. Right. They already know that's bad. Right. And so when he's addressing women's hair in particular, there's and talks about men's hair, like long hair being ashamed to a man. And the people say, well, wait, what a minute, what about St. John the Forerunner? What about monastics? What about da da da da? Right. So he's speaking now to what we would call Greco Roman culture, Greek culture of the Roman period. And so if you read, and not a lot of people do, but if you go and read the Hippocratic Corpus, which is the collection, it's named after Hippocrates, it's not all written by Hippocrates. It's the collection of Greek medical texts that we still have essentially ancient Greek medical texts. The Hippocratic oath is same Hippocrates. It talks about the way in Greek culture, the Roman period, they believed hair worked and they believed that hair attracted and held male seed that entered the body. Therefore, long hair on anyone displayed long hair on anyone culturally represented openness to physical relationships, not necessarily within the context of a marriage and fertility. And so if a man wore his hair long in that culture, it was a sign that they were open to same sex fornication. And if a woman openly wore long hair, that was a sign that she was available to men. And so St. Paul is saying to these former pagans who are coming out of that culture, that kind of sexual display does not belong on a man ever and does not belong on a woman in the context of the church community. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6495.61,"end":6497.85,"speaker":"Georgia","text":"So the kind of signal that it's sending."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6498.25,"end":6505.41,"speaker":"Fr Stephen De Young","text":"Right. And so people who say it's modesty, that's not wrong, but I mean, it's sort of more than that in the original setting."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6505.49,"end":6507.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, modesty within a civilization, not like."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6507.49,"end":6509.09,"speaker":"Georgia","text":"Wearing a turtleneck type of thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6509.81,"end":6537.98,"speaker":"Fr Stephen De Young","text":"Right. And dropping that line about because of the angels. Is St. Paul making a reference to the fact that when we're gathered together in the church community. Right. That we're joining the worship in heaven, the angels are there. Right. And he's dropping a not very subtle reference to, like, the Book of Enoch traditions about women and angels."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6539.26,"end":6539.9,"speaker":"Georgia","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6540.54,"end":6596.88,"speaker":"Fr Stephen De Young","text":"Not. Not to be taken literally. Like, he thinks if a woman doesn't wear a head covering, that's going to happen again and she's going to have giant babies. Right. That's not like literally. Right. But he's alluding to that. He's. He's alluding to that to make the point that within the. The Israelite, Jewish, Christian tradition. Right. As it goes through those phases, through that whole tradition up to and including the Christian tradition, that sexuality and worship are two completely unrelated things that need to be kept away from each other, which we take for granted. But if you were living in 1st century, Corinth would be weird to you. So I think I've done that in a way that no one heard anything they shouldn't. But hopefully that answered your question nonetheless."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6596.88,"end":6597.68,"speaker":"Fr Andrew Stephen Damick","text":"Probably not."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6597.92,"end":6598.8,"speaker":"Georgia","text":"Yes, it did."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6600.16,"end":6600.72,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6600.96,"end":6603.44,"speaker":"Georgia","text":"I really regret asking it now, but I understand."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6605.12,"end":6605.84,"speaker":"Fr Stephen De Young","text":"Oh, man."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6606.08,"end":6607.4,"speaker":"Fr Andrew Stephen Damick","text":"I think you're the first person to."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6607.4,"end":6612.82,"speaker":"Fr Stephen De Young","text":"Ever say that to us. But tmi, there's a lot more going."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6612.82,"end":6614.58,"speaker":"Fr Andrew Stephen Damick","text":"On there than you imagined."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6614.58,"end":6618.02,"speaker":"Georgia","text":"Yeah. Yep. Did not expect that one. All right. Thank you, Father."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6618.42,"end":6620.1,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Georgia, for calling in."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6620.26,"end":6620.9,"speaker":"Georgia","text":"Okay."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6621.62,"end":6634.06,"speaker":"Fr Andrew Stephen Damick","text":"All righty. You know, it was our very first episode. Someone called about that, and we kind of gave a little bit of a short shrift answer. And I think this. That was. Yeah, yeah. See, it only took three years. Two and a half years."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6634.06,"end":6651.63,"speaker":"Fr Stephen De Young","text":"Yeah. Oh, yeah, yeah. Well, you know, it's not that I ever have cared about self protection and not getting canceled, but in those early days. But also reference to you and oh, good people at Ancient Faith."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6651.87,"end":6653.31,"speaker":"Fr Andrew Stephen Damick","text":"That's so nice of you, but I."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6653.31,"end":6655.63,"speaker":"Fr Stephen De Young","text":"Didn'T want to cause trouble for you folks necessarily."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6656.83,"end":6658.11,"speaker":"Fr Andrew Stephen Damick","text":"Now, you're untouchable."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6658.43,"end":6664.7,"speaker":"Fr Stephen De Young","text":"No, no, no. I don't get in trouble. I stay in trouble. I just don't want to drag a whole bunch of other people down with it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6664.94,"end":6678.78,"speaker":"Fr Andrew Stephen Damick","text":"But it just so happens that this episode is about hair, among other things. So, like, it's topical. It's top call with a topical question, everybody. We will. We will take it. Or occasionally we may also say, well, we're actually about to get to that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6679.34,"end":6679.9,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6680.38,"end":6682.94,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah, right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6683.5,"end":6685.66,"speaker":"Fr Stephen De Young","text":"We haven't gotten the angry Samsonites, though."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6686.14,"end":6690.04,"speaker":"Fr Andrew Stephen Damick","text":"I know. I guess. I don't know. They. Maybe they just don't listen to the show. I don't know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6690.36,"end":6694.52,"speaker":"Fr Stephen De Young","text":"Or they're just so frothing with rage they can't even dial. Exactly."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6696.84,"end":6699.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So St. John the Forerunner, living in the wilderness."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6699.96,"end":6738.91,"speaker":"Fr Stephen De Young","text":"Yes. Well, yeah, no, so we were talking about him, Chastity, St. John the Forerunner, he adds these elements, right, from the prophet Elijah, sort of through his embodiment of the Nazarite tradition. That's going to become important going further. But he's not the only place where Nazarites show up in the New Testament, even though he's probably the only one the average person might know off the top of their head. So one of these is a question. And this is St. James the Just. This is St. James, the brother of the Lord."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6739.71,"end":6742.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes. His stepbrother, the son of Joseph."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6742.99,"end":6856.84,"speaker":"Fr Stephen De Young","text":"Yes. St. James 3. Theodelphos, Jacobus. Theodelphos for all our Greek listeners. So there is nothing in the New Testament scriptures that really tells us that St. James was a Nazarite. That's why this is a question. But within. And some of these folks aren't technically church fathers, but as Eusebius of Caesarea records it in his ecclesiastical history, Hegesippus. So we're getting this second hand to boot. Hegesippus says that St. James was a Nazirite and that he was a lifelong Nazirite. Now that also though isn't totally clear because much like monasticism, lifelong Nazarite does not necessarily mean that his parents made him one. Right. You could become a lifelong Nazarite at any age. So we saw Samson and St. John the Forerunner were from birth. Right. Their birth is announced, but which is one of the things that ties them together. But your average lifelong Nazarite would be like someone who we would say was a lifelong monk. That doesn't mean like after they were born they were carried to a monastery. Right. That usually means when they came of age as a young person, they joined a monastery and then spent the rest of their life as a monastic. Right. And so all that is to say if St. James is one Hegesimus testimony and the other testimony about it doesn't tell us when he took the vow. Right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6856.84,"end":6857.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6857.88,"end":6904.15,"speaker":"Fr Stephen De Young","text":"The other major testimony is Saint Epiphanius of Salamis, who in his Panarion says that Saint James was a Nazarite, again, a lifelong Nazarite. So we have these two places that mention it. We don't have anything that says he wasn't one. Right. We just only have a couple of mentions of it. Right. So it's hard to conclude based on that. Oh yeah, for sure. Right. Now that does fit with Josephus has A fairly extended description of St. James talking about his piety. The way he was always in the temple, the camel knees thing that he was referred to as camel knees because he had knees like a camel from kneeling in the temple."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6904.15,"end":6904.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6904.47,"end":6923.2,"speaker":"Fr Stephen De Young","text":"They had gotten so big, got huge calluses. Yeah. That's certainly compatible with the idea that he was a Nazirite, that he had dedicated himself to the Lord in this way. But it's also possible to dedicate your life to the service of the Lord without necessarily having it be in the context of a Nazarite vow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6923.36,"end":6926,"speaker":"Fr Andrew Stephen Damick","text":"We just don't know. There's these comments about it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6926,"end":6934.56,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. We know that St. Paul took a temporary Nazarite vow himself."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6935.2,"end":6953.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, in Acts 18:18, it says after this, Paul stayed many days longer and then took leave of the brothers and set sail for Syria. And with him Priscilla and Aquila at Cenchreae, he had cut his hair, for he was under a vow. That's pretty clearly a reference to a Nazaritic vow."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6953.29,"end":6961.77,"speaker":"Fr Stephen De Young","text":"Yeah. But now the more controversial one. Now we come to Acts 21."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6962.41,"end":6966.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Acts 21. 17:26."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6967.49,"end":6971.09,"speaker":"Fr Stephen De Young","text":"Welcome to controversy. Episode of Lord of Spirits."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6972.61,"end":6972.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":6972.97,"end":7007.42,"speaker":"Fr Stephen De Young","text":"This is this one. Is it so controversial based on what I'm going to say? This isn't going to ruin Sunday school. No, this is controversial because people avoid Acts 21. You may not even realize that people avoid Acts 21, but people avoid Acts 21, because for a lot of folks with a lot of different theological structures and ideas and commitments, as it were. Yes. Acts 21 is where they go to die."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7009.66,"end":7010.3,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7011.58,"end":7023.5,"speaker":"Fr Stephen De Young","text":"Acts 21 wrecks a lot of theories about the relationship between Judaism and Christianity, about the relationship between sacrifices and the Eucharist."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7025.34,"end":7028.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So let's just dive in."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7028.62,"end":7060.87,"speaker":"Fr Stephen De Young","text":"Yeah, let's just dive in. So this is when. This is just to sort of give the background. Right. This is when we're near the end of the Book of the Acts of the apostles. St. Paul has come back to Jerusalem. He's facing a lot of opposition. This is all going to culminate in his arrest. But as we pick up, he's just arriving back in Jerusalem. Right. And that's where this quote begins."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7061.27,"end":7153.09,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Acts 21, starting with verse 17. When we had come to Jerusalem, the brothers received us gladly. On the following day, Paul went in with us to James, and all the elders were present. After greeting them, he related, one by one, the things that God had done among the Gentiles through his ministry. And when they heard it, they glorified God. And they said to him, you see, brother, how many thousands there are among the Jews of those who have believed. They are all zealous for the law. And they have been told about you that you teach all the Jews who are among the Gentiles to forsake Moses, telling them not to circumcise their children or walk according to our customs. What then is to be done? They will certainly hear that you have come. Do therefore what we tell you. We have four men who are under a vow. Take these men and purify yourself along with them and pay their expenses so that they may shave their heads. Thus all will know that there is nothing in what they have been told about you, but that you yourself also live in observance of the law. But as for the Gentiles who have believed, we have sent a letter with our judgment that they should abstain from what has been sacrificed to idols and from blood and from what has been strangled and from sexual immorality. Then Paul took the men, and the next day he purified himself along with them and went into the temple, giving notice when the days of purification will be fulfilled and the offering presented for each one of them. So clearly, there's these four groups, these four guys that are under a Nazaritic vow. You know, they have to get their hair cut. They have to offer the sacrifices. And Paul is paying for all of that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7153.17,"end":7154.29,"speaker":"Fr Stephen De Young","text":"And they're Christians."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7155.01,"end":7162.01,"speaker":"Fr Andrew Stephen Damick","text":"And they're Christians. And they're Christians, and they're offering sacrifices at the temple as Christians."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7162.01,"end":7163.81,"speaker":"Fr Stephen De Young","text":"Including a sin offering."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7164.93,"end":7167.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7167.29,"end":7172.21,"speaker":"Fr Stephen De Young","text":"At the end of their vows. And St. Paul totally cool with it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7172.37,"end":7173.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He goes along with the whole thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7173.97,"end":7178.57,"speaker":"Fr Stephen De Young","text":"Sponsoring it to show that he has not rejected the law of Moses."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7178.97,"end":7180.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7181.45,"end":7190.41,"speaker":"Fr Stephen De Young","text":"And notice what it says here. But as for those Gentiles who have believed just those four things."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7191.05,"end":7192.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We sent a letter."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7192.33,"end":7198.25,"speaker":"Fr Stephen De Young","text":"And, you know, as opposed to St. James, St. Paul, and these four guys who are Jewish Christians."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7198.89,"end":7202.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7202.7,"end":7205.54,"speaker":"Fr Stephen De Young","text":"Go into the temple to offer animal sacrifices."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7205.78,"end":7243.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the reason why this breaks a lot of people's ideas about the relationship between Judaism and Christianity, among other things, is like, there's this idea that with Christ's death on the cross and his rising from the dead, that the entire system of sacrifices and all of that stuff is over. And so, of course, Christians would never do that, because Jesus has been sacrificed now, and you don't need any of that stuff anymore. And yet here they are, not just fulfilling Nazaritic vows, but actually offering sacrifices at the temple, which includes animals, includes A sin offering. Yeah, yeah. Actually a sin offering in particular."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7244.38,"end":7536.55,"speaker":"Fr Stephen De Young","text":"Yes. Right. So now that we've established the problematic. So this is, you know, this. Hopefully this episode will be helpful in terms of method. Right. Because we just read this scripture. This is the Bible, right. This is the Holy Scriptures. They're telling us this thing. From the perspective of a lot of our preconceived notions, this seems wrong. So what do you do? Well, you have to be ready to break your preconceived notions and go with what the Scriptures tell us. Right. So the reality is we have this period of time from A.D. 30 to A.D. 70. 40 years. Right. 40 years, one generation where Christ has died and risen again and the veil has been torn, but the temple is still there. And this passage we just heard is just one example of the fact that the Scriptures present that the Christians, the Jewish Christians still made full use of it for that 40 years. As I said, this is just one place. Right. St. Luke's gospel ends before Acts, picks up the end of St. Luke's Gospel, which we read in the sixth E Athenon reading in the Orthodox Church at matins, ends with the followers of Christ after the resurrection, being in the temple, worshiping God day and night, the Temple of Jerusalem. So they're making full use of it, as we see here, they're making offerings. Right. So, yeah, there are many such cases. Right. And we also have to fit this together with, like we talked about not that long ago in this series, our episode on the Eucharist. Right? The understanding of the Eucharist as a sacrifice. Right. Instituted by Christ, Sacrifice of Christ with its own priesthood. Right, with its own priesthood. And so there's this new sacrifice in this new priesthood, and we tend to jump the gun a little. So if you're on the page, which some of our Protestant friends are not, but if you're on the page that the Eucharist is a sacrifice, and without going into it all here, I don't think you can escape that. There's a journal article online of mine you can find where I argue from First Corinthians that St. Paul explicitly says it's a sacrifice. There's just not a way around it exegetically. So if you're on the page that the Eucharist is a sacrifice, right. We tend to jump to, okay, well, the Eucharist just replaces all of those temple sacrifices. So when we see like this with St. Paul offering sacrifices and particularly sin offerings in the Temple, it's brain breaking, right? Like, no, St. Paul don't do it. Right. But we're jumping the gun. We're jumping the gun. Right? So there was already. There's already. Within the Torah. Right. There's already a means of distinguishing different levels and different types of sacrifice. So, for example, one that's kind of clear is the distinction between the daily sin offerings that are offered and the Day of Atonement. So one of the questions when you're doing research and trying to understand what's going on in the Day of Atonement, is why is the Day of Atonement even necessary once a year? If you have these daily sin offerings? Isn't sin being taken care of in the context of these daily sin offerings? Why do you need this other annual thing? Right. So there's this. There's this distinction made because they're seen to be doing different things. And we talked about this when we talked about the Day of Atonement. Atonement at the end of our sacrifice series. Right. That the Day of Atonement is doing sort of a different thing than the sin offerings. And so these sacrifices aren't like, competing with each other."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7537.27,"end":7537.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7538.07,"end":7539.83,"speaker":"Fr Stephen De Young","text":"But doing different things. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7539.83,"end":7544.39,"speaker":"Fr Andrew Stephen Damick","text":"I mean, in context, they're used to a life with all these different kinds of sacrifices."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7545.51,"end":7545.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7545.99,"end":7577.58,"speaker":"Fr Andrew Stephen Damick","text":"You know, that this idea, this, you know, frankly, that some Protestants have, that, you know, all of that is now ended because of Jesus's sacrifice. That's anachronistic. If you're kind of in the moment, because no one was thinking about, or probably no one. I mean, we don't know what they're thinking, but we have no evidence that anyone thought of the sacrificial system as being all one ball of something that then would be replaced by one other thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7578.62,"end":7592.87,"speaker":"Fr Stephen De Young","text":"Right, right. And if. If you took the TARDIS back and told one of the Jewish Christians in and around Jerusalem during this 40 years that they had joined a new religion, they'd tell you you were crazy."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7593.91,"end":7594.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7595.67,"end":7597.91,"speaker":"Fr Stephen De Young","text":"From their perspective, they haven't joined a new religion."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7598.55,"end":7600.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7601.11,"end":7664.55,"speaker":"Fr Stephen De Young","text":"They're still Jewish. They just believe Jesus is the Messiah and that he has instituted the Eucharist. They're celebrating the Eucharist on the Lord's Day. You have the Sabbath and then you have the Lord's Day. And they're celebrating the Eucharist on the Lord's Day. And when you read the New Testament closely, Christ's sacrifice is seen specifically and especially to be fulfilling the Passover and the Day of Atonement. And we've talked about this a bunch. Right. We've talked about the Passover connections are obvious. Right. It's Pascha, it's Passover. We still celebrate as Christians the Christian Passover, which is the celebration of the resurrection of Christ. Right. So Passover and then also the day of atonement. And in that phrase, the Lamb of God who takes away the sin of the world, Passover and the day of atonement are drawn together."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7665.75,"end":7667.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7667.75,"end":7715.64,"speaker":"Fr Stephen De Young","text":"The goat who takes away sin and the Passover lamb are pulled together. That's primarily what, in the view of the New Testament, which is coming out of this generation of Jewish Christians, that's the primary fulfillment. Right. So it is natural for them during this 40 years, while the Temple still stands. Right. To now, when the time comes to celebrate Passover, they're celebrating the Christian Passover. And the Eucharist is a participation in Christ's atonement. They understand this. But to see that as this is another sacrifice with another priesthood, this is, as Hebrew says, an altar from which the non Christian Jews cannot partake."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7717.31,"end":7717.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7718.75,"end":7733.63,"speaker":"Fr Stephen De Young","text":"But that it's serving a different function than, for example, the sacrifices offered at the end of a Nazirite vow. What happens is then the Temple gets destroyed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7734.27,"end":7735.63,"speaker":"Fr Andrew Stephen Damick","text":"Yep. In the year 70."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7736.75,"end":7771.73,"speaker":"Fr Stephen De Young","text":"And when the Temple gets destroyed, all of the various Judaisms that exist in the Second Temple period have to try to cope. Right. And some of them do extremely poorly. So if you're a Sadducee and your whole power base and the whole center of your power and authority and influence is the Temple, well, now that the Temple's gone, you're done. So no more Sadducees. Right. The Pharisees did much better. Right. Because the Pharisees were already ambivalent toward the Temple."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7772.43,"end":7774.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Their whole thing is synagogue focused."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7774.59,"end":7983.61,"speaker":"Fr Stephen De Young","text":"Right. They were focused on the worship of the synagogue. Right. Even during the. Through the Second Temple period, they were more focused on the synagogue and on the keeping of the Torah, not on the Temple. And so they were able to compensate when the Temple went away. They tended to. And this is what you see in later Rabbinic Judaism, they saw certain periods and types of prayer and fasting as performing the function that had previously been performed by the animal sacrifices in the Temple. And so even Jewish people in the contemporary period who are more in that line of thought that extends back to the Pharisees don't particularly want the Temple back. They still have that kind of ambivalent attitude. Right. It's another category of Zionism that wants the Temple back desperately. But so that becomes Rabbinic Judaism, the other major Judaism that survives the destruction of the temple is Christianity. And Christianity still has a sacrifice and a priesthood, still has the Eucharist and the Eucharistic priesthood when the temple is destroyed. And so what happens is Christians see the Eucharist as the sacrifice instituted by Christ, as fulfilling the purpose of all of the sacrifices. This is where that shift happens, right? Now that the temple's gone, well, we didn't really need it because we have the Eucharist, because we have this sacrifice, right? And the sacrifice of Christ is the ultimate sacrifice that fulfills all of them. And this is why you start to see the move in this very early period from having the Eucharist on the Lord's Day every week to having the Eucharist every day. Because the Eucharist is now seen to also be fulfilling the function of those daily sacrifices that had been offered in the temple for Jewish and then also for Gentile Christians as it, as it shifts and as it spreads. So this may be the other controversial part, right. Of the episode, right? And they say, okay, but we have to. We can't just hand wave acts 21. No, it's part of our scriptures. It's read in our lectionary cycle. Our lectionary in the Orthodox Church does not skip. It is not embarrassed of it. Right. This has to fit into our understanding. Right. It's scripture. Also, just for the record, by way of deflecting something I know will show up in my email box in the next couple days, I have no memory of this, but I may have said something different about Acts 21 on the whole Council of God some years ago when I went through Acts. If so, I was wrong then. What? I may still be wrong now, but I was definitely wrong then."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7984.23,"end":7984.95,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7985.43,"end":7995.39,"speaker":"Fr Stephen De Young","text":"So save yourself that email. I'm not going to try and defend or reconcile whatever it was I said, unless I said the same thing, then I'm remarkably consistent. Who knows?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7995.39,"end":7996.99,"speaker":"Fr Andrew Stephen Damick","text":"Then you're. You're still going with that?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":7996.99,"end":8000.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8000.79,"end":8012.3,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so are there any kind of Nazarets, Nazarites, Nazaritic? See, I'm trying to say both at the same time practices we see, like after the Old, after the New Testament, I mean, do we see it continue on?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8012.86,"end":8069.54,"speaker":"Fr Stephen De Young","text":"So despite the fact that we now don't have a temple to offer those sacrifices from Acts 21 at the end of the vow, we do find these tantalizing references in Syriac sources, so from early Christianity in Syria that refer to Christian Nazarites. And this seems to be part and parcel of the very early history of monasticism in Syria is that it began with sort of Christian Nazarites, but already here we see the incorporation of some of the elements of the life of St. John the Forerunner, life in the wilderness, other ascetical disciplines beyond just the Nazirite rules, that kind of thing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8069.78,"end":8076.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's corporate, a higher form, because it's got more. There's more to it than just the three original vows."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8077.06,"end":8102.8,"speaker":"Fr Stephen De Young","text":"Right, right. And there is still this emphasis on the cutting of the hair. Some of these sources where you could read about this are in St. Ephrem the Syrian and Aphrat, who may or may not. Well, I won't get into the. That afraid in particular, though, uses Samson as a bad example in talking to these Christian Nazarites."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8103.12,"end":8104.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't be like that guy."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8105.12,"end":8180.56,"speaker":"Fr Stephen De Young","text":"He says he did well in making his vows, but then he fell from his vows through fornication or through licentiousness. Sorry, licentiousness. So what you see here is that it sort of threw Samson as bad example of a Nazarite and therefore bad example for an early Christian monastic over against St. John the Forerunner as good example, that the element of chastity, of virginity comes into the picture of these vowed or sanctified individuals. That's expressing right here is where it comes in. That even though Samson didn't take any kind of vow of chastity, that it was through his licentiousness that he ended up breaking all of his other vows. And therefore, when we make this comparison to St. John the Forerunner, St. John the Forerunner's chastity and virginity is seen as part and parcel of him having kept all of the other vows."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8181.12,"end":8184.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it. It. Right. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8184.64,"end":8194.24,"speaker":"Fr Stephen De Young","text":"Right. And so this then becomes. This is sort of the. The prehistory right of. Of Christian monasticism here in these Syriac sources."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8195.52,"end":8195.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8195.72,"end":8196.64,"speaker":"Fr Stephen De Young","text":"Bubbling up."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8200.08,"end":8208.24,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that's the end of the second half. We still have a third half to go. So we will be right back in just a moment with more Lord of Spirits."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8208.4,"end":8224.73,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23723. That's 855-AF-RADIO."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8231.37,"end":8296.73,"speaker":"Fr Andrew Stephen Damick","text":"This is Father Stephen Freeman. I'm happy to announce Ancient Faith's publication of my latest book, Face to Face Knowing God Beyond Our Shame. Some modern therapists have described shame as the master emotion, one that colors and shapes our world in ways that we hardly imagine. The Christian tradition is no stranger to this. And has a rich understanding of the ways this part of our inner life shapes our experience of the world. This book offers something of a roadmap to that inner what is shame? Is it always bad? Does it have any useful purpose for us? Join me in an exploration of knowing God beyond our shame. Finding the true God whom the scriptures tell us did not turn his face from the spitting and the shame. Face to Face is now available@store.ancientfaith.com that's store.ancientfaith."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8298.32,"end":8314.32,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8316.24,"end":8320.08,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back. It's the third half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8320.4,"end":8323.05,"speaker":"Fr Stephen De Young","text":"I'd like to clarify something before we go any further."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8323.21,"end":8324.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, go for it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8325.13,"end":8327.53,"speaker":"Fr Stephen De Young","text":"Father Stephen Freeman and I are not the same person."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8330.65,"end":8336.41,"speaker":"Fr Andrew Stephen Damick","text":"It's true. I think we did got contacted by someone recently that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8338.17,"end":8340.93,"speaker":"Fr Stephen De Young","text":"Referred to Father Stephen Freeman on Lord of Spirits. Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8340.93,"end":8345.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. Maybe we just saw it somewhere about us."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8345.73,"end":8352.57,"speaker":"Fr Stephen De Young","text":"By the way, everybody, I'm assuming you were confusing the two actual Father Stevens's or Father Stephen."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8353.77,"end":8354.85,"speaker":"Fr Andrew Stephen Damick","text":"Father's Stephen."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8354.85,"end":8378.73,"speaker":"Fr Stephen De Young","text":"They may have confused you and him. Right. They may think you're also Father Stephen. Who knows how deep the confusion goes. But Father Stephen Freeman and I are not the same person. A year ago, we were in the same place at the same time, seen together. And this was not like when Alfred dressed up as Batman. We both had our respective facial hair and were our respective sizes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8380.24,"end":8383.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He and you are not the same size."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8383.76,"end":8384.12,"speaker":"Fr Stephen De Young","text":"Not."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8384.12,"end":8384.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8384.44,"end":8394.08,"speaker":"Fr Stephen De Young","text":"And we are so therefore very clearly not the same person. Right. And so don't send hate mail aimed at me to him."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8394.64,"end":8395.68,"speaker":"Fr Andrew Stephen Damick","text":"You'd send that to me?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8396.72,"end":8400.48,"speaker":"Fr Stephen De Young","text":"Yes. He doesn't deserve it. I find it entertaining."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8402.08,"end":8403.84,"speaker":"Fr Andrew Stephen Damick","text":"I forward the good ones to Father Steve."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8404.24,"end":8425.91,"speaker":"Fr Stephen De Young","text":"Yeah. If you want to send hate mail directed at Father Stephen Freeman to me, I'll read it and laugh at it. But that probably won't give you the kind of visceral thrill you're looking for in sending the hate mail in the first place. So for what it's worth, thank you for that clarification. Yes. It's important once in a while."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8426.07,"end":8461.27,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. All right, well, we've been talking about Nazarites and making our way to St. John the Forerunner and so forth. So let's talk about now, Christian monasticism and how it blossomed out of all of that Yes. I mean, this fits in with the generic. Right, the generic Lord of Spirits script, right, where you get to the thing in the third half finally, and sometimes just spend 30 seconds mentioning it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8462.55,"end":8464.71,"speaker":"Fr Stephen De Young","text":"So which may happen here."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8466.47,"end":8477.51,"speaker":"Fr Andrew Stephen Damick","text":"There's actually not a lot to. I mean, I looked this up. There's actually not a lot to the actual service of making someone a monk or a nun. It's really a brief little, like, couple of prayers, honestly."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8478.23,"end":8544.29,"speaker":"Fr Stephen De Young","text":"It's not an elaborate ritual that we can walk you through. But it is a mystery of the Church. It is a sacrament, indeed. That's why we've been having this broader discussion about monasticism as such. So it's important, I think, in addressing now, Christian monasticism and our understanding of it and what it is and how it works, actually, to dip back ever so briefly into the Old Testament one more time, and this is to look at Amos, chapter 2, verses 11 and 12. Amos gets overlooked a lot. The Old Testament, Joel, right? You get. You get the. The Pentecost stuff, right? The Holy Spirit being poured out on all flesh, right? Hosea gets told to go and marry a prostitute, Right? That's kind of exciting and interesting. Amos from Toccoa, he gets left out a lot. But this is important."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8545.01,"end":8575.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So Amos, chapter 2, verses 11 and 12. This is God speaking. And I raised up some of your sons for prophets and some of your young men for Nazarites, is it not? Indeed. So, O people of Israel, declares the Lord, but you made the Nazarites drink wine and commanded the prophets, saying, you shall not prophesy. So you get this pairing here of these two roles, prophecy and Nazirites, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8575.87,"end":8590.23,"speaker":"Fr Stephen De Young","text":"Prophets and Nazarites. And so a couple things that pairing shows you. First of all, from this text, right, God calls and raises up Nazirites."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8592.16,"end":8592.36,"speaker":"Fr Andrew Stephen Damick","text":"Or."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8592.36,"end":8624.19,"speaker":"Fr Stephen De Young","text":"Monastics in our more modern terms, these are people who God calls and raises up and calls them to this particular way of life to be people set apart. In the same way that he calls and sets up prophets, right, to serve this function for him in relation to the larger community of followers of God. That's number one. So this is a specific calling from God for the purpose of the body."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8624.99,"end":8625.39,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8627.39,"end":8643.39,"speaker":"Fr Stephen De Young","text":"In particular, this connection between Nazirite and prophet is also one of role that. That purpose that they serve in terms of the body is not completely dissimilar."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8644.11,"end":8645.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8645.47,"end":8682.36,"speaker":"Fr Stephen De Young","text":"Right. So monastic tonsure, here it is. Here's the sacrament, right? This is the material act, right? So we've seen all the sacraments, God working through material things, whether it's water in baptism Oil. Chrism. Male and female human organism in the case of marriage. And here it's hair. Right. And that hair being physically cut."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8682.68,"end":8738.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And for maybe some of our non Orthodox listeners, and we're happy to have you. If you don't know what monastic tonsure is, basically there's a couple of prayers that are said by the abbot of the monastery, and then he takes scissors and he cuts bits of the hair of the person becoming a monk or a nun in a crosswise form, it says. So usually that means a little bit at the front, a little bit at the back, and then a little bit on each of the two sides. And then that hair typically is then put into a sensor, you know, burned, typically. And that's kind of the key moment. You know, they'll often, depending on the tradition, they may put particular. They will definitely put monastic clothing on them, but it kind of depends on which tradition they're in as to which clothing that gets put on them. But."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8738.88,"end":8740.64,"speaker":"Fr Stephen De Young","text":"And at what point. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8740.8,"end":8754.17,"speaker":"Fr Andrew Stephen Damick","text":"In their life as a monastic. Yeah. There might be sort of stages of this, depending on the monastic tradition. And they'll often give them a hand cross and there'll be usually a candle there. So they're holding a candle, which is similar in some ways to when someone is baptized."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8755.77,"end":8758.49,"speaker":"Fr Stephen De Young","text":"And that's kind of life element with the hair cutting."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8758.49,"end":8763.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, that's, that's. And there's a new name too, actually. They're given a new name."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8763.05,"end":8763.53,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8764.01,"end":8769.93,"speaker":"Fr Andrew Stephen Damick","text":"Which they don't know beforehand, by the way. The abbot or. Or abbess picks that name."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8772.17,"end":8780.41,"speaker":"Fr Stephen De Young","text":"It's interesting if there are any Abbotts or Abases listening to this show. Shamgar. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8780.41,"end":8785.37,"speaker":"Fr Andrew Stephen Damick","text":"Come on, guys. Or ladies. Excuse me, mothers, fathers."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8785.53,"end":8787.53,"speaker":"Fr Stephen De Young","text":"Yeah, I was gonna say. I don't know if guys and ladies."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8789.45,"end":8792.25,"speaker":"Fr Andrew Stephen Damick","text":"Well, I just started saying, come on, guys. And then I'm like, no, no, no."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8792.49,"end":8793.21,"speaker":"Fr Stephen De Young","text":"Such an American."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8793.93,"end":8810.99,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. So. So informal. Yeah. And. Yeah. So the person doesn't know beforehand what the name they're gonna get is. It's their first act, act of obedience. This is your new name. It could be Animpodistos or Epaphroditus or whatever. Shamgar."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8811.71,"end":8914.01,"speaker":"Fr Stephen De Young","text":"Yeah. And all of that is aimed just like the beginning of the Nazirite vow. You're making this new beginning, new person, new start. So going forward from sort of where we left off into the history of Christian monasticism, there are some important figures, some important saints, important places related to monasticism. Right. Where again, these things that are developing in this Nazarite tradition get put into by way of St. John the Forerunner, get put into practice. First on that list has to be St. Anthony the Great, who is regards the first to go out into the desert, specifically the Egyptian desert. So we're talking with St. Anthony the Great. We're talking around circa AD 270 and so third century AD, most of what we know about him. There are other lives of St. Anthony, but sort of the core text is St. Athanasius of Alexandria's Life of St. Anthony. And St. Anthony famously sold all of his possessions, went out to the desert. At first he sort of apprenticed with a particular hermit who was already kind of practicing. So this is, let's be clear, St. Anthony the Great, not the first monastic, not the first Christian monastic."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8914.01,"end":8919.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean there's St. Paul of Thebes is out there first. Right? Yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8919.33,"end":8921.17,"speaker":"Fr Stephen De Young","text":"Even if we're just talking about the Egyptian desert."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8921.17,"end":8923.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, just the Egyptian desert. Right, right, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":8924.45,"end":9108.48,"speaker":"Fr Stephen De Young","text":"And in fact, St. Anthony had a sister. When St. Anthony inherited all of his parents possessions and gave them away, he had his sister go and live with a community of female virgins. Well, what's that? Right, yeah, it's a female monastic community that already existed. Right. But he is the founder of the particular way of life that's going to become the way of life of the Egyptian desert fathers. Right. So he first goes and is with a hermit sort of as an apprentice. Then he goes and he moves into a tomb where famously he used the skull of the former resident as a pillow. And in that tomb he suffered a series of demonic visions and attacks, which you can find both orthodox iconography and very imaginative Western art, depicting the temptation of St Anthony in the cave tomb. And ultimately then went to live a life of solitude as a hermit himself on top of a particular mountain. Despite his original intent to live in solitude on the top of that mountain, people were attracted to him in his way of life and began to also go and live on the mountain. And whenever they could encounter him, they prevailed upon him to become sort of the abbot, sort of the father, the leader of their, of their monastic community. Eventually, around the year 305, he relented and did that. Probably his most famous disciple is Saint Macarius the Great. And you can read, there's literature from him. He's one of the greatest of the desert fathers. There's a kind of funny episode where St. Constantine sent him a letter sort of to ask him for guidance and wisdom. But did it in the way that a Roman emperor sends a letter to a common person. St. Anthony was completely unimpressed with getting a letter from the Roman Emperor and sent him a letter back, basically telling him he should stop spending all his time worrying about worldly affairs. The Roman Emperor should spend less time worrying about earthly affairs and spend more time worrying about his soul, which is advice that technically, after his baptism, St. Constantine eventually took. But, yeah, that was his reply. He also, at one point, sort of emerged in Alexandria out of the desert to condemn Arius. But so in the life of San."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9108.56,"end":9108.96,"speaker":"Fr Andrew Stephen Damick","text":"Again."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9110.72,"end":9167.7,"speaker":"Fr Stephen De Young","text":"This is kind of a theme, I guess, of the episode is that. So you don't. What you don't find with this Nazarite tradition developing into the monastic tradition, you don't find a lot of people sitting around theorizing about it. Yeah, they're just doing it, right. Theological treatises about it. You find people going and embodying it, going out and living a certain life, living a certain way of life, and that then attracts other people to that way of life as a way of pursuing closeness to God, pursuing salvation, pursuing repentance. They're drawn to it by sort of the life that they're embodying. And so the life of St. Anthony, the life he concretely lives, becomes the paradigm for the Egyptian desert monastic, for the desert Father of Egypt."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9168.98,"end":9230.71,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting to think about, and we're going to talk about Mount Athos in just a second, but it's interesting to think about Athos. Got to the point in the modern era where I think there were fewer than 1,000 monks there and a place where there once had been 40,000. Right. So, I mean, really, it really dwindled over centuries. And what's interesting is that the movement that has begun to reinvigorate it was just like what you said. It was a handful of ascetics who went and lived in caves and were really, really living their life. And they gathered disciples around the people, like St. Joseph the Hesychast, for instance, or Saint Emilianos of Simonopetra, who went and just lived, really lived the life, and then a group gathers around them and then that reinvigorates. It's not fundamentally about the forms and the rules and the theories. Right. It's about the life, the actual life of dedication to Christ in prayer and the other things flow out of that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9231.27,"end":9352.23,"speaker":"Fr Stephen De Young","text":"Right, right. And. And we have to keep in mind what we read from Amos, right, that part of the reason you don't find that theorizing is that this is a particular calling. Right. This is not them laying out a pattern for all Christians of the way of salvation. This is a particular calling for particular people. Right. The fact that Saint Simeon stylites lived on the pillar for years doesn't mean you should. And we're not saying that. We're not saying all the holiest people go and live on pillars. No. There are these particular callings for particular people, and these people are living out that calling. And the judgment implied in that quotation from Amos, by the way, still applies. As you were talking about monastic foundations dwindling. Part of the way in which God judges cultures and societies and nations is by whether they equip the people living within them to follow God's calling on their life, or whether they impede it, hinder it, lead them away from it, try to force them to stop, lead them in the opposite direction. And so when monastic settlements dwindle, when vocations or callings to the priesthood dwindle, that is a mark of a culture, of a nation, of communities that are improperly ordered. Because it's not that God isn't putting that calling on anyone's life."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9353.51,"end":9353.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9354.63,"end":9390.43,"speaker":"Fr Stephen De Young","text":"It's that something stopping it from happening. So the next major figure who, compared to St. Anthony gets short shrift, but who I like talking about because not enough people know enough about him, is St John Cashin. St John Cassian, in the late 4th and early 5th century, went everywhere, met everyone and did everything. He was from Scythia. He was from part of what's now Romania."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9390.75,"end":9394.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or Dacia. Don't they also call it Dacia in that period?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9394.58,"end":9590.86,"speaker":"Fr Stephen De Young","text":"That's a different part, but yeah. Yeah. So he went and became a monk in Palestine and was given the name. His given name was Cassianus. Right. Roman name. He. He took the. Received the name John when he was made a monk for St. John the Forerunner. He got permission from his abbot at the monastery in Palestine to go and visit a monastery in Egypt. And then he and his friend Germanus just stayed in Egypt and sort of overstayed their visa. And while he was there, he wrote one of his major works, which is called the Conferences, which is him recording conversations he had with the desert fathers in the Egyptian desert while he was there near the end of the 4th century. When he left there, eventually, they didn't want him back at the monastery of Palestine because he'd overstayed his visa. So he went to Constantinople and was ordained as a deacon and was one of St. John Chrysostom's deacons, specifically the deacon in charge of Constantinople's church Treasury. When St John Chrysostom was exiled, he was sent to Rome as a delegate to the Bishop of Rome to try to get the Bishop of Rome to intervene to help St. John, who was the bishop of Constantinople in exile. While there he met then Archdeacon Leo, who later became St. Leo the Great, the Pope of Rome, and was commissioned to go and found the first monastery in Western Europe, which he did, which is the Monastery of St. Victor in Marseille, France. And in the process of doing that he wrote his other most well known work, which is the Institutes of the Monastic Life. This is the other institute, sorry, Calvinists, Institutes of the Monastic Life where he basically talks about the way things were done in Palestine at that time, the way things were done in Egypt at that time, and compares those two and then talks about how those practices could be adapted to Western Europe where you have a very different climate, very different situation in terms of being able to grow food and what food you can grow than the Palestinian desert or the Egyptian desert. Very different needs in terms of clothing. He gets down to very practical things like being able to go barefoot or wear sandals or footwear. The differences between the Egyptian desert and France at this time. He also, in the context of those works, by the way, has the eight evil thoughts which were eventually developed into the seven deadly sins. Like St. John Cashin did everything. Usually St. Benedict of Nursia sort of steals his thunder. The founder of Western monasticism, which is not the case. St. Benedict actually based his rule on St. John Cashin's writings."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9590.86,"end":9614.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I mean, I think it's because his feast day is on February 29th, you know, so it's just once. No, actually we transfer it to the 28th on non leap years. Yeah, yeah, but it's like our mutual friend Father Joel who is going to have his, I think 13th birthday next year. 13th birthday, good for him. He's 13 birthdays."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9615.31,"end":9619.23,"speaker":"Fr Stephen De Young","text":"He got in some trouble in the west because of the Calvinists, but it was a bad rap, I tell you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9619.23,"end":9621.35,"speaker":"Fr Andrew Stephen Damick","text":"Oh, St. John Catherine. Yeah, yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9621.35,"end":9627.79,"speaker":"Fr Stephen De Young","text":"I mean there's other fun facts. Like he is, as far as we can tell, the first saint ever canonized by a bishop of Rome."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9628.51,"end":9630.03,"speaker":"Fr Andrew Stephen Damick","text":"Hey, There you go."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9630.11,"end":9637.24,"speaker":"Fr Stephen De Young","text":"St. Gregory the geologist. St. Gregory the great had his relics taken and put in a silver coffer that said St. John Cashin on it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9637.72,"end":9639.56,"speaker":"Fr Andrew Stephen Damick","text":"Well, there's no arguing with that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9639.88,"end":9642.16,"speaker":"Fr Stephen De Young","text":"Yeah. Oh, you'd be surprised."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9642.16,"end":9646.4,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, okay, there is arguing with that, but it's foolish, all of it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9646.4,"end":9653.56,"speaker":"Fr Stephen De Young","text":"So here we go. Tie it all together tonight. Samson not a saint. Saint John Cashin, definitely a saint."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9653.72,"end":9654.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9655.88,"end":9670.16,"speaker":"Fr Stephen De Young","text":"Yes, yes, so that's sort of our Egyptian monastic founder. Are our European monastic founders. Obviously, we'd be remiss as an orthodox podcast talking about monasticism to not talk about Mad Athos."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9670.64,"end":9671.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9671.6,"end":9676.16,"speaker":"Fr Stephen De Young","text":"But because this is Lord of Spirits, we have to begin by pointing out that Athos was a giant."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9677.44,"end":9678.08,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9678.32,"end":9693.69,"speaker":"Fr Stephen De Young","text":"He was one of the giants in the Greek Gigantomachy. He is supposed to be buried under Mount Athos. And Mount Althos itself was thought to be a rock that he threw at Poseidon."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9694.81,"end":9697.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. Landed on him or whatever. Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9697.61,"end":9708.89,"speaker":"Fr Stephen De Young","text":"Poseidon deflected it. He ended up buried under his own rock, hoisted by his own petard. But so Mad Athos, the great Christian monastic settlement, is over the grave of a dead giant."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9709.13,"end":9733.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and for those of you who maybe don't know, it's a peninsula, and the mountain itself is on the very southern end of it. And there's actually. There's a little chapel up there at the top. Now, I did not go all the way up to the top of the mountain, but we were not that far from it. I went to Athos five. Five years ago now. Great, great experience. Yeah, yeah. So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9736,"end":9737.12,"speaker":"Fr Stephen De Young","text":"Now there is."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9737.44,"end":9738.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. The."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9738.6,"end":9741.84,"speaker":"Fr Stephen De Young","text":"The when we talk about the founding of Mount Athos."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9741.92,"end":9742.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9742.56,"end":9789.34,"speaker":"Fr Stephen De Young","text":"So that found is usually pointed to a visit made according to the history maintained within the tradition of the Church by the Theotokos to Mount Athos on her way with St. John the Evangelist to Ephesus, where while they stopped there, she prayed that her son, our God, would make it a garden dedicated to her. That said, everyone knows this is not us being revisionists about history, that it did not immediately become a monastic settlement."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9790.22,"end":9790.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9790.54,"end":9840.96,"speaker":"Fr Stephen De Young","text":"This was a prayer that was fulfilled later. So because we know that in the 4th century, there were still a mix of not only Christians and pagans living there, but Christian churches and pagan temples there, because Julian the Apostate, St. Constantine's nephew, who took over for him as emperor, ordered all the Christian churches there burned. And then later on, Saint Theodosius turn the tables and ordered all the pagan temples there burned to the ground. That, however, we know, did not actually happen because as late as the 5th century, there was still a rather famous statue of Zeus there."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9841.36,"end":9847.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, yeah, he wouldn't order pagan temples to be burned if there weren't any there."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9848.32,"end":9850.96,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But also."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9851.28,"end":9851.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9854.2,"end":9880.45,"speaker":"Fr Stephen De Young","text":"It is worth noting, Julian the Apostate did not just order all the Christian churches in the world burned down. It was particular ones in particular places. So that is actually really good historical evidence of the antiquity of the story of the visit of the Theotokos there. The fact that he."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9881.01,"end":9883.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As a special place, you know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9883.73,"end":9896.45,"speaker":"Fr Stephen De Young","text":"Right. So this was already seen as a place special, which tells us that. I think this is pretty good evidence that this story was already known. Right. In. In the early 4th century. So it goes."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9896.45,"end":9957.51,"speaker":"Fr Andrew Stephen Damick","text":"And, Yeah. I mean, and there's. And there's some of the monasteries there. Like, I remember when we went to Vatopedi, they told us, like, the name of that monastery, it refers to. Essentially, it means the Child in the Bush. It's the Child in the Bush monastery. And I think it's. I can't remember which emperor it was, whether it was Constantine or Theodosius that supposedly, you know, his child was. Was lost and they found him caught in a bush or whatever. And because he was grateful at getting his child back, he. He endows this monastery there. In any event, actually, at Varto Pedi. This is to connect us with our previous episode. They actually have the cross or some significant fragment of the cross that Constantine carried into battle at the Milvian Bridge. We were just sort of getting a tour, and they pointed up behind the altar and they said, oh, by the way, that's the cross that Constantine carried. And I was like, oh, I didn't know we had that still. That's. Yeah, yeah, yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9957.75,"end":9979.91,"speaker":"Fr Stephen De Young","text":"So. Yeah. So, interestingly, what actually triggers the real transformation of Mount Athos into the monastic settlement that it is today is Islam. Hey, didn't see that."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9979.91,"end":9981.51,"speaker":"Fr Andrew Stephen Damick","text":"Didn't see that one coming, did you guys?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9982.51,"end":9986.91,"speaker":"Fr Stephen De Young","text":"Specifically. Specifically the Islamic conquest of North Africa."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9987.55,"end":9989.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So a bunch of refugees."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":9989.71,"end":10001.79,"speaker":"Fr Stephen De Young","text":"Yes. So there are a lot of Egyptian monks who become refugees and came. And it wasn't that there were already tons of organized monasteries there to receive them. They just came and built a hut."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10002.43,"end":10002.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10003.47,"end":10020.89,"speaker":"Fr Stephen De Young","text":"On Mount Athos. And it's then later, circa AD 967, that Saint Athanasius of Athos organizes things in something approaching the current organization of the monasteries."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10021.13,"end":10041.52,"speaker":"Fr Andrew Stephen Damick","text":"He basically takes what there is there and then has them all kind of working together rather than functioning as independent. They are still independent from each other, but they actually have a kind of legislature that they have together in Caries, which is referred to as the holy community. And he starts that basically. So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10044.16,"end":10213.2,"speaker":"Fr Stephen De Young","text":"As we're coming to the end here in our sort of themes uniting this tradition tonight, as we mentioned, right. There's this connection between the role of the monastic and the prophet. Right. Between the holy one who's set apart and the. The one who brings the message of God, we talk about this more. You can go back to our prophet motive episode about the phenomenon of prophecy, but the connection there is that you have these people who are outsiders, who are outside of the general structure of the world, of society, of cultures, and as people who are standing outside, even to a certain extent, not completely in the case of monastics, but to a certain extent, outside of even church hierarchy, sometimes can then critique, speak about, characterize, speak to challenge culture, society, the church as a whole. Right. Call to repentance. And they're able to do that because of this status of being set apart and being separated right from it. But you can see that episode where we talk more about. More about that. So the last thing we really want to talk about is related to why a certain segment of. Let's be honest, it's mostly our Protestant friends, not all Protestants, but pretty close. I know there's some Anglican monasteries, but have sort of jettisoned this tradition. This tradition, starting with the Nazarites of the Old Covenant coming through to monasticism. And a lot of that really centers around starting even with what Martin Luther has to say about monasticism, centers around a misunderstanding of asceticism. What it is, how it works. Right. What it's about, what the purpose is. So Martin Luther, for example, sees it as people either subjecting themselves to tortures or trying to do meritorious things to try to earn salvation or earn forgiveness of their sins. May have been going through some people's minds. Right. He may have been reflecting. Well, it goes. It is absolutely true, if you've read any Martin Luther, that he's reflecting on his own experience. Right. And his own mindset as a monistic. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10213.2,"end":10217.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, I tried to work. I worked super hard to be saved, and I'm not being saved."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10218,"end":10260.94,"speaker":"Fr Stephen De Young","text":"Yeah. In. In the Western, you know, I'm. I'm doing all this to try to experience forgiveness, and I'm not experiencing forgiveness. Right, Right. So he is reflecting on his own. On his own thing. But this is a misunderstanding of what the monastic tradition was originally about and a misunderstanding of what asceticism is about that may very well have come about in large parts of the west, even before the Protestant Reformation. So one of the key elements that we have to remember with asceticism, whether we're talking about the higher level of asceticism to which certain people are called in monasticism or just the asceticism that all Christians are called upon to practice."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10261.34,"end":10261.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10261.98,"end":10275.02,"speaker":"Fr Stephen De Young","text":"In terms of fasting, etc. Right. Is that asceticism is not giving up bad things. Yeah, you're supposed to give up bad things. You're supposed to give up sin all the time, not just for Lent."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10275.02,"end":10279.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. It's like, well, for Lent, I'm going to sit in a little bit less and then I'll be back, you know."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10279.87,"end":10292.63,"speaker":"Fr Stephen De Young","text":"After it's over, they'll go back to doing all that sinful stuff once we're outside of Lent. Right. Yeah, that. Right. That's not asceticism. Not sinning. You know, being faithful to your spouse is not asceticism. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10292.87,"end":10293.91,"speaker":"Fr Andrew Stephen Damick","text":"Like that. Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10294.07,"end":10303.68,"speaker":"Fr Stephen De Young","text":"That's just what you're supposed to do. Right. Asceticism is essentially giving up good things for better things."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10304.48,"end":10305.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10305.12,"end":10321.2,"speaker":"Fr Stephen De Young","text":"Right. And what that means is. And this is a place where we get Plato brain once again. Right. Where Plato brain. The good is always one. So if two things are differentiated, one must be better and the other one must be worse."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10321.76,"end":10323.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or good or bad."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10323.28,"end":10367.06,"speaker":"Fr Stephen De Young","text":"Right? Yes. And therefore. Right. You get this. If you got that play doh. Brain infection still. Right. Then you look at the existence of celibate monastics and you say, oh, someone who believes in monasticism where people are celibate, they must think marriage is bad. Right. You could have two things that are both good, equally good for different people. Yep. The fact that we fast from meat or any of the other things we fast from in the Orthodox Church in different periods like Lent doesn't mean that eating meat is bad."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10367.94,"end":10378.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, the funny thing is these things aren't opposites. Like marriage and celibacy are not opposites because they're actually both chastity, Just two different forms of chastity."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10379.22,"end":10575.06,"speaker":"Fr Stephen De Young","text":"Yes. You know, there are different ways of life to which different people are called. Yeah, right. Yeah. Right, Right. And this is because. This is because asceticism is ultimately right. When you're talking about giving something up, when you talk about offering something to God, you don't offer God what is bad, you offer to God what is good. Right. So what does this mean? And why would you do that? And what does it mean to give up something good for something better? Well, to understand this, you have to sort of understand how, in part how humans work and how sin works. And this is different than how we're used to talking about. We've talked about several times on the show. I know about the understanding of sin as the passions that make us passive, that act on us. Right. Well, the fathers make this distinction between blameless passions and blameworthy passions. So as humans. As humans who are Finite beings. Finite created beings with material bodies, et cetera. We suffer a lot of passions, right? Things act on us. Forces that are bigger than us act on us. Some of these are blameworthy, like, so, St. John Cassian's eight evil thoughts, right? Sloth, laziness, greed, anger, lust, pride. Right? These are blameworthy. These are sinful passions, right? It's not like there's a mean. Well, you could be a little greedy, right? Just don't be too greedy. Right. Right. Sorry, Gordon Gekko, Right? You could. You could be, you know, a little lustful, but just don't go too far, right? No, these are blameworthy passions, right? The blameless passions are the things that we suffer as humans that are not by their nature sinful. So, for example, you get tired, right? I never sleep, but most people get tired, right? There's nothing sinful about getting tired. You get hungry. There's nothing sinful about getting hungry. Right. Your body processes food into calories, okay? That's how your body works. That's not sinful. You get thirsty. You have these things act upon you to get a little more advanced. In order to get those things and live in the world, you need to go out and you need to make a living. You have to grow food or do something to get money to buy food to support yourself and your family. Right? There are things you have to do, whether you want to or not, based on maintaining our finite lives in this world. But any of those things, though they're not blameworthy, they're not sinful in and of themselves, can become sinful if overindulged. So if you overindulge your hunger, Right. You become a glutton."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10575.38,"end":10575.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10575.94,"end":10601.39,"speaker":"Fr Stephen De Young","text":"You eat far more than you need to. Right. To stay alive. You eat the wrong kind of stuff because it tastes good. Right. Same thing with sleep, right? You go beyond the sleep and the rest that you need to. Laziness, Right. To. I don't want to do anything ever if I can help it. Right. Which is a lot of teenagers, right?"}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10603.39,"end":10603.79,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10605.15,"end":10711.05,"speaker":"Fr Stephen De Young","text":"So. Right. And that's over. And now it's become. It's entered into the realm of sin. It's become blameworthy, even though in and of itself wasn't. You take that need to go out and earn a living, support yourself, your family. You overindulge that, it becomes pride in the pursuit of success. It becomes greed in the pursuit of wealth. Right. And it turns into a sinful thing. Right. The tool we have in our toolbox as Christians to maintain that balance and to fight against our blameless passions becoming blameworthy is asceticism. If we're talking about eating turning into gluttony, we have fasting. If we're talking about sleep turning into laziness, we have vigils. If we have the need to go out and provide for and support ourselves turning into greed, we have the giving of alms to those in need, right? We have these tools of asceticism that keep those things from veering into sin as. As disciplines, as a pattern of the way of life, right? And so certain people are called to exercise an even higher and deeper level of discipline. And from that, from exercising that higher level, they glean certain things. They glean a certain perspective on the world, right? A person who lives without any possessions has a different view and perspective on consumerism than I do."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10712.57,"end":10713.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10713.93,"end":10742.37,"speaker":"Fr Stephen De Young","text":"And is more able to see where the correct balance is and where it's becoming sinful than I am who's enmeshed in it. Right? And that's just one example, right? You know, a person who is sort of always fasting to some extent a monk. I'm not Athos has a very different relationship to food than I do. Living surrounded by fast food joints, driving past 20 or 30 of them on the way home, right? All wanting to sell me snacks."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10742.69,"end":10749.97,"speaker":"Fr Andrew Stephen Damick","text":"You know, I have to say on that point, not about you and snacks. I don't know about what you eat, but."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10750.61,"end":10752.37,"speaker":"Fr Stephen De Young","text":"No, you don't want to trust me."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10753.65,"end":10757.41,"speaker":"Fr Andrew Stephen Damick","text":"Well, I assume you get a lot of crawdads or crayfish. I'm not sure what you call them."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10757.49,"end":10771.1,"speaker":"Fr Stephen De Young","text":"Here's, here's. If I die before you, Father Andrew, okay, I want you to make sure that they know that I am not a saint. The reason my body is not decomposing is the preservatives I ate, not holiness."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10771.34,"end":10917.83,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, it's funny. So now I have two Athenite anecdotes to relate, related to that. One is that we were at one of the monasteries I went to. They took us to the cemetery and I thought, okay. Before we got there, I thought, okay, this is going to be like a huge, huge cemetery. This monastery is hundreds of years old. But actually, no, it had like 12 graves in it, total. And the reason is that they, of course, recycle the graves, they reuse them, right? So, you know, a monk dies, they put them in the ground, and then later on they dig up his bones and they put them in the ossuary and then they reuse the grave. And so the monk who was showing us around Said, you know, it used to be that we would leave them in there, I think. I think you would say, for a year, maybe three years, but it was not long, you know. And then, you know, they would decompose and we'd dig them up, you know, put the bones in an ossuary. He said, now we leave them there as long as we can. And the reason is that because so many of the food items that we buy, you know, they do grow some of their own food, but they also buy food, too, have preservatives in them. And so they leave the body in the earth as long as they can so that it has a longer time to decompose. Because, like you said, food preservatives actually do prevent the body from decomposing as quickly. The other thing that I'll relate with Mount Athos and eating is that there is one of the. It's called the arkhandari, which is where they sort of receive guests. I can never remember if Akandari is the person or the place. Akandariki is the other word. And there was this big painting there of a monk, and he's got, like, all this. All this food he's stuffing into his. Into folds in his cassock, and it's all, like, coming out and falling out. And you can see demons, like, crawling in his mouth and surrounding him. It's really a crazy, wild, scary painting. And it's labeled the Secret Eater. Which. Cause you were mentioning about how monks and Athos have a very different relationship to food. Like, that painting really showed it, like, oh, man. Because the idea is that you eat at mealtimes, and that's it. You don't sneak your own food. You don't say, I'm feeling a little peckish. You know, I'm gonna go have something. Yeah, I remember that. I was like, we stepped in. This is where they do hospitality."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10917.83,"end":10919.15,"speaker":"Fr Stephen De Young","text":"And they're like, whoa."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10919.55,"end":10923.51,"speaker":"Fr Andrew Stephen Damick","text":"It was a big, like. It was like. The painting was like 9 or 10ft tall."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10923.51,"end":10924.07,"speaker":"Fr Stephen De Young","text":"It was big."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10924.07,"end":10930.91,"speaker":"Fr Andrew Stephen Damick","text":"A big painting. Not an icon. Not an icon. Just a very scary religious painting."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10930.99,"end":10940.99,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But so this. This is. This is the key. So this is the core difference between the kind of asceticism that was practiced by gnostic groups."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10943.39,"end":10943.99,"speaker":"Fr Andrew Stephen Damick","text":"And the kind of."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":10943.99,"end":11005.77,"speaker":"Fr Stephen De Young","text":"Asceticism that's practiced by Christianity. The asceticism of gnostic groups is based on the idea that there are no goods in the world. Nothing in the created world is good by virtue of being material. By virtue of being created, it is evil. And therefore, it is to be avoided as much as is possible. And so you have this extremely rigorous asceticism. Right. Brutal asceticism. Right. In gnostic circles, Christian asceticism is about not allowing the good things of God's creation, which we acknowledge are good, not letting them become bad, not letting our own obsession with them, our own yielding to our passions, cause them to become a snare to us. Right. And preserving that. That balance. That's the difference. And that is a major difference."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11006.17,"end":11006.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11006.97,"end":11015.93,"speaker":"Fr Stephen De Young","text":"That is not just a quantitative difference. That is a qualitative difference between the two. They are really two different things. Yep."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11017.85,"end":11200.42,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, to. To wrap up this episode on the holy mystery of monasticism, I wanted to say a few things about various bits that we've kind of covered. One is, you know, most people, of course, and certainly the vast majority of people listening to this are not monks or nuns and are probably not called to be monks or nuns. Maybe a handful of you out there maybe are. So you might think, well, what does this have to do with me? Well, certainly in the sense of being tonsured as a monk or nun, nothing. If you're not going to live that life, then obviously that particular ritual you don't go through. But that said, if you think about that Nazaritic vow, and you think about asceticism in general, as Father Stephen just said, we are all called to asceticism. We're all called to various kinds of denying our desires, even for good things, and to gain something better. Right. And I think that especially, you know, we're here in the midst of great Lent. We're just about halfway through, a little over halfway through now. And it is a season, right. It lasts a particular period. And so in some ways, it's like that Nazarite vow, where it lasts for a particular period. And most of the time when people are engaging in the ascetical practices of Lent, they're not thinking, well, I'm doing this for some particular purpose, you know, aside from the purpose of preparing, purifying ourselves for holy Pascha, which of course is a pretty significant purpose, but one can have multiple purposes at once. And so I want to suggest this. And it doesn't matter that we're halfway through. You can start now. But when we have fasts, I think it's a good and appropriate thing to say, obviously, in conversation with your Father Confessor, if it seems advisable to him to say, I'm going to, as I engage in the normal practices of great Lent under his guidance, I'm going To dedicate it to praying for this person or for this purpose, you know, to aim our asceticism particularly at that. Again, it doesn't earn anything, right? It doesn't earn anything. Ultimately, it's about drawing close to Christ. But as we purify ourselves, our prayers become more effective. Not because God says, well, if you, you know, if you just turn, turn up the volume a little bit, you know, on this, then I'm going to hear you. No, that's not what that means. It's really that we become more receptive to the grace of God by doing this."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11200.98,"end":11201.3,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11201.3,"end":11406.76,"speaker":"Fr Andrew Stephen Damick","text":"It's not automatic, but it's part of the whole package of a life of prayer. So then related to that. Right. Is, you know, I mentioned that I got to go to Mount Athos and one of the most beautiful experiences of my life. And if you know me, you know, I like to go on pilgrimage. Not just because Geoffrey Chaucer, although April is coming, I love to go on pilgrimage. And of course, you know, orthodox Christian pilgrimages often include visits to monasteries, but not always. It could be other holy places. The Greek word for pilgrimage is proskinima, which means veneration. So you go to venerate. Right. And you know, Father Stephen and I had a conversation the other day in which we talked a little bit about pilgrimage. And he made the point, and of course it's a very good point, that there's nothing sort of available on pilgrimage that isn't available at your local parish. Right. It's not like if I go to Mount Athos and receive Holy Communion there, that it's sort of better communion than it is here in Emmaus, Pennsylvania or in Lafayette, Louisiana or wherever you live. Listener. It's not. It's the same Christ, the same body and blood of Christ, the same Christ is available everywhere. So what's the point in going on pilgrimage? The point is that in stepping outside of our normal day to day life, we become more receptive if done well. You know, pilgrimage is not just going on a vacation or it's not a vacation or even just going on a trip. It's about orienting ourselves towards the veneration of what is holy, to receive the grace of God. And so if we do that, then we can become more receptive within the scope of this frame of time that the pilgrimage takes. So again, it's like that old Nazaretic vow that can be temporary. And so we set aside this time in order to give it to God so that we can receive something and bring it back home. One of the things that was told to me when I was on Mount Athos, I just suddenly had this thought which I just said out loud, which is not generally a good thing to do in a monastery, just to say your thoughts out loud. But I did nonetheless. We were being given a tour by one of the monks at the monastery we were at, and I said, you know, I suddenly feel sad for all the people that I know that would so much love to be here. You know, there I was on the holy mountain, and he said to me, well, God has sent you here. And he didn't mean just me, but the other people with me. He sent you here so that you can bring home what you received here. So you have a responsibility to the people where you live to give them what you're getting here. That's your responsibility. And the engagement that we have with asceticism, the engagement that we have with periods like Ren, with great Lent, it is precisely to serve this purpose of love. Ultimately, it's not a private spiritual experience. It's because, I mean, as the scripture says, if I have all these other glorious gifts but have not love, I'm nothing. I'm nothing."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11407.4,"end":11407.8,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11408.28,"end":11442.71,"speaker":"Fr Andrew Stephen Damick","text":"And so, fundamentally, a monastic should be one of the most loving people that there is. We tend to think of them as utterly separated from the world, but that's not really true, of course. They have the ministry of hospitality that they give, but also their prayers that they offer for the world, which are so needed. But then also the spiritual counsel, the advice, the experience that they give to those who come to them, it's invaluable. Invaluable."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11443.43,"end":11443.79,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11443.79,"end":11496.54,"speaker":"Fr Andrew Stephen Damick","text":"And so when we encounter people who are living this more intensified manner of ascetical living, then we can receive something like that from them. But also, then when we ourselves take on maybe just a tiny little bit that we're able for a brief period of time, then that needs to be something that's offered to other people. Not that I say, well, you know, I fasted on Wednesday and Friday this week, and that makes me a wise person who needs to give counsel to everybody. No, that's not what I mean. But it should make us serve our fellow men and women. And if we're not doing that, then we're kind of not doing it right. If we're not actually becoming more loving, then we're not doing it right. We're doing something else. And so that's kind of the collection of thoughts that I have about all the things that we've just been discussing. So, Father Stephen."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11499.1,"end":11501.1,"speaker":"Fr Stephen De Young","text":"After, briefly, I'm actually you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11501.42,"end":11502.3,"speaker":"Fr Andrew Stephen Damick","text":"Oh, go for it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11502.54,"end":11504.78,"speaker":"Fr Stephen De Young","text":"Lafayette, Louisiana, has the best of everything."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11505.27,"end":11508.95,"speaker":"Fr Andrew Stephen Damick","text":"Oh, excuse me. Well, you'll have to show me sometime, so."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11511.19,"end":11539.37,"speaker":"Fr Stephen De Young","text":"Yes, but beyond that. So what I want to talk about here at the end is built off of something I was trying to emphasize, like when it came to St. John the Forerunner and St. Anthony the Great, the idea of embodying something with the life we live, doing something by living a certain way."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11542.01,"end":11542.41,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11544.57,"end":11566.11,"speaker":"Fr Stephen De Young","text":"If you've studied philosophy a little bit, like if you took an Intro to Philosophy course at some point in college or something, or just watched most of them on the Internet, most of them lie to you, most of them have completely misinformed you about how ancient philosophy works. Worked, Right. What it was about."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11568.19,"end":11568.59,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11570.91,"end":11904.65,"speaker":"Fr Stephen De Young","text":"Philosophy was not about ideas in the ancient world. And almost every Intro to Philosophy course I've ever seen, and I haven't seen all of them by any means, but almost everyone I've ever seen in every Intro to Philosophy textbook treats ancient philosophy as a bunch of talking heads who come up with different ideas. In actuality, ancient philosophy was a way of life. Diogenes practiced a way of life and being in the world. Socrates practiced a way of life and being in the world. The Academy, the Platonists, had a way of life and being in the world. The Stoics, the Epicureans. Aristotle had a way of life and being in the world in his Peripatetic school. That's what it was about, right? And the ideas arose, and the ideas came to be framed out of and around that way of life. But it was a way of life and a way of being. And the reason we've been taught philosophy the wrong way is that for the most part, we've come to understand Christianity the wrong way. We've come to understand Christianity and specifically Christian theology as a bunch of talking heads who came up with ideas and are exchanging those ideas. And which of these ideas are correct and which ones are wrong, and how do we discriminate between them? And what kind of arguments are in court and ruled out of court, and how does that all work? And that's not how Christianity works. It's not ever been how Christianity actually works. Christianity is a way of life and a way of being in the world. And what it originally meant to be a Christian was to follow that way of life and that way of being. And so it wasn't like today where you just. Where we've sunken past, just, I am X because I believe XYZ to be true. Now it's I am X because I have chosen to identify today as X. And that's often coupled with, in our sort of post structuralist, postmodern world, with the idea that who I am is a story that I tell myself. I have this story I tell myself that's based on me taking events I remember from my life and casting them in a certain way to turn it into a story, into a single narrative line that brings me from some point in my past to today. I tell that story. That's who I am. Here's the problem with that. Tomorrow I can come up with another story with a different end result and therefore with a different identity for myself. And I don't even have to lie to myself to do it. Even though we all lie to ourselves to varying degrees all the time about who we are and our pasts and what we do. Without even lying to myself, I could tell two radically different stories about who I am by what details and what. What stories of my past I choose to tell and how I choose to string those. Those details together. I cannot consciously lie and be present myself as two completely different people, because none of those are who I am. None of those stories. Who I am is who I am today. Who I am. When you meet me, when you talk to me, that's who I am. And it's defined by a bunch of relationships between me and other people in the world and roles that I play and connections that I have and duties and responsibilities that I have and either fulfill or fail to fulfill. That's who I am. And that's located within a tradition and a way of being that you can describe as Orthodox Christian. And that's who I am. And so my goal as an Orthodox Christian, then, and as a priest is to, from day to day embody that identity by living and being that way in the world in terms of the responsibilities and relationships that entails and all of those things as I move forward. And part of the problem, I think, for us as modern people in understanding monasticism, Christian monasticism, is that Christian monasticism, as we saw tonight, I think, is so obviously just a way of life. Just here in scare quotes, right? So obviously a way of life and a way of being so obviously not about a bunch of ideas I have in my head, right? When you meet a Christian monastic, one who's established in the monastic life, right, and you're trying to determine who that monk is, there's no story that he tells himself, right? Who he is is a monk. Who he is is an embodiment of this way of life. And so coming from our perspective where we have this kind of protean self that can be defined and redefined."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11906.35,"end":11906.51,"speaker":"Fr Andrew Stephen Damick","text":"We."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":11906.51,"end":12148.88,"speaker":"Fr Stephen De Young","text":"Don'T know how to deal with something that's obviously so foreign. But once we come to understand, and I can only speak from the perspective of an Orthodox Christian, there's no view from nowhere as an Orthodox priest, what you start to understand when you understand what it means to be an Orthodox Christian, that it isn't assenting to a list of beliefs, it isn't even just an obedience to certain things, but a way of being in the world. You understand that monasticism is only in this case, quantitatively different, not qualitatively different from the life of any Orthodox Christian, that a Christian monastic is embodying within themselves the Orthodox Christian way of life and way of being in the world, just in a more deep and more full way than I probably am most of the time. That's not because I'm married. That's not because I'm not a monastic. Right? That's because the Orthodox Christian monastic has dedicated themselves in their entire life to living that out. And I still, like the Israelites who are onlookers on Mount Carmel, am hovering between two opinions. I still, on the one hand, there is a part of me that wants nothing more than to be an Orthodox priest and an Orthodox Christian and to embody that in the world and define salvation through that. There's another part of me that wants to be a cool guy, that wants to be. That wants to follow the things that interest me in culture, the things that I think are fun and enjoyable, that wants to embody something very different, some particular nerdy corner of American culture. And this isn't to say, right, that any of those things are bad, see the distinction we made about asceticism. But when the rubber meets the road and I decide to spend how I spend my time and how I spend my money and where I place my attention and where I place my affections, those things that are not evil in and of themselves can become that in my life because they can pull me away from who I really ought to be being, and therefore what I really ought to be doing. And so asceticism, as we practice it in Lent is really a call for all of us, me included, to refocus our attention, our efforts, our doing and our being toward who we are in Christ, who we've already been made in Christ, and who we're called to be in Christ, and away from all those other things competing to be embodied in and through us. And so if we want to have a successful Lent, that is exactly what what we need to do most of all, beyond following fasting rules, beyond just attending as many services as possible. Those other things are in service of the life in Christ that we're called to be and do in the world."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12152.3,"end":12169.91,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that is our show for tonight. Thank you very much everyone for listening. If you didn't happen to call us live, we'd still like to hear from you. You can email us@lordofspiritsancientfaith.com you can send us a message at our Facebook page, or you can leave us a voicemail@speakpipe.com."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12170.29,"end":12182.31,"speaker":"Fr Stephen De Young","text":"LordOfSpirits Join us for a live broadcast on the Central 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. Maybe not this next month. It might go weird places and gouge away."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12183.27,"end":12194.79,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, join our discussion group, leave reviews, ratings wherever appropriate. Most importantly, share this show with a friend that is going to benefit from it."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12194.95,"end":12206.4,"speaker":"Fr Stephen De Young","text":"And leave some reviews in inappropriate places too. Hey, and finally, be sure to go to Hoffaith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. You can stay all day if you want to."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12207.44,"end":12209.92,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. God bless you."}
{"episode_id":"LOS - #064 - 2023-03-23 - Samsonite","start":12223.52,"end":12260.82,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
