{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":0.32,"end":64.92,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord, Lord of Spirits."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":66.68,"end":88.12,"speaker":"Fr Andrew Stephen Damick","text":"Greetings dragon slayers, demon veins and gigantomachs. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. This is a pre recorded episode, so we're not going to be taking any live calls for this one, but we do have some voicemails from you that we're going to be including."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":88.68,"end":104.69,"speaker":"Fr Stephen De Young","text":"Well now if someone does through some kind of clairvoyant connection, realize that we're recording it and call the studio right now, I don't, as we're recording, I don't know what would happen and someone's there to pick it up. There is a chance."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":105.17,"end":105.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":105.73,"end":108.13,"speaker":"Fr Stephen De Young","text":"So I'm just going to put this vibe out into the universe."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":108.13,"end":110.33,"speaker":"Fr Andrew Stephen Damick","text":"So you're saying there's a chance you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":110.33,"end":116.53,"speaker":"Fr Stephen De Young","text":"Could, you could make a live call right now. It's, it'd be the only one somehow become aware of what I'm saying."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":118.37,"end":119.41,"speaker":"Fr Andrew Stephen Damick","text":"How long should we wait on that?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":120.05,"end":122.37,"speaker":"Fr Stephen De Young","text":"Oh, not wait, just going. If it happens."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":123.73,"end":143.56,"speaker":"Fr Andrew Stephen Damick","text":"So yeah, well, here in the United States, it's Thanksgiving. Or as the late archbishop of our archdiocese, Metropolitan Philip is said to have called it, the only American holiday they haven't ruined yet. So if you are one of our American listeners, I hope that it's truly a day of thanks for you and yours. As many of you probably know, ruin."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":143.56,"end":152.04,"speaker":"Fr Stephen De Young","text":"It every year by losing. I'm sorry about your shots fired Eastern Michigan. Eastern Michiganders. Shots fired."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":152.04,"end":156,"speaker":"Fr Andrew Stephen Damick","text":"I wouldn't have taken you as a sportsball fan, but you know, I learned new Things about you every day."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":156.32,"end":160,"speaker":"Fr Stephen De Young","text":"Well, how can you be a fan of the Detroit Lions, is what I'm saying. Anyway."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":161.92,"end":209.84,"speaker":"Fr Andrew Stephen Damick","text":"So as many of you listeners probably know, the word Eucharist, which is from the Greek evcharistia, it means Thanksgiving. And you can still hear it in the modern Greek, which simply means thank you. That's how they say thank you. And it's the Eucharist we're discussing on this Thanksgiving episode of Lord of Spirits. This is the second installment in our series on the holy mysteries of the Orthodox Church. So next to baptism, no sacrament of Christianity is probably more debated than the Eucharist. But what are its ancient roots as witnessed to in the Holy Scriptures? Why is it so important for most Christians? Is it a sacrifice or a meal? How does it relate to the Jewish Passover Seder? So this is some of what we're going to be discussing. So my first question for you, Father Stephen, is isn't it all just a symbol?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":212.64,"end":213.04,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":213.2,"end":216.8,"speaker":"Fr Andrew Stephen Damick","text":"No. I mean, you could have also said."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":216.8,"end":225.28,"speaker":"Fr Stephen De Young","text":"Yes, well, every time someone says the phrase just a symbol, Right. I think Pageau, wherever he is, gets triggered."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":227.3,"end":234.58,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, I was trying to work that into an angel gains its wings thing, but it wasn't working. The joke wasn't working out for me."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":234.74,"end":240.58,"speaker":"Fr Stephen De Young","text":"No, it's the opposite. Somewhere he just snapped a pencil in half. Right. Because he sensed that someone had."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":240.58,"end":249.62,"speaker":"Fr Andrew Stephen Damick","text":"He just knew that. Yeah. So, okay, well, if it's not just a symbol, then where. Where do we begin? Where do we begin?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":249.62,"end":255.82,"speaker":"Fr Stephen De Young","text":"Right. So. Well, we, as usual, go way back in time."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":257.5,"end":259.66,"speaker":"Fr Andrew Stephen Damick","text":"Is this a chettlehoyuk moment or."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":260.06,"end":261.18,"speaker":"Fr Stephen De Young","text":"Well, not that far back."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":261.18,"end":262.06,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":262.14,"end":279.19,"speaker":"Fr Stephen De Young","text":"But we don't always go that far back. But, you know, eventually we'll get to actually talking about the Eucharist. So we have to start with sacrifice and priesthood as such."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":279.43,"end":282.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because these things have something to do with each other."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":282.95,"end":317.89,"speaker":"Fr Stephen De Young","text":"Right. And we're not going all the way back because we already did an episode on priesthood as such, so we're not going all the way back to Adam as we did in that episode. We're just going to talk here about the beginnings of the Christian priesthood. And I know to some of our listeners, we know who we're talking about, the idea of a Christian priesthood is not an idea that they like."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":318.05,"end":323.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's the notion that priesthood is an Old Testament thing, and now we don't have that anymore."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":324.29,"end":352.07,"speaker":"Fr Stephen De Young","text":"Right, right. So what does it mean to talk about a Christian priesthood? Are we just saying that the priests you find in Orthodox churches today are just Sort of a direct continuation of the priesthood of the Tabernacle and the Jerusalem Temple."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":352.07,"end":354.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Aaron and all them."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":354.87,"end":378.64,"speaker":"Fr Stephen De Young","text":"Right. The Levitical priesthood. Right. The Aaronic priesthood answered no. Right. And in parallel to what we talked about last time when we were talking about baptism and the relationship between circumcision and baptism, it's also not just this sort of simple thing where like, well, there was that old priesthood and now there's this new priesthood that replaced it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":379.04,"end":384.73,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yes. There's continuities and discontinuities as you are wanted to say."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":386.65,"end":410.48,"speaker":"Fr Stephen De Young","text":"So there's a more complicated relationship there. And that relationship is actually very much parallel to what we said last time. But we will sort of further elaborate on that. But the place we have to start is that again, the Christian priesthood, the priesthood of the Christian church is not the Levitical priesthood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":410.72,"end":411.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":411.84,"end":472.55,"speaker":"Fr Stephen De Young","text":"They are not the same thing. These are two different things. But in a similar way to the way that we talked about last time, that St. Paul saw Gentile Christians as receiving the benefits of Christ's circumcision through baptism. We understand the Christian priesthood, this is based on Hebrews in particular as being a participation in Christ's priesthood. So the Christian priesthood is really Christ's priesthood which is participated in by human people who play a certain role within the Christian community."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":472.79,"end":484.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's not this sense that individual people have their own priesthood like that they are priests in themselves. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":484.59,"end":484.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":485.03,"end":486.31,"speaker":"Fr Andrew Stephen Damick","text":"Christ is the priest."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":487.36,"end":496,"speaker":"Fr Stephen De Young","text":"Right, Right. And this is reflected in a lot of little ways actually in orthodox practice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":496.08,"end":497.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":497.68,"end":516.9,"speaker":"Fr Stephen De Young","text":"So to give you one very everyday example that priests are all very intimately familiar with, but maybe other folks haven't noticed, when the bishop is around, Right. Is around your parish, the priest doesn't use his hand to bless anything."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":517.62,"end":520.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because he's just the stand in."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":521.94,"end":525.46,"speaker":"Fr Stephen De Young","text":"Right. But it's not just, it's not just because he's just the stand in."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":526.42,"end":526.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":527.14,"end":532.82,"speaker":"Fr Stephen De Young","text":"It's not just because of that. It's not just because the bishop outranks him, but it's because that blessing is Christ's blessing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":533.38,"end":537.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. So it's already available through the bishop. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":537.14,"end":556.19,"speaker":"Fr Stephen De Young","text":"So there's, there's one blessing and since it's Christ's blessing, the highest ranking clergyman gives Christ's blessing. But there's no need, for example, for, even though I've seen some people do this like go around and get five different blessings from five different priests who are standing around in a room."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":556.19,"end":588.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you know, which is just kind of an informal thing to do. But like if you Think about, for instance, in actual divine services. While you might, for instance, as some Russian liturgical practices want to do, send out a couple of deacons, both with censors, to do that synchronized sensing thing, there is not synchronized blessings given. You don't have a couple of priests or a couple of bishops, all stand out there and see, peace be to all, with their hands all moving at the same time. That's not a thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":592.11,"end":605.79,"speaker":"Fr Stephen De Young","text":"In the Orthodox Church, the hand position is actually based on a weird anagram, if you do it properly, which I can't because I have Nintendo thumb. But it's actually based on Christ's name."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":606.03,"end":606.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":606.91,"end":645.64,"speaker":"Fr Stephen De Young","text":"So to emphasize that it's Christ's blessing and this is part of what's going on with the cuffs and Orthodox vestments, we're going to talk about vestments more when we get to the ordination episode in this series on sacraments. But the cuff sort of isolating your hands, because they're not the priest's hands while he's serving. So this is indicated in these sort of practical ways. But so before we get to sort of our participation in Christ priesthood, we need to talk a little more about what Christ's priesthood is."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":646.36,"end":646.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":646.76,"end":658.97,"speaker":"Fr Stephen De Young","text":"Because we're talking about Christ's priesthood. But Jesus of Nazareth was not a priest on this earth in the sense of being part of the Levitical priesthood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":658.97,"end":663.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You don't see him going into the temple and putting sacrifices on altar and doing those things."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":663.57,"end":688.22,"speaker":"Fr Stephen De Young","text":"Right. So he was not. He had not a lot to do with the Sadducees, in fact, at least not positive interactions. So he was not a priest in that sense. Right. So with priesthood, every priesthood is constructed around a sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":688.78,"end":691.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's what a priest is as someone who offers a sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":692.38,"end":711.4,"speaker":"Fr Stephen De Young","text":"Right. And so, like, for example, in the episode where we talked about priesthood and we talked about, for example, the priesthood being taken away from the elders of the people and given to the Levites after the golden calf. Right. What was taken away and given to the Levites was the authority to offer sacrifices."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":711.72,"end":712.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":714.6,"end":732.92,"speaker":"Fr Stephen De Young","text":"Right. And as we said then, I think we have this very modern view that the priests of the Old Testament were like leading worship, which of course is not the case because they were in the tabernacle offering incense. The people didn't go in there."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":733.18,"end":736.62,"speaker":"Fr Andrew Stephen Damick","text":"I mean, they're not standing up there with a worship team and saying, okay, everybody sing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":737.66,"end":776.17,"speaker":"Fr Stephen De Young","text":"Right. They were not invited in. Right. To the inside of the tabernacle where they had a service. Right. Every week. Not how that worked. So the job of the Priest. The thing that the priest is designated for is to be the one who makes these sacrifices and offers these offerings. What makes the high priest the high priest is not just that he's like the boss of everybody, it's that he is responsible for fulfilling the particular role in the Holy of Holies on the day of atonement."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":776.57,"end":776.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":777.29,"end":796.64,"speaker":"Fr Stephen De Young","text":"So they're designated for this task and that task revolves around the offering of a sacrifice. So if we're going to talk about Christ's priesthood, what we, and we want to understand it, what we have to do is identify what is the sacrifice that Christ offers."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":796.72,"end":798.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":798.8,"end":800.8,"speaker":"Fr Stephen De Young","text":"And simply put, it's himself."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":801.76,"end":804.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not putting anything else on the altar."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":805.2,"end":810.12,"speaker":"Fr Stephen De Young","text":"Yeah. His priesthood is about his voluntary self offering, which."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":810.12,"end":814.88,"speaker":"Fr Andrew Stephen Damick","text":"That's a new thing. I mean, you don't get that in the Old Covenant."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":817,"end":817.92,"speaker":"Fr Stephen De Young","text":"Well, you sort of do."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":817.92,"end":822.04,"speaker":"Fr Andrew Stephen Damick","text":"I mean, not in the sense of you get priests putting themselves or."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":822.2,"end":827.48,"speaker":"Fr Stephen De Young","text":"Right, no, not literally. Right, yeah. You don't have priests like setting themselves on fire. Right. As a burnt offering."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":827.48,"end":841.16,"speaker":"Fr Andrew Stephen Damick","text":"And I don't think there's even, I don't think there's even within that Levitical priesthood. I don't recall any language in the Old Testament talking about those priests as offering themselves, even in a kind of analogous metaphorical way."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":841.85,"end":846.97,"speaker":"Fr Stephen De Young","text":"No, I mean there's, there's offering themselves as servants. Right. I mean, you could get to that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":847.29,"end":847.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":847.65,"end":852.53,"speaker":"Fr Stephen De Young","text":"But not in a sacrificial self offering sense for a priest."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":852.53,"end":853.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":854.49,"end":855.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":855.53,"end":856.65,"speaker":"Fr Andrew Stephen Damick","text":"But there's something else."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":858.01,"end":871.7,"speaker":"Fr Stephen De Young","text":"So. Yeah, so he's not, he's not a priest in terms of like the functional act of butchering an animal. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":871.86,"end":872.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":873.14,"end":891.62,"speaker":"Fr Stephen De Young","text":"Right. But he is a priest in making the offering. The offering is himself. Right. So he's the one who offers, the one who is offered at the same time. Right. I did not make that up."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":892.98,"end":896.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That is almost an actual quote directly from the Divine Liturgy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":899.29,"end":934.21,"speaker":"Fr Stephen De Young","text":"But we find this not just right, liturgically, but this, for example, is one of the major themes of St. John's Gospel is that sort of nobody can kill Jesus. People keep trying to kill Jesus, but he just slips away. He walks through the crowd sometimes. It just literally says that it wasn't his time yet, so they couldn't. And Christ himself says, eventually no one takes my life from me. I lay it down and I can take it up again."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":934.53,"end":936.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":937.65,"end":1020.04,"speaker":"Fr Stephen De Young","text":"And so St. John is really emphasizing this sacrificial element and that it's a voluntary self offering, that he's not like an innocent victim, but that he is offering himself actively. And as I alluded to, while there isn't precedent for a priest offering himself, there is precedent once we get into the Second Temple period of when you come to Jewish martyrs, which is a thing I think a lot of people associate, like martyrdom being this Christian phenomenon that starts with Christianity, it's not right. There were Jewish martyrs before that. When you get to that phase, you start seeing the beginning of this idea. We talked last time about how, from a Christian perspective, the things that we have in the Old Covenant are part of what that's doing. A big part of what that's doing is preparing Israel and then Judah Judea to receive the Messiah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1020.36,"end":1026.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's beginning to form them to be able to do this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1027.24,"end":1031.94,"speaker":"Fr Stephen De Young","text":"Right. To be able to receive it and understand. Right. Who he is and what he's doing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1031.94,"end":1036.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they'll have a framework in mind already that they can interpret what they're seeing through."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1037.86,"end":1054.98,"speaker":"Fr Stephen De Young","text":"Right. And so part of that. And you find this in Second Maccabees and Fourth Maccabees, there's a Fourth Maccabees, everybody's favorite books of the Bible, if they're even in your Bible. And Fourth Maccabees, That's a rare set of Bibles there."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1056.85,"end":1058.05,"speaker":"Fr Andrew Stephen Damick","text":"Whose canon is that in?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1059.25,"end":1064.13,"speaker":"Fr Stephen De Young","text":"It's in sort of in an appendix in the Slavonic."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1064.29,"end":1070.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Which. That's an interesting idea. What does it mean to be in a canonical."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1070.53,"end":1071.53,"speaker":"Fr Stephen De Young","text":"Well, exactly. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1071.53,"end":1073.05,"speaker":"Fr Andrew Stephen Damick","text":"But that's not what this episode is about."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1073.05,"end":1076.85,"speaker":"Fr Stephen De Young","text":"It's kind of at the edge of the canon. Somebody will write a book about that eventually."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1076.85,"end":1077.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1079.09,"end":1096.2,"speaker":"Fr Stephen De Young","text":"But Second Maccabees is a little more common. Second Maccabees you'll find in Roman Catholic Bibles, in the Orthodox study Bible, in, you know, Bibles produced in the UK that have, quote, unquote, the Apocrypha in them."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1096.28,"end":1096.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1097.48,"end":1134.31,"speaker":"Fr Stephen De Young","text":"The Deuterocanonicals, whatever they're called. So that. That's a little more findable. And both Second Maccabees and Fourth Maccabees are from different perspectives, talking about the same group of people, martyrs in this case. And so what happens is this is First Maccabees is sort of the history of the Maccabean Revolt and the beginning of the Hasmonean dynasty, sort of in. In history form. So it looks like first through Fourth Kingdoms, or First and Second Samuel, first and Second Kings."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1134.31,"end":1136.79,"speaker":"Fr Andrew Stephen Damick","text":"It's that kind of sort of chronicle style thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1137.75,"end":1145.59,"speaker":"Fr Stephen De Young","text":"Right. So Second Maccabees then sort of zooms in. Right. To tell sort of particular stories during that period."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1145.75,"end":1146.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1147.27,"end":1202.09,"speaker":"Fr Stephen De Young","text":"And so the most popular and most major story in Second Maccabees is about the Maccabean martyrs who. It's an elderly man, a mother and her seven sons who fall victim to the persecution of the Jewish people by the Seleucid monarchs who are trying to stamp out Judaism. And in particular, what they were doing was threatening people with torture and death if they weren't willing to violate. Weren't willing to violate the Torah and specifically to violate those parts of the Torah that marked them out as Jewish."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1202.41,"end":1203.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1203.53,"end":1205.93,"speaker":"Fr Stephen De Young","text":"That separated a Jewish person from a Greek person."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1205.93,"end":1212.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one of the big things that it ends up focusing on is eating pork or not."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1213.61,"end":1225.7,"speaker":"Fr Stephen De Young","text":"Right, right. And there's a little added layer to that beyond just eating pork. Right. Because the pork they're trying to get them to eat is not just like farm fresh bacon."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1226.66,"end":1234.7,"speaker":"Fr Andrew Stephen Damick","text":"Wait, was it sacrificed to idols? Yes, because pretty much meat in a pagan context is almost always in the same place."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1234.7,"end":1256.91,"speaker":"Fr Stephen De Young","text":"The pig was the primary sacrificial animal in Greek circles. That's where the pork that was in the meat market etc came from. Right. Was from these, these pagan temples. But either way. Right. This is something that a faithful Jewish person was not going to do."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1257.47,"end":1257.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1258.59,"end":1267.15,"speaker":"Fr Stephen De Young","text":"And so people like the Maccabean martyrs were willing to literally be tortured and die rather than violate the commandments of God."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1267.39,"end":1267.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1268.57,"end":1294.49,"speaker":"Fr Stephen De Young","text":"And this is part of why we talked a little bit last time about the circumcision issue that St. Paul faced. This is why the charges against St. Paul by his opponents were so serious in the book of Acts. Right. They were accusing him of telling Jewish people to violate commandments that people in their collective memory had literally died."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1294.89,"end":1295.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1295.13,"end":1296.21,"speaker":"Fr Stephen De Young","text":"Rather than violate."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1296.21,"end":1296.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1296.49,"end":1299.37,"speaker":"Fr Stephen De Young","text":"And he's now acting like they're not important from their perspective."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1299.37,"end":1299.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1299.77,"end":1314.25,"speaker":"Fr Stephen De Young","text":"Right. That's why there's this animosity and great repentance. And the final accusation against him in the Book of Acts, actually is that he brought Greeks into the temple. And specifically Greeks. Right. So it's, it's playing into this too."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1314.33,"end":1314.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1316.09,"end":1320.65,"speaker":"Fr Stephen De Young","text":"It's not Romans or Gentiles, it's specifically Greeks."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1320.65,"end":1323.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The people that had been martyring them not that long before."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1325.14,"end":1420.68,"speaker":"Fr Stephen De Young","text":"So this is very much in the mind of people, in the mind of the Jewish people, the people of Judea in the first century, in the background of what's going on in the Gospels and Acts. So when they were condemning the Romans, they were comparing the Romans to the Seleucid Greeks. But what you find in second And Fourth Maccabees. Fourth Maccabees tells the same story, but Fourth Maccabees is really kind of like wisdom literature. So it's sort of reflecting on the virtues of these martyrs and that kind of thing, but it tells the same story. And what you find in both of them is that when the time comes for these people to give up their lives and they offer sort of their final statements and their final prayers to God before being killed, that they use the language of offering themselves as a sacrifice, as an atoning sacrifice, as a sin offering on the behalf of the Jewish people, on behalf of their people. And so the idea of martyrdom and the idea of this kind of self offering and this sacrifice is there sort of in the background and continues to be. Right. So when you get to the Book of Revelation, the souls of the martyrs are under the altar in heaven."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1420.68,"end":1422.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1422.4,"end":1435.88,"speaker":"Fr Stephen De Young","text":"So there's still that kind of connection with martyrdom. So we of course see Christ's voluntary self offering as the fulfillment, the filling full of that idea."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1435.96,"end":1452.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, you see in the liturgical text for martyrs in the Orthodox Church, this idea is repeated over and like it's really a kind of a trope, you know, liturgically that that's what they do. They offer themselves as sacrifices."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1453.71,"end":1470.64,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. And our hypnography emphasizes, although sometimes in weird archaic English, but emphasizes over and over against no such thing, the voluntary nature."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1470.96,"end":1471.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1471.44,"end":1474,"speaker":"Fr Stephen De Young","text":"Of. I'm thinking of one hymn in particular."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1474.72,"end":1476.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Like, yeah, there's one."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1476.2,"end":1478,"speaker":"Fr Stephen De Young","text":"Christ took pleasure in ascending the cross."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1478,"end":1480.48,"speaker":"Fr Andrew Stephen Damick","text":"Took pleasure in ascending the cross, which makes it sound like he was like."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1480.48,"end":1483.88,"speaker":"Fr Stephen De Young","text":"Yes, this is going to be so great. Yeah, like he was having a great time."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1483.88,"end":1492.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it just, it just meant that he was, he was happy to do it. He was, you know, he was doing volunteers voluntarily willing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1492.55,"end":1498.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, he was willing according to his good pleasure means according to his will."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1498.11,"end":1498.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1500.03,"end":1510.99,"speaker":"Fr Stephen De Young","text":"As every Calvinist listener knows. And we must still have one or two, even though I've off put all of them many times. So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1511.23,"end":1511.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1511.55,"end":1548.11,"speaker":"Fr Stephen De Young","text":"This idea that this is a voluntary thing that Christ does, an offering of himself, his life, everything to his Father. So this is Christ's priesthood. And so if the Christian priesthood is going to be. Is going to be a priesthood, it has to be oriented around a sacrifice also."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1548.83,"end":1549.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1550.03,"end":1566.11,"speaker":"Fr Stephen De Young","text":"And if it's a participation in Christ's priesthood, then the sacrifice that's offered by the Christian priesthood has to be itself. The sacrifice has to be a participation in Christ's self offering."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1566.19,"end":1581.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not just an imitation of Christ's offering. Right. Because again, the priesthood is not something that people hold in and of themselves. So it's not like a Christian priest is someone who also sacrifices himself on the altar in any literal sense."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1581.4,"end":1581.68,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1581.68,"end":1590.36,"speaker":"Fr Andrew Stephen Damick","text":"I mean, metaphorically. Okay, but the one who is offered is Christ because he's the author or."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1590.36,"end":1594.12,"speaker":"Fr Stephen De Young","text":"Does a separate unrelated sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1594.68,"end":1594.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1595.56,"end":1597.96,"speaker":"Fr Stephen De Young","text":"Because then it would be a different priesthood than Christ's priesthood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1597.96,"end":1599.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1599.36,"end":1636.61,"speaker":"Fr Stephen De Young","text":"Because it would be centered on a different sacrifice. And so this is our sort of first point here about the Eucharist is that the Eucharist is not this sort of independent ritual thing, Right. Disconnected from Christ's sacrifice, Christ's voluntary self offering. Right. So I think, for example, the book of Hebrews makes this pretty clear. This is the whole idea of Christ as the high priest. Right. You don't have a high priest with no priesthood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1636.93,"end":1642.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's like being God of gods without any other gods or Lord of lords without any other lords."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1644.61,"end":1694.7,"speaker":"Fr Stephen De Young","text":"So. Right. Like really doesn't make sense. So I think many, many folks, some of whom may be in our listening audience, make the mistake, like when they understand that in Hebrews of assuming that the sacrifice that Hebrews talks about Christ offering in the heavenly places, which is himself. Right. They'd agree with us there. But the idea that, that now sort of obviates and removes any kind of participation in it, any actual sacrifice, any other priesthood on earth. Right. As if sort of. Well, it's really read this way. It's read this way that Christ sort of abolished the sacrificial system by taking it up into heaven with him."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1694.7,"end":1707.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's sort of one and done that. It's over now. He did what was needed. And I think that that stems out of satisfaction theology. Right. Well, God is now satisfied. So. Well, that's done. Thanks."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1708.22,"end":1712.62,"speaker":"Fr Stephen De Young","text":"Well, yeah, well, just about any atonement theory you can get that out of."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1712.78,"end":1714.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1714.62,"end":1719.18,"speaker":"Fr Stephen De Young","text":"You really can. I mean even like a Christus Victor type thing, you could say, well, yeah, Christ won."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1719.5,"end":1720.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1720.62,"end":1766.52,"speaker":"Fr Stephen De Young","text":"He's victorious, done now. Right. Excuse me. And that then breaks this connection. So you have a high priest with no priesthood underneath. Right. You have no longer any sacrifice. And that would mean then that there's not a direct way for humans living in the world now to participate in that sacrifice. It's now a historical and or heavenly thing with no material connector, except through, except in the past. And we'll get more into that in a little bit here in the second half actually."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1766.52,"end":1767.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1770.24,"end":1794.88,"speaker":"Fr Stephen De Young","text":"But for now, the point we're making is that the Eucharist, as the sacrifice around which the Christian priesthood centers, participates in Christ's self offering, which is a single event, which is both an eternal heavenly event that Hebrews talks about and an event that happens on earth at a particular point in time."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1794.96,"end":1795.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1795.84,"end":1832.58,"speaker":"Fr Stephen De Young","text":"In the realm of human experience. That the Eucharist participates in that just as the Christian priesthood participates in Christ's priesthood, that those are linked directly. Now, that said, as we talked about in the priesthood episode within Christian communities, priesthood and eldership, you could say, or the presbyterate. Right. Are reunited."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1832.98,"end":1834.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1835.06,"end":1853.22,"speaker":"Fr Stephen De Young","text":"So when, as we just referred to again after the incident with the golden calf, the priesthood is taken away from the elders of the people. Right. The presbyters of the people in the Greek translation, and given to the Levites. The elders of the people remain the elders of the people."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1854.42,"end":1855.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1855.7,"end":1859.21,"speaker":"Fr Stephen De Young","text":"But they lose the priesthood, the offering of the sacrifices."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1859.21,"end":1861.93,"speaker":"Fr Andrew Stephen Damick","text":"So it gets split out. Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1861.93,"end":1889.58,"speaker":"Fr Stephen De Young","text":"And as we talked about, that gets reunified. Right. In Christ. So that means the Christian priesthood, the. The priest, while his role as priest folk centers around the Eucharist, he also has the role of presbyter in the. Right. And that's our primary title, actually. Although priest is in English is derived from that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1889.82,"end":1898.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's a weird thing in English that both presbyter and priest derive from the ancient Greek word presvitros, but it is the case."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1899.9,"end":1936.98,"speaker":"Fr Stephen De Young","text":"Right, but so this, this elder role is still there. That's part of where the father title comes from. Right. We talked about that more in that other episode. So what more can we sort of say about Christ's priesthood? Well, the elephant in the room on Christ's priesthood. The elephant in the room in terms of the entire New Testament standing in the background. And I know we've said this on the show before, is Psalm 110 or 109 in the Greek, which is the most cited text in the New Testament."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1937.24,"end":1944.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is where we get that line, the Lord said to my Lord, sit thou at my right hand, until I make thine enemies the footstool of thy feet."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1944.6,"end":1945.88,"speaker":"Fr Stephen De Young","text":"Right. That's verse one."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1945.88,"end":1947.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1947.64,"end":1985.97,"speaker":"Fr Stephen De Young","text":"That gets quoted a lot. Right. If you're familiar with the New Testament, you probably think of examples. But the next verse is important too, which is you are a priest forever, according to the order of Melchizedek. And the you, the Lord Yahweh, the God of Israel, is still the one talking, and he's still talking to the person who David calls my Lord. And not just from the New Testament, but from other Second Temple literature, we could tell that pretty much everybody understood that the my lord in Psalm 110 was the Messiah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1986.77,"end":1992.63,"speaker":"Fr Andrew Stephen Damick","text":"So the Messiah is not only Lord, but also a priest forever, according to the order of Melchizedek."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":1993.42,"end":2049.04,"speaker":"Fr Stephen De Young","text":"Right. And Melchizedek. See, our Melchizedek episode was both the king and high priest of Jerusalem. So the order or the pattern, the mode of Melchizedek is referring to this, that he is the Messiah by being the Messiah is the king. Right. And he's also a priest. Right, he's also a high priest. And this is what Hebrews does in terms of Christ's priesthood and his high priesthood. Right. And so the major disjunction between this kind of priesthood and the Levitical priesthood, as Hebrews points out, is not it being reunified with kingship."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2049.76,"end":2050.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2051.2,"end":2069.68,"speaker":"Fr Stephen De Young","text":"That's not the major disjunction. Right. I mean, that's true. These were split with Moses and Aaron as we've talked about, and they're right. Recombined in Christ as we've talked about. But the major disjunction is that the priesthood of Melchizedek is not a hereditary priesthood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2070.28,"end":2074.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We don't see the sons of Melchizedek. I mean, like that's just. We just see Melchizedek as this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2074.92,"end":2076.64,"speaker":"Fr Stephen De Young","text":"There aren't any priests. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2076.64,"end":2077.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2077.16,"end":2083,"speaker":"Fr Stephen De Young","text":"This is why Hebrews talks about he doesn't have a father, he doesn't have a genealogy, he doesn't have a. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2083.16,"end":2083.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2084.12,"end":2147.04,"speaker":"Fr Stephen De Young","text":"So you look at Chronicles, right. You look at Ezra and these huge genealogies of all the priests and Levites and the different groups who did different things in and around the temple. Right. Hebrews is pointing, saying, well, you know, Melchizedek doesn't have a genealogy at all. So it comes from nowhere, disappears to nowhere. Right. So this lack of a hereditary link is the major disjunction. And so what does that mean? How does this priesthood then get handed down? And this is why the concept of apostolic succession becomes so important. Right. Within the Orthodox Church, well, within the Christian Church in general, is because just like in the Old Covenant, no one can sort of take the title or role of priests upon themselves voluntarily."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2147.36,"end":2149.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No one's self ordained."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2150.48,"end":2163.87,"speaker":"Fr Stephen De Young","text":"Right, yeah. We don't get self ordained people. We don't have a guy just decide to go start a church. Right. And make himself the pastor of the church. Right. This doesn't happen in the. Well, it does happen. Those are called heretics in the early church."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2163.87,"end":2180.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's also in some ways a kind of a confusion of the role of priest and prophet too. You know, prophets are called directly by God. But it's interesting, God doesn't do that with priests. There's always a line, you know."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2181.07,"end":2186.73,"speaker":"Fr Stephen De Young","text":"Right, right. And so this line is not hereditary, despite what happens in some Greek villages. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2187.85,"end":2200.97,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know. Sure. You know, there are fathers and sons who are priests. I actually know a priest who's like a 13th or 14th generation priest, which is amazing. But that's not. It's not a given, you know."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2201.05,"end":2207.13,"speaker":"Fr Stephen De Young","text":"Right, right. But what we see is, right, Christ chooses his apostles."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2207.61,"end":2208.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2208.41,"end":2231.04,"speaker":"Fr Stephen De Young","text":"His disciples and apostles. He makes them apostles by sending them out. Right. And then they choose the deacons in Acts. They choose presbyters as they go out and form these Christian communities. They choose the next generation of bishops, which we see with, for example, St. Paul and St. Timothy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2231.92,"end":2232.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2232.24,"end":2244.33,"speaker":"Fr Stephen De Young","text":"And then that next generation of bishops chooses the next generation of presbyters and deacons, and then they consecrate the next generation of bishops and so on and so on down to the present day."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2244.49,"end":2245.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2246.25,"end":2255.05,"speaker":"Fr Stephen De Young","text":"Right. And so you do have a line. You do have a tree, but it's a tree formed by the laying on of hands, not by biological descent."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2255.21,"end":2257.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2260.49,"end":2284.86,"speaker":"Fr Stephen De Young","text":"And it goes ultimately back to Christ choosing the apostles. But so that's how you have that kind of tree without it being hereditary and also without it being people arrogating titles to themselves. Right. We can't stop people from doing that, but we can not recognize it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2285.1,"end":2285.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2285.54,"end":2294.62,"speaker":"Fr Stephen De Young","text":"Right. You can call yourself the Grand Mufti if you want to, but I can't stop you. But no one else will recognize that claim."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2296.43,"end":2299.55,"speaker":"Fr Andrew Stephen Damick","text":"Are you saying an ordination to the Universal Life Church doesn't count?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2301.87,"end":2304.71,"speaker":"Fr Stephen De Young","text":"Not according to the state of Pennsylvania, if you want to marry somebody."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2304.71,"end":2311.63,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really? Actually, I've never even looked into that. That's pretty fun. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2313.15,"end":2334.04,"speaker":"Fr Stephen De Young","text":"So, yeah, first church of the Light of Elvis. I think they could only practice in Vegas. So all that said. Right. We do have to spend at least a little bit of time on this idea that the Eucharist even is a sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2334.2,"end":2338.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because this is a big point of contention, especially around the Reformation."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2339.4,"end":2343.16,"speaker":"Fr Stephen De Young","text":"Yes, yes. In the 16th century, this becomes a big deal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2343.56,"end":2345.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2346.77,"end":2356.93,"speaker":"Fr Stephen De Young","text":"But biblically, there's not really a way around this. Yes, there just isn't."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2357.01,"end":2362.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It turns out that St. Paul explicitly makes this linkage."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2364.05,"end":2378.86,"speaker":"Fr Stephen De Young","text":"So I had a journal or article on this published by Rule of Faith that you can go look at online. I'm not going to rehearse all that here, especially the footnotes. But if you're a fan of footnotes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2379.02,"end":2380.54,"speaker":"Fr Andrew Stephen Damick","text":"Wait, wait, you have footnotes?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2381.5,"end":2450.51,"speaker":"Fr Stephen De Young","text":"Yeah. I was told that you have more. I have more than 600 footnotes in my dissertation. Full of excitement. But when we read 1 Corinthians 10, 14, 22, this is part of. In 1 Corinthians, St. Paul's discussion of the Eucharist, 1 Corinthians is the major place where he discusses the Eucharist. And because this was written before the Gospels were written, this is actually the earliest discussion of the Eucharist as such that we have in the New Testament in terms of when it was written. And so in chapter 10, verses 14 through 22, he's actually at this. So he segues back and forth between a couple of topics in this whole section of first Corinthians, those two main topics being, hey, don't eat food offered to idols."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2451.16,"end":2452.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2452.08,"end":2458.36,"speaker":"Fr Stephen De Young","text":"And here's 18 reasons why, on the one hand. And then on the other hand, talking about the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2458.36,"end":2460.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because these things are linked."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2461.32,"end":2463.52,"speaker":"Fr Stephen De Young","text":"These things are linked. And he makes that link explicit here."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2463.52,"end":2465.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're either on team God or team demons."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2466.36,"end":2466.84,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2467.32,"end":2523.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Okay, so First Corinthians, chapter 10, verses 14 through 22. Therefore, my beloved, flee from idolatry. I speak as to sensible people. Judge for yourselves what I say. The cup of blessing that we bless, is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ? Because there is one bread, we who are many are one body, for we all partake of the one bread. Consider the people of Israel are not those who eat the sacrifices participants in the altar. What do I imply, then? That food offered to idols is anything, or that an idol is anything? No, I imply that what pagans sacrifice, they offer to demons and not to God. I do not want you to be participants with demons. You cannot drink the cup of the Lord and the cup of demons. You cannot partake of the table of the Lord and the table of demons. Shall we provoke the Lord to jealousy? Are we stronger than he little threat there at the end?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2527.44,"end":2528.72,"speaker":"Fr Stephen De Young","text":"Yeah. Good luck."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2528.72,"end":2529.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2529.2,"end":2534.29,"speaker":"Fr Stephen De Young","text":"You ought to fight it out with God. Good luck. Yeah, yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2534.29,"end":2543.77,"speaker":"Fr Andrew Stephen Damick","text":"Especially verse 18 there. Right. Consider the people of Israel are not those who eat the sacrifices participants in the altar, which is not the same word."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2545.21,"end":2603.13,"speaker":"Fr Stephen De Young","text":"Right. It's participation in the blood of Christ. Participation in the body of Christ partake of the one bread, participants in the altar. It's the same word. It's kinonia in Greek, various forms. Right. And the same thing with participants, with demons later on. Right. So St. Paul here very clearly, when he's trying to describe sort of how the Eucharist works or what it does. Right. His immediate comparisons. Right. To teach them. Because what they don't know about is the Eucharist. They know about, oh, there's sacrifices that go on at the Temple of Jerusalem. They know about pagan sacrifices. They live in Corinth, for Pete's sake. Right. They know what goes on there. Right. And so he's saying this works just like that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2605.45,"end":2606.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2606.01,"end":2610.09,"speaker":"Fr Stephen De Young","text":"So Paul is very clearly and directly saying the Eucharist is a sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2610.98,"end":2611.38,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2612.66,"end":2699.15,"speaker":"Fr Stephen De Young","text":"Like the sacrifice that happens on the altar at the temple in Jerusalem, which was still in operation at this point. Like the sacrifices to demons that go out in those pagan temples. Right. In the same way. Right. The Eucharist is a sacrifice. And in the same sense, not in a metaphorical sense. He's not making a metaphorical comparison. It's a direct comparison. And this is again the earliest written thing about the Eucharist. It's from that letter. So there are a bunch of distinctions that have come up since the 16th century to try to dissociate. And the reason, for the record, that we're saying Reformation and that kind of thing is that this isn't a Protestant thing per se, because our Lutheran friends have. Priests, have an altar, see the Eucharist as a sacrifice. Right. At least some number of our Anglican friends too. There's a lot of diversity in the Anglican community, shall we say?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2699.15,"end":2699.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2700.87,"end":2716.79,"speaker":"Fr Stephen De Young","text":"But at least there is at least a strong tradition there of seeing things that way. So this isn't just Protestantism. This is really a particular thread of Protestantism that really, frankly, kind of get started with John Calvin."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2716.95,"end":2717.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2717.75,"end":2740.23,"speaker":"Fr Stephen De Young","text":"But since in the United States. The United States is just Protestant, the culture is deeply Protestant and not just Protestant, but Puritan. And insofar as Puritan, Calvinist, this is a very common thread in American evangelical Protestantism, should we say."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2740.42,"end":2746.26,"speaker":"Fr Andrew Stephen Damick","text":"Which is why I started out with my half joking question. Isn't it just a symbol?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2746.82,"end":2747.3,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2747.46,"end":2750.02,"speaker":"Fr Andrew Stephen Damick","text":"It doesn't just stand for something else."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2750.98,"end":2768.91,"speaker":"Fr Stephen De Young","text":"Right. And so to try to get away from the idea of sacrifice, altar, priesthood with the Eucharist, there are a number of distinctions that get made that are frankly not distinctions you can make biblically."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2769.07,"end":2770.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2771.23,"end":2784.91,"speaker":"Fr Stephen De Young","text":"They're not there in the Bible. I mean, you could certainly make distinctions in speech, theologically. Right. But sola scriptura, you know, they're."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2785.23,"end":2793.07,"speaker":"Fr Andrew Stephen Damick","text":"The question possible. The question is, you know, is the distinction you're making consistent with what's in the Scripture, even if it's not found in the Scripture?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2793.72,"end":2811.72,"speaker":"Fr Stephen De Young","text":"Right, right. And so, for example, you get. Well, when Christ institutes the Eucharist, he says, as it's usually translated in English, not coincidentally, do this in remembrance of me. So he calls it a remembrance or a memorial."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2812.52,"end":2813.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2813.24,"end":2838.39,"speaker":"Fr Stephen De Young","text":"Right. And see, that's not a sacrifice, it's a memorial. But as is my want, I refer people to Numbers 10, verse 10 in the Septuagint, where the same Greek word memorial is used to refer to the sacrifices on the Feast of Trumpets."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2838.55,"end":2842.79,"speaker":"Fr Andrew Stephen Damick","text":"So sacrifices are then by definition, memorials. There's not."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2842.79,"end":2843.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2843.75,"end":2848.43,"speaker":"Fr Andrew Stephen Damick","text":"One thing is a sacrifice and another is a. This will help you to think about this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2849.31,"end":2853.47,"speaker":"Fr Stephen De Young","text":"Right. So calling it a memorial does not mean not a sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2853.47,"end":2853.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2853.83,"end":2856.43,"speaker":"Fr Stephen De Young","text":"I mean, in fact, it may very well mean sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2856.51,"end":2879.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, and so thus you get all this language in there of remembering someone before God that doesn't mean to stand before God and say, yeah, I remember him, you know, or, you know, or even like God. Let me remind you about. About Brother Robert, you know, in case you forgot. Yeah. That's not what that is. It's really about a sacrifice on behalf of someone else."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2880.2,"end":2914.85,"speaker":"Fr Stephen De Young","text":"Yeah. An offering. Yeah. So you also get this distinction made between an altar and a table. So a lot of churches, right, they don't want to call it an altar. They'll have a table where, however often they do the Eucharist, we'll get to not wanting to call it the Eucharist here in a minute. But they'll call it a table. Right. Instead of an altar. And the problem is this is literally the same word."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2915.25,"end":2915.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2916.05,"end":2933.37,"speaker":"Fr Stephen De Young","text":"In most ancient languages up to it, including Latin, ara means both table and altar. And you could just look back at 1st Corinthians 10:14 through 22 that we just read. Right. You cannot partake of the Table of the Lord and the Table of Demons."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2934.57,"end":2935.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2935.21,"end":2939.05,"speaker":"Fr Stephen De Young","text":"What's the Table of Demons he's referring to? Well, clearly a pagan altar."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2939.13,"end":2939.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2941.93,"end":2944.25,"speaker":"Fr Stephen De Young","text":"So he can switch back and forth between altar and table."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2946.01,"end":2953.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a table. There's an altar to God and there's an altar to demons. Don't worship the wrong one."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2954.46,"end":2979.69,"speaker":"Fr Stephen De Young","text":"And the altar to God could also be called the Table of the Lord, and the altar to demons could be called the Table of Demons. So there's not a distinction there. And relatedly, you get. And we did our three part thing on sacrifice where we kind of took this apart, but this distinction between a sacrifice and a meal. Sacrifices were meals for the most part."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2979.77,"end":2981.53,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. That's what they are."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2982.49,"end":2994.49,"speaker":"Fr Stephen De Young","text":"Yeah. So again, that's a non starter. Right. In terms of saying it's a meal, not a sacrifice, that literally would not make sense to any ancient person."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2994.73,"end":2998.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like saying it's Thanksgiving dinner, not a meal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":2999.05,"end":3038.3,"speaker":"Fr Stephen De Young","text":"Yeah, that's what it said. There was a. That's a type of meal. Right. Yeah. So, yeah. So these distinctions aren't really supportable. Right. And what caused them really. Right. There are things, when you look at the Protestant Reformation, there are a lot of things that make sense in the 16th century."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3038.7,"end":3043.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that as orthodox Christians we can have a certain level of empathy with."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3044.46,"end":3086.31,"speaker":"Fr Stephen De Young","text":"Right. So if you're in the 16th century and the Church of Rome has supposed writings of church fathers and things like the donation of Constantine that are forgeries. Right. But nobody's sure and nobody can prove what's real and what's a forgery from the Church fathers. And the Latin Vulgate has over time changed in various ways and Latin words have changed their meanings in various ways. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3086.55,"end":3087.91,"speaker":"Fr Andrew Stephen Damick","text":"That's all languages do."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3088.47,"end":3120.7,"speaker":"Fr Stephen De Young","text":"Right. And Martin Luther comes along and says, hey, you know what, we can't be sure about any of this stuff. Right. How far back it goes. The only thing we can be sure about is, hey, we've got this Greek New Testament that we got from refugees from Constantinople, and we've got the Hebrew Old Testament that we got from the local Jewish community. And we know that Rome hasn't messed with either of those because they haven't had access to it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3120.7,"end":3121.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3121.02,"end":3128.1,"speaker":"Fr Stephen De Young","text":"To mess with it. So that's the only thing we can trust. And we need to base all of our theology on that. You can kind of understand that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3128.1,"end":3131.1,"speaker":"Fr Andrew Stephen Damick","text":"The 16th century, sure. Yep. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3132.78,"end":3193.45,"speaker":"Fr Stephen De Young","text":"But when we get to the 21st century and we know which of those documents are fake and which ones aren't, and we could look at the textual history of not only the Latin Vulgate, but of the Greek, of the Hebrew. Right. And we have all this available to us, there's no reason for us to sort of be stuck in the 16th century and not just say, hey, the 16th century got it right for the 16th century, but they got it right for all time. There will never be a point in the future where we are able to do any better than the 16th century. We will never be able to have a better biblical translation than the 1611 King James. Anyway, but no knowledge will ever surpass or move us past the sort of scholarly consensus of the 17th century reform scholastics. They nailed it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3193.82,"end":3201.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a kind of perfectly arbitrary thing to pick, you know. Right, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3201.74,"end":3221.43,"speaker":"Fr Stephen De Young","text":"So. And when it comes getting narrowing back in on our topic, Right. From those other examples, what you really find here is this kind of reactionary position against abuses that were going on in the mass in the 16th century in the West."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3221.59,"end":3244.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like the idea, for instance, you know, built upon that whole system of purgatory and indulgences and merits and so forth. The idea that offering the Mass can give a certain number of indulgences to people in purgatory, that was one of the things that was the practice and was the understanding."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3246.24,"end":3267.44,"speaker":"Fr Stephen De Young","text":"Right. And some of these sort of weird eucharistic miracles to emphasize transubstantiation, where you have eucharistic hosts turning into human flesh and wine, turning it visibly and to taste and everything turning into blood."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3268.56,"end":3268.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3268.88,"end":3270.32,"speaker":"Fr Stephen De Young","text":"Or bleeding hosts."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3270.48,"end":3270.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3271.32,"end":3295.32,"speaker":"Fr Stephen De Young","text":"Or some of these kind of things. Or any number of other sort of excesses. Just the whole idea of the Mass as a repeated propitiatory sacrifice. Right. There are things there going on that you could understand why you'd want to correct them from an orthodox perspective."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3296.04,"end":3296.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3297.08,"end":3315.56,"speaker":"Fr Stephen De Young","text":"And the Counter Reformation corrected some of them. Right. That's within the Roman Church. Right. But this reactionary position was assumed. Right. So not only is this not a repeated propitiatory sacrifice, this isn't a sacrifice at all."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3315.96,"end":3321.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Insert not only water comment."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3322.69,"end":3368.78,"speaker":"Fr Stephen De Young","text":"Yeah. On and on and on. Right. And so this reactionary position was assumed that for the sake of debate, for the sake of working toward correction of abuses. Right. You can under someone taking a more extreme stance. But again, that stance then being set in stone for all time doesn't make sense. Still having that reactionary stance of the 21st century, when there are much older understandings of the Eucharist, much more biblical understandings of the Eucharist that are neither that reactionary position nor the abuse you were worried about."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3370.06,"end":3402.45,"speaker":"Fr Andrew Stephen Damick","text":"I mean, a lot of it is founded on this idea that they had discovered, they had rediscovered the biblical Christianity. And so when you believe that you found it again, then it makes sense. Then you're like, okay, we're back. This is it. So I mean, I get it on the one hand, I get it, but a lot of this stuff becomes untenable, especially when so many of those reactions are based on the limited information simply available at the time."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3403.25,"end":3421.65,"speaker":"Fr Stephen De Young","text":"Yeah. And speaking from personal experience, as a Kid, the. The warning sign of this, that you might still be holding to an old reactionary position is if part of your Christian identity as a Protestant is being not Catholic."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3421.97,"end":3424.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is totally a thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3424.29,"end":3447.66,"speaker":"Fr Stephen De Young","text":"Still, for a lot, that's a warning sign because our identity as Christians should never be based on what we're not. It should be based positively on what and who we are and who we worship and who we follow. Right. And so it's always. And I'm not just picking on Protestants here."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3447.66,"end":3448.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3448.06,"end":3463.27,"speaker":"Fr Stephen De Young","text":"Like, if you're a Roman Catholic listener and part of your identity is that you're not Protestant, that's equally problematic if you're an Orthodox listener and part of your sense of yourself as an Orthodox Christian is I'm not a Protestant, that's also a problem."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3463.91,"end":3466.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or not a Catholic or not a. Whatever."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3466.91,"end":3474.95,"speaker":"Fr Stephen De Young","text":"Yeah. Or not a Roman Catholic or whatever. Right. You're in a reactionary position, and that's by definition not balanced and not healthy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3474.95,"end":3477.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3479.59,"end":3483.52,"speaker":"Fr Stephen De Young","text":"So now that I've bashed everyone, I."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3483.52,"end":3489.28,"speaker":"Fr Andrew Stephen Damick","text":"Thank thee, Lord, that I'm not like those other Orthodox who say that they're grateful they're not Protestants or Catholics."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3490.72,"end":3500.24,"speaker":"Fr Stephen De Young","text":"I define myself entirely on not being Father Andrew, which is why it galls me so much when people online think we're the same person."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3500.32,"end":3506.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, we covered this in episode one, like, literally within the first five minutes, if I recall correctly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3510.03,"end":3536.56,"speaker":"Fr Stephen De Young","text":"So. Yeah. So in terms of then the Eucharist as a sacrifice, we talked about how it's a participation in Christ's sacrifice, but along with that, we see within the Eucharist a certain gathering up of the regular Old Testament sacrifices."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3536.56,"end":3542.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which has this whole system of different kinds of sacrifices for different purposes and so forth."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3542.4,"end":3544.88,"speaker":"Fr Stephen De Young","text":"See our episodes on sacrifices."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3544.88,"end":3545.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3546.16,"end":3552.68,"speaker":"Fr Stephen De Young","text":"And also read Father Jeremy Davis's excellent book, Welcoming Gifts."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3552.68,"end":3557.28,"speaker":"Fr Andrew Stephen Damick","text":"There you go. This may be one of the most referential episodes we've ever done from ancient fate."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3557.36,"end":3561.9,"speaker":"Fr Stephen De Young","text":"Yes. All we're going to do is reference past episodes. Episodes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3561.9,"end":3564.22,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Just a big bibliography episode."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3564.3,"end":3609.23,"speaker":"Fr Stephen De Young","text":"It's purely a transitional three to five hours now. People are going to check the timestamp and see if we can get worried. So two of these types of offerings are part of that participation in Christ's sacrifice. So we have the regular cycle of sin offerings, sometimes translated guilt offerings, which is for forgiving sins in the Old Testament. And we need to be clear."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3610.67,"end":3611.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3612.59,"end":3620.75,"speaker":"Fr Stephen De Young","text":"As we were in that episode. Right. There is no substitution, let alone penal substitution, going on in sin offerings."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3620.99,"end":3631.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because if there were, that would mean that God is taking out his wrath on wheat cakes instead of on you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3633.31,"end":3638.03,"speaker":"Fr Stephen De Young","text":"So often it was wheat cakes. And no animal died in the making of this sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3638.03,"end":3661.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. That's the problem is if you're going to make it about penal substitution and that it's the death of an animal, then that means you need to have an animal dying every time, which you don't. And it also means that the killing should be ritualized because if it's the critical part, then there should be a ritual killing. But it's kind of just a, like, make sure you take it out of the package kind of thing, you know?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3661.83,"end":3679.32,"speaker":"Fr Stephen De Young","text":"Right, right. You're not going to eat it without killing it first. But also, and this is important for the penal part of the penal substitution. The penal part involves suffering and the animals were never made to suffer."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3679.4,"end":3685.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not a ritual beating the animal or strangling it or blinding it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3688.6,"end":3728.92,"speaker":"Fr Stephen De Young","text":"But so this element, this is something we see in Christ's voluntary self offering. And so the Eucharist is a participation in that. The next one is also taking him with Christ Sovereign. That's what's called the peace offering. And those are. We talk about these much more in those previous episodes. But this is a sacrifice that's offered after estrangement. So humans have become estranged from God and they make this offering and eat this meal to restore a peaceful relationship."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3729,"end":3731.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Let's get together and reconcile."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3731.8,"end":3737.96,"speaker":"Fr Stephen De Young","text":"Right. And this is not an offering that represents the end of God being mad at them."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3738.44,"end":3738.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3738.84,"end":3740.68,"speaker":"Fr Stephen De Young","text":"Because God does not lose the bad things they did."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3741.16,"end":3742.28,"speaker":"Fr Andrew Stephen Damick","text":"God does not lose it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3743,"end":3745.56,"speaker":"Fr Stephen De Young","text":"Right. This is the end of their rebellion."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3746.04,"end":3746.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3747.24,"end":3772.9,"speaker":"Fr Stephen De Young","text":"Right. So this is. Your kid has done a bunch of stuff that's been ticking you off all day and they kind of feel bad about it. And so they draw you a picture and come and present it to you with a big smile as an offering. Right. You are not going to like kill your kid if he didn't do that. Right. But it is good."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3773.7,"end":3774.82,"speaker":"Fr Andrew Stephen Damick","text":"Although you might say that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3776.42,"end":3785.01,"speaker":"Fr Stephen De Young","text":"Well, you know, I don't personally have kids, so maybe you guys do fly into murderous rages. Rats. But I don't have that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3785.01,"end":3787.17,"speaker":"Fr Andrew Stephen Damick","text":"I have not killed any of my children and I."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3789.97,"end":3806.21,"speaker":"Fr Stephen De Young","text":"The threat has to always be there. So. And then the other major category of offering, and this is the category into which the Eucharist itself falls."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3806.53,"end":3806.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3806.93,"end":3820.38,"speaker":"Fr Stephen De Young","text":"Right. Like Eucharist as such, literally True. As opposed to by participation. Eucharist literally is a thank offering. That's why it's called the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3820.38,"end":3822.86,"speaker":"Fr Andrew Stephen Damick","text":"Right. As we Started off, that's what the name means."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3823.66,"end":3834.14,"speaker":"Fr Stephen De Young","text":"Right. And within thank offerings, right. In the Old Testament, the two basic ones are grain offerings and drink offerings."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3834.94,"end":3835.66,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3836.43,"end":3839.39,"speaker":"Fr Stephen De Young","text":"You could kind of see how that works, right? How that fits."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3839.63,"end":3840.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3841.87,"end":3932.3,"speaker":"Fr Stephen De Young","text":"And this is why, especially in the past, while still with the bread today, often in Orthodox churches, but in the past with the bread and the wine and even the water that was used, those were brought to the church by people. Right. Often bread still is in Orthodox churches, but it was all of those things were brought every time by the people as an offering to use in the Eucharist. So as we said, Christ's self offering sort of fulfills, fills full. Right. Is the ultimate example of all of these sacrifices. The Eucharist participates in it. And through the Eucharist, we then participate in it. And this is why we've used the phrase before that in the Eucharist, we come and we offer bread and wine that we've brought. We offer this thank offering, this grain offering and drink offering, and we receive Christ in return. Christ not only offers himself to the Father, but he offers himself to us, which brings us peace and reconciliation and brings to us the remission of sins."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3932.38,"end":3949.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's all, all brought together in Christ in every direction. I mean, that's just fascinating. That's really, it's. It's a little mind bending, right, that he's the offer and the offering, the one. I can't remember the exact line now from the liturgy, you know, that he's the one."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3949.54,"end":3956.66,"speaker":"Fr Stephen De Young","text":"You offer the offering. The acceptor or recipient."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3958.26,"end":3964.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He receives the offering, he gives the offering. He is the offering. He's the one being distributed."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3965.86,"end":3966.26,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3966.58,"end":3977.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Everything is Christ within this context. All right, well, that's our first half. We're going to go ahead and take a short break and we will be right back."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":3978.04,"end":3995.8,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4001.08,"end":4003,"speaker":"Fr Stephen De Young","text":"Introducing a new book from."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4003,"end":4057.51,"speaker":"Audience Member","text":"Ancient Faith Publishing, Healing Work giving humanity a second chance. Written by Joshua McCool, Healing Work is essentially a how to guide to help readers locate the starting point in their own healing process and gain confidence in responding to the ebbs and flows, successes and setbacks of the healing journey. This book is about helping people learn how to make their healing journey journey shorter. It's tragic that so many get stuck in distressing emotional patterns for years or even decades, often because they simply don't know how to identify why they are suffering. We can work to reduce unnecessary emotional suffering by learning to identify what we need to focus on and by developing skills to navigate the emotional space between the extremes of anger and happiness. Healing work, giving humanity a second chance."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4059.1,"end":4062.62,"speaker":"Fr Stephen De Young","text":"Available now@store.ancient faith.com."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4064.3,"end":4080.22,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF.RA."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4084.75,"end":4100.35,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the second half of the show. Thank you very much, voice of Steve. But this is not a live show. This is a pre recorded episode. But we do have some calls that we received, some voicemails, and we're gonna make use of those starting in this part of the show."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4100.43,"end":4103.55,"speaker":"Fr Stephen De Young","text":"So unless our vibes have reached you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4103.71,"end":4104.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4104.43,"end":4108.03,"speaker":"Fr Stephen De Young","text":"And you somehow know to call in as we're recording."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4109.96,"end":4115.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is where we get accused of being New Agers. I'm told vibes is a New Age word."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4115.44,"end":4119.84,"speaker":"Fr Stephen De Young","text":"I don't know, is it? I'm from Southern California, so it's hard."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4119.84,"end":4121.72,"speaker":"Fr Andrew Stephen Damick","text":"To discern everything's vibes there."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4122.2,"end":4126.68,"speaker":"Fr Stephen De Young","text":"Yeah. Actual vibrations, dude, quit harshing my mellow."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4128.92,"end":4134.84,"speaker":"Fr Andrew Stephen Damick","text":"I remember the Beach Boys song Good Vibrations, which suggests that there are evil vibrations as well."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4134.84,"end":4136.17,"speaker":"Fr Stephen De Young","text":"Oh, there are bad vibes, dude."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4136.4,"end":4172.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I walked into that one. Yeah. So. All right, well, we're talking on this Thanksgiving episode, we're talking about the Holy Eucharist and we discussed the question of sacrifice and the priesthood in our first half. And now we're going to continue talking about the Eucharist and continue, of course, talking about the Old Testament and how all these things kind of are related to each other. So let's roll. Let's talk about the Passover. That's related. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4172.7,"end":4173.98,"speaker":"Fr Stephen De Young","text":"Transform and roll up."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4173.98,"end":4174.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4174.42,"end":4178.74,"speaker":"Fr Stephen De Young","text":"Okay. So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4179.94,"end":4180.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4180.26,"end":4211.3,"speaker":"Fr Stephen De Young","text":"So we talked in the, in the first half, we were talking about the relationship between the Eucharist as sacrifice and the priesthood and the sacrifices of, of the Old Covenant. And so this half, the second half, we want to talk about the relationship, the special relationship the Eucharist has with the Passover directly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4211.3,"end":4211.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4214.1,"end":4240.39,"speaker":"Fr Stephen De Young","text":"Because this, in addition to sort of, as we mentioned, taking up all of those earlier sacrifices, being a participation in Christ's sacrifice, which itself is the fulfillment of those things and being the fullness of the patterns established there, there's a directed, special connection to the eating of the Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4240.87,"end":4241.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4241.83,"end":4246.86,"speaker":"Fr Stephen De Young","text":"Which is pascha being the Greek word for Passover. So we'll probably use those interchangeably."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4247.1,"end":4249.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, in Greek, they literally are just interchangeable."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4250.38,"end":4252.06,"speaker":"Fr Stephen De Young","text":"Right. It's the Greek word for Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4252.06,"end":4252.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4252.94,"end":4258.22,"speaker":"Fr Stephen De Young","text":"And it's also what we call what the Germanic peoples call Easter."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4260.3,"end":4265.58,"speaker":"Fr Andrew Stephen Damick","text":"I don't even know if it's all of them. I'd have to check. But it's true. It's a specifically Germanic language term."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4266.7,"end":4268.7,"speaker":"Fr Stephen De Young","text":"Yes. It's certainly in Germanic languages."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4268.7,"end":4280.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sorry. Everyone who somehow thinks that a Christian feast that arose in the ancient near east is somehow named after a Germanic goddess. Not a thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4280.7,"end":4287.3,"speaker":"Fr Stephen De Young","text":"Weird. No, it's Ishtar. It's Ishtar. The Germans just remembered ancient Babylonian."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4288.26,"end":4301.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. Easter has as much to do. Easter as a holiday has as much to do with Ishtar as celebrating the Fourth of July means that we're giving worship to the divine genius of Julius Caesar."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4303.51,"end":4309.11,"speaker":"Fr Stephen De Young","text":"Well, I don't know what you do on the Fourth of July. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4312.07,"end":4312.79,"speaker":"Fr Andrew Stephen Damick","text":"That aside."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4312.87,"end":4328.03,"speaker":"Fr Stephen De Young","text":"So, yeah. The correct response to anyone telling you that Easter or Pascha is a pagan holiday is to ask them if they consider Jewish people to be pagans, because it's literally Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4328.03,"end":4329.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4331.05,"end":4341.33,"speaker":"Fr Stephen De Young","text":"But so Passover, we, of course, often in the Orthodox Church, refer to Pascha as the Feast of Feasts. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4341.33,"end":4341.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4342.01,"end":4350.09,"speaker":"Fr Stephen De Young","text":"We're celebrating Christ's resurrection. Kind of obvious why that would be the feast of feasts. But that's also true in the Old Testament."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4350.25,"end":4350.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4350.89,"end":4357.26,"speaker":"Fr Stephen De Young","text":"That Passover. The Passover is the feast. The feasts in that festival cycle as well."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4357.26,"end":4359.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The highest of all high holy days."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4360.42,"end":4383.78,"speaker":"Fr Stephen De Young","text":"Right. And so in the Old Testament, it is. It represents the beginning of one of the festal cycles. Right. So when the instructions are being given by God to Moses about the celebration of the Passover, he says, this will be for you the first of months."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4384.71,"end":4389.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which you're like, wait a minute, I thought that the Feast of Trumpets was the first of months."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4389.23,"end":4450.94,"speaker":"Fr Stephen De Young","text":"Yeah. What happened to Rosh Hashanah? Right. And that's because. I'm pretty sure we've talked about this before on the show, but there were two different overlapping calendars and festal cycles. In the calendar, as it's laid out in the Torah, you have the older, actually calendar that's based on the agricultural cycle, and that's where you get the early September beginning of the year, and then you have the festal cycle that's based around Passover. And this is still true in the Orthodox Church calendar. Right. We have a set of feasts that are based around Pascha every year. And then we also have the indiction on September 1, the beginning of the ecclesiastical year. And we have the cycle of fixed date feasts."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4450.94,"end":4459.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is what keeps all those people who help to interpret the Typicon for us in business because it creates this beautiful complexity."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4459.94,"end":4467.06,"speaker":"Fr Stephen De Young","text":"Right. But that's a point of continuity. It's that we still have these two. These two layers."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4467.06,"end":4467.58,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4469.5,"end":4515.28,"speaker":"Fr Stephen De Young","text":"So, but. But the cycle centered around Pascha is sort of the most important. That's why it overlaps and sort of trumps the other and it moves around in relation to the other. So another interesting thing that we've noted before is that the future observance, how the Passover will be celebrated and observed annually in the future, is actually presented by God to Moses in Exodus before the Passover event actually happens. Yeah, before the tenth Plague."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4515.68,"end":4536.77,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's worth noting especially that this feast and then all the other feasts related to it are. They're not about sort of natural cycles. Right. Like that other calendar. These are God acting in history. And so that's why you get this prompts. Yeah, yeah, exactly. And that's underlined then by like, okay, I'm about to do this. And this is how you're going to celebrate it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4537.49,"end":4559.11,"speaker":"Fr Stephen De Young","text":"Right, right. It's based around this act and it's right before. Right. So key to this is, key to the way the Torah presents the Passover, is that it's not presenting the Passover as a single one time historical event that will be reflected on later."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4560.79,"end":4561.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4561.19,"end":4572.55,"speaker":"Fr Stephen De Young","text":"It presents the Passover as the beginning of an ongoing reality that's a pattern that will continue into the future without an endpoint."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4573.3,"end":4573.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4576.1,"end":4585.38,"speaker":"Fr Stephen De Young","text":"And so that makes that one sense of memorial. I said we'd return to this. That makes that one sense of memorial, of just remembering a past event. Impossible."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4586.82,"end":4587.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4588.9,"end":4593.3,"speaker":"Fr Stephen De Young","text":"Because that's not where it's focused."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4595.46,"end":4595.86,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4597.7,"end":4616,"speaker":"Fr Stephen De Young","text":"We see the same thing, the same thing with the Eucharist, that Christ describes how the Eucharist will be celebrated. It says, this is my body broken for you before his body had been broken."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4616.56,"end":4617.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4617.52,"end":4620.56,"speaker":"Fr Stephen De Young","text":"This is my blood shed for you before his blood had been shed."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4620.96,"end":4625.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's a participation even before the event in terms of historical linear time."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4625.6,"end":4638.91,"speaker":"Fr Stephen De Young","text":"Right. And so he's instituting this before the event happens to convey the same thing. Right. Not just to parallel. Because he's doing this at Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4639.07,"end":4641.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the new Passover, the renewed."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4641.43,"end":4654.03,"speaker":"Fr Stephen De Young","text":"Passover is doing it at Passover. And he's not just presenting this as his death and his Resurrection are going to be this historical event that will someday be in the distant past and we will reflect and look back at."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4654.61,"end":4661.01,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because that wasn't even possible, you know, because he's not like, okay, remember when. Tomorrow."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4661.65,"end":4719.99,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right. And this is. So this is an ongoing. He's creating again. It's not just this singular, mighty act of God in history, but it is this reality that will continue with no stated endpoint. Right. Other than the return of Christ, the end of the world. Right. And that's the language of as often as you do this, you'll proclaim his death and his resurrection until he comes. Right. So it is this ongoing thing and the fact that this temporal relationship between when Christ institutes the Eucharist and when he actually dies and rises again is reiterated in our liturgy, in our Orthodox liturgy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4719.99,"end":4733.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Where, say, there's that line. And it's only in Chrysostom's iteration of the liturgy. I don't think this is in Basil's where he says, on the night in which he was betrayed, or rather gave himself up for the life of the world."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4734.16,"end":4755.52,"speaker":"Fr Stephen De Young","text":"Yeah. So it's being directly connected. Right. We have the. Gave himself. Right. So we have the voluntary self offering element there. Right. We have the Eucharist as a participation in that, but we also have a reminder that this is instituted right before he does it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4755.6,"end":4774.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's both this kind of historical earthly expression on the nighting, which is betrayed. And then here's this, you know, the inner reality that maybe is not apparent looking, you know, what really happened is he gave himself up for the life of the world, you know, and both things are true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4774.26,"end":4775.58,"speaker":"Fr Stephen De Young","text":"Apocalyptic liturgy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4775.58,"end":4779.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah, right. Exactly. Exactly. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4779.86,"end":4801.23,"speaker":"Fr Stephen De Young","text":"So, and so another element that we see in the Passover, Right. And its celebration is that the Passover involves the whole family."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4801.55,"end":4802.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4802.39,"end":4809.15,"speaker":"Fr Stephen De Young","text":"So related to Passover is sort of led by the Father in his sort of priestly role, but encompasses the whole family."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4809.39,"end":4817.55,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So related to that, we. We have one of our first voicemails that I'm going to play for everybody and we'll talk about it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4820.35,"end":4880.87,"speaker":"Audience Member","text":"Hi, Father Andrew and Father Stephen. My question about the Eucharist relates to the fact that in Orthodoxy, we give the Eucharist to infants. In the Protestant tradition that I grew up in, that was not the case. One typically received Holy Communion the first time at the age of 13 or 14, and only after passing the material in a catechism or confirmation class to the satisfaction of the pastor. And when I explored Orthodoxy, the fact that Communion was Given even to infants was something that was very attractive to me as I explored the church. Could you explain some of the rationale behind why this has always been the practice in the Church? Is it related to any notions of the sacrifice of Christ and the Eucharist as sacrifice and the fact that infants who have been born again by water and the Spirit also need to be nourished with the life giving body and blood of Christ that sustains our faith and helps us to grow in our faith?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4882.15,"end":4902.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so that comes to us from Jacobus. He didn't introduce himself, but that was on the email. So thank you very much for that question, Jacques. I mean, this is directly what we're talking about here, Right. In the Passover celebration, the whole family is involved. There's no indication that you have to be a certain age or that you have to pass classes or anything like that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4903.08,"end":4938.28,"speaker":"Fr Stephen De Young","text":"Right. And the children are not only included, but the one little bit of actual Passover liturgy that's in, that's in the Hebrew Bible itself. Right. Is this sort of mini dialogue between father and son. Right. So the children have a particular role because part of what's going on in the Passover meal is that this is intergenerational."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4939.48,"end":4941.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's handed down."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4943.66,"end":4972.82,"speaker":"Fr Stephen De Young","text":"Yeah. So yeah, there's, it's, there are some, not a lot. There are some Protestant groups, there are some Presbyterian groups who practice what they call pedo communion, which I think people are going to have to get rid of terms like pedo communion and pedobaptism because I think they're going to be like really unpopular sin because they have other connotations."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4972.82,"end":4976.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but it just means communion for kids, baptism for kids."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4981.14,"end":4992.18,"speaker":"Fr Stephen De Young","text":"But that's a definite minority. Right. In process. And of course, Roman Catholicism doesn't commune infants normally either."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":4992.42,"end":5011.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, the 1.5% of Catholics who are Eastern Catholics do. And historically, I can't remember exactly when it was, but historically Latin Catholics would commune infants, but it's not been for many centuries that they did that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5011.87,"end":5059.18,"speaker":"Fr Stephen De Young","text":"Yeah, it's not common practice anymore. So yeah, I mean, there's always a temptation to punt and say, well, hey, you have to explain to me why not. But we have available to us various groups explanations why not, and we can interact with those. Right. So one of them is actually kind of confusing to me. That's not being totally genuine. One of them doesn't make sense to me. I'm not really confused. I just think it doesn't make sense. And that is there are some of our Protestant friends who are very anti sacramental. Meaning they're against the idea of sacraments."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5059.34,"end":5060.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, sure."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5060.3,"end":5078.3,"speaker":"Fr Stephen De Young","text":"They don't like the word. Right. They won't use the word. I know of Protestant pastors who literally will do a baptism or something or serve communion and give a talk beforehand explaining how it's not a sacrament."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5078.59,"end":5090.19,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right, exactly. I mean, I remember in my evangelical days, especially in baptisms, you would get a little mini sermon saying that this doesn't do anything."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5091.15,"end":5113.09,"speaker":"Fr Stephen De Young","text":"Right. And so here's my thing where I don't understand. Or to be more honest and less nice, I don't think it makes sense is a lot of these same people who have the position that it doesn't do anything, won't do it to infants. Yeah, That's Baptism doesn't do anything."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5113.09,"end":5113.81,"speaker":"Fr Andrew Stephen Damick","text":"Contradiction."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5113.81,"end":5136.97,"speaker":"Fr Stephen De Young","text":"It's just a symbol. But I will not apply this empty symbol to anyone under a certain age. Yeah, right. Or right. Communion is just symbolic. We're just remembering Christ and what he did for us. But you have to be a certain age. That doesn't make sense to me."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5137.37,"end":5137.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5141.37,"end":5174.48,"speaker":"Fr Stephen De Young","text":"The version of that, that makes more sense to me. I still think it's incorrect. But that I understand. The argument is groups that believe it does something that it is right in the terms of the Eucharist and think that in order to receive the Eucharist worthily, in order to participate in it in a worthy manner, you have to have some level of intellectual understanding of what it is and what's going on."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5174.48,"end":5175.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5175.6,"end":5200.06,"speaker":"Fr Stephen De Young","text":"That they say an infant doesn't have. And that's why there's an age thing. Right. You have to reach your certain age and have a certain understanding. There's a bunch of problems with that. One of them is right, maybe this is just me being orthodox and mysterious. Right. But is there someone out there who really understands the Eucharist?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5200.62,"end":5201.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5203.66,"end":5213.34,"speaker":"Fr Stephen De Young","text":"So we all have these partial understandings. Right. And you know, but it has to reach a certain level of partial right before."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5213.95,"end":5280.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the one. The version of this that makes the least sense to me is with folks who have. Honestly, it's hard for me to keep track of what the proper term is now, but intellectual disability, or however you want to describe it, forgive me if that's offensive to anybody, you know, especially if they're profoundly that way, like say, for instance, they'll never be able to speak. And it's clear that, you know, they don't have much mental understanding on that basis. You would have to for their whole life refuse them to commune. And for those who believe, who apply the same rule to baptism that they would go their whole life without being baptized. Now, if you are in a purely memorialist tradition, then you probably would say, well, it doesn't really matter one way or the other then because it doesn't do anything. So it doesn't matter if you do it or not. But that's the one that doesn't make any sense to me is for people whose understanding never will reach that level, at least as far as we can tell."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5281.87,"end":5298.03,"speaker":"Fr Stephen De Young","text":"Yeah, I used to use that as an example and unfortunately I found out recently that there are a lot of Roman Catholic priests who will not give the Eucharist to someone who is mentally disabled."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5298.37,"end":5307.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, there are. There are people. Yes. And there are Protestants who will, who simply say, yeah, no, they would never, because they have to be able to make a profession of faith."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5308.53,"end":5312.93,"speaker":"Fr Stephen De Young","text":"I know we have some Roman Catholic listeners and I'm not trying to be anti Catholic."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5312.93,"end":5313.29,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5313.29,"end":5333.63,"speaker":"Fr Stephen De Young","text":"But I have to be honest and say, and I'm in. I now live in a majority Roman Catholic era and there's a lot of very bad pastoral praxis that goes on. Right. That I think is one of them."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5335.55,"end":5335.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5335.91,"end":5409.27,"speaker":"Fr Stephen De Young","text":"I mean, I mean, I think infants should receive the Eucharist. Okay, but if your practice is not to give infants the Eucharist, that doesn't like, make me upset. Right. Like, but when you tell me that someone has a traumatic brain injury and so now you will never allow them to share in the body of blood of Christ again, that does get me upset. No, when you tell me that because somebody's dad got divorced and remarried, you won't baptize them, that gets me upset. So this is not just me taking shots at the Roman Catholic Church willy nilly. But I think that is, I mean, like, I can't understand how a compassionate human being could do that. And so props to. And I'm definitely not going to name them and get them in trouble. Props to the Roman Catholic priests who I know of who bypass those rules for the sake of compassion. Right. Kudos to you for disobeying your hierarchs. You didn't think you'd hear that on ancient faith, did you?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5410.79,"end":5413.91,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, you're telling Catholic priests that it's good to disobey their hierarchy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5413.91,"end":5418.83,"speaker":"Fr Stephen De Young","text":"Yeah, I'm telling Catholic priests it's okay to disobey the Pope. There we go. Right. Can't get in trouble for that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5418.83,"end":5421.03,"speaker":"Fr Andrew Stephen Damick","text":"Where I live, I'm into disobeying the Pope as well."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5425.27,"end":5502.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, yeah. So to Me. Right. The, the core is. The core is the reality of human life. Right. First and greatest commandment, love the Lord your God with all your heart, with all your soul, with all your mind and with all your strength. At the beginning of our life, our mind and our strength are not really there yet. We've still got our heart and our soul with which to love God. And none of us remembers what our relationship with God was like in the womb, for example. But it's totally wrong to assume that there wasn't one. And then when we get to the end of our lives, our mind and our strength start to go. Yeah, but we still have our heart and our soul with which to love God. And so the idea that we are going to exclude people from the family of God from participating in Christ's self offering, the idea that we need to do that based on how much mind or how much strength they have, doesn't make a whole, whole lot of sense."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5503.57,"end":5504.93,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5505.97,"end":5522.62,"speaker":"Fr Stephen De Young","text":"Spiritually or biblically, if you aren't loving God with your heart and your soul, then we need to talk about you not receiving the Eucharist. But if you're loving God with everything you've got, it doesn't matter how much or how little you've got."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5522.78,"end":5553.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yep, yep, yeah. So another one of the big objections, of course, and we mentioned this earlier, is the idea that the Eucharist is a kind of repetition of Christ's crucifixion, you know, he's being re sacrificed and so forth. But that doesn't work based on what we already said. Right. Because this is a participation in an event that has occurred. It's not a repetition of that event. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5553.33,"end":5556.37,"speaker":"Fr Stephen De Young","text":"So there's another continuity with Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5556.37,"end":5606.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. So in the Passover it's not. And now tonight we're going to remember when our ancient ancestors were saved from Egypt. It's, this is the night that we were brought out of Egypt. And I mean, this gets repeated. I mean, God uses this language when he's speaking to Israel. I'm the Lord who brought you up out of Egypt. And he might be talking to people who are generations removed from those who actually made the exodus. So it's again, you are brought out of Egypt. And so when Christ offers himself, we are saved. It's not, oh, let's remember when those people were saved 2,000 years ago. You know, we're participating in that offering of Christ as it happens, kind of you are there, you know, so it's not a repetition, it's a return in a Sense. But it's not a repetition."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5606.95,"end":5613.51,"speaker":"Fr Stephen De Young","text":"Repetition would be if once a year, all the Jewish people of the world flew to Egypt and then made an overland trek."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5613.75,"end":5614.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5616,"end":5616.24,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5616.32,"end":5620.56,"speaker":"Fr Andrew Stephen Damick","text":"Where's Yam Suf again? It's right here on this map."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5621.92,"end":5624.48,"speaker":"Fr Stephen De Young","text":"So that's not right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5624.48,"end":5625.36,"speaker":"Fr Andrew Stephen Damick","text":"Reenactment."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5626.16,"end":5639.04,"speaker":"Fr Stephen De Young","text":"Yeah. That's not how any of this works. Right. They are participating in the event that happened. Right. In the past. They are not repeating it ritually."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5639.04,"end":5640.48,"speaker":"Fr Andrew Stephen Damick","text":"It's a ritual participation."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5640.88,"end":5644.92,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, yes. Not a repetition. That's the difference. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5644.92,"end":5645.44,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5649.76,"end":5710.45,"speaker":"Fr Stephen De Young","text":"And as we've mentioned before, but when these commandments are being given. Right. What God says he's going to do through the Passover event is make a distinction between the Israelite and the Egyptian. So the previous plagues, for the most part, affected the parts of Egypt where Israel wasn't living outside of the land of Goshen. Right. And didn't affect where Israel was dwelling. So if you were an Egyptian who happened to live in an Israelite neighborhood, you just lucked out and missed most of the plagues. Right. But what happens with the 10th plague, with the Passover? God says he's going to make this distinction. He's going to draw the limit. And so on that night, everyone who participated in the Passover, ate the Passover, marked their door. They're now Israel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5710.61,"end":5711.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5711.25,"end":5713.33,"speaker":"Fr Stephen De Young","text":"And anyone who didn't is now an Egyptian."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5713.57,"end":5715.33,"speaker":"Fr Andrew Stephen Damick","text":"He's made this new nation for himself."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5715.89,"end":5754.3,"speaker":"Fr Stephen De Young","text":"Right. And so this is why you get the centrality of eating the Passover in the Israelite and then Judahite Jewish identity. Right. And as we've talked about, that's why you find a canon always dangerous to talk about the minimums, because somebody's gonna be tempted to do it. But you find the bare minimum in the canons of the church of being baptized and receiving the Eucharist once a year at Pascha, at Passover, which parallels."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5754.38,"end":5757.9,"speaker":"Fr Andrew Stephen Damick","text":"Parallels Israel, you've got to be circumcised and you've got to eat the Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5757.98,"end":5791.7,"speaker":"Fr Stephen De Young","text":"Right. And if you don't. Right. Then you become a lapsed Christian. Right. It's now maybe an ethnic identity or something. But you're. You're not observant. You're lapsed. Right. So all that about sort of these things connecting the Eucharist and the Passover. But of course, we don't just have the Eucharist once a year."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5792.34,"end":5792.7,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5792.7,"end":5803.22,"speaker":"Fr Stephen De Young","text":"Right. Well, we don't celebrate it just once a year. Some folks may only receive the Eucharist once a year, but we don't just Offer it once a year."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5803.22,"end":5806.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is one of the things that's different from the Passover in the."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5806.46,"end":5816.98,"speaker":"Fr Stephen De Young","text":"Old Covenant, a point of discontinuity, as it were. Well, because as we talked. In part, because as we talked about, the Eucharist is taking up that regular cycle of sacrifices also."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5816.98,"end":5818.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's pulling it all in."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5820.1,"end":5845.95,"speaker":"Fr Stephen De Young","text":"But sort of the minimal level, we have every Sunday, the Divine Liturgy, the celebration of the Eucharist, and that's because we not only have this annual cycle with the annual commemoration of Christ's resurrection, but every Lord's Day for us is the commemoration of Christ's resurrection."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5846.43,"end":5850.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. Pascha continues yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5850.59,"end":5888.92,"speaker":"Fr Stephen De Young","text":"And so we continue to offer it there. And as we just mentioned, places and times, monasteries, now, certain other places at other times in the church's history where you have daily Eucharist that's based on this, that daily cycle of sacrifices that are sort of taken up into it. So this raises the question about the relationship between the Eucharist and the Passover Seder as such."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5889.64,"end":5891.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is it just a seder?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5893.16,"end":5893.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5894.76,"end":5915.06,"speaker":"Fr Andrew Stephen Damick","text":"Or is it derived from the Seder? Some people say that. And then also you get some, particularly some evangelical Christians, they will do both, a communion ritual, and they will sometimes also hold seders, maybe invite the local rabbi or do it themselves."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5915.3,"end":5917.38,"speaker":"Fr Stephen De Young","text":"You know, the answer is no."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5918.02,"end":5918.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5918.98,"end":5919.78,"speaker":"Fr Stephen De Young","text":"To all of that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5919.78,"end":5924.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a Seder. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5924.54,"end":5926.42,"speaker":"Fr Stephen De Young","text":"Nope, don't do that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5927.3,"end":5936.64,"speaker":"Fr Andrew Stephen Damick","text":"And we'll mention why there seem to be some similarities between the two. And just. Yeah, because, you know, it's like, it's not. There's. There's nothing similar between the two, but we'll talk about why."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5937.28,"end":5958.48,"speaker":"Fr Stephen De Young","text":"Right, Right. And so right off the bat, in terms of whether the Mystical Supper or the Last Supper, the meal at which Christ instituted the Eucharist, wasn't a Seder, is that it's the wrong. Wrong day of the week."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5959.4,"end":5961.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5961.64,"end":5967.16,"speaker":"Fr Stephen De Young","text":"So St. John's gospel especially makes explicit that Christ died at the time they were killing the lambs."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5967.8,"end":5971.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And to do a Seder, you have to have a lamb already ready to go."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":5972.52,"end":6017.01,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, doesn't match up. Right. So that said. Right. That said, what meal is this, then? What kind of meal is this? Because Christ sends the apostles, get this room, gives them the sign and everything. Here's how you find the room. You get this room. We're going to eat the Passover together. Well, this is a kind of meal which is described in the book of Deuteronomy."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6017.49,"end":6079.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Not one of the ones that people seem to know it's not quite as famous, but it's related to all of this. So. Yeah. Deuteronomy 14:22, 26. You get this commandment from God. You shall tithe all the yield of your seed that comes from the field, year by year, and before the Lord your God, in the place that he will choose to make his name dwell. There you shall eat the tithe of your grain, of your wine, and of your oil, and the firstborn of your herd and flock, that you may learn to fear the Lord your God always. And if the way is too long for you, so that you are not able to carry the tithe when the Lord your God blesses you because the place is too far from you, which the Lord your God chooses to set his name there, then you shall turn it into money and bind up the money in your hand and go to the place that the Lord your God chooses and spend the money for whatever you desire, oxen or sheep, or wine or strong drink, whatever your appetite craves, and you shall eat there before the Lord your God and rejoice you and your household."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6081.79,"end":6090.31,"speaker":"Fr Stephen De Young","text":"Right, so this is talking about the annual pilgrimage to Jerusalem, right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6090.31,"end":6095.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm noting where it says the place that the Lord your God chooses, which literally, that's what happens right there."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6096.83,"end":6099.83,"speaker":"Fr Stephen De Young","text":"Right. It makes his name dwell there in the temple. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6099.83,"end":6100.75,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6102.27,"end":6113.47,"speaker":"Fr Stephen De Young","text":"And so this is also for the record, Deuteronomy 14:26. Mark this down. This is the place where God tells you to buy liquor."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6115.39,"end":6115.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6115.75,"end":6116.07,"speaker":"Fr Stephen De Young","text":"Because it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6116.07,"end":6118.67,"speaker":"Fr Andrew Stephen Damick","text":"Notice it makes the distinction between wine and strong drink."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6119.48,"end":6126.12,"speaker":"Fr Stephen De Young","text":"Yes, Wine or strong drink. You're not telling me the wine's grape juice. Because it's not that strong."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6127.24,"end":6129.56,"speaker":"Fr Andrew Stephen Damick","text":"Some really strong Welches tonight, honey."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6129.88,"end":6134.92,"speaker":"Fr Stephen De Young","text":"This is fermented drink. So sorry to our Baptist listeners, but this is in the Bible."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6135.48,"end":6136.2,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6140.68,"end":6167.63,"speaker":"Fr Stephen De Young","text":"And so this is the kind of meal they're having. This is, we made our pilgrimage. Right. And we're going to eat, drink before the Lord. This is kind of referenced a little bit sub rosa in the text, like where Christ says he will not drink of the fruit of the vine again until he comes in his kingdom. That this is sort of a celebratory type of meal. Now, it doesn't turn out celebratory because Christ announces his betrayal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6168.03,"end":6171.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of a dark turn at the end. Judas."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6171.15,"end":6171.55,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6171.63,"end":6173.96,"speaker":"Fr Andrew Stephen Damick","text":"Looking at you, Judas. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6175.88,"end":6177.48,"speaker":"Fr Stephen De Young","text":"But it was intended to be."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6179.24,"end":6179.64,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6181.88,"end":6210.13,"speaker":"Fr Stephen De Young","text":"One of the things with the. So that said, if it isn't a seder. Right. If you've been to one of these Presentations or read an article written by somebody. And this is very common, as Father Andrew said, in the evangelical world. Now, drawing all these connections between the Eucharist and the Passover Seder, including things that are said. Right. And that kind of thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6210.13,"end":6212.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Specific ritual connections."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6212.69,"end":6250.14,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So here's a. Here's an audio footnote. A good place to go to learn more about this history is Yuval Israel, who's a Jewish scholar who's written a lot about this. There's some lectures he's given that are on YouTube. He says provocative things like Christianity preceded Judaism. That's half clickbaity. I mean, he's pointing at something real, but that. That's being clickbaity."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6250.14,"end":6250.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6251.74,"end":6282.71,"speaker":"Fr Stephen De Young","text":"By him. But one of the things he points out relevant to what we're talking about here is that actually a lot of the practices within the Seder, as it's now often celebrated, actually went the other way. It's not that the Christian practice is based on the Seder, it's that what's in the Seder is a sort of response to the Christian practice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6282.79,"end":6295.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because if you look at what the scriptures actually say about how to do this meal, it doesn't include some of the stuff that gets pointed to as being the links between this meal and the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6296.63,"end":6310.72,"speaker":"Fr Stephen De Young","text":"Right, right. There's actually very little in terms of actual ritual liturgics for the meal in the Torah, for example. So the specifics have sort of developed later."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6310.72,"end":6310.92,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6310.92,"end":6323.44,"speaker":"Fr Stephen De Young","text":"So one example that Israel gives is the practice of lifting the unleavened bread and saying something on the order of, this is the bread of our suffering."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6325.6,"end":6326,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6328.64,"end":6337.43,"speaker":"Fr Stephen De Young","text":"And people say, oh, look, see, Christ lifted the bread and said, this is my body broken for you. Right. Like suffering. It actually went the other way."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6337.99,"end":6340.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6340.15,"end":6342.15,"speaker":"Fr Stephen De Young","text":"It actually went the other way. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6342.55,"end":6344.79,"speaker":"Fr Andrew Stephen Damick","text":"Influence of Christianity on Judaism."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6345.83,"end":6351.51,"speaker":"Fr Stephen De Young","text":"Right, right. Or at least Judaism in part, defining itself over against Christianity."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6351.67,"end":6352.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6353.27,"end":6405.26,"speaker":"Fr Stephen De Young","text":"So it's about the suffering of the nation of Israel in Egypt and later, rather than about the suffering of Jesus, for example. Right here. So. Yeah. So ironically, a lot of the Christian things people are seeing in the Seder are actually responses to Christianity, not the origins of Christian practice, their responses to Christian practice. So, as I just mentioned, and an obvious point of discontinuity, if you're familiar with Orthodox practice at least, is that when we celebrate the Eucharist, we use leavened bread."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6405.58,"end":6406.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Risen bread."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6406.78,"end":6432.79,"speaker":"Fr Stephen De Young","text":"And Passover is very deliberately unleavened bread. And this is because. Right. This is a reflection for us. This is Just being the correct way to do it. This is a reflection for us of the fact that. Of Christ's resurrection."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6433.03,"end":6435.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Risen bread for the risen Christ."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6436.07,"end":6438.71,"speaker":"Fr Stephen De Young","text":"Right. And that's not just being punny."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6438.79,"end":6439.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6439.43,"end":6465.17,"speaker":"Fr Stephen De Young","text":"But the idea is that we're not just. Right. We're not just focusing in the Eucharist on Christ's suffering or just on his death, but on his resurrection as well. And his resurrection is celebratory."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6466.46,"end":6466.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6467.26,"end":6474.14,"speaker":"Fr Stephen De Young","text":"The unleavened bread is the bread of suffering. You make unleavened bread because you're about to go on the run from the Egyptians."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6474.14,"end":6476.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You need something that's not going to go bad."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6476.54,"end":6482.78,"speaker":"Fr Stephen De Young","text":"Yeah. And you don't have time to let anything rise. Right. You've got to get going. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6482.86,"end":6490.74,"speaker":"Fr Andrew Stephen Damick","text":"So the Eucharist is not a participation in Jesus last Seder, as we just said. So that's why it's not."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6490.74,"end":6491.9,"speaker":"Fr Stephen De Young","text":"And his resurrection."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6492.1,"end":6493.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. Exactly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6494.34,"end":6500.1,"speaker":"Fr Stephen De Young","text":"And that resurrection element of the Eucharist is absolutely key. Absolutely key."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6500.1,"end":6506.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because his resurrection is what changes the Passover into what it becomes in Christian practice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6506.98,"end":6552.21,"speaker":"Fr Stephen De Young","text":"Right, right. And so now to briefly grind an old axe of mine, it's got to be pretty sharp by now because once again, a good, respectable and decent Protestant pastor has expressed disbelief that I do not see any sense of substitution in the Passover. I will very briefly reiterate why there is no substitution, let alone penal substitution, in the Passover ritual. Right. And therefore that also has nothing to do with the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6552.77,"end":6553.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6554.93,"end":6567.73,"speaker":"Fr Stephen De Young","text":"And so I'll try to do this relatively quickly because this is not the first time I've done it, even on this show. But notice there is no one to one correlation between lambs and sons."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6568.21,"end":6568.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6571.1,"end":6578.94,"speaker":"Fr Stephen De Young","text":"So if you have a family, if you were an Israelite and you only had daughters, you still did the Passover."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6580.7,"end":6581.1,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6581.66,"end":6647.93,"speaker":"Fr Stephen De Young","text":"You still follow the Passover. Even though you didn't have a firstborn son to be killed, you still marked your door. You still celebrate the Passover. Okay. If you have a family, a household. Right. Because these are extended families where you've got the firstborn son who's the son of a firstborn son, who's the son of a firstborn son, you don't do three lambs, you do one lamb. If you have a small family that can't eat the whole lamb, you share it with another small family, even if you both have sons. So you could have one lamb and two sons. There's no reason from the text to believe that God wanted to kill Israelite children such that it would require a substitute. Right. The death of the firstborn is a response to the fact that Pharaoh had murdered the Israelite boys. Why would God want to kill more of them?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6648.57,"end":6648.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6649.85,"end":6686.66,"speaker":"Fr Stephen De Young","text":"And have to kill a sheep instead. Right. The death of the lamb is not ritualized in any way. You're not told how to kill the lamb. So no part of the ritual is based on killing the lamb. You just. You have to kill it so you can cook it and eat it. Right. You're not going to eat it alive. Right. And so there's no substitution, there's no nothing. The Day of Atonement, the Passover are two different things."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6688.18,"end":6688.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6689.14,"end":6701.78,"speaker":"Fr Stephen De Young","text":"And getting back to the Eucharist, you don't really find much Day of Atonement stuff in the Eucharist of any kind."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6702.34,"end":6702.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6703.3,"end":6706.9,"speaker":"Fr Stephen De Young","text":"There's kind of a little sideways thing that we're going to talk about in the third half."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6707.53,"end":6707.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6708.33,"end":6716.41,"speaker":"Fr Stephen De Young","text":"To do due diligence, but really it's not there. There are really no elements of the Day of Atonement incorporated into the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6718.33,"end":6719.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6719.53,"end":6722.49,"speaker":"Fr Stephen De Young","text":"Right. So there's that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6722.49,"end":6738.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Yeah. So before we wrap up our second half here, we had another voicemail that we wanted to play for you. And this is from Matt. Hi, Fathers. It's Matt from Ontario, Canada."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6739.37,"end":6741.17,"speaker":"Fr Stephen De Young","text":"I have often heard that the agape."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6741.17,"end":6743.37,"speaker":"Audience Member","text":"Meal is an extension of the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6743.37,"end":6745.65,"speaker":"Fr Stephen De Young","text":"And even that these two meals were."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6745.65,"end":6746.89,"speaker":"Audience Member","text":"Originally the same event."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6747.77,"end":6758.35,"speaker":"Fr Andrew Stephen Damick","text":"Why should we distinguish between the two meals? Are all meals we share with other Christians an extension of the Eucharist? And what are the implications of that? And perhaps most importantly, we."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6758.42,"end":6763.22,"speaker":"Fr Stephen De Young","text":"Why is one meal restricted to properly prepared Orthodox Christians and the other not?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6764.42,"end":6771.62,"speaker":"Fr Andrew Stephen Damick","text":"You can always tell when someone sends a question that they've written it out beforehand because that was very, very concise. Good job, Matt."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6771.7,"end":6772.14,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6772.14,"end":6773.86,"speaker":"Fr Andrew Stephen Damick","text":"I expect nothing less of a Canadian."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6774.5,"end":6775.7,"speaker":"Fr Stephen De Young","text":"It was a good delivery."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6777.06,"end":6814.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So he's connecting. You know, there is this ancient connection to the agape meal, and certainly that resembles more the Passover meal. Right. Everyone's sitting around a table and we're going to finish up talking about eating. So what's the deal with that? Why is it kind of separated out? And why is it that the agape meal is kind of open to even people who might not be able to receive Communion? What's going on there? Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6814.26,"end":6822.26,"speaker":"Fr Stephen De Young","text":"So part of this is how we've become disassociated from the way sacrifice worked."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6823.94,"end":6824.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6826.1,"end":6839.74,"speaker":"Fr Stephen De Young","text":"Because it's not just that sacrifices were meals. Right. But so if we're talking about a Pagan context, Right. Pagan, Greek and Roman temples, for example, had huge banquet halls."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6839.74,"end":6840.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6841.7,"end":6849.54,"speaker":"Fr Stephen De Young","text":"And in their remains, we found bones and remains of all kinds of things. Things that weren't being sacrificed on their altar."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6849.54,"end":6851.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Side dishes. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6851.9,"end":6863.06,"speaker":"Fr Stephen De Young","text":"Yeah. Like sea urchin and stuff. In Corinth, for example. But so we found all that stuff. There's even a word for it. It's trapezomata."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6863.14,"end":6863.62,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6864.58,"end":6901.77,"speaker":"Fr Stephen De Young","text":"Table things. Everything sounds cooler when you say it in Greek. Table things. So if we're talking about ancient Israel, right, You'd go, you'd bring the sacrifice. The sacrifice would be taken from you. The priests would do their thing and offer it, and then you'd be given your portion back of the meat to eat with your family. But you take that home and you'd eat it. You'd eat it in the context of a meal. Right. You wouldn't sit and, like, just eat that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6902.17,"end":6902.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6904.81,"end":6961.29,"speaker":"Fr Stephen De Young","text":"You would have it in the context of a meal. And so, again, this is not. This is deeply built into the understanding of the Eucharist as a sacrifice. Right. So in the very earliest phase of Christianity, while it is still a Judaism, essentially. Right. It is one group within Second Temple Judaism, Christians were going to the synagogue on the Sabbath and then gathering separately as Christians on the Lord's Day. And within that concept of gathering on the Lord's Day, they were offering the Eucharist and then enjoying it in the context of this meal. Right. And so in the same way that you could have people who are not Christians who are there eating the meal, but not the Eucharist. Right. St. Paul has to tell the people in Corinth, hey, don't go eating in an idol's temple."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6961.69,"end":6966.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's still communion with idols."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6967.29,"end":6979.14,"speaker":"Fr Stephen De Young","text":"Because it's still communion with idols. And notice St. Paul has to not just say, don't eat meat offered to idols. He has to say, don't be eating in an idol's temple."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6979.46,"end":6980.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6980.1,"end":6980.5,"speaker":"Fr Stephen De Young","text":"Also."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6982.1,"end":6982.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6983.06,"end":6991.1,"speaker":"Fr Stephen De Young","text":"Because you could have the person who says, hey, I'm not eating any of this stuff that was sacrificed. I'm just going there because it's, you know, my trade guild or it's, I."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6991.1,"end":6992.18,"speaker":"Fr Andrew Stephen Damick","text":"Like the side dishes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":6992.66,"end":7011.25,"speaker":"Fr Stephen De Young","text":"Right. Whomever. And I'm just sort of hanging out there, you know, having a couple drinks, nibbling on some apps, you know, I'm not eating the sacrifice. Right. I'm not participating in the sacrifice. I'm not eating the sacrifice. Right. And St. Paul says, uh, no. Get it all the way out. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7011.97,"end":7014.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7015.09,"end":7027.65,"speaker":"Fr Stephen De Young","text":"And so that's. That's why? There's the difference. Right. This was the agape meal, was a. Just the sacrificial meal that accompanied the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7029.72,"end":7030.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7030.28,"end":7030.64,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7030.64,"end":7031.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7031.8,"end":7053.2,"speaker":"Fr Stephen De Young","text":"And so it fit in very well with everybody's understanding of how. Of how sacrifice worked. And in terms of the question of is every meal Christians eat together extension of the Eucharist? I'll do you one better. Your whole life should be an extension of the Eucharist. But we'll talk more about that later on."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7053.2,"end":7053.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7056.18,"end":7067.3,"speaker":"Fr Stephen De Young","text":"So. Yeah. And so Passover. Right. Is this shared meal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7067.62,"end":7068.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7069.7,"end":7072.26,"speaker":"Fr Stephen De Young","text":"And it's focused on eating."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7073.22,"end":7085.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, one question that might come up then what some people would have was if a sacrifice is eating a meal with your God, is God eating the Eucharist?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7088.24,"end":7088.64,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7088.64,"end":7098.8,"speaker":"Fr Andrew Stephen Damick","text":"No. Yeah. Because not all sacrifices are actually functioned in that way. Right. Like, I mean, am I correct in remembering that?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7099.76,"end":7104.72,"speaker":"Fr Stephen De Young","text":"Well, the portion that was burned is the portion being given to God, but they didn't believe God was actually eating it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7104.72,"end":7109.33,"speaker":"Fr Andrew Stephen Damick","text":"Eating it. Yeah. There's a. An offering, but not necessarily an eating."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7110.21,"end":7115.81,"speaker":"Fr Stephen De Young","text":"Right. That. It's the language that's always used is about the smoke. Right. Being a pleasing aroma."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7115.81,"end":7116.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7116.85,"end":7128.37,"speaker":"Fr Stephen De Young","text":"The idea is that God is pleased with the offering, and so the same would be true of the offering of Christ. This is my beloved Son in whom I am well pleased."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7128.37,"end":7142.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not every offering or sacrifice involved giving a specific peace over to God. And the fact that we don't take a portion of the Eucharist and burn it is the ritual indication of that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7143.23,"end":7147.79,"speaker":"Fr Stephen De Young","text":"Right. And the Eucharist is a participation in Christ's sacrifice which was offered to God."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7147.87,"end":7153.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So pleasing sacrifice, you don't need to. Again, that would be a kind of repetition of something that's already been done."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7153.95,"end":7154.51,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7154.51,"end":7161.91,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah. Yeah. Alrighty. Well, that's our second half, and we're going to take another short break. And we'll be right back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7162.54,"end":7178.7,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7183.82,"end":7196.56,"speaker":"Audience Member","text":"Can you believe it will soon be the end of the year? Now's the time to prepare for 2023 by purchasing calendars and planners for next year. The Ancient Faith Store can help."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7196.96,"end":7199.12,"speaker":"Fr Stephen De Young","text":"You'll find a collection of orthodox wall."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7199.12,"end":7205.36,"speaker":"Audience Member","text":"Calendars and planners@store.ancientfaith.com find and purchase your."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7205.36,"end":7207.72,"speaker":"Fr Stephen De Young","text":"Favorites Today so that you're ready to."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7207.72,"end":7209.68,"speaker":"Audience Member","text":"Welcome the new year when it arrives."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7210.24,"end":7214.8,"speaker":"Fr Stephen De Young","text":"Visit store.ancientfaith.com and click the Calendars tab."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7216.56,"end":7232.65,"speaker":"Announcer","text":"We're back now with the Lord, Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7238.73,"end":7272.15,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. It's the third half of our three Thanksgiving episode. We're talking about the Eucharist. In the first half, we talked about sacrifice and the priesthood of Jesus Christ. And second part, we talked about the Passover and how that's related to the Eucharist. And now we're going to kind of focus in specifically on the body and blood of Christ, you know, the actual what we receive as Holy Communion, particularly in this part. So. All right, so where do we begin, Father?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7273.51,"end":7275.31,"speaker":"Fr Stephen De Young","text":"Well, we begin at the beginning."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7275.31,"end":7276.55,"speaker":"Fr Andrew Stephen Damick","text":"It is a very good place to start."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7276.55,"end":7287.27,"speaker":"Fr Stephen De Young","text":"Very good place to start. Yes. Thank you to both Rogers and Hammerstein. Thank you for that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7288.31,"end":7289.99,"speaker":"Fr Andrew Stephen Damick","text":"Some pop culture I know about."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7291.99,"end":7293.55,"speaker":"Fr Stephen De Young","text":"I have to throw you a bone once in a while."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7293.55,"end":7294.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thank you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7296.56,"end":7318.8,"speaker":"Fr Stephen De Young","text":"So we begin with all the way back again, the Old Testament, that with the idea. We've talked about this before on the show, back when we talked about the tabernacle and its furnishings. That one theme in the Torah is that God feeds his people."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7319.44,"end":7321.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7321.53,"end":7344.49,"speaker":"Fr Stephen De Young","text":"He feeds and provides for his people. This is a contrast there. And that's how it's very directly presented, a contrast with pagan idolatry, where once the nostrils are opened on the idol and once the spirit is in the idol, one of the priests primary jobs was to feed, dress, care for dust."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7344.73,"end":7345.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7345.53,"end":7368.67,"speaker":"Fr Stephen De Young","text":"The idol, we don't feed God. Right. And so. Yeah. And so that relationship of having to provide for the God is directly reversed. And one of the places we saw this when we were talking about the tabernacle furnishings was in the table of the showbread."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7369.39,"end":7371.15,"speaker":"Fr Andrew Stephen Damick","text":"The shoe bread."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7371.47,"end":7374.43,"speaker":"Fr Stephen De Young","text":"Yeah. Which is pronounced showbread, despite being spelled."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7374.43,"end":7382.42,"speaker":"Fr Andrew Stephen Damick","text":"Probably. Any recordings of early 17th century biblical scholars? I don't know."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7384.98,"end":7435.73,"speaker":"Fr Stephen De Young","text":"I'm pretty sure. Probably pretty sure. So, yeah. Where there was the table where the loaves of bread were kept in the tabernacle and then in the temple, which was to the table is God's table, but from that table, he's feeding the priests who are serving in the temple rather than the priests feeding him. And then, of course, this happens in a very literal sense in the wilderness, as Israel is in the wilderness. And is fed with manna and quail. People forget the quail. They don't talk about the quail. How many quail gave their lives in the course of 40 years in the wilderness?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7437.09,"end":7445.33,"speaker":"Fr Andrew Stephen Damick","text":"It's just uncomfortable to think about it coming out of their noses. Well, yeah, that might be why people are blocking it out."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7447.49,"end":7453.09,"speaker":"Fr Stephen De Young","text":"Right. The manna we know more about. Right. The sort of flaky bread stuff that fell out of the sky."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7453.36,"end":7453.84,"speaker":"Fr Andrew Stephen Damick","text":"What is it?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7455.52,"end":7480.59,"speaker":"Fr Stephen De Young","text":"Mana means? What is it Exactly. Yeah. Which made the. I still can't remember where it was that I lived that had manna donuts, but that just cracked me up. The donuts you look at and you say, what is it? I don't have to. Or they fell out of the sky, or I don't know what they were claiming there, but that's a real place."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7480.59,"end":7482.67,"speaker":"Fr Andrew Stephen Damick","text":"I just looked it up in Chino, California."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7483.79,"end":7487.63,"speaker":"Fr Stephen De Young","text":"Oh, well, there you go. Yeah, that's where I saw it. Middle SoCal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7489.71,"end":7519.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow, man. When I was growing up, when I was finishing growing up, although some would argue that I never completed that process. But the place where I was, where I finished high school, right around the corner from the school, was Jolly Pirate Donuts. And occasionally during photography class, when we were sent out to photograph nature, we would occasionally photograph apple fritters and crullers as they appeared in nature. There you go. That's our donut."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7519.44,"end":7525.96,"speaker":"Fr Stephen De Young","text":"So there's a place called Jolly Pirate Donuts. They did not sell wine or other strong drink. I would be disappointed."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7526.6,"end":7528.44,"speaker":"Fr Andrew Stephen Damick","text":"I do not recall that. They did."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7529.4,"end":7532.84,"speaker":"Fr Stephen De Young","text":"Because there are no jolly pirates. I have no wine or other strong drink."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7532.84,"end":7534.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Very disappointing in the piracy drink department."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7535.44,"end":7552.68,"speaker":"Fr Stephen De Young","text":"Yes. I mean, that was the whole point of the pirate versus ninja debate. Right. Would you rather be a pirate or a ninja? Was that the pirates, you know, far less competent, far less lethal, but have a much better time. Yes, absolutely right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7552.68,"end":7553.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7556.32,"end":7559.92,"speaker":"Fr Stephen De Young","text":"So also more scurvy, but that's a side issue as well."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7560.48,"end":7568.68,"speaker":"Fr Andrew Stephen Damick","text":"You just need to be Greek pirates and then you're with Lemon. I didn't think I'd make a Mr. Pano's joke when we started recording today, but there we are."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7568.68,"end":7572.56,"speaker":"Fr Stephen De Young","text":"There you go. Very on topic. Well, you're going to a Greek city."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7573.36,"end":7574.72,"speaker":"Fr Andrew Stephen Damick","text":"Indianapolis. That's true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7575.2,"end":7576.16,"speaker":"Fr Stephen De Young","text":"Indianapolis."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7576.16,"end":7579.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. Indianapolis. Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7582.48,"end":7594.79,"speaker":"Fr Stephen De Young","text":"Ana again. Right. Anyway, so we've now alienated all the Greek listeners who should be left listening by the end of this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7594.79,"end":7606.15,"speaker":"Fr Andrew Stephen Damick","text":"I'm actually going to a town called Noblesville, and I'm trying to work out in my head what that would be in Greek you know, Aretipolis, I don't know. But anyway, that's my. From the hip version of the name of that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7606.15,"end":7615.19,"speaker":"Fr Stephen De Young","text":"So we've now all of the Protestant listeners, all of the Roman Catholic listeners, and now all of the Greek listeners have left."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7615.19,"end":7617.27,"speaker":"Fr Andrew Stephen Damick","text":"All that's left are some scurvy pagans."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7617.75,"end":7622.39,"speaker":"Fr Stephen De Young","text":"Yes. So we'll fed them by the end of this too, I'm sure."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7622.39,"end":7628.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So where were we? Mana quiz."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7630.31,"end":7647.2,"speaker":"Fr Stephen De Young","text":"This theme of God feeding his people gets picked up in one of the relatively rare events featured in all four gospels. So remember the birth of Christ. Not in all four gospels."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7647.28,"end":7648,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7650.08,"end":7650.96,"speaker":"Fr Stephen De Young","text":"So other than."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7651.44,"end":7651.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7652.08,"end":7670.15,"speaker":"Fr Stephen De Young","text":"You have Christ's death and resurrection, you have his baptism that are in all four, but relatively rare. Right. So there's no exorcisms in St. John's gospel, for example, but the feeding of the 5,000, the feeding of the multitudes is in all four."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7670.63,"end":7671.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7672.07,"end":7675.59,"speaker":"Fr Stephen De Young","text":"And it's in St. Luke's gospel sort of twice, but we won't go into that now."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7679.11,"end":7679.51,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7681.51,"end":7711.75,"speaker":"Fr Stephen De Young","text":"This event in which Christ feeds multitudes of people and the where that story occurs in St. John's Gospel is at the beginning of chapter six. Right. And then later in chapter six, there is sort of an extended theological meditation on it, as one might expect from St. John the Theologian."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7711.75,"end":7712.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7714.67,"end":7725.15,"speaker":"Fr Stephen De Young","text":"Which sort of directly connects this idea of God feeding his people as expressed in this particular event, to the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7725.31,"end":7737.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So it's kind of long, but I'm going to read a lot of. Not all, but a lot of verses 22 through 59. And we'll just."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7737.47,"end":7739.71,"speaker":"Fr Stephen De Young","text":"There will be the occasional ellipsis if."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7739.71,"end":7741.63,"speaker":"Fr Andrew Stephen Damick","text":"You'Re following along some ellipses. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7742.19,"end":7745.2,"speaker":"Fr Stephen De Young","text":"You'll know it is time to turn the page when you hear the chime ring."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7746.63,"end":7784.96,"speaker":"Fr Andrew Stephen Damick","text":"When I was in middle school, since we're going to digress again. When I was in middle school and we still watch those film strips, you remember those everybody where, you know, they would play the cassette tape and then you heard, you would hear bong I. You know, as a 12 year old I worked hard to be able to replicate that sound and I was able to be so successful at it that I got. And because that sound was to indicate to the teacher to turn to the next frame in the film strip, I actually got the teacher to start skipping ahead by making that sound. I was so proud of myself. So there you go. I don't think I've ever revealed that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7784.96,"end":7794.48,"speaker":"Fr Stephen De Young","text":"On the other hand, 90% of our listeners are way too young to know at all what you're talking about. I know we're old men. We're yelling at clouds."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7795.68,"end":7797.12,"speaker":"Fr Andrew Stephen Damick","text":"We're pushing 50 pretty hard."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7798.01,"end":7798.13,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7798.13,"end":7804.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, all right. Yes. There will be some ellipses. There will be no bongs. And by that I mean the sound."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7804.65,"end":7811.85,"speaker":"Fr Stephen De Young","text":"Yeah. Wow. Wow. This is what happens when we pre record and we're unsupervised. That's what this is right here."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7812.09,"end":7818.89,"speaker":"Fr Andrew Stephen Damick","text":"Trudy, come save us. Now. There's no Trudy. Okay, so. Right, I'm gonna read this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7818.97,"end":7820.65,"speaker":"Fr Stephen De Young","text":"Wheels coming right off this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7820.65,"end":7886.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we're gonna kind of stop and start along the way. Way to offer some comments. Okay, so, all right. Starting with verse 22 of John, chapter six on the next day. And that means after the feeding of 5,000 on the next day, the crowd that remained on the other side of the sea saw that there had been only one boat there and that Jesus had not entered the boat with his disciples, but that his disciples had gone away alone. Other boats from Tiberias came near the place where they had eaten the bread after the Lord had given thanks. So when the crowd saw that Jesus was not there nor his disciples, they themselves got into the boats and went to Capernaum seeking Jesus. When they found him on the other side of the sea, they said to him, rabbi, when did you come here? Jesus answered them, truly, truly, I say to you. You are seeking me not because you saw signs, but because you ate your fill of the loaves. Do not work for the food that perishes, but for the food that endures to eternal life, which the Son of Man will give to you. For on him, God the Father has set his seal."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7887.41,"end":7888.05,"speaker":"Fr Stephen De Young","text":"Pause it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7888.05,"end":7888.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7890.85,"end":7912.08,"speaker":"Fr Stephen De Young","text":"So now that might what you read there for those following along at home. This is in verse 26, what you said there about when you read, not because you saw signs, but because you ate your fill of the loaves."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7913.52,"end":7913.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7914.4,"end":7920.4,"speaker":"Fr Stephen De Young","text":"That might be confusing to some folks because they might say, wasn't the sign that he fed all those people."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7921.12,"end":7921.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7923.28,"end":7941.85,"speaker":"Fr Stephen De Young","text":"That all those people were able to eat their filled. That kind of was the sign, wasn't it? And so this relates to. St. John uses the term sign in a very particular way all through his gospel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7942.17,"end":7946.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And isn't it sometimes called the Book of the Seven Signs? Like there's seven great signs."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7946.81,"end":7960.54,"speaker":"Fr Stephen De Young","text":"Well, so there was this whole critical theory that St. John's gospel was a reworking of what they called the Signs Gospel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7960.54,"end":7965.34,"speaker":"Fr Andrew Stephen Damick","text":"Ah, I see. Okay. Okay. I'm not going there. I'm just. I've just heard that, you know. Right, okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7965.42,"end":7966.54,"speaker":"Fr Stephen De Young","text":"Right. So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7972.46,"end":7973.5,"speaker":"Fr Andrew Stephen Damick","text":"Didn'T want to derail you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7973.74,"end":7974.98,"speaker":"Fr Stephen De Young","text":"I'll just go ahead and refer to this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7974.98,"end":7975.42,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":7975.66,"end":8010.32,"speaker":"Fr Stephen De Young","text":"I was trying to decide whether to just openly reference this. So the now unfortunately departed Dr. Daniel Fletcher, his doctoral dissertation was about. This was about St. John's use of signs. And he particularly connected it to the Book of Numbers and the way signs are used in the Book of Numbers in the wilderness. And so the idea here of a sign is not just, oh, a miracle."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8011.28,"end":8011.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8011.68,"end":8067.89,"speaker":"Fr Stephen De Young","text":"Right. But it is a miraculous occurrence which represents the reality of the impending coming of the kingdom of God. So what Christ is saying here is that. Is that they didn't follow after Jesus because they understood what he had done. Right. That they looked at what he had done and said, this is God feeding his people. This is like the manna in the wilderness. This is. And so this is a sign, right, that the kingdom of God is near, that this is the Messiah. We need to go find him and follow him. Right. They were just looking for him because they were hungry again."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8067.97,"end":8071.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This guy's got food, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8073.17,"end":8102.81,"speaker":"Fr Stephen De Young","text":"They were approaching him. And so this is why he says to them, right? You need to not be so concerned striving after filling your belly, Right. And be more concerned about the food that endures to eternal life which the Son of Man, this messianic title, will give you. So that's what he's aiming at there. He's saying, you guys are just. You're in it. You're looking at this like cool magic tricks, right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8102.81,"end":8103.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8104.73,"end":8113.05,"speaker":"Fr Stephen De Young","text":"You have something you want me to do for you right here and now you're not understanding what's really going on, and you're not really trying to come and become my disciples."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8113.13,"end":8117.77,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. All right, we ready to keep rolling here?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8118.22,"end":8118.62,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8118.7,"end":8155.81,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Verse 28. Then they said to him, what must we do to be doing the works of God? Jesus answered them, this is the work of God that you be faithful to him whom he has sent. So they said to him, then what sign do you do that we may see and trust you? What work do you perform? Our fathers ate the manna in the wilderness, as it is written. He gave them bread from heaven to eat. Jesus then said to them, truly, truly, I say to you, it was not Moses who gave you the bread from heaven, but my Father gives you the true bread from heaven. For the bread of God is he who comes down from heaven and gives life to the world."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8156.85,"end":8182.22,"speaker":"Fr Stephen De Young","text":"Pause it. Yep. Right. So they're sort of getting closer to the right track, but so they pick up on the Word sign and use it different, differently, right? So they say to him, oh, okay, so you want us to come and follow you and become yourself. So, you know, well, show us something."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8182.7,"end":8184.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8184.46,"end":8222.72,"speaker":"Fr Stephen De Young","text":"Makes you the guy that they basically ask for bread again. Yeah, right. Like our Father's ate man in the wilderness, right? He gave the bread for evidence. So, hey, give us some more bread. Right? Act two. Give us some more bread. And so Jesus response says these two things. First of all, it wasn't Moses, it was God who gave the bread. So again, encouraging them to see. They're saying, what sign will you do? What will you do? This is what Moses did."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8223.89,"end":8224.77,"speaker":"Fr Andrew Stephen Damick","text":"They followed Moses."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8224.77,"end":8269.69,"speaker":"Fr Stephen De Young","text":"You do. And he's saying, it wasn't Moses, it was God. Meaning if I give you bread from God, this is sign in the other sense. Right. He's trying to push them to a bigger not. Just like, I'm a prophet, you should listen to what I say. But that Christ is beyond that. Then he goes to further define the bread he was talking about, because he mentioned that bread that continues to eternal life. Now he says, that bread is he who comes down from heaven and gives life to the world."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8269.77,"end":8288.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay, so then verse 34, they said to him, sir, give us this bread always. Jesus said to them, I am the bread of life. Whoever comes to me shall not hunger, and whoever is faithful to me shall never thirst. But I said to you that you have seen me and yet are not faithful."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8289.45,"end":8293.61,"speaker":"Fr Stephen De Young","text":"Right? So they already have it. Yeah, yeah, They've met him."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8293.69,"end":8366.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You've got the bread. I'm standing in front of you. Right? So, okay, skipping ahead a few verses now to verse four. So the Jews grumbled about him because he said, I am the bread that came down from heaven. They said, is not this Jesus, the son of Joseph, whose father and mother we know? How does he now say, I have come down from heaven? Jesus answered them, do not grumble among yourselves. No one can come to me unless the Father who sent me draws him, and I will raise him up on the last day. It is written in the prophets, and they will all be taught by God. Everyone who has heard and learned from the Father comes to me. Not that anyone has seen the Father, except he who is from God. He has seen the Father. Truly, truly, I say to you, whoever is faithful to me has eternal life. I am the bread of life. Your fathers ate the manna in the wilderness and they died. This is the bread that comes down from heaven so that one may eat of it and not die. I am the living bread that came down from heaven. If anyone eats of this bread, he will live forever. And the bread that I will give for the life of the world is my flesh."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8367.95,"end":8389.96,"speaker":"Fr Stephen De Young","text":"Okay, pause it there. So there's a little bit of wordplay going on here with this grumbling, right? So the Judeans grumble. He says, don't grumble. Right. That word for grumbling is the word that's used in the Septuagint for what the Israelites were kept doing in the wilderness."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8390.04,"end":8390.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8390.84,"end":8438.36,"speaker":"Fr Stephen De Young","text":"Where they became disaffected. They would grumble. They'd grumble against Moses. They grumble. Right. Against God. Right. Brought us out in the wilderness to die. Right. Over and over and over again. Right. And so this is deliberately setting up like, well, not a lot has changed. Right. But also that the people who are, who are talking to Christ now are still not seeing what is really going on in front of them. Right. In the same way that those in the wilderness, we're just sort of concerned day to day, oh, we don't have enough water. Oh, we don't have enough food. Oh, we don't. Right. Like not seeing. Hey, remember the Exodus that just, like, happened, right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8440.92,"end":8444.44,"speaker":"Fr Andrew Stephen Damick","text":"God brought us up out of Egypt and he's going to abandon us in the wilderness."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8444.68,"end":8493.66,"speaker":"Fr Stephen De Young","text":"Right. And being faithful to God and trusting in him to bring them through now to the land of Canaan. Right. The same thing is going on in terms of Jesus. Right. They keep asking, give us some more bread. Right. But they're still thinking about it in this manner and not understanding what's really happening. And so even the generation that wasn't, like, struck down in the wilderness for their grumbling against God and against Moses, they all died in the wilderness. But even those who of the next generation that actually went into the land were brought into the land, they still eventually died, right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8494.46,"end":8495.74,"speaker":"Fr Andrew Stephen Damick","text":"Yep, Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8496.14,"end":8508.7,"speaker":"Fr Stephen De Young","text":"And so what Christ is talking about is a faithfulness to him and a feeding right on the bread which he is, which he identifies here as his flesh."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8509.34,"end":8509.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8510.06,"end":8523.94,"speaker":"Fr Stephen De Young","text":"That he will give for the life of the world that leads to eternal life, not just to another few days of life on this earth."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8524.58,"end":8533.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you get the sense especially that when he says, the bread I would give for the life of the world is my flesh, that. That sounds nuts to them by what they say next."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8534.18,"end":8534.74,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8536.66,"end":8596.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Verse 52, the Jews say that it sounds nuts. The Jews then disputed among themselves, saying, how can this man give us his flesh to eat? So Jesus said to them, truly, truly, I say to you, unless you eat the flesh of the Son of Man and drink his blood. You have no life in you. Whoever feeds on my flesh and drinks my blood has eternal life. And I will raise him up on the last day. For my flesh is true food, and my blood is true drink. Whoever feeds on my flesh and drinks my blood abides in me, and I in him, as the living Father sent me. And I live because of the Father. So whoever feeds on me, he also will live because of me. This is the bread that came down from heaven, not like the bread the fathers ate and died. Whoever feeds on this bread will live forever. Jesus said these things in the synagogue as he taught at Capernaum."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8600.14,"end":8614.86,"speaker":"Fr Stephen De Young","text":"And that last verse is important because we didn't get the setting at the beginning. We were still. They went looking for Jesus and found him in Capernaum. Yeah, but he's actually saying all these things in the synagogue as he's teaching in the synagogue."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8614.94,"end":8620.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which kind of seem especially weird to a lot of."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8621.54,"end":8628.66,"speaker":"Fr Stephen De Young","text":"This isn't what we came here for today. Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8630.74,"end":8631.14,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8633.46,"end":8682.04,"speaker":"Fr Stephen De Young","text":"We talked a little bit about the comparison and contrast that goes on here with the manna. Right. The bread from heaven in the Old Testament. There's also a little bit of a connection to what's going on with the showbread in that Christ here connects coming to know God and learning from God, this relational element with the eating of the bread in the same way in which the showbread was eaten in the presence of God. So there's this connection between eating the bread and drawing close to God that's also sort of interwoven right in there. And some of the verses we skipped developed that a little more. But I mean, it was long enough. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8682.04,"end":8682.36,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8684.52,"end":8728.1,"speaker":"Fr Stephen De Young","text":"But so again, we're not intending to pick on whatever Protestant listeners may still be listening, but this passage we just read. Right. And again, I think this really stems from some of the same kind of reactionary thinking against medieval Roman Catholicism, which speaks very clearly about eating Christ's flesh and drinking his blood. There have been a lot of historical efforts from some quarters to try to argue that this has nothing to do with the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8729.38,"end":8731.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8732.1,"end":8765.63,"speaker":"Fr Stephen De Young","text":"And those. And those arguments are kind of weird and not very good. So one of these arguments is kind of really circular and sort of the denouement of this argument was made by Rudolf Bultmann, who's a 20th century German. So at least I'm branching out in who I pick on."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8765.71,"end":8770.91,"speaker":"Fr Andrew Stephen Damick","text":"He was kind of the boogeyman in scripture classes when I was in seminary."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8773.63,"end":8777.02,"speaker":"Fr Stephen De Young","text":"He wasn't all bad I wouldn't. Just mostly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8778.14,"end":8781.18,"speaker":"Fr Andrew Stephen Damick","text":"Mostly all bad. There's only one thing you can do."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8782.46,"end":8794.7,"speaker":"Fr Stephen De Young","text":"He had a lot of quotes that are super ironic now. Right. Like, who could believe in the resurrection of the dead in the age of radio. Wow."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8796.46,"end":8797.02,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8797.02,"end":8801.14,"speaker":"Fr Stephen De Young","text":"We're the age of the wireless people. How could we possibly believe in this primitive superstition?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8801.14,"end":8809.21,"speaker":"Fr Andrew Stephen Damick","text":"It's current year. It's amazing. A biblical scholar making the current year argument."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8809.21,"end":8828.77,"speaker":"Fr Stephen De Young","text":"Yes, that's so great. But what this is based on, again, Bultmann's exhibit A. But this is found more widely than it should be. People have noticed about St. John's gospel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8830.23,"end":8830.47,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8832.87,"end":8860.47,"speaker":"Fr Stephen De Young","text":"Sort of the traditional places you'd go to look for things about the sacraments in the other gospels aren't there in St. John's gospel. What do I mean by that? Well, for example, there's this weird little thing in the way Christ's Baptism is in St. John's Gospel, but the way it's narrated. There's this weird thing. Thing where it doesn't actually describe the baptism."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8861.27,"end":8862.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8862.63,"end":8867.11,"speaker":"Fr Stephen De Young","text":"He goes and he interacts with St. John, the forerunner, and then it talks about him coming up out of the water."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8867.35,"end":8871.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So St. John is avoiding sacraments like it skips."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8871.23,"end":8878.23,"speaker":"Fr Stephen De Young","text":"Right. And even more sort of major is St. John's gospel doesn't have the institution of the Eucharist in it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8878.39,"end":8878.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8879.91,"end":8920.15,"speaker":"Fr Stephen De Young","text":"When you get to the place of the mystical supper in St. John's Gospel, it describes him washing the disciples feet. Christ washing the disciples feet. And doesn't describe him instituting the Eucharist that's in the other three gospels. And so with Bultmann and some of the other people who make this argument, it is in part a relic of this older, now very outdated view that The Gospels, especially St. John's Gospel, was sort of this weird independent composition that had nothing to do with the other ones and that it was that they were produced by these different communities."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8921.35,"end":8921.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8921.83,"end":8924.31,"speaker":"Fr Stephen De Young","text":"This is the communities write books theory."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8924.63,"end":8925.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8925.75,"end":8928.71,"speaker":"Fr Stephen De Young","text":"Which tells me that these people have never been a member of a committee."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8929.99,"end":8936.15,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, communities sometimes can translate books."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8938.26,"end":8942.14,"speaker":"Fr Stephen De Young","text":"No, they don't. Individual people do the translating and then committees argue about it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8942.14,"end":8942.82,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8943.14,"end":8944.18,"speaker":"Fr Stephen De Young","text":"And hold up the process."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8944.34,"end":8944.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8947.14,"end":8976.63,"speaker":"Fr Stephen De Young","text":"So the. But. So there's this idea that, oh, whatever we see, we have to isolate St. John's gospel and then whatever we see in it, whatever features we want to notice, that then reflects the community that produced it. And so the Johannine community. Well, clearly, since there's not the institution of the Eucharist there and baptism gets gift this is a community that didn't have sacraments."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8979.35,"end":8979.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":8980.15,"end":9010.73,"speaker":"Fr Stephen De Young","text":"Or St. John himself. If we have this writer who of course, most of the people who hold this theory wouldn't hold was the actual Saint John. But I digress, right. The author or authors of St. John's Gospel were anti sacramental or didn't believe in sacraments. Right. So once you then make that argument and you come to say Christ telling Saint Nicodemus that he had to be born of water and the Spirit, that can't be referring to baptism."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9011.13,"end":9013.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because you've got this a priori commitment."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9013.85,"end":9035.89,"speaker":"Fr Stephen De Young","text":"Because St John is anti baptism, he's anti sacrament. And so when Christ in John 6 talks about eating his body, eating his flesh and drinking his blood, he can't be talking about the Eucharist because St. John and his community didn't have the Eucharist, they didn't do sacraments. This is why I say this is like a textbook circular argument."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9038.21,"end":9038.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9038.61,"end":9040.37,"speaker":"Fr Stephen De Young","text":"Of assuming what you want to prove."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9041.41,"end":9043.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, Exactly. Exactly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9043.42,"end":9050.7,"speaker":"Fr Stephen De Young","text":"You take half the data, argue for a conclusion based on that half the data, and then use that conclusion to exclude the other half of the data."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9051.34,"end":9054.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. Don't try this at home, kids."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9054.62,"end":9055.14,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9055.14,"end":9058.94,"speaker":"Fr Andrew Stephen Damick","text":"Or anywhere, really. Yes, Definitely not in school."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9059.82,"end":9062.62,"speaker":"Fr Stephen De Young","text":"This is a waste of time. This is sophistry. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9063.74,"end":9064.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9064.22,"end":9087.27,"speaker":"Fr Stephen De Young","text":"So, right. That dog, don't. Don't hunt. Right. You sometimes also get. Well, well, look, you know, we're going to accept that St. John is actually St. John or just that St. John's community was an actually existing church that we have evidence of."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9087.43,"end":9087.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9087.79,"end":9108.33,"speaker":"Fr Stephen De Young","text":"That had the Eucharist, but. Right. Christ doesn't institute the Eucharist until like right before his death, whereas John 6 takes place like way before that. Right. So how can Christ be talking about the Eucharist?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9109.05,"end":9109.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9109.53,"end":9111.93,"speaker":"Fr Stephen De Young","text":"Because he hasn't instituted it yet."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9112.33,"end":9115.61,"speaker":"Fr Andrew Stephen Damick","text":"Are they trying to say like he hasn't thought it up, hasn't come up with that yet?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9115.61,"end":9132.18,"speaker":"Fr Stephen De Young","text":"And he's like, oh, I'm not sure. Usually they don't say that. Usually they say something like, no one would have understood what he was talking about. About. And it's like what? Christ talked about things during his ministry and no one understood who he was talking about until after the resurrection. You don't say."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9132.82,"end":9134.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9135.14,"end":9145.34,"speaker":"Fr Stephen De Young","text":"Like the Gospels literally say over and over again that Christ said things all the time during his earthly ministry that no one understood until after the resurrection."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9145.34,"end":9146.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9146.58,"end":9148.1,"speaker":"Fr Stephen De Young","text":"So this would be par for the course."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9148.34,"end":9149.3,"speaker":"Fr Andrew Stephen Damick","text":"Depth charges."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9149.65,"end":9149.77,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9149.77,"end":9151.01,"speaker":"Fr Andrew Stephen Damick","text":"As you like to do."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9151.73,"end":9158.61,"speaker":"Fr Stephen De Young","text":"And especially in this case, we're literally told in John 6 in the text itself that no one understood what he was talking about."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9158.69,"end":9159.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9159.09,"end":9175.37,"speaker":"Fr Stephen De Young","text":"After we left off, the disciples come to Jesus and say, basically, like, this is a hard saying. Like, what are you talking about? Right, yeah. He's like, Jesus says, yeah, will you now also leave? Right, like, yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9175.37,"end":9194.48,"speaker":"Fr Andrew Stephen Damick","text":"It's really notable, I think that he doesn't at any point in this say, okay, wait, sorry, guys, guys, you misunderstood. This is a metaphor for something else. So calm down. I'm not talking about eating flesh or drinking blood. I mean, I'm talking about eating flesh, quote unquote. Drinking blood, quote unquote."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9194.8,"end":9232.29,"speaker":"Fr Stephen De Young","text":"Right, Right. And if. Right. So let's suppose for the sake of argument that the Eucharist is quote unquote, just symbolic. Pageau just broke another pencil. Let's say it's just right. This is just some nebulous woo woo sense that it's the body and blood of Christ. Right. It represents it in some way or something. But isn't. Right. Why would this be the metaphor you'd choose?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9232.61,"end":9234.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A cannibalism metaphor."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9234.89,"end":9250.93,"speaker":"Fr Stephen De Young","text":"Apparently, if there's no reality to it, it's like cannibalism. Guys, if you could choose any metaphor, right. You could choose any metaphor in the world because the metaphor has no connection to the reality. It's purely a metaphor. Why would you choose this one?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9251.01,"end":9262.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is. Even among pagans, cannibalism was considered to be super oogie. You know, only certain pagans even did this kind of thing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9263.67,"end":9270.47,"speaker":"Fr Stephen De Young","text":"Right? Yeah, well, and we know that from later Roman sources. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9270.47,"end":9270.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9270.83,"end":9275.67,"speaker":"Fr Stephen De Young","text":"They get together and eat the body and drink the blood of this Crestus. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9275.67,"end":9278.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're like, these Christians are like cannibals."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9278.83,"end":9283.19,"speaker":"Fr Stephen De Young","text":"What's wrong? Yes, right. They get accused of cannibalism."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9283.19,"end":9284.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9284.77,"end":9289.77,"speaker":"Fr Stephen De Young","text":"Why would you keep using this metaphor if it's just a metaphor?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9289.77,"end":9292.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Kind of a fortunate choice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9293.89,"end":9295.25,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9295.25,"end":9297.41,"speaker":"Fr Andrew Stephen Damick","text":"In this world you will have hermeneutical trouble."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9298.05,"end":9323.02,"speaker":"Fr Stephen De Young","text":"Yes. But so in. Right. That creates the biggest problem with trying to take this text in some other direction as referring to something else. Right. Is whatever kind of spiritual thing you want to say, it's actually talking about. It's always going to beg the question, so why this metaphor then?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9323.26,"end":9323.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9326.62,"end":9329.34,"speaker":"Fr Stephen De Young","text":"Right. So then why is it compared to this of all things?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9330.46,"end":9331.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9332.3,"end":9348.71,"speaker":"Fr Stephen De Young","text":"And so, right. Bluntly we gotta say, right. Maybe our doctrine should come from the Bible. Right. Instead of going to the Bible and telling it what it can and can't say."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9349.19,"end":9350.79,"speaker":"Fr Andrew Stephen Damick","text":"Enough of those Traditions of men."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9352.71,"end":9432.32,"speaker":"Fr Stephen De Young","text":"Like, it's kind of clear on the face of it what it says. Right. And to me, most decisive about this. And we talked about this in our how to and not to read the Bible. Right. You can't get into the brain of the original author. Right. From this vantage point. Right. You can try all you like to figure out what was in St. John's head when he wrote this. Right. Good luck to you. You're probably just going to project yourself back into history. But we can try to recreate the ear. Right. Who are the first people who heard these words? Right. Probably read to them. Right. Who are the first people who heard this from St. John? And the first people who heard this from St. John were a group of people who gathered at least once a week to celebrate the Eucharist and heard. Right. Someone in the leadership position, depending on where they were, say, this is my body broken for you. This is my blood shed for you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9433.12,"end":9433.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9433.6,"end":9441.85,"speaker":"Fr Stephen De Young","text":"And participated in the Eucharist. So the people who originally heard this would have immediately connected it to the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9442.41,"end":9442.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9443.85,"end":9446.33,"speaker":"Fr Stephen De Young","text":"That they were celebrating at least weekly."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9446.81,"end":9453.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, every indication about what early Christian worship looks like says that that's what they're doing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9453.93,"end":9469.25,"speaker":"Fr Stephen De Young","text":"Yes. And so since that's what they're doing. Right. Since at least 1 Corinthians was written, which was written before St. John's Gospel, they would have immediately jumped to that conclusion. And there is nothing in the text to dissuade you from that conclusion."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9469.49,"end":9469.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9470.45,"end":9474.13,"speaker":"Fr Stephen De Young","text":"St. John famously has these editorial comments all through his Gospel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9474.29,"end":9474.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9474.65,"end":9480.61,"speaker":"Fr Stephen De Young","text":"Right, Right. Like, he said this to refer to the temple that was his body, where he clarifies things just in case."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9481.17,"end":9481.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9482.45,"end":9485.01,"speaker":"Fr Stephen De Young","text":"There's someone clueless. He does not clarify this."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9485.33,"end":9486.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9488.05,"end":9491.49,"speaker":"Fr Stephen De Young","text":"At all. Right. It's allowed to just be what it is."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9491.81,"end":9492.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9492.17,"end":9523.01,"speaker":"Fr Stephen De Young","text":"And that's how everyone would have read it and heard it. But so, moving on, one important element here. Right. More important than just defending the traditional normal read of it, actually, is that this gives us another little piece in terms of the Eucharist, because what Christ says here talks about what we could call a positive element of the sacrifice of the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9523.52,"end":9523.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9523.84,"end":9547.04,"speaker":"Fr Stephen De Young","text":"And what do I mean by positive? Well, we talked about. Right. The forgiveness of sins, peace with God element. We talked about the offering of thanks. Right. And praise to God element. But also that this is positive in the sense of the life of the participants and being positively transformative."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9547.04,"end":9547.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9547.36,"end":9549,"speaker":"Fr Stephen De Young","text":"I mean, just the remission of sins."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9549,"end":9553.83,"speaker":"Fr Andrew Stephen Damick","text":"There's what, twice in this passage where Christ Says, I'm going to raise him up at the last day."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9554.79,"end":9555.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9555.91,"end":9556.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9556.23,"end":9593.08,"speaker":"Fr Stephen De Young","text":"There's resurrection, promise, the one who learns from God, the one who knows God. This knowledge is drawing closer to God, encountering him, being empowered by him, receiving eternal life, life and strength, becoming like God. Right. Through participating in the Eucharist, you have life in you. Right? Yeah. And so that is a critically important element."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9594.12,"end":9604.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. And connects with the general sacrificial understanding that you become like what you worship, or as we would say, you are what you eat."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9605.86,"end":9644.19,"speaker":"Fr Stephen De Young","text":"Yes. So I am a Big Mac anyway. Right. So that's that positive. And that's a big part of what it means, you know, when we talk about the in return, we receive the body and blood of Christ. Yeah. So another importance, though, an important image related to the Eucharist in the New Testament and importance of this idea of Christ's flesh is related to the image of the wedding feast."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9644.91,"end":9646.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The marriage supper of the Lamb."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9646.63,"end":9661.16,"speaker":"Fr Stephen De Young","text":"Right. The wedding celebration. And this is obviously, this originates in the Old Testament in the prophets, where God presents himself as sort of the husband of Israel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9661.4,"end":9661.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9662.2,"end":9664.84,"speaker":"Fr Stephen De Young","text":"You know, sometimes separately, of Judah and Israel."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9664.84,"end":9667.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. Writ large in Hosea especially."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9668.68,"end":9762.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And Israel is the unfaithful spouse in this situation, the unfaithful wife. Right. And so we see that those themes get continued into the New Testament. They're particularly prominent in various ways in the parables that Christ tells, many of which involve, you know, the coming of the bridegroom, the preparation for a marriage feast. You get these explicit parables that revolve around wedding feast and marriage feasts in, like, Matthew chapter 22 and Luke chapter 12, and Luke chapter 14. We won't read those whole things here because we're just talking about sort of the theme, you see, this theme of the wedding supper of the lamb in Revelation 19. Right. And so this is the way in which Christ's glorious appearing is discussed. One of the preeminent ways is as this marriage celebration. Right. This sort of conservation of the marriage between Christ and his bride. Right. The church, the assembly, the assembled people of God. And this is not, to reiterate some things we said last time, it is not that God got a divorce from Israel and now has a new wife. That's not how any of this works."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9762.11,"end":9762.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9766.15,"end":9944.98,"speaker":"Fr Stephen De Young","text":"This is the restoration of that marriage. Right. So the new covenant is like a renewal of vows, as it were. So one of the places where this comes out specifically in terms of the Eucharist, I mean, the fact that it's a wedding feast. Right. We can see the obvious sort of connections there. Right. But to put a finer point on it, in John 19, and this is specifically verses 31, 37. So when St. John in particular narrates Christ's crucifixion and death, he starts drawing on all of this language from church, Genesis. Right? And so the. The Christ completing his work and then resting on the Sabbath. We've talked about some of these things before, how the Theotokos is referred to as woman repeatedly in St. John's Gospel, and then gets referred to as mother at the side of the cross in the way shah becomes Eve. Right. So he's drawing on all of this imagery. And one of those that I think we pass by or quickly is in that section of John 19, it describes the opening of Christ's side, right. When Christ is pierced with the spear, Right. And the opening of his side is supposed to call us back to Adam's side, right? Being opened in Genesis chapter two. And Adam's side is open to create woman, to create his bride. And when he sees her, he says, this is bone of my bone and flesh of my flesh, Right? And we're told because of this, the two become one flesh. And so when Christ's side is open, blood and water flow out and pick your church, Father. And look this passage up. This is connected to the water of baptism and blood in the Eucharist, which sort of create, as we've talked about many times, his bride, the church. And so part of this imagery of eating Christ's flesh is becoming one flesh with Christ."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9945.7,"end":9947.38,"speaker":"Fr Andrew Stephen Damick","text":"That's cool, right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9949.47,"end":9971.95,"speaker":"Fr Stephen De Young","text":"This imagery. But so the blood there coming out of his side, the blood being involved in the Eucharist. To anyone who's passingly familiar with the Torah, the idea of drinking Christ's blood raises questions."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9971.95,"end":9981.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right. As it should, given all that cannibalism stuff we were saying earlier. Yeah. So we got. Here's another voicemail that we got, and this is from Nathan."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":9984.45,"end":10058.75,"speaker":"Audience Member","text":"Hello, Fathers. My question has to do with the Eucharist in general and in particular the consuming of the wine and. Or the blood of Christ during the ritual. In the Old Testament, the worshipers were prohibited from drinking the blood, and that blood was taken in particular during the day of atonement into the tabernacle and was used to atone the elements within the tabernacle to remove the taint. Is it accurate to say that now in the New Testament, we are commanded to drink the blood primarily because our bodies are now the tabernacle of the Lord of the Holy Spirit? And that because we still sin, albeit we shouldn't, but we still do, once we have had confession and that sin has been absolved, we then need the blood of the sacrifice, the blood of the Lord, to go into our bodies, which is the tabernacle of the Holy Spirit, the tent of the Holy Spirit, in order to cleanse, to wipe away, to expiate, to smear away that taint and corruption that's left by that sin. I look forward to hearing your comments. Thank you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10058.91,"end":10059.55,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10059.55,"end":10072.19,"speaker":"Fr Andrew Stephen Damick","text":"Well, is he onto something there? I mean, there's certainly in the liturgy there's talk about washing away sins and all that sort of stuff related to the blood of Christ. Yes, yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10073.63,"end":10078.83,"speaker":"Fr Stephen De Young","text":"And in fact, I promised in the second half that we would get to this in the third half."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10081.64,"end":10081.76,"speaker":"Announcer","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10081.76,"end":10082,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10082,"end":10086.04,"speaker":"Fr Stephen De Young","text":"Starting with why the blood drinking was forbidden."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10086.04,"end":10086.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10086.64,"end":10216.7,"speaker":"Fr Stephen De Young","text":"I think we've. We've talked about this, this a couple of times. So you see this sort of descent happen in the early chapters of Genesis, right, where in paradise, right, that the humans are eating fruit, right. Nothing dies from fruit. Fruit is. The rest of the creation is sort of offering itself to humanity for food in a way that's not doing any harm to anything. Part of the curse when humanity is expelled from paradise is now you're going to have to bring forth food from the earth through the sweat of your brow. Now the creation isn't going to sort of offer itself to you as food. You're going to have to work to bring forth this food by farming. Right? And this kind of growing and harvesting food, you're killing plants, Right? So there's already a bit of a descent there, right, both in the relationship between man and the rest of creation. And in terms of now it's dying, it's not offering itself. You're killing it, needing it. Right. But it's only after the flood that humanity is given permission to eat meat, to eat animals. And it's in that context of this further descent, right, where humanity is now going to be hunting its fellow creatures, that. That's where the blood drinking, because the blood is the life. That's where that limit is placed, because that is the limit to remind humanity not to become completely predatory."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10217.32,"end":10217.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10219.72,"end":10235.56,"speaker":"Fr Stephen De Young","text":"Right. That's where there's like a shift, right, where you're killing and feeding on other living fit things. But we don't go so far as life directly feeding on life."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10236.04,"end":10237.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10237.64,"end":10241.48,"speaker":"Fr Stephen De Young","text":"Right. So it's a limit on sort of predation, Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10241.48,"end":10246.8,"speaker":"Fr Andrew Stephen Damick","text":"Which that limit's not there for Piggins. They have blood Drinking rituals."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10247.44,"end":10277.75,"speaker":"Fr Stephen De Young","text":"Right, right. But this is why this applies, the blood drinking part, Even in Acts 15 that we talked about last time, this is why the blood drinking part applies to everybody. Right. So the pagans should not have been doing that. It's not like eating pork. Right, Right. It's not like we didn't read it because it wasn't completely on point. But right before the passage in Deuteronomy, we read about the. The sort of meal on the pilgrimage. There was actually a comment that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10280.63,"end":10280.91,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10280.91,"end":10302.64,"speaker":"Fr Stephen De Young","text":"Commandment that was there was that the Israelites were not to eat an animal that they found dead, but they could take it and give it to a foreigner or sell it to a foreigner. Right. So there's no problem with them eating the animal that was found dead. This was just something that was off limits to the Israelites. But the blood drinking is off limits to everybody. Why? Because it's. It's the signifier of man becoming predatory."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10302.88,"end":10304.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10304.52,"end":10310.68,"speaker":"Fr Stephen De Young","text":"And we talked about werewolves and cannibalisms and all that. Last year's Halloween episode."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10310.68,"end":10311,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10311,"end":10329.14,"speaker":"Fr Stephen De Young","text":"That kind of predatory thing. Humanity was not created to be a predator in the world of any kind. Right. So that said, why then in the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10329.7,"end":10331.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How did it become. Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10332.34,"end":10383.82,"speaker":"Fr Stephen De Young","text":"Right. And so there's two main pieces here. The first one is one that's been sort of a theme all through this, is that Christ's sacrifice is one of self offering. Right. So Christ is offering his flesh and his blood to us. We are not preying upon Christ. Right. So that's sort of that first element. Right. So it is more like in paradise, creation offering itself to us as food than like murderous cannibalism. Right. But the other element is exactly what Nathan was talking about. Right. That the life that is in Christ's blood is eternal life. It's the life of God."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10384.22,"end":10386.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not animal life. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10386.82,"end":10443.62,"speaker":"Fr Stephen De Young","text":"Which purifies, which is eternal life, which drives out sins, purifies from sin, cleanses from sin. This is what I mentioned in the second half, that there is kind of sideways an element of atonement in the Eucharist. This is what I was pointing towards was precisely what Nathan was pointing out, that this element of the purification of sin, and this is when Christ's blood is talked about in the Scriptures and the Johannian literature is a particular place where this happens a lot. It's talked about in terms of his blood purifying, purging, washing us from sin, not his blood appeasing wrath."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10443.62,"end":10444.58,"speaker":"Fr Andrew Stephen Damick","text":"The Blood God."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10444.98,"end":10486.44,"speaker":"Fr Stephen De Young","text":"Blood for the Blood God. Yeah. So, yeah, so those are the, Those are the sort of elements surrounding that. And it's not again, that like now it's okay for Christians because they. Acts 15 says it's not. It's still sinful to. Cannibalism, obviously is still sinful. And eating and drinking animal blood is still sinful and still has that predatory significance. But we are not preying upon Christ. Christ is offering his blood to us to purify us from sin and its effects."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10487.16,"end":10498.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, okay, we got another question that came in asking about. We actually have a couple of questions about this, but from a couple different angles about the presence of Christ in the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10501.8,"end":10504.44,"speaker":"Fr Stephen De Young","text":"Hello, Fathers, my name is Grant and."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10504.44,"end":10506.24,"speaker":"Audience Member","text":"I had a question on the topic."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10506.24,"end":10513.54,"speaker":"Fr Stephen De Young","text":"Of Christ's presence within the Eucharist. Is God's mystical presence something that is relative to."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10513.69,"end":10525.89,"speaker":"Audience Member","text":"To the person receiving the Eucharist or continually present, regardless of who partakes in the mysteries? As an added topic, can God be present in a different church communion, even."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10525.89,"end":10533.53,"speaker":"Fr Stephen De Young","text":"That of a low church Protestant group? Let's say, supposing a faithful orthodox Christian has nowhere else to go. Thank you."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10534.57,"end":10548.85,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, I mean, I think the answer to the first one is, from Orthodox practice is pretty easy that Christ is present in the Eucharist no matter the disposition of the person receiving. Which is why it can be bad."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10548.85,"end":10554.77,"speaker":"Fr Stephen De Young","text":"For you or the priest. Yeah, or the disposition of the priest."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10554.77,"end":10557.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. We're not Donatists."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10558.65,"end":10564.41,"speaker":"Fr Stephen De Young","text":"Right. And that's because Christ is the actual offerer of the actual sacrifice."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10564.65,"end":10569.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep. So how about the other side?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10569.7,"end":10577.22,"speaker":"Fr Stephen De Young","text":"You know, so the, the other piece. Well, since he phrased it as can God be present? Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10577.86,"end":10578.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10578.22,"end":10579.54,"speaker":"Fr Stephen De Young","text":"God can do whatever he wants."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10579.54,"end":10580.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10582.58,"end":10592.26,"speaker":"Fr Stephen De Young","text":"So, yeah, there's not a can't with God, really. But is this what regularly happens?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10592.65,"end":10592.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10592.85,"end":10663.18,"speaker":"Fr Stephen De Young","text":"Might be a better question. So, I mean, the first thing we have to say, or at least that I have to say, I won't speak for Father Andrew because we are, again, two separate people, is that I'm not going to say more about Protestant worship than those Protestants would say about their own worship. Right. That may seem obvious, but it's not always obvious. Right. So, like, if you don't believe that ordination is a sacrament, as most Protestant groups don't, then I'm not going to say that your Protestant ordination was a sacrament. That just seems sort of basic and respectful to me. Right. And so if someone says that communion or the Lord's Supper or the Eucharist, however they name it, if they say, hey, what we're Doing here is not a sacrament. I'm not going to say it is. I'm not going to say they're performing a sacrament when they say they're not performing a sacrament."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10663.34,"end":10666.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, what about the ones who say that they are? Because that's a thing, too."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10666.66,"end":10672.95,"speaker":"Fr Stephen De Young","text":"Well, yeah, well, this is a smaller group in this case because we're talking about the presence of Christ. Right, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10672.95,"end":10673.51,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10674.31,"end":10686.55,"speaker":"Fr Stephen De Young","text":"So most. The majority of Protestants in the United States would not say that the body and blood of Christ are really present in the elements."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10686.63,"end":10687.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10688.07,"end":10692.63,"speaker":"Fr Stephen De Young","text":"So I'm not going to say that he is in the elements when they do it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10692.63,"end":10693.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10693.43,"end":10700.22,"speaker":"Fr Stephen De Young","text":"Because that just seems respectful to me. Right. To not say they're doing something they don't think they're doing or want to be doing."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10700.22,"end":10711.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because Kyle. Not Kyle, Sorry. Grant did mention even. He said even low church Protestants. Well, that's basically people who don't believe. Don't say, don't teach that Christ is truly present there."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10711.78,"end":10725.73,"speaker":"Fr Stephen De Young","text":"Right. So. And I believe the speak pipe. It said Grant M. So I'm going to assume that this question is from Grant Morrison, the writer of Doom Patrol, Animal man and JLA in the 90s."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10725.73,"end":10727.93,"speaker":"Fr Andrew Stephen Damick","text":"There can't be any other Grant Ems out there. So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10728.25,"end":10760.9,"speaker":"Fr Stephen De Young","text":"No. No. So, you know, Grant, I haven't seen you since San Diego Comic Con 1998. You never call, you never write. So, you know, so then in the minority. So then we have minority cases. Right. Are you specifically asking about Protestant churches? Right. So you basically. I mean, congregational groups. Who knows? Right. But you're basically talking about the Lutherans."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10761.38,"end":10763.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And maybe some Anglicans."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10764.18,"end":10771.74,"speaker":"Fr Stephen De Young","text":"Right, Some. Some Anglicans, although they don't. Half of them don't want to be called Protestants, especially the ones who think Christ is really present in the elders."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10771.74,"end":10772.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10773.38,"end":10774.9,"speaker":"Fr Stephen De Young","text":"That's. They'd rather be called Catholics."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10778.17,"end":10778.25,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10778.25,"end":10790.89,"speaker":"Fr Stephen De Young","text":"Yeah, you're talking about a smaller group. And so, I mean, in that case. Right. I have to fall back to what St. Irenaeus said. We know where the Holy Spirit is. We don't know where he isn't."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10792.01,"end":10798.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, on the one hand, we can't say, yeah, they've definitely got it, because that's not our place to say that."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10799.85,"end":10800.25,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10800.82,"end":10804.18,"speaker":"Fr Andrew Stephen Damick","text":"But I think it's also problematic to say, yeah, they definitely don't."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10805.46,"end":10823.38,"speaker":"Fr Stephen De Young","text":"Right, right. But so for an orthodox Christian who doesn't have access to an orthodox church, which was mentioned in the question. Right. There's a whole other set of issues about worship and that kind of thing that then come into play."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10823.62,"end":10824.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10825.06,"end":10848.43,"speaker":"Fr Stephen De Young","text":"Right. If the question is aimed at, well, if I'm unable to go to an Orthodox church, could I go to a Lutheran church and receive the Eucharist there and really be receiving Christ? Right. If that's the nature of the question. Right. There's a whole other set of issues beyond just. Right. Is it possible that Christ is present in their elements when they perform their Mass?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10848.91,"end":10852.31,"speaker":"Fr Andrew Stephen Damick","text":"Is that good enough even in difficult situations?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10852.31,"end":10882.3,"speaker":"Fr Stephen De Young","text":"There's a whole other set. Well, and not just that, but ritual, as we've talked about a number of times on the show, informs and changes you and how you view things. Right. And so why not offend everybody if this is like an elca, very liberal Lutheran church that's still doing sort of liturgical, high church things. Right. The way in which actively participating in that worship over a long period of time is going to inform and shape you is not going to be into the likeness of Christ."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10882.94,"end":10925.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that, and I'm going to touch on this in some of my final comments in a few minutes, but I think that if you think of, if you go there in terms of like, well, I want to receive Communion and maybe they have it, then what you've done is you've extracted that from the ritual context that you just described or trying to, but it turns out that you can't actually do that. You're there, you're participating, you're being formed, you're being transformed. Yep. So, okay, well, we've got another, as I said, we've got another speak pipe, another voicemail related to this question of Christ's presence in the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10928.32,"end":10931.44,"speaker":"Audience Member","text":"Greetings, Father Andrew and Father Stephen from the Philippines."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10932.24,"end":10933.92,"speaker":"Fr Stephen De Young","text":"I have a question on the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10934.41,"end":10936.17,"speaker":"Fr Andrew Stephen Damick","text":"From my understanding, it seems that in."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10936.17,"end":10944.73,"speaker":"Fr Stephen De Young","text":"Orthodoxy, the belief is that Jesus is really and truly present in the elements, but there isn't any clear description of how."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10945.13,"end":10950.33,"speaker":"Fr Andrew Stephen Damick","text":"I was wondering if there is any take, like Roman Catholics on transubstantiation within."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10950.33,"end":10956.17,"speaker":"Audience Member","text":"Orthodoxy, if there's any metaphysical approach. And secondly, what role does it play."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10956.17,"end":10957.97,"speaker":"Fr Stephen De Young","text":"To ask the questions of how when."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10957.97,"end":10959.69,"speaker":"Fr Andrew Stephen Damick","text":"It comes to things like the real."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10959.69,"end":10960.97,"speaker":"Fr Stephen De Young","text":"Presence in the Eucharist."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10961.66,"end":10974.62,"speaker":"Fr Andrew Stephen Damick","text":"Thanks. Appreciate what you guys do. Yeah. So this is Kyle in the Philippines. So now we've got Kyle in Ireland, whom we hear from fairly regularly, and Kyle in the Philippines. So, like, the world is really, you know, bracketed by Kyle's."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10974.62,"end":10977.66,"speaker":"Fr Stephen De Young","text":"Yeah. Neither of whom is Kyle Broslovsky."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10978.62,"end":10980.06,"speaker":"Fr Andrew Stephen Damick","text":"I'm pretty sure that's true."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10985.1,"end":10985.66,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10985.66,"end":10986.06,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":10988.3,"end":10998.54,"speaker":"Fr Stephen De Young","text":"This is, I mean, the short answer is no. And the long answer is no kidding."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11004.38,"end":11009.1,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that was a really low hanging joke. But you went right for it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11009.1,"end":11041.26,"speaker":"Fr Stephen De Young","text":"It was amazing. It. So in large part, this is a place where, I think from an Orthodox perspective, the west kind of took a wrong turn in the sense that when you read the Eastern Fathers and they talk about the Eucharist, they talk about what the Eucharist does."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11042.46,"end":11042.86,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11043.5,"end":11074.36,"speaker":"Fr Stephen De Young","text":"Right. What it's for, what it does in our lives, how it relates to Christ's sacrifice and self offering, the kind of things we've been talking about. When you read very early in the west, there start to be these Eucharistic debates. And those debates don't focus on what it does or how it relates to Christ's sacrifice directly. Those debates are about, like, how it works."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11075.08,"end":11076.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11077.96,"end":11084.68,"speaker":"Fr Stephen De Young","text":"One of my favorite examples of this was the Radbertus Retramnus feud."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11086.6,"end":11087.32,"speaker":"Fr Andrew Stephen Damick","text":"Still hard to believe."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11087.32,"end":11091.4,"speaker":"Fr Stephen De Young","text":"I know everyone knows all about it. It was all the hot goss in the 11th century."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11092.55,"end":11107.19,"speaker":"Fr Andrew Stephen Damick","text":"Radbertus retramnus and friends. Sorry, I feel like this is like a. I don't know, like a feature on the Muppet Show. And now Robertus and Retremnis and friends."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11110.47,"end":11176.76,"speaker":"Fr Stephen De Young","text":"And so Red Bertis had published a thing about the Eucharist in which he argued that the body and blood of Christ in the Eucharist is his physical body from his earthly ministry. So it is the crucified body of Jesus. Right. It is the body and blood which hung on the cross. Retramnus countered that the Eucharist is actually Christ's resurrected body and blood. And you may say, wait, what? Right. And when I mention this debate to Orthodox people, it's fascinating because I could tell they're trying to figure out which one we believe. And they can't offhand because we don't have this kind of discussion."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11176.76,"end":11177.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11178.84,"end":11181,"speaker":"Fr Stephen De Young","text":"Christ's body is Christ's body. Right?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11181.48,"end":11185.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is it his body at this point in time, or is his body at this point in time?"}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11187.4,"end":11201.74,"speaker":"Fr Stephen De Young","text":"But there was a decision in the west that Radbertus was right and Rick Ramnis was wrong. Right. So that shows a different shape of thinking about these things. And there are all kinds of reasons why this happened."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11201.9,"end":11202.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11202.26,"end":11214.94,"speaker":"Fr Stephen De Young","text":"It's not just like, oh, they were all scholastic and there were no scholastics in the East. There are people in the east with the saints of the east with a surname Scholasticos. Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11216.06,"end":11217.66,"speaker":"Fr Andrew Stephen Damick","text":"And that wasn't just their dad's name."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11218.38,"end":11218.78,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11219.42,"end":11219.82,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11223.02,"end":11329.67,"speaker":"Fr Stephen De Young","text":"There are particular reasons why this happened. Right. Cultural things and why these Disputes sort of break out and why they had to be decided and why there's sort of an official statement in the west on all these issues. Right. Whereas, you know, even when the east issues official statements, there's usually a contradictory statement issued by someone else shortly thereafter. Right. So it's a different culture issue and that kind of thing. But that said, these kind of debates continue throughout the history of the Western church. And as with so many things, and there's a long list of these things, you'll have sort of multiple traditions going on in the West. And then when you get to the Protestant Reformation, Protestantism lines up on one side and Roman Catholicism lines up on the other side of these issues, which previously had been sort of internal debates in the Western Church. Right. And the whole issue that Kyle is asking about, about Christ's presence is one of those issues. Right. So if you read in. In the Summa Thomas Aquinas discussion of this, Right. He says that he finds among the Fathers two different views. Right. The two views he found among the Fathers was one view that after the bread and wine were consecrated, they were now the body and blood of Christ, and no trace of bread or wine remained. Right. That's what comes to be called transubstantiation."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11330.07,"end":11330.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11331.88,"end":11375.03,"speaker":"Fr Stephen De Young","text":"And that's the position Thomas Aquinas took. Right. But he says that there's also a position in the Fathers, the people who wrote before him, that the body and blood of Christ became really physically present in the elements, but there was still bread and wine. The substance of bread and wine still remained. Right. And this is basically what becomes consubstantiation, which is basically the view of Lutheranism. I know Lutherans. You guys are unique stowflakes. You don't like consubstantiation. I get it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11375.03,"end":11375.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11375.59,"end":11411.13,"speaker":"Fr Stephen De Young","text":"You don't want to be categorized. You don't even put in a box. And I know there's more nuance to it that Luther uses, the hypostatic union of Christ's two natures with bread and wine. That's super problematic, by the way, but we won't go into that here. There's all kinds of nuance and stuff. I get it. But basically, Thomas Aquinas testifies to existing in the west these two currents of tradition, one that becomes the Roman Catholic position authoritatively and one that basically becomes a position of Lutheranism. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11411.37,"end":11413.53,"speaker":"Fr Andrew Stephen Damick","text":"Often called consubstantiation."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11413.77,"end":11416.33,"speaker":"Fr Stephen De Young","text":"Yeah. Right, right. Which they don't like, but."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11417.13,"end":11417.61,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11417.61,"end":11453.48,"speaker":"Fr Stephen De Young","text":"Right. And so again, you see these. Part of this lining up on either side of it is because of the conflict of the Protestant Reformation. Right. And so that's also something that doesn't exist in the history of the East. And so there's no need to sort of settle those things. So if you ask, you know, how is. How is this now the body and blood of Christ, we would say, really or truly. Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11455.32,"end":11455.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11456.92,"end":11528.49,"speaker":"Fr Stephen De Young","text":"Now there are. There are. From the post Reformation era, from the 17th century, there were a couple of local councils. I have to do due diligence here. Right. There are a couple of local councils of the Church of Constantinople that are not available in English. Their findings are only available in Greek. So you've got to track the Greek down. If you want to really read them, you can find stuff written about them in English, but the actual text nobody's bothered to translate in full, at least that I've been able to find where they condemned the Lutheran view. And by condemned the Lutheran view, I don't mean condemned consubstantiation. I mean they went into detail about the whole hypostatic union model and condemned that. That news did not get to certain people in the Greek Orthodox Church during the pandemic that their own church had condemned that view because they. Some of them promoted the condemned view during the pandemic. You could edit this out if you wanted, Father."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11528.49,"end":11528.85,"speaker":"Fr Andrew Stephen Damick","text":"No, no."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11528.85,"end":11531.13,"speaker":"Fr Stephen De Young","text":"Otherwise send hate mail to Father Andrew."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11531.13,"end":11532.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, take. I'll send it on."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11534.85,"end":11556.22,"speaker":"Fr Stephen De Young","text":"So to which I would refer them, their Greeks should be at least as good as mine. I'd refer them back to those councils. But though they condemned the Lutheran view, the term they used in Greek to describe what actually happens, some people have wanted to translate as transubstantiation."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11556.22,"end":11558.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Matusiosis."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11558.78,"end":11587.88,"speaker":"Fr Stephen De Young","text":"Yeah. That's not really transubstantiation in the sense that that term does not necessarily include this idea that there is no. None of the substance of bread and wine left. It's hard to nail down, is what I'm saying. The term is vague. Right. The most you can get out of that term for sure is that there's a real change."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11589,"end":11589.4,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11590.36,"end":11609.14,"speaker":"Fr Stephen De Young","text":"It now is a different thing, which is hard to derive technical details from, but I want to acknowledge that, because that's the closest thing. But even that, even if you took that to mean transubstantiation, that would be the statement of one local church."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11609.46,"end":11610.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11610.98,"end":11614.58,"speaker":"Fr Stephen De Young","text":"And wouldn't be sort of binding on all of the Orthodox churches."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11614.58,"end":11614.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11615.94,"end":11650.73,"speaker":"Fr Stephen De Young","text":"And I don't think it is really that simple in terms of what it means. So where does the rubber meet the road on this. Right. Like, there are places where this difference in approach actually makes a practical difference. And I'll give you one. The concept in the Roman Church of the Perpetual Adoration of the Sacrament."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11651.54,"end":11664.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Where they take the Eucharist and put it in a monstrance and put it usually in a little chapel, and people go and bow down in front of it and worship it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11665.54,"end":11668.5,"speaker":"Fr Stephen De Young","text":"Right. That is eucharistic adoration, not veneration."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11668.5,"end":11673.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Not within the context of the Mass, but as a separate act."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11674.02,"end":11680.44,"speaker":"Fr Stephen De Young","text":"Right. Because based on a series of decisions regarding the nature of the Eucharist, that is Christ himself."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11681.16,"end":11681.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11681.64,"end":11723.73,"speaker":"Fr Stephen De Young","text":"Now for them, and therefore can be worshiped. Right. The problem with that from an orthodox perspective. Right. The problem with that from the perspective of the Protestant Reformers was it was a condemnable idolatry, as one reform statement of faith says. So they viewed it as idolatry. Right. That's not the problem from the orthodox perspective, or at least not the fundamental problem. Right. The fundamental problem from an orthodox perspective with that is that this is sort of the ultimate outcome of focusing on what it is rather than what it does."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11724.85,"end":11725.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11725.33,"end":11727.17,"speaker":"Fr Stephen De Young","text":"Because the Eucharist is to be eaten."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11728.05,"end":11729.01,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's food."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11730.74,"end":11766.19,"speaker":"Fr Stephen De Young","text":"It is food for the faithful. Is Christ giving himself to us as food? And so looking at it, propping it up. Right. That makes sense if your focus is on what it is and having defined what it is. But it doesn't make sense if you're focused on what it does. Because then it's, why aren't you eating it? That's how we partake of Christ is by eating it, not by worshiping it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11770.19,"end":11776.11,"speaker":"Fr Andrew Stephen Damick","text":"It's a good question. We got some good questions for this episode. I appreciate everybody who sent those in. Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11776.67,"end":11784.63,"speaker":"Fr Stephen De Young","text":"And that, I'm sure, ticked off the last remaining Catholics. There's probably like three people still, isn't it? Yeah."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11784.79,"end":11786.15,"speaker":"Fr Andrew Stephen Damick","text":"Happy Thanksgiving, everybody."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11787.03,"end":11793.35,"speaker":"Fr Stephen De Young","text":"All three of you. Maybe they were in a turkey coma, and so they've only been vaguely paying attention and will get away with it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":11793.35,"end":12320.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Tryptophan. Yeah. So, you know, to some final thoughts. Right. So to kind of actually jump off of what we were just talking about there. And also to put it within the context of things that I've seen within Orthodox churches, Orthodox people doing some things that are problematic, shall we say? For instance, you have the reality of people who come to church shortly before communion is served, receive communion and then leave. Or sometimes they'll be there for most of it and then leave right after they receive communion. And I actually was Told this by a priest up in Canada. I'm not going to mention where I don't want to call anybody out, but that the parish that he inherited, that they had a practice there where people would commune once a year, usually on Holy Friday or Holy Saturday. And they would come by the church, they would stop by, they would drive up and even one person left their car running out on the curb and they would come in and expect the priest to communion. Then they would just be sort of on their way, you know, so literally drive by communion. Literally. So why do people do this? I mean, obviously on some level it makes sense to them. It seems right to them. Right. Something's in their head that says this is the way to go here. And they thought it through on some level. And I believe that what it comes down to is this objectification that we were talking about, that Holy Communion maybe not being defined by precise philosophical terms like transubstantiation or consubstantiation, Holy Communion is nonetheless objectified in a kind of talismanic way. I went, I got my communion. I've actually heard people say that I got my communion. And this is a problem. This is a problem. And I think some of it stems from, well, a lot of people probably just uncategized almost entirely, but also some bad catechesis too. And I think some well meaning bad catechesis that often focuses on the fact that it is the body and blood of Christ. It absolutely is the body and blood of Christ. Don't get me wrong. But when that's the maybe some cases exclusive thing you focus in on with regards to what the Eucharist is, then there is a space within which it can be treated in this talismanic way. Right? Well, that's the body and blood of Christ. Oh, wow. You know, sure, all kinds of piety flows from that. And that's beautiful and good. But when getting the body and blood of Christ is the thing you showed up for, then that means that the setting in which it's embedded doesn't really matter to you. That's why you can just show up right before communion. Well, that's why you can do the drive by, you know, that's why you can get it and walk out. It's embedded. And we've talked in this episode about all the ways it's embedded. Right? But just to sort of summarize that a little bit, it's embedded within a ritual experience, a ritual that we participate in, that is a ritual meal that brings us together, that binds us together, that Binds us to God, that vivifies us, that shapes us, and that experience of being bound and shaped. And all of that doesn't come simply from the moment that Holy Communion goes into our mouths. There's a lot that precedes that, and there's stuff that follows it, too. It's embedded. Right. This episode is releasing on American Thanksgiving. Sorry, Canadians, we didn't maybe do something for you back last month. But, you know, and Americans, we have a ritual that goes with Thanksgiving. There's a lot of variations on it, but the one element that pretty much is universal is a big meal with lots of stuff and that it's family gathering together. This is the American tradition about Thanksgiving. And often then you'll have people maybe saying something that they're thankful for, et cetera. But the family gathering around a big meal with a lot of variety to it is the kind of core ritual, right? Well, there's an analogy to this I mentioned at the beginning. Metropolitan Phillips said that Thanksgiving was last holiday, American holiday that had not been ruined. But I think there's a ruining happening which is. And I know people don't mean anything bad by this, but often they refer to it as, quote, Turkey Day, Turkey Day, which reduces it down to a single thing that's being eaten at that meal, traditionally turkey. But if that's what Thanksgiving is, is it's just turkey, then you've lost all of those beautiful things that Metropolitan Phillip recognized as good about this American holiday. Now, I'm not commenting on the way that people celebrate or don't celebrate American Thanksgiving. That is up to you and your family, your father, confessor, whatever. But by analogy, to reduce it to Turkey Day is much like reducing the Divine Liturgy to getting communion. Just getting communion, Right? We have to understand that the fact that it is Christ's body and blood is embedded within the context of him as the priest offering it, as the priest offering himself to us. And we participate in that. Right? And especially, you know, like, one of the things we often like to talk about on this podcast is the pagan context in which the practices of early Israel are expressed. You know, they're surrounded by pagans, right? But it's not just pagans that do this, but there's this shared meal with your God, right? When you eat a sacrifice, you're communing with your God in various kinds of ways. And if you understand that that's what's going on in the Divine Liturgy, and then within that context, you see that God himself is the priest, that God himself is the offering, then the fact that the very true fact that bread and wine become his body and blood, that becomes, in a sense, the jewel on this crown. Right? It's at the center of it, for sure, but it's the center of something. You can't take it out of that something. It's centered there. Now, some people might say, well, what about people who can't come to church? And the priest or the deacon brings that to them, okay? But that is an exceptional circumstance that's borne out by necessity, because they're ill, because they can't do that. But even when the priest or the deacon brings that to them, there are still prayers that go along with that, and there is still a connection, a communal connection that happens during that visit. And so it's not necessary that it happen that way, but that's not the way that it is for everyone. And it's just an extension of what is the normal normative way, which is that embedding within the Divine Liturgy. So I just wanted to offer that especially because there's a lot of pious feelings that surround the way that people think of the Eucharist, and some of them are really good. And the fact that we have this sense of reverence and we see how special and how important it is, that's beautiful. But we need to see that it's embedded and not this kind of independent talisman that we want to go and acquire without the larger context of the ritual itself. And the whole life, the whole liturgical life, not just the service of the Divine Living Liturgy, but the whole liturgical life of the Orthodox Christian. Father Stephen."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12324.55,"end":12469.01,"speaker":"Fr Stephen De Young","text":"So, in response to one of our callers who, based on his taste in podcasts, I can only assume is brilliant, handsome, and successful in life, I mentioned that not only should our meals with our fellow Christians be an extension of the Eucharist, but our whole life should be an extension of the Eucharist. And I meant a few things by that. On a basic level, our whole life should consist of thanksgiving and praise to God. I've said before, or I've asked before rhetorically, in homilies and other places. You know, if when you woke up tomorrow, everything you didn't thank God for today was gone, would you have much of anything left? We tend to take everything for granted until it goes away. Right when we get sick, we're kind of mad that we got sick. Might ask God why he let us get sick. And, you know, we pray that God would heal us from our sickness. Rarely do we thank God for our health when we're not sick. Sort of, you don't know what you've got till it's gone. So all of us could use a lot more thankfulness in our life, not just, you know, when you're a kid and you get put on the spot around the the dinner table on Thanksgiving. And as the caller was alluding to, I think the kind of fellowship and unity and oneness that's enacted by us coming and receiving the Eucharist together ought to translate to a unity and a oneness and a family relationship and a brother and sisterhood among Christians outside of the worship service, in our communities, in our lives. So in that sense, also our life should be an extension of the Eucharist. But I think one of the most important things that we neglect, and it's bad that we neglect it because it's something if you attend an orthodox liturgy, we say over and over and over."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12469.01,"end":12469.37,"speaker":"Audience Member","text":"Again."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12471.77,"end":12553,"speaker":"Fr Stephen De Young","text":"And that is that when we gather together to participate in Christ's voluntary self offering him voluntarily offering himself to the Father in a sacrificial way, part of how we participate in that, in the context of the liturgy, is that repeatedly we say that we are also offering lives and ourselves and each other our whole life to Christ our God, that we combine sort of our self offering with his when we gather to celebrate the Eucharist. And I say when we neglect that. I'm not saying that when we say it in liturgy. I mean, a lot of times I think it may pass by so we don't even notice that we're doing it. But I'm not saying that when we do stop and think about it, that we're being insincere at the moment when we say that in the liturgy. But if we think about it a little more, if I'm going to come on Sunday morning or on a feast day to a liturgy, and I'm going to say that I am offering my whole life to Christ."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12556.05,"end":12556.65,"speaker":"Audience Member","text":"Aren't there a."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12556.65,"end":12769.95,"speaker":"Fr Stephen De Young","text":"Whole lot of things in my life outside that moment that it would at least minimally be awkward if I tried to offer them as a sacrifice to God? Would they, at the bare minimum, not represent me offering God my best? Could I reasonably offer a lot of the things I watch on the Internet or streaming services to God as an offering that would be pleasing to Him? Could I offer sort of my worst moments of anger, of criticizing other people, of making fun of other people, of gossiping about other people? Could I take those moments and say, oh, God, I'm offering these to you as a sacrifice? I hope this pleases you we're sincere in the moment of offering our whole lives to God, but if we look back at our life, there's a whole lot there that we would not want to offer up to Him. In fact, we'd be kind of embarrassed of and want to hide from him, as if that were possible. And also looking forward beyond that moment where I may be being sincere in that moment, but when I look into the next week, how many of my plans that I make for any given week or month or year or the future, how many of those plans are based on the idea that I'm offering that time, of that plan, I'm offering that to God as a sacrifice. Now, this isn't to say, oh, we all need to become monks, right? We all need to do nothing but pray. We all need to. But I can gather with my family and enjoy, for example, on Thanksgiving, a meal with my family. I can offer that to God as a sacrifice. There's nothing to be embarrassed or ashamed of there. There's nothing sinful there. That is a good thing. Times of fellowship, times of enjoyment of God's creation, those aren't things that are problematic to offer up to God. Sin is. And we know the difference. We know the difference. We know when. The difference between doing something to gratify myself and my desires and enjoying the company other people and enjoying the goodness of God's creation. We know the difference between those two things. We're being precious if we try to argue, like there isn't one, to try to justify behavior that we know is wrong by comparing it somehow to behavior that we know isn't. And so I think as we think about the Eucharist and we think about our participation, because even if you're not clergy, you're participating in the Eucharist in this sense, and we think about what it means to really offer ourselves and our whole life to God, that it goes beyond just trying to be sincere during that hour and a half or however long it is that we're there in church and start being honest about how being able to say that sincerely during that hour and a half maybe means we have to make some changes and reorder some things in our lives."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12771.71,"end":12793.11,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Happy Thanksgiving, everyone. Thank you for listening. This was not a live show, but normally we're live and we'd love to hear from you. If you can't get through live or didn't, you can email us@lordofspiritsancientfaith.com you can message us at our Facebook page. Or you can leave us a voicemail@speakpipe.com."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12793.53,"end":12807.88,"speaker":"Fr Stephen De Young","text":"LordOfSpirits and join us for our live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. And if you're one of those people enjoying a turkey sandwich, you know who you are. Come to the Thanksgiving."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12809.8,"end":12821.65,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews ratings everywhere you listen, but most importantly, share the show with a friend whom you know is going to love it and benefit from it."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12822.45,"end":12834.93,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to anxiety.com support and help make sure we and lots of other AFR podcasters stay on the air and that everyone in the Maddox family has stuffing. It's Thursday."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12835.17,"end":12838.61,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night, and God bless you all."}
{"episode_id":"LOS - #056 - 2022-11-24 - Thanksgiving","start":12841.66,"end":12867.91,"speaker":"Fr Stephen De Young","text":"Sam Sa."}
