{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":0.4,"end":65.03,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":65.75,"end":78.63,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Giant killers, Dragon slayers, Behemoth bashers, Leviathan Lassoers. You are listening to the Lord of Spirits podcast and I assume that my co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":78.87,"end":79.91,"speaker":"Fr Stephen De Young","text":"Where else would I be?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":79.99,"end":85.21,"speaker":"Fr Andrew Stephen Damick","text":"Okay, just, I mean, I don't know. You could be phoning it in. Literally phoning it in."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":85.45,"end":88.01,"speaker":"Fr Stephen De Young","text":"I had to do that in some of the early episodes, if you recall."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":88.17,"end":90.57,"speaker":"Fr Andrew Stephen Damick","text":"I do recall. I could play some clips."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":90.73,"end":91.21,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":92.49,"end":164.36,"speaker":"Fr Andrew Stephen Damick","text":"I'm Father Edger, Stephen Damick. I'm in Emmaus, Pennsylvania and we are live. So if you're listening to us live, you can call us at 855-237-2346 and you can talk to us. And we're going to get your calls in the second half of the show. And our very own most beloved Matuska Trudy will be taking your calls. This episode is sponsored by the Orthodox Studies Institute at St Constantine College, which exists to advance the study and application of Orthodox Christianity in faithfulness to holy tradition. OSI is offering online courses this fall, including a five week course on the Book of Enoch taught by you, Father Stephen DeYoung. You can learn about the courses. That's the rest of you. Yeah, everyone. Man, it's a while. I know. They better sign up pretty soon. You can learn about the courses registered@orthodoxstudies.com Los and if you register using that link, you'll get a free copy of Father Stephen's ebook Apocrypha from Ancient Faith Publishing and registration is now open. A bunch of people have already signed up. So this is Pretty good."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":164.88,"end":168.64,"speaker":"Fr Stephen De Young","text":"Unlike how you normally download my books. This time you won't have to feel guilty."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":171.52,"end":194.54,"speaker":"Fr Andrew Stephen Damick","text":"All those bootleg PDFs you guys got out there. Yeah. So it's been a hot minute since we did a Brain Bending episode, I think. So if that's what you came for, fair listener, tonight you are in for a treat. If not, good night. Anyway, we're talking tonight about time, which, if anyone is keeping score, is on my side. Yes, it is."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":195.66,"end":200.06,"speaker":"Fr Stephen De Young","text":"Now, everyone is going to think we're doing another Azazel episode because you did that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":202.3,"end":212.46,"speaker":"Fr Andrew Stephen Damick","text":"But what is it? Is time a thing? Does God experience time? Is time just an illusion for humans? And Father Stephen, why is it that just yesterday all my troubles seemed so far away."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":214.46,"end":221.45,"speaker":"Fr Stephen De Young","text":"And things were going so well with the Rolling Stones and you had to sully it with the Beatles? Spiciest take of all time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":221.45,"end":222.09,"speaker":"Fr Andrew Stephen Damick","text":"Rolling Stone."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":222.49,"end":223.77,"speaker":"Fr Stephen De Young","text":"Better than Beatles."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":224.09,"end":237.93,"speaker":"Fr Andrew Stephen Damick","text":"I did recently. I did recently Watch some of the musical. Watch and listen to some of the musical. Not on purpose, but some of the musical stylings of Yoko Ono. So do with that what you will."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":239.37,"end":245.62,"speaker":"Fr Stephen De Young","text":"Were you watching what's Her Faces video about the Beatles breaking up?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":246.18,"end":253.7,"speaker":"Fr Andrew Stephen Damick","text":"No, no. This was something I ran across on the Facebooks, but, you know, I figured it was a good way for me to start to get into the horror genre."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":255.46,"end":258.58,"speaker":"Fr Stephen De Young","text":"Yeah, well, no, this. This video is defending Yoko Ono."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":258.66,"end":259.86,"speaker":"Fr Andrew Stephen Damick","text":"Oh, oh, oh."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":259.94,"end":262.1,"speaker":"Fr Stephen De Young","text":"She did not, in fact, break up the Beatles."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":262.42,"end":262.9,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":265.46,"end":267.7,"speaker":"Fr Stephen De Young","text":"Lots of spicy Beatles takes going around, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":268.18,"end":305.87,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. I think one of my favorite moments in my life that had to do with the Beatles is there was one time, and I'm not joking about this, I'm still kind of flabbergasted by having had this experience that I walked into a Catholic bookstore. I can't remember what it is that I was planning to buy there, but I walked into a Catholic bookstore and they were playing. It was clearly like some choir singing Let it Be. Like it was this all female choir singing Let it Be. I was like, what is happening? Where even am I? I guess that's it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":306.19,"end":313.39,"speaker":"Fr Stephen De Young","text":"That means it was just in the last 40 years, during which boomers have run the world is what that means."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":313.55,"end":322.03,"speaker":"Fr Andrew Stephen Damick","text":"This has been assimilated to be a Roman Catholic song now. So that's where we are. Where are we? When are we?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":322.91,"end":328.76,"speaker":"Fr Stephen De Young","text":"So, yeah. So before we start our topic proper, I have something I want to say."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":328.92,"end":329.24,"speaker":"Fr Andrew Stephen Damick","text":"Uh."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":329.24,"end":329.64,"speaker":"Audience Member","text":"Oh."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":329.72,"end":332.76,"speaker":"Fr Andrew Stephen Damick","text":"Little grandstanding on the part of Father Steven Diego."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":332.76,"end":348.52,"speaker":"Fr Stephen De Young","text":"I never do that. I never get out of soapbox or go off on a rant. But this occurred to me it doesn't necessarily fit with the episode. So, you know, but I don't care. I have a bully pulpit now which consists of a microphone I talk into in a room."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":348.84,"end":349.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":351.56,"end":364.87,"speaker":"Fr Stephen De Young","text":"So there's all these people freaking out about this whole Olympics thing, and it's as if they've suddenly discovered that the Olympics are pagan."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":367.67,"end":368.07,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":368.39,"end":505.51,"speaker":"Fr Stephen De Young","text":"And if you're one of those folks who just discovered this, I have bad news for you, because the Olympics have always been pagan. They started out pagan. The we talked about in our episodes, we were talking about werewolfism. Like the first one, a guy sacrificed a baby and committed an act of cannibalism to get demonic power to win the Olympics. Okay, the Olympics are pagan. Why am I pointing this out? Not just to say, like, yeah, duh, why do you think the opening ceremonies look like that? But I think this is emblematic of a larger thing, a larger cultural thing that, while it's not germane to tonight's topic, is very germane to the theme of our show as a whole. And that's that we've been sold this bill of goods since we were kids. In our education, we've been taught about this thing that isn't real. And it's called Western civilization, where they try to draw a historical through line starting in like ancient Sumer and ending depending on your vintage, either in like 19th century Germany or 19th century British Empire, or if you're more my age, ending in late 20th century United States of America. And this is the march of civilization. This is all one thing, one stream. And religiously, what this does is it tries to draw a through line from Sumerian religion, a development aligned from there to 19th century German Lutheranism, the 19th century Church of England, or 20th century, late 20th century American Evangelicalism, as the culmination not just of Christianity, but of human religion as a whole, finally got it right. But everything along the way is part of this tapestry, part of this one tradition."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":506.07,"end":506.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":506.43,"end":646.64,"speaker":"Fr Stephen De Young","text":"We all grew up thinking that cupids were cherubs. They're not. And so when this whole idea was concocted through the Renaissance and the Enlightenment, when the basically European pagan tradition was fusing itself to the Western Christian tradition, it was sort of a devil's bargain from both sides. Right? There were people who didn't much like the Western Christian tradition and were chafing at it because they wanted to live their lives or exercise their intellects in other ways. And so they wanted the freedom that a revised and hollowed out version of the Western pagan tradition offered them. And then on the Other side, there were people who were still loyal to the Western Christian tradition, but who wanted to claim credit for the glories of Greece and Rome and all the pagan stuff and pagan art and culture. And so they came to this agreement. We'll just fuse all this together and call it Western culture and Western civilization. And now, very timely. You could go all over YouTube in some of our own circles, shall we say, and find people talking about the demise of the west and the demise of Western civilization and Western culture. This thing that was phony and never existed, that we were all pretending existed. It's not that this thing was real and now it's going away. It's that those two things which are fundamentally incompatible, Christianity and paganism, are pulling themselves apart again. And guess what? The paganism side is rediscovering its antipathy toward Christianity faster than the opposite is happening. Because the folks who are still on the Western Christian side still want to keep things like the Olympics, still want to keep a bunch of these things that ultimately are not germane to the Christian tradition that come out of the Renaissance and the Enlightenment and the pagan recovery therein. They want to cling to those. They want to keep those."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":648.24,"end":648.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":649.36,"end":658.32,"speaker":"Fr Stephen De Young","text":"And just keep pretending that they're Christian. But the pagan side won't accept that bargain anymore. They're feeling their oats now."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":660,"end":660.4,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":660.48,"end":687.68,"speaker":"Fr Stephen De Young","text":"And. And they want to take them back and just be pagan, as pagan as they could be. Now, that's going to lead to them to very dark places. Hopefully some of them will yo, yo. Back to Christianity and realize what they've lost. But that's what's happening in our culture right now. That's what everybody could observe in the opening ceremonies of the Olympics was. Oh, the Olympics are now just being openly pagan again. They're not pretending anymore."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":688.72,"end":695.28,"speaker":"Fr Andrew Stephen Damick","text":"But will they bring back the poetry contest? I'm just saying. I'm not saying that won't be pagan."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":695.68,"end":697.12,"speaker":"Fr Stephen De Young","text":"Only if it's pagan poetry."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":697.12,"end":701.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, there's some good pagan poetry. The Iliad."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":701.26,"end":729.52,"speaker":"Fr Stephen De Young","text":"See, that's the attitude. See, see, you're trying to. You're trying to. So, yeah, so that's. We just need to acknowledge that that was always a fiction. That was always a fiction. Right. The tradition of the scriptures, tradition of Christianity corrects all of those teachings of the nations. The nations worship to demons, not God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":731.68,"end":732.32,"speaker":"Fr Andrew Stephen Damick","text":"True story."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":732.64,"end":744.96,"speaker":"Fr Stephen De Young","text":"Both The Torah and St. Paul say so. And we need to stop trying to fuse the City of God and City of Man and trying to hold those things together and pretend they're the Same city."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":746.24,"end":747.92,"speaker":"Fr Andrew Stephen Damick","text":"Ooh, first St. Augustine reference."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":748,"end":750.76,"speaker":"Fr Stephen De Young","text":"Because they hate. He's coming back tonight anyway."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":750.76,"end":752.72,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. I'm warming up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":753.84,"end":759.76,"speaker":"Fr Stephen De Young","text":"So end of rant. Very germane to our show in general, not necessarily to our topic tonight."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":760.88,"end":763.36,"speaker":"Fr Andrew Stephen Damick","text":"Hey, are we being relevant? Are we up to the minute? Are we."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":763.36,"end":767.28,"speaker":"Fr Stephen De Young","text":"Yes. I was watching, but I'm watching all these takes, and it's just like."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":769.04,"end":770.48,"speaker":"Fr Andrew Stephen Damick","text":"Hey, you got to get your takes in."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":770.56,"end":776.64,"speaker":"Fr Stephen De Young","text":"Why did you assume that the opening ceremonies for the Olympic Games would be in any way Christian?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":778.08,"end":779.28,"speaker":"Fr Andrew Stephen Damick","text":"More outrage needed."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":780,"end":822.71,"speaker":"Fr Stephen De Young","text":"Like, why? Anyway, yeah, it's paganism. Yeah. And. And the parts that I know, there are people out there going, well, no, but since they brought it back, it's about other things. What are those other things? It's about the brotherhood of man. Liberty, equality and fraternity. Enlightenment values. That's not Christian either. Yeah, that's grounded in a repudiation of Christianity, too. Like, that's not. There was no Christian element. For Pete's sake, people, go watch Chariots of Fire. It won multiple Oscars."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":825.35,"end":829.43,"speaker":"Fr Andrew Stephen Damick","text":"And it has clips from Gilbert and Sullivan productions."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":829.51,"end":829.95,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":829.95,"end":831.67,"speaker":"Fr Andrew Stephen Damick","text":"So media literacy, folks."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":831.84,"end":832.56,"speaker":"Fr Stephen De Young","text":"Media literacy."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":832.56,"end":842.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's the first time I ever heard bits from HMS Pinafore, which is a much. A much underrated production, in my humble opinion."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":842.88,"end":848.16,"speaker":"Fr Stephen De Young","text":"Yes, Especially the whole production. Not the bowdlerized kids version."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":848.32,"end":862.57,"speaker":"Fr Andrew Stephen Damick","text":"That's right. There's a lot to love about Pirates of Penzance, I grant you that. Especially having recently been rather close to Penzance. I did not see any pirates but HMS Pinafore, Mikado. I mean, there's a lot of good Gilbert and Sullivan people just. Just letting you know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":863.37,"end":864.41,"speaker":"Fr Stephen De Young","text":"On that we can agree."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":865.45,"end":868.33,"speaker":"Fr Andrew Stephen Damick","text":"All right, all right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":868.97,"end":871.53,"speaker":"Fr Stephen De Young","text":"So now we're talking about time. Let's talk."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":871.53,"end":875.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I thought time was on my side."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":875.13,"end":877.69,"speaker":"Fr Stephen De Young","text":"But no, it's not."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":878.73,"end":879.13,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":881.77,"end":900.72,"speaker":"Fr Stephen De Young","text":"Yeah. So we are tonight talking about time. And so, yes, as Father Andrew alluded to before my diatribe, this. This is. This is good. You know, we have. We've had a few that are a little bit chewy."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":902.56,"end":903.52,"speaker":"Fr Andrew Stephen Damick","text":"This one's crunchy."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":904.4,"end":929.57,"speaker":"Fr Stephen De Young","text":"Yeah. As opposed to crunchy, like, chewy like, you know, they're a little gummy. Like, you got chew on steak, Right. You gotta chew on it a while before you try and swallow it. Um, so that's a. That's a fair warning, but we're going to try not to rush through it. And we're going to be developing the things we talk about night tonight some more in our next episode, which is just next week."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":929.97,"end":942.6,"speaker":"Fr Andrew Stephen Damick","text":"That's true. We have a Little bit of a weird schedule this month, mainly because of travel. So we're having an episode tonight, August 1st. We're having another one next week, August 8th, and then you have to wait three weeks, August 29th."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":943.64,"end":947,"speaker":"Fr Stephen De Young","text":"So yes, we just want to keep people guessing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":947.08,"end":948.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":948.76,"end":959.68,"speaker":"Fr Stephen De Young","text":"But yes, tonight. And then we're gonna pick up on some of these same themes next week. And even though this is deep stuff, I think it's important stuff. And I don't think it's."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":959.68,"end":970.54,"speaker":"Fr Andrew Stephen Damick","text":"These are important, like framing. These are important framing issues which if you don't deal with them, you can have all kinds of whacked out theology as a result, you know, like Calvinism."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":970.7,"end":1033.25,"speaker":"Fr Stephen De Young","text":"Yeah, right, yeah, yeah. And a lot of that comes from something we've talked about a lot of the show, which is, right, we're humans, so we speak about everything from a human perspective. And there is always the danger because we always all, as humans, when we communicate with each other, we're always all speaking from the human perspective. For us to get confused and think that our perspective is objective reality. And that's especially dangerous when it comes to talking about God and pretending that my subjective perspective about God is the reality of God. As if I could comprehend that. Right. And so that's really where we're going to start. We're going to start tonight with talking about how God relates to time, insofar as this is a thing we could even talk about."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1033.81,"end":1034.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1036.21,"end":1038.37,"speaker":"Fr Stephen De Young","text":"So you're gonna hear a lot of knots."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1041.09,"end":1043.89,"speaker":"Fr Andrew Stephen Damick","text":"We'll be apophatic for like three hours straight, you guys."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1043.89,"end":1047.29,"speaker":"Fr Stephen De Young","text":"Yeah, well, not entirely. Probably not for three hours."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1047.29,"end":1047.89,"speaker":"Fr Andrew Stephen Damick","text":"I'm exactly."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1047.89,"end":1118.43,"speaker":"Fr Stephen De Young","text":"But for a good hour and a half out of the three. For sure. But yeah, so we're gonna start in that direction. But. And so a lot of this is going to be. We've got to blow up some common misconceptions of what that relationship might be. All of which are, like I just said, really based around taking sort of the human perspective and human experience of time and trying to then generalize that onto God and make it sort of objective and absolute and apply to him the same way it applies to us, which of course we know better than that. Right. But so to help us get a window into this, instead of diving straight into the way God and time are related, we're going to start with the way God and space are related. Because this, I think, is a little clearer, a little at least, or a little easier to understand. And then once we've sort of clarified and talked about the relationship between God and space. Right. Then we can kind of move from there. By way of analogy, to talk about God in time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1119.55,"end":1121.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I'm tracking so far."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1124.75,"end":1196.62,"speaker":"Fr Stephen De Young","text":"So when we think about God in space, right. We're talking about space, not like the final frontier. Right. This is. Space is in just extension in space. Right. Distance, places. Right. We will talk about God acting in a place. Meaning, you know, God heals someone. Okay. God heals someone. That person is healed at a particular time and in a particular place. Okay. Right. So when that person is healed, it's not, oh, suddenly time has been rewritten and they were never sick. Right. But the healing happens at a particular time and it happens at a particular place. The place where that person is who is healed. Right. But. Right. So we could say God healed that person on this day at this hospital. But what we don't mean by that is that, like, God physically traveled to that hospital and healed that person."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1196.94,"end":1202.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or as one person once put it, what does God need with a starship?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1203.26,"end":1205.82,"speaker":"Fr Stephen De Young","text":"Yes. He doesn't need to travel there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1206.06,"end":1206.66,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1206.66,"end":1212.3,"speaker":"Fr Stephen De Young","text":"Right. So God doesn't need to, like, cross space from one point to another."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1212.77,"end":1212.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1212.97,"end":1234.45,"speaker":"Fr Stephen De Young","text":"To go from here to there. Right. Where God, you know, he's doing one thing, you know, in. In one place, you know, stopping someone from crossing the street, Right. When they would have gotten hit by a car. And then now he has to get across town to go heal somebody at the hospital. Like Superman. We all understand that's ridiculous, right. When we're talking about God. Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1234.53,"end":1235.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1236.77,"end":1250.18,"speaker":"Fr Stephen De Young","text":"So it's not that God is in some. Right. Like God is not in some particular place. And from that place, he is sort of doing all the things he's doing everywhere else. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1251.78,"end":1252.58,"speaker":"Fr Andrew Stephen Damick","text":"Mission control."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1253.38,"end":1302.6,"speaker":"Fr Stephen De Young","text":"Right. So we understand this with space, but the effects, right. The effects of what God does. Right. Those are localized at a particular place in a particular time. Right. Because the recipients, the created recipients of what God does, the person being healed, the grass that is growing, the person who is finding repentance and salvation, they're created things, and they exist at a particular point in space and in time. And so the effects of what God does are there in the created world, but God himself is not sort of localized in that particular place. In order to do that, where he had to have to move around."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1302.92,"end":1303.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1306.04,"end":1346.75,"speaker":"Fr Stephen De Young","text":"And this gets into, of course, what's usually referred to as God's omnipresence. Right. God's everywhere. But there are kind of bad ways. We think about this too, because we say, okay, God's omnipresent God's everywhere. But we don't mean that just like God is really big and spread out through the whole universe. That's not what we mean because we don't believe that God occupies space in the way that created things. Do you?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1347.38,"end":1347.62,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1350.1,"end":1374.98,"speaker":"Fr Stephen De Young","text":"That's not a good way to think about what we mean by God's omnipresence. And we get some help from this from now. Saint Demetrius Staniloi of Romania, who in his Orthodox dogmatics taught us that God's attributes are supra essential. What does that mean?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1375.46,"end":1382.66,"speaker":"Fr Andrew Stephen Damick","text":"Not to be confused with super essential. Yes, supra, which means above and beyond, effectively."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1383.22,"end":1474.6,"speaker":"Fr Stephen De Young","text":"Right, Right. So when we. The word essential comes from essay. Right. Being. Right. A being from the Latin. And what we mean by that is. Right. Everything we know that's created is a thing. There are created things. Right. So me, Father Stephen DeYoung is a thing. A chair is a thing. A bottle cap is a thing. Right. These are things. And all of those things have an essence. All of those things have attributes that we could describe about them. Right. But so when we say that God is supra essential, we're saying God is not a thing. He's not a thing like created things. So God is not just a really big thing, not a really big human, not a really big angel, not a really big object. Right. God is not a thing in the sense that created things are things. We talked about this in an earlier episode when we pointed out that we don't believe God exists in the sense that what I mean when I say this chair exists or I exist or a pen exists or a bottle cap exists, is not the same thing that it means for God to exist."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1477.08,"end":1477.36,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1477.36,"end":1478.68,"speaker":"Fr Stephen De Young","text":"God is not a created thing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1480.38,"end":1480.58,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1480.58,"end":1489.98,"speaker":"Fr Stephen De Young","text":"So it means something fundamentally different. And so what does that mean when we think about God's omnipresence? Right. Well, that means God is not just like a very big thing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1490.86,"end":1491.22,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1491.22,"end":1539,"speaker":"Fr Stephen De Young","text":"Who's spread out all over. God is not traveling around. Right. God is not a thing. So what that means ultimately is that it is equally true to say that God is everywhere in the sense that there is nowhere in creation. There is no place in creation where God is not, is what we're saying about negative statements. There's no place that God is not. And so in that sense, he is everywhere. But it is equally true to say that God is nowhere in the sense that he cannot be restricted to any particular place. Like, oh, God is right here as opposed to anywhere else."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1539.8,"end":1542.28,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. He's here and not there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1545.24,"end":1568.99,"speaker":"Fr Stephen De Young","text":"Some of you may be thinking, well, what about like, the tabernacle or the temple, right? Where the place where the presence of God was? Well, read in the Old Testament, read in the Hebrew scriptures, what God keeps saying every time he talks about, especially the temple, he's constantly saying he does not dwell in houses made by human hands."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1570.83,"end":1571.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1572.27,"end":1592.26,"speaker":"Fr Stephen De Young","text":"He is not a thing. Right. And so, yes, while he is present there, that doesn't mean he isn't present everywhere else. Right? And God reinforced that over and over again. Because having the tabernacle or the temple is the place where humans go to encounter God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1593.7,"end":1594.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1594.18,"end":1601.94,"speaker":"Fr Stephen De Young","text":"Could potentially confuse us humans into thinking that, oh, God is there as opposed to other places."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1602.5,"end":1603.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1607.14,"end":1610.91,"speaker":"Fr Stephen De Young","text":"So this is kind of giving us a picture of how God relates to space."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1611.39,"end":1611.79,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1612.99,"end":1638.27,"speaker":"Fr Stephen De Young","text":"Simply put, spatial categories, like here, they're far, near. They don't apply literally to God. Like, we could talk about feeling far away from God or feeling close to God, but we all understand that's an analogy, right? We don't literally mean like, well, I feel closer to God now, like five meters closer, right? Like, you look at someone like they were insane, Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1638.35,"end":1639.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1640.22,"end":1647.1,"speaker":"Fr Stephen De Young","text":"Like, did you measure. Right. That's not a literal question of space."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1647.18,"end":1647.74,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1648.38,"end":1756.04,"speaker":"Fr Stephen De Young","text":"So time, even though we experience it differently and we're going to get there, we're going to talk about the way humans experience time. That's where we're heading. But time is very much like space in this regard. And so having talked about how God relates to space, that can now help us a little bit in terms of starting to think about how God relates to time. So going back to an example we already used, God heals a person. That person is in a particular place. And so that healing takes place in that place, right? That is the place where it happens. It also happens at a particular time. As we said, the person experiences that healing at that time in that place. But that doesn't mean that God acts at a particular time. What do we mean by that? Well, sort of the same thing we meant by place when we said, well, he doesn't travel around to do this thing over there and then this other thing over here. Same thing is true in time. God doesn't have, like, a checklist every day, right? Like, okay, you know, here's a list of the 150,000 infants who are going to be conceived today and the time of conception. So I can create their souls, right? Like, in order. And here's all the new mushrooms that are growing, and here's all the healings. I'm going to do. Right. God doesn't have like a big list of things and he like goes through them in order over the course of a day. Right. Obviously. Right. Nobody actually thinks that literally."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1756.28,"end":1756.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1758.04,"end":1762.2,"speaker":"Fr Stephen De Young","text":"Maybe William Lane, Crank, but no one serious thinks that literally."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1762.44,"end":1770.36,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is the image of God as Santa Claus. Right. Making a list, checking it twice. He's got all these things he's got to take care of."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1771.4,"end":1804.77,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That he's sort of micromanaging the universe. Right. By doing all these and doing them all in order. Because he experiences time the way we do. Right. It's easy to start thinking that way because what are we doing when we think that way? Well, that's how my life is. I have a bunch of things I have to do today at places I need to be at certain times. And so I go through and I try to check those off and get everything done and everything taken care of. Right. But I'm a human. God is not like me that way. I am a created thing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1804.93,"end":1805.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1807.67,"end":1840.45,"speaker":"Fr Stephen De Young","text":"You know, my dogs have things they need to do each day, like lay around and get into trouble and eat and go to the bathroom and they check those off one at a time. But God is not a created thing. Who needs to do that? Right? So we understand that. We understand that God doesn't. It isn't that God does something at 5 o' clock on a Friday. It's that a person is healed at 5 o' clock on a Friday and God did it. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1840.93,"end":1841.37,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1841.37,"end":1851.25,"speaker":"Fr Stephen De Young","text":"That may seem like it, but that's an important distinction. Right. Because one of those has God existing, like in time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1852.13,"end":1876.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't think we can underline too much that God is not bound by anything at all. Like there's this is. This is one of the, one of the roots of a lot of heresies is this, this notion that God has to obey rules or God is bound by something. We've talked about some of this before, but this is. We're kind of really, really fleshing out the time aspect of this, of it. This, this time around."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1876.94,"end":1901.84,"speaker":"Fr Stephen De Young","text":"Right. God doesn't experience a succession of moments. Yeah. Right. Like there's this moment and then the next moment. The next moment we experience that God doesn't. And part of that is. And we're going to talk about this more in a minute, we'll delve more into it. But God doesn't experience anything. But we'll come back to that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1901.92,"end":1903.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Just hold on to that idea, everybody."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1905.44,"end":1943.29,"speaker":"Fr Stephen De Young","text":"So that idea though, right. Once we really understand that God doesn't do Something at a certain time, but God does something and those of us who live in time experience it at a certain time. Right. God is not in a parallel world. Right. There's not a time zone in heaven. It is not 6:32pm in heaven right now or 7:32 or 5:32, wherever you think heaven is. I mean, West Virginia is almost there. Right. But."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1945.45,"end":1946.49,"speaker":"Fr Andrew Stephen Damick","text":"That'S what they say."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1946.81,"end":1975.14,"speaker":"Fr Stephen De Young","text":"It's not like an hour off. Right? Right. So there's not like this parallel heaven timeline that God is living in. Right. And once you really understand that, all kinds of theology falls apart. In our second half, we're going to get into some of the biblical words and biblical concepts related to this. But this kind of dismantles Calvinism."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1977.3,"end":1978.9,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, not, sorry, Calvinists."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1979.06,"end":1988.34,"speaker":"Fr Stephen De Young","text":"In the sense that if God is not. If God is outside of time and space, which he has to be to be God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1989.7,"end":1990.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1990.06,"end":1993.32,"speaker":"Fr Stephen De Young","text":"Let me be clear. If he's not, he's a creature. He's just a big creature."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1993.32,"end":1996.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If there's something bigger than God, then worship that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1996.76,"end":1997.24,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1997.48,"end":1997.88,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":1998.52,"end":2001.48,"speaker":"Fr Stephen De Young","text":"But there's not. Right. So God is outside of time and space."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2001.96,"end":2002.28,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2002.28,"end":2017.95,"speaker":"Fr Stephen De Young","text":"And if that's true, then it's impossible for God to make decrees or plans or choices or decisions before something happens in the created world."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2018.18,"end":2018.42,"speaker":"Fr Andrew Stephen Damick","text":"World."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2020.74,"end":2078.35,"speaker":"Fr Stephen De Young","text":"Like that language doesn't make sense. Right. And I know what some of our Calvinist friends are thinking right now. They're thinking to themselves, self, we talk about the logical order of the decrees, not the temporal order. That doesn't get you out of this because that implies God has to do things in some kind of logical order. Right. So the idea that God is somehow submitted to the laws of logic. So then isn't the Logos the actual God and not the God you're calling God if he's bound by it? A dog don't hunt. Yes. This applies to you too, William Lane Craig, who thinks God has to follow the laws of logic."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2080.91,"end":2084.35,"speaker":"Fr Andrew Stephen Damick","text":"Someone in the chat is asking about molinism. I can't believe it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2084.91,"end":2087.23,"speaker":"Fr Stephen De Young","text":"Well, we just mentioned William Lane Craig."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2087.23,"end":2087.95,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2090.67,"end":2141.57,"speaker":"Fr Stephen De Young","text":"Okay, so yeah, Molinism makes no sense because there God has knowledge of creatures before. Again before the creatures exist, which implies that God exists in this timeline. Right. By himself until a certain point in that timeline when he starts creating other things. Right. Molinism has that same problem that Calvinism has. And William Lane Craig will tell you that that's because he doesn't think God is outside of time. God is bound by time. He's gone by the laws of Logic. I don't think he's come out and admitted he's an open theist yet, but."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2142.61,"end":2143.57,"speaker":"Fr Andrew Stephen Damick","text":"Give it some time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2144.05,"end":2162.33,"speaker":"Fr Stephen De Young","text":"Give it some time. He's fractally wrong. I mean, once he realizes there's a heresy he doesn't teach, I'm sure he'll graft right onto it. So, yeah, ecumenism isn't the pan heresy. William Blade Craig is the pan here."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2162.57,"end":2163.05,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2167.45,"end":2185.18,"speaker":"Fr Stephen De Young","text":"So. But for. For those of you who like bashing Calvin, for those of you like bashing William Lane Craig, you're going to love this show. But for those who just like bashing Calvinists, if you're Arminians out there, I got bad news for you. This kind of ruins your party, too."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2185.5,"end":2190.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Because it's all dependent on this idea that God is in some way bound by linear time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2191.18,"end":2209.16,"speaker":"Fr Stephen De Young","text":"Right. That God knows things in advance. Right. So God exists at a particular time and then knows what's going to happen, like, the next day, even though it hasn't happened yet for him. See the problem?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2210.52,"end":2210.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2210.96,"end":2219.24,"speaker":"Fr Stephen De Young","text":"Right. That doesn't work either. And of course, open theism doesn't work because open theism requires God to be a. Basically a big creature."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2220.28,"end":2225.76,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yeah. It's almost like kind of a pig. A paganizing of God. You know, he's just."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2225.76,"end":2318.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So all that's just kind of mess. Right. So then, okay, we've talked about why God has to be separate from, apart from time. That time is an aspect of created things, the created order, the created world. Right. So if time is an aspect of. That doesn't apply to God, what is it? Right. What is it? And what do I mean by what is it? Is it in it even? So you're just talking about created things. Right? So bottle cap thing, chair thing, pen thing, Father Stephen DeYoung thing. Right. Created thing that exists in the world. Is time a thing? Is time a thing that God created? Right. God created time and it has some kind of existence. Is that a true statement or is time something else? It's time something else. So we've got proposals on this. We've got proposals on how to look at time. So if we go to our old friend Plato, if you haven't excised him from your brain yet, Plato is going to talk about time in terms of motion."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2319.46,"end":2321.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, especially if you accept space as a given."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2322.98,"end":2323.46,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2323.54,"end":2329.46,"speaker":"Fr Andrew Stephen Damick","text":"And you're trying to, like, figure out what is time. Motion seems kind of a pretty obvious place to go."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2329.86,"end":2358.47,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Because what is motion? Motion is when something crosses a certain Amount of space in a certain amount of time. That's motion, Right. So for Plato, of course, there are things that are in stasis that do not move. Stasis is a perfection for Plato."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2359.11,"end":2359.51,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2361.12,"end":2371.12,"speaker":"Fr Stephen De Young","text":"Not moving, never moving. We may have some listeners out there who aspire to Plato's perfection, but you shouldn't. You should go out there and do things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2372.24,"end":2380.24,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you could try to be completely immobile, but, you know, at a cellular level, you're really quite big."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2380.24,"end":2394.15,"speaker":"Fr Stephen De Young","text":"Yes, yes. And I mean, I know, I know Keith Richards outlived Richard Simmons, and there's an important lesson there, but still, you should try and get out and move a little."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2394.39,"end":2405.43,"speaker":"Fr Andrew Stephen Damick","text":"I still remember when Facebook often was attempting to get me to, quote, unquote, like the page, Richard Simmons for Holy Roman Emperor. And yeah, I just had to mention."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2405.43,"end":2407.11,"speaker":"Fr Stephen De Young","text":"That the time has passed."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2407.19,"end":2408.07,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2408.07,"end":2422.94,"speaker":"Fr Stephen De Young","text":"And Keith Richards outlived him back to the Rolling Stones. So for Plato, right. Any motion is a sign that something isn't being. It's in the realm of becoming, becoming."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2422.94,"end":2424.86,"speaker":"Fr Andrew Stephen Damick","text":"So therefore, kind of imperfect."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2425.74,"end":2452.15,"speaker":"Fr Stephen De Young","text":"Imperfect. Moving toward perfection, perhaps. Attempting to emulate perfection, perhaps. And so for Plato, the closest you can get to stasis without being stasis, right there, where you're still moving, but the closest you could get to stasis while still moving is basically moving in a very tight circle."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2453.51,"end":2453.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2454.23,"end":2501.46,"speaker":"Fr Stephen De Young","text":"Right. And the tighter the circle, the less you're moving. So circular motion for Plato is like a kind of perfection because it's approaching stasis. Think about. And so for him, he's going to see not just time as cyclical, but this is, you know, the cycle of the seasons, the cycles of the constellations. Right. The stars in the heavens. Right. These all move in these circular patterns. Right? And that circular, those circles, especially, the tighter the circle, the better. That's an emulation of the sort of perfection of stasis."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2502.26,"end":2502.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2503.62,"end":2530.55,"speaker":"Fr Stephen De Young","text":"So for Plato, the ultimate place to arrive. Right? Plato, really, when you actually understand Plato in his context, right. If you really understand what Plato is saying, you understand that he relates to Greek paganism basically the same way that early Buddhism relates to Hinduism."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2531.11,"end":2535.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a kind of intellectualizing of an existing religious tradition."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2536.23,"end":2610.04,"speaker":"Fr Stephen De Young","text":"And not just that, but I mean, in the details, right. Plato believes in reincarnation. Right. Plato believes, ultimately you're trying to achieve stasis, which is this ultimate, which is, you know, losing individuality. Right. It's very, very similar, right, Where. Where you get with, again, intellectualized paganism is intellectualized paganism. So your goal, right, is to get out of this cyclical reincarnation. Right. But so from that comes widespread in the pagan world. Right. You could think about the cycles in Hinduism and Buddhism. Right. The pagan world, time is seen as cyclical. Right. And this is true with the seasons and the constellations, like I mentioned. This is also true, like when you read Plato, this is how he understands Atlantis. Right. Civilizations rise and fall and rise and fall and rise and fall. Right. It's just this perpetual cycle of becoming that's trying to get to actually being. Actual being is complete stasis."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2610.12,"end":2610.52,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2612.92,"end":2645.21,"speaker":"Fr Stephen De Young","text":"So if the cosmos reached perfection, it would all stop moving. It would all be condensed at a single point. So kind of hoping for the big crunch, I guess, but. So another thing I mentioned in my earlier rant, bills of goods we were sold as children. I don't know how popular this one is anymore. But for a long time, especially if you got into philosophy of history at."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2645.21,"end":2645.49,"speaker":"Audience Member","text":"All."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2648.13,"end":2656.91,"speaker":"Fr Stephen De Young","text":"There was this rap that paganism viewed time as cyclical. Like we were just talking about is just an endless cycle."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2657.31,"end":2657.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2657.75,"end":2665.47,"speaker":"Fr Stephen De Young","text":"Whereas they would say the Hebrews brought us the idea of time is linear."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2667.71,"end":2680.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I, I heard that a bunch of times. I probably repeated it a few times myself. You know, the idea that there's a beginning and end to history, time is basically linear, that this is what the."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2680.66,"end":2721.18,"speaker":"Fr Stephen De Young","text":"Bible is doing from point A to point B. Yeah. And there's a problem that comes when you start reading the Bible, which is we're going to get into more of this in the second half. The Bible has lots of cycles in it. Cycles of feasts, a weekly cycle of the Sabbath. There's lots of these sort of repeating cycles. And as you read the text in the stories, you see these things, these patterns repeating over and over and over again in the Scriptures."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2722.94,"end":2723.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2723.34,"end":2771.86,"speaker":"Fr Stephen De Young","text":"And so then you get some more savvy people like, okay, well, so maybe that cyclical versus time is an arrow. Right. Maybe that's a little too simplistic. Right. Well, you know, we'll think about time in terms of the universe as being sort of a corkscrew or a spiral. So, yes, there's these repetitions, but it's also moving in one direction. Right, right. As a way of sort of envisioning time, like unfolding. Right. Contrary to all that, here's what I'm going to suggest, which we've suggested on the show before, but we're going to delve into it deeper tonight, and that is that time doesn't exist."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2773.46,"end":2774.5,"speaker":"Fr Andrew Stephen Damick","text":"Lunchtime, doubly."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2774.5,"end":2785.94,"speaker":"Fr Stephen De Young","text":"So, yes. All too short. You Know, like kids these days don't even get like the free 15 minute breaks every two hours."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2786.61,"end":2788.09,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2788.09,"end":2791.09,"speaker":"Fr Stephen De Young","text":"They work at an eight hour shift. They get like the half hour unpaid lunch and that's it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2791.41,"end":2792.05,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2793.57,"end":2810.37,"speaker":"Fr Stephen De Young","text":"Kids need to unionize, I'm telling you. Anyway, so. So time doesn't exist in the sense that time isn't a thing. It's not a thing. Sorry, sorry. Star Trek fans. Chronaton particles, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2812.05,"end":2826.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, I know. I love how Star Trek just made up some kind of particle to deal with every, like, fundamental physics problem that they were trying to overcome."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2826.89,"end":2850.31,"speaker":"Fr Stephen De Young","text":"Chronaton particles, very popular for time travel. Tachyon particles. Tachyons, yeah, yeah, yes, Sometimes, you know, the TARDIS little, you know, Eye of Harmony. Right. It's a little, little more vague, little more fantastical, as it were. A little less pseudo scientific. But yeah. Time isn't a thing that exists."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2851.27,"end":2851.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2852.39,"end":2860.87,"speaker":"Fr Stephen De Young","text":"Time exists at the level of experience. That doesn't mean it doesn't exist at all. Right. In the sense that you could like disbelieve it and it goes away."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2861.11,"end":2865.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not an object. It's not an object."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2867.22,"end":2871.94,"speaker":"Fr Stephen De Young","text":"But remember way back in the long ago time when we talked about our friend the mantis shrimp?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2872.66,"end":2875.14,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that was like first year, I think."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2875.3,"end":2893.39,"speaker":"Fr Stephen De Young","text":"Yeah. Who could see all those colors that we can't see, that we don't have a name for, that we don't have a way of describing because we fundamentally can't experience them. But the mantis shrimp can. Right. Those colors don't exist for humans. They do exist for a mantis shrimp."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2895.07,"end":2895.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2895.95,"end":2907.95,"speaker":"Fr Stephen De Young","text":"Because he's able to experience them, we're not able to experience them. And color only exists in the realm of experience. Color is an interpretation."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2908.99,"end":2909.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2909.35,"end":2937.48,"speaker":"Fr Stephen De Young","text":"It's the way our eyes, the colors we see as humans are based on the way our eyes process certain wavelengths of light. Right. So if there were no humans left on Earth, or if all humans were blind, like in that weird Apple TV show, See with Jason Momoa, if everyone on Earth was blind, Right. Could not see at all. Right. Color would not exist. All of those wavelengths of light would still exist."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2937.96,"end":2938.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2939.4,"end":2942.44,"speaker":"Fr Stephen De Young","text":"But since no one could see anything, there would be no color."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2943.64,"end":2961.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like to analogize maybe the difference between sound and music. You know, there's sounds like there's vibrations. Right. The air can vibrate. But music is an experience that someone is having of a series of vibrations. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2961.72,"end":2965.24,"speaker":"Fr Stephen De Young","text":"The sound of a dog whistle does not exist for humans. It does for dogs."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2965.64,"end":2966.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2966.36,"end":2971.71,"speaker":"Fr Stephen De Young","text":"That weird Song they used to play outside Circle K's that drove off teenagers, then adults couldn't hear."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2973.47,"end":2974.51,"speaker":"Fr Andrew Stephen Damick","text":"Wait, is that a thing?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2975.07,"end":2976.43,"speaker":"Fr Stephen De Young","text":"Yes. You don't know about that?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2976.91,"end":2977.31,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2978.03,"end":2983.47,"speaker":"Fr Stephen De Young","text":"Yes. There's a particular tone that, like, kids could hear up until they're, like, 16."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2985.31,"end":2986.19,"speaker":"Fr Andrew Stephen Damick","text":"Are you serious?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2986.43,"end":2990.59,"speaker":"Fr Stephen De Young","text":"Yes. And then the shape of the inner ear changes and people can't hear it anymore."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2991.07,"end":2991.63,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":2992.43,"end":3001.66,"speaker":"Fr Stephen De Young","text":"It also drives dogs insane. So be careful if you look it up and experiment with it. Like, I played it once at my house. I couldn't hear anything at all, and my dogs went crazy."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3001.66,"end":3007.42,"speaker":"Fr Andrew Stephen Damick","text":"There's gotta be some kind of Bill and Ted joke in here or. Yeah. Strange things are afooted."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3007.5,"end":3009.82,"speaker":"Fr Stephen De Young","text":"People started using it to prevent loitering."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3010.7,"end":3011.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3011.74,"end":3016.78,"speaker":"Fr Stephen De Young","text":"They play it, like, outside their business and stuff to get kids to go away."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3017.18,"end":3023.5,"speaker":"Fr Andrew Stephen Damick","text":"That's like when. When I was a stagehand, we used to play Green Day to get certain kinds of audiences to go away."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3023.74,"end":3037.14,"speaker":"Fr Stephen De Young","text":"Yeah. So there is. There is a. There is such a sound, but that sound only exists for today and for younger humans and dogs, apparently, and probably some other animals, but doesn't exist for adult humans."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3037.14,"end":3037.66,"speaker":"Fr Andrew Stephen Damick","text":"They can't."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3037.74,"end":3050.3,"speaker":"Fr Stephen De Young","text":"Can't hear it. So that same vibration is going out into the air. You could say that vibration exists, but the sound doesn't exist because you can't hear it. And the sound is the interpretation."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3050.62,"end":3051.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3052.14,"end":3055.9,"speaker":"Fr Stephen De Young","text":"And so this is what we mean when we say time doesn't exist. Not that it's not real."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3057.08,"end":3063.72,"speaker":"Fr Andrew Stephen Damick","text":"It's phenomenological, meaning it's within the realm of experience. In our case of human experience, it's something we experience."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3064.28,"end":3087.53,"speaker":"Fr Stephen De Young","text":"And that means, just like with those sounds, different kinds of creatures experience those sounds differently. Right. And so different creatures experience time differently. Right. So goldfish, for example, have, like, no persistent memory of anything."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3087.53,"end":3089.57,"speaker":"Fr Andrew Stephen Damick","text":"I. I think that's an urban legend."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3090.13,"end":3092.21,"speaker":"Fr Stephen De Young","text":"I think it's true. We're going with it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3093.81,"end":3100.21,"speaker":"Fr Andrew Stephen Damick","text":"Although I. I did used to be an aquarist, but I was never a goldfish keeper, so I can't, you know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3100.85,"end":3115.5,"speaker":"Fr Stephen De Young","text":"Right. Meaning they won't have an experience of time. We're gonna get more into the experience of time in our. In our third half. Right. My dogs experience time differently than I do."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3116.22,"end":3116.74,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3116.74,"end":3133.34,"speaker":"Fr Stephen De Young","text":"Yeah. Unless they go to sleep, they can't tell how long I've been gone. I can walk outside and check the mail, or I could be gone for, like, five or six hours. They react the exact same way when I walk back into the door."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3137.34,"end":3137.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3138.22,"end":3234.57,"speaker":"Fr Stephen De Young","text":"They're dogs. They experience time differently than I do. Right. But to verify this in case you don't believe me, humans, like even a single human, even you, the listener, have undoubtedly. We talked about this at least once before kind of teasing this episode. In the past, you have experienced over the course of your life, time differently at different times. Right. There have been periods of your life, maybe within the last six months. There have been times where time seemed to move really slowly and when it seemed to move very quickly. Or you could look at different periods of your life, quit using the word time periods of your life and say, yeah, that thing seemed to just. Time just seem to fly by then. This other time, it seemed to drag on. Right. So objectively, right. Quote, unquote, objectively, time would always move at the rate of 1 second per second, right? Yeah. That's the speed of time. One second per second. So. Right. But we all know how variable it is in our experience because it is just a factor of our experience. And this is ultimately why God isn't affected by time, why time is not a category you can apply to God. Because God doesn't have experiences."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3235.45,"end":3283.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which might sound like a weird thing to say, but think about this for a second, boys and girls. An experience means you're being acted upon, right? An experience changes you in some way. You're undergoing something. Right. You're being acted upon. So that means that you are, to use a technical, philosophical term, passible. P, A, S, S, I, B, L, E, not passible. Like this tastes passable, but passible. In other words, able to be acted upon. So that's why we have experiences, because we're able to be acted upon. We can be impinged upon, but God is not. This is a core theological teaching in Christianity. God is not passible. He's not able to be acted upon."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3283.5,"end":3291.02,"speaker":"Fr Stephen De Young","text":"I can experience something I've never experienced before. I can learn something I didn't know before. I can see something I haven't seen before."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3291.5,"end":3291.9,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3292.38,"end":3394.61,"speaker":"Fr Stephen De Young","text":"Right. All these. I can. These experiences, I can experience something I've never experienced or that can't happen to God. Right. God doesn't learn things or see new things that he hasn't seen. Right. God is God. Right. So this whole category of experience, as Father Andrew said, requires being acted upon. God is not acted upon, meaning God doesn't have experiences. And so categories like time or like distance in space don't apply to him. Being acted upon being passable. Having experiences is a quality of being a creature, being created, being finite. I have had a finite number of experiences in my life, and when I have a new one, I Am adding one more. But that's not true of God. It can't be if he's God. So this is why we experience something like time. It is an ordering of our other experiences, essentially. Now, this may raise a question for someone, right? This may raise a question for someone. And we're going to come back to this in a little more detail. But. But I'm sure there's someone out there. You may have already had your ears perk up when I was talking about God not doing anything in a place or traveling to a place to do something. Some of you guys out there may have been thinking, what about our Lord Jesus Christ? He traveled places and healed people."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3395.09,"end":3403.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We actually just had someone in the YouTube chat asked, what about Christ? Does he have experiences? Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3403.89,"end":3406.33,"speaker":"Fr Stephen De Young","text":"I'm way ahead of you, pal. Eating your lunch."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3406.49,"end":3412.29,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, you're tracking, Sam. Don't worry. You're tracking. You're with us. Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3412.29,"end":3429.53,"speaker":"Fr Stephen De Young","text":"This is all in the notes, right? And you maybe went well. Like, didn't Christ ex. Christ was born as an infant. He grew up. Right. Like, didn't he have experiences and experience time? We're going to come back to this in more detail. But for now we have to say remember once again."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3430.54,"end":3430.78,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3430.78,"end":3469.99,"speaker":"Fr Stephen De Young","text":"Anytime you start thinking about what would it be like to be our Lord Jesus Christ, what would it be like to be the second person of the Trinity made flesh for our salvation? Like, bro, again, I can't even understand what it's like to be a bat. I'm not figuring that one out. Right. I don't know what it's like to be a bat. I don't know what it's like to be Father Andrew. I don't know what it's like to be one of my dogs. I'm not going to be able to figure out what it's like to be the divine Logos."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3471.59,"end":3471.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3472.31,"end":3517.29,"speaker":"Fr Stephen De Young","text":"That's unless you're not. But we'll come back to that. We'll come back to the human experience of time in the third half. We'll come back to the human experience of time when we're talking about what that is and talk about how that relates to our Lord Jesus Christ in the incarnation. So we will come back to that in more detail. Stick with done here. And I think the last time we were talking about this back, we were talking about the mana shrimp. We mentioned deep time. Deep time, for those who don't know, is the idea of, what do you call, quote unquote, theoretical time, where there is no observer."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3518.49,"end":3518.89,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3519.05,"end":3522.09,"speaker":"Fr Stephen De Young","text":"Right. There's no One experiencing that time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3523.53,"end":3526.65,"speaker":"Fr Andrew Stephen Damick","text":"I remember back when we just had the simple word prehistoric."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3527.29,"end":3529.77,"speaker":"Fr Stephen De Young","text":"Yeah. Well, that's when no one was able to write about it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3530.01,"end":3530.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3531.37,"end":3535.72,"speaker":"Fr Stephen De Young","text":"But even before people could write about it, they were there experiencing it. Yeah, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3535.96,"end":3536.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3536.52,"end":3545.8,"speaker":"Fr Stephen De Young","text":"But what about before? And I mean, even if you're young Earth creationist, Right. There's a few days before there's humans."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3546.52,"end":3547.08,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3547.56,"end":3551.72,"speaker":"Fr Stephen De Young","text":"There's a few days before there's animals even to experience time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3553.56,"end":3554.2,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3555.16,"end":3555.56,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3557.8,"end":3563.89,"speaker":"Fr Stephen De Young","text":"What is an hour if there's nothing consciously experiencing that hour?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3566.13,"end":3566.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3566.89,"end":3569.25,"speaker":"Fr Stephen De Young","text":"And I mean, that's the concept of deep time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3569.41,"end":3569.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3569.73,"end":3571.25,"speaker":"Fr Stephen De Young","text":"And this hypothetical time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3571.49,"end":3583.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, this is not. This is not just a sort of a theological or philosophical thing to say. Right. Like, I'm not a physicist, but I have heard physicists say."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3583.97,"end":3585.33,"speaker":"Fr Stephen De Young","text":"And you play one on tv."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3585.58,"end":3629.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I've never played one on TV either, although I feel like I could do that. But, you know, physicists will say that particles and waves and whatever behave differently when they're observed versus when they're not observed, which is a weird, crazy thing to try to wrap your brain around that somehow observation makes the physical world behave differently. But it's. That's the reality. That's just the truth. So why shouldn't that be simply true if that's what, you know, these people who are at the weird, weird edges of science are saying about this stuff, that what does it mean that there's time when there's no conscious creatures to experience it? But."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3629.79,"end":3636.19,"speaker":"Fr Stephen De Young","text":"Yeah, so this. And I just want to be clear, this deep time thing is not just a question of old Earth people, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3636.19,"end":3637.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3637.57,"end":3657.65,"speaker":"Fr Stephen De Young","text":"It's not just a question of that. Right. You've got at least 24 hours where there's a rock with. With no, like, biological life experiencing time on it. Even if you're a really strict literalist young Earth creationist."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3657.97,"end":3658.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3658.69,"end":3673.41,"speaker":"Fr Stephen De Young","text":"Right. So you've got at least 24 hours of deep time going on, minimum there. Right. You could say, well, God's there. But again, as we've said, God doesn't experience time in a succession of moments like that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3673.57,"end":3674.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3674.77,"end":3689.09,"speaker":"Fr Stephen De Young","text":"Right. We also, for the record, don't know how angels experience time once again. Right. Because, for example, they're not mutable the way we are. Right. They don't change. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3689.09,"end":3700.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's this assumption that gives rise to different. There's what is, frankly, one of the most frequent questions we get, which is why can't angels repent? This has a lot to do with it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3700.56,"end":3722.38,"speaker":"Fr Stephen De Young","text":"Yes, yes. They are created they are finite. Right. So I would say based on that, that they have some experience of time. That would be what allowed some of them to fall. Right. So far as we talk about falling. But that doesn't necessarily mean that there is some means of repentance."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3722.86,"end":3723.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3723.3,"end":3726.22,"speaker":"Fr Stephen De Young","text":"Because again, it is different than how humans experience time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3727.1,"end":3736.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, that wraps up the first half of this episode of the Lord of Spirits where we do experience time. We're going to go ahead and take a short break and we'll be right back."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3736.86,"end":3754.69,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3759.01,"end":3828.52,"speaker":"Fr Stephen De Young","text":"The top 10 reasons to attend the ancient faith men's One, fellowship with other Orthodox Christian men. Two, hearing from four speakers, all priests and one hieromunk. Number three, daily matins and vespers, plus acathist on Friday and divine liturgy on Sunday. Four, supplication at the relics of St. Raphael and learning about his life in the Antiochian Village Museum. Number five, giving back to Antiochian Village through a service project. Number six, enjoying the beautiful grounds of Antiochian Village, including the meditation trail and hikes. Number seven, football during free time. Number eight, delicious breakfast, lunch and dinner. Number nine, bonfires and s' mores each night. And number ten, the opportunity to learn and be encouraged in what it means to be a man. August 22, 25, 2024 at Antiochian Village in Bolivar, Pennsylvania. For more information and to register, just click on the banner on the Ancient Faith website, home or the lead graphic on the AFM app. We really hope to see you there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3831.72,"end":3847.72,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3848.28,"end":3854.73,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. Second half of Lord of Spirits podcast here on August 1, 2024."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3855.77,"end":3858.57,"speaker":"Fr Stephen De Young","text":"We're talking about that they're men's retreat."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3858.97,"end":3860.65,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I'm not gonna be there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3861.85,"end":3866.77,"speaker":"Fr Stephen De Young","text":"Well, this is the you like you as representative of ancient Faith. Hive mind."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3866.77,"end":3870.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. Because I run everything so right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3870.89,"end":3885.66,"speaker":"Fr Stephen De Young","text":"Well, you're connected to the whole, to the collective. I think you should give away chamois. I'm not saying you have to go all in on the money and get like sham. Wow. But just some nice shammy cloth."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3886.62,"end":3887.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3887.26,"end":3892.94,"speaker":"Fr Stephen De Young","text":"Guy goes to a Men's retreat comes home with a shammy. He's going to be a happy guy, those friends next year."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3893.82,"end":3895.02,"speaker":"Fr Andrew Stephen Damick","text":"Look what I got, dear."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3895.9,"end":3898.46,"speaker":"Fr Stephen De Young","text":"Yeah, you put an extra faith logo on it or something?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3898.7,"end":3899.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There you go."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3899.62,"end":3901.18,"speaker":"Fr Stephen De Young","text":"Oh, they're drying his car."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3901.42,"end":3911.54,"speaker":"Fr Andrew Stephen Damick","text":"Worst merch ever. Anyway, we are talking about time, and we do have some people who are calling us. I don't know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3911.54,"end":3912.42,"speaker":"Fr Stephen De Young","text":"It's crazy."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3912.42,"end":3913.54,"speaker":"Fr Andrew Stephen Damick","text":"People want to talk to us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3913.54,"end":3916.38,"speaker":"Fr Stephen De Young","text":"So we will experience a succession of calls."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3916.54,"end":3923.42,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. So we've got James, whose phone at least is from New Mexico. So, James, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3924.38,"end":3925.9,"speaker":"Audience Member","text":"Thank you so much for having me, Father."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3926.3,"end":3930.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. What's on your mind? Not Albuquerque."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3931.82,"end":3937.98,"speaker":"Audience Member","text":"So I just. I kept the number. I used to live in Albuquerque, but I'm currently in Denver, Colorado right now."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3938.22,"end":3940.54,"speaker":"Fr Andrew Stephen Damick","text":"So you did take a left turn at Albuquerque?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3941.26,"end":3943.5,"speaker":"Audience Member","text":"I did, I did. Went up through the mountains."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3943.98,"end":3948.22,"speaker":"Fr Stephen De Young","text":"When you were in Albuquerque, did you work for a drug cartel distributing methamphetamine?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3949.42,"end":3951.42,"speaker":"Audience Member","text":"I can neither affirm nor deny."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3951.74,"end":3955.71,"speaker":"Fr Stephen De Young","text":"Wow. I've been taught by TV that that's all that happens at Albuquerque."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3957.14,"end":3960.5,"speaker":"Audience Member","text":"I. That's. I mean, that's about it. There's not much else to do."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3960.5,"end":3960.86,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3960.86,"end":3962.74,"speaker":"Audience Member","text":"That. Need all Mexican food."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3962.98,"end":3965.3,"speaker":"Fr Andrew Stephen Damick","text":"Throwing his old hometown under the bus there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3969.54,"end":3971.3,"speaker":"Fr Stephen De Young","text":"So, James, what's."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3972.1,"end":3973.06,"speaker":"Fr Andrew Stephen Damick","text":"What's cracking?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3974.34,"end":3975.38,"speaker":"Audience Member","text":"So I had a question."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3975.94,"end":3976.74,"speaker":"Fr Andrew Stephen Damick","text":"Drug reference."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":3980.18,"end":4019.96,"speaker":"Audience Member","text":"I. So tomorrow evening, there is going to be a debate amongst two Protestants on the concept of open theism. And I have heard that there are some Orthodox theologians that have concepts that are similar to the concept of open theism. One that comes to mind is Father Sergei Bulkikov. I don't know if I'm pronouncing that correctly, but I was just wondering what the Orthodox conception is to the response of the extreme understanding of libertarian free will and open theism. And kind of a good response to that or."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4021.32,"end":4021.96,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4022.04,"end":4023.24,"speaker":"Audience Member","text":"What do you guys think about that?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4023.64,"end":4039.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we talked about open theism a little bit in the first half, but, I mean, it's fatal flaw, really, right. Is this idea that God is not only bound by time, but that he's less, you know, that he doesn't know things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4039.89,"end":4040.77,"speaker":"Fr Stephen De Young","text":"He's finite."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4041.09,"end":4105.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's finite. God is less than. Right. And that's fundamentally not the God of the Holy Scriptures, not the God of Christianity. I mean, I get why people are into open theism. You know, assuming they're doing in good faith, right? It's because they. They want to sort of let God off the hook for stuff that they don't Want to blame him for, you know, I, I, I get that. Right. But, but that to me, frankly is a cop out. I, I understand, I get it. But it, it's, it's a cop out. It's an attempt not to really trying to understand what God has actually revealed himself to be doing and who he really is. But, but ultimately it has a basic theological problem which is, as we said, that God is finite. Therefore, like, why would you then want to worship a finite creature unless you're some kind of pagan? Because that's what pagans do is they worship finite beings who are just, you know, really big."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4105.87,"end":4106.27,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4106.27,"end":4109.95,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. Father Stephen, anything else you want to add correctly?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4109.95,"end":4251.22,"speaker":"Fr Stephen De Young","text":"I mean that that's, that's basically true, that it's a finite being. So it is like one of the gods of the polytheists. Right. It's not the Christian God. But so part of what engenders it is that, you know, especially in the United States, right. The undercurrent of our whole culture is Calvinist Puritanism. And so even the folks who out there, especially the evangelical world, who are most anti Calvinist, still accept all the Calvinist presuppositions. So it's sort of like what we've, what we've said before where we're talking about modernism and pointed out that fundamentalism is a modernism. It's not really opposed to modernism because fundamentalism accepts all the presuppositions of modernism, but then tries to use the same methodology to come to the opposite conclusions. So this is our criticism of a lot of forms of young earth creationism that we've said in the past. Right. People will take all of the assumptions of modern science and all of the methodology of modern science, accept it all, and then try and use those methodologies and those tools to come to the opposite results that most scientists do instead of critiquing the methodology itself and critiquing the presuppositions themselves. Yeah, right, yeah. And so open theism happens when you accept the idea that everything that happens in the world ever at all, God is somehow the agent of it. Right. Okay. If God is who Christians say they are, say he is, then everything that happens, God is the agent. So when horrible, hideous, awful things happen, God is the agent of them. Right. That's the conclusion that a lot of Calvinists, if you pin them down, will just come out and say, yes, right, yes, God is the agent of that. God decreed that that would happen. Right. And so the person who becomes an OPHIS is like well, that's horrible. I don't want God to be the agent of rape and murder and evil."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4251.94,"end":4252.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4254.02,"end":4263.7,"speaker":"Fr Stephen De Young","text":"But they've accepted those Calvinist presuppositions. So they say, well, therefore God must not be the agent of any of these things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4264.5,"end":4264.86,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4264.86,"end":4276.11,"speaker":"Fr Stephen De Young","text":"God must be powerless in the face of these things. God must be unable to do that. Right. That's the only way they can see to sort of get God off the hook."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4276.99,"end":4277.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4277.35,"end":4307.32,"speaker":"Fr Stephen De Young","text":"Right. And what they're. They're failing to attack some of the basic premises and we were talking about when, when we brought up open theism, some of those basic premises, like the basic premise that God can make a decree, quote unquote, before something happens. Right. That's an incorrect view of the relationship between God and time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4309.32,"end":4309.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4309.8,"end":4365.15,"speaker":"Fr Stephen De Young","text":"Both the person who says God knows today what will happen tomorrow and the open theist who says God doesn't know today what will happen tomorrow, agree on a basic presupposition that God exists today. Right. God exists within time. And if we accept that he doesn't. Right. If we accept that God acts and God's actions manifest themselves in time, then that means that not everything that manifests in time and space of the world is God's action. There are things that are the results of human action. For example, sometimes at the goading of the demonic, and then evil comes into the world. But it's through human action, not through God's action."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4367.39,"end":4367.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4368.67,"end":4440.82,"speaker":"Fr Stephen De Young","text":"So I think that is our response to open theism is, number one, that's not the true God. You've created a God that is like one of the pagan gods. That's not the God of Christianity, of the Christian religion, which can't be said forcefully enough. And trying to talk to an open theist about the Holy Trinity is good luck with that. So they've crafted this to the God. But then also this bad presupposition, and this is a kind of chronic problem in Calvinism, is the depiction of God not as God acting in his creation and acting powerfully where no one can prevent it, but God is behind the scenes pulling strings, maneuvering things into place where people all think they're making decisions, but they aren't really. God is kind of puppeteering them. Right. That view of God is frankly nowhere in the scriptures. Right. And doesn't make a heck of a lot of logical sense either."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4443.86,"end":4444.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4444.34,"end":4444.66,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4444.66,"end":4445.22,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4446.9,"end":4447.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4448.1,"end":4451.5,"speaker":"Fr Andrew Stephen Damick","text":"All right. Does that help, James? It does. Yes, it does."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4451.5,"end":4452.26,"speaker":"Audience Member","text":"Thank you so much."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4452.5,"end":4459.3,"speaker":"Fr Andrew Stephen Damick","text":"Great. All right, thanks for calling. Okay, next we've got William of Tennessee. William of Tennessee. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4460.76,"end":4462.36,"speaker":"Audience Member","text":"Thank you, Father. It's good to be here."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4462.84,"end":4463.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what's."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4463.72,"end":4467.48,"speaker":"Fr Stephen De Young","text":"Were you born on a mountaintop in Tennessee?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4467.64,"end":4469.08,"speaker":"Audience Member","text":"Greenest state, land of the free?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4469.4,"end":4469.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4470.68,"end":4471.04,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4471.04,"end":4475.08,"speaker":"Audience Member","text":"And I very much do not want to kill a bar, not even when I'm a three."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4478.68,"end":4489.44,"speaker":"Fr Andrew Stephen Damick","text":"You have to wonder, though, about that football team named the Tennessee Titans. I mean, from a. You know, Titans, right. This is, you know, chained up in Tartarus kind of thing. Just throwing that out there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4489.44,"end":4492.04,"speaker":"Fr Stephen De Young","text":"But anyway, Fantasy Oilers doesn't make any sense, though."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4492.12,"end":4496.68,"speaker":"Fr Andrew Stephen Damick","text":"That's true. True. All right. Anyways, William, what's going on?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4497.64,"end":4534.92,"speaker":"Audience Member","text":"Well, speaking of Titans and paganism, at the beginning of the episode, Father Stephen went on the diatribe about the myth of the great through line of Western civilization, ancient sumer, continuous lying to whoever we like. Right. Now, my question is this. This story which has tried to fuse Christianity and paganism, now they're pulling it apart. What's the difference between this and universal history, which seems to take things like the Trojan War and the Norse Eddas and stuff and bring them into the Christian story?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4535.96,"end":4672.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, this is a great question. So, right. So, okay, history, right. History is a thing, and it's ultimately a story of a people. Right. So it's about how all these other stories feed into the story of us here and now. Okay. That is not the same thing as saying that there is this linear. This metaphysical, linear progression of time that. That, you know, everything ultimately, you know, belongs to. Or something like that. Right. And also, I think one of the things that's quite different between traditional Christian universal history and what's going on with, you know, 19th century, frankly, German Lutheranism and, you know, that kind of philosophical tradition is that the. The approach that traditional Christianity has to. That is the approach that, for instance, St. Justin Martyr has, which is the idea that there's seeds of the Logos. These things ultimately, you know, are not. It's not that they're consistent. They're not consistent. There's a sifting going on. Right. There's conversion going on. Right. You can't keep everything. Right. You can't pretend that ancient paganism is equal to Christianity. Right. You know, and St. Basil the Great, of course, in his famous address to young men on the uses of Greek literature, he goes on exactly about how you do this. It's worth reading. It's on the Internet. You can read it. This is not the same thing as saying, you know, everything leads up to this point in history, and we are the pinnacle of history. That's not what that's saying at all. Right. So the question is, what is the goal and how do you understand the road getting there? Right. And also then there's the metaphysical stuff, which very much determines how you read all of that. So that's how I'd say that the difference between the tradition, Christian tradition of universal history is. And this idea of kind of the end of history that you get, which comes in with, you know, 19th century German Christianity. So I don't know, Father, what do you got to say about any of that?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4673.42,"end":4704.95,"speaker":"Fr Stephen De Young","text":"Well, I barely know Rick Roper, if that's his real name, and I don't have time for his silliness in his videos, so I feel no need to defend him. But yeah, I mean, I think there's an important. So from my perspective, right, when I'm looking at the way like the scriptures interact with pagan myth, right. They don't on the one hand say, oh, this is all made up nonsense, forget about it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4705.51,"end":4705.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4706.87,"end":4734.26,"speaker":"Fr Stephen De Young","text":"But they don't on the other hand say this is all true and is all part of the same tradition that we're a part of. Right. That there is a constant latent critique and correction. Right. And readdress like, yes, there is a flood that happened. You've heard all these stories about it, but here's what really happened. And often the details as expressed in scripture are inversions of the pagan stories."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4734.74,"end":4735.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4736.34,"end":4743.7,"speaker":"Fr Stephen De Young","text":"Or rather from the perspective of the Christian tradition, the pagan stories are an inversion of the truth."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4745.06,"end":4745.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4747.38,"end":4808.48,"speaker":"Fr Stephen De Young","text":"So when I look at, say, the famous statue of Athena where wisdom is being embodied by the sculptor in ancient Greece, wisdom is embodied as a half naked woman standing next to a serpent. I see something going on there from the perspective of my Christian tradition. And what's going on there is not. Oh, see, this is all part of our growth toward our perfect modern day religion. This is another step down the same road as the Hebrew Bible. I see this as, oh, look, the benighted people of Greece were worshiping demons, Right. And their depiction of wisdom looks an awful lot like Eve listening to the serpent. And this is their depiction of what it means to be wise. Right. And that's probably not coincidental."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4809.56,"end":4811.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the details are really important here."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4812.12,"end":4823,"speaker":"Fr Stephen De Young","text":"So that to me, right, you know, Rip Hunter, whatever he's doing with Pageau, I don't know, but."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4825,"end":4828.4,"speaker":"Fr Andrew Stephen Damick","text":"He doesn't own universal history. That's what I put that out there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4828.4,"end":4831.8,"speaker":"Fr Stephen De Young","text":"That's why. Well, that's the name I always hear associated with it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4831.96,"end":4832.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4833.08,"end":4848.2,"speaker":"Fr Stephen De Young","text":"Is Rick Roll. So. But yeah, so I Think that's. That to me is the key difference between what's going on with Western civilization. I think the myth of Western civilization, there's a heavy dose of perennialism in it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4849.4,"end":4849.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4850.28,"end":4851.76,"speaker":"Fr Stephen De Young","text":"That I don't think is a part."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4851.76,"end":4852.12,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4854.6,"end":4856.28,"speaker":"Fr Stephen De Young","text":"The actual Christian tradition."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4856.76,"end":4860.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Does that help, William?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4862.05,"end":4870.21,"speaker":"Audience Member","text":"I think so. The difference between baptizing these versus just the perennialist, take all of it itself, and it culminates in the end of history."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4870.85,"end":4872.53,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4872.93,"end":4881.09,"speaker":"Audience Member","text":"Okay. And then I did have a question on topic. If there is time, at least on the topic of the episode, pun intended."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4881.41,"end":4883.01,"speaker":"Fr Stephen De Young","text":"We've got nothing for time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4883.17,"end":4884.53,"speaker":"Fr Andrew Stephen Damick","text":"Two for one deal here."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4886.13,"end":4969.42,"speaker":"Audience Member","text":"I will take it. So this is, and this will probably be talked about more in this half as well, with our Calvinist friends who, because they see how they see God's omnipotence and omniscience and his role as the Creator ultimately means that he creates certain people for the purpose. Well, not for the purpose. Well, they would say for the purpose of damnation. Because they would say that he creates some people knowing that in the last judgments that person will be among the goats and not the sheep. And if I were a Calvinist, in response to the God existing in time and knowing what will come ahead, I would say, well, I can say God exists outside of time and is looking down like on a game board, knowing the past, present and future all simultaneously. But he also created creation and knows how everything is and will develop at the last judgment. So how. How we critique their understanding of time, that leads them and agency, I suppose that leads them to the conclusion of God creates certain people for damnation."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4970.88,"end":4973.76,"speaker":"Fr Andrew Stephen Damick","text":"What do you think, Father? You're the one who's got the expertise on Calvinism."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":4974.48,"end":5018.67,"speaker":"Fr Stephen De Young","text":"So the problem is the view of God being up above time and looking down on it isn't really him. Being outside of that isn't the same thing as temporal categories not applying to him. Right. In the sense that. Let's use our space metaphor. Right. Someone could say the same thing about God's relationship to space. Well, yes, God isn't in any particular place on earth. He's up above in heaven somewhere looking down on the universe. Right. And we would say, well, no, that's not really what God's omnipresence means. And that's not really what we mean when we say that doesn't apply to God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5019.79,"end":5020.19,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5020.59,"end":5110.53,"speaker":"Fr Stephen De Young","text":"Because again, we're picturing him like he's a big human somewhere looking at the whole thing. Like we can only see this part, but God could see the whole thing but he's seeing it, he's knowing it. He's thinking about it the same way we do. Right. So there's still an anthropomorphizing going on there. Right. There's still a subjecting God to our are human limitations. Right? So there's also an issue here with this idea of. And we've talked about this in terms of what the will is, right. That there's a whole complex of presuppositions going on here. One of them is that having a free will means I could choose to do a, or I could choose to do not a, or even opposite of a. Right. That that's what free will means. And so if I'm not totally free to do anything, then I don't have free will. Now, of course, that doesn't make any sense, Right. Because there's all kinds of things I'm not free to do, like fly. I mean, not just flying under my own power. Trust me, when I go to an airport. Right. I'm sorry, the idea of me being able to actually fly anywhere is a pipe dream."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5111.33,"end":5115.21,"speaker":"Fr Andrew Stephen Damick","text":"Steven has many amusing and horrifying stories about air travel."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5115.21,"end":5123.33,"speaker":"Fr Stephen De Young","text":"Being stuck in airports, Right. I don't want to be stuck in airports. Right. And I still have free will, but I can't get out. Right? Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5123.97,"end":5130.74,"speaker":"Fr Andrew Stephen Damick","text":"My favorite one is the one that has the climax of. And then the looting started. Yeah, but we don't need to get into that anyway."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5130.74,"end":5417.29,"speaker":"Fr Stephen De Young","text":"Yeah, but so there's all kinds of. At any given moment in time, there's a relatively limited number of things I even theoretically could choose to do. Right? And I say theoretically, there's all kinds of things I could theoretically do that are just absurd. You know, I could grab a pen and shove it in my eye. But why would I, Right. Why would I do that? I mean, technically I'm free to do that, right? But, like, I don't want to. Right? Why would I? Right? So when we talk about the will, we're talking primarily about the natural will, right? So having free will means being free to flourish, to become fully human, to develop into the person that God created you to be. And so sin, right? Me being able to sin is not freedom. Me being able to sin is lack of freedom. Because sin will stop me from growing and achieving that. That's why sin enslaves us. Right? That's why. And this is. This is a big point that Saint Maximus the Confessor makes, is that in the eschaton, in the life of the world to come, we will be totally free and we will be totally free because we are not able to sin. Right. And that phrase runs afoul of like all the presuppositions in any kind of Calvinism debate, right. That I am at my most free when I cannot sin. Right. That breaks all the presuppositions because it's a fundamentally different understanding of freedom and the will and sin that isn't held. So that's a presupposition that has to be broken down. So the idea is that the person who God has reprobated, the person who God has created in order to condemn him to eternal torment for his own glory, which is what Calvinism teaches. Okay, that is what Calvinism teaches. It's not that he knows, Right. That's Arminianism is that God knows Calvinism. God creates people in order as vessels of wrath, in order to condemn them to eternal punishment or for his own glory. It's what Calvinism teaches. Right. The basic idea there is that that person is unable to repent because for Calvinists, all people are unable to repent. God has to come and make you repent. He does it to you, right? Literally against your will, because your will is completely sinful. He repents you. Right. And so there, you know, we could really get into the weeds here. So, like Abraham Kuyper's idea of eternal justification and things like this in relation to time. But what all of these things have in common is that God is making some decrees regarding people's eternal destiny before he creates them. And it doesn't really matter if it's temporally before or logically before. There is still a flow of time and God is standing at one point in it. Right. And so it, it, it's. It's not logically coherent at that point. Right. To understand that way, it's subjecting God to our sort of human logic and our human experience of time, any way you slice it, in order to try to argue the point. And if you don't do that, you can't argue the point. Right? So if you say to one of our Calvinist friends, okay, I want you to argue to me for predestination and reprobation without using the term before. You can't do it. You can't argue for it without saying God blank before he blank."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5419.29,"end":5419.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5420.17,"end":5431.38,"speaker":"Fr Stephen De Young","text":"Like you can't. And so it's impossible to argue for without presupposing a relationship between God and time. That's inaccurate."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5431.62,"end":5438.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, well, that's why they just often throw in phrases like in such a way as that's my favorite."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5438.66,"end":5440.26,"speaker":"Fr Stephen De Young","text":"Yes, the quasi queedam."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5440.82,"end":5444.5,"speaker":"Fr Andrew Stephen Damick","text":"I know. Anyway, I hope that helps William."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5446.42,"end":5448.18,"speaker":"Audience Member","text":"Somewhat, but my brain is still breaking."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5449.3,"end":5450.1,"speaker":"Fr Stephen De Young","text":"This isn't easy stuff."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5450.1,"end":5451.06,"speaker":"Audience Member","text":"I'm going to give it a rest now."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5451.3,"end":5452.58,"speaker":"Fr Stephen De Young","text":"This is not easy stuff."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5452.95,"end":5467.99,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right. Well, okay, we're going to go ahead and move on with the second half of the Lord of Spirits. What are we talking about anyway? Oh, that's right. Time. Yeah, time in the Bible. How does time manifest in the scripture in terms of God and time in the scripture?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5468.23,"end":5471.43,"speaker":"Fr Stephen De Young","text":"Well, when we left off before the exciting commercial break."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5471.67,"end":5475.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Let's do Genesis. What do you think?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5475.27,"end":5521,"speaker":"Fr Stephen De Young","text":"We were talking about the days of creation, sort of. And so, yeah, we will return there. And so we've talked about this before. Right. And part of our understanding of the relationship between God and time comes from. This comes from understanding what's going on here in Genesis, chapter one through two, verse two. Right. In terms of the days of creation. Right. Let's just bring up St. Augustine. Each half St. Augustine points out that God can't do something on a day. Right. And at first people go, what? He says that, by the way, in his literal interpretation of Genesis."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5522.84,"end":5523.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5523.64,"end":5525,"speaker":"Fr Stephen De Young","text":"That's the title of the work."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5525.24,"end":5525.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5527.24,"end":5616.24,"speaker":"Fr Stephen De Young","text":"He says, of course God can't do something on a day. Well, what does he mean by that? Because it seems like it's saying God did things on a day. Right. Well, here's what he means. Right again, God does not start each day with like a to do list. Okay? Today I'm going to separate. I'm going to create light. I'm going to separate it from darkness. That's going to take me 24 hours. Right. We look at. Okay, well, no, that's silly. That's not what it's saying. Right. That like it takes 24 hours to get God to do these things and he does them in. Right. Like we all kind of understand that's not how any of this works. Right. Then that's what St. Augustine means. Why, of course, God doesn't, like, do something on that day. And it becomes especially absurd. Of course, as we've talked about before on the show, when you get to day seven. Right, Day seven. And this is another note. See, I'm trying to be. I'm trying to be friendly with our young earth creationist friends tonight. Relatively. Guys, stop it with the seven literal 24 hour days. Because saying that the seventh day is a literal 24 hours is silly. Okay, say six. Say six. Okay, make your point with six. Because the idea that again, on the seventh day, God didn't do anything for 24 hours."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5620.22,"end":5622.98,"speaker":"Fr Andrew Stephen Damick","text":"Look, he'd had a long week, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5622.98,"end":5624.3,"speaker":"Fr Stephen De Young","text":"Like, that doesn't make sense."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5624.54,"end":5625.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5625.58,"end":5631.22,"speaker":"Fr Stephen De Young","text":"Okay, if God didn't do anything for 24 hours, like, how did things keep existing, you know? Right. Like what?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5631.22,"end":5632.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, how."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5633.26,"end":5692.46,"speaker":"Fr Stephen De Young","text":"That's. That doesn't really make. That's clearly not what's going on. Right. God was not tired. Right. And we've talked before on the show about how what's going on with the rested is more that he sat down, that he was enthroned. Right. So the seventh day is the day of his kingdom, his reign, his rule. Because we talked about that on the show before, too. Kingdom is a noun. English, like Latin, reifies everything. We think of it as a thing, but this is more of a verbal idea. God's domain, his rule. When we talk about the kingdom of God, right, That's on the seventh day, God is seated, he is enthroned. His reign, right, is there on the Sabbath day, which is the seventh day, the last day. And so much of what you read as you go through the Torah and then through the rest of the Hebrew scriptures is people wanting to enter into God's rest, to enter into his kingdom, to enter into his rule."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5693.26,"end":5693.66,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5694.3,"end":5731.81,"speaker":"Fr Stephen De Young","text":"Each of the days of creation is God's work manifesting itself as a day, six of them, right? And then on the seventh day, God's kingdom manifests itself as a day. And that is a day which setteth not, as the prophets say, the kingdom's day which setteth not. Right. That is at the end of the week. That is what everyone is striving for. And then when we get to the very beginning of the New Testament and we get into the Gospels, right? What do we find? The kingdom of God is near. The kingdom of God is at hand. It is approaching. It is here, right? That seventh day."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5732.13,"end":5736.85,"speaker":"Fr Andrew Stephen Damick","text":"That doesn't mean that, like, oh, God's going to be in charge again now."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5737.33,"end":5739.33,"speaker":"Fr Stephen De Young","text":"Yeah. Like he wasn't. Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5739.33,"end":5740.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":5740.45,"end":6036.39,"speaker":"Fr Stephen De Young","text":"No. And it didn't mean the other six days he wasn't in charge. Right, Right. Again, that's the. We know it doesn't mean that. Right? We know that this is the day that that is manifest. Right. And so the, The. The creation receives a day of rest where God's enthronement and his rule, his kingdom manifests itself. Right? And this is all the Sabbaths are pointing to this in the Old Testament. And this is why we have the Lord's day, which is not the Sabbath. The Sabbath is Saturday. The Lord's day is the first day week. It's Sunday. Going back to our Western civilization thing, Asanati English speakers have pagan days for the days of the pagan words for the days of the week. Unlike every other supposedly Christian country in the world that calls Saturday the Sabbath and Sunday the Lord's day. I mean, even Spanish, they're right next door, they got Sabado and Domingo. Like, come on, man, like, anyway, what the Lord say was now the beginning of the week, right? Because of the kingdom being established and Christ is enthroned at the Ascension. See our Ascension episode, right? But so what we see here is again part of God's relationship with time, right? And that includes a couple pieces here. The one piece being God's work, God's activity, God's energies manifesting themselves right, at days and time as days and in days and times and seasons and places, right? And then also, right, we see the cycle of the Sabbaths, right? See the cycle of the Sabbaths which are connected to this. So let's develop off of that the cycle of the Sabbaths. We've also got the cycles of the feasts that are laid out first in the Torah, then in the rest of the Hebrew scriptures, the Old Testament. And what all of these cycles, what these calendars, really, right, these calendars are, is they're an imposition of order, structure in order to shape human experience. What do I mean by that? So these things aren't like objective, right? Like a culture could say, hey, you know what? We're gonna have 30 day months and three 10 day weeks, right? Like that wouldn't, you know, rip the fabric of reality apart, right? Like that would, right? I say this is, you know, we've got folks of the Orthodox Church who are the old calendar, the new calendar. We disagree about what the date is today, right? But neither of us can sort of appeal to some objective fact, right? No, Objectively, today is August 1st, right? Like how would you argue that or prove that? Right? So these are structures imposed, right? Structures imposed on the created order. And these structures that are the Torah are intended then to order human life and human experience in such a way as to produce a particular result in order to shape humanity in a certain way. If they're followed, if these disciplines and structures are followed and lived out. And what you've actually got, we've talked about this before on the show, is in the calendars. Whether we're talking about the calendar laid out in the Torah or the church's calendar, there's two sort of layers. So there's one layer that is based around the agricultural cycle. Right. Seed time and harvest. Right. And this cycle has its own new year, Rosh Hashanah, the head of the year, the first of the year. Right. Roughly September 1, Tishri 1. Right. On the Jewish calendar, the agricultural cycle calendar begins in September, ends at the end of August. And that one is not sort of arbitrary. You can't go and plant crops in the winter and try to harvest them in the summer."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6036.95,"end":6042.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is just how the natural world works. You have to adapt to it or vice versa."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6042.71,"end":6219.28,"speaker":"Fr Stephen De Young","text":"Right. So the agricultural cycle itself does have this kind of existence within the order of the creation. Right. But by God attaching feasts to the elements of this calendar, whether it's the new year, whether it's the offering of the first fruits of the harvest, whether it's the celebration of the harvest proper coming in. Right. All of these feasts give these sort of significance vis a vis God. Right. They bring the necessary relationships of humanity in the creative order, created order, are brought up into relationship with God. So this is sort of bottom up, right? It's going from day to day life working the farm, which is what almost everyone was doing, subsistence farming, bringing that up into connection with the life of God. And then in addition to that bottom up calendar, you've got what we could describe as a top down calendar, which is the calendar centered around Pascha, around Passover. And remember, when God gives the Passover, he says this will be for you, the first of months. So there's two first months for the two different overlapping calendars. But that cycle of feasts, the Passover Pentecost, right, that cycle of feasts based around Pascha and Passover, those are not based on sort of natural cycles of nature like the harvest. Those are based on acts of God that manifested themselves in the world at particular times and places, like the exodus from Egypt, like the giving of the covenant of Mount Sinai, like the resurrection of Christ, like the coming of the Holy Spirit. Right. So that's why I say this is sort of top down. This is sort of God acting in creation. And so you have on one hand the structure of life in creation, you have on the other hand the structure of divine life there is God wants to share with humanity. When you bring those two calendars together, when you follow them and are structured by its discipline, what you have is what we call theosis, that the life of humans in the creative created world, their real life, their everyday life of trying to grow enough food to feed Their families. Right. The mundanities of human life are elevated and brought up into relationship with God. And God shares his life with humans. Right. Those two things are wedded together structurally."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6219.76,"end":6220.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6220.64,"end":6242.26,"speaker":"Fr Stephen De Young","text":"And so as that cycle is practiced again and again giving order to humans, experience of time, experience of the year, of the week, of the months. Right. Those structures humans again and again re enter into the works of God. Right. God's energies, these great acts of God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6242.42,"end":6242.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6242.78,"end":6289.62,"speaker":"Fr Stephen De Young","text":"Because the Passover is not remembering what God did when he brought the Israelites out of Egypt, it's participating in it. Yeah, right. This is the night when God brought us out of Egypt. Today is the day of resurrection. Right. Re entering into that. And so time here in terms of its structuring becomes in and of itself the means of, of theosis through worship and celebration. Now we gotta shift gears a little, right? We're going from Old Testament to New Testament in terms of things regarding time in the Bible. Now we got to pick on our Calvinist friends a little more."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6290.34,"end":6293.5,"speaker":"Fr Andrew Stephen Damick","text":"Sorry guys, it's always time and most."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6293.5,"end":6299.23,"speaker":"Fr Stephen De Young","text":"Of you are guys. I gotta say there are some Calvinist women out there. I'm not saying none, but."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6301.71,"end":6306.19,"speaker":"Fr Andrew Stephen Damick","text":"I'm trying to think of any. I mean I know they exist, but huh."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6306.43,"end":6318.43,"speaker":"Fr Stephen De Young","text":"A lot of those Calvinist men have wives. So I mean there's that female children who are being raised as the reformed faith. So there are plenty of female Calvinists out there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6320.83,"end":6324.28,"speaker":"Fr Andrew Stephen Damick","text":"But so."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6326.2,"end":6407.12,"speaker":"Fr Stephen De Young","text":"When we get to concepts of predestination as they're expressed right, by St. Paul, especially in like Romans and Ephesians, what we're talking about. So the word that's usually translated as predestination is actually pro orizo in Greek which means to put something in order in advance. It doesn't mean to declare something in advance. There's other words for that. It doesn't even mean to decrease something, to make something happen in advance. Predestined of course applies this idea of destiny than fatalism that I know most of our Calvinist friends would say that's a bad framing, that's a pagan framing of what they believe. So we'll eschew that. But again, what is this talking about? Well if you look closely at what St. Paul is talking about in Romans, for example, when St. Paul uses it, right. For the those God foreknew, he also predestined to be conformed to the likeness of his son."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6407.2,"end":6407.6,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6408.64,"end":6445.61,"speaker":"Fr Stephen De Young","text":"For example, right. We understand that this means put in order in advance, right. If we read this as for those God foreknew And we'll talk about foreknowledge here in a second. Those people, he put things in order in advance for them to be conformed to the likeness of His Son. Okay. The way our Calvinist friends would like us to read, that is God decided that those people he foreknew would be the people, as opposed to other people who were conformed to the likeness of His Son."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6446.33,"end":6449.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Rather than that, he set things up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6450.97,"end":6451.37,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6451.77,"end":6453.09,"speaker":"Fr Andrew Stephen Damick","text":"So that. Yeah, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6453.09,"end":6478.89,"speaker":"Fr Stephen De Young","text":"And to me, the more natural reading of this is. Not that. The more natural reading of this, which doesn't have any of the problems we've been talking about recently in terms of God and time. Right. Is that God set things in order in advance so that these people could be conformed to the likeness of His Son."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6480.33,"end":6483.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, it just means he provided the way of salvation."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6483.62,"end":6502.74,"speaker":"Fr Stephen De Young","text":"Right. He provided the way of salvation and the means of salvation and all of that. Right. And as St. Paul is talking to these people, right. As he says in Romans in the same epistle. Right. He says, while we were still sinners, Christ died for us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6504.34,"end":6504.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6505.62,"end":6547.86,"speaker":"Fr Stephen De Young","text":"That thing that had to happen, Christ's death and resurrection for us to find salvation. Right. Not just that, the incarnation, Christ's life, his death, his resurrection, his ascension and enthronement, all of that happened while St. Paul's audience were still sinners. Right. So while they were still sinners, God put all of this in motion. He did all of this. This was manifested in time and in human experience, from the human perspective before they heard the gospel to the people St. Paul is talking to, before those people he's talking to heard the gospel. Right. That was already set up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6548.5,"end":6548.9,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6550.9,"end":6586.43,"speaker":"Fr Stephen De Young","text":"St. Paul goes on in that verse, for the God, for he conformed to the likeness of his Son. Right. He says those he called he also. Right. He says, and now God is going to finish this work that he began. Right. God already did this before you knew anything about this. You can trust him that he is going to continue the work of your salvation. But at no point in there to St. Paul, say, you don't need to cooperate or you have no choice in the matter or any similar thing, or God is doing this to you."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6587.86,"end":6588.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6588.18,"end":6596.42,"speaker":"Fr Stephen De Young","text":"Or the only thing you contribute to your salvation is the sin that you need to be saved from. Right. He doesn't say anything remotely like that in any of these passages."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6597.54,"end":6597.94,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6600.74,"end":6652.92,"speaker":"Fr Stephen De Young","text":"So this is saying God put these things in order in advance to make salvation possible. Right? Right. In advance. What does that mean, not in advance for God? Right. In advance for you. Right. Like all this happened like 1943 years before I was born. Right. I am. It is possible for me to find salvation because God did these things1943 years, give or take, before I was born. That's what St. Paul's saying. Right. It's absolutely true and not that complicated and doesn't involve God being somehow subject to time in a weird way."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6654.36,"end":6660.36,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. The before and after is just human experience, people. That's right. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6661.24,"end":6723.12,"speaker":"Fr Stephen De Young","text":"Right. And we have to keep this in mind when we talk about prophecy because sometimes some Calvinists, not the more nuanced ones, but some of our Calvinist friends will say things like, well, if Calvinism isn't true, that prophecy is impossible because God can't know for sure that the prophecy is going to come true unless he determines everything. Right. Well, what's, you know, manifold problems with that. Right. But if, and we've already go back to our prophets episode. Most of prophecy is not predicting things that will happen in the future. Okay. But there are places where the prophets talk about things that will happen in the future from the perspective of when they said them as humans. Right. You know, Isaiah talks about the restoration of Israel. Ezekiel talks about the resurrection of Israel."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6723.2,"end":6723.6,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6723.6,"end":6728.6,"speaker":"Fr Stephen De Young","text":"Which were in the future from Ezekiel's perspective and his original hearer's perspective."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6728.6,"end":6728.96,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6729.76,"end":6755.11,"speaker":"Fr Stephen De Young","text":"So they do talk about future events, but notice what those future events are. Those future events are. God is going to do this thing at some point, which for us lies in the future. Okay. So God does not have to be behind the scenes puppet mastering everything and moving everything around in order for him to be able to do something."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6756.55,"end":6756.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6757.67,"end":6772.08,"speaker":"Fr Stephen De Young","text":"God can just act. Right. There wasn't, there weren't all these things he needed to do and puppeteer, make sure we're all right so that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6775.04,"end":6775.32,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6775.32,"end":6777.68,"speaker":"Fr Stephen De Young","text":"Logos could be incarnate as our Lord Jesus Christ."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6778.08,"end":6786.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because again that, that requires that he's bound in some way. Like God had to set things up this way in order for this and."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6786.28,"end":6790.48,"speaker":"Fr Stephen De Young","text":"This, you know, he had to do this laundry list of things in order to be able to do that one."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6790.72,"end":6809.81,"speaker":"Fr Andrew Stephen Damick","text":"Like he had to cooperate with the creation that he himself made in order. Like no, he could. I mean this is one of the things that's about, that's different about Jesus in the gospels is. And you know that like isn't it one of the. It was it the centurion who comes to him and says, and asks him to heal his servant and he just says you can just command it?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6810.29,"end":6810.85,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6811.09,"end":6819.01,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is different than the way that miraculous healings happen in the ancient world. And any, well, anyone else's religion doesn't."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6819.01,"end":6822.41,"speaker":"Fr Stephen De Young","text":"Have to employ any techne. Right. There's not like some technique."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6822.41,"end":6823.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can just command."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6824.71,"end":6907.67,"speaker":"Fr Stephen De Young","text":"So if God says, you know, because God doesn't do things at a particular time. Right. So God has, has a divine energy of love. The different divine energies, if God says one of those is going to be manifest toward Israel in the future, that's because he's going to manifest it in the future. From our perspective. Future, Right. We haven't experienced it yet, but we will. Right. Like again, it's not the way we're used to thinking about it and talking about it. Right. But it's actually the way the scriptures talk about it and it makes more sense. It doesn't require any of these weird other extra theological constructs. Right. To make it work. So then foreknowledge. Because almost as much as open theists, Arminians basically accept all of the Calvinist presuppositions and try to get to different results. This is why it's very hard for them to win debates against Calvinists. Right. I'm going to concede all of your points, but try to disagree with your conclusion because again, just saying, oh well, it's based on God's knowledge, not his will."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6910.47,"end":6910.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6910.95,"end":6923.51,"speaker":"Fr Stephen De Young","text":"God knows in advance what's going to happen. Means God is standing at a point in time. And there are other points in time which are the future for God from God's perspective or in the future."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6923.99,"end":6924.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6925.59,"end":6930.71,"speaker":"Fr Stephen De Young","text":"And he knows, you know, anytime someone's speaking from God's perspective, again, we've got a problem."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6931.14,"end":6931.38,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6932.82,"end":6945.7,"speaker":"Fr Stephen De Young","text":"But even more than that. Right. Even more than that, what does it mean to know? We've talked about the different ways of knowing in a couple of different episodes of this show."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6946.26,"end":6946.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6947.54,"end":6955.62,"speaker":"Fr Stephen De Young","text":"So ways of knowing, like techne is a way of knowing, like know how. Knowing how to do something. Because does God know how to do things?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6958.67,"end":6958.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6958.99,"end":6962.03,"speaker":"Fr Stephen De Young","text":"God doesn't have to use a technique to do things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6962.11,"end":6965.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He can just command, just command manifest."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6966.51,"end":6966.91,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6970.59,"end":6970.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6970.99,"end":6984.68,"speaker":"Fr Stephen De Young","text":"Like scientific knowledge, demonstrable knowledge. Right. Does God know things? Because he could like do the math and show you his. Because it's like demonstrably true. Is that how God knows things?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6987.56,"end":6988.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6988.44,"end":6995.24,"speaker":"Fr Stephen De Young","text":"Right. Like that doesn't make sense. Right. Does God have wisdom in the human sense? Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6995.24,"end":6997.4,"speaker":"Fr Andrew Stephen Damick","text":"Which is wisdom, knowing the best way."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":6997.4,"end":7019.65,"speaker":"Fr Stephen De Young","text":"To be clever and knowing how to navigate life? Well, no, not in that sense. Right. So when we talk about God's knowledge Including foreknowledge or God's wisdom for that matter. Right. We're saying that because it is the more correct way to speak, not meaning it literally."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7021.25,"end":7021.65,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7022.21,"end":7050.3,"speaker":"Fr Stephen De Young","text":"It is more correct to say God knows everything. By that, what we really mean is there's nothing that God doesn't know. See, there's negative statement again. Right. There's nothing God doesn't know, but he doesn't know things the way we know them. We don't mean that literally. We don't mean like, I know a finite set of things and God knows the much bigger set of all the things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7050.94,"end":7074.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, we just. We can't conceptualize. Again, we don't know what it's like to be God. We have certain kinds of language that have been used in scripture and tradition of the church that we use. But we need to recognize that all language to describe God is contingent. It's not perfect, it does not encapsulate. It just sort of points towards."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7075.22,"end":7078.02,"speaker":"Fr Stephen De Young","text":"Right. We use the best we got because it's more correct."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7078.5,"end":7079.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7079.62,"end":7099.95,"speaker":"Fr Stephen De Young","text":"It is more correct in implication to say God knows everything than to say God knows nothing. Right? Right. There is nothing that God doesn't know. Right. But we don't even know what it means to say that God knows something because he doesn't know things the way we know them."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7100.43,"end":7100.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7104.83,"end":7115.79,"speaker":"Fr Stephen De Young","text":"So, yeah, I know we're probably giving people headaches. We're going to come a little more. It's not going to get easier, but we're coming a little more down to earth by the end of this, I promise."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7118.25,"end":7128.97,"speaker":"Fr Andrew Stephen Damick","text":"We're losing people left and right. Just too much metaphysics. Too much. Just kidding. Actually, there's still a decent number of people that are listening, apparently. Hello, people who are still with us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7129.53,"end":7201.96,"speaker":"Fr Stephen De Young","text":"Well, at next week episode, we're going to get some more payoff to some of this stuff that seems difficult now. So we want to. Before we finish up the second half here, we want to talk about something that we've talked about before. This is a little bit of review, but we're talking about the way the scriptures talk about time, which is what we've been talking about in this second half. And that's the whole concept of an age. We talked about this in a previous episode. We talked about the different ages that are talked about in Scripture. Right, Aion? Which means of an age. Right. And it's important that we understand we talked about this at the time too. So partially, this is kind of review the relationship between the idea of an age and a world. Right. Because that language is used interchangeably by the Fathers and in our hymnography, at least in English translation. Right. So we talk about the life of the world to come. We talk about the life of the age to come. We don't mean two different things."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7202.28,"end":7230.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In Greek, there's two words. The word gets translated. Age usually is kosmos. Sorry, world is kosmos. And then age is aeon, usually. But, yeah, they don't mean, like, we've talked about age in the past, that it doesn't mean, like, a specific period of time necessarily. And world does not mean, like the Earth or a planet."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7230.73,"end":7236.65,"speaker":"Fr Stephen De Young","text":"We have to get that out of our head, that certain modern definition. Right. We hear world and we think like planet."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7237.13,"end":7256.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Strange new worlds and cosmos. Cosmos doesn't even really mean universe either. It means it's. The order is really kind of literally what it means. And actually, by the way, see, I don't have my jingle ready to go. This is the origin of our word cosmetics. Because the idea is it's things being put in order."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7257.96,"end":7347.05,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so we're talking about the created order, the order of the created world. When we talk about the world, the order of creation and a particular order, a particular ordering is referred to as an age. And so when we talked about the different ages, we talked about the age before the fall. We talked about the age before the Flood. Right. Where there's a particular ordering of the creation. And then, like with the flood, how that ordering was undone and then there was a new ordering of creation, a new age after the Flood. And how there's the beginning of the new covenant in the New Testament begins a new age. And then there is the age to come, the world to come, that order that will come after the final judgment, when God has set all things permanently and finally in order. And part of the reason why we get, in our English translations, the bleed over is through, as we talked about in that episode, the Latin concept of the seculum, which was adapted by St. Augustine. He keeps coming up tonight in his City of God to refer to the sort of ever changing, shifting world in which we live. Right. And so the idea is that the age to come, the world to come, the seculum to come, the seculum secularum."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7347.05,"end":7347.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7347.45,"end":7349.05,"speaker":"Fr Stephen De Young","text":"The ages of ages."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7349.05,"end":7349.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7349.29,"end":7353.13,"speaker":"Fr Stephen De Young","text":"That we talk about in the future is an age that has no end."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7353.77,"end":7365.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's why you get, you know, in the English tradition, a particular part of the English tradition, the phrase world without end, which gets used to translate secolorum. I can't remember The Latin."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7365.33,"end":7365.57,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7365.57,"end":7368.89,"speaker":"Fr Stephen De Young","text":"Which is the Latin translation of istusion."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7369.69,"end":7395.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Which, by the way, everybody, when we sing and unto the ages of ages in so many of our orthodox hymns and petitions and stuff, it doesn't mean and for a really long time, it means this. And into the life of the world to come, into the age that has no end. That is the age to come. That's what that means."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7395.78,"end":7404.98,"speaker":"Fr Stephen De Young","text":"And so when David Bentley Hart points out that aeon means of the age, he is correct."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7405.78,"end":7406.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7407.46,"end":7481.81,"speaker":"Fr Stephen De Young","text":"The problem is he wants to make that distinction partially. So he wants to say, when the Scriptures talk about the condemnation of the age, well, see, it's of the age. So that means it's just for a finite period of time. Now, the verse before, when it talks about the life of the age, he doesn't want to say that's a finite period of time. But aside from that inconsistency. Right. The fact that it says of the age. Of that age, really? Because it's a demonstrative pronoun of that age, of the age to come. Right. That says nothing about how long that age is. It doesn't say whether that age has an end or not. His translation, he's using a little bit of legerdemain to imply to you, the reader of his books, if you're so inclined, to try to make you think, oh, well, since it means of the age, that's a finite period of time. But the word age does not imply that. It's that that age has an end necessarily. You would have to predicate that, does this age have an end or not?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7482.69,"end":7484.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7484.17,"end":7492.62,"speaker":"Fr Stephen De Young","text":"Which is something you'd have to get from context and more biblical interpretation. It's not something implied by the word. Even though he's making an English implication."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7493.18,"end":7493.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7494.06,"end":7499.66,"speaker":"Fr Stephen De Young","text":"The age to come is an age that has no end. It is the kingdom's day which setteth not."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7500.62,"end":7510.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he's right that the word means that particular thing, but not right in what he's using that for."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7510.86,"end":7512.22,"speaker":"Fr Stephen De Young","text":"He's making an implication."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7512.86,"end":7513.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7513.5,"end":7518.38,"speaker":"Fr Stephen De Young","text":"That people are taking from it. Where that implication is not actually supported by the definition of the word."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7518.38,"end":7534.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. The whole point is that this age has no end. The age to come. All right. But this half of the podcast does have an end because we experience time. And we're going to go ahead and take our second and final break for this episode of the Lord of Spirits podcast. And we'll be right back."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7534.54,"end":7552.36,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to Take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7556.04,"end":7566.26,"speaker":"Fr Stephen De Young","text":"You've probably heard of St. Raphael Howawini, St. Alexander Hodovitzky, liturgical translator Isabel Hapgood, and other righteous men and women who."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7566.26,"end":7567.82,"speaker":"Fr Andrew Stephen Damick","text":"Made their mark on the early development."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7567.82,"end":7573.42,"speaker":"Announcer","text":"Of Orthodoxy in America. But what about the notorious itinerant Bulgarian monk?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7573.74,"end":7581.18,"speaker":"Fr Stephen De Young","text":"Or Father Raphael Morgan, the first black Orthodox priest in America? Or Vera Johnston, who served the Orthodox."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7581.18,"end":7590.74,"speaker":"Announcer","text":"Church without renouncing her Theosophist roots? Their stories and many others, some edifying, some appalling, all entertaining, make up the."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7590.74,"end":7593.31,"speaker":"Fr Stephen De Young","text":"Law Lost histories of the early decades."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7593.31,"end":7597.43,"speaker":"Announcer","text":"Of Orthodox Christianity in the continental United States."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7598.39,"end":7602.07,"speaker":"Fr Stephen De Young","text":"Lost the Good, the Bad and the."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7602.07,"end":7634.56,"speaker":"Announcer","text":"Strange in Early American Orthodoxy by Matthew Namie, out now@store.ancient faith.com Again, that is store.ancientfaith.com. we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7635.84,"end":7644.35,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. We got a bunch of people who have called in. We're going to take just a couple calls. All of them? Yeah. Oh, no, no."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7645.39,"end":7647.95,"speaker":"Fr Stephen De Young","text":"Everyone. No, everyone."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7650.11,"end":7651.07,"speaker":"Fr Andrew Stephen Damick","text":"Wipe them out."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7651.15,"end":7651.63,"speaker":"Fr Stephen De Young","text":"Oh."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7651.63,"end":7662.35,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, yes, we have Radu, who called us from the Great White North. And welcome to Laura Spears Podcast. Radu."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7663.63,"end":7665.63,"speaker":"Audience Member","text":"It's good to be here, Father. Thanks for having me."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7666.03,"end":7666.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7666.75,"end":7667.27,"speaker":"Fr Stephen De Young","text":"What's."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7667.27,"end":7668.03,"speaker":"Fr Andrew Stephen Damick","text":"What's on your mind?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7669.09,"end":7683.65,"speaker":"Audience Member","text":"I want to first say a good thing about young Earth creationists, too, which is that about 10 years ago, I went to Ken Ham's art experience in Kentucky, and it was one of the most entertaining $44 I ever spent in my life. I would go confirmed."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7683.65,"end":7696.21,"speaker":"Fr Andrew Stephen Damick","text":"I need to go there. Oh, man, I love Christian kitsch. So much like, I want to go there. And I also have a big ambition to see the Precious Moments Chapel, and I think it's in Carthage, Illinois, if I remember correctly."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7697.16,"end":7697.72,"speaker":"Audience Member","text":"Oh, man."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7698.52,"end":7708.04,"speaker":"Fr Stephen De Young","text":"Carthagenium Delinda Est. It's a real thing. The Precious Women's Chapel. Everybody look it up. Not making this up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7709.24,"end":7709.8,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7712.36,"end":7763.26,"speaker":"Audience Member","text":"My question is fathers, how scriptures and the fathers talk differently about the finitude of angels than the infinitude of God. And you said earlier, well, okay, God isn't anywhere. It's not in time. And the same thing can be said about a bottle of spirit, right? It's not anywhere. It's not displacing space. You've said this in previous episodes. They're not. They don't experience time like we did, don't experience a succession of moments. So how, if at all, does Scripture talk about the finitude of angels in time and space or some in some other way different than God and. Or how do we think about that so that I don't end up stumbling into talking about angels and therefore small g gods as being infinite by mistake in the same way God is."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7763.74,"end":7849.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So St. John of Damascus, who's kind of our go to for a lot of this stuff, he provides a really helpful summary in his book, the Exact Exposition of the Orthodox Faith. Or sometimes it's called on the Orthodox Faith. There's a section there on angels and demons. And what he says about this is that angels are circumscribed, in other words, that they have, you know, they're bound in some way, they're finite, he said, but only God knows exactly the form of their limitation. Right. So this is actually helpful because in a number of ways, and one of the ways is that we often talk about. And this is. This is, you know, in a lot of places in orthodox tradition, we talk about the angels as being bodiless. Right. But he makes the point essentially that they are. Compared to us they are bodiless, but compared to God they're not. Right. So compared to us they have no body, but compared to God they're fully embodied, dense as a brick by comparison. That only God is truly limitless. The point is that they're limited, but humans can't understand their limitation. Only God can understand their limitation. That's what St. John of Damascus says in his sort of summary about all this stuff. Did I leave anything out, Father?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7850.12,"end":7873.98,"speaker":"Fr Stephen De Young","text":"I mean, I'm not gonna. I'm actually St. John of Damascus, for Pete's sake. But yeah, it's that. Right. The angels are so beyond us that we sort of can't see their limits because there's so much beyond our limits. Right. Like they're not limited in the ways we are. Yeah. But God being above them, obviously as creations, knows their limitations."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7874.22,"end":7881.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, we have language to talk about this, but there's no definition. Exactly. Does that make sense, Radu?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7883.18,"end":7920.18,"speaker":"Audience Member","text":"Yeah, I mean, just as a clarifying question on that. So you said earlier. Well, God is quite clear when he says that the way he's in the temple doesn't mean that he's not somewhere else. He's not contained in temples made out of human hands. From the pagan perspective, when they would talk about Artemis of Somewhere or Zeus of somewhere. You know, localization of a God in a place. Did they. Did the pagan gods and that kind of myth and worldview make similar claims that just because Zeus is here doesn't mean Zeus is also there. And you shouldn't be haughty with Zeus because Zeus is everywhere. Or how. How does that compare?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7920.5,"end":7963.75,"speaker":"Fr Andrew Stephen Damick","text":"No, Zeus does not claim to be everywhere. Right. There. Like for instance, with the Olympians. Okay. There's a clear division of territory. You've got Zeus, who's the. The sky God, and then you've got Poseidon, who has the seas, and Hades, who has the underworld. And there's a sense in which if those gods cross those boundaries, they're. Now, these guys are all brothers. Right. If they cross the boundaries, they're really doing something bad because that's not their territory. Right. So this is one of the things that's unique about Yahweh is he truly is said to be everywhere. Yeah, Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7963.75,"end":7966.39,"speaker":"Fr Stephen De Young","text":"He's the God not just of Israel, but of all the nations."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7966.55,"end":7977.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's why, for instance, it says over and over again our God is in heaven and on earth. And even references to him being in the depths of the sea, like, these are all pokes in the eye of paganism when this is said about God."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7978.32,"end":7978.76,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7978.76,"end":7981.68,"speaker":"Fr Andrew Stephen Damick","text":"And now he's the God of all the nations, as you said. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":7981.84,"end":8026.82,"speaker":"Fr Stephen De Young","text":"Now, the pagans did believe, and the language that's used in the literature is hypostasis. We've talked about this before. Don't flip out. It's not the same thing as the Trinity listeners. But did they believe they had multiple localizations of the same God? Right, right. So they could be in multiple places, but that's not the same as being everywhere. Right. There were multiple localizations. This temple, that temple, the other temple. Right. Rey is the sun God. So Rey is the sun, but he's also this idol, and he's also kind of pharaoh, depending on what time period we're talking about in Egypt. Right. Each of those is an embodiment of the same God. Right. But there's a finite number of those embodiments."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8028.27,"end":8028.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8028.83,"end":8031.23,"speaker":"Fr Stephen De Young","text":"And he isn't where those embodiments aren't."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8032.27,"end":8060.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. I mean, a lot of pagans have the notion that you could essentially leave the territory of a God to escape him. You know, you can see this in the scriptures where there's. Where some of the pagans talk about Israel in pagan terms. They're like, oh, their God is a God of the mountains and the hills. I think that's one of the things that's said about him, like, oh, we don't go in those mountains because their God is kind of around there, you know?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8060.9,"end":8062.82,"speaker":"Fr Stephen De Young","text":"Well, and Jonah tries to run away."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8063.14,"end":8065.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Jonah treats God as though he's pagan."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8065.62,"end":8066.5,"speaker":"Fr Stephen De Young","text":"Does it go so well?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8068.58,"end":8073.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So what do you think, Radu? Does that help. Help you out there?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8074.66,"end":8077.7,"speaker":"Audience Member","text":"As much as I think I can ever understand, yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8078.82,"end":8088.33,"speaker":"Fr Andrew Stephen Damick","text":"That's pretty great, actually. So good job, Father Stephen. All right, thank you very much for calling. We're going to take one more call."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8089.05,"end":8089.69,"speaker":"Fr Stephen De Young","text":"Two more."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8090.65,"end":8098.21,"speaker":"Fr Andrew Stephen Damick","text":"All right, we'll take two more calls because Father Stephen is practically begging for me to do that. We've got Antonio look it out for."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8098.21,"end":8100.57,"speaker":"Fr Stephen De Young","text":"You, the listener caller."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8100.81,"end":8105.61,"speaker":"Fr Andrew Stephen Damick","text":"All right, so, Antonio, welcome to the Lord of Spirits podcast. What's on your mind?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8106.73,"end":8184.66,"speaker":"Audience Member","text":"How's it going? I just, first of all, I want to thank you guys for the show. It's very informative. And my question is basically concerning the Maserath, if I'm saying it right, and the ages. I think job 38, 32 speaks about bringing out a certain celestial body in its season in. It seems that from Second Temple write ins that it's. It says that the angels actually have some type of control and in the turning of. Of these. These certain celestial bodies and their. And their certain alignments with the earth. And those are the ages. So it seems like time to me. I heard an interpretation by Michael Heiser about when they were in exile, the Jewish people were in exile when they had. When Ezekiel has the vision that God is on the throne. And it's like the four cardinal points of the Babylonian zodiac, you know, that he's in control of time. So what is your view on all that? I'm not sure if you touched on this in previous episodes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8186.67,"end":8187.55,"speaker":"Fr Andrew Stephen Damick","text":"What do you think, Father?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8188.03,"end":8213.63,"speaker":"Fr Stephen De Young","text":"I know we talked about the constellations in Ezekiel's vision in a. In a previous episode. Right. And so there is, right. When you read like in Deuteronomy, the. The celestial bodies which are associated with angels mark the times and seasons. Right. But that is always related to. And you can really see this, for example, in the Book of Enoch."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8215.56,"end":8215.68,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8215.68,"end":8313.5,"speaker":"Fr Stephen De Young","text":"Is directly related to the calendar like we were talking about in the. In the last half. Right. That sort of what marks out the calendar. Right. So like when. When is Pascha, Right. Well, you determine when Pascha is every year based on the first full moon after the vernal equinox. Right. And so if you understand that the moon is under the operation, shall we say of an angelic being. Right. And the sun is to produce the equinox. Right. If that's your understanding, then those angelic beings are sort of marking time to keep that calendar on schedule, which then, as we talked about that calendar, assuming humans submit to that ordering and participate in the calendar and participate in the cycle of feasts and the worship and have their lives formed by it, then that becomes sort of a vehicle of salvation. And so the angelic beings associated with those heavenly bodies, with the constellations, the planets, the stars, the sun and the moon become sort of the intermediaries of. Of the calendar. The. The means through which God reveals the calendar and those cycles right to humans. Does that make sense?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8316.54,"end":8375.82,"speaker":"Audience Member","text":"Yeah, yeah, yeah. That. That's. That's, you know, some good information. Kind of sounds a little bit like Galatians chapter two. A little bit, yeah. When he speaks about. When he speaks about, like, all the feast days and then he kind of speaks about. He kind of speaks about angels and powers at the same time. I'm not sure if it has a relation. Yeah, I mean. I mean, something that's interesting to me is that, you know, when it comes to time, do you believe that it's like that, like the. The Maserat, The Maso was found in. In certain. Like, certain. What were they called? Um, where the Jews meet. I forget the name. Sorry about that. But, you know, they'll meet in places. They. Archaeologists, they've found, like, ancient, like, symbols of the Maserat and stuff like that. Like all 12 zodiac signs. Like, do you believe that part of God's plan of time? What, do you think that's man made or has Babylonian origin?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8377.12,"end":8386.4,"speaker":"Fr Stephen De Young","text":"What was the episode, Father Andrew? Do you remember the title where we talked about that? We talked about that the 12 tribes were associated with the 12 constellations."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8386.64,"end":8387.48,"speaker":"Fr Andrew Stephen Damick","text":"It might have been."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8387.48,"end":8389.24,"speaker":"Fr Stephen De Young","text":"We did an episode where we talked a lot about that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8389.24,"end":8394.56,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Early on we were talking astrology. I think maybe it might have been."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8397.52,"end":8398.72,"speaker":"Fr Stephen De Young","text":"Is it taught by a star?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8399.12,"end":8407.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Taught by a star to worship the son of righteousness. I think that's the one that was one of our early episodes, actually. Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8407.35,"end":8409.35,"speaker":"Audience Member","text":"Also we get it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8409.35,"end":8410.87,"speaker":"Fr Stephen De Young","text":"We do a deep dive on that there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8413.43,"end":8416.71,"speaker":"Audience Member","text":"Okay, then. So, yeah. So what was the name of it? Again, I apologize."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8416.79,"end":8423.11,"speaker":"Fr Andrew Stephen Damick","text":"Taught by a star to worship the sun of righteousness. It's one of our early episodes, I think within the first year."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8423.83,"end":8424.31,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8424.71,"end":8456.96,"speaker":"Audience Member","text":"Okay. Okay, that's. That's good then. I'm gonna check that out. And I'm just. Real brief, brief comment. I don't know. I don't want to, like, dive into it. But as far as the age, I was wondering when it says, like, the punishment of an age could refer to a time, but far as the life of the age could refer to the character of the age, meaning that that life is incorruptible. So, like, there could be a certain nuance on, like, on the context of how it could still all make sense. Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8457.6,"end":8469.79,"speaker":"Fr Stephen De Young","text":"But if those two things are paralleled in the text. Right. You understand Hebrew parallelism, And they're put one after the other, saying that one has one nuance and the other one has an opposite nuance. Doesn't make a lot of sense. That's what I was getting at."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8469.95,"end":8470.51,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8470.51,"end":8475.15,"speaker":"Audience Member","text":"Oh, okay. Okay. All right, then. Well, I appreciate it, guys. All right, thank you."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8475.31,"end":8482.99,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Antonio. Okay, we're gonna take one final call. No matter what Father Stephen says. We're not gonna take one final call."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8482.99,"end":8484.35,"speaker":"Fr Stephen De Young","text":"You can call in the future."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8485.39,"end":8494.42,"speaker":"Fr Andrew Stephen Damick","text":"That's true. I just mean another episode for this particular episode. So. Okay, we have James. James, welcome to the Lure of Spirits podcast. What's on your mind?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8495.06,"end":8496.82,"speaker":"Fr Stephen De Young","text":"Are you in possession of a giant peach?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8498.66,"end":8501.46,"speaker":"Audience Member","text":"I don't have a giant peach, but I'm working on it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8501.7,"end":8503.7,"speaker":"Fr Stephen De Young","text":"Okay. Oh, okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8505.06,"end":8506.26,"speaker":"Audience Member","text":"We're gonna figure it out."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8506.42,"end":8511.46,"speaker":"Fr Andrew Stephen Damick","text":"So peach borers are a real problem, depending in some climates. I just want to put that out there."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8512.58,"end":8514.26,"speaker":"Audience Member","text":"So not in New Hampshire."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8514.9,"end":8518.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's gotta be. Can you grow peaches in New Hampshire?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8519.32,"end":8522.44,"speaker":"Audience Member","text":"Yeah, my grandfather grew peaches in pears. They did pretty well."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8522.76,"end":8523.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh, how about that?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8523.72,"end":8526.52,"speaker":"Fr Stephen De Young","text":"You just gotta move to the country and get yourself a lot of peaches."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8528.12,"end":8528.76,"speaker":"Audience Member","text":"Good reference."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8528.76,"end":8534.68,"speaker":"Fr Andrew Stephen Damick","text":"That's what president for. Okay, so, James, what is on your mind?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8535.88,"end":8546.45,"speaker":"Audience Member","text":"So first, I just want to say that for many years, I followed both of you. Father Andrew, Father Stephen, enjoyed the blog posts and the podcasts, roads from Emmaus, etc."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8546.61,"end":8548.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. You know the deep magic."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8548.41,"end":8563.25,"speaker":"Audience Member","text":"Oh, yeah. Going way back. Going way back. And also, as a recovering Calvinist, I have to say that there are Calvinist women out there. They do exist. You just got to go really looking. You got to do a deep dive."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8566.78,"end":8569.82,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what's your question for us tonight?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8569.98,"end":8600.15,"speaker":"Audience Member","text":"Yeah, so my question was it's on topic, but it's definitely a little bit different than sort of what we've been talking about recently, which is there's a sort of colloquial saying, at least in the English speaking world, that time heals all wounds. And I was curious if there's an orthodox perspective on that. Concept of time heals all wounds and what that might be and you know what you might have to say about that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8600.79,"end":8615.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, it's really an ancient, it's an ancient sentiment actually. So as far as I can tell, the oldest instance of this is Menander. So that's, you know, quoted by St."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8615.95,"end":8617.27,"speaker":"Fr Stephen De Young","text":"Paul in 1st Corinthians."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8617.51,"end":8731.8,"speaker":"Fr Andrew Stephen Damick","text":"There you go. 3rd 4th century BC where he says something like, time is the healer of all necessary evils. And there's a Chaucer reference too in Charlie Crusade. There's a bit that's similar to that. I mean, the way that gets used right. In popular culture now is essentially this idea of just wait and you'll feel better later. Right, right. I mean, I think that's what most people mean by it. But that by itself is not a Christian idea, you know, because sometimes you just feel worse. I mean, people, people do, right? People are sometimes driven to despair or they don't, they don't repent of their, of whatever's going on, you know, or, or things don't get better. Right. So it's not like it's, it's just wait and everything will be fine. I actually one of my favorite ways of, favorite references to dealing with this is from. Oh, I'm. Is it, is it, is it J. Alfred Prufrock? I don't remember. Love Song of J. Alfred Prufrock by T.S. eliot where he says something like, time is no healer, for the patient is no longer there. Trying to remember which poem that's from. But the point that he's making there is that people change over time. And so therefore the person who's healed is not the same person in a sense as the person who was wounded. And so that it's not time that did it, it's that the person was altered. Which I think in some ways is compatible with what we're saying. Right. It's not just about passage of time, it's about the experience of the person. So I don't know, Father, you made reference to St. Paul quoting Menander. Does he quote that bit? I'm blanking now. No. Okay. I was like, wait a minute."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8731.8,"end":8733.76,"speaker":"Fr Stephen De Young","text":"No. Bad company corrupts good morals."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8734.16,"end":8735.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8738.96,"end":8750.17,"speaker":"Fr Stephen De Young","text":"But Menander was like a multi time winner of the Athenian stage contests, won the laurel like three or four years in a row."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8750.57,"end":8760.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I'm looking up that T.S. eliot poem because I want to remember. Oh, it's, oh, it's actually from the Four Quartets. I can't believe that I didn't remember that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8761.05,"end":8762.13,"speaker":"Fr Stephen De Young","text":"How dare you Sir."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8762.13,"end":8771.85,"speaker":"Fr Andrew Stephen Damick","text":"Dry Salvages. I know. Four Quartets is my favorite T.S. eliot poetry. It's. Ladies and gentlemen, it's probably the only poetry by T.S. eliot that is relatively easy to understand the first time you read it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8772.17,"end":8773.81,"speaker":"Fr Stephen De Young","text":"Yeah, I prefer the Hollow Men, personally."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8774.44,"end":8808.05,"speaker":"Fr Andrew Stephen Damick","text":"I bet you do. Anyway, yeah, James, I. I think that, like, the way it gets used now is that it's kind of, like I said, the sort of trite saying, you know, just wait and it'll be fine. I mean, yeah, sure. Like, there's a certain psychological truth to that sometimes. Sometimes, like, just chill out for a while. You'll feel better in the morning, sleep on it kind of thing. But I don't think that time by itself is a healer."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8810.21,"end":8813.41,"speaker":"Fr Stephen De Young","text":"Yeah, no, I mean, especially if a wound's infected."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8814.53,"end":8817.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Like, if I'm a sinner and I."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8817.89,"end":8819.49,"speaker":"Fr Stephen De Young","text":"Don'T change, you need to intervene."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8819.97,"end":8824.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If I'm a sinner and I don't change, how is time going to help?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8826.22,"end":8827.58,"speaker":"Audience Member","text":"You know, could make things worse."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8828.06,"end":8858.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, absolutely. Absolutely. So. But it's an interesting. I mean, it's an interesting question, and obviously various poets and theologians and playwrights and so forth have attempted to deal with it in one way or another. What is the relationship between time and woundedness, time and healing, time and evil? You know, all that stuff. So it's a good question. So thanks for calling and thanks for your support all these years."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8859.03,"end":8863.75,"speaker":"Fr Stephen De Young","text":"Lori Bartles. Oh, absolutely, Yes, I. Bartles and James."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8863.75,"end":8868.71,"speaker":"Fr Andrew Stephen Damick","text":"Tim. Nice. I hadn't thought about that ad campaign in a long time. So."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8869.51,"end":8878.31,"speaker":"Fr Stephen De Young","text":"All right, the epic showdown between, on the one hand, Bartles and James, and on the other hand, Seagrams and Bruce Willis."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8879.08,"end":8887.32,"speaker":"Fr Andrew Stephen Damick","text":"Ooh, tough car. All right, well, it's the third half of Laura Spirits podcast. We're talking about time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8887.88,"end":8889.8,"speaker":"Fr Stephen De Young","text":"One more? No. Okay, we don't have to take."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8891.48,"end":8893.72,"speaker":"Fr Andrew Stephen Damick","text":"Trudy shut it all down. She set it all down."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8894.2,"end":8896.64,"speaker":"Fr Stephen De Young","text":"Oh, wow. Did you just go home? Like, what?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8896.64,"end":8902.88,"speaker":"Fr Andrew Stephen Damick","text":"No, she didn't go home, but she. Oh, she basically turned off. She turned off the call center. Okay."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8902.88,"end":8904.28,"speaker":"Fr Stephen De Young","text":"So that's rude, anyway."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8904.59,"end":8905.47,"speaker":"Fr Andrew Stephen Damick","text":"It is, isn't it?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8905.71,"end":8909.63,"speaker":"Fr Stephen De Young","text":"Sorry, callers. I had no control."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8910.19,"end":8912.03,"speaker":"Fr Andrew Stephen Damick","text":"People are excited about this stuff."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8912.35,"end":8913.55,"speaker":"Fr Stephen De Young","text":"I was not in command."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8913.79,"end":8916.43,"speaker":"Fr Andrew Stephen Damick","text":"All right, let's say thank you to St. Augustine one more time."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8916.67,"end":8956.47,"speaker":"Fr Stephen De Young","text":"Yes. So St. Augustine, our friend, St. Augustine. Isn't it nice? All the nice things we've been saying about St. Augustine tonight, even while picking on Calvinists and Plato, somehow we're managing to be nice to St. Augustine. So this third half, what we're going to be talking about? Is we're going to talk about. So we've talked about. We're going to be picking up from the first half. We talked about how time is really what we're talking about as humans when we talk about time is the human experience of time, right? Not something that sort of exists as a thing outside of us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8956.55,"end":8956.95,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":8958.8,"end":9031.68,"speaker":"Fr Stephen De Young","text":"And if you want to talk about the human experience of time, there's only one place to go, and it is St. Augustine. Folks may not know this, but books 10 and 11 of St. Augustine's Confessions, he deals with our experience of time, human experience of time. And what he lays out there. Is it in terms of human understanding of this? When Husserl, probably the most famous modern phenomenologist, if you don't believe that, name me one that's more famous. When he talks about time consciousness, he just cribs St. Augustine like, it's. He just puts into sort of modern German philosophical terms what St. Augustine said, right? And Martin Heidegger, who, again, I will point out, favorite Nazi, like, if you got to pick one."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9033.52,"end":9034.04,"speaker":"Fr Andrew Stephen Damick","text":"You don't want."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9034.04,"end":9145.3,"speaker":"Fr Stephen De Young","text":"To pick one, but gun to your head, you have to pick a favorite Nazi. It's got to be Martin Heidegger. That. That's not controversial at all. Anyway, it's true. If you're honest with yourself, it's true for all of us. Martin Heidegger just picks up what Husserl. Husserl was kind of his mentor. So Heidegger begins existentialism, but he just. When he's talking about, you know, being in time, he starts talking about time consciousness, his whole idea of Dasein. He's drawing very much on Husserl. Husserl, which means he's just repeating St. Augustine, right. And building on St. Augustine. So St. Augustine is the guy for this, right? He's the one who first really understood this. And nobody really has been able to do much better since in the last 1600 years. So, and. And what he's doing, even though the term phenomenology wasn't around yet. Husserl was a phenomenologist, but St. Augustine is laying out the phenomenology of the human experience of time. He's describing the way we as humans experience time. And there are two main pieces to this, right? The first piece is memory. So when we talk about our experience of time, our experience of time, we could frame as we have an experience of there being a past. Yeah, we have an experience of there being a future, and we have a kind of elusive experience of there being a now. But Every time we say now, that flies back into the past. Right. Like sort of, oh, whoops, I didn't live it now. Oh, now. No, now. Now, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9145.64,"end":9146.6,"speaker":"Fr Andrew Stephen Damick","text":"I'm living in the then."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9150.76,"end":9202.35,"speaker":"Fr Stephen De Young","text":"So we're going to kind of take that apart with St. Augustine here a little bit. So the first part of that is memory. Right. So we'll start with memory and we'll start with the past. Right. Because this is probably the least elusive of the three. Right. Or at least we feel like it is. And we're talking about our experience. Right. We feel like we know the past, we don't know the future. Present gets real slippery. Right. The now gets real slippery. So memory, Right. Memory obviously moves in one direction. We don't remember the future. We only remember the past. Right. Things slip into memory. They come into our consciousness and then slip into memory as we go forward. Already the first two halves of this program are memory. Hold for me. I don't even know what I said."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9203.63,"end":9205.95,"speaker":"Fr Andrew Stephen Damick","text":"And since we know you never listened to it, you'll never know."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9205.95,"end":9232.44,"speaker":"Fr Stephen De Young","text":"I will never know what happens. So things slip into memory. Now, we tend to. We tend to think about our memory as if our sort of eyes and ears were a camera and a microphone, and our brain is sort of recording and storing our experiences as they happen."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9232.92,"end":9243.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is not. No one's actually having that experience. No, no. Like, if you think about something that happened, like, five minutes ago, you're not. You can't even, like, replay it in your brain."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9243.4,"end":9246.08,"speaker":"Fr Stephen De Young","text":"Like, it's not replaying it like a video. Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9246.08,"end":9260.21,"speaker":"Fr Andrew Stephen Damick","text":"That doesn't. It doesn't work that way. But it's funny that we talk about it that way. I think maybe it's part of it, I think, is just because that. That's how the technology works. And so we think we analogize our brains to the technology that we've created."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9260.69,"end":9262.53,"speaker":"Fr Stephen De Young","text":"Right, Right. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9262.53,"end":9266.85,"speaker":"Fr Andrew Stephen Damick","text":"Or I should say analogizing our memories. Brain is not the right thing here, but you know what I mean?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9267.09,"end":9286.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, I think before that it was pictures, Right. Like, they would add to. Oh, there. I have pictures in my head from the past. Right. When that was the technology. Right. But so the reality is what we're doing when we remember something."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9288.09,"end":9288.49,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9288.65,"end":9319.3,"speaker":"Fr Stephen De Young","text":"I'm about to say a bunch of things that all of the married people listening will instantly identify with. When we remember something, only about 10% of it is made up of actual sense memories, a mixture of images, sounds, smells, tastes, feelings. Right. About 10% of it is that the other 90% we reconstruct with our imagination."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9320.82,"end":9324.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you could say that it's just slipping into the future."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9327.94,"end":9362.96,"speaker":"Fr Stephen De Young","text":"Sigh. So we do this reconstruction, right? And if we do the same reconstruction over and over and over again. So something happens to me, I tell. I decide it's a funny story. I tell the funny story to 23 different people. You know, every three or four months, I meet somebody who hasn't heard it and I tell them the story. Right. That that story is going to get kind of cemented in my brain just from telling and retelling and retelling and retelling it. I'm essentially going to memorize the retelling, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9362.96,"end":9363.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9363.48,"end":9371.04,"speaker":"Fr Stephen De Young","text":"And that's going to reinforce to me that that thing that I retold in all its details is what actually happened, Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9371.04,"end":9376.6,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that becomes the story, you know, that becomes the. I've had the time of my life."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9379.48,"end":9384.28,"speaker":"Fr Stephen De Young","text":"I've never felt this way. Actually, I have felt this way before. Quite often when you're doing the dad jokes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9386.98,"end":9391.86,"speaker":"Fr Andrew Stephen Damick","text":"It'S been a while since I actually just had a bunch of jokes lined up to throw out at you. Just waiting for the moment to use it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9391.86,"end":9421.31,"speaker":"Fr Stephen De Young","text":"And you waited until now, right? Like, you're like, oh, no, the episode's almost over. I got to get these in sung by. Anyway, Right. And so what I meant by our married audience members, right, is that sometimes you and another person close to you will share an experience and you'll both sort of recreate your memories of it and they will conflict in certain regards."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9421.71,"end":9432.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. If you want to just, you know, scuttle your intimacy, say this magical phrase. That's not what I said."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9432.99,"end":9433.47,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9434.19,"end":9436.03,"speaker":"Fr Andrew Stephen Damick","text":"It magically works. It's amazing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9437.33,"end":9445.49,"speaker":"Fr Stephen De Young","text":"And each of you will be utterly convinced that the way you remember it is what really happened."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9445.81,"end":9449.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, you can't escape that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9450.05,"end":9455.49,"speaker":"Fr Stephen De Young","text":"And neither of you are lying, right. You know, you each insist the other one is falsifying."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9455.65,"end":9457.09,"speaker":"Fr Andrew Stephen Damick","text":"This is memory."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9457.41,"end":9486.45,"speaker":"Fr Stephen De Young","text":"You honestly have recreated it differently because you had 10% to work from. And it was a different 10%, by the way, each of you. The rest of it has been put together by imagination, but you'll be utterly convinced, right, that you did it and you were right. And that's sort of on a micro level of sort of individual memories of individual events. Right. Where we experience it that way."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9486.61,"end":9487.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9489.01,"end":9543.63,"speaker":"Fr Stephen De Young","text":"But we also, on sort of a more macro level, right, we will have sort of a big overall story that we tell ourselves that's connected to the idea of our identity. Next episode, next week, we're going to Talk more about identity. That's sort of my story overall, how I got here to where I am today. Right. And that is going to be a very selective reading, chaining together of those memories. Right. I'm not going to remember everything. And if you asked me 10 years ago to tell you my story, I would have chained together a group of memories to do that. If you ask me today, it might be a very different story. There might be memories that would have been part of my story that I thought were significant 10 years ago that now don't seem that significant to me."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9543.95,"end":9555.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And sometimes you, like, retrieve stuff from before. Like, you're like, wait a second, this actually makes all this other stuff make more sense and then that gets incorporated into it, into the story."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9555.39,"end":9562.35,"speaker":"Fr Stephen De Young","text":"Right, Right. But that, again, is this selective recreation and imagining and putting together of this story."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9562.91,"end":9563.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9563.95,"end":9577.17,"speaker":"Fr Stephen De Young","text":"Right. And again, if this is. I'm not talking about falsehood, I'm not talking about lying, I'm not talking about making anything up. Right. But this happens a level of our experience, from our perspective of remembering what we are just remembering."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9577.73,"end":9578.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9578.53,"end":9594.29,"speaker":"Fr Stephen De Young","text":"And we're not consciously choosing, like, oh, this is really important. And though, oh, that isn't. So I'm going to forget that and remember this. Right. It just is happening. Right. Naturally in our experience. So our past is kind of amorphous. It's way more amorphous. It's not a recording."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9595.17,"end":9595.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9596.13,"end":9600.77,"speaker":"Fr Stephen De Young","text":"Right. It's way more selective in terms of the story."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9601.17,"end":9604.32,"speaker":"Fr Andrew Stephen Damick","text":"You can't save time in a bottle. You just have to."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9604.96,"end":9607.6,"speaker":"Fr Stephen De Young","text":"But if you could, you'd save it up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9607.92,"end":9608.48,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9608.48,"end":9611.04,"speaker":"Fr Stephen De Young","text":"And spend it with, hopefully someone other than me. Like your wife."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9611.6,"end":9613.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I wouldn't pick you. Yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9617.6,"end":9620.8,"speaker":"Fr Stephen De Young","text":"Just get that on the table right now. That would be, like, super awkward."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9620.8,"end":9621.2,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9624,"end":9642.63,"speaker":"Fr Stephen De Young","text":"Even though at this point, anytime you go somewhere where I'm not, everybody just ask me where I am. Because people don't know this, but Father Andrew and I, normally, most of our lives, we spend riding around town on a bicycle built for two. So I understand your confusion when you see only one of us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9642.95,"end":9645.39,"speaker":"Fr Andrew Stephen Damick","text":"Your wheel is way bigger. Everyone needs to know that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9645.39,"end":9649.43,"speaker":"Fr Stephen De Young","text":"Your wheel is way bigger. Yeah. It's one of those old bikes with the giant wheel and then the little wheel."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9649.51,"end":9650.15,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9654.64,"end":9654.88,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9658.8,"end":9724.29,"speaker":"Fr Stephen De Young","text":"And we've talked about. We mentioned when we were sort of teasing this episode, the fact that another thing that affects our view of the past is our. Actually affects our view of the flow of time, that when we have new experiences and more experiences, those make more memories and so time seems to move more slowly when we have more memories based on more experiences. And it seems to move more quickly when we're having fewer experiences and generating fewer memories. Right. And we've all sort of experienced this, right? In. In the sense that, you know, when you've got a few weeks where basically you just go through your routine every day, Right. The time seems to kind of fly by because, you know, there's nothing super memorable going on on any given day. Whereas other times in your life where lots of things happen, you know, a week might seem like a long time because of all the things that are happening."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9724.53,"end":9725.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9725.69,"end":9763.58,"speaker":"Fr Stephen De Young","text":"During that period. Right. Again, as we said before, time always moves at 1 second per second. Right. But really when we're talking about time, we're talking about our experience of it. And the rate of passage of time, especially when we're talking about the past here, shifts a lot in our. In our experience based on these different variables. So that's one side. Right. If we're talking about. Again, we're talking about how St. Augustine talks about this, on the one hand we've got memory, right? Then on the other side we've got anticipation, which is directed toward the future."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9765.66,"end":9766.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9766.38,"end":9780.7,"speaker":"Fr Stephen De Young","text":"When Sad Augustine talks about this, the biggest main example he uses is music. And I'm darn near tone deaf. So that's why I'm not using his analogy. Don't read the Confessions. I remember."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9781.5,"end":9800.74,"speaker":"Fr Andrew Stephen Damick","text":"I'm not going to throw you under the bus here because I know you don't have any feelings. So I remember. I remember because, boys and girls, you may not know that Father Steve and I, once for a few weeks, we shared the same job. I was outgoing, he was incoming. Being the assistant pastor at a particular church."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9801.62,"end":9803.06,"speaker":"Fr Stephen De Young","text":"That's when we bought the bicycle."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9803.38,"end":9824.32,"speaker":"Fr Andrew Stephen Damick","text":"That's right. And I used to remember one of the questions that was submitted to be answered in the bulletin, like, right after you showed up was, you know, is it required? Is it required something like, is it included in priest training that they learn how to sing? That was submitted right after you showed up."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9824.88,"end":9834,"speaker":"Fr Stephen De Young","text":"I was like, oh, dang. See folks at home, like, it's gotten better. Why would someone be insulted by that?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9835.12,"end":9836.08,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9836.08,"end":9858.2,"speaker":"Fr Stephen De Young","text":"Like, I don't have. I mean, I have an ego, but it's not a stupid ego. Like, I know I can't sing. Right. I'm aware. Like, you're not telling me anything I don't already know. But let me reassure people, if you ever do come to visit our parish, I have worked very hard in the 15 intervening years and am now mediocre."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9858.28,"end":9859.08,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9860.04,"end":9886.89,"speaker":"Fr Stephen De Young","text":"So through applying myself, I've become at singing. Yeah. Yeah. You didn't even see the really bad days, like, when I first became a subdeacon. Right. I still remember after I'd been a sub deacon for like four or five months, doing, like, the little litanies in the liturgy. Yeah, yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9886.89,"end":9888.17,"speaker":"Fr Andrew Stephen Damick","text":"Mostly not a thing, but yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9888.17,"end":9890.01,"speaker":"Fr Stephen De Young","text":"Kind of a weird Antiochian thing. Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9890.01,"end":9892.45,"speaker":"Fr Andrew Stephen Damick","text":"For a hot minute there of that era."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9892.45,"end":9906.78,"speaker":"Fr Stephen De Young","text":"Yeah. And I was first doing the litanies. I still remember I was like three months in to doing these every liturgy. And the choir director came up to me, like, super excited at the end of liturgy was like, I was actually able to take a pitch off of you today."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9907.18,"end":9908.06,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9908.7,"end":9909.18,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9909.66,"end":9910.38,"speaker":"Fr Andrew Stephen Damick","text":"That's love."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9911.18,"end":9921.5,"speaker":"Fr Stephen De Young","text":"So that was. Right. Like, I had. I had spent a couple of years refining my craft already by the time you experienced that. So that tells you how bad it was before."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9922.13,"end":9922.45,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9923.57,"end":9942.29,"speaker":"Fr Stephen De Young","text":"And it's. And it's a hereditary thing. My grandfather was thrown out of a Dutch Reformed Church choir, asked to leave because he couldn't sing, and my father was told to just mouth it nice in the choir. So this is a proud family tradition."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9942.53,"end":9943.01,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9943.97,"end":9969.18,"speaker":"Fr Stephen De Young","text":"And we will continue with the episode. Don't worry, people. But I do have to do one more point. Part of my dad's reaction. Right. So when I was coming into the Orthodox church, my dad attended his first Orthodox liturgy. And being Dutch and blunt, he said to me, so you're half decent at preaching and you can't sing, so you go and join a church where they preach for five minutes and sing everything."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9973.98,"end":9976.02,"speaker":"Fr Andrew Stephen Damick","text":"May God rest his magnificent soul."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9976.02,"end":9980.63,"speaker":"Fr Stephen De Young","text":"And I was like, fair. A fair point."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9981.67,"end":9982.15,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9984.87,"end":9988.75,"speaker":"Fr Stephen De Young","text":"Yeah. But still, we don't usually do big."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9988.75,"end":9990.15,"speaker":"Fr Andrew Stephen Damick","text":"Digressions in the third half."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9990.47,"end":9999.75,"speaker":"Fr Stephen De Young","text":"Yes. But all this by way of this is why I'm not using the same analogy that St. Augustine does, because to be honest, I don't understand the whole musical thing."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":9999.99,"end":10000.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10002.23,"end":10018.16,"speaker":"Fr Stephen De Young","text":"That's. So we've talked about memory. The other side is antipsychotion, anticipation of the future. Like memory, anticipation also involves imagination. Right. Because what we're doing with anticipation is we're imagining possible futures."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10018.48,"end":10018.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10019.76,"end":10029.92,"speaker":"Fr Stephen De Young","text":"Right. And that could be. Anticipation is a more positive word for it. Like we're anticipating something in the future. You know, it could also be dread of what could happen in the future."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10030.44,"end":10030.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10030.76,"end":10129.96,"speaker":"Fr Stephen De Young","text":"Anxiety. Right. Existential dread. Right. The ultimately. Right. If we're going to talk about Heidegger. Right. The fact that we realize that at some point we're going to Die in the future. Right. That, that is, that is looming in front of us. But so we have this direction toward the future where we're imagining these potential futures and either looking at them with anticipation or some level of dread. Right? So we remember the past, we have these memories of the past, we have this anticipation of the future. And in between there is this sort of tension between the two. And that tension between the two is what we call now or any given moment, which is constantly moving, constantly sliding back into the past. Yeah, right. And so it's just this tension, Right. It's not a thing you can ever put your finger on because it's always sliding away. Right. This is why. So sometimes when you hear people talk about God's relationship with time, they will talk about, well, God's outside of time or God isn't subject to categories, to temporal categories. And so that means that God is in an eternal present. Right. But that doesn't really make sense if we understand what we mean by the present. Right. Because God doesn't have like memories of the past and anticipation of the future and this tension between the two. He's not living in this constant tension the way we are between."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10132.68,"end":10137.95,"speaker":"Fr Andrew Stephen Damick","text":"To talk about the present kind of requires that there be this framing of future and past."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10138.35,"end":10168.68,"speaker":"Fr Stephen De Young","text":"Right. So that doesn't really make sense. I don't want people trying to get at when they say that. But it doesn't really make sense. Right. But it's yet another attempt to try to describe God's relationship to time in terms of our human relationship with time. Right. Well, it's just like always now for him. Well, what would that mean right now? This is the part that we promised you we would return to our Lord Jesus Christ. When we were in the first half."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10168.92,"end":10180.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We have had a bunch of people in the chat on the YouTubes ask this question, like, well, wait, Jesus is human. Didn't he experience time?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10181.08,"end":10226.54,"speaker":"Fr Stephen De Young","text":"Right, Here we go. That's promise about to be fulfilled. We are coming back to this. Right. So we talked about, we raised those questions in the first half about, you know, how, how Christ then relates to time. And so this present as tension between anticipation and memory, this experience, this human experience is one to which Christ voluntarily subjected himself. What do we mean by that? We've talked about this before. Christ voluntarily took upon himself the sinless passions related to humanity."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10226.78,"end":10230.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like getting tired or hungry or thirsty. We know that."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10230.9,"end":10232.38,"speaker":"Fr Stephen De Young","text":"That are not sinful, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10232.38,"end":10242.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we know that. Not because we know what it's like to be Jesus Christ, but rather because he Said things like, I thirst, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10243.51,"end":10295.47,"speaker":"Fr Stephen De Young","text":"Or I am weary. So Christ voluntarily subjected himself to these things. So Christ in his humanity had experiences. He was acted upon because he allowed himself to be acted upon voluntarily, right? He took upon himself hunger, thirst, tiredness, weakness. Right? He took these things on himself. And one of the things he took on himself was this tension of the present, of this experience of time. And we could see this, right? We could see this because, for example, in the Garden of Gethsemane, right? We see Christ's humanity expressed, Right. And his human will expressed in the dread with which he looks at his coming death."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10298.99,"end":10299.23,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10303.55,"end":10308.03,"speaker":"Fr Stephen De Young","text":"So that shows us that this is something to which Christ voluntarily subjected himself."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10308.27,"end":10313.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I'm also thinking about the other references in the Gospels where he talks about his hour, Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10313.95,"end":10314.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10314.23,"end":10317.87,"speaker":"Fr Andrew Stephen Damick","text":"This is not. This is not my hour. My hour is now come, you know?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10318.11,"end":10318.51,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10318.83,"end":10320.35,"speaker":"Fr Andrew Stephen Damick","text":"That kind of stuff, right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10320.59,"end":10382.54,"speaker":"Fr Stephen De Young","text":"And so this is a voluntary. Just like he voluntarily was incarnate and therefore was occupying a physical space, even though that doesn't mean he wasn't everywhere else. By the way, being God, right? When Christ is incarnate, he does not give up being God in any respect, right? He adds being human. He adds human nature. He does not subtract anything from his divinity. But so he voluntarily subjects his other things. And that doesn't mean that God the Father or the Holy Spirit are subjected to those things, right? The fact that Christ submitted to this tension of the present doesn't mean that God the Father or the Holy Spirit are subject to it any more than God the Father or the Holy Spirit get hungry or thirsty or tired or sweat."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10384.86,"end":10385.26,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10387.98,"end":10392.46,"speaker":"Fr Stephen De Young","text":"Christ voluntarily submitted to those things up to and including dying."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10394.22,"end":10394.62,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10397.9,"end":10447.77,"speaker":"Fr Stephen De Young","text":"So there's the answer to that, right? So to kind of. To kind of put a finer point on this pun kind of intent, We've talked in several previous episodes about the noose. And I know those were all totally clear and easy. So this will now simplify this whole complex episode for you. But basically what we came to is the idea that our noose, our mind, right? Where we're talking about it in a spiritual sense is a sort of point of attention, right? Where we can turn our attention, the eye of our mind, to something, right? We could focus it on something, right? And the way this relates to our experience of time is that we can direct the focus of our attention to the past."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10450.01,"end":10450.41,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10451.05,"end":10454.09,"speaker":"Fr Stephen De Young","text":"And often that we could do that in bad ways."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10455.85,"end":10456.25,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10456.25,"end":10534.41,"speaker":"Fr Stephen De Young","text":"In the sense that we can think about our past in ways that bring us guilt, shame, despair, right? Even over, you know, sins that have been confessed and forgiven and repented of, right? Or losses we've suffered. We can focus our attention on the past, on things that have happened to us, and drive from that bitterness and resentment and anger, right? And let that fester. We could also, on the other hand, direct that point of attention and our focus to the future, right? To that anticipation or that dread, right? And we could get all kinds of anxiety and worry and concern about these imagined futures that present themselves to us, right? And we could have all kinds of thoughts coming into our head trying to pull us toward the past or toward the future, to worry or to be angry or to despair, right? In all these different directions. Or. Or we can direct our focus to that point of tension of this present moment, right? In the sense that by directing our attention to it, that then makes us free to act in it."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10536.42,"end":10536.66,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10539.78,"end":10583.15,"speaker":"Fr Stephen De Young","text":"And so that's an important relation, not just our experience, but how we can then reflect and focus on that experience, right? And how that can work for good or. Or bad. So next time, which is next week on Thursday, we're going to move from this. We're going to talk about identity, we're going to talk about the body, we're going to talk about bodily resurrection, and we're going to talk about the life of the world to come based on some of the things that we talked about now tonight, and hopefully understand a little, and hopefully that second half, if things are still a little murky or difficult and stuff, hopefully that second half of the package will help clarify everything and bring everything together."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":10584.11,"end":11037.47,"speaker":"Fr Andrew Stephen Damick","text":"Amen. So as I've been pondering exactly what to say at the end of this episode, there's. There's a couple things that come to mind for me. My big takeaways. One, and I said this earlier, but I want to maybe expand on it a little bit, is that it's important especially to understand that God is not bound by anything at all, including time. And I think we tend to believe that God is bound because we're bound. We don't know what it's like not to be subject to time. So we just tend to think that God is subject to time because that's our experience of it. So therefore must be, you know. And so to me, one of the important things about. One of the reasons why having this discussion is important is because it underlines that God is really, really, really is not bound by. By time, by anything at all, but in this case, by time. And if you assume he's bound by time, that creates all kinds of theological problems, not just in terms of soteriology, how we're saved, but in terms of who God himself is. Right? And we've talked about a bunch of those problems that come as a result of that. And there is actually a spiritual posture issue in the midst of this, which is humility. Humility. The reason why there is this tradition of apophatic theology in the orthodox tradition is not because it's cool to say things like, if God is love, God is not love. If God is present, he is not present. You know, like, it's not because it's cool to say those things or, you know, sounds weird and mystical and Eastern or whatever, but it's really about humility. It's about knowing that no matter what I say about God, it's not enough and it doesn't begin to cover it. Right? It doesn't mean that we can't say anything because God has revealed himself. We can say what's been revealed and we can reflect upon that revelation. That's what theology is, right? We can proclaim the things he told us to proclaim. But humility is to not take our speculations and assumptions and put them on God. Right? And part of the reason for this apophatic approach to say, it's not this, it's not this, it's not this, is exactly to exercise humility. And it's not that we should exercise humility because that's the smart thing to do as an intellectual person or whatever. It's that humility is the path of salvation. It's not possible to be saved without humility. It's required. And we're able to be humble by joining ourselves to Christ, who humbled himself, even to death, as the Scriptures tell us. So there is actually a practical reason to engage with theology in this way, not just because it's right, but because it's actually good for us. Right? And so then that kind of leads me to the second thing I wanted to focus on here at the end, which is that as we engage with time ourselves in this age, the age that we're in now, the age that Father Stephen and I and anybody listening to us is currently in, that a healthy relationship with time, is to always ask the question and live according to the answer. This question of how can I use this for repentance, right? So if I do focus my attention on something in the past, I could, as Father Steven said, focus it on things that are going to darken my noose, darken it, because I'm focusing on on evil. Maybe it's, as he said, sins that I have already confessed and repented of by return, you know, return to them. It could be resentments I have, I'm holding, I'm being unforgiving, right? Those are some possibilities. I could also have it, you know, towards the future and focusing on fear and lack of trust in God, all that sort of stuff. And certainly in the present, you know, as well, there's all kinds of dark ways to have a relationship to time. But if I look at the things that have happened in my past, the memories that I have, and I see how God is leading me to salvation, I see the gifts that God has given. Like there's a very practical thing it says in Scripture, in everything, give thanks. I mean, I have to be say, I'm really happy that it doesn't say in everything, feel thankful. Everything give thanks. Everything give thanks, right? And you know, the posture towards the future. Future is a posture of hope, of hope. There's a lot of posture of despair in our time and a fear, right? And connected with the past, of resentment. A lot of this is going on. And I think that the twin virtues of gratitude and hope, if we really embrace them and really practice them, practice them. No one's asking you to feel anything to practice them, right? That's going to be transformative. And I don't just mean this in some kind of like ethereal, theoretical way, right? Gratitude and hope. That works in your marriage, that works in your parenting, that works in your friendships, that works in your job, that works with your fellow students, that works with your fellow parishioners, that works in your relationship with your Father confessor, that works in the way that you interact with the world at large. Gratitude and hope. And if we do live in gratitude and hope, give thanks. In everything, give thanks and always be looking to the hope of salvation from Christ, then not only will we be able to walk through this world in a lighter, more peaceful, more joyful way, but we will be a light to those around us. We will be a light to those around us. Not all of our experiences are the same. Not everybody's having the same experience of the difficulties of the world, for sure. I mean, a lot of our lives are easier than others. A lot of our lives are more difficult than others. But we all have that possibility of gratitude and hope. We can do those things, right? So that's what I want us to walk away with. It's definitely what I want for me, and it's what I want for all y' all as well. Father Stephen. It's all yours."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11039.39,"end":11039.91,"speaker":"Fr Stephen De Young","text":"All y'."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11039.91,"end":11040.11,"speaker":"Audience Member","text":"All."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11040.11,"end":11041.39,"speaker":"Fr Stephen De Young","text":"You went. You went wild."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11042.19,"end":11043.47,"speaker":"Fr Andrew Stephen Damick","text":"The pervasive plural."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11043.9,"end":11068.54,"speaker":"Fr Stephen De Young","text":"Yeah. Somewhat. Somewhat relatedly, where we ended off there talking about our focus being on the past or the future, as we're all painfully aware, because most of us have things that we might consider changing. You can't. You can't change the past."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11070.47,"end":11070.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11071.91,"end":11092.07,"speaker":"Fr Stephen De Young","text":"For the most part, you can't even voluntarily change your memories of the past. And that's one of the sort of devils in getting focused on the past, is you're getting focused on a bunch of things that you can't change in the past."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11094.87,"end":11095.27,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11097.28,"end":11156.05,"speaker":"Fr Stephen De Young","text":"Like we talked about last episode, sorry, Kenneth Copeland, and sorry, Oprah, you can't just will the future you want into existence by wanting it or speaking it or whatever, envisioning it. And so when we put our focus on the future and on all those imagined futures, we end up with the worry, with the anxiety. But we can't affect the future we want in the future. We can't do anything in the future. But if we focus on that tension between the two, that present moment in which we are, that is the place where we can do things that affect the past, it won't change the past in the sense of making it not have happened anymore. Right. Like going in a time machine and hitting ourselves over the head."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11156.85,"end":11157.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11157.89,"end":11351.2,"speaker":"Fr Stephen De Young","text":"But, for example, that moment of the present is where we can repent of our sins. That moment of the present is where we can try to fix some of the things we've broken, try to heal some of the people we've hurt and some of the wounds we've inflicted on ourselves, that can happen in the present. And while we can't in the present name or declare or envision or vision board or whatever and make the future we want manifest itself, we can actually do things in the present that will help bring about the future that we want. Right. We can take actions that will make our lives and our worlds better places. Right. Part of repentance is not just oriented toward the past. It's also oriented toward the future, toward not making the same mistakes and toward doing good in place of the bad and the evil that we've done in the past. But I want to go even a step further than that in terms of the present being the place where we can act to heal the past, to repair the past, to repent of the past and to build the better future and directly connect this to our prayer, to our life of prayer. A lot of our prayer. I think if people are like me, at all is related to either the past or the future. Either we're praying about things that happened in the past sort of repentantly, right? Or we're praying about things in the future, asking God for things, asking him to protect us from things that we're worried about in the future, trying to help ourselves, trust him into going into the future. But not much of our prayer is aimed at the present. Not much of our prayer, I think, is aimed at asking God to give me the wisdom now I need to do the things now that I need to do, right? Asking God to show me the things now, the opportunities now that I need to not miss because I'm focused on my past or my imagined future, right? Asking God to connect us to the people, show us the people, lead us to the people now that we need to connect with, to lead us to the place we need to be right now, not someday, right? And not just a cycle of remorse about the past, but helping lead and guide us to do those things now, right? That we need to do, to empower us to do them, to strengthen us, to do them, to show them to us."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11353.28,"end":11353.68,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11354.48,"end":11469.7,"speaker":"Fr Stephen De Young","text":"Because if we continue to wander through our lives looking backwards or looking far off into the distance, we're going to keep running into things, sometimes the same things, over and over again. And we're going to miss a whole lot of things that were important, that were important not just in the moment that they're important, but are important in reference to the things in our past and the things in our future that we're so concerned with, right? We're so concerned about the problem that we miss the solution. So concerned about the disease. We miss the cure because our focus is wrong. Our focus is wrong. So I think it's important that our prayer life reflect the fact that we have this slippery tension of now in which to act. It's always slipping away. And we need God's help to act in it in the way that he wants us to act, to participate in what he's doing in that moment. Not what he wants to do, but needs our help to do, but what he's actually doing. To find it, to get on board with it, to participate in it, and to be transformed by it. We can't restructure our past if we want to restructure our future. We have to restructure our now. We have to get to work, and we have to do it. And so I think that's one of the most important takeaways we can have in terms of our relationship with time. Is our relationship with that ever slippery present moment."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11472.58,"end":11498.91,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's our show for tonight everyone. Thank you all for listening. If you didn't happen to get through to us live, you can still contact us. You can email us@lordofspiritsand ancientfaith.com you can send a message to our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic, basic questions about Orthodox Christianity or you need help to find a parish, head over to orthodoxintro.org and join us for our live."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11498.91,"end":11510.83,"speaker":"Fr Stephen De Young","text":"Broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Sometimes you picture me I'm walking too far ahead. You're calling to me. I can't hear what you've said."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11511.31,"end":11517.72,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, join our discussion group, leave reviews and ratings where they go, and share this show with a friend."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11518.6,"end":11529.08,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. Then you say go slow and I fall behind. The second hand unwinds."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11530.28,"end":11532.84,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night. God bless you."}
{"episode_id":"LOS - #097 - 2024-08-01 - Time, See What's Become of Me","start":11544.77,"end":11581.82,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands saved, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
