{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":0.72,"end":65.32,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":67.56,"end":140.43,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the Lord of Spirits podcast where we're going to be taking a voyage into the Underworld. I'm Fr. Andrew Stephen Damick in Emmaus, Pennsylvania. And joining me tonight is my co host, Fr. Stephen DeYoung from Lafayette, Louisiana. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-23-7-2346 and we will get to your calls in the second part of today's show. Last time on Lord of Spirits, we introduced the idea of sacred geography, including some mind bending regarding what it means to be that being is a verb. Tonight we're going to be taking a journey into the underworld. But first we're going to do a little recap to summarize and hopefully clarify some of our points about what it means to be being and exactly what human consciousness has to do with what we like to call objective reality. And what all of that has to do with Mantis shrimp. Yes, you heard me. Mantis shrimp. There are a lot of questions from last time, so help us out, Father Stephen. When we say that human consciousness produces the world, are we saying that the world is just the matrix but we're the computer?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":142.35,"end":142.75,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":143.15,"end":143.47,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":143.47,"end":146.19,"speaker":"Fr Stephen De Young","text":"Oh, okay. Okay. I feel like most of my lead."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":146.19,"end":149.15,"speaker":"Fr Andrew Stephen Damick","text":"In questions at the beginning you just say no."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":150.51,"end":166.48,"speaker":"Fr Stephen De Young","text":"So. Yeah. And as you said, if people are listening live, they can call in with any questions they have. If you're listening to us dead, you probably don't need to listen. You can just kind of look around. That's right. And see the stuff that we're going to be talking about tonight."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":166.48,"end":168.2,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Yes. Have A look around."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":168.2,"end":171.96,"speaker":"Fr Stephen De Young","text":"Tell us what it's like. Yeah. Tell us where we're wrong."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":173.72,"end":174.12,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":176.2,"end":195,"speaker":"Fr Stephen De Young","text":"Yeah, we. We talked about last time about the fact that the world that we live in. So the world for me. The world for you. Right. Is not just this sort of objective thing that's out there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":195.64,"end":196.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":196.68,"end":223.16,"speaker":"Fr Stephen De Young","text":"But the world that I live in and interact with is the product of my human consciousness and certain tools that my human consciousness uses. We talked about language, art, music, and ritual to construct that world."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":223.72,"end":224.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":224.92,"end":247.52,"speaker":"Fr Stephen De Young","text":"So some. Some folks, I think, took that to mean, like, we're all living in a hallucination or. Yeah, it's a group hallucination or. Yeah. Like if I just, you know, and I was trying to counter some of that with. I know I've referenced Heidegger a few times, this quote about the brute facticity of reality."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":247.6,"end":248,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":248,"end":253.52,"speaker":"Fr Stephen De Young","text":"You can close your eyes and wish really hard, but you're still going to hit that wall when you walk into it, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":253.52,"end":306.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right. And I. I think one, like, especially since we know we have a lot of. A lot of fans who are also fans of the work of Jonathan Pageau. Hello, Pajovians. You know, he wrote an article a number of years ago called Most of the Time the World is Flat. Now, Jonathan Pageau is not a flat Earther, but what he means by that is that your experience of life in the world is that it's flat. Like, if you actually experience the world as being curved, you know, then. Then that would be very disorienting, for one thing. And, you know, part of that, of course, is the. The experience of, you know, for instance, the sun coming up in the morning and going down in the evening. Now, from a quote unquote objective point of view, that's not what the sun does. The Earth turns. Right. But we don't experience the Earth turning. Like, I don't currently have the sensation of going however many thousands of miles per hour the Earth goes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":307.46,"end":307.82,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":307.82,"end":356.6,"speaker":"Fr Andrew Stephen Damick","text":"I feel like I'm stationary. In fact, here the sun is in the process of going down. And that is what my day consists of. And it's not an illusion. Right? It's not an illusion, but it's what my actual conscious experience of the world is. And even, like the human body has ways of, you know, you've got the. What do you call it, circadian rhythms, which, of course, you know, if you. If the last thing you do is you look at your. Your smartphone before you go to bed, then you're throwing, you know, you're throwing your circadian rhythms off. But, but you know, that's an example of part of what we're talking about. Right. And we're going to even talk a little bit more about things that we can't even detect, even with like, you know, equipment and so forth. But, but that's, that's, that's what we mean is there's a sense of, it's not just point of view, it's what you're actually able to experience, not just what you imagine."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":358.36,"end":390.19,"speaker":"Fr Stephen De Young","text":"There's an actual interplay. Right. So we talked about how a created anything has an internal order. Right. That makes it what it is. And then it's part of a web of relationships. And so when I encounter people and animals and plants and things out in the world, I'm not encountering like the totality of those beings."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":390.75,"end":391.59,"speaker":"Fr Andrew Stephen Damick","text":"No, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":391.59,"end":414.41,"speaker":"Fr Stephen De Young","text":"And I'm definitely not encountering what it is to be that being. Meaning when I see a bat. Right. Like, I'm not, I still have no clue what it's like to be a bat. But also I'm not by seeing a bat, taking in the totality even of the external. Right. Properties of a bat."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":414.65,"end":426.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can't even detect all of all of the bats energies in the world, to say nothing of what Batescence is in itself."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":426.73,"end":443.43,"speaker":"Fr Stephen De Young","text":"Certain I'm seeing certain I'm encountering certain parts of that web of relationships, specifically how that thing relates to me. Yeah, yeah, right. And, and so, and that's true of everything and everybody who I encounter."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":443.59,"end":444.95,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":445.19,"end":454.23,"speaker":"Fr Stephen De Young","text":"I, I know my wife and, and knowing her more intimately means I understand a greater part of that web of relationships, but I still don't know what it's like to be her."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":455.11,"end":456.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":456.51,"end":462.79,"speaker":"Fr Stephen De Young","text":"Like I can't enter into her subjectivity. Right, Yeah, I can't enter into her essence, as it were."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":463.19,"end":572.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so. Okay, so we've already then, you know, kind of hinted at using these words, but just to connect it to a piece of orthodox theology that if you're orthodox, you've probably at least heard of this. You know, there's what's called the essence energies distinction. And often, you know, most of the time in orthodox theology, people talk about essence and energies with relationship to God. You know, we cannot know God in himself. Right. In his essence, but we experience him in his energies. But I remember, you know, when I was in seminary, I think it was Dr. Harry Bousalis, who was a great professor at Saint T Kongs, by the way. I think he was the one who said to us one time, he Said, you know, you guys have essence and energies too. And everyone was like, whoa. You know, and you know that, I mean, think about, just think about explaining, you know, describing another person. The only things you can say about that person is the way that you experience them. You know, he does this, he acts this way, he, he seems to have this kind of personality. It's, it's, it's his, his operations, to use the Latin based term, his energies, you know, his working in the world. That is what you experience. But his inner essence is not something that's knowable to, to you. You know, only God knows the inner essences of all things better than they know themselves, actually. So, so there is, you know, you don't, you don't know them as they know themselves. And, and you certainly don't know them the way that God knows them. And I think one of, of the modern scientism, scientistic viewpoint is this illusion of objectivity, suggesting that it is. There is this possibility that we can know things as they truly are or, or more likely that we just sort of reduce, you know, just all the things that we don't actually see. We just assume that that's not even, that's not even part of what it means to be that thing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":572.59,"end":572.99,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":573.07,"end":582.44,"speaker":"Fr Andrew Stephen Damick","text":"The thing is just the material in front of us or whatever, for instance. So the essence and energy distinction is exactly what we're talking about. It's exactly what we're talking about."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":583.24,"end":627.78,"speaker":"Fr Stephen De Young","text":"Right. That's the separation between that order, that being put in order is what it means to be, as we said. And essence in Greek is just the participle for being. So that's that internal ordering, the web of relationships to everything else. That's where we encounter everyone and everything that we encounter. So we don't know what it's like to be another person. We don't know what it's like to be a bat. We don't know what it's like to be a tree. We don't know what it's like to be the earth. Right. I don't want to go too far down the panpsychist trail, but that's where this. But we don't know what it's like to be an angelic being. We don't know, you know, who's, who's in charge of one of those things."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":628.5,"end":628.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":629.94,"end":632.34,"speaker":"Fr Stephen De Young","text":"So, yeah, we don't, we don't know any of those things."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":632.5,"end":634.98,"speaker":"Fr Andrew Stephen Damick","text":"And we definitely don't know what it's like to be a mantis shrimp."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":635.7,"end":658.03,"speaker":"Fr Stephen De Young","text":"Right, Right. So we use the example of Color and last time, and I think some people got hung up on the details maybe. But coming at it from. We're going to come at it from the other side with our friend the mantis shrimp. Okay. So mantis shrimps have these amazing eyeballs."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":662.43,"end":662.83,"speaker":"Fr Andrew Stephen Damick","text":"A."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":664.75,"end":671.23,"speaker":"Fr Stephen De Young","text":"Human and most other higher mammals have three sets of photoreceptors in their retinas."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":671.39,"end":680.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. So for us, it's rgb, red, green, blue, and everything that you see is some combination of red and. Or green and. Or blue."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":680.79,"end":680.95,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":680.95,"end":689.83,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, I used to do lighting design in theater, and literally everything that we did was a combination of red, indoor green and. Or blue. Everything, Everything."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":689.83,"end":692.79,"speaker":"Fr Stephen De Young","text":"Right. And birds have four."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":693.91,"end":694.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":694.63,"end":696.23,"speaker":"Fr Stephen De Young","text":"Which helps them see in low light."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":698.95,"end":703.23,"speaker":"Fr Andrew Stephen Damick","text":"But is it. Is. Are they in infrared? Is that what they can see? Yeah, yeah, yeah, There we go."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":703.23,"end":710.89,"speaker":"Fr Stephen De Young","text":"It's like night vision goggles. Nice. And mantis shrimp have 12 to 16."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":712.57,"end":712.97,"speaker":"Fr Andrew Stephen Damick","text":"Man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":713.45,"end":722.17,"speaker":"Fr Stephen De Young","text":"So they can see. It's not just like, oh, they can see infrared and ultraviolet. They can see more colors like, beyond that that we don't have names for."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":722.57,"end":737.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's not just a matter of seeing 12 to 16 colors, because, remember, the colors we see are basically all combinations of three. So they can combine those 12 to 12 to 16."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":738.75,"end":760.96,"speaker":"Fr Stephen De Young","text":"Yeah. So, and we also. I also mentioned to you right before the show started also that we have binocular vision. So each of our eyes produces an image, and our brain puts them together. Each of their eyes, they have two eyes, but each eye produces three images. So they actually have six images that their brains put together with all of those colors."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":761.43,"end":786.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a good thing that these things are only about the size of a small kitten, because otherwise, and because, like, there would be these vicious, vicious monsters that would be incredibly power. Good at hunting. And, you know, and they are very aggressive, by the way. You don't want to keep one in your. In your. Your home aquarium unless you have, like, a bullet, bulletproof glass, because they literally can shatter the glass. And if you keep anything else in the aquarium, it will be attacked and eaten."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":786.8,"end":803.44,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So apparently, yeah. Being able to see all the psychedelic colors doesn't make you cool and peaceful. How about that? Helps you be a better jerk and hunt. But so, but the point of bringing up the mantis shrimp beyond."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":803.44,"end":803.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":803.72,"end":821.85,"speaker":"Fr Stephen De Young","text":"We're not turning this into a nature special. David Attenborough coming in and doing the narration. Is that right? So those other colors, right, let's say, you know, rough estimate, there's. There's 48 other colors."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":822.25,"end":822.65,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":822.89,"end":847.46,"speaker":"Fr Stephen De Young","text":"That a mantis shrimp can see that. I can't. Okay. If the mantis shrimp had language, it could name those. And mantis shrimps could describe them to each other. Right. And talk about those colors. I can't. Like, I could make up names. I could be like, okay, the one right above ultraviolet is ultra ultraviolet. But then if you say to me, okay, Father Stephen, describe ultra ultraviolet, I got nothing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":847.7,"end":868.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All you can see is sort of positionally where it is, which is the same as. Which is the same as our, you know, the Earth turning. We can take photos of it. You know, we can take video of it if we put a camera out in space, but we don't actually see that happening. We have to imagine it happening, but imagining is not the same thing as seeing it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":868.59,"end":893.19,"speaker":"Fr Stephen De Young","text":"Right. And so if we say there's a handful of those colors that the mantis shrimp is the only creature that can see, and then let's say we go and exterminate all the mantis shrimp because they're starting to grow and they're looking like they're going to take over. Right. So we go to exterminate all the mantis shrimp. Those wavelengths of light that produced those colors for the mantis shrimp will still exist. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":893.19,"end":893.95,"speaker":"Fr Andrew Stephen Damick","text":"Those right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":894.47,"end":901.95,"speaker":"Fr Stephen De Young","text":"Wavelengths of light and radiation will be out there in the universe, but that color will no longer exist because no."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":901.95,"end":902.87,"speaker":"Fr Andrew Stephen Damick","text":"One will see it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":902.95,"end":944.79,"speaker":"Fr Stephen De Young","text":"The color only exists because there's a conscious mind that can process that wavelength of light into that color. The color is produced by that interaction of the light that is there and the consciousness that is there. And so this is what we're talking about when we talk about the world we live in. Sometimes the word holographic is used by philosophers, but that will give people the wrong impression again. They'll think it's a holodeck simulation. This isn't simulation theory. But that. That the world we live in and function in every day is therefore produced by the interaction of our human consciousness with the world that's objectively out there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":945.51,"end":959.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. And I think it probably would be. I don't know. Correct me if this is wrong. The only one who can objectively see all things would be the Lord. Well, if that's the right way of putting it, maybe."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":960.16,"end":968.08,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So the problem is when we talk about the subject. Object distinction."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":968.24,"end":968.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":968.8,"end":970.72,"speaker":"Fr Stephen De Young","text":"We're talking about created beings."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":970.88,"end":973.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. And he's not. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":973.45,"end":975.65,"speaker":"Fr Stephen De Young","text":"Right. So, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":975.65,"end":980.73,"speaker":"Fr Andrew Stephen Damick","text":"I can only imagine that God see. You know, like, we talk about God seeing all things. Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":980.73,"end":986.81,"speaker":"Fr Stephen De Young","text":"God transcends that subject object, because God, for Example does know what it's like to be a bat, even though he hasn't been a bat."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":986.89,"end":991.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right. Strictly speaking, he knows the essences of all things."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":991.93,"end":1003.46,"speaker":"Fr Stephen De Young","text":"Yes. So, relatedly, why is all this important? Point two of our brief review is space and time don't exist."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1003.78,"end":1007.78,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Good night, everybody."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1007.94,"end":1008.42,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1010.74,"end":1012.42,"speaker":"Fr Andrew Stephen Damick","text":"This show is over before it began."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1015.54,"end":1015.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1015.9,"end":1019.54,"speaker":"Fr Andrew Stephen Damick","text":"I know. These are the episodes of Star Trek my wife hates, by the way."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1019.7,"end":1021.38,"speaker":"Fr Stephen De Young","text":"Oh, okay. Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1022.82,"end":1023.94,"speaker":"Fr Andrew Stephen Damick","text":"Little shout out to her."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1024.58,"end":1027.94,"speaker":"Fr Stephen De Young","text":"Usually. Usually the writers just do a lot of techno babble."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1028.02,"end":1028.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1028.46,"end":1034.1,"speaker":"Fr Stephen De Young","text":"Just punt inertial stabilizers and. Yeah. Heisenberg compensators and all that stuff."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1034.1,"end":1036.18,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1038.26,"end":1042.14,"speaker":"Fr Stephen De Young","text":"What does that mean? Well, right. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1042.14,"end":1045.14,"speaker":"Fr Andrew Stephen Damick","text":"That time are our experience."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1046.26,"end":1057.71,"speaker":"Fr Stephen De Young","text":"I don't want to just sit here and be like, hey, man, let's blow everybody's mind. Right, Right. Because you're not all mantis shrimp looking at weird colors out there. But space isn't made out of anything."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1058.19,"end":1061.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a thing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1062.27,"end":1062.63,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1062.63,"end":1064.27,"speaker":"Fr Andrew Stephen Damick","text":"And time. Time's not a thing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1064.35,"end":1065.31,"speaker":"Fr Stephen De Young","text":"Neither is time."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1065.71,"end":1066.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1066.51,"end":1077.23,"speaker":"Fr Stephen De Young","text":"So that's what I mean when I say they don't exist. They're not things. Right. So space and time are categories and are ways that humans, because they're finite."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1077.23,"end":1077.47,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1077.47,"end":1086.81,"speaker":"Fr Stephen De Young","text":"This is related to what we were just talking about. We don't know. Know things as they are in themselves, only how they present themselves to us. Because we're finite."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1087.13,"end":1087.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1088.01,"end":1110.93,"speaker":"Fr Stephen De Young","text":"So in the same way, because we're finite, we're limited in terms of both space and time. So this is what I was getting at last time, when I was talking about how we tend to think of the past ceases to exist and the future doesn't exist yet. And there's this ever transitory moment that exists now. Right. But could you say that time keeps."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1110.93,"end":1111.97,"speaker":"Fr Andrew Stephen Damick","text":"Slipping into the future?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1112.21,"end":1120.29,"speaker":"Fr Stephen De Young","text":"Yes. Just trying to make this as trippy as possible. So everybody have their black lights and their posters."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1120.61,"end":1121.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1123.01,"end":1128.05,"speaker":"Fr Stephen De Young","text":"So. So that's not correct."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1128.69,"end":1129.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1129.73,"end":1145.86,"speaker":"Fr Stephen De Young","text":"What we find. And this is why I've mentioned a couple, a few Times now, book 10 of St. Augustine's Confessions, his understanding of time consciousness. Right. So it's not how time works, it's how human consciousness of time works. How the human experience of time works."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1146.26,"end":1184.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which, I mean, everybody's had the experience of it feels like time flies or that something is going very slowly. And, you know, and then I actually watched a video about this just the other day. It was the voice of Steve who showed it to me. And, you know, it was this guy talking about how when something is really dull. It seems like time goes by very slowly, but when something is very engaging, it seems to go by very quickly. But then when you. When you try to remember those times later, that you remember the engaging time much more fully than you remember the dull time, because in the dull time, there was much less to remember."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1185.22,"end":1185.5,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1185.5,"end":1186.54,"speaker":"Fr Stephen De Young","text":"You did four memories."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1186.54,"end":1195.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Exactly. Exactly. And so, like, this is just one example. And you could say, oh, well, that's just perception. Like, well, that's. That's what we're talking about."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1195.98,"end":1198.22,"speaker":"Fr Stephen De Young","text":"Yes. You know, time is just perception."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1198.38,"end":1199.34,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1199.34,"end":1233.96,"speaker":"Fr Stephen De Young","text":"Time is just perception. So there's a bunch of qualifiers. And again, I don't want to just be like, hey, let's blow people's minds. But there's what's referred to as deep time. So let's say, hypothetically, I'm just going to throw this out and never pay it off. But let's just say hypothetically, that geologists are right. The Earth has been here for billions of years. Okay. While there were no created conscious beings on the planet, that saying billions of years is meaningless. There was no time because there were no conscious beings to experience time."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1234.2,"end":1235,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1235.64,"end":1240.6,"speaker":"Fr Stephen De Young","text":"Anyway, so. And I'll never pay that off because I hate talking about creation and evolution."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1242.76,"end":1247.6,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, everybody. Yeah. Believe it or not, this show actually is about the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1247.6,"end":1249.16,"speaker":"Fr Stephen De Young","text":"But as with all of our shows."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1249.32,"end":1259.96,"speaker":"Fr Andrew Stephen Damick","text":"There'S a massive setup. Yes. This is still just the recap, but. But there was lots. Yeah, there were a lot of questions about this in our Facebook group, which is very helpful."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1259.96,"end":1260.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1260.2,"end":1265.56,"speaker":"Fr Andrew Stephen Damick","text":"So we kind of unders. We can see how you guys are hearing what we're saying, and then maybe try to fill in some."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1265.56,"end":1268.78,"speaker":"Fr Stephen De Young","text":"Some spaces so that's calibrated before we take the next step."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1268.78,"end":1272.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Now, I say fill in space, but, of course, there's no such thing as."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1273.02,"end":1323.24,"speaker":"Fr Stephen De Young","text":"So if you understand time in this way, and I know you have some people who identify as philosophy nerds. So for those folks, this is the B theory of time. All points in time exist in the same sense that all points in space exist. Meaning I don't sit here and say, well, Lafayette is real and Emmaus is not real yet or used to be real, but isn't anymore. Right, Right. If I get on a plane here in Lafayette and fly to Philly to come visit you when I depart Lafayette, Lafayette doesn't cease to exist. Right, Right. And then, like, Philadelphia airport comes into being, and then it recedes, and Emmaus comes into being as I travel. Right. We would never say that about space. We understand the same is true about time."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1323.72,"end":1324.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1324.44,"end":1394.42,"speaker":"Fr Stephen De Young","text":"Okay. So this, this gets to what we were talking about in terms of ritual and one of the specific ways that ritual interacts with, again we're talking about that interaction between our human consciousness and the reality that's, that's out there. That really is out there. One of the ways that it acts upon it is that ritual will cause a particular place and a particular time to become not just sacred space and sacred time, but a particular sacred space and sacred time. So the burning of the incense in the temple made it paradise. It became paradise in that space for that time. On Holy Thursday, your local parish church, even if it's in a storefront or even if it's a cathedral, or if you go to a monastery, becomes Golgotha for a period of time. And not just Golgotha in terms of place. Golgotha in terms of time. So we say today this is happening."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1394.74,"end":1463.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is why then the actions that people, let's say, you know, for instance, you mentioned only Thursday, you know, the cross is placed in the center of the church. Church in the Byzantine practice. And you know, people come and venerate the cross. It's not that that stands for the cross of Christ. It is being the cross of Christ. And you know, think about iconography in the same way. Iconography, by the way that you interact with it, is being the encounter of the saint for you, you know, at that moment. So that's why, that's why then the father say, well, the, the veneration shown to the icon passes to the prototype. It's because it's becoming the prototype is present for you at that moment. Like not just in a symbolic, in the sense of this stands for this. You know, it's not like a dollar sign, you know, when a dollar sign stands for money, but you can't spend it. You know, it's not like that. It's, it's, it's actually as present this ritual participation. So this is why all this matters. I know, it's, it's all very mind bending stuff."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1463.4,"end":1463.8,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1464.04,"end":1465.48,"speaker":"Fr Andrew Stephen Damick","text":"You know, this is why it all matters."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1465.72,"end":1470.28,"speaker":"Fr Stephen De Young","text":"Symbol doesn't mean one thing that, that allegorically represents another."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1470.6,"end":1471,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1471,"end":1477.16,"speaker":"Fr Stephen De Young","text":"Or analogically represents another. It's when two things are brought together. Together, one thing becomes the other."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1477.64,"end":1478.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1479.48,"end":1488.15,"speaker":"Fr Stephen De Young","text":"And I'll throw out, I'll throw out one more tease. Even though I said earlier I wasn't going to do this to everybody, but tease for a future relics episode."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1488.55,"end":1489.11,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1489.11,"end":1506.87,"speaker":"Fr Stephen De Young","text":"Because time doesn't exist any Given thing that exists in the world is itself throughout its existence and is wholly present throughout its existence. This is how Relics work. So St. John Chrysostom's hand is St. John Chrysostom?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1507.43,"end":1543.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, like, I visited three years ago. I went on pilgrimage to Mount Athos, and among the probably several hundred relics that I venerated over the space of a week was the hand of St. Mary Magdalene, which not only is incorrupt and flexible, but maintains body temperature. So some relics just do this more obviously than others. Right, right. Some of them. It's very, very intense. Yeah. This is why relics work. They're not. It's not a souvenir, it's not a talisman."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1543.35,"end":1543.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1544.23,"end":1545.03,"speaker":"Fr Andrew Stephen Damick","text":"It is the person."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1545.51,"end":1568.03,"speaker":"Fr Stephen De Young","text":"And so when we're talking about God and God's eternity or God's transcendence or God's ubiquity, we're not talking about, for example, I know some people heard us and thought, oh, you're saying God is outside of time. That's sometime how it's said."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1568.03,"end":1570.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like time is this bubble and the God is outside."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1570.91,"end":1571.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1571.15,"end":1572.87,"speaker":"Fr Andrew Stephen Damick","text":"There's this bubble looking down at it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1573.59,"end":1600.46,"speaker":"Fr Stephen De Young","text":"But outside is a. Is a spatial category, so you can't be. That's like saying you existed before time. Well, before is a temporal category. And so the language that's used for this, and it's used in the Fathers, and it's. Is developed especially by Father Dumitru Staniloy, whose last name I probably mispronounce every time I say it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1600.46,"end":1603.22,"speaker":"Fr Andrew Stephen Damick","text":"But write in and tell us Romanians exactly how to pronounce it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1603.3,"end":1615.22,"speaker":"Fr Stephen De Young","text":"Yes. Well, we have a Romanian friend who may be messaging me already. But. But he talks about how God's attributes are supra, not super, but supra essential."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1616.66,"end":1617.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1617.06,"end":1639.69,"speaker":"Fr Stephen De Young","text":"Right. Meaning it's not that God is everywhere. Like, he's just really big and spread out all over the place. Right. But that. It's that. That spatial categories don't apply to God. So it's equally true to say that God is everywhere. Right. That there's not a place where he isn't. And also to say that God is nowhere."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1639.77,"end":1640.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1640.17,"end":1686.3,"speaker":"Fr Stephen De Young","text":"It's saying there's not some particular place where we as humans can localize him. Yeah, Right. This is that our finitude versus his infinitude, lack of finitude coming into. Coming into play. But so, as we said, this is how. This is how the idea of sacred time and space that we talked about last time works. A particular time and place, a particular day is made A sacred and holy day. Yeah, right. When. When. And that first time. Right. Is when that spiritual event, that eternal event, first manifested itself in human conscious experience. But then that reality is made present again and again ritually."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1686.94,"end":1722.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And that's a super important point because sometimes people say, well, you know, why do you have all these holidays? You know, isn't every day holy? Or isn't every place holy? Right. And the problem there is when. When you say everything, you know, now, on one level, that's true, right. That everything has become holy. It's all become dedicated to God. But when people say, well, isn't every day holy? It's like saying, well, isn't every day your birthday? Then that means we never have a party and then we're never actually celebrating my birthday. You know, which might be a good idea. I don't know. My birthday is always a fasting day."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1722.86,"end":1732.75,"speaker":"Fr Stephen De Young","text":"But let me suggest the alternative approach to that problem, which is you could have a party every day."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1732.99,"end":1733.63,"speaker":"Fr Andrew Stephen Damick","text":"Every day."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1733.63,"end":1739.23,"speaker":"Fr Stephen De Young","text":"Right. So we could make every place and every time holy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1739.71,"end":1740.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1740.43,"end":1743.95,"speaker":"Fr Stephen De Young","text":"We could do that. I'm not so good at it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1744.11,"end":1744.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1745.47,"end":1752.07,"speaker":"Fr Stephen De Young","text":"I'm not so good at. But we could. This is what St. Paul is getting at. When St. Paul talks about some people honor Sabbaths and new moons."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1752.07,"end":1752.31,"speaker":"Caller Pedro","text":"Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1752.31,"end":1752.91,"speaker":"Fr Stephen De Young","text":"The holidays."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1752.91,"end":1753.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1753.15,"end":1759.32,"speaker":"Fr Stephen De Young","text":"The holy days. Then some treat them like every other day. We as modern people read that like, oh, I don't have to do that stuff."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1759.64,"end":1760.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1760.08,"end":1761.6,"speaker":"Fr Stephen De Young","text":"You know, I could just be lazy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1761.6,"end":1763.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We just cut out the ritual participation."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1763.96,"end":1764.24,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1764.24,"end":1767.68,"speaker":"Fr Stephen De Young","text":"I just treat every. Every day like Monday. Right. Workday."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1767.68,"end":1775.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. Yeah. But it's the ritual participation that actually makes. Makes our experience of it happen, you know?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1775.92,"end":1783.72,"speaker":"Fr Stephen De Young","text":"Right. St. Paul is saying, no, some people celebrate these holidays. There are other people who make every day a Sabbath."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1784.12,"end":1784.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1784.76,"end":1786.6,"speaker":"Fr Stephen De Young","text":"Make every day a celebration."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1787,"end":1881.11,"speaker":"Fr Andrew Stephen Damick","text":"And that's one of the reasons why, by the way, like, I know this has been on people's minds, especially this last year, where so many of us were limited from coming to church. You know, I've heard some people say, well, you know, Pascha happened anyway, even though you weren't there. And like, on one level, that is true. It is true. But on another level, you have to recognize that when you don't get to ritually participate in it in the way that you normally would, that there is an actual poverty that has happened there. Right. So whatever you think of the particular policies of your individual church, there is an actual loss if you're not there participating. If you skip church on Sunday for whatever reason, even for A really good reason. It's still a loss. There's still something broken, fundamentally broken, because you didn't get to ritually participate in it in the fullest way. Now, certainly you can pray at home and that is a ritual participation, but it's not the same as, for instance, receiving Holy Communion. It's simply not the same. It's not the same. So, you know, this is what's behind all of that. Right. That's why it's a horrible poverty when you can't be in church or when a church is destroyed, for instance. You know, so, you know, because, because, I mean, you know, what would you say if a church is smashed? Say, well, every place is holy. What does it matter? It matters because that place is used for that ritual participation. And now that's been prevented in some way."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1881.83,"end":1882.23,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1883.12,"end":1887.44,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah, so we said all that so we can say this."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1887.44,"end":1888.32,"speaker":"Fr Stephen De Young","text":"Yeah, so that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1888.32,"end":1888.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1888.76,"end":1900,"speaker":"Fr Stephen De Young","text":"So that's therefore review. That's the catch up. Right. That's what we were talking about last time with sacred time and sacred space. So tonight we're going to be talking about the flip side of that, which is profane space."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1900,"end":1910.72,"speaker":"Fr Andrew Stephen Damick","text":"Profane. And profane is a great word. Profane's a great word. It literally, it's so profanum. It literally means that which is outside the temple. Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1910.72,"end":1916.76,"speaker":"Fr Stephen De Young","text":"Outside the camp, outside the holy. The place that we've preserved under the bubble. Right, right. Yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1917.64,"end":1921.96,"speaker":"Fr Andrew Stephen Damick","text":"That's why people have that sense that they shouldn't use profanity inside the church. It's literally contradictory."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1922.12,"end":1922.6,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1922.76,"end":1924.12,"speaker":"Fr Andrew Stephen Damick","text":"If you're gonna cuss, please go outside."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1926.68,"end":1929,"speaker":"Fr Stephen De Young","text":"What if you cuss in a foreign language? Does it count?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1929.24,"end":1929.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1929.96,"end":1938.46,"speaker":"Fr Stephen De Young","text":"And which languages count? Can I cuss? And Klingon, That's a language where every word sounds like a cuss word. Yes, that's true. That's true."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1940.78,"end":1942.14,"speaker":"Fr Andrew Stephen Damick","text":"Profane time and space."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":1942.46,"end":2043.81,"speaker":"Fr Stephen De Young","text":"Yes. And so we've got a little bit of quick review here too, just to pick up some concepts we've already talked about on the show, I think, like several times. And that's. We've talked about how when, when we sin, we're participating in the energies in the works of demons. Right. And we're bringing those works of demons into reality. Right. This is another part of that. We as human conscious beings, we bring that then into the world. And when we do that, that not only transforms us, that breaks down that internal order and shifts who we are and corrupts us, but it also, through that web of relationships we have with the rest of creation, leaves this sort of metaphysical taint, this sort of stain on. On the created world where that has happened. And so with these places where demonic rituals, where events of great evil and things have happened, there is this taint. And just as when we. When we ritually purify a place and make it sacred space, it participates in another sacred time or sacred space. When we do this with profane space, that space participates in that profane time and space, meaning it gives demons access to it. It gives. This is. This is why people experience various kinds of quote, unquote. We've already attacked this word, but supernatural phenomena around places where these sort of horrible things have happened."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2044.77,"end":2111.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. And I'll give you an example where when I was in seminary, a couple of my fellow seminarians met a guy haphazardly out in public who. One of the seminarians was wearing his cassock, and he said, hey, are you a priest? And he turned out to be. And he said, there's a problem at my house. And he invited him over and. And, you know, he talked about sort of a feeling of evil and. And, you know, things moving around and all this kind of classic haunted house kind of stuff. And, you know, come to find out, it turned out that the previous owner had actually killed himself in the backyard or something like that. So the priest did a house blessing, and then he also went out into the backyard and prayed a memorial prayer for the person who had killed himself. And there was this immediate change in the experience of the place that it, like, it literally felt lighter and airier. This is what the person who went there and did this told me, you know, and so, like, there's a. You know, that this action of suicide. Now, I'm sure that leading up to the suicide was probably a lot of darkness. It, you know, there's this taint. It became profaned as a result, and so it needed to be cleansed."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2111.68,"end":2123.77,"speaker":"Fr Stephen De Young","text":"Right, Right. And this is what's behind from. From the very beginning. And we talked about this back in our Halloween episode, the church coming and rededicating these pagan sites."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2123.93,"end":2124.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2124.57,"end":2130.81,"speaker":"Fr Stephen De Young","text":"And making them sacred, but burying the martyrs there, dedicating churches and shrines there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2130.97,"end":2147.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or like the. The Parthenon in Athens, you know, which, you know, we know of it as a temple to the goddess Athena, but actually was a Christian church dedicated to the Theotokos way longer than it was ever a pagan temple. So, you know, we still have that one in Nashville that we have to."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2147.99,"end":2159.59,"speaker":"Fr Stephen De Young","text":"Take care of, but we won't talk more about that anyway. But, yeah, so what? There isn't. So there's sacred space and there's profane space. What there isn't is neutral space."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2159.91,"end":2161.75,"speaker":"Fr Andrew Stephen Damick","text":"Yes. No such thing as neutral space."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2161.83,"end":2185.36,"speaker":"Fr Stephen De Young","text":"There is no neutral ground. There is no, you know, place that is not one or the other. Yeah. And so this is, as we talked about us going back to that Halloween episode, this is part of our. Our mission as Christians is to go out and reclaim the created order and. And make it sacred and make it holy again."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2185.68,"end":2186.48,"speaker":"Fr Andrew Stephen Damick","text":"Church at all."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2187.12,"end":2201.25,"speaker":"Fr Stephen De Young","text":"Yeah. Not just ourselves in terms of repentance, but also reclaiming the world around us, that web of relationships to everything else. So before we. Before we take our first break, can."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2201.25,"end":2204.25,"speaker":"Fr Andrew Stephen Damick","text":"We do some samples? Yeah, let's do some examples."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2206.17,"end":2228.1,"speaker":"Fr Stephen De Young","text":"Probate spaces. Name three. So the first one is probably the one that's most familiar to people familiar with the Bible and. Or theology, or especially orthodox theology in Greek. And that's the valley of Hinnom, AKA Gehenna."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2229.54,"end":2238.5,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Because Geh means valley. Right? Valley. Yeah. It's like when people say Mount Fujiyama, like that's Mount Fuji Mountain."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2238.5,"end":2243.86,"speaker":"Fr Stephen De Young","text":"Don't say, yeah, yeah, yeah. Or Chai Chi ATM machine."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2243.86,"end":2244.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2247.38,"end":2261.2,"speaker":"Fr Stephen De Young","text":"Department of Redundancy Department. So the. And. And Hinnom, by the way, was a guy, he shows up in Joshua. He was just a dude who. Just some guy who lived there who it was named after."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2261.52,"end":2263.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, what rotten luck."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2263.36,"end":2271.04,"speaker":"Fr Stephen De Young","text":"Yeah, he got his name stuck on it. Right. It's like being one of the guys who Judas baptized, you know, it's like, I don't want to be a donatist, but seriously."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2273.68,"end":2274.4,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2275.38,"end":2306.64,"speaker":"Fr Stephen De Young","text":"So Gehenna, of course, the valley, the valley outside Jerusalem is one of the most infamous places in the Old Testament because it was there that the Israelites, meaning the people of the northern kingdom in particular, and even also the southern kingdom, came and sacrificed their children to Molech by passing them through the fire."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2307.76,"end":2308.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2309.28,"end":2332.33,"speaker":"Fr Stephen De Young","text":"And God obviously condemns this. Yahweh, the God of Israel says, refers to them as his children. He says, you have offered my children to Molech. Right. They weren't theirs to do with as they pleased. But this. So this is. This is about the worst satanic ritual you can think of, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2332.33,"end":2332.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2332.61,"end":2336.33,"speaker":"Fr Stephen De Young","text":"If you want a demonic ritual, this is high up there, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2336.33,"end":2338.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Child sacrifice."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2338.41,"end":2366.46,"speaker":"Fr Stephen De Young","text":"So but it's not just that, like these horrible things happen there. So it's a bad place. Right. Because when you read there is in Second Kings, chapter 23, there's a. Just a description of them doing this. But in Jeremiah 7 and Jeremiah 19 where the prophet Jeremiah is specifically coming at the Jewish Judahites before the exile. This is one of the things that's going to finally prompt the exile so that God can purify the land from the people of Judah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2366.62,"end":2368.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Wow, man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2369.18,"end":2393.26,"speaker":"Fr Stephen De Young","text":"And so when he talks about. Jeremiah lays out what they've been doing, which of course they know, Right. And this edict against them, and then the language he uses then is that what's going to come upon them as a result is that their own bodies are going to end up in Gehenna and not buried there, but laying out in the open, being eaten by wild animals."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2393.5,"end":2393.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2393.94,"end":2395.66,"speaker":"Fr Stephen De Young","text":"Which is buried uncared for."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2395.66,"end":2404.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which is, you know, like the worst possible fate for a dead person in the ancient world."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2404.94,"end":2405.7,"speaker":"Fr Stephen De Young","text":"Right, which is."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2405.7,"end":2406.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2406.86,"end":2449.58,"speaker":"Fr Stephen De Young","text":"And if you read elsewhere in the Old Testament, not only is that of course a curse, but that's what's used to describe Sheol, the underworld. Right. That's the language. Right. So for example, in the psalm, right, Their bones are scattered by the side of hell. Right. They're not buried, they're just scattered out there to the winds. When you read in Isaiah, Jeremiah, elsewhere, it talks about this is. This is how she only ever described. So this judgment isn't saying, hey, you specific people who specifically did this, every one of you individuals is going to end up dead and unburied in this valley."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2449.98,"end":2450.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2450.38,"end":2478.37,"speaker":"Fr Stephen De Young","text":"No, at these GPS coordinates. Right. It's what. What it's saying is they have turned that place, Gehenna, into hell. They have turned that place into. Into Sheol, the underworld, the abode of evil. They've invited the demons there. That's the place it is. And so that's where they're going to end up. That's where they're going to spend eternity."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2478.61,"end":2507.62,"speaker":"Fr Andrew Stephen Damick","text":"And you know, there is actually, from the Germanic tradition, there is actually, you know, the Old English word orc, which I'm sure will be familiar to a number of our listeners, referred to a kind of demon. In Old English, referred to a kind of demon that hung around in the underworld and ate corpses. So it's literally this kind of thing. That's what an orc is to, you know, an Anglo Saxon person. And of course, that actually shows up in Beowulf and other stuff like that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2507.94,"end":2511.94,"speaker":"Fr Stephen De Young","text":"Well, and in the. In the Gospels, right. The demoniac running around in the tombs."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2511.94,"end":2517.78,"speaker":"Fr Andrew Stephen Damick","text":"In the tombs, exactly. He's basically being Orcish, the place of the dead. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2517.78,"end":2528.59,"speaker":"Fr Stephen De Young","text":"So that's what's going on. This place has. Be. Has been made that right. By what They've done there. So another example. I don't think we've talked."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2529.55,"end":2532.43,"speaker":"Fr Andrew Stephen Damick","text":"I don't think we've talked about this on this show. No, no, no."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2533.23,"end":2534.19,"speaker":"Fr Stephen De Young","text":"Cinematic universe."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2534.27,"end":2550.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you're a reader of Father Steven's blog, the whole Council of God blog, there's. There's a piece he wrote called Tabor and Herman that covers what we're about to talk about. Yeah. This shows this gateway to the underworld. It's a particular mountain, Mount Herman, which."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2550.63,"end":2556.43,"speaker":"Fr Stephen De Young","text":"You can go visit. I don't recommend it because it's right by the Golan Heights. It's not a safe area to visit, especially right now."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2556.43,"end":2563.11,"speaker":"Fr Andrew Stephen Damick","text":"But although I gather there's a ski resort there or something. There is. No, there is. I looked this up, actually."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2563.35,"end":2563.91,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2563.91,"end":2564.47,"speaker":"Fr Andrew Stephen Damick","text":"It's weird."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2564.55,"end":2573.59,"speaker":"Fr Stephen De Young","text":"There's. So this. This mountain is there, and if you. If you do go there, there are still all these ancient pagan shrines from all these different periods all over the mountain."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2574.17,"end":2576.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's something about that mountain, back."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2576.65,"end":2619.07,"speaker":"Fr Stephen De Young","text":"To the old Canaanites, all the way up to. And the name comes from harem, which means banned or forbidden, which is the same word as haram in Arabic. Right. So it's like the forbidden mountain, the cursed mountain. This is where Azazel gets the other angels together to hatch their scheme in the Book of Enoch is on top of this mountain. And at the base of this mountain, there's an ancient spring that was considered a gateway to the underworld and featured a pagan shrine from the Canaanite period all the way through to the Roman period, where it became a shrine to Pan."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2619.71,"end":2621.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, good old Pan."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2622.51,"end":2629.05,"speaker":"Fr Stephen De Young","text":"And that area is still referred to as Banius, which P got turned into B. It was Paneas, but now it's Banius."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2629.13,"end":2633.29,"speaker":"Fr Andrew Stephen Damick","text":"That's because Arabic speakers can't say P. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2633.77,"end":2655.98,"speaker":"Fr Stephen De Young","text":"There's a tendency to pronounce a P as what we. As a B. And so there's this gate to the underworld, and the place where this comes into effect is this is near where Caesarea Philippi was. And so that famous moment in the Gospels when St. Peter makes his confession and to who Christ is."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2656.38,"end":2656.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2657.26,"end":2667.02,"speaker":"Fr Stephen De Young","text":"And he refers to the gates of hell, not prevailing against the church. He was standing a few yards from this particular gate to Hell."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2667.02,"end":2668.22,"speaker":"Fr Andrew Stephen Damick","text":"Gateway to the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2668.3,"end":2670.86,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, there was one nearby."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2671.18,"end":2673.42,"speaker":"Fr Andrew Stephen Damick","text":"I feel like this is a major Paul Harvey moment."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2673.5,"end":2673.9,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2674.3,"end":2678.46,"speaker":"Fr Andrew Stephen Damick","text":"And now you know the rest of the story. Good day."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2678.46,"end":2682.26,"speaker":"Fr Stephen De Young","text":"Good day. Yeah, so that's for my dad, who."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2682.26,"end":2683.66,"speaker":"Fr Andrew Stephen Damick","text":"Was a big Paul Harvey fan."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2685.31,"end":2690.83,"speaker":"Fr Stephen De Young","text":"So. And this place actually Was the Byzantines came and built a church there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2690.91,"end":2691.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2692.35,"end":2712.27,"speaker":"Fr Stephen De Young","text":"The Roman Christians came and built a church there and rededicated it in order to, again, make it sacred space instead of profane space. And then the third example, just because people get excited when we talk about giants, I think they get ecstatic when we talk about werewolves."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2712.66,"end":2718.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. But this is not the werewolf episode, everybody. Sorry."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2718.58,"end":2728.42,"speaker":"Fr Stephen De Young","text":"No more tantalization on its way. The. There is a mountain in Greece, Mount Lycaon."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2730.42,"end":2732.9,"speaker":"Fr Andrew Stephen Damick","text":"Which basically means wolf mountain."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2733.14,"end":2737.26,"speaker":"Fr Stephen De Young","text":"Yes, wolf mountain. But it's actually named after a person, a guy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2737.26,"end":2738.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2738.1,"end":2791.12,"speaker":"Fr Stephen De Young","text":"Named Lycaon. And on top of that mountain is the oldest known Greek altar. And here's how old it is. It's so old. How old is it? Yeah, it's so old that it was referred to in Greek as the bemos. Bemos is not a Greek word. It's not even an Indo European word. It's the Akkadian word bima for altar. That was brought over into Greek. We talked before about Katharia being brought over from Qatar in Akkadian. It's a general truth that the very earliest layer of all religious vocabulary in Greek is actually Akkadian. It actually comes from Semitic."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2791.52,"end":2799.59,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. So you're saying you can't give me a word? Any word. And I show you how that worked. No, sorry, guys."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2799.59,"end":2803.67,"speaker":"Fr Stephen De Young","text":"This is a Greek word. Yeah, yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2803.67,"end":2807.95,"speaker":"Fr Andrew Stephen Damick","text":"And so. And then on that altar, they're doing human sacrifice."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2807.95,"end":2813.87,"speaker":"Fr Stephen De Young","text":"They did human sacrifices. And you could read the Greeks about this because they considered it a dark and evil place. Because of this."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2814.11,"end":2816.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. Greek pagans that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2816.23,"end":2822.68,"speaker":"Fr Stephen De Young","text":"This. This fella, like Kaon, performed human sacrifice. A human sacrifice there and engaged in."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2822.68,"end":2825.04,"speaker":"Fr Andrew Stephen Damick","text":"Cannibalism because sacrifices are meals."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2825.2,"end":2835.84,"speaker":"Fr Stephen De Young","text":"Yeah. Which often goes with it. And so was cursed and became this sort of wolf and creature, I. E. He's sort of the first werewolf in."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2835.84,"end":2836.24,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2838,"end":2862.66,"speaker":"Fr Stephen De Young","text":"Greek thought. So he becomes this sort of wolf, like, rapacious, cannibalistic creature, possessed creature from having participated in this ritual. So even, like I said, the pagan Greeks considered this. This place of sort of darkness and evil that you didn't want to go around, but it's been since been rededicated. There's a shrine to Saint Elias there now because Prophet Elijah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2862.9,"end":2868.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because if you're gonna fight demons up on top of a mountain, St. Elias is your man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2868.34,"end":2869.78,"speaker":"Fr Stephen De Young","text":"Yeah. He has experience."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2870.42,"end":2872.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. He knows what he's doing in this."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2872.82,"end":2878.62,"speaker":"Fr Stephen De Young","text":"So even that space of pagan has been sort of reconsecrated and taken over."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2879.26,"end":2895.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, we're going to go ahead and go to break in just a second here. When we come back, we're going to actually start taking some of your calls. But in the second half of Lord of the Spirits we're going to be talking about why is the underworld, the underworld and what is it under? So let's go to break."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2896.14,"end":2912.42,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord. Spirits, give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2916.82,"end":2966.19,"speaker":"Announcer","text":"This is an Ancient Faith Radio public service announcement. Orthodox Christian Fellowship OCF is seeking qualified candidates to apply for two full time positions as part of their national ministry team, a communications manager and a ministry coordinator. Candidates should be Orthodox Christians in good standing with their parish jurisdiction who are interested in furthering the mission of OCF to provide opportunities for college students to encounter Christ. Full job descriptions and applications can be found at www.ocf.netjoin-our team. Inquiries about these positions or recommendations can be directed to Executive Director Deacon Merrick Simon and C f dot net. This has been a public service announcement of Ancient Faith Radio."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2966.91,"end":2983.07,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":2986.36,"end":3001.88,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for that. Voice of Steve. All right, we're going to be talking about why is the underworld the underworld and what exactly is it under. But first we're going to take one of your calls. So I believe Brett is calling and he has a question about astral projection. Brett, are you there?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3003.56,"end":3004.84,"speaker":"Fr Stephen De Young","text":"This, this guy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3008.12,"end":3010.04,"speaker":"Fr Andrew Stephen Damick","text":"You're local to Father Stephen, aren't you?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3013.02,"end":3018.06,"speaker":"Caller Pedro","text":"I don't know if I can make that claim or not. I don't know who will take me, but I do know Father Stephen."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3020.86,"end":3022.94,"speaker":"Fr Andrew Stephen Damick","text":"So what's your question there, Brett?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3023.98,"end":3048.67,"speaker":"Caller Pedro","text":"My question is, since we've been talking about time and place, how does this relate to the concept of astral projection that we know from either popular media or interactions with paganism, neopaganism, specifically what the demonic influence of that and how all relates in together with how we experience time and place? Is it a thing basically as well."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3049.79,"end":3055.07,"speaker":"Fr Andrew Stephen Damick","text":"Is it a thing? Like is that, is it a thing? Is it a thing? Or like, is astral projection a thing?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3057.47,"end":3064.19,"speaker":"Caller Pedro","text":"I know it's a concept, but is it beyond a concept? Is it something that can actually be Experienced."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3064.76,"end":3082.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, so before Father Stephen gives the will, actually. I mean certainly we, we can see like there, there are visions for instance, that, that some of the saints have had where they experience being in some other place where than they really are. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3082.2,"end":3082.4,"speaker":"Caller Pedro","text":"That."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3082.4,"end":3093.97,"speaker":"Fr Andrew Stephen Damick","text":"That God gives them that experience. I don't know if it's something that happens in other contexts for sure or not. So Father, I don't know. What do you say? Yeah, I mean, I'm thinking Dr. Strange right now."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3093.97,"end":3094.29,"speaker":"Fr Stephen De Young","text":"Like."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3094.29,"end":3095.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3095.65,"end":3118.67,"speaker":"Fr Stephen De Young","text":"As. As long as we're talking about in terms of astral projection and not remote viewing. Right. Then we're okay. If you want to know about remote viewing, go watch Men who Stare at Goats. It's hysterical. Major F Daves. I haven't seen that yet, but I keep heroic character. Yeah. So now we definitely are coast to coast afr now that I like for sure."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3120.67,"end":3121.07,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3121.15,"end":3174.32,"speaker":"Fr Stephen De Young","text":"So what's usually termed astral projection. Right. So the, the. The way it's talked about a lot now is, is. And in terms of New Age spirituality and, and neopaganism and that kind of thing is that it's a technique by which one is able to usually go somewhere else in the world. That's why the connection to remote viewing. Right. To be present, to have your consciousness be present at another place and. Or time than where your body is currently present. But the astral. And astral projection comes from. Originally it had a lot more to do with like what you were just talking about, Father Andrew. The idea of like apocalyptic visions and that kind of thing and ecstatic experience. Because of course, astral refers to the stars."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3174.32,"end":3175.16,"speaker":"Fr Andrew Stephen Damick","text":"Stars, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3175.69,"end":3252.93,"speaker":"Fr Stephen De Young","text":"Right. So it was, it was referring to this kind of transcending of time and space in the sense of having that kind of mystical vision. So we have to say that does happen. Right. That happened to St. John. Right. The Book of Revelation. That happens to the prophet Ezekiel, the prophet Isaiah, I mean. Right, right. So it's not just. Basically, this is an example of what we've been talking about ritually going the other way. Right. So we've been talking about ritual in terms of I. Through ritual we make the. The time and space where we are to be a particular time and space. Whereas the ecstatic experience is an experience of me departing from the time and space where I am and being in that other space. Right. So rather than our ritual, experience and worship bringing paradise here, I leave here and go to paradise. Right. And I'm taken to paradise. Right. In this sort of visionary. Visionary experience. So that happens. But it is not something that happens when it's happening legitimately by virtue of practicing certain techniques."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3253.25,"end":3255.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right. Sorcery."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3255.81,"end":3295.48,"speaker":"Fr Stephen De Young","text":"Right. And so inevitably, we're going to do an episode on the noose, and in that episode we'll probably talk about this and we'll talk about Kundalini Yoga and all that crazy stuff that people want to hear about and the Kundalini serpent and all this, you know, pineal gland stuff. But for now, this is something that happens sort of. That is granted to certain individuals by. By the grace of God in his timing in order to communicate certain things. It's sort of God taking the initiative to bring certain realities into the realm of human conscious experience."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3295.96,"end":3296.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3297.08,"end":3304.44,"speaker":"Fr Stephen De Young","text":"Rather than humans taking the initiative to enter into the place where God is, which is what we're normally doing in worship."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3304.84,"end":3307,"speaker":"Fr Andrew Stephen Damick","text":"Right. So does that make sense, Brett?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3307.96,"end":3310.28,"speaker":"Caller Pedro","text":"It does. It makes perfect sense. Thank you so much, Fathers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3310.44,"end":3314.12,"speaker":"Fr Stephen De Young","text":"You can ask. You could ask up to three follow up questions at coffee hour."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3316.6,"end":3327.38,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you for calling, Brett. Okay, so we're going to take another call. Right now we have Mat, who I think is calling from. From Germany or I'm not sure where exactly he's calling. Matthew, are you there?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3328.5,"end":3329.7,"speaker":"Caller Pedro","text":"Yes, yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3330.34,"end":3331.86,"speaker":"Fr Andrew Stephen Damick","text":"Where are you calling from, Matthew?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3332.42,"end":3335.7,"speaker":"Caller Pedro","text":"Yeah, yes, Freiburg in Germany."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3335.78,"end":3339.14,"speaker":"Fr Andrew Stephen Damick","text":"You are calling from Germany. All right. It has got to be late at night over there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3340.66,"end":3344.26,"speaker":"Caller Pedro","text":"Well, you know, gotta listen to the Lord of Spirits podcast."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3344.26,"end":3345.38,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's what I think."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3346.9,"end":3347.84,"speaker":"Fr Stephen De Young","text":"Guten Nacht."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3347.99,"end":3348.31,"speaker":"Caller Pedro","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3349.67,"end":3355.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. So Matthew, what is your question from over there in the Germanic lands?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3356.07,"end":3415.33,"speaker":"Caller Pedro","text":"Yes, So I know that you said before the main distinction between veneration and worship in an ancient understanding was that worship consists primarily of two things, sacrifice and offering incense, which is why you also said poison. Protestants really mostly participate in veneration and why only God receives the sacrifice and the incense. So this raised for me two questions. Is it not offering incense to the saints when the thurible is swung before the icons of Mary and the other saints? And second, if worship is primarily these two things, then why was it such a big deal for the three youths to bow to the statue of Nebuchadnezzar or Mordecai to Haman or the Jews before the bronze serpent, for example? Yeah, that would be veneration and not worship per se."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3415.97,"end":3503.73,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's a good question. So, you know, to the question of sensing icons, for instance, when you sense an icon, you. You're not worshiping the icon, right? You're not offering a sacrifice to the icon. Instead, what incense is being used for is for this purification function. Right. So incense is not a sacrifice that's used in the same way as the sacrifices that are eaten, like the Holy Eucharist. Of course, it's used in a different way to purify. Right. So in our episodes on sacrifice, especially the one we did on the Day of Atonement, we talked about purification a lot. So you can go back and listen to that, you know. Excuse me. So as to your other question about why was it not okay for the three holy children to bow before the idol that Nebuchadnezzar set up. Well, you don't want to venerate the image of a demon. That's just a bad idea. You don't venerate demons. You don't worship them either. Right. So, for instance, remember in the Ten Commandments, where the Lord said not to bow down to them nor to serve them? That's actually two different actions. Don't bow in front of them and don't offer sacrifices to them. So neither one is okay. Right. So, you know, bowing in front of something is an act of veneration, and it becomes worship then when it becomes bound up in this question of sacrifice. So I don't know. Father Stephen, did you have anything you wanted to add or correct or whatever?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3504.29,"end":3616.4,"speaker":"Fr Stephen De Young","text":"Yeah, I'll add. Yeah. In terms of the purification with the incense, one of the reasons why we have these sensings where we go around the whole church is that it's. It's part of the. The ritual we're just talking about and making it sacred space. The space has to be purified in order to be made holy. And so the. The incense in the sensor, the smoke from the incense in the sensor is performing the function of the blood of a sacrifice. Right. So the incense was offered on the altar of incense, and then incense and coals from that altar were taken and put into a censor and then taken out and used for this purification in the same way that the blood was drained from a sacrifice that was being offered and then the blood was used to purify. Right. The. The tabernacle of the temple, the physical space to rededicate it and. And to cleanse it. So that's what's going on with the smoke. I would also point out that that while obviously eating food offered to an idol is participating in the sacrifice. Right. And we see that in the Book of Daniel too, where they basically become vegetarians. They won't eat the king's food because it was all offered to idols. But there are other ways of Participating in worship. Right. So I've got a bunch of catechumens right now. They can't receive the Eucharist yet in our church. Right. Until Holy Saturday when they received into the church. So they're still coming to liturgy. They're still coming to. Like last night we had a pre sanctified liturgy. Right. They come. They're not. Not participating in the worship. Right. They're not there as spectators. Right. To the worship that's happening. Right. They're participating. But how are they participating? Well, one of the ways they're participating is during Lent is they're making prostrations. Right? They're making prostrations. They're singing along with the prayers. They're praying along with the prayers. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3616.56,"end":3618,"speaker":"Fr Andrew Stephen Damick","text":"The context is super important."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3618.4,"end":3624.72,"speaker":"Fr Stephen De Young","text":"Right. So even if you're not doing the action. Right. Only the priest is actually doing the action of offering this sacrifice."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3625.52,"end":3625.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3625.84,"end":3661.38,"speaker":"Fr Stephen De Young","text":"In one of these pagan situations. Right. And then there are various ways that the people can participate in that. They might march in the procession with the sacrificial animal. They might eat the meat afterwards. They might go and offer prayers to the God while the sacrifice is going on. While that individual act that they're committing. Right. The bowing or the praying or the processing may not be worship in and of itself by that action, they're participating in the worship, the sacrificial worship that is going on. Right. In proximity. Does that make sense?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3662.82,"end":3663.22,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3665.14,"end":3675.78,"speaker":"Fr Andrew Stephen Damick","text":"All righty. Well, thank you very much for calling, Matthew. We're honored that you are listening to us in the middle of the night over there in Germany. So great to hear from you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3676.84,"end":3677.64,"speaker":"Caller Pedro","text":"Thank you very much."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3678.28,"end":3683.24,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, why is the underworld. The underworld and what exactly is it under."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3683.8,"end":3696.04,"speaker":"Fr Stephen De Young","text":"Yeah, I'm imagining. I'm imagining that there was a group of people out there who thought, finally they're going to talk about vampires and werewolves, and we're talking about a totally different underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3696.2,"end":3696.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3696.56,"end":3702.12,"speaker":"Fr Stephen De Young","text":"And there's like a small legion of disappointed Kate Beckinsale fans out."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3703.28,"end":3703.84,"speaker":"Fr Andrew Stephen Damick","text":"Like, man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3705.76,"end":3708.88,"speaker":"Fr Stephen De Young","text":"Their eyeliner's gonna start running when they get disappointed."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3711.28,"end":3711.68,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3713.12,"end":3720.04,"speaker":"Fr Stephen De Young","text":"No, we're talking about the. The actual underworld, not the criminal underworld either. But the only twilight we're gonna talk."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3720.04,"end":3721.68,"speaker":"Fr Andrew Stephen Damick","text":"About on here is the twilight of the gods."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3722,"end":3727.04,"speaker":"Fr Stephen De Young","text":"Right. The regions under the earth. Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3727.52,"end":3741.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, right. That language is in. Scripture talks about it as being the pit. Right. Or under the earth. Or like even the word. Even the word shield grave, it doesn't that refer to something that's sort of deep? Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3741.88,"end":3743.48,"speaker":"Fr Stephen De Young","text":"You bury people in the ground."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3743.88,"end":3745.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In the holes in the ground."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3745.72,"end":3756.74,"speaker":"Fr Stephen De Young","text":"And we talked about this when we were. When we set the wayback machine for the Neolithic era, that even then you see people being buried in the ground with grave goods."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3758.01,"end":3758.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3758.57,"end":3768.89,"speaker":"Fr Stephen De Young","text":"Meaning both that they thought wherever this person's life went next, it was down there somewhere. And they were clearly not going to cease to exist because they gave them stuff."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3769.05,"end":3771.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're gonna need this in the world to come."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3771.77,"end":3772.09,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3772.09,"end":3772.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3772.89,"end":3777.37,"speaker":"Fr Stephen De Young","text":"So this. And this is. This is universal."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3777.77,"end":3788.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Almost. No, culture doesn't bury. Are there any ancient cultures we know of that don't. Of course. What evidence would there be? But. But everyone's burying their dead, as far as we know, in the ancient world."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3789.79,"end":3795.79,"speaker":"Fr Stephen De Young","text":"Right. This is. Yeah. And there's. There's one exception in the ancient world that, that you mentioned, me being the."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3795.79,"end":3810.67,"speaker":"Fr Andrew Stephen Damick","text":"Zoroastrians, Zoroastrianism, where they have something called sky towers, where they would build these towers and put the bodies up there to be eaten by animals. Animals and elements. And. Yeah, but. Yeah, that's. That was. The Romans thought that was deeply, deeply weird."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3810.99,"end":3813.68,"speaker":"Fr Stephen De Young","text":"Everybody else thought they were complete wackos for that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3813.68,"end":3815.6,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3816.24,"end":3818.72,"speaker":"Fr Stephen De Young","text":"So that exception sort of proves the rule."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3818.8,"end":3819.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3819.68,"end":3856.9,"speaker":"Fr Stephen De Young","text":"Everyone else thought they were bizarro. It was like mirror universe burial. So in. In, you know, your Canaanite ancient Near Eastern background, you have Sheol, the grave. Right. But it's not just referring to physical graves, obviously. Right. People go into the grave. There's other beings there. Right. And so it's this realm of the dead, and this is the place where the demonic beings are. So going all the way back into Sumerian literature, there are demons who are seen to sort of the way the demons show up as they crawl up through cracks in the ground."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3857.38,"end":3857.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3858.18,"end":3882.29,"speaker":"Fr Stephen De Young","text":"They come up out of the earth. Right. Or come up out of the sea. Right. But they're all below level. Right. That's. You have the Mountain of God and then you have these things that come up from below. And so in this understanding, in the, the ancient Near Eastern understanding, when. When you go into Sheol, you're going to the place where all those folks live and hang out."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3883.09,"end":3883.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3883.81,"end":3893.09,"speaker":"Fr Stephen De Young","text":"Right. So it's much worse than, than Sartre. It's. It's not just other people. It's, you know, these guys."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3893.65,"end":3913.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And it's. Why. Why down there? Like, what does that mean? Well, you remember last time we talked about the Mountain of God and all ancient peoples regarded the gods as living up on mountains. This is the, the inversion of that. Literally the inversion of that it's. It's what's down there, what's underneath."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3913.89,"end":3920.08,"speaker":"Fr Stephen De Young","text":"Right. And you have the stars and the heavens that we've also talked about. And then this is then the inverse, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3920.08,"end":3920.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3920.48,"end":3947.2,"speaker":"Fr Stephen De Young","text":"And one of the chief residents that. That shows up a lot in. In the Old Testament are the Raphaeem, who we've talked about before, who are some of these dead giants. But these are not just in scripture as the spirits of these dead giants. We have Ugaritic ritual texts for when their king died, the Refaim, they regarded as their ancient kings who were part divine."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3947.61,"end":3947.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3947.81,"end":3957.69,"speaker":"Fr Stephen De Young","text":"They. They regarded them as dead giants and they were worried about their king who just died because these guys were going to come meet him at the door when he got down there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3958.01,"end":3958.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3958.45,"end":3961.41,"speaker":"Fr Stephen De Young","text":"And these guys were not nice guys, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3961.41,"end":3961.77,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3961.77,"end":3983.33,"speaker":"Fr Stephen De Young","text":"Right. He remembered them like all the demonic spirits and all of these dead tyrants and all of these evil beings who. They spent a good portion of their trying time trying to ward off magically and ritually in this life and keep away from them. Right. Keep away from their crops and keep away from their children. That's where they were going when they died."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3983.49,"end":3984.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3984.05,"end":3986.29,"speaker":"Fr Stephen De Young","text":"So, yeah, it's pretty bleak, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":3986.61,"end":4014.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so you've got, you know, this. This image of sort of demonic beings torturing people down in hell. That's where, you know, which, like, is. It's. It's the cartoon hell. Right. That's. It's the hell that Bill and Ted go to in. And Billy Ted's bow tree. That's. That's. You know, the first movie was so much better than the second. But that's. That's where this comes from. It's. It's this. This image."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4014.41,"end":4024.13,"speaker":"Fr Stephen De Young","text":"You know, this is pagan. This is pagan hell. The pagan hell, the Christian hell. Not even medieval Christian hell. They got it from the medieval pagans they were converting in Western Europe."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4024.69,"end":4026.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4026.45,"end":4027.7,"speaker":"Fr Stephen De Young","text":"That's so."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4027.85,"end":4042.01,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah. But. But that's not the only version of. Of the underworld that there is. Right. There's also like the. A much more complex one that you see in Greek myth where the term Hades is used. Right. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4042.09,"end":4052.25,"speaker":"Fr Stephen De Young","text":"And Hades is the name, of course, of both a spirit. Right. A God. Right. Well, g. A spirit and the realm that that spirit oversees."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4052.49,"end":4053.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4053.21,"end":4054.89,"speaker":"Fr Stephen De Young","text":"Which place of its dominion."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4055.6,"end":4102.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which when, you know, sometimes people argue in, like, liturgical translations, so we use the word Hades or the word hell to refer to this. And I understand the argument in favor of Hades, basically, because a lot of people have this image of hell, but at Least etymologically speaking, and traditionally and historically speaking, both words refer to the place of the underworld and both words refer to the God that is in charge down there. And, you know, just Hades just happens to come from Greek and hell comes from Germanic language. The one exception that's a little different is in the Germanic world that. That hell is a feminine being. You know, so if you're familiar with the Marvel Cinematic Universe, you remember that's Cate Blanchett."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4102.49,"end":4102.73,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4103.37,"end":4105.57,"speaker":"Fr Andrew Stephen Damick","text":"So I was about. I was."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4105.57,"end":4116.97,"speaker":"Fr Stephen De Young","text":"I was about to say that. That if there were a ritual by which you could make like the 9th century present, I think you would do it, but then I remembered that that's the sca. So you probably already."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4117.13,"end":4119.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes, no, no. Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4119.25,"end":4119.97,"speaker":"Fr Stephen De Young","text":"That I could do that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4119.97,"end":4132.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, no, yeah. And. And she. And Sheol is also the same thing. Right. There's a. There's a. A God that is Sheol. Right, right, right, yeah, exactly. It's both a God and a place in these historical."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4132.58,"end":4140.18,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. And so there's. There's not the sort of like slasher movie quality to Hades that there is to Sheol."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4140.58,"end":4141.38,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4141.86,"end":4148.26,"speaker":"Fr Stephen De Young","text":"The Hades. Hades, you get more images of sort of sadness, regret, forgetfulness, woe, sorrow."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4148.5,"end":4151.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Shadows, darkness. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4151.78,"end":4179.24,"speaker":"Fr Stephen De Young","text":"Imprisoning me. Right. I cannot live. I cannot die. That's a reference. Someone will get the Right. And I notice that in our brief notes here, you put teenage emo goth hell, which is accurate. Accurate to something we discussed, but I feel the need to distinguish between an emo and a Goth. Silver sun, pickups and Bauhaus are not the same thing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4179.56,"end":4180.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4180.52,"end":4181.32,"speaker":"Fr Stephen De Young","text":"Not at all."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4181.32,"end":4186.58,"speaker":"Fr Andrew Stephen Damick","text":"Oh. To me, Goth is a large German barbarian with an axe. That's really what a Goth is."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4186.58,"end":4191.3,"speaker":"Fr Stephen De Young","text":"But yes, well, modern day Goths would not survive that long against those Goths."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4191.54,"end":4192.5,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4192.66,"end":4201.38,"speaker":"Fr Stephen De Young","text":"But yes, this is. This is. You're appealing to the teenage. No one understands my pain, especially mom and dad."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4202.02,"end":4202.5,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4202.82,"end":4204.98,"speaker":"Fr Stephen De Young","text":"I write bad poetry that doesn't rhyme."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4205.3,"end":4205.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4205.86,"end":4216.58,"speaker":"Fr Stephen De Young","text":"Kind of phase. Right. And that's. Yes, it's. Every day is like Sunday, all silent and gray. Right. Everyone's. Everyone's sad and depressed and."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4217.86,"end":4220.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's an. Yeah, that's. So that's one angle of Hades."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4221.3,"end":4240.37,"speaker":"Fr Stephen De Young","text":"Right? That it's. It's sort of. And then. Then Hades. Right. The. The shades, the shadows literally, of people sort of go there and live this kind of shadowy for existence for as long as they're remembered. And then as their memory fades, sort of so did they."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4241.24,"end":4258.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And. And that's the reason why? In a previous episode, we mentioned these shrines that were at various pagan cities to heroes where they would pour down blood to kind of feed their memory and keep them alive, because the hero would then still be present in the city by means of sort of doing this, you know."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4258.68,"end":4260.44,"speaker":"Fr Stephen De Young","text":"Right. Got to keep them going."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4260.68,"end":4261.96,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, yep."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4262.92,"end":4263.32,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4267.81,"end":4268.05,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4269.49,"end":4270.61,"speaker":"Fr Stephen De Young","text":"Yeah, I don't want to go there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4271.49,"end":4272.13,"speaker":"Fr Andrew Stephen Damick","text":"So that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4272.37,"end":4278.05,"speaker":"Fr Stephen De Young","text":"Having discussed in general, the. The. Right. The place. So this is. This is the underworld. This is that. That place."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4278.29,"end":4278.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4278.61,"end":4287.73,"speaker":"Fr Stephen De Young","text":"That is made present through in profane space. But this. This place has its own geography."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4288.05,"end":4291.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. There's sort of neighborhoods in the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4292.22,"end":4297.66,"speaker":"Fr Stephen De Young","text":"Just like we talked about, you know, that there's. There's paradise, the garden with tents in it on top of a mountain."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4297.66,"end":4297.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4297.86,"end":4342.91,"speaker":"Fr Stephen De Young","text":"That there is a certain geography. Right. And really, a lot of the. The apocalyptic literature we've briefly mentioned and will probably inevitably we're gonna have an episode on the Book of Enoch, etc, are sort of tours of this geography. Right, right, right. In both directions. So also Hades, Sheol, the underworld has this geography. And it's not just in general that, like, oh, because these horrible things have happened here, these places become hell, but specific places become specific places in the underworld. There's a correspondence between these. These specific places and those specific places."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4343.07,"end":4357.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay. Yeah. So the first one we're going to talk about is the abyss, which is. Of all the places in the underworld to be, it's the worst. You don't want to go to the abyss."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4357.8,"end":4359.16,"speaker":"Fr Stephen De Young","text":"Bad place is bad place."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4359.4,"end":4379.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, yeah. Right, yeah. And it shows up in every ancient mythology in one way or another with slight differences in terms of the way that gets talked about, but like in the ancient near east, so this is obviously kind of ground zero for a lot of what we discuss. It's down underwater. Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4379.25,"end":4391.01,"speaker":"Fr Stephen De Young","text":"Because the water is chaos. So the sea is chaos. The depths of the sea is. Right. But that doesn't always play out in terms of sea like the Mediterranean. Sometimes it does."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4391.33,"end":4391.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4391.93,"end":4411.97,"speaker":"Fr Stephen De Young","text":"No, but for example, we've talked about the. The Apkallu stories that these were sort of the. The paired, like the. The ancient Near Eastern version of the Titans or the angels who rebelled with Cain's line. They're in the Apkallu story, the Babylonian version of the story. They're imprisoned underneath the Tigris and Euphrates rivers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4412.45,"end":4412.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4413.01,"end":4415.17,"speaker":"Fr Stephen De Young","text":"In particular at the bottom of the water."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4415.25,"end":4415.65,"speaker":"Caller Pedro","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4415.81,"end":4418.61,"speaker":"Fr Stephen De Young","text":"Big thing of water right down at the bottom."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4418.77,"end":4467.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And you know, some of my ancient ancestors got bless them and forgive them the Balts. They. And actually, a lot of people in Northern Europe did this. You know, they had this sense that gods were down there, not just under the waters, but under kind of anything that's watery. So, like bogs, especially swamps. And they would. They would sacrifice things down into the bogs, including people. They would put various things down there. But. But. But including people, they would put them down in there. The idea was to sort of send them to the gods. Right. Because down there in the underworld. And so, I mean, that's a pretty macabre. You know, you're connecting with some really awful, awful gods if you're. If you're sacrificing to underworld gods. Yeah, You're. You're. Yeah. Like even. You're. Even a pagan has a sense that he's. He's connecting with a demonic, horrible creature, you know?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4468.11,"end":4470.03,"speaker":"Fr Stephen De Young","text":"Right. Surely to ward them off."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4470.67,"end":4472.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Please don't come up out of there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4472.67,"end":4479.23,"speaker":"Fr Stephen De Young","text":"When you're connecting with them. Yeah, yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4479.23,"end":4481.35,"speaker":"Fr Andrew Stephen Damick","text":"So Jonah fits into this, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4481.35,"end":4486.95,"speaker":"Fr Stephen De Young","text":"Right. Yeah. I don't think this is. This actually isn't. Ruins your Sunday school. This is, I think, vastly improves your Sunday."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4486.95,"end":4488.95,"speaker":"Fr Andrew Stephen Damick","text":"Makes it way cooler. Yes, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4489.59,"end":4502.23,"speaker":"Fr Stephen De Young","text":"I think that. That people still have this mental image that Jonah gets, like, eaten by a fish. And, like, he's sitting inside the fish, like Pinocchio in the whale in the Disney movie."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4502.23,"end":4502.95,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4503.49,"end":4505.65,"speaker":"Fr Stephen De Young","text":"Like, with a. With a campfire or something."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4506.21,"end":4508.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like there's somehow enough air down there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4509.01,"end":4516.49,"speaker":"Fr Stephen De Young","text":"Right at the bottom of the ocean. Yeah. So here's what actually happens in the book of Jonah. Leviathan, Lotan. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4516.49,"end":4516.85,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4516.93,"end":4541.83,"speaker":"Fr Stephen De Young","text":"The chaos sea monster eats Jonah and he dies. Jonah is dead. And it swims with Jonah's corpse down into the abyss. Right. It says it's between the pillars of the earth. Those are the pillars that are holding up the dry land. So he's down in there under. In the underworld. Right. And so when Jonah prays, he's praying not just from Sheol, he's praying from the abyss."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4542.07,"end":4542.47,"speaker":"Fr Andrew Stephen Damick","text":"From."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4542.63,"end":4547.27,"speaker":"Fr Stephen De Young","text":"Yeah, right. Out of the depths. Right. That's."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4548.31,"end":4566.24,"speaker":"Fr Andrew Stephen Damick","text":"Out of the depths cried unto thee. Yeah, I mean, that's deliberate. That's deliberate. When it says that again, like, you know, we're all about helping people who are going to Orthodox church services. Parts of it light up. Right. That's in Vespers. Out of the depths have I cried unto the oh, Lord. Lord, hear my voice. That's the depths we're talking about."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4566.8,"end":4567.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4567.36,"end":4568.8,"speaker":"Fr Andrew Stephen Damick","text":"Way, way, way, way down."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4569.12,"end":4583.87,"speaker":"Fr Stephen De Young","text":"And so it's death that vomits up Jonah when he. When he comes back out. And so when Christ talks about the sign of Jonah, he's not just making this allegory where like, okay, like, so imagine the tomb is a fish, and there's three days."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4583.87,"end":4584.11,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4584.11,"end":4603.23,"speaker":"Fr Stephen De Young","text":"Yeah, right. And, yeah, there's, hey, three. You know, but it wasn't actually three. It's kind of about the third day. How does that work? Right. That's not what's going on there. Right. It's. It's, again, very literal. Our next episode we're going to see that a lot of the things that you've thought were analogies and allegories in the. The Pasca Easter services aren't."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4603.23,"end":4609.95,"speaker":"Fr Andrew Stephen Damick","text":"They're literally not. Yes. I have to come up with another leading question. The beginning, where you just say no, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4611.48,"end":4614.12,"speaker":"Fr Stephen De Young","text":"This. This one's. This one's literal, too."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4614.6,"end":4615.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4615.32,"end":4642.28,"speaker":"Fr Stephen De Young","text":"This one's literal too. So the, The. This is also the little bit of irony in the episode where Christ cast the demons into the pigs, right. Thereby creating deviled ham. Boom. Yeah. Dad joke is that, you know, that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4642.28,"end":4645.24,"speaker":"Fr Andrew Stephen Damick","text":"One sink in, everybody deviled him."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4645.48,"end":4661.16,"speaker":"Fr Stephen De Young","text":"Okay? They plead with. They plead with Christ not to send them into the abyss. Right. And then he says, you know, they plead with him, send us into the pigs instead. So he sends them into the pigs, and the pigs promptly run and jump into the sea."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4661.72,"end":4662.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4662.12,"end":4664.2,"speaker":"Fr Stephen De Young","text":"And take. Sink and take them to the."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4665.63,"end":4674.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. So. And just as a reminder to everybody, this is where giants show up in the New Testament, because those are. Those are giants. They're disembodied giants."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4674.15,"end":4675.63,"speaker":"Fr Stephen De Young","text":"Spirits of dead giants."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4675.95,"end":4679.23,"speaker":"Fr Andrew Stephen Damick","text":"Dead Nephilim. But."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4679.23,"end":4700.54,"speaker":"Fr Stephen De Young","text":"So as we mentioned, with the Apkallu, Right. The abyss is the place where these rebellious gods or spirits are imprisoned. So you see the same thing. The Greek version of this is Tartarus, or the tariff. Titans are imprisoned. And it's. I'm sure we'll do a Titans episode at some point in the future."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4700.54,"end":4701.9,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that would be so fun."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4702.06,"end":4711.74,"speaker":"Fr Stephen De Young","text":"And all the Robin and Wonder Girl fans will be disappointed when they find out that, no, it's the Greek Titans. I just like disappointing nerds."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4713.82,"end":4746.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And, and there's, of course, a reference to this in the Bible in Second Peter, chapter two, verse four. You know, for if God spared not the angels that sinned, but cast them down to hell, you know, just put a star, a pin in that and delivered them into chains of darkness to be reserved into judgment. So the word that's there for hell, we look this up in the Greek. It's actually Tartarosa. So It's. He casts them into Tartarus. So, like, this sort of neighborhood of Hades is there in. In the New Testament. It's mentioned there in the New Testament."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4747.38,"end":4760.1,"speaker":"Fr Stephen De Young","text":"So it's not just a vague thing. St. Peter is here directly making that equation between the Titans and the angels who fell with Cain's line and saying they're imprisoned. Right. He's correcting the pagan version of the story."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4760.66,"end":4761.14,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4761.14,"end":4768.62,"speaker":"Fr Stephen De Young","text":"But they're imprisoned in this place, Tartarus, to. To await the final judgment. So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4768.62,"end":4774.63,"speaker":"Fr Andrew Stephen Damick","text":"And. And again, the abyss and Tartarus. These are just two different words for the same part of the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4774.71,"end":4779.59,"speaker":"Fr Stephen De Young","text":"It's a pit. Right. It's the pit which is the inverse of a mountain."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4780.31,"end":4781.03,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4781.11,"end":4789.59,"speaker":"Fr Stephen De Young","text":"The direct inverse of a mountain. Right. Is. Is a. An endlessly tall mountain has as its opposite a bottomless pit."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4790.31,"end":4791.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4791.31,"end":4814.33,"speaker":"Fr Stephen De Young","text":"A mountain which stretches to the heavens. Bottomless pit. And the abyss gets referred to a couple other places in. In scripture. In Revelation 9, there's the angel who has the key to the abyss, shows up and he unlocks it and lets those guys out to sort of ravage the world there at the end. Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4814.33,"end":4814.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4815.73,"end":4823.61,"speaker":"Fr Stephen De Young","text":"And then in chapter 20, same angel shows up again, this time to imprison the devil."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4824.17,"end":4825.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The furlough is over."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4826.01,"end":4826.49,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4827.13,"end":4828.89,"speaker":"Fr Andrew Stephen Damick","text":"So everybody get back in."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4829.77,"end":4840.41,"speaker":"Fr Stephen De Young","text":"And additionally, one of the rivers, we're going to talk about more rivers in Hades. But one of the rivers in Hades, the Phlegastone, is a river of fire."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4841.37,"end":4842.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4842.57,"end":4886.09,"speaker":"Fr Stephen De Young","text":"That runs down all of the rivers, run down into the abyss, run down into the. The pit. But this is a river of fire that runs down into the pit, causing the pit to become a lake or valley of fire. Right. And the river of fire we see in Daniel, the lake of fire we see. Show up in the Book of Enoch, or first Enoch, and then it shows up in St. Matthew's Gospel. It shows up in the book of revelation. In St. Matthew's gospel, in Revelation, it's specifically the lake of fire prepared for the devil and his angels. Note, not humans, although humans can end up there. It's not created for them. It's created. This abyss is created to imprison those rebellious spirits."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4886.49,"end":4900.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay. So that's not the neighborhood you want to move into in the underworld. I mean, you don't want to be down there at all. But. But. But the best part of the underworld in Greek myth was referred to as the Elysian Fields."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4900.79,"end":4902.23,"speaker":"Fr Stephen De Young","text":"That's not so bad place."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4902.39,"end":4923.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes, the not so bad place. That's as good as it gets. Is the Elysian Fields. And of course, there's, you know, this is referenced in scripture, not with that term that I can recall, but. So, for instance, there's the gospel where we read about the rich man and Lazarus. And Lazarus is in what is called the bosom of Abraham."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4923.99,"end":4934.43,"speaker":"Fr Stephen De Young","text":"Right. Which is a colloquial way of referring to it. Because what you see in the Old Testament is the hope is that when they go into the grave, they will rest with their fathers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4934.43,"end":4936.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Rest with their fathers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4936.87,"end":4942.31,"speaker":"Fr Stephen De Young","text":"And so Abraham is sort of the patriarch, right? He's the. The first father."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4942.71,"end":4943.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4943.99,"end":4951.75,"speaker":"Fr Stephen De Young","text":"Of the people. So if you're in the bosom of Abraham, that means you're resting with the fathers, with Abraham, Isaac and Jacob and their righteous seed."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4952.95,"end":4962.21,"speaker":"Fr Andrew Stephen Damick","text":"And even. And even pagans had the same idea, you know, to go be with your ancestors. Like, this is sort of as good as it gets. It's not great, but it's as good as it gets."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4962.29,"end":4963.81,"speaker":"Fr Stephen De Young","text":"But it's better than the abyss."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4963.97,"end":4965.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, way better than the abyss."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":4967.17,"end":5003.96,"speaker":"Fr Stephen De Young","text":"Right. And so the way this is described in the Book of Enoch, when he sees Hades, he sees that there are these three caves, these sort of three subdivisions of where the people are in Hades. When Enoch is sort of going on his journey, at that point, paradise is empty. He sees it, but it's empty. But there are these three caves. And so in one of the caves, you have the bosom of Abraham, you have the righteous fathers. Right. Or the sons of the righteous seed."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5004.04,"end":5007.92,"speaker":"Fr Andrew Stephen Damick","text":"And apparently it's some kind of grotto or whatever because there's a spring of water there, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5007.92,"end":5064.99,"speaker":"Fr Stephen De Young","text":"There's a spring of water there. That's what differentiates it from the other two parts for him. Right? They have this spring of water to sort of refresh them and care for them while they're there. And this is referenced obliquely in the parable of the rich man and Lazarus that you just mentioned, right? Because in the one. The one area, the rich man is the other area. Lazarus is the rich man, asks for Lazarus to bring him some water, right? Bring him some drops of water. Because there's water where Lazarus is in the bosom of Abraham, right? There's a spring. So that's kind of an oblique reference to this idea. And then. So there's. There's that cave, then there's another cave, which is sort of where the people are in a holding station who, after the final judgment in the Book of Enoch, are going to end up in the abyss. They're going to end up getting chucked in there. With the rebellious angels."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5065.43,"end":5071.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's sort of the. The abysmal waiting room, you know, like the. The dmv, essentially."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5072.15,"end":5082.95,"speaker":"Fr Stephen De Young","text":"Yeah. They're waiting in the waiting room because they can't get out. And so then this raises the question of the third cave."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5083.43,"end":5083.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5086.63,"end":5100.56,"speaker":"Fr Stephen De Young","text":"So this. In first Enoch. He has the idea in first Enoch that that third group wasn't really righteous, but they're not really, like, demonically evil either."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5101.04,"end":5103.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're the. The okay people."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5104.16,"end":5111.8,"speaker":"Fr Stephen De Young","text":"Right. And so they basically get Perma. Hades. Right. They just get. They're just in that cave forever."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5111.8,"end":5112.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5112.8,"end":5114.64,"speaker":"Fr Stephen De Young","text":"And isn't exactly great."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5115.76,"end":5127.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. And this exists in pagan stuff, too, like in the Greek tradition. Oh, this is lesser known. Like, who know knows this? There's something called the Asphodel Meadows, which, again, sounds like a neighborhood we just moved into. Asphodel Meadows, dear."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5128.33,"end":5130.01,"speaker":"Fr Stephen De Young","text":"Where everything is mediocre."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5130.57,"end":5131.13,"speaker":"Fr Andrew Stephen Damick","text":"Everything is."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5131.13,"end":5134.17,"speaker":"Fr Stephen De Young","text":"We watch the same VHS over and over again."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5136.81,"end":5151.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I feel like I've just started watching WandaVision, which we, of course, we referenced last time, and I feel like it's kind of an Asphodel Meadows sort of place. I'm only halfway through, so. No spoilers, okay?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5151.04,"end":5151.92,"speaker":"Fr Stephen De Young","text":"No spoilers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5151.92,"end":5152.48,"speaker":"Fr Andrew Stephen Damick","text":"No spoilers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5152.48,"end":5153.2,"speaker":"Fr Stephen De Young","text":"No spoilers."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5153.36,"end":5155.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it's. So it's not."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5155.12,"end":5157.92,"speaker":"Fr Stephen De Young","text":"Don't tell them about. Don't tell them about Captain America showing up."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5158.24,"end":5172.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. So it's not. It's not limbo in the later sort of sense of limbo, like in the medieval Roman Catholic idea. Like, it's not that, but it's a limbo ish kind of place. That's. It's. It's this. It's the land of Meh."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5173.2,"end":5173.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5173.64,"end":5174.6,"speaker":"Fr Andrew Stephen Damick","text":"You know. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5174.6,"end":5187.16,"speaker":"Fr Stephen De Young","text":"It's sort of Dante kind of has a limbo like that, Right. Where like, Virgil's hanging out and like all the pagans who he really likes and doesn't want to see in hell, even though they were pagans. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5187.16,"end":5187.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5188.52,"end":5205.05,"speaker":"Fr Stephen De Young","text":"Like, he can't bear to put them there. But generally when they're talking about limbos in. In most medieval Latin theology, they're talking about the limbo of infants, that's unbaptized infants, or the limbo of the fathers. And the limbo of the fathers refers to, like, Abraham's bosom, that place we were just talking about."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5205.37,"end":5208.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So these words kind of move around a little."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5208.33,"end":5223.93,"speaker":"Fr Stephen De Young","text":"Yeah. But so that. That kind of limbo, even though it's around, that kind of idea, is around in paganism, and it's around even in Second Temple Jewish literature, like the Book of Enoch, it doesn't really get picked up by Christianity."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5224.89,"end":5225.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5225.25,"end":5231.53,"speaker":"Fr Stephen De Young","text":"That kind of idea of new neutrality. Right. Doesn't really carry over."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5232.01,"end":5263.3,"speaker":"Fr Andrew Stephen Damick","text":"Not a thing. Yeah. Yeah. So I should just say here, now that we've taken this little tour of the neighborhoods of the underworld, that it will probably occur to a lot of our listeners to wonder exactly how all this fits into questions of eternal salvation and eternal damnation. And to that, I'm just going to say, wait until next time. So. All right. Well, that being said, then, we're going to go ahead and take our second break and we'll be back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5264.1,"end":5280.39,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8.5af radio."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5285.75,"end":5343.59,"speaker":"Announcer","text":"Doxamut online. Tolkien, Enchantment and the Christian Life an ancient faith event for the Christian, the enchanted or sacramental worldview is critical to a wholesome full life in Christ. The work of fantasy author JRR Tolkien provides a shaping for the imagination and so that contributes to this vision. Join the hosts of Ancient Faith Radio's Amansul podcast in this special online event that explores how this shaping happens in partnership with the St. Basil center for Orthodox Thought and Culture. The webinar will take place on Friday, May 7, and Saturday, May 8, and speakers include Dr. Cyril Gary Jenkins, Father Andrew, Stephen Damick and Richard Roland. The cost is $30 and and registration will close on Wednesday, May 5, at noon Eastern. To secure your spot, please visit store.ancientfaith.com doximate that's store.ancientfaith.com Doximate."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5349.91,"end":5366.03,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5367.47,"end":5383.15,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of the Lord of Spirits. We're going to be talking very soon about some of the architecture in the underworld and also what happens when you as you cross over. But first, we have Daniel calling from Tennessee. So, Daniel, can you hear me? Hello."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5383.95,"end":5385.87,"speaker":"Caller Pedro","text":"I appreciate your taking my call."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5386.43,"end":5388.35,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely. What's your question? DANIEL?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5389.39,"end":5454.33,"speaker":"Caller Pedro","text":"Well, I have wondered about something ever since I was a young lad, and that is that there was a denomination which I won't name, but it teaches that there's I grew up a Catholic, though it teaches that people, when they die, you probably heard this theory, people do not go anywhere at all, but rather they die and they await the resurrection. There seem to be scriptures that support that. For example, Job said, I will wait till my change. Come though my. The worms destroy this body, yet in my flesh shall I see God. And so forth. And death is always likened unto a sleep under that the. Supposedly the wicked, when they are punished, they are not burned, they are not. The punishment doesn't go on forever, but the punishment is certainly final because they are consumed in the lake of fire and are no more. And I just wonder, should I hang up and listen to you or what would you like?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5455.45,"end":5463.59,"speaker":"Fr Andrew Stephen Damick","text":"Well, you're welcome to stay on if you've got a follow up question, but I'm going to go ahead and punt this over to Father Stephen. What exactly happens when you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5463.59,"end":5475.15,"speaker":"Fr Stephen De Young","text":"Right, so there's, there's, there's two pieces there, right. The, the, the first piece is sort of what's, what's sometimes called soul sleep. And the second piece is what's often termed annihilationism."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5475.55,"end":5478.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and, and, and we don't believe in either one of those."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5478.43,"end":5479.55,"speaker":"Fr Stephen De Young","text":"No, no."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5479.55,"end":5481.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay, but get that in."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5481.87,"end":5514.07,"speaker":"Fr Stephen De Young","text":"Yeah, so. So soul, soul sleep is based on, in addition to the passages you mentioned taking some passages in the New Testament very literally. Right. So Christians passing away, dying is referred to as falling asleep in the Lord, Right. So taking that very literally. One of the issues with that is of course that sleep isn't oblivion, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5514.07,"end":5514.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5515.31,"end":5518.75,"speaker":"Fr Stephen De Young","text":"As Hamlet reminded us, Right. You sleep per chance to dream, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5519.47,"end":5519.95,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5520.43,"end":5539.07,"speaker":"Fr Stephen De Young","text":"And so we continue to have conscious experiences while we're asleep. So the idea of comparing it to sleep doesn't mean it's some completely unconscious state. Right. Like if you ever had surgery, they hit you with the stuff and you're out."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5539.34,"end":5539.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5539.46,"end":5540.3,"speaker":"Fr Stephen De Young","text":"It's oblivion."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5540.78,"end":5541.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5541.1,"end":5709.79,"speaker":"Fr Stephen De Young","text":"You close your eyes, you open them, you have no sensation of time passing. Right. It's that like a period of time is gone from your life. Right. But that's not normal sleep. Right, Right. And so that, that analogy doesn't necessarily mean that. Right. Even if taken fairly literally. But it is also true. It is also true and we need to push back against this. And the passage you quoted from Job is an important one in doing that. That the idea that people die and go to heaven or hell for eternity, that is a sub Christian eschatology. That is not what Christians believe. Christians believe that we die and that when Christ returns, when Christ appears, I should say is the better language. When Christ's Glorious appearing happens, that all of the dead are raised bodily and stand before his judgment seat and then go from thence bodily to eternal life or eternal condemnation, right? We believe that in between, in the in between period, that the conscious experience of Christians doesn't cease, right? We're still finite, so we still experience things in terms of time and potentially even space. And so that conscious experience continues. And that conscious experience represents a foretaste of either, of either bliss or judgment that is coming because our conscious state from our life continues until the, until the bodily resurrection. So the kernel of truth behind the soul sleep idea is that they're at least holding on to the idea of the bodily awakening part, which is better than a lot of folks do, right? They have this just bodiless eternity, right, which isn't Christian, but they're a little flawed in taking the sleep idea a little too literally and saying that, well then there's just oblivion between when you die and when you rise, right? So in terms of the annihilation question, this goes back to something we were talking about last time and that we've talked about before. And see, annihilationism, the idea that the souls of the condemned just cease to exist requires an idea of nothingness. It opposes being and nothingness, existence and non existence. And that polarity just didn't exist in the ancient world. They didn't have zero."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5713.07,"end":5715.63,"speaker":"Fr Andrew Stephen Damick","text":"That's a later invention. I can't remember when that was, was."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5715.63,"end":5774.29,"speaker":"Fr Stephen De Young","text":"Invented in India in the 4th or 5th century. So they didn't have a zero. So they wouldn't say I have zero apples, right? They would say I am not having apples, I am not performing the action of having. So when they talk about something not performing the action of being, for them, being is opposed to chaos. Existence is opposed to chaos, right? So in the same way that our being, justified and being put in order by God represents becoming fully human, the opposite of it, the chaos that comes from participating in demons. What that does, does to a, to a human is make them some human. It makes them less human. It diminishes their humanity. They descend into chaos. And so the images we see of like weeping and gnashing, of teeth, weeping and gnashing and of teeth isn't an, an image of being tortured, it's an image of madness."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5774.85,"end":5776.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Insanity, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5777.01,"end":5833.3,"speaker":"Fr Stephen De Young","text":"It's that lack of order, right? Complete lack of order and chaos and destruction. Um, but so to cease to exist, to cease to be human, didn't mean void. Yeah, to ancient people, right? We can come up with the concept of annihilationism now, but it didn't mean that to ancient people. To them, it meant this descent into sort of this animalistic. And so that, that's. That, that behavior is what you see with demoniacs, like in the Gospels, Right. They're living in this subhuman way. They're naked, they're running in the tomb, you know, unable to be chained. Right. It's that they've become less than human now. And so when Christ then performs an exorcism, we see they're sitting peacefully and in their right mind and clothed. Right. That order has been restored. They've been made human again in that. That internal order. So I know that was a ton. I just dumped on you, but. Yeah, yeah, answers your question."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5833.54,"end":5837.08,"speaker":"Fr Andrew Stephen Damick","text":"Daniel. Yeah. Daniel hung up and took call off the air. So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5837.08,"end":5841.28,"speaker":"Fr Stephen De Young","text":"Okay, so I'll just assume he understood it. I nailed it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5842.08,"end":5852.4,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So we're going to take just one more call. And this is Michael who has a question or comment about giants. Michael, are you there?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5853.2,"end":5876.84,"speaker":"Caller Pedro","text":"Hi there, Father. I really love the show. Learned a ton. I really appreciate it. I actually just had a quick question. I recently read the Epic of Gilgamesh and it means that Gilgamesh and enkidu are both 2/3 God. So I'm assuming they're giants. And then I guess I could do something else. Then I thought, what should I think of all the demigods and all the other mythologies, like, is Achilles a giant? Is Odysseus a giant?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5877.48,"end":5877.96,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5878.04,"end":5878.6,"speaker":"Caller Pedro","text":"Could you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5880.92,"end":5888.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're giants. Yeah. So, Michael, if you haven't listened to our giants episode. Have you listened to the giants episode? Michael?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5889.58,"end":5891.9,"speaker":"Caller Pedro","text":"I have. Look back when it first aired."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5892.14,"end":5924.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Back in November. Yeah. I might suggest re listening to it. And you know, one of the cool things, this is actually just to put a little plug up for this. You know, you can sponsor. People can sponsor our episodes for transcripts to be written. And so far, every single one of our episodes has been sponsored for a transcript, which is wonderful. And so you can read that episode if you don't want to spend the three and a half hours. But why wouldn't you want to spend those three and a half hours listening to that episode again? It currently holds the record for the length of any single episode on ancient faith radio of anything."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5925.05,"end":5927.61,"speaker":"Fr Stephen De Young","text":"So although, hey, the. The night is young."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5928.09,"end":5928.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5928.89,"end":5929.21,"speaker":"Caller Pedro","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5929.45,"end":5930.93,"speaker":"Fr Andrew Stephen Damick","text":"We could keep. That's right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5930.93,"end":5937.13,"speaker":"Fr Stephen De Young","text":"Let's just keep. But yeah, there you go. I will. I will not just shine you on and give you an actual answer."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5937.29,"end":5938.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you Go."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5938.25,"end":5969.15,"speaker":"Fr Stephen De Young","text":"Which is. Yes. Yeah, they're all giants. Yeah, and there's, there's, there's Hercules, Samson stuff going on. The people love it when I talk about Samson. But you know who you are. But yeah, they're giants. And, and in fact, they're so firmly giants that among the Dead Sea scrolls. One of the Dead Sea Scrolls is referred to as the Book of the Giants."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5969.71,"end":5970.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5970.03,"end":5982.02,"speaker":"Fr Stephen De Young","text":"It lists their names. Okay. And so this is from the, the first or second century B.C. okay. They list Gilgamesh as one of the giants."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5984.34,"end":5985.06,"speaker":"Caller Pedro","text":"Excellent."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5985.54,"end":5995.78,"speaker":"Fr Stephen De Young","text":"So this is, this is more than a millennium after the Epic of Gilgamesh was written in Akkadian. That's how firmly Gilgamesh is a giant. And that memory was held."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":5997.23,"end":6000.91,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So does that make sense, Michael?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6001.55,"end":6002.99,"speaker":"Caller Pedro","text":"Yeah, that answers my question."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6003.39,"end":6008.35,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you for calling. We're always ready to talk about giants. Just a rule."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6008.35,"end":6009.87,"speaker":"Caller Pedro","text":"Thank you, fathers. I really appreciate it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6010.19,"end":6018.59,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for calling, Michael. Okay, we're going to take one more caller and it's Pedro from Wisconsin. Pedro, are you there?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6019.55,"end":6020.83,"speaker":"Caller Pedro","text":"Hey, Father, can you hear me?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6021.31,"end":6024.13,"speaker":"Fr Andrew Stephen Damick","text":"We can hear you. Welcome to the Lord of Spirits. Pedro."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6025.49,"end":6029.73,"speaker":"Caller Pedro","text":"Thank God. Long time caller, first time listener. I appreciate you taking my question."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6032.93,"end":6034.29,"speaker":"Fr Andrew Stephen Damick","text":"What's your question, Pedro?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6035.33,"end":6045.25,"speaker":"Caller Pedro","text":"Yeah, yeah, I wanted to ask about the sort of the movement to the intermediate state, what that looks like, or I guess maybe not looks like. Looks might be the wrong word."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6046.61,"end":6049.41,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. This is kind of what the third half of our show is about. So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6049.85,"end":6053.61,"speaker":"Fr Stephen De Young","text":"Yeah, what does it look like to a mantis shrimp? That's the real question."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6055.37,"end":6056.17,"speaker":"Fr Andrew Stephen Damick","text":"Or a bat."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6059.29,"end":6086.84,"speaker":"Caller Pedro","text":"So sort of the nature of that, I guess the journey. Right. You know, the departure of the soul, the, I guess the, the initial judgment and, and the role that, you know, our guardian angel plays in that. The role that the saints play. Play in that. You know, we have a prayer at compline where we ask the Theotokos to guide our soul when we depart. And so I'm just sort of curious about what, what that's all about."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6088.04,"end":6100.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, we are going to talk about that a little bit in the third half, but particularly maybe the questions about angels and demons and, you know, guiding along the way. I don't know. What do you think, Father?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6100.84,"end":6110.04,"speaker":"Fr Stephen De Young","text":"Right, there's, there's. Our tradition has that there's a 40 day journey or journey corresponding to a 40 day period that the soul takes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6110.28,"end":6113.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not like 40, 24 hour periods."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6113.16,"end":6127.64,"speaker":"Fr Stephen De Young","text":"Right. And the soul is aided in that journey by the prayers of the, of the faithful and by the prayers of the saints. And if this was an attempt by you to Trojan horse toll houses onto my show, you're a bad person, and I hope you're ashamed of yourself."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6129.55,"end":6138.35,"speaker":"Fr Andrew Stephen Damick","text":"We should add that. Pedro. Pedro. We should add that Pedro is one of Father Stevens advisees in the St. Stephen's program. So, again, this is someone that we."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6138.35,"end":6141.95,"speaker":"Fr Stephen De Young","text":"Know and who should know better, frankly."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6144.83,"end":6145.87,"speaker":"Fr Andrew Stephen Damick","text":"It's okay, Pedro."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6146.91,"end":6147.59,"speaker":"Fr Stephen De Young","text":"We still love it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6147.59,"end":6154.97,"speaker":"Fr Andrew Stephen Damick","text":"So I don't know if that helps at all, but we are about to actually talk about crossing over that river. So that should be pretty interesting to you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6156.8,"end":6158.8,"speaker":"Caller Pedro","text":"Yeah, yeah, that is. That is helpful."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6159.44,"end":6159.88,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6159.88,"end":6161.6,"speaker":"Caller Pedro","text":"And I look forward to hearing the third half."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6162.24,"end":6166.44,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you very much for calling, Pedro. Okay."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6166.44,"end":6167.92,"speaker":"Fr Stephen De Young","text":"No further ado."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6168.4,"end":6175.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes, third half, exactly. All right. Well, you know, when I saw that giants call in there, I mean, we do have that standing rule, so."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6175.8,"end":6198.5,"speaker":"Fr Stephen De Young","text":"Yes, yes. And I want to add a rule about astral projection calls, but just in general. Oh, and anything else tangentially connected to Major Ed Dames automatically, especially if Ed himself calls it, because I think he's dead. Okay. So, yeah, so now we're down to waterways."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6199.3,"end":6199.94,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6199.94,"end":6203.22,"speaker":"Fr Stephen De Young","text":"I mean, which we've already mentioned a couple. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6203.3,"end":6232.71,"speaker":"Fr Andrew Stephen Damick","text":"You know, most ancient mythologies, in order to get into the underworld, there's some kind of water that you have to cross. Right. So, you know, I always think about in Greek religion, and then by that, I mean Greek paganism, you know, when someone's being buried, they put that coin on the tongue, and that coin is so that it can pay the ferry. Right. So they can get across the River Styx and make their way in. Otherwise, they just have to hang out on the shore, which. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6232.87,"end":6234.62,"speaker":"Fr Stephen De Young","text":"And I don't know what Karen does with the money."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6234.77,"end":6235.01,"speaker":"Caller Pedro","text":"Money."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6235.41,"end":6241.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I mean, does he. What does he spend that. I mean, who. Who is he? Yeah. I don't know."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6241.65,"end":6243.09,"speaker":"Fr Stephen De Young","text":"Yeah, he's just hoarding it somewhere."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6243.09,"end":6244.05,"speaker":"Fr Andrew Stephen Damick","text":"It's a good question."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6244.69,"end":6245.09,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6245.25,"end":6249.01,"speaker":"Fr Andrew Stephen Damick","text":"Well, the underworld is a place where there's hordes of gold coins and stuff, as we know."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6249.25,"end":6256.21,"speaker":"Fr Stephen De Young","text":"Right. And so you've got. You got the river sticks, which, you know, if you fall into it, you kind of disperse, kind of thing."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6256.61,"end":6259.65,"speaker":"Fr Andrew Stephen Damick","text":"Diffuse. Unless you're Achilles. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6259.73,"end":6261.84,"speaker":"Fr Stephen De Young","text":"Chaos thing again. Well, he just got dipped."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6262,"end":6263.4,"speaker":"Fr Andrew Stephen Damick","text":"Dipped. Okay. Yeah. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6263.4,"end":6263.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6263.6,"end":6264.68,"speaker":"Fr Andrew Stephen Damick","text":"He wasn't dropped. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6264.68,"end":6321.21,"speaker":"Fr Stephen De Young","text":"That made him immortal, except we missed the heel that he was being held by, which is. Rookie mistake. As somebody who's baptized some babies. That's poor form. That's right. You got to get them all the. So there's this. There's this idea that there's this potential destruction at entry. So in the Egyptian stories, especially in the Middle Kingdom, this is the Sea of Reeds. This is. If you're. If you're going to Grethor because you're a Klingon and you died, you're on the. That's the boat of the damned that. That sails you there because you died in dishonor. So that's. That's another river. Right, or waterway that we have. And then there's another one, the Acheron river, that actually sort of empties into a lake known as the Acherusian Lake."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6321.45,"end":6330.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is not. One is not quite as well known, I think, at least here in American culture, as the River Styx. But it does get mentioned in several places."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6331.21,"end":6345.8,"speaker":"Fr Stephen De Young","text":"Yeah, it's actually more relevant religiously than the River Styx and not the river. The lake. The Acherusian Lake. And there is an actual lake in northwest Greece."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6346.12,"end":6350.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right. We looked it up on the map. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6350.44,"end":6354.04,"speaker":"Fr Stephen De Young","text":"That you could go visit on holiday, if you'd like."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6354.44,"end":6355.88,"speaker":"Fr Andrew Stephen Damick","text":"Again, why would you do that?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6356.2,"end":6357.6,"speaker":"Fr Stephen De Young","text":"Yeah, I don't know."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6357.6,"end":6360.76,"speaker":"Fr Andrew Stephen Damick","text":"It's like the people go skiing on Mount Hermon. Why would you do that?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6362.68,"end":6372.74,"speaker":"Fr Stephen De Young","text":"But it's actually been identified with several different lakes, one in Italy. And that's because, as we've talked about, various lakes can be being the lake at different times."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6373.06,"end":6373.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6374.5,"end":6424.12,"speaker":"Fr Stephen De Young","text":"The Lake of the Underworld. And this water, like another river. We're going to talk about the. Well, we'll talk about it. Now, the leafy is associated generally with forgetfulness. So in Plato's Phaedo. Plato, of course, believed in the transmigration of souls, more commonly known as reincarnation. And so this is where your soul would get dipped in. In Hades, to sort of forget about the details, the detail memories of your former life. You'd retain some knowledge of the world of forms like mathematical realities and these kind of things, but your detail memories of your past life would be wiped out. And if you were a bum, you could come back as a lobster or something. So it's."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6424.12,"end":6429.6,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting to me that the bit of knowledge you keep is. Is math. I don't know how that works, but."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6429.6,"end":6448.29,"speaker":"Fr Stephen De Young","text":"Well, Plato was big on the math. He was probably in. This was Aristotle's big critique of Plato, actually, was that he argued that. That first principles could not ultimately be derived from mathematics because mathematics couldn't justify its own first principles."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6449.17,"end":6450.45,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, what I think."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6450.93,"end":6460.33,"speaker":"Fr Stephen De Young","text":"Yeah. Brief rabbit cereal. The metaphysics lambda. But. So Plato has this. This lake performing this function of Sort of."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6460.33,"end":6460.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6460.93,"end":6502,"speaker":"Fr Stephen De Young","text":"Purifying from the. The mind from the previous life to begin a new one. And so then we start seeing it pop up in Jewish and Christian literature. So one example of this is in the Greek life of Adam and Eve, where after Adam and Eve have been expelled from paradise, they repent. The sun and the moon offer incense and join their prayers in repenting with them and the stars and creation repents. And as a result of that repentance, Adam is taken and washed or baptized in the Atruan Lake."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6502.24,"end":6508.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's just crazy. But, but fascinating. I mean, that's. Wow. Yeah. Right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6508.88,"end":6560.51,"speaker":"Fr Stephen De Young","text":"And so then the, the most important work of this nature that you've never heard of is called the Apocalypse of Paul, which was translated into a variety of languages, including Latin, as the Visio Poly. And the Latin version became particularly, particularly popular and important for medieval and Renaissance literature. But in the apocalypse of Paul, St. Paul is taken on a sort of, like we talked about, this astral projection tour of heaven and the heavens and the underworld, sort of to see everything and to reveal that right through St. Paul. And when he comes to the Atrusian lake, the city of God has been established. Sort of on top of it. Yeah, on top of the water."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6560.83,"end":6564.27,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Kind of. So it's like lake town in the Hobbit."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6564.35,"end":6610.04,"speaker":"Fr Stephen De Young","text":"Right. So the lake is now so still. Right. Again, it's this triumph over chaos. Right. Order to even primordial chaos of the water. It's now so flat you could build something on it. And the city of God is built on it. And those souls that are going into the city of God are purified in the waters of the atrocity and lake on the way. And there's a version of this. There's very clearly a version of the same text, but St. Paul has been switched out for the Theotokos is having this. This apocalyptic vision. And Dante actually refers to that in the Inferno at one point, Virgil refers to the time that the Theotokos came to visit."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6611.72,"end":6612.2,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6612.84,"end":6619.12,"speaker":"Fr Stephen De Young","text":"The Virgin came to visit. And he's referring to this version of the Visio Poly that had the Theotokos."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6619.12,"end":6636.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And just to reference another piece of medieval literature that I know that a lot of our listeners love, in Beowulf, the house that Grendel lives in is eerily familiar, eerily similar to some of the language that's in the Apocalypse of Paul. So there you go. Because that's where demons live is the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6638.19,"end":6643.71,"speaker":"Fr Stephen De Young","text":"So the, the. The fifth and final river is the, the coconut."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6644.51,"end":6644.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6644.99,"end":6654.19,"speaker":"Fr Stephen De Young","text":"Which is associated with woe and sadness and Morrissey and Robert Smith and Manchester, England and all of that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6654.59,"end":6656.51,"speaker":"Fr Andrew Stephen Damick","text":"So true. So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6658.35,"end":6658.67,"speaker":"Caller Pedro","text":"But."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6658.67,"end":6671.73,"speaker":"Fr Stephen De Young","text":"So the importance, the importance of the rivers is we have these five rivers, and unlike the four rivers that flow out from paradise, that flow out from the mountain, these five rivers, one of which is a river of fire, pour down into the pit."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6672.21,"end":6673.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6674.21,"end":6684.69,"speaker":"Fr Stephen De Young","text":"It's a big sort of pit of evil flowing out and providing life. Right. It's sort of parasitic and taking that life and, and taking it away."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6686.08,"end":6699.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so let's talk about a piece of underworld architecture. And with that, we're going to complete our conversation this evening. There's a palace down there. What's that all about?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6699.92,"end":6701.96,"speaker":"Fr Stephen De Young","text":"There's a castle. Yeah, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6701.96,"end":6765.9,"speaker":"Fr Andrew Stephen Damick","text":"Why would you build a castle in the underworld? Although if some of you kids out there play Minecraft, you can literally do that now. You can build castles. They call it the Nether in Minecraft. But I mean, when my kids. So my kids, they do play Minecraft once in a while, and I saw them building down in the Nether, I'm like, are you guys in the Underworld? They're like, what? So. But it is. It's really kind of curious. So, yes, there's a, There's a castle, there's a palace down in the underworld, and it's kind of funny that it should be there. On the one hand, why would you want to rule in the Underworld? Like, you know, there's. There's multiple mythologies, right, that. Where a defeated God gets kind of cast down into the underworld. You know, it's like, it's like in, in the medieval period, you know, you're. You're defeated brother or uncle or whoever, you, you. Because he's still royal blood, he's still family, you give him some really terrible estate where nothing grows, and he's, you know, he gets to have a piece of desert or something like that. Right. Or a bunch of other."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6766.39,"end":6768.79,"speaker":"Fr Stephen De Young","text":"Or a bunch of other gods conspire and murder you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6769.11,"end":6769.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6769.71,"end":6772.15,"speaker":"Fr Stephen De Young","text":"And you end up there, but at least you're the boss."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6772.55,"end":6776.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you're. You're, you're the king of the trash heap, you know?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6776.47,"end":6777.67,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6777.67,"end":6783.03,"speaker":"Fr Andrew Stephen Damick","text":"Except one, right, who seems to. He wins and he goes down there."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6783.03,"end":6818.65,"speaker":"Fr Stephen De Young","text":"Well, well, with baal, it's sort of the same thing, but he. There's a spin, right? Yes, right. There's meant to do that, right? It's. Right, so baal, right, goes up against. Goes up against Yam, the most high God, and totally wins. Totally wins. And then he just Happens to end up in the underworld and just happens to run into Moat, the God of death. And again, totally wins. Totally wins and decides, hey, this is where I want to build. My palace is down here with the dead."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6818.89,"end":6821.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Absolutely believable."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6822.24,"end":6830.32,"speaker":"Fr Stephen De Young","text":"Who wants to live on the mountain of the gods? Yeah, Those guys, they didn't appreciate me anyway. I'm gonna come down here in the trashy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6830.56,"end":6838.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so this is super important because there's actually. This is actually referenced in the scripture."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6839.12,"end":6839.48,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6839.48,"end":6841.96,"speaker":"Fr Andrew Stephen Damick","text":"Bail BAAL ruling from the underworld."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6841.96,"end":6853.07,"speaker":"Fr Stephen De Young","text":"It's referenced in Isaiah, it's referenced in Ezekiel. And so in those stories, it's not only. And next episode, we're going to talk about some more of this. There's. There's literal ridicule directed at baal."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6853.47,"end":6853.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6853.91,"end":6858.19,"speaker":"Fr Stephen De Young","text":"Because BAAL is the devil in the Old Testament. Literal mockery."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6858.59,"end":6862.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not a very ecumenical kind of language."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6862.35,"end":6885.05,"speaker":"Fr Stephen De Young","text":"Right. It's not just like, hey, we're gonna correct the record. You actually lost and that's how you ended up in the underworld. It's like, haha, like, nice try with your lame claims that you wanted that to happen. Right. Like you're a loser. You know, no time for losers. We are the champions. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6885.05,"end":6885.45,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6888.41,"end":6890.37,"speaker":"Fr Stephen De Young","text":"That'S it. Right? Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6890.37,"end":6892.01,"speaker":"Fr Andrew Stephen Damick","text":"Like, speaking of Zoroastrianism."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6892.33,"end":6916.28,"speaker":"Fr Stephen De Young","text":"Yeah. We'll talk about that more next time. But so what. What are the prominent features of this palace? If you know one thing about this palace or if you've heard one thing, whether it be having heard it from reading. Reading mythologically, or the way it's constantly referenced in. In our orthodox hypnography, is that it has brazen gates."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6916.68,"end":6918.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. Gates made of brass."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6919.32,"end":6925.72,"speaker":"Fr Stephen De Young","text":"Right. Which is. Which is counterintuitive. Right. Because if you put me in a cage made of brass, I'm going to break out pretty fast."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6926.28,"end":6931.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because brass is not that great as a, As a metal. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6931.52,"end":6932.88,"speaker":"Fr Stephen De Young","text":"Like, it's not. I."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6932.96,"end":6933.6,"speaker":"Fr Andrew Stephen Damick","text":"As. It's."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6933.6,"end":6937.2,"speaker":"Fr Stephen De Young","text":"Pretty child destroyed many a brass lamp. We'll put it that way."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6937.28,"end":6937.92,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6937.92,"end":6938.24,"speaker":"Fr Stephen De Young","text":"Like."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6938.24,"end":6942.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Brass. Brass gates are not really good gates."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6942.4,"end":6948.48,"speaker":"Fr Stephen De Young","text":"Right. So it's kind of counterintuitive. Right. Why it would be brazen. And so to get into why and what."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6948.48,"end":6950.48,"speaker":"Fr Andrew Stephen Damick","text":"Why would it be brazen, Father Stephen?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6950.72,"end":6952.4,"speaker":"Fr Stephen De Young","text":"We get to talk about giants."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6952.72,"end":6953.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6953.84,"end":6954.24,"speaker":"Fr Stephen De Young","text":"Again."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6955.2,"end":6955.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6955.92,"end":6956.45,"speaker":"Fr Stephen De Young","text":"Excited."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6956.68,"end":6959.56,"speaker":"Fr Andrew Stephen Damick","text":"Right? So it goes back to the Bronze Age. Right, okay."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6959.96,"end":6962.6,"speaker":"Fr Stephen De Young","text":"Back to the Neolithic. We're not going this time."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6962.6,"end":6979.72,"speaker":"Fr Andrew Stephen Damick","text":"No, no, yeah, it goes back to the Bronze Age. So Bronze as. As everybody remembers, because we all took metallurgy. Right. Well, chemistry. Once upon a Time. Bronze is an alloy of copper and tin, and it's a good strong metal. It's great for making weapons out of."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6979.72,"end":6980.44,"speaker":"Fr Stephen De Young","text":"And armor."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6980.84,"end":6988.68,"speaker":"Fr Andrew Stephen Damick","text":"And it becomes the definition of technology in that period. So this is what, two or three, two or three thousand years B.C."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6988.88,"end":6995.5,"speaker":"Fr Stephen De Young","text":"Right? 2500. All the way up to, you know, toward the end of the second millennium."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":6995.5,"end":7044.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, you know, just to give you some sense of what civilization was like at that time, the copper that they used in this alloy came from Cyprus. And as I learned today, that's part of the origin of the name of the. Of the. Of the island of Cyprus. Actually, it refers to copper. I did not know that until today. And the tin that's used comes from Afghanistan. So if you look at your map of the Middle east, these places are not right next to each other. It has to be shipped. So there's a lot of transportation happening. There's a whole bunch of economy occurring in order to make these things, in order to be able to make bronze, a lot of shipping, I mean, a lot. We're talking big amounts of material in order to be able to make weapons and armor. You know, those are the most important parts of bronze technology. But there's other stuff like that, and then there's what's called the Bronze Age collapse, Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7044.3,"end":7049.22,"speaker":"Fr Stephen De Young","text":"Well, in the. In the height of the Bronze Age era, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7049.22,"end":7050.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7050.74,"end":7053.86,"speaker":"Fr Stephen De Young","text":"The old world order was so connected. Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7054.26,"end":7055.9,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes. I love this example. Yes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7055.9,"end":7099.31,"speaker":"Fr Stephen De Young","text":"Hammurabi, for example, really liked cre, The Cretan style of leather sandals that the Mycenaeans used. Right. He had affection for them, and so he got them shipped to him so he could wear his Cretan sandals. Hammurabi, the Babylonian emperor who had conquered Sumer and Akkad. But Hammurabi is important because Hammurabi was one of the Martu. The Martu were this group who came from basically what's now western Syria, Lebanon, northwest northeast Palestine, and conquered Sumer and Akkad. The Martu are referred to as the Amorites in the Old Testament."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7099.55,"end":7104.91,"speaker":"Fr Andrew Stephen Damick","text":"So Amorites are Nephilim. Yeah, that's right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7105.47,"end":7173.97,"speaker":"Fr Stephen De Young","text":"So remember Og. Og was the last of the Rephaim, and his pal was Sihon, king of the Amorites. And what gave me what the Martu's claim to power, including Hammurabi, what their claim to power was, was that they held the secret knowledge from before the flood. Yeah, the knowledge that had come from the gods. The secret knowledge that had come from the gods before the flood, they still had it. And so they themselves then have this. Right. Not just as giants, but this connection to the pre flood demonic spirits, that's sort of their claim to power and fame. And so bronze is used after the Bronze Age collapse once we get into the Iron Age. Right. So we're not going to talk about the dating of the Exodus because that's also something that bores me to tears. But the Bronze Age collapse probably happened after it or was in the midst of happening. But there's. There's debate there too. It's sort of in mid. Yeah. Anyway, where exactly you peg the Bronze Age collapse is also a big debate."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7173.97,"end":7174.93,"speaker":"Fr Andrew Stephen Damick","text":"Because it didn't happen."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7175.25,"end":7176.53,"speaker":"Fr Stephen De Young","text":"It didn't happen in one day."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7176.53,"end":7177.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7177.13,"end":7186.13,"speaker":"Fr Stephen De Young","text":"See, people's invasions, the Philistines were sea peoples. Anyway, so bronze after that becomes this symbol of that old world order that."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7186.13,"end":7189.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the ancient world. Ancient wisdom. Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7189.25,"end":7216.94,"speaker":"Fr Stephen De Young","text":"Right, right. So when we get Goliath's armor, when we get Goliath's kit, sort of described to us in all this excruciating detail in First Samuel or first Kingdoms, you might wonder why. Right. Who cares how much his broad spearhead weighed? How. You know. And if you're learning Hebrew, you have to learn all these weird words you've never seen before because most of them are Greek loan words. They're Mycenaean loanwords to describe his helmet, the cobalt stuff."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7219.19,"end":7219.35,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7219.35,"end":7228.87,"speaker":"Fr Stephen De Young","text":"Because it's describing them, number one, it's all this Greek style Mycenaean stuff from before the collapse. But it's also bronze from before the collapse."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7229.03,"end":7229.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7229.43,"end":7235.19,"speaker":"Fr Stephen De Young","text":"Goliath is really tall. So this is all, hint, hint, this guy's a giant, right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7235.19,"end":7235.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7235.91,"end":7237.87,"speaker":"Fr Stephen De Young","text":"This guy's a Nephilim, this guy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7237.87,"end":7238.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7238.31,"end":7240.47,"speaker":"Fr Stephen De Young","text":"These demonic beings."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7240.87,"end":7281.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. So that's the backing then for this idea that the gates of the palace of Hades are made of brass. Because what is brass? Yeah, not bronze, but brass. Because what is brass? It is the. The pleather of the bronze world. Right. It's the fake, cheap imitation. It's shiny and pretty, but it doesn't do the job. So. So by just Exactly. Exactly. So by describing the gates of Hades as being made of brass, the scripture in our liturgical tradition is basically saying that they're made of flashy junk."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7281.35,"end":7281.71,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7281.71,"end":7282.87,"speaker":"Fr Andrew Stephen Damick","text":"That quote."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7282.87,"end":7288.07,"speaker":"Fr Stephen De Young","text":"Wisdom. Yeah, wisdom. That quote unquote, secret knowledge is trash."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7288.31,"end":7289.39,"speaker":"Fr Andrew Stephen Damick","text":"All the scare quotes."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7289.39,"end":7292.95,"speaker":"Fr Stephen De Young","text":"Yes, it's snake oil. That they're. The demons are trying to sell you snake oil."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7293.03,"end":7294.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7294.15,"end":7295.03,"speaker":"Fr Stephen De Young","text":"It's a con job."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7295.59,"end":7301.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. Yeah, exactly. So. Yeah. Right."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7301.08,"end":7346.55,"speaker":"Fr Stephen De Young","text":"And so from the perspective of the Old Testament, and this is really, where we're going to pick up next time. This palace is the devil's palace. This is where he's cast down. He's thrown down to the dust to eat the dust of the ground. That's the dust that Adam is going to return to. Indeed, Hebrews is going to refer to him in Hebrews 2:14 as the devil is the one who holds the power of death. That he is sort of the Lord of the dead, the ruler of this realm of the dead as we come to the close of the Old Testament. And this palace isn't just a palace, but it's a fortress that's not really keeping people out, but keeping people in. It's a fortress holding captives, those who, through sin, have become captive to death and to the power of the devil."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7347.43,"end":7360.2,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, exactly. So, right, so that's our tour. Kind of a real estate tour, as it were, of. Yeah, don't buy."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7360.2,"end":7361.6,"speaker":"Fr Stephen De Young","text":"Yeah, do not buy any."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7361.68,"end":7619.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's not like Minecraft, where there's valuable stuff down there. You don't want to go there. Yeah. So. All right, so what does all this really mean for us? I mean, again, this show is not just weird, cool, nerdy Bible stuff. It actually has a direct relevance to our lives. And I mean, God willing, we've mentioned some of those relevances along the way. But I just want to, you know, in terms of final comments, I think one of the most important things to get from this is that the image of the underworld as it's presented in ancient paganism and then it's picked up on in the scripture. Right, the scripture comments on it. It presents it the same image of the underworld, you know, the. The afterlife. It is an image that has no. No hope. Right. You know, sometimes people talk about various religions and they say, well, all, you know, all religions basically have the same goal. Everybody's trying to get to heaven and they're just different ideas about how you get there. That's nonsense. Ancient paganism has no concept of getting to heaven. A handful of super, super powerful important people might get elevated to go be with the gods. Right. Once in a generation maybe. But for most people, there is nothing like that. There is just simply, you go to Hades and if you're really bad, then you get to go be with the Titans down in Tartarus, the abyss. If you're, you know, really great, you get to be in the Elysian Fields, which, again, is not that great, but it's way better than being in the abyss for sure. And then ancient paganism and some Second Temple Judaism has this idea of a kind of neutralish space for the people who are just kind of, eh. But in all those cases it's still this sort of shadowy, forgetting, sad existence, barely existence, right? That's what ancient peoples understood life after death was about. That's what they understood it was about. The difference that Christianity brings is to say, not that that image is not true, but there is a way out and that is a revolution that is huge. It does not get huger when what everyone believes about the ancient world, about the ancient understanding of life after death, that this Messiah comes and says, I'm going to lift you up out of the grave. Which it's prophesied all over the Old Testament by the way. It's in the psalms, it's in lots of places, but then of course comes in fullness in the New Testament. That's huge. Right? And this is connected very much even with the day to day experience of the Christian, where our day to day experience is about the forgiveness of God, about repentance, so that we can kind of conform ourselves to that forgiveness, to really truly receive it. That's not an option for pagans. You know, I've said this many times in a lot of different places. You know, if you do something that makes your God mad in the ancient pagan world, then you have either revenge to look forward to, that the God is going to get you, or you can attempt to appease him. Right? Those are your options, Right? And you may not even be given the option of appeasement. You just, you've had it. But even if you don't particularly offend one of the gods, the hope for the afterlife is not there is no hope. There is no hope. There's just this shadowy existence, you know, and it might even be terrible. Right? But the difference with Christianity is to say that the grave is not the end. It is not the end, that the underworld is not the end, that there is something else. There is a possibility for hope, for being lifted up out of that. And not to give away too much, but that's what our next episode is going to be about. Father Stephen, final thoughts."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7621.49,"end":7842.47,"speaker":"Fr Stephen De Young","text":"Yeah, we on this show talk a lot about how the modern world and modern humanity has sort of forgotten about ritual and lost sight of it. But they haven't forgotten how to profane a time and a space. They haven't forgotten how to create hell on earth. If you're around for the 20th century, you should know that. Still very good at that. And that's because as we said, there is no neutral space. You can declare yourself secular all you want. You can deny spiritual reality all you want. When you set out to create your utopia on Earth, you're going to create hell. You're gonna create a place that's filled with demons. This was true in the ancient world when Hammurabi or Pharaoh or Sumerian Lugal built a kingdom on the back of thousands of slaves and human sacrifices. This was true when Rome created a wasteland and called it peace. This was true. But when Lenin tried it, when Hitler tried it, when Mao tried it, Anytime anyone tries it, this is the result. This is what happens when we try to create paradise under our own power is all we do is create corruption and evil. Because the opposite, bringing paradise to Earth and turning Earth into a paradise isn't something we do by ourselves. It isn't something we do by techniques. Not ritual techniques, not artistic techniques, not by tweeting the right hashtags for your hashtag activism, not by voting, not by holding up a sign at a rally. Right? God is doing it. God is in the process of turning all of creation into paradise, into filling all of creation with his presence, into setting everything in order. He's establishing justice. He's doing it. We don't have to try to do it ourselves through some technique. When we try, we do the opposite. All we need to do is to get on board with and participate in what God is doing. What he's been doing since before I was born, what he'll still be doing, most likely, unless Christ appears after I'm dead, maybe for a long time. But we need to be a part of what God is doing. And we do that through the means we've been discussing, right? If you want to change the world, if you want to transform a little part of the world into paradise, serve the liturgy, attend the liturgy, pray in your home, make your home a sacred space through prayer. Make everywhere you go a sacred space. Make every encounter you have and every interaction you have, all of your web of relationships to the creation around you, make those filled with love and mercy and gentleness and kindness, Right? Because when we do that, that's when God is acting through us. And that's when actual change happens. That's when paradise actually comes to earth. That's when space and time actually become sacred and everything is transfigured and transformed. So that's my final thought."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7843.91,"end":7868.86,"speaker":"Fr Andrew Stephen Damick","text":"Thanks. Well, that is our show for today. Thank you, everyone, for listening. If you didn't get a chance to call in during the live broadcast, we would still love to hear from you either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but can't respond to everything. But we do. Save what you send for possible use in future episodes and join us for."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7868.86,"end":7874.58,"speaker":"Fr Stephen De Young","text":"Our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7875.14,"end":7885.61,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page and join our discussion group. Leave reviews and ratings everywhere, but most most importantly, please share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7886.33,"end":7893.21,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7893.85,"end":7896.09,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you."}
{"episode_id":"LOS - #017 - 2021-04-09 - Down to Hades - A Chthonic Odyssey","start":7914.9,"end":7951.96,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
