{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":0.8,"end":65.44,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break fruit of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":67.28,"end":104.94,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Giant killers, dragon slayers, but not vampire hunters. We talked about that. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana, Cajun country. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, on the very edge of Pennsylvania Dutch land. And if you're listening to us live, you can call in at 855-AF- radio, 855-237-2346. Matuska Trudy is taking your calls tonight. Birthday. So if you call, you had better wish Matka Trudy a happy birthday. I will have her write down the names of those who did not."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":106.46,"end":111.02,"speaker":"Fr Stephen De Young","text":"Also, also, if you call in, speak quietly. I'm still recovering from Mardi Gras."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":111.1,"end":115.66,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, you do live in Louisiana, yes? Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":115.9,"end":117.18,"speaker":"Fr Stephen De Young","text":"So please call."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":117.18,"end":191.59,"speaker":"Fr Andrew Stephen Damick","text":"We'll get to your calls in the second part of the show. Lord of Spirits is brought to you by our listeners and also by Chrysostom Academy. A lot of you listeners out there work from home and if you're telecommuting, you can probably live almost anywhere. If you're a parent of school age kids and you're like me, working from a virtual office, one of your big considerations for where you live is where your kids go to school. I love living in the Lehigh Valley of Pennsylvania and part of why is because my kids go to Chrysostom Academy. I'm not kidding, it's true. And it's a pan orthodox classical school with elementary through high school students. It's on a beautiful 55 acre campus, has the highest academic standards, is focused not just on educating the mind, but forming the whole Person in Christ. So if you don't live here yet, think about moving to the Lehigh Valley and sending your kids to Chrysostom Academy. And even if you don't telecommute, our local economy is growing. There are actual jobs here, and we've got eight Orthodox parishes in our metro area. So you can visit chrysostomacademy.org, again. That's chrysostomacademy dot org to see what I'm talking about."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":192.07,"end":195.51,"speaker":"Fr Stephen De Young","text":"We could get a legion of people to head over there and make peeps."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":196.15,"end":200.63,"speaker":"Fr Andrew Stephen Damick","text":"That's true. They make peeps not too far from where Chrysostom Academy is located."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":200.63,"end":202.99,"speaker":"Fr Stephen De Young","text":"There you go. Your children will learn. You will."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":202.99,"end":210.23,"speaker":"Fr Andrew Stephen Damick","text":"Actually true. It's actually true. Also, Dwayne the Rock Johnson is from Chris is not from Chrisostom category from Pennsylvania."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":210.23,"end":211.55,"speaker":"Fr Stephen De Young","text":"That's a claim you can't back up."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":211.55,"end":224.22,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. I think he went to Liberty High School. Maybe. I'm not sure which. I don't. I'm not advertising that. Yeah. The only really big drawback if you come here and send your kids to that school is that on some level, you will have me as your neighbor."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":224.54,"end":227.9,"speaker":"Fr Stephen De Young","text":"So sorry, I've successfully disrupted everything."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":227.9,"end":272.84,"speaker":"Fr Andrew Stephen Damick","text":"Go ahead. But, yes, my wife and I love having our kids there. It's great. It's really fantastic. We're so glad. So glad it's there also. So, one more little ad. We're still selling tickets for our Lord of spirits conference on October 26 through 20 Nint 2023. Right now, only commuter tickets are available. That means you got to get your own hotel room or someplace to stay. Airbnb, whatever, because y' all have sold out the lodging at the Antiochian Village, you maniacs. You can still go to store.ancientfaith.com events to get your ticket. And there are actually not even that many commuter tickets left. Pretty nuts."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":273.08,"end":275.32,"speaker":"Fr Stephen De Young","text":"They say that Mr. Durden is building an army."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":280.96,"end":282.8,"speaker":"Fr Andrew Stephen Damick","text":"Well, the first rule of Lord of Spirits Club."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":282.88,"end":285.68,"speaker":"Fr Stephen De Young","text":"Wait, no, you can't talk about the convention."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":285.68,"end":307.61,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. Tonight. Tonight we continue our conversations on the sacraments of the Church. And we're talking about the holy mystery of unction, which can be slippery to get our minds around. What does it do? Why don't we see miracles every time it's applied is sin related, and so on. So where are we going to start this time, Father Stephen? Should we just go ahead and start with Genesis?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":308.89,"end":311.25,"speaker":"Fr Stephen De Young","text":"I think somewhere someone has probably mapped."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":311.25,"end":311.61,"speaker":"Fr Andrew Stephen Damick","text":"Out."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":313.37,"end":316.09,"speaker":"Fr Stephen De Young","text":"The broad structure of a Lord of Spirits episode."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":316.49,"end":320.41,"speaker":"Fr Andrew Stephen Damick","text":"Right there's just a generic Lord of Spirits episode out there that anyone can do at home."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":320.41,"end":421.01,"speaker":"Fr Stephen De Young","text":"Now, actual topic in the third half, starting somewhere in the murky depths of prehistory, working our way through. I did want to comment before we get started on a more serious note on the passing of Dr. Michael Heiser, which I wanted to comment on for a number of reasons. A lot of our audience is very familiar with his work. Some people have gone from reading his work to becoming part of our audience and other folks vice versa. And because we don't, other than friend of the show Bart Ehrman, we don't, we don't comment on a lot of people on the show. Right. Occasionally we get things, you know, why, why don't we, why didn't don't we talk about him? People hypothesizing various theories as to why we don't talk about him and this and that. And so with his passing earlier this week, I wanted to kind of clarify things regarding that and say a few words. As I mentioned, I at least don't like talking other than friend of the show Bart Ehrman. I don't like talking about people. I have as a general policy to be ruthless with ideas and compassionate with people. So when you don't talk about people, you just talk about ideas. It looks a lot less like a personal attack and more like just critique and give and take working out ideas."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":421.49,"end":423.41,"speaker":"Fr Andrew Stephen Damick","text":"19Th century Germans, though, are fair game."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":424.05,"end":613.22,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But even then I rarely named them. That's true. So, and, and Dr. Heiser was a firm believer in the peer review process. One of the things, obviously I didn't know him personally. As far as I know, he didn't know I existed. Right. But beyond pretty much anyone else I've encountered. Right. At academia and scholarship. Right. He thoroughly believed in the peer review process, in give and take, in hashing things out in that way in the community of scholars. He literally on his deathbed had new issues of journals on his nightstand in case he wanted to read. That's how dedicated he was to, to scholarship. And I have never and never plan on saying anything negative about his published peer reviewed scholarly work on the Old Testament, which is top notch, obviously, in terms of some of the popular stuff. He was an evangelical, I'm an orthodox priest. So we're coming at things from different perspectives and we're integrating the scholarly data in different ways in our viewpoints. There were times back in the day when I was still in the dark realm of social media where I know, and probably some people remember, I publicly disagreed with him about some things. But again, that was part of this give and take, right. When, despite my policy of not wanting on this show to get into personalities and stuff, when a scholar looks at another scholar's work and takes it seriously and thinks it's important enough to try to critique it, that's actually a compliment. That means that you have a very high impression of that person. When someone publishes garbage, you don't bother to respond to it. When someone publishes something important or put something out there that's important, that's where you step in and you critique it. So mainly I wanted to make that plain because I didn't want any more rumors and weirdness about things. And on the whole, I want to say memory eternal to servant of God, Michael departed this life and that my prayers at least will continue to be with his family and with him, since I'm Orthodox. But yeah, I just wanted to say that I didn't want to sort of pass that over in silence with his passing this week. So now we have to figure out how to get out of that mood and into our topic for tonight."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":613.86,"end":616.02,"speaker":"Fr Andrew Stephen Damick","text":"So. Needs more giggling."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":616.34,"end":617.46,"speaker":"Fr Stephen De Young","text":"Yeah, exactly."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":617.54,"end":620.26,"speaker":"Fr Andrew Stephen Damick","text":"More. We'll just recitations of the word."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":620.26,"end":625.46,"speaker":"Fr Stephen De Young","text":"Right, Right. Yeah, right, right, right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":626.34,"end":629.54,"speaker":"Fr Andrew Stephen Damick","text":"Back to Genesis. Back to Genesis we're talking about."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":629.54,"end":629.78,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":629.78,"end":630.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":630.02,"end":681.77,"speaker":"Fr Stephen De Young","text":"So we are indeed beginning at the beginning, which is a very good place to start. And so tonight we're talking about, as you mentioned, the mystery of holy unction, also known as the anointing of the sick, which is practice in the Orthodox Church. In some Orthodox churches, as mine, it is administered to everyone on Holy Wednesday or at another time in Holy Week, and is also administered to the sick. That said, the place where we're starting out tonight may not look like it's directly related to that, unless this is your first time listening. You're used to that by now."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":681.77,"end":686.05,"speaker":"Fr Andrew Stephen Damick","text":"Right, but the question is, how will they get there?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":686.21,"end":688.77,"speaker":"Fr Stephen De Young","text":"Yes, yes. That's where we're starting."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":688.92,"end":706.2,"speaker":"Fr Andrew Stephen Damick","text":"I had someone contact me recently and say, could you guys just, like, release the bits you do at the end, like, as a separate, like, clip show or whatever? And it's like, you know, I get what you're saying, I get what you're saying. But the reason why that stuff at the end is meaningful is because of the road that we walked."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":706.2,"end":708.36,"speaker":"Fr Stephen De Young","text":"Yes, to get the journey, not the destination."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":708.6,"end":714.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, man. It's the friends we made along the way."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":714.92,"end":717.51,"speaker":"Fr Stephen De Young","text":"Yeah, there we go. There I go being a surfer boy again."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":719.99,"end":720.43,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":720.43,"end":761.61,"speaker":"Fr Stephen De Young","text":"So where the play at, the place where we're starting is essentially who are you indeed? Who, Who, Who. I really want to know, anyway, and who are you? Meaning what is. What is a human person? What is a soul? What is a body? How do they relate to each other? And so to get into that, of course, we have to go back to Genesis. We have to go to Genesis, chapter 2. Genesis, chapter 2, verse 7. To the creation of Adam, the creation of man."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":762.17,"end":796.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is a passage we've talked about before in other contexts. That's the cool stuff. That's one of the cool things about especially the beginning of Genesis is you can talk about these chapters from a gazillion different angles, and they're all very fruitful. Not to mix my metaphors too much, but yes. So Genesis chapter 2, verse 7. Then the Lord God formed the man of dust from the ground and breathed into his nostrils the breath of life, and the man became a living creature. Or sometimes it's translated, he became a living soul. Right, A living soul. Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":796.62,"end":823.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And this, of course, gets quoted later by St. Paul in First Corinthians 15:45, when he compares that to the relationship between Christ to the spirit who gives life. But that's a rabbit trail we won't go down this evening because that's one of the trickiest verses in the Bible to translate."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":823.43,"end":827.03,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you're the rabbit, though, so I'm just throwing that out there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":829.19,"end":830.39,"speaker":"Fr Stephen De Young","text":"Don't know what to do with that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":830.39,"end":835.91,"speaker":"Fr Andrew Stephen Damick","text":"It's our year, man. That's what all the Chinese people tell me. Is that because it's the year of the rabbit? This is our year."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":836.47,"end":837.43,"speaker":"Fr Stephen De Young","text":"Okay, okay."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":837.83,"end":841.67,"speaker":"Fr Andrew Stephen Damick","text":"I'm just saying. Okay, yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":842.07,"end":844.55,"speaker":"Fr Stephen De Young","text":"So what is it? You say, you want me to go for it?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":844.87,"end":845.91,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no, no, no."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":845.91,"end":846.71,"speaker":"Fr Stephen De Young","text":"Okay, okay."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":846.71,"end":848.07,"speaker":"Fr Andrew Stephen Damick","text":"I was just throwing that out. Clarify."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":848.15,"end":848.87,"speaker":"Fr Stephen De Young","text":"I mean, I could."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":849.31,"end":852.19,"speaker":"Fr Andrew Stephen Damick","text":"On some future episode where we're feeling like we need to go for four hours."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":852.43,"end":879,"speaker":"Fr Stephen De Young","text":"Okay, so what do we see here? Right, so he becomes a living being, a living soul. Right. When the. When the breath of life is breathed into him. Right. And so I'll just. I'll. I'll say early on, sorry, platonists, you're really going to take it on the chin for this one. So the soul here is not a thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":880.44,"end":883.88,"speaker":"Fr Andrew Stephen Damick","text":"It's not a glowing orb that rises up out of your chest when you die."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":884.2,"end":949.38,"speaker":"Fr Stephen De Young","text":"It's not shaped in any way. Yeah. Or a green mist that Shang Tsung eats. Right? No, it's not a thing. It's not an object. Right. So you have. Adam's body is formed, and then that form that Body is given life. And so nefesh in Hebrew. Right. Sikhi in Greek is a way of referring to that life, the life of the living thing. And so, as we mentioned before on the show, everything that's alive has a soul, Right. If you are animate. Yeah. If you're animate, you have a soul. Pun intended for you Latin speakers, animate and inanimate literally means souled and soulless in Latin. But there are different types of souls, right? So, yes, animals have souls. No, those souls are different than human souls, Right. They're not identical."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":949.86,"end":951.46,"speaker":"Fr Andrew Stephen Damick","text":"Your dog has a dog soul."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":951.94,"end":952.42,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":952.99,"end":953.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":953.23,"end":984.43,"speaker":"Fr Stephen De Young","text":"And your tree has a tree soul. So what that reveals, right. When we talk about the type of soul, the type of life that is in a particular type of body. And particular type of body is exactly the kind of language that St. Paul uses in 1 Corinthians 15 to talk about animals and people. The type of life that's in that particular type of body is directly related to that body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":986.65,"end":989.29,"speaker":"Fr Andrew Stephen Damick","text":"You can just trade out souls, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":989.37,"end":1001.01,"speaker":"Fr Stephen De Young","text":"They can't, like, migrate back and forth between ghost in the shells and cats and a human or Freaky Friday, so. Well, that's two humans, but we'll get there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1001.01,"end":1002.21,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's true."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1002.21,"end":1020.08,"speaker":"Fr Stephen De Young","text":"Still. So this shows that that life, right. The life of that body being a particular type of life also reveals that the soul, that life, is an organizing principle of that body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1021.92,"end":1042.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. And often when that's being discussed, the word spirit gets used because, you know, see the spirits episode, right, where we talked about spirit as being the kind of. As the animating force, the organizing principle, the thing that's pulling everything and making it go, so to speak. I don't want to use a puppet metaphor too much, but you know what I mean."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1042.61,"end":1057.73,"speaker":"Fr Stephen De Young","text":"Yeah. You know, you could. You could. So you could groom a wolf to look like a German shepherd. Right, Right. But it would still be a wolf, not a dog part, because it has wolf soul, not dog soul."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1057.73,"end":1058.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1058.05,"end":1059.53,"speaker":"Fr Stephen De Young","text":"And when it's overly specific."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1059.53,"end":1061.09,"speaker":"Fr Andrew Stephen Damick","text":"But it's hungry like a wolf."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1061.41,"end":1061.89,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1061.97,"end":1063.01,"speaker":"Fr Andrew Stephen Damick","text":"Not like a dog."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1063.73,"end":1099.21,"speaker":"Fr Stephen De Young","text":"That was a dog. So the. The. The. The type of life, the type of soul that is in the body organizes. Right. The body. And if you stopped grooming that wolf, it would go back to looking like a wolf. And. And, you know, the acorn will always grow into an oak tree. It will never grow into a fig tree. Right. Because what it is, is already there in the life that it has, even as the body changes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1099.61,"end":1108.69,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I have each of those in my yard, and the acorns that the oak tree gives off never become fig trees. So I've done this with Science can."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1108.69,"end":1110.65,"speaker":"Fr Stephen De Young","text":"Verify many such cases."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1111.05,"end":1111.61,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1114.97,"end":1140.52,"speaker":"Fr Stephen De Young","text":"And so this is why. Right. So sometimes. And we've. We've brushed over this before in previous episodes, sometimes there are places, arguably in the Scriptures, definitely in. In the Church Fathers, where the soul and the spirit are or are not distinguished from each other."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1140.92,"end":1147.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, in patristic models, you get both. You know, human beings are body and soul. And then also you get. Human beings are body, soul and spirit."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1148.02,"end":1196.69,"speaker":"Fr Stephen De Young","text":"Yes. Or even body and spirit once in a while. But so what's. What's going on there? And so I think we've at least once had a caller ask us that question, like, which is it? Right. And so what we have to remember here is that just because you make a distinction in speech, that doesn't mean there's an actual distinction. Right. So, you know, you will see things like when the Church Fathers are talking about the Trinity, and they'll talk about, like, a ray of the sun and its warmth and its light. Right. Like you could talk about those things separately. You talk about the warmth of the sun and the light of the sun. Right. But in reality, those are not really two separate things."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1198.06,"end":1198.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1200.46,"end":1221.82,"speaker":"Fr Stephen De Young","text":"Right. So. But you're able to distinguish those in speech. And so sometimes. Right. The. The Fathers, when they separate soul and spirit as two different things, they're making that kind of distinction. That doesn't mean that they're actually two separate things, because neither of those is a thing in the sense that we think about material objects. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1221.9,"end":1222.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1224.47,"end":1235.83,"speaker":"Fr Stephen De Young","text":"And when that distinction is made, it's a distinction between just the life of something and life as that organizing principle."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1236.55,"end":1237.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1237.19,"end":1263.64,"speaker":"Fr Stephen De Young","text":"So if you go back to our episode on what is a spirit when it's at home. Right. We talk about how a spirit is sort of an organizing principle, like a higher level of collective consciousness. Right. And so that organizing principle aspect is what they're calling spirit when they separate the two."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1264.2,"end":1264.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1265.16,"end":1271.48,"speaker":"Fr Stephen De Young","text":"And the soul is referring to just the life of the thing itself. Right. But you don't have to distinguish those."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1271.72,"end":1293.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, it's. It's maybe analogous but not identical to, you know, I'm me, but then I'm also a father. But I and my being a father are not two different things. You know, I'm still me when I'm acting in a fatherly way, but that's. You know, we can talk about. We could talk about it, but it's still me."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1293.22,"end":1297.46,"speaker":"Fr Stephen De Young","text":"The Whole time it's still husband, you father, you son, you are not different use."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1297.7,"end":1298.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1298.26,"end":1301.78,"speaker":"Fr Stephen De Young","text":"They're partitioned from each other, but you could speak. We could speak about them separately."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1302.02,"end":1302.9,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1303.46,"end":1304.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1307.69,"end":1308.21,"speaker":"Fr Andrew Stephen Damick","text":"So that's."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1308.21,"end":1319.45,"speaker":"Fr Stephen De Young","text":"That's kind of what's actually going on with the soul. So you can't picture a soul. Right. It doesn't look like anything is the life of a body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1321.05,"end":1321.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1321.77,"end":1343.44,"speaker":"Fr Stephen De Young","text":"So when we're. If you. If you've seen what, someone or something die, what we're identifying what. What's called a soul is the difference between the thing when it was alive and the thing when it's dead, the thing that's gone, which is not a material thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1345.2,"end":1350.24,"speaker":"Fr Andrew Stephen Damick","text":"Right. Well, we'll talk a little bit more about why it's hard to talk about that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1351.12,"end":1351.52,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1352,"end":1353.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1353.32,"end":1384.77,"speaker":"Fr Stephen De Young","text":"So what tends to happen, especially in languages like Latin and English, Both of them have a bad tendency to do this. This is why Heidegger said you could only do philosophy in Greek and German. Not. That's not because he was at all. Yeah, well, you know, he was a native German speaker and his Greek was better than his Latin. So, you know, there might have been some influence there. But the. But English and Latin tend to reify things. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1384.77,"end":1387.01,"speaker":"Fr Andrew Stephen Damick","text":"It's just the way that it kind of tends to work and."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1387.17,"end":1388.05,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1388.13,"end":1392.19,"speaker":"Fr Andrew Stephen Damick","text":"And with English, we've got articles to make it even. Even were possible."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1392.67,"end":1405.55,"speaker":"Fr Stephen De Young","text":"Right. And this causes all kinds of theological problems if you're not careful. Right. So people all the time in English will talk about Christ's human nature and his divine nature."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1406.27,"end":1408.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As though they're like separate things where his."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1408.87,"end":1437.8,"speaker":"Fr Stephen De Young","text":"That makes it sound like they're doing bits like they're two things. And that's Nestorianism. That's bad. Right. Or talk about a soul as if it's a thing. Right. In. In this particular case. And that language is deceptive and plays into some bad conclusions like the ones come to by Plato and John Calvin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1438.12,"end":1442.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's going to be a whole lot of sorry Plato and sorry Calvin and even some sorry origin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1443.01,"end":1443.41,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1443.73,"end":1445.33,"speaker":"Fr Andrew Stephen Damick","text":"This part of the podcast, we're going."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1445.33,"end":1469.89,"speaker":"Fr Stephen De Young","text":"To be apologizing a lot. There's a lot of sorrys. A lot of sorrys. This is how politics works. And the reason I rope in Jean Calvin is that he famously, to the chagrin, to be fair, of many Calvinists, but he quoted as true Plato's statement that the body is the prison house of the soul."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1471.71,"end":1472.27,"speaker":"Fr Andrew Stephen Damick","text":"Oh, John."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1473.63,"end":1476.99,"speaker":"Fr Stephen De Young","text":"Not his best moment by anyone's standards."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1479.15,"end":1479.55,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1481.95,"end":1494.75,"speaker":"Fr Stephen De Young","text":"He. He, you know, by doing that was buying into a lot of of bad presuppositions. Because of course for Plato, the soul is the self."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1495.88,"end":1497.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's who you are."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1497.4,"end":1502.04,"speaker":"Fr Stephen De Young","text":"Right. You are your soul, which is in a body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1503.88,"end":1505.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like you're like it's a big mech."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1506.44,"end":1506.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1507,"end":1510.44,"speaker":"Fr Andrew Stephen Damick","text":"You're inside, you're pulling some levers embodied."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1510.44,"end":1514.04,"speaker":"Fr Stephen De Young","text":"But that's not a particularly good thing. In fact, it's kind of a bad thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1514.28,"end":1515.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1515.72,"end":1549.16,"speaker":"Fr Stephen De Young","text":"And that's why it's a prison house. Right. And the goal is to get out. Right. And so there are a number of things in Plato that flow from this and that have been sort of wholesale adopted in, in Western thought. Like the idea that the soul is immortal. And by that we don't mean that we think souls vanish and disappear or something at some point, but the idea that the soul is innately immortal."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1549.5,"end":1552.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not able to be destroyed or to die."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1552.78,"end":1580.79,"speaker":"Fr Stephen De Young","text":"It's not able to die. Right. And there are extreme forms of that when you veer into Gnosticism. Right. Where it's some spark of. It's some element of God himself. Right. Like some element of the divine essence in each person or something. Right. But there's less extreme versions which is just that the soul is, is, is immortal in and of itself. Right. Not related to. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1581.11,"end":1588.91,"speaker":"Fr Andrew Stephen Damick","text":"Say that leads to all kinds of other conclusions like that they pre exist this human life, you know, they're immortal."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1588.91,"end":1589.83,"speaker":"Fr Stephen De Young","text":"And go on forever."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1590.07,"end":1594.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Looking at you Origin. Looking at you Mormons, you know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1595.27,"end":1598.87,"speaker":"Fr Stephen De Young","text":"Well, to be fair to the Mormons, the Mormons did do think they came into being at a point."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1599.03,"end":1603.24,"speaker":"Fr Andrew Stephen Damick","text":"That's true, that's true, that's true. Yeah. Sorry Mormons."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1603.32,"end":1609.84,"speaker":"Fr Stephen De Young","text":"So it's a little different. They do believe they pre exist embodiment, but not the way Plato and Origin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1609.84,"end":1611.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We do have some Mormon listeners actually."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1611.68,"end":1611.92,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1611.92,"end":1612.68,"speaker":"Fr Andrew Stephen Damick","text":"Hey, Mormons."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1613.32,"end":1614.44,"speaker":"Fr Stephen De Young","text":"Yeah. So be fair."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1615,"end":1615.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1616.68,"end":1642.56,"speaker":"Fr Stephen De Young","text":"But so that those are more or less unsubtle ways of, of doing the pre existence of the human soul. There are more subtle ways. Right. So for example, one of the more subtle ways would be again in Calvinism, where the human soul essentially pre exists in the divine decree."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1645.12,"end":1648.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's in the mind of God. And so therefore it has an existence."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1648.8,"end":1695.06,"speaker":"Fr Stephen De Young","text":"Within the divine decree in the eternal mind of God. Not only just sort of a general sense of a person is going to come to exist, not just like God knows what's going to happen, but that person's actual character, every action they're going to take in their life, everything they're going to do, whether they're elect and going to go to heaven or reprobate and going to go to the bad place. All of that is reality before they come into being. Right. And so this is a more subtle way to do that, which is. Which is not ultimately less. Less problematic."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1695.62,"end":1696.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1696.26,"end":1735.19,"speaker":"Fr Stephen De Young","text":"And because what it leads to in any of those cases, and this is why I'm bringing Calvinism into that, it's not just to slander it and call them plate. Slander them and call them plateness, it's because in. In any of those cases, what you end up with is the. And again, the Mormons, there's some nuance here, but you end up with human life on this earth just being the playing out of the identity of the soul that already exists. So essence, pre. Your essence precedes your existence."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1737.73,"end":1755.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And so, you know, this actually has a lot of. I mean, this all sounds very philosophical and metaphysical. Whatever. Everybody but it. But it actually has some actual practical ways that this gets played out. And the way that people think of themselves and the way they try to lead their lives and the way that they do their relationships."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1755.97,"end":1758.21,"speaker":"Fr Stephen De Young","text":"Yes, right. So we even talk about this."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1758.85,"end":1759.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1759.89,"end":1760.93,"speaker":"Fr Stephen De Young","text":"People who are pregnant."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1762.41,"end":1762.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1763.85,"end":1766.09,"speaker":"Fr Stephen De Young","text":"And their male spouses. Sorry, everybody."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1771.45,"end":1775.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. So I mean, people will talk about, like, I need to find out who I really am."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1775.93,"end":1779.13,"speaker":"Fr Stephen De Young","text":"Yeah. Oh, I was gonna say, I can't wait to meet this person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1779.93,"end":1782.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right. I can't wait to meet them, get."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1782.13,"end":1787.51,"speaker":"Fr Stephen De Young","text":"To know who they are. Right. They're a fetus. They aren't anybody yet. They're a fetus."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1787.98,"end":1788.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1788.3,"end":1791.1,"speaker":"Fr Stephen De Young","text":"They're human, but they don't have like a personality."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1791.9,"end":1793.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1793.26,"end":1796.3,"speaker":"Fr Stephen De Young","text":"They don't have a favorite flavor of ice cream. Right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1797.58,"end":1799.42,"speaker":"Fr Andrew Stephen Damick","text":"They don't have a favorite Shakespearean play."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1799.74,"end":1812.94,"speaker":"Fr Stephen De Young","text":"Yes. As much as I'm sure you've tried when. When your wife was pregnant to play Kenneth Branagh Productions, sort of at them in utero to get them to pick one."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1814.39,"end":1815.87,"speaker":"Fr Andrew Stephen Damick","text":"Hey, Much Ado About Nothing is a."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1815.87,"end":1836.87,"speaker":"Fr Stephen De Young","text":"Brilliant piece of modern cinema. Okay. I enjoy it also, but come on, man, at least go for Baby Mozart or something. So, yeah, the idea that these things about you already exist and they just kind of play themselves out. You just figure them out as you go through life."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1837.43,"end":1837.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1838.07,"end":1839.75,"speaker":"Fr Stephen De Young","text":"You're a good person or a bad person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1840.47,"end":1873.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Or even like this plays into the whole idea of like soulmates, for instance. You know, I'm meant for this one other person because this is who we are from all eternity or whatever. I actually. One of my favorite Non Middle Earth things that were ever said by. By J.R. tolkien is. He said, the soulmate is the person you're actually married to. I love that because it's about the. The way that things actually are. Not living in this virtual reality about how you think about things, but, you know, life as it really is."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1874.27,"end":1878.07,"speaker":"Fr Stephen De Young","text":"Yeah. Except for me and my wife, who are like Hawkman and Hawkwoman."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1878.07,"end":1878.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So there's."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1879.79,"end":1881.07,"speaker":"Fr Stephen De Young","text":"But, yeah. For most people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1881.55,"end":1882.51,"speaker":"Fr Andrew Stephen Damick","text":"For most people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1883.31,"end":1903.1,"speaker":"Fr Stephen De Young","text":"So non Thanagarians. So, yeah. And so there's this idea then. And it's everywhere, right? It's everywhere. This is who I. I need to figure out who I am. I need to reveal who I am. I'm confused about who I am. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1904.38,"end":1909.02,"speaker":"Fr Andrew Stephen Damick","text":"Or this is just who I am, which is a way of saying I can't and won't repent."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1909.42,"end":1924.54,"speaker":"Fr Stephen De Young","text":"Yeah. So this has actual consequences, this view. Right. Of the person being the soul. The soul already existing and being immortal and then it just finding itself in a body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1926.14,"end":1926.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1929.26,"end":1953.67,"speaker":"Fr Stephen De Young","text":"So there are consequences of this when we jettison that view, that Platonic view, and get down to. No, the soul is just the life that is in your body. Right. That is animating it. Right. And one of them is. And I know you loved this phrase when I told it to you earlier, if you weren't you, you wouldn't be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1955.99,"end":1960.71,"speaker":"Fr Andrew Stephen Damick","text":"It's very similar to one of my other favorite phrases. Wherever you go, there you are."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1960.95,"end":1967.99,"speaker":"Fr Stephen De Young","text":"Yeah. But here's what this means. This goes beyond. You don't know what it's like to be a bat."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1968.79,"end":1970.83,"speaker":"Fr Andrew Stephen Damick","text":"This is the next level, everybody. So write this down."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1970.83,"end":1977.65,"speaker":"Fr Stephen De Young","text":"This is the next level of battiness. And cosplay is if you weren't you, you wouldn't be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1978.77,"end":1980.53,"speaker":"Fr Andrew Stephen Damick","text":"How do you cosplay that? I don't know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":1981.73,"end":2017.64,"speaker":"Fr Stephen De Young","text":"Creativity. So what that means is, right, we sit and we think and we fantasize. Right. And we were like, what if I had been born in 16th century France? Right. What if I had been born in, you know, the Roman Empire? What if I had been born, you know, in pick. Right. 19th century Russia. Right. We fantasize, we think about it. But here's the sad truth. You're doing the same thing as imagining what it would be like if you were a bat."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2018.68,"end":2019.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2019.24,"end":2035.12,"speaker":"Fr Stephen De Young","text":"Or because you're assuming Freaky Friday. Yeah. You're assuming that your formed identity would just be sort of taken out of your current self, would be deposited in some body in that place and time, which isn't how that works."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2036.16,"end":2053.84,"speaker":"Fr Andrew Stephen Damick","text":"Right. Human beings are muy permeable that's what I get for trying to start with the Spanish word permeable. You're not exclusively a product of your environment or whatever, but you're not a product of your environment. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2054.88,"end":2063.21,"speaker":"Fr Stephen De Young","text":"So if you. If quote, unquote, you had been born in 16th century France, that would be a different person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2063.77,"end":2066.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you'd be much more like the other 16th century French people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2066.65,"end":2069.85,"speaker":"Fr Stephen De Young","text":"Yes. There is no way in which that person would be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2070.73,"end":2071.29,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2073.53,"end":2080.65,"speaker":"Fr Stephen De Young","text":"There's not. Even if you find a photo of someone from a couple centuries ago that looks like you, that's still not you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2081.53,"end":2082.97,"speaker":"Fr Andrew Stephen Damick","text":"They could be time traveling you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2084.01,"end":2106.41,"speaker":"Fr Stephen De Young","text":"It could be time traveling you from the future. It could be that Nicholas Cage is a vampire, but probably, you know, in general cases, it's not you. Right. And this means that what we're getting at here is that actually your body is more related to your identity than your soul is."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2109.62,"end":2114.18,"speaker":"Fr Andrew Stephen Damick","text":"You have to unpack that one. Because I'm sure a lot of people are going, what? Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2115.22,"end":2118.66,"speaker":"Fr Stephen De Young","text":"Human souls are more like each other than human bodies are."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2119.3,"end":2125.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's the life of the body. Like the. Yes, the genitive is. Yeah, it goes the worst way."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2125.54,"end":2157.91,"speaker":"Fr Stephen De Young","text":"Human life force. Right. It's human life that is in your. That is in your body. Right. And so this, if you want a place where this comes out in theological history. Right. This becomes really important, this idea of the soul becomes really important in the debates regarding Pollinarianism."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2158.31,"end":2180.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, quick review for everybody who hasn't been reading about the early heresies. Apollinarianism was a teaching, and this is the basic version of it, that Christ did not have a human soul. Instead, the Logos, the word of God, functioned as the controlling element of his body, basically."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2180.83,"end":2190.46,"speaker":"Fr Stephen De Young","text":"Right, right. And this was held by ancient people and by certain quasi Christian apologists on the West Coast. See, I don't name people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2190.86,"end":2194.7,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Some other guy that uses three names all the time."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2197.9,"end":2199.74,"speaker":"Fr Stephen De Young","text":"So, yeah, it's weird. Anyway."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2202.06,"end":2204.78,"speaker":"Fr Andrew Stephen Damick","text":"Your middle name isn't Duh. Even Duh."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2205.34,"end":2241.67,"speaker":"Fr Stephen De Young","text":"It's D. It's D. My middle name is D. D. So why is that relevant to this? Well, the perspective from which Apollinarians are coming is essentially a sort of Platonic view of what a soul is. So for them, if the soul is the self, if the soul is the person, if the soul is the identity. Right. And you say that Christ had a human soul. Then for them, you're saying, well, then he was what, two people?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2243.13,"end":2244.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2246.73,"end":2252.41,"speaker":"Fr Stephen De Young","text":"Right. And aforementioned unnamed person makes a similar kind of argument."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2253.37,"end":2283.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm trying to come up with one analogy again, just an analogy. Everybody that seems to work in my mind is, you know, you could have a computer with a motherboard. Right. And that's. This is sort of the concept in some ways of the way we think about human souls and bodies. You know, the motherboard is the thing that's really making the computer go. And if you pull it out, you could put in a different one, it'll function differently. But I think souls are more like batteries, although you can't just switch them out. So that's where the analogy falls to, people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2283.44,"end":2285.36,"speaker":"Fr Stephen De Young","text":"Yeah. No, it's more like the power itself."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2285.6,"end":2287.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. There you go. Yeah, yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2287.52,"end":2288.64,"speaker":"Fr Stephen De Young","text":"It's more like the power itself."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2288.64,"end":2289.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the power."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2289.36,"end":2296.56,"speaker":"Fr Stephen De Young","text":"So, yeah, you can see how. Why the Apollinarians have a problem with that view of the soul. Right. But if you understand that the soul is just the life of the body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2297.64,"end":2297.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2297.96,"end":2307.08,"speaker":"Fr Stephen De Young","text":"Then of course, Christ had a human soul. He had a human body and human body. He's alive, Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2307.4,"end":2307.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2307.96,"end":2310.84,"speaker":"Fr Stephen De Young","text":"So definitionally, he had a human soul."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2310.84,"end":2327.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And human bodies are not animated by anything but human souls. Like, there's not some other way to do it. Which strongly suggests then, I mean, because we can imagine other ways to do it. Right. We have these things in our literature. Apollinarianism is, in fact, theologically a zombie jamboree."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2328,"end":2406.62,"speaker":"Fr Stephen De Young","text":"Yes. A dead man's party. Leave your body at the door. Yeah. So this decision here regarding Apollinarianism, again, in addition to the idea that the soul is not the identity. Right. Of the person. Right. It's not the self that it is the life force of the body. Right. This also means there's nothing conflicting. Right. Because the divine person of the Logos is also not a soul. Right. A soul is a different thing. He's not an identity or a center of consciousness. Right. The. The Logos, the sun is a divine person who takes upon himself human nature, which includes a human body, a human soul. Right. Those. Those things. But there is no sort of extra self in there somewhere. Right. Or the divine person of Logos is not something that could be slotted into a body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2408.12,"end":2409.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2409.72,"end":2421.76,"speaker":"Fr Stephen De Young","text":"Right. So in case I haven't made enough people grumpy at me, Right. This includes biological sex."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2421.76,"end":2426.44,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry, and by that we mean the state of being male or female."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2427.4,"end":2429.16,"speaker":"Fr Stephen De Young","text":"Right. In terms of biological sex."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2429.4,"end":2444.14,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which I should point out, by the way, and I don't have my jingle geared up here, but the word sex itself, it's etymologically related towards like sect and section. It means difference. It's. It's different."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2444.14,"end":2444.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2445.06,"end":2451.3,"speaker":"Fr Andrew Stephen Damick","text":"There is no sex that's literally same sex. Is. It means same. Different."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2451.54,"end":2453.7,"speaker":"Fr Stephen De Young","text":"Well, now you're really just trying to get."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2453.78,"end":2456.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm just putting that out there. Just putting that out there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2456.86,"end":2471.18,"speaker":"Fr Stephen De Young","text":"But yeah, no, it includes. It includes what? So if you are an animate human body, Right. And if your soul is not some center of the self or some kind of. Right. Like you aren't other than your body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2473.42,"end":2473.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2475.5,"end":2484.46,"speaker":"Fr Stephen De Young","text":"You can have feelings and experiences like that, and people do. Right. But that is not because, like, there's some kind of mismatch."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2485.66,"end":2486.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2486.46,"end":2497.58,"speaker":"Fr Stephen De Young","text":"Right. You can't actually, sorry, Nietzsche, Be born out of time. Right. You can't be born in the wrong time because if you were in another time, you wouldn't be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2498.54,"end":2500.7,"speaker":"Fr Andrew Stephen Damick","text":"Or in the wrong. Whatever."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2500.86,"end":2501.9,"speaker":"Fr Stephen De Young","text":"Or in the wrong body."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2502.3,"end":2503.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You are what you are."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2504.06,"end":2505.82,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Because you wouldn't be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2506.46,"end":2506.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2508.22,"end":2512.14,"speaker":"Fr Stephen De Young","text":"It would be someone else. Right. And there are other people in the world."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2515.67,"end":2516.31,"speaker":"Fr Andrew Stephen Damick","text":"I've heard that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2516.71,"end":2564.28,"speaker":"Fr Stephen De Young","text":"Yes. Who are those other people? Who you would be had you been born where they are. So. And so this also means that we, as inanimate as a living human body, Right. We in that sense. Right. We're an object in the world that other people see and encounter. Right. And interact with. So when someone sees me, like when I walked into the church this evening, and a parishioner, who I won't name was, was on her way out because she doesn't want to be mentioned on the show, when she saw me, she did not see my soul."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2566.34,"end":2568.14,"speaker":"Fr Andrew Stephen Damick","text":"I see your soul, Father Stephen."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2568.14,"end":2610.31,"speaker":"Fr Stephen De Young","text":"She did not see my inner identity, my inner self. She did not behold my essence. Right. She saw the living human body in the world. That is me. That's what she saw. That's what made various noises and gestures at her that she interpreted as speech. Right. Like that's. That's what. And that's how we relate to and. And see each other. And this reality. Right. That we are living human bodies. Right. Is why relics are a thing. See our relics episode."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2610.95,"end":2616.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because those. Those pieces are that person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2618.15,"end":2635.41,"speaker":"Fr Stephen De Young","text":"Yes. This is why when the scriptures talk about what we call the intermediate state, right. Or the. The state of the soul after physical death. Right. This is why everything is so vague and nebulous."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2635.97,"end":2641.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even we've got the language of being hid with Christ. Your life is hid with Christ."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2641.81,"end":2649.01,"speaker":"Fr Stephen De Young","text":"Yeah. Or all the language about sleeping. Like, we don't. We don't. The Orthodox Church doesn't teach soul sleep. But that language is certainly all over the place."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2649.58,"end":2649.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2650.14,"end":2658.46,"speaker":"Fr Stephen De Young","text":"Right, Right. This is why it's so ambiguous and nebulous. Right. Because this is a weird and unnatural thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2659.02,"end":2660.78,"speaker":"Fr Andrew Stephen Damick","text":"It's not how we were made to be."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2661.18,"end":2713.35,"speaker":"Fr Stephen De Young","text":"Right. Human beings were not created to die physically or spiritually. Right. And so it can't be nailed down. If you go with the Platonist view, and this may be one of the things that makes it attractive to folks, then that whole thing makes sense. Right. If an orb sort of goes out of my chest, like negative man, and flies up into the. Into heaven or goes down into the ground. Right. And we have this image of, you know, our shadowy self or force, ghost or orb or whatever, is floating around in one place or another and then returns to our body in the resurrection. I mean, that's still weird, but, I mean, it's easier to wrap our head around, whereas the language of scripture, you, frankly, just. You can't nail it down at all. Which is exactly what you would expect if the other is actually what's true."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2713.59,"end":2738,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we use metaphorical language. We talk about the soul taking a journey after death. We use that. We talk about the soul going into the underworld or the soul going in to be with God or into Abraham's bosom. But ultimately it's metaphorical language. I mean, it's okay to use it, but we need to understand that it's not ghosts wandering around, you know?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2739.28,"end":2739.68,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2739.68,"end":2742.16,"speaker":"Fr Andrew Stephen Damick","text":"No ectoplasm being left in a trail."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2742.72,"end":2743.12,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2743.28,"end":2745.44,"speaker":"Fr Andrew Stephen Damick","text":"We talked about this on the spirits episode."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2746.08,"end":2750.56,"speaker":"Fr Stephen De Young","text":"And this is why the bodily resurrection is so concretely important."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2751.76,"end":2752.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2753.37,"end":2768.81,"speaker":"Fr Stephen De Young","text":"Right. That the. For you to be you. Right. For you to live forever, you have to be back in your body, otherwise it wouldn't be you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2770.33,"end":2771.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2772.09,"end":2783.36,"speaker":"Fr Stephen De Young","text":"And so your identity requires you. Maintaining your identity requires the bodily resurrection. Right. This is ultimately why the reincarnation dog don't hunt."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2785.11,"end":2798.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's not. And it's funny because a lot of the reincarnation doctrines include this idea of losing your memory of who you were before. Right. Which says that you're not really you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2800.31,"end":2802.15,"speaker":"Fr Stephen De Young","text":"Right. You're not actually that person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2802.87,"end":2805.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. You're functioning as a. You are a different person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2805.35,"end":2806.15,"speaker":"Fr Stephen De Young","text":"Like, it doesn't."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2806.15,"end":2807.19,"speaker":"Fr Andrew Stephen Damick","text":"It wouldn't be the same."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2807.35,"end":2808.15,"speaker":"Fr Stephen De Young","text":"It doesn't work."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2808.15,"end":2808.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2808.47,"end":2809.03,"speaker":"Fr Stephen De Young","text":"It doesn't work."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2809.03,"end":2814.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not. Sorry. Indigo Girls. It's not, how long till my soul gets it. Right. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2814.4,"end":2819.12,"speaker":"Fr Stephen De Young","text":"And you will. This is also why that whole uploading your brain to a computer thing will never work."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2821.28,"end":2823.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Actually, no. Thank God."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2823.76,"end":2833.2,"speaker":"Fr Stephen De Young","text":"Right. Because what will happen is you will die and a computer simulation AI with your memories will have the experience of waking up inside a computer."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2836.16,"end":2839.87,"speaker":"Fr Andrew Stephen Damick","text":"Usually that's the point where there's some kind of disembodied scream, but that ain't you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2839.87,"end":2841.39,"speaker":"Fr Stephen De Young","text":"You're dead in all the sense."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2841.87,"end":2845.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Because. Yeah. It's not you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2847.15,"end":2896.99,"speaker":"Fr Stephen De Young","text":"So. Yeah. So a question that might arise that we might anticipate from this. Right. There's a couple. One, one might be, you know, wait, are you now, are you now turning around, over against the whole theme of your show and telling us that. That there is no spiritual element of humanity? Answer that is, of course, no. We already talked about soul, spirit. We talked about how, go back to the Noose episode, how human persons interact with the spiritual world. There is of course a spiritual element of man. But another one might be, and this is related that, you know, we keep saying, sorry, Calvinists, but haven't we kind of smuggled in a kind of determinism?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2897.71,"end":2907.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. If. If the material is the real you, does that mean that you are just the product of a bunch of chemical reactions and such?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2907.91,"end":2925.03,"speaker":"Fr Stephen De Young","text":"Yeah. Cause and effect. Biological. Right. Biological determinism. Right. If I had been born in that family, I'd be that person. Right. And that's true at the start. Yes. If you had been born in that family instead of that person, you would be that person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2925.75,"end":2926.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2929.11,"end":2937.31,"speaker":"Fr Stephen De Young","text":"Like if 47 years ago I had been born the son of Father Andrew's parents, I would be him and I wouldn't be him."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2937.31,"end":2937.91,"speaker":"Fr Andrew Stephen Damick","text":"That's gross."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2939.99,"end":2961.75,"speaker":"Fr Stephen De Young","text":"Sorry, throw that out there. But that would have happened, right? Like, and I would be a different person. But. But if you've been paying attention to what we've already said, that doesn't mean that I would have done all the things that Father Andrew did."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2962.95,"end":2963.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2965.35,"end":2971.19,"speaker":"Fr Stephen De Young","text":"That doesn't mean I would have made all the same decisions. It doesn't mean I would have made all the same choices."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2973.76,"end":2974,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2974.48,"end":2983.68,"speaker":"Fr Stephen De Young","text":"Because part of the fact that my life isn't just the playing out of what I already am is that I'm then free."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2984.8,"end":2985.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":2986.08,"end":3000.72,"speaker":"Fr Stephen De Young","text":"And the way, for example, Father Dimitri Staniloy says this is, he talks about this as being one element of humanity, as imaging God."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3002.18,"end":3002.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3002.34,"end":3042.7,"speaker":"Fr Stephen De Young","text":"Is that just as God is absolute, meaning undetermined. Right. Free. God is not bound by anything. Sorry, Calvinists, with your justice thing. God is not bound by anything. Right. Humans as imagers of God, according to Father Stanley, are in some degree, a lesser degree, a lesser degree also absolute able to separate themselves from the material system of of causation, of cause and effect, and make actual choices."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3043.82,"end":3053.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, not to give too much ammunition to that Eugene guy, but I mean, this is actually part of Tolkien's anthropology in."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3053.34,"end":3054.26,"speaker":"Fr Stephen De Young","text":"Oh, why, though?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3054.65,"end":3056.97,"speaker":"Fr Andrew Stephen Damick","text":"I know. I mean, what can I say? But, I mean, this is something that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3056.97,"end":3057.45,"speaker":"Fr Stephen De Young","text":"A lot of people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3057.53,"end":3060.77,"speaker":"Fr Andrew Stephen Damick","text":"Something a lot of people have read. You know, it's a moderately popular set."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3060.77,"end":3064.25,"speaker":"Fr Stephen De Young","text":"Of books, I guess. I watched the movies once."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3064.49,"end":3065.61,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3068.33,"end":3071.69,"speaker":"Fr Stephen De Young","text":"Not the Lord of the Rings. The Hobbit ones. The Hobbit ones. My favorite."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3072.49,"end":3080.09,"speaker":"Fr Andrew Stephen Damick","text":"They really should have just called those the Dwarves, because that's what those movies are about. But that is not this podcast."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3080.43,"end":3083.39,"speaker":"Fr Stephen De Young","text":"That and Forbidden Love. Go ahead."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3085.87,"end":3088.03,"speaker":"Fr Andrew Stephen Damick","text":"If I have any goats with me tonight, you have them."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3088.19,"end":3091.99,"speaker":"Fr Stephen De Young","text":"No, that was the best part of those movies was that relationship. Anyway. Go."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3091.99,"end":3095.63,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Is that where it. Woman hooks up with a dwarf?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3095.63,"end":3096.83,"speaker":"Fr Stephen De Young","text":"Is that how that triggered."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3097.15,"end":3174.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No. So, yeah, Tolkien, like the one. The thing that distinguished one of the big things that distinguish humans from elves in his world is that, you know, there's the music, which is sort of the blueprint for creation from the very beginning. And humans have the ability to go outside the music. Like, they can do stuff that's unexpected even to the Valar, who are sort of the angelic beings in Tolkien's world, whereas elves can't do that. And it's why humans have this sort of redemptive capability that no one else does. It's interesting how deeply Christian all that stuff is. How about that? But. But yeah, it's. It's. It's interesting that, you know, that. That, I mean, he. He messes around a lot with the whole idea of fate and free will. And one of the constants in. Is that humans, even though they're not omnipotent, you know, they're not. They're not universally capable. They do have free will. They can actually do unexpected things, things that are unexpected not to God, but to pretty much everything else in the whole creation. So. Yeah, and that's true. That's for real. So. All right, well, we're going to go ahead and take our first break, and we'll be back in a moment with the second half of the Lord of Spirits."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3175.24,"end":3191.54,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23723. That's 855 AF radio."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3196.58,"end":3235.67,"speaker":"Announcer","text":"What is the spiritual significance of alms giving? In the new booklet Spiritual Transformation and giving. Bishop Alexei of Sitka and Alaska draws from a wealth of patristic and modern sources to explore why God commands us to give, what motivates people to give or hold back, what spirit should characterize our giving and the result of spiritual transformation that occurs in our heart when we give. Find spiritual transformation and giving@store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3237.43,"end":3253.61,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3254.65,"end":3332.09,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. Give us a ring at 855F RADIO. You know, with all this, this who question we keep asking, there's two things I wanted to mention. Number one, I once, when I'm, during my stagehand days, I actually worked a the who concert. So I think was like 1997, maybe, which is before some of y' all were even born. And although their drummer was Zack Starkey, the son of Ringo Starr, the other thing I want to mention is that the very first line in Hamlet, since I already mentioned Shakespeare, the very first line in Hamlet is, who's there? Who's there? And when I took a Hamlet course as an undergrad, we spent three and a half weeks on who's There? Which every time I say that in the presence of my wife, she'll be like, oh. But it was one of the best three and a half weeks that I've ever had in my educational experience. So I'm just throwing that out there for all the English lit nerds. Who's there? You don't have anything to say to that, Father? Or maybe he stepped out. It's all mine. Here we are, Lord of Spirits. Just Father Andrew, Stephen Damick. No, Father Stephen DeYoung. What could happen? We don't know. All kinds of things that could happen."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3333.77,"end":3334.45,"speaker":"Fr Stephen De Young","text":"Things are happening."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3334.45,"end":3334.81,"speaker":"Announcer","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3336.01,"end":3340.97,"speaker":"Fr Andrew Stephen Damick","text":"He's back. I was ad libbing. You didn't hear the brilliance that I just threw out at everybody. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3341.29,"end":3342.97,"speaker":"Fr Stephen De Young","text":"Need to run longer commercials."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3346.65,"end":3350.34,"speaker":"Fr Andrew Stephen Damick","text":"I know. We'll have a talk with Trudy about that. Happy birthday, Trudy."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3350.5,"end":3352.9,"speaker":"Fr Stephen De Young","text":"There's got to be something we can advertise, for Pete's sake."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3353.14,"end":3368.42,"speaker":"Fr Andrew Stephen Damick","text":"I know. Yes. I was just mentioning I once spent three and a half weeks studying the first line of Hamlet, which is who's there? Very, very relevant to all these questions we've been asking about who and the who."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3368.98,"end":3370.26,"speaker":"Fr Stephen De Young","text":"So was that a stunt?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3371.86,"end":3385.74,"speaker":"Fr Andrew Stephen Damick","text":"No, not at all. Talking Shakespeare. No, see, that's the other thing. That's the other thing. One of the other things I'm nerdy about that people actually don't generally know if they listen to my podcast, that I'm a super big Shakespeare fan."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3386.7,"end":3392.62,"speaker":"Fr Stephen De Young","text":"Yes. Something Rotten in Denmark podcast from Ancient Faith Ministries. Amen."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3393.58,"end":3394.94,"speaker":"Fr Andrew Stephen Damick","text":"The Poisoned Chalice."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3395.82,"end":3402.55,"speaker":"Fr Stephen De Young","text":"Yeah, when you ever get tired of that Roland guy, it's an idea. Shove him aside and go Shakespeare."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3402.71,"end":3422.51,"speaker":"Fr Andrew Stephen Damick","text":"That's right. No more medieval. We're doing Renaissance now, boys. Yeah, yeah. Okay. Welcome back. Anyway, it's the second half. We just got through doing a whole 48 minutes of sorry, Calvinists, sorry, Plato, Sorry, Origen, sorry. Yeah, mostly Plato. Yeah, a little bit more Plato."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3422.51,"end":3428,"speaker":"Fr Stephen De Young","text":"Brain idealism is lame, Flea. Plato, Brain Plato."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3428,"end":3430.56,"speaker":"Fr Andrew Stephen Damick","text":"Some kind of wide eyed idealist or."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3431.76,"end":3434.08,"speaker":"Fr Stephen De Young","text":"He'S an idealist in the truest sense."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3434.08,"end":3439.44,"speaker":"Fr Andrew Stephen Damick","text":"The original. I have an idea of Plato maybe still the best."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3441.36,"end":3449.04,"speaker":"Fr Stephen De Young","text":"This is one of those parts where we're just like riffing and there are people out there like typing angry reviews and comments about this show."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3449.04,"end":3453.86,"speaker":"Fr Andrew Stephen Damick","text":"Could be 50% shorter if you cut out all the giggling, all of these sayings. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3453.86,"end":3454.78,"speaker":"Fr Stephen De Young","text":"All the nonsense."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3455.02,"end":3456.06,"speaker":"Fr Andrew Stephen Damick","text":"All the nonsense."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3458.54,"end":3461.54,"speaker":"Fr Stephen De Young","text":"And then other people will reply and say, but we're here for the nonsense."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3461.54,"end":3470.14,"speaker":"Fr Andrew Stephen Damick","text":"We love the nonsense. We're here for it. Yeah. So okay, but enough now. We're actually, now we're actually moving into. We're getting closer now to our topic."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3470.46,"end":3471.38,"speaker":"Fr Stephen De Young","text":"Oh, to our topic."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3471.38,"end":3473.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, a little bit closer. Yeah. Healing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3474.54,"end":3493.27,"speaker":"Fr Stephen De Young","text":"Healing, yes. Our second half. Right. So we've talked now about what a human person is. Now we're going to get into what it means for a human person to find healing. And so of course the concept of healing is found throughout the scriptures."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3493.99,"end":3495.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, kind of everywhere."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3496.71,"end":3528.92,"speaker":"Fr Stephen De Young","text":"But there are, I think, two significant phases that we can identify in terms of how healing is talked about in the scriptures. One being an early phase in ancient Israel, the other coming later in Israelite history and then flowing into the New Testament. And this is not a change in the sense that there was sort of one view and that was abandoned in place of another view."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3529.56,"end":3531.56,"speaker":"Fr Andrew Stephen Damick","text":"No, it's just a question of perspective."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3532.25,"end":3532.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3532.65,"end":3538.33,"speaker":"Fr Andrew Stephen Damick","text":"Looking at the same, you know, like one is kind of from 50,000ft and the other is kind of zoomed in."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3538.65,"end":3578.8,"speaker":"Fr Stephen De Young","text":"Right. And keeping both, as we're going to see when we get to the end of this half, I make a promise to you, dear listener. Keeping them both together is going to be important. Right. The way that the two connect to each other is going to be important. So we'll start with that sort of first phase, the Ancient Israelite phase. And we're starting in the Torah, really, with this phase and the way in which illness, Sickness. Right. Ill health, lack of health is talked about in this early phase is in terms of plague."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3579.36,"end":3581.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So mass bad health."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3582.56,"end":3605.42,"speaker":"Fr Stephen De Young","text":"Yes. So waves of pestilence or plague coming upon populations and spreading. And one of the earliest places we see that is actually in the form of a sign that's given to Moses by God before he is sent to speak to Pharaoh, to demand that Pharaoh let the Israelites go."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3605.58,"end":3609.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is one of the weirdest. It's a weird, weird thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3611.1,"end":3617.42,"speaker":"Fr Stephen De Young","text":"So we don't have to talk about the staff turning into a snake and eating the other snakes because everybody listened to the Battle Wizards episode."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3617.73,"end":3618.69,"speaker":"Fr Andrew Stephen Damick","text":"That was a cool episode."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3618.69,"end":3645.82,"speaker":"Fr Stephen De Young","text":"And so they know that that was a traditional ancient Near Eastern wizard duel. But the other sign that Moses is given, where he puts his hand into his coat and pulls it out and it's leprous. Right. It's infected with a plague. And then he puts it back in the coat, pulls it out, and it's healed. And so what is this one about?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3646.3,"end":3646.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3646.86,"end":3652.7,"speaker":"Fr Stephen De Young","text":"Why? I mean, it's a cool trick, but, I mean, that's not why God gives signs."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3653.42,"end":3661.82,"speaker":"Fr Andrew Stephen Damick","text":"No, right. Yeah. Like, if you're going to come up with some spectacular thing to show you're a powerful sorcerer, like, this is not the one that you would pick."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3662.62,"end":3689.03,"speaker":"Fr Stephen De Young","text":"I mean, you didn't have Moses go and pull a quarter out from behind Pharaoh's ear. This isn't just tricks. Right. This is to show not just the power of God, but something specific about the power of God. Because, of course, the purpose of these signs, even though God not only knew they weren't going to work, but told Moses they weren't going to work before he went and did them for Pharaoh."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3689.75,"end":3690.55,"speaker":"Fr Andrew Stephen Damick","text":"Encouraging."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3690.95,"end":3703.06,"speaker":"Fr Stephen De Young","text":"Yeah. It's not going to work, but go do it. Is that Pharaoh had no reason to respect the God of a bunch of slaves."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3704.42,"end":3718.38,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because not only out of, like, his pride or whatever, but also, like, think about this. If you remember the spirit ideas, they're a bunch of slaves, so how great can their controlling spirit really be? Like, if this is the best he."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3718.38,"end":3723.46,"speaker":"Fr Stephen De Young","text":"Can do for them in Pharaoh's mind. Right. Mine are clearly better because I have enslaved you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3725.12,"end":3728.8,"speaker":"Fr Andrew Stephen Damick","text":"My gods empower me. And your God is really not great."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3729.28,"end":3740.48,"speaker":"Fr Stephen De Young","text":"Right. And so this is showing the power of God, but showing a specific power of God that God has control over. Plague. God has control over plague."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3741.36,"end":3745.6,"speaker":"Fr Andrew Stephen Damick","text":"Plagues, of course. Plague. The Ancient world. And that's tough."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3745.68,"end":3747.12,"speaker":"Fr Stephen De Young","text":"There was a plague of plagues."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3747.2,"end":3755.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's. It's uncontrollable. It's, you know, everybody feels helpless. It's the worst. It's really, really bad. I mean, we."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3755.61,"end":3759.25,"speaker":"Fr Stephen De Young","text":"We all know what that's like, Right. And this was. Well, through history, right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3759.25,"end":3759.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3759.57,"end":3765.81,"speaker":"Fr Stephen De Young","text":"I mean, we had a pandemic, but. And I know a lot of people died, but sorry, folks. Compared to like the black plague."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3766.45,"end":3766.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3766.81,"end":3768.77,"speaker":"Fr Stephen De Young","text":"Where it's like Covid was not the black plague."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3768.85,"end":3774.21,"speaker":"Fr Andrew Stephen Damick","text":"One third, I think, of the population dies in the Europe. Yeah, Europe. That's a lot."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3774.69,"end":3835.33,"speaker":"Fr Stephen De Young","text":"Right. And so what is this vision then? Of what disease, what ill health, what plague, what pestilence is? Well, it's this force out there in the world. There's this force that's out there active in the world that could come and visit destruction upon you or that maybe there might be some way to ward it off to either stop a plague once it starts, or to ward it off and keep plague from befalling you and go befall someone else instead. Right. And this force out there in the world had a name in the ancient near east, this demonic force of pestilence was called Reshef or some very close variation with those consonants. Right. In the ancient world. And when I say in the ancient near east of the ancient world, I mean pretty much everywhere and over a long period of time."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3836.45,"end":3837.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, long period of time."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3838.61,"end":3850.13,"speaker":"Fr Stephen De Young","text":"So the earliest inscriptions we have about Reshef are in Syria and from the third millennium B.C. so the 2000s B.C."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3850.53,"end":3853.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. So that's 4,000 years ago."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3854.29,"end":3857.3,"speaker":"Fr Stephen De Young","text":"Yes, roughly. More like 4,500, frankly."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3857.54,"end":3858.58,"speaker":"Fr Andrew Stephen Damick","text":"Four and a half thousand."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3858.58,"end":3911.38,"speaker":"Fr Stephen De Young","text":"Yeah, about 4,500 years ago. And then we have mentions in Ugarit, in Syria, in Anatolia, meaning Turkey, like the Hittites in South Central, what's now Turkey, Egypt. The Egyptians assimilate Reshef, which is very rare for them to assimilate a Semitic God from outside. The Carthaginians have Reshef. We'll talk a little detail about that in a minute. All the way up to Cicero in the first century BC Mentions the Phoenician Apollo, who he calls Apollo Arsippus. If you look at the consonants of Arsipus, it's Reshef."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3911.86,"end":3912.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. You got the R."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3916.34,"end":3920.18,"speaker":"Fr Stephen De Young","text":"Right. And there are depictions of Apollo that match depictions of Reshef."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3920.82,"end":3933.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So we're talking basically 2500, 3000ish years of belief in this demonic presence."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3934.1,"end":3934.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3934.58,"end":3944.62,"speaker":"Fr Andrew Stephen Damick","text":"Which I mean, again, plagues are a big deal. Big, big deal. In the ancient world, they rock everybody's world in a really awful way."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3945.34,"end":3972.39,"speaker":"Fr Stephen De Young","text":"To give you an idea of how prominent he was throughout this period, there's a treaty between Philip of Macedon, who you might know as Alexander the Great's dad, and Hannibal of Carthage, the elephant guy, in the 4th century BC. And in that, one of the gods invoked from the Carthaginian side is Reshef."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3974.31,"end":3975.27,"speaker":"Fr Andrew Stephen Damick","text":"That's not nice."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3976.31,"end":3983.79,"speaker":"Fr Stephen De Young","text":"Well, and it's a way of. The idea is, if I violate this treaty, may plague fall apart."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3983.79,"end":3987.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A curse. Yeah. Like a big curse come upon me. Yeah. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":3987.87,"end":4016.15,"speaker":"Fr Stephen De Young","text":"Because these. These treaties, these covenants have blessings and curses. Right. Kind of like Deuteronomy. So how is Reshef depicted? Reshef is always depicted as an archer. This is common across all these cultures. And he has these arrows that are often depicted as kind of fiery burning arrows. But the burning is aimed at the idea of infection. Right. Someone who has an infection has. Runs a fever."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4016.79,"end":4017.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4018.63,"end":4083.96,"speaker":"Fr Stephen De Young","text":"Their body becomes hot. And so the image of Reshef as this force behind plague is that he. He comes to an area, he launches his arrows, you know, into the population. They hit indiscriminately. Right. The way the plague does, and strike people down. Right. So when we say he's worshiped and stuff. Right. He's invoked. It's a curse there. And the worship is more sort of the warding off. Right. We keep him happy, we ward him off. We keep him at a distance. Maybe try to get him to go after our enemies if it'll help us. Right. And so there are a lot of places in the Old Testament, in the scriptures as a whole, where this imagery shows up. We're not going to go through all of them. We went through a little bit of Reshef stuff in another previous episode, and I know we talked about at least the job passage that we're not going to talk about tonight there, but we're going to talk about a few passages that either directly mention Reshef or allude to him in the Old Testament to make a particular point."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4084.6,"end":4115.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Part of the reality, of course, is that as we're all reading translations of the Bible, often what happens is these names get translated according to what the. The name means. Like, it'll be like, for instance, if, you know, if you're transiting the New Testament, you come across the apostle I'm named after, instead of saying, you know, and Andrew brought, you know, the. The boy with the five loaves and the two fish, it says, and the manly one brought, you know, like that. That would be what's. What's going on there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4115.49,"end":4118.09,"speaker":"Fr Stephen De Young","text":"Yeah. And it's deliberate in a lot of cases."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4118.41,"end":4118.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4118.85,"end":4123.88,"speaker":"Fr Stephen De Young","text":"Modern translations, it's trying to demythologize the text."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4124.36,"end":4178.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And admittedly, these names mean this thing that the God is associated with, but, like, there's a reason for that. You know, It's. It's all kind of bound up as one. One image, you know, so. Yeah. So the first example is Deuteronomy, chapter 32, verses 23 and 24. And I will heap disasters upon them. I will spend my arrows on them. They shall be wasted with hunger and devoured by Reshef and Ketev. I will send the teeth of beasts against them with the venom of things that crawl in the dust. And Reshef there, like, if you were looking at the esv, it'll say he's devoured by plague. And then Ketev, poisonous pestilence. So that's why you don't see Reshef and Ketev, probably if you pull your Bible off the shelf and look at Deuteronomy 30, depending. Yeah. I mean, maybe. Who knows?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4179.78,"end":4191.78,"speaker":"Fr Stephen De Young","text":"But we should also mention here Ketev. And there's also a Deborah, who are other sort of demonic forces associated with disease and pestilence who get paired a lot, as you'll see in some of these, with Reshef."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4191.78,"end":4223.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's another one, Psalm 78. 48. And this is the Psalm. So this is much later after this happens. But it's talking about the plague sent on Egypt. He gave over their cattle to the hail and their flocks to Reshefs, which. So in the esv, that gets translated as thunderbolts, so a little bit less of a literal translation, but again, it's like that God threw reshefs at them. Right. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4223.03,"end":4229.79,"speaker":"Fr Stephen De Young","text":"Their flags on Egypt. Right. God is kind of unleashing these. These forces on them."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4229.79,"end":4235.58,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Okay. So another one is Habakkuk, chapter three, verses three through five."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4235.74,"end":4238.42,"speaker":"Fr Stephen De Young","text":"Habakkuk being everyone's favorite book of the."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4238.42,"end":4241.26,"speaker":"Fr Andrew Stephen Damick","text":"Bible, Avakum, as it were."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4241.58,"end":4242.94,"speaker":"Fr Stephen De Young","text":"There's cool stuff in there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4243.18,"end":4244.54,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4244.94,"end":4245.74,"speaker":"Fr Stephen De Young","text":"Under read."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4246.78,"end":4266.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, so verse 3. God came from Teman and the Holy One from Mount Paran. His splendor covered the heavens, and the earth was full of his praise. His brightness was like the light rays flashed from his hand. And there he veiled his power. Before him went Debor, and Reshef followed at his heels."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4269.01,"end":4294.55,"speaker":"Fr Stephen De Young","text":"We just heard verses three and Four, a bunch of times in church, by the way, paying close attention. But notice in the last verse, in verse five. Right. So it's talking about sort of God in His majesty, like, processing. Right. And before him goes Deborah. After him is Reshef. So they're like pets he has on a leash."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4295.03,"end":4295.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4297.51,"end":4301.67,"speaker":"Fr Stephen De Young","text":"Right. They're forces that are under his. Under his control. And this is."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4302.31,"end":4316.13,"speaker":"Fr Andrew Stephen Damick","text":"Say we saw that kind of thing before with Leviathan. The idea that, you know, Leviathan is even, despite being this primordial massive underwater sea serpent, is also like his cat that he sort of plays with. Right, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4317.17,"end":4333.41,"speaker":"Fr Stephen De Young","text":"And so in these quotes, you see that it's not denying that this force exists out in the world. Right. But it's placing this force under the control of Yahweh, the God of Israel. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4333.81,"end":4335.89,"speaker":"Fr Andrew Stephen Damick","text":"That's the whole hand in the coat thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4335.89,"end":4380.02,"speaker":"Fr Stephen De Young","text":"Yeah. And as we've said before on the show, this is a major element, theodicy in the Old Testament in the Hebrew Bible is that God is in control of these things, even these things which are evils, and he uses them to his ends to bring good out of them. And so since he has control of them, you can have an exorcism prayer, like Psalm 91 or 90 in the Greek numbering, which is the first of the Davidic exorcism prayers found at Qumran, is also in the book of Psalms in our Bibles."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4381.38,"end":4393.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well. And isn't that verse. Isn't that Psalm used in the orthodox funeral service as well? Yes. He that dwelleth under the shadow of the Almighty shall see. I'm blanking now. Suddenly on it shall abide in the."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4393.46,"end":4395.5,"speaker":"Fr Stephen De Young","text":"Shelter of the God of Heaven."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4395.5,"end":4396.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4396.26,"end":4397.22,"speaker":"Fr Stephen De Young","text":"Our English translation."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4397.42,"end":4416.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, There we go. Yeah. So Psalm 91:5 or 95, if you're looking at the Greek version, you will not fear the terror of the night, nor the arrow that flies by day. And it's not. Nor the Reshef that flies by day. It does say arrow there literally, but it's a reference to that. Reshef the bowman."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4416.3,"end":4444.55,"speaker":"Fr Stephen De Young","text":"And if you go into the next verses, you get Deborah, you get these other people who hang around with him all the time. And the other things we've. We've read. And then probably the last time, not. Probably the last time that we see Reshef sort of in person, as it were in the Bible, is in the Book of Revelation, in which he is one of the four horsemen of the Apocalypse."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4444.87,"end":4464.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we have to do a whole episode on that, I think, at some point. Yeah. So Revelation 6:1. This is where you get the horsemen includes this line. And I looked, and behold a white horse and its rider had a bow, and a crown was given to him, and he came out conquering and to conquer."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4466.8,"end":4472,"speaker":"Fr Stephen De Young","text":"Right. So note the bow. And this is the horseman who's generally called Pestilence."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4472.4,"end":4473.4,"speaker":"Fr Andrew Stephen Damick","text":"Pestilence, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4473.4,"end":4485.58,"speaker":"Fr Stephen De Young","text":"You have war, famine, Pestilence, and death. Right. As the four horsemen of the Apocalypse. This is Pestilence. How is he getting identified as Pestilence? There's nothing about disease there. It's the bow."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4485.74,"end":4487.1,"speaker":"Fr Andrew Stephen Damick","text":"The bow, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4487.58,"end":4560.95,"speaker":"Fr Stephen De Young","text":"And Reshef. Right. And so this last image of the horsemen riding out as the seals are broken is of God in judgment, essentially, unleashing everything, letting it go. And the character that that gives to God's sort of final judgment at the end is that it's not that God goes and does these horrible, brutal things to people, it's that God stops protecting them. There's been this period of time. This is another piece of biblical theodicy. There's been this period of time where God has been protecting people and preserving people to give them time to repent. But eventually that time for repentance comes to an end and he lets things go. Right. And they go to their. To their end. So it is in the context of the removal of protection, not God inflicting harm or violence."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4561.27,"end":4568.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. God's not throwing the arrows himself. He's letting this. Letting this force go."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4568.55,"end":4571.67,"speaker":"Fr Stephen De Young","text":"Yeah. And why is this force in the world? Because of human sin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4572.55,"end":4573.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4576.47,"end":4614.16,"speaker":"Fr Stephen De Young","text":"So that's sort of this first stage where plague, disease, ill health. This is a force, a kind of. With a name. Right. It's a force. It's a demonic force in. In the world. Then as we transition into the latter era, frankly, to the period of exile and afterward, and start moving toward the second Temple period, we start getting examples already in the Old Testament, specifically with the prophets Elijah and Elisha, of sort of what we would think of as more traditional healings."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4614.96,"end":4621.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it kind of zooms in now on individual people, in many cases, being."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4621.64,"end":4626.84,"speaker":"Fr Stephen De Young","text":"Healed by other individual people. Yeah, By God through other individual people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4626.84,"end":4645.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, Elijah and Elisha. The big things about them are, you know, raising people from the dead. That's huge. That's. You know, we're used to reading the Bible. We might think, oh, yeah, a lot of people get raised from the dead, but no, that's huge. Someone comes back."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4645.91,"end":4663.19,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. So there's the raising of the widow's son, raising of the shunammite. Woman's son by Elisha. So Elijah does it, then Elisha does it. Right. And then there's the healing of Naaman, the leper by Elisha."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4663.8,"end":4671.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, go dip yourself in the muddy Jordan river, he complains. Aren't there much nicer rivers? Dip yourself in the river, dude."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4671.16,"end":4698.93,"speaker":"Fr Stephen De Young","text":"Syria. Yeah. Right. But so he's healed of his leprosy, Right. So this is God healing a person through the prayers, the intercession. Right. Through another person. And in these cases. Right. So like, the leprosy that's afflicting Naban is not personalized. There's not sort of an exorcism that's done. And dipping yourself in the Jordan does not have the character of an exorcism."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4699.81,"end":4700.21,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4700.37,"end":4719.65,"speaker":"Fr Stephen De Young","text":"It has a character of cleansing or purification. Right. Even though it wasn't up to his standards in terms of water purity. Right. And there's not sort of. There's no mention, Right. Like there is, say, in Tobit, Right. There's no mention that the widow's son or the Shunammite son, that some demon was involved somewhere. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4721.83,"end":4724.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. They're just sort of subject to these kinds of effects that are in the world."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4725.51,"end":4795.98,"speaker":"Fr Stephen De Young","text":"Right, right. And so this is really, this. This kind of healing is dealing with the effects of illness, disease, death, decay, pestilence. On the body of a person. Right? On the person. Right. So to make a comparison, right, you look at, for example, we've talked a couple times on the show about Korah's rebellion, right? When Korah stood up against Aaron and his family, who had been designated as high priests. Korah and his family were other Levites. They said, hey, aren't all the Israelites holy? Aren't we all priests? Why are you putting on airs? Right? And not only does the ground swallow them up, but this plague breaks out in the camp, right? There's this outbreak of plague. People start dying. They go, and the priests go, and Aaron goes. And they take their sensors and they go and stand between the living and the dead, and the plague is stopped. Right. That's very clearly a depiction of plague as this evil spiritual force, this demonic force."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4796.46,"end":4797.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4797.18,"end":4856.75,"speaker":"Fr Stephen De Young","text":"That needs to be stopped by priestly action. Right. That's very different. Right, again, than what we see here with the healing of the person. Right. And there's a direct parallel here to the way the Bible talks about sin. Right. Especially the way, say, St. Paul talks about sin. As we've said many times on the show, most of the time, the vast majority of the time, when St. Paul talks about sin, it's in the singular. He talks about sin, not sins, Right. When he's talking about particular acts, he usually calls them transgressions or iniquities or just translated in different ways. Right. But he's referring to acts, but when he talks about sin, so we have sin is this force in the world, the way sin was crouching at Cain's door, Right. There's this force of sin that's at large in the world that needs to be wrestled with and struggled with. It's trying to master you. You must master it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4857.06,"end":4857.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4858.02,"end":4962.66,"speaker":"Fr Stephen De Young","text":"At the same time. Right. The scriptures do talk about, and even St. Paul sometimes talk about sins, the individual actions committed by people and their consequences on those people, on their relationships with other people. Right. Those are. Those both exist in terms of sin and those both exist in terms of sickness. Right. In terms of disease, in terms of ailments. Right. There is this demonic force out there of plague, of pestilence, of disease. Right. That is out there in the world. Right. That has to be. Be put off that we pray to God, priestly action. There are prayers. Right. And then there is the actual healing that has to happen with the individual person from the consequences of that. Right. And so the fact that these are so conceptually parallel. Right. When we get to the Gospels and we get to Christ's healings, of course, all the people Christ heals, there's too many to list. Right. Even as long as we run this program, we could not run through every person Christ heals and not be here for at least until tomorrow. But. Right. One thing that you can notice, at least on several occasions, like Luke 5, 17, 26, Matthew 9, 18 Mark 2, verses 1 through 12. Right. Which all happen to be the healings of paralyzed people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4964.27,"end":4964.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4966.35,"end":4978.67,"speaker":"Fr Stephen De Young","text":"One thing that you can notice is that Christ in his healings in those cases, explicitly connects the forgiveness of sins to the healing he's doing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4979.39,"end":4982.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Let your sins be forgiven, take up your bed and walk."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4983.55,"end":4998.8,"speaker":"Fr Stephen De Young","text":"Right. That these are. These are directly connected. So sin and disease are really paralleled in their biblical conceptions. Right. Sin is talked about like disease. Disease is talked about like sin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4998.8,"end":4999,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":4999,"end":5013.76,"speaker":"Fr Stephen De Young","text":"They're talked about these parallel ways. Right. So then once again, questions potentially arise. Are we faith healers? Just speaking for myself. No."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5014.32,"end":5022.57,"speaker":"Fr Andrew Stephen Damick","text":"Positively confess you're healing Father Stephen. See, my friend Michael Lansman has taught me how to speak this way."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5023.77,"end":5027.93,"speaker":"Fr Stephen De Young","text":"He's a bad influence, so."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5027.93,"end":5028.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5028.17,"end":5031.41,"speaker":"Fr Stephen De Young","text":"So I, at least, am not a faith healer. I will let Father Andrew answer for himself."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5031.41,"end":5032.65,"speaker":"Fr Andrew Stephen Damick","text":"I know I'm not."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5036.41,"end":5046.09,"speaker":"Fr Stephen De Young","text":"But so why. Right. And what do we mean by faith healer? We're not just using that as a pejorative. Right. Or talk about certain grifters of the 1990s."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5047.55,"end":5057.07,"speaker":"Fr Andrew Stephen Damick","text":"And we also are not, in this case referring to saints who. We're going to address this, but who heal people through prayer. That's not what we're talking about."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5057.15,"end":5069.27,"speaker":"Fr Stephen De Young","text":"Right. We're talking about the phenomenon in. What would you say, primarily in Pentecostal and charismatic circles, though not entirely, but."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5069.27,"end":5074.67,"speaker":"Fr Andrew Stephen Damick","text":"Primarily and especially kind of the word faith. Pentecostalism, particularly."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5075.09,"end":5090.01,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that's. And that's not limited to Protestantism. Right. There are other groups. There are groups within Roman Catholicism. There are other groups that are in that Pentecostal charismatic mold and plenty of Protestants who aren't."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5090.01,"end":5090.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5092.61,"end":5102.36,"speaker":"Fr Stephen De Young","text":"So that idea that you can sort of claim healing, Right. Or that if your belief, if your faith is strong enough, you will be healed."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5102.91,"end":5105.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Believe harder and boom."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5105.63,"end":5121.63,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And there's even. This kind of thing exists outside of Christianity. Right. Like the secret and all that stuff. Right. Like where that's taken to a weird pagan place. Right. Of sort of visualizing and declaring reality. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5125.15,"end":5125.55,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5125.79,"end":5135.87,"speaker":"Fr Stephen De Young","text":"Well, wait, if we're saying that sin and illness are so similar and so parallel, why don't you do that? Well, you can't do that with sins either."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5137.63,"end":5142.75,"speaker":"Fr Andrew Stephen Damick","text":"Right. You can't just. I declare myself forgiven. I claim this forgiveness."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5143.31,"end":5145.31,"speaker":"Fr Stephen De Young","text":"I declare victory over this temptation."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5145.87,"end":5151.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which I mean. Yeah, Right. People say that stuff, but the truth is that repentance takes work."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5151.71,"end":5160.09,"speaker":"Fr Stephen De Young","text":"Yeah. And you have about the same track record, I imagine, of declaring victory over addiction and declaring someone healed."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5160.97,"end":5161.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5161.61,"end":5163.13,"speaker":"Fr Stephen De Young","text":"Probably about the same success rate."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5163.61,"end":5172.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You actually gotta work at it. You gotta be reformed. And I'm not saying you have to be reformed. You've gotta be reformed."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5172.57,"end":5173.53,"speaker":"Fr Stephen De Young","text":"Formed again."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5173.85,"end":5175.21,"speaker":"Fr Andrew Stephen Damick","text":"Formed again. That's right. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5175.93,"end":5197.73,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So receiving forgiveness. Right. Is it just like a declaration? It requires repentance. It requires work. Right. See our recent repentance episode. There are things you have to do. And in the same way, health. There are things you have to do."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5199.89,"end":5201.25,"speaker":"Fr Andrew Stephen Damick","text":"That's the way it normally works."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5201.41,"end":5207.99,"speaker":"Fr Stephen De Young","text":"Yes. You can't just declare yourself healthy. You can't just declare yourself forgiveness. You can't."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5207.99,"end":5212.35,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I've never seen anyone declare. Declare weight loss. That would be a trick."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5212.51,"end":5213.79,"speaker":"Fr Stephen De Young","text":"I do that every morning."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5215.23,"end":5216.19,"speaker":"Fr Andrew Stephen Damick","text":"That's working out for."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5216.51,"end":5228.59,"speaker":"Fr Stephen De Young","text":"You can see my track record. Right. So. Right. But also. Also, you can't just pray for it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5231.15,"end":5231.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5232.63,"end":5248.15,"speaker":"Fr Stephen De Young","text":"So we would say, right, that if. If you're diagnosed with something or if you have a condition or there's a health problem. Right. And you don't seek any kind of medical intervention, you just pray about it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5248.23,"end":5248.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5249.51,"end":5258.84,"speaker":"Fr Stephen De Young","text":"That is exactly as problematic as I have sinned against someone and all I do is pray by myself about it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5259.87,"end":5261.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like if I steal your car."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5262.27,"end":5262.67,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5262.67,"end":5264.63,"speaker":"Fr Andrew Stephen Damick","text":"God, please forgive me. I'm going to keep the car."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5264.63,"end":5303.25,"speaker":"Fr Stephen De Young","text":"But God, please forgive me. Don't return the car. Don't apologize. Don't try to just, you know, just pray about it and feel better. Right. Again, that's not how either of those work. Right. So then. Right. Why do we pray? Well, we're going to get more into that. Why do we pray for healing? Right. Because saying don't just do it doesn't mean don't do it at all. Right. But that's because God works through means. God heals a lot of people through medications and through doctors."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5304.13,"end":5315.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because ultimately he provided all that stuff. He provided the doctor's ability to gain that knowledge. He provided the raw material like he provided, you know, everything."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5315.04,"end":5320.24,"speaker":"Fr Stephen De Young","text":"Yes. And he forgives in the sense of healing and restoring a lot of sin."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5321.2,"end":5321.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5321.56,"end":5323.6,"speaker":"Fr Stephen De Young","text":"Through kind words, shared meals."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5325.04,"end":5340.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even repentance is described as being a gift from God. It doesn't mean he zaps you and says, bam, now you're repenting. It's okay. Here's how you repent. Here's all the means you need. And it's going to work because I'm giving this to you. Yeah. But you got to use it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5341.76,"end":5351.68,"speaker":"Fr Stephen De Young","text":"Yes. So it's not something you're entitled. Forgiveness is not something you're entitled to that you can claim. And bodily health is not something you're entitled to that you can claim."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5352.88,"end":5366.23,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, Word faith preachers, folk, et al. Exactly. All right. Well, we're going to go ahead and take our second break for this episode on UNCTION here on the Lord of Spirits. And we'll be right back."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5366.47,"end":5382.79,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5387.51,"end":5436.94,"speaker":"Announcer","text":"Ancient Faith Publishing is pleased to announce a new release that is part history, part theology and part devotional. The Story of A History and Theology of Christ explores the complete life and teachings of our Lord from before his conception in Mary's womb until his ascension. Revered 20th century Egyptian elder and scholar Matthew the Poor wrote many volumes on the subject of Christ's significance, life and teachings, which translator James Helmi has distilled into one highly readable book that will make a valuable addition to every Christian's library. The Story of Jesus is now available in paperback and ebook@store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5438.7,"end":5439.02,"speaker":"Fr Stephen De Young","text":"We'Re."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5439.02,"end":5454.79,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5456.15,"end":5466.11,"speaker":"Fr Andrew Stephen Damick","text":"You know, I'm wondering if this has the most sorry whoevers of any episode of Lord of Spirits. I mean, you do throw a lot of sorrys in whole council of God."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5466.11,"end":5474.06,"speaker":"Fr Stephen De Young","text":"Yes. This is, I think, the apology episode. Really? Or the most Canadian episode, one of the two."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5474.86,"end":5476.7,"speaker":"Fr Andrew Stephen Damick","text":"That's, you know, story Calvinists."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5476.86,"end":5481.02,"speaker":"Fr Stephen De Young","text":"Yeah. See, my green accident is not good. Well, now we've alienated them."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5482.62,"end":5483.9,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, Canadian. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5484.14,"end":5500.54,"speaker":"Fr Stephen De Young","text":"I do have to say with that commercial, that sounds like a wonderful book. I have not read it yet, so I'm not being critical of the book, but my issue with the commercial is that anytime I hear part blank, part blank, my brain fills in all cop."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5505.22,"end":5510.3,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I never thought that I would hear the confluence of Robocop with an Egyptian."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5510.3,"end":5510.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5510.62,"end":5511.46,"speaker":"Fr Andrew Stephen Damick","text":"Like anything elder."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5512.18,"end":5518.5,"speaker":"Fr Stephen De Young","text":"Anything. Part German shepherd, part poodle, all cop. It doesn't matter. That's where my brain goes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5518.98,"end":5519.42,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5519.42,"end":5520.9,"speaker":"Fr Stephen De Young","text":"So it's just a wording thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5521.14,"end":5525.86,"speaker":"Fr Andrew Stephen Damick","text":"Understood. Well, I'll send that note to our marketing department."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5526.42,"end":5528.67,"speaker":"Fr Stephen De Young","text":"Pass that on for me, if you would."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5530.11,"end":5532.07,"speaker":"Fr Andrew Stephen Damick","text":"Well, they all listen to the show, so, you know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5532.07,"end":5534.11,"speaker":"Fr Stephen De Young","text":"Yes. They love my advice. I know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5535.07,"end":5537.63,"speaker":"Fr Andrew Stephen Damick","text":"And heed every last syllable of it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5537.79,"end":5538.27,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5538.27,"end":5562.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. All right, well, for those of you who have your generic lot of Spirits episode scripts out, you know that the third half is always the one we begin talking about the thing that the show is actually about. And I also think, because I knew I had to throw this out there, if anyone ever creates the Lord of Spirits wiki, Lord of Spirits Wiki, that probably the generic show outline is going to be one of the articles."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5562.92,"end":5563.64,"speaker":"Fr Stephen De Young","text":"It should be."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5563.88,"end":5564.48,"speaker":"Fr Andrew Stephen Damick","text":"It should be."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5564.48,"end":5567.16,"speaker":"Fr Stephen De Young","text":"It should be. I mean, think of the amount of material that's there."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5568.28,"end":5568.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5568.84,"end":5570.84,"speaker":"Fr Stephen De Young","text":"Just like song references."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5571.8,"end":5577.24,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. In jokes. I mean, there could be all kinds of wiki pages out there. People."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5577.72,"end":5578.2,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5578.44,"end":5581.81,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, just saying, I think."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5582.77,"end":5585.49,"speaker":"Fr Stephen De Young","text":"Most of our audience, though, are people with long commutes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5586.21,"end":5587.97,"speaker":"Fr Andrew Stephen Damick","text":"That's true. They're not gonna be taping while they."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5587.97,"end":5592.09,"speaker":"Fr Stephen De Young","text":"Lend themselves to wiki editing. I think that's the flaw in the game design."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5592.09,"end":5597.73,"speaker":"Fr Andrew Stephen Damick","text":"Well, although once we have self driving cars. Watch that. There'd be a proliferation of wikis."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5598.29,"end":5601.57,"speaker":"Fr Stephen De Young","text":"There we go. I have a self driving car, but it's scary."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5601.97,"end":5602.77,"speaker":"Fr Andrew Stephen Damick","text":"Oh, neat."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5604.45,"end":5605.41,"speaker":"Fr Stephen De Young","text":"It's kind of scary."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5606.21,"end":5606.93,"speaker":"Fr Andrew Stephen Damick","text":"Well, we're testing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5606.93,"end":5615.6,"speaker":"Fr Stephen De Young","text":"Here's the thing you're not. Here's the thing you're not thinking about. So the self driving cars have an ethical algorithm."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5615.76,"end":5616.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5616.2,"end":5620.32,"speaker":"Fr Stephen De Young","text":"Right, right. To what to do. You know, pedestrian jumps out, what do you do?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5620.4,"end":5622.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Do you save the pedestrian or do you save the driver?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5622.64,"end":5631.28,"speaker":"Fr Stephen De Young","text":"There are a certain set of scenarios in which your car will choose to kill you rather than someone else or someone else's."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5632.08,"end":5632.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5634.4,"end":5643.06,"speaker":"Fr Stephen De Young","text":"So before you buy a self driving car, be aware of that. It will go 9,000 on you given the right circumstances."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5643.06,"end":5650.82,"speaker":"Fr Andrew Stephen Damick","text":"You know, most of us are not going to buy self driving cars. Most of us are just going to order them on our apps. They'll just show up at your house, pick you up, take you where you want to go."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5651.46,"end":5659.7,"speaker":"Fr Stephen De Young","text":"My strategy is to drive like a 25 year old car and instead of replacing the car, you just replace one part at a time."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5660.42,"end":5661.86,"speaker":"Fr Andrew Stephen Damick","text":"Oh, the car of Theseus."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5662.5,"end":5668.09,"speaker":"Fr Stephen De Young","text":"Yes, it's the Johnny Cash method of new car purchase."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5669.05,"end":5676.65,"speaker":"Fr Andrew Stephen Damick","text":"I thought about Johnny Cash earlier when I was reading that bit from the Apocalypse because I always, whenever I read the book of Revelation, I hear it in the voice of Johnny Cash."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5677.05,"end":5679.93,"speaker":"Fr Stephen De Young","text":"Yeah, well you can hear him read it on YouTube."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5680.01,"end":5682.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I know, I know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5684.49,"end":5686.05,"speaker":"Fr Stephen De Young","text":"This is that banter again, that all."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5686.05,"end":5688.09,"speaker":"Fr Andrew Stephen Damick","text":"The people just cut this part out."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5688.09,"end":5691.41,"speaker":"Fr Stephen De Young","text":"Some do, but not all of them. Yeah, skip this part of the transcript."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5692.2,"end":5711.28,"speaker":"Fr Andrew Stephen Damick","text":"Skip, skip, skip. So, okay, well now we're actually going to talk about the sacrament per se. But of course all the stuff we talked about goes into this. You can't just listen to the third half. There's. Yeah, so, yeah, so kind of ground zero, as it were, of scriptural references."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5711.28,"end":5715.84,"speaker":"Fr Stephen De Young","text":"For this is when someone asks you holy unction, where's that in the Bible?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5715.84,"end":5719.88,"speaker":"Fr Andrew Stephen Damick","text":"Where is that in the Bible? It's literally explicitly commanded in the Bible."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5720.5,"end":5720.82,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5721.14,"end":5754.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so I don't know why a lot of people don't do this. We do it. So James, chapter 5, verses 14 and 15. Is anyone among you sick? Let him call for the presbyters of the church and let them pray over him, anointing him with oil in the name of the Lord. And the prayer of faith will save the one who is sick. And the Lord will raise him up and if he has committed sins, he will be forgiven. So note that connection between forgiveness of sins and healing of sickness. It's right there together in one sacrament."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5754.7,"end":5771.74,"speaker":"Fr Stephen De Young","text":"They're right there. And so this is why we had to go through that other stuff before we got here. Right. How are they connected? And so why is this a sacrament or why is this a mystery of the church? Well, like the others, this is God working through created material means. Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5771.74,"end":5776.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's oil and it's presbyters and their hands and their prayer."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5777.92,"end":5779.2,"speaker":"Fr Stephen De Young","text":"And at what point is the Bible."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5779.6,"end":5781.88,"speaker":"Fr Andrew Stephen Damick","text":"God, who does it? God will raise him up."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5781.88,"end":5841.66,"speaker":"Fr Stephen De Young","text":"Right. God doing it through. Right. Just like as we saw with baptism, you've got water, Chrismation, you've got meron, you've got myrrh, oil, marriage, you have a man and a woman. You have these material that are how the mystery works. And here you have oil. God working through the oil. And for folks who aren't Orthodox or maybe haven't been to an unction service, because not all orthodox churches do this regularly. Several of the details in here are followed in the way we do it in the Orthodox church. You'll know that it says presbyters, plural. Ideally, the unction service is served by seven presbyters, seven priests."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5841.82,"end":5857.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the way that gets. One of the ways it gets expressed within the service is that there's seven gospels and traditionally seven anointings. Although the way that it's usually done with lots of people all at once is one anointing at the end. But. Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5857.22,"end":5865.42,"speaker":"Fr Stephen De Young","text":"And so the people are prayed over, as it says, and there is actually at one point where they are blessed with the gospel book."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5865.66,"end":5866.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5866.62,"end":5874.06,"speaker":"Fr Stephen De Young","text":"The Bible itself. And the prayer speaks of God's healing hand, which is present in that gospel."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5877.1,"end":5878.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Very powerful."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5880.3,"end":5913.74,"speaker":"Fr Stephen De Young","text":"So to give you sort of more of an idea, right. Of how we do it, and that's. That's when we do the big service. Oil from that service is also kept. And so in situations where someone's in the hospital, someone's sick. Right. The Presbyterian or the priest can go and anoint them. Right. You don't need to gather up seven priests and do the whole service every time someone needs to be anointed. That's usually done when you're doing it for the whole congregation, the whole."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5913.98,"end":5922.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, that's theoretically the ideal is that you would do that whole thing every time. But it's just. It's. It's not. It's not generally practical."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5923.24,"end":5923.72,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5923.72,"end":5925.4,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5928.44,"end":5983.01,"speaker":"Fr Stephen De Young","text":"So here again, as Father Andrew mentioned, you see the forgiveness of sins and healing sort of Inextricably linked together. Right. And even though they're linked, and we talked about in the last half how we see that in Christ healings, how they're linked, and we talked a little bit about how they're related in being parallel to each other, there are still a lot of ways in which those two dots get connected that are really bad. And the reason I say they're really bad is not just, oh, that is incorrect theology. You use the incorrect preposition. You are a heretic, sir, on the Internet. Right. They're wrong and they're bad because of the consequences they have for people."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5984.05,"end":5984.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5984.69,"end":5993.81,"speaker":"Fr Stephen De Young","text":"And especially in this area of healing and the idea of miraculous healing, people have done horrible harm and damage."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5994.92,"end":5995.56,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5995.64,"end":5997.16,"speaker":"Fr Stephen De Young","text":"By misunderstanding this."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5997.4,"end":5997.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":5998.04,"end":6004.24,"speaker":"Fr Stephen De Young","text":"Literally, people have died without medical treatment because of these wrong theological understandings."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6004.24,"end":6012.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or. Or had their faith destroyed, you know, their faith in Christ because, like, well, you just. Your faith is too weak, and that's why you're still suffering, you know?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6012.56,"end":6018.96,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. So people have been victimized in any number of ways by these. That's why we're saying these are really bad. Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6018.96,"end":6019.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6020.05,"end":6030.29,"speaker":"Fr Stephen De Young","text":"So the first of those, you know, the Book of Job being exhibit A, is that there's a causative relationship between sin and suffering or illness. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6030.29,"end":6040.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You did something bad, and so therefore you are sick or suffering. You've gotten sin in your life. Yes. You're being punished. God is smacking you down because of the bad thing you did."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6041.25,"end":6055.43,"speaker":"Fr Stephen De Young","text":"Yes. And relatively few. Not no one, unfortunately, but relatively few people would say it that explicitly. But a lot of people think it. It's in there at a certain level. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6055.43,"end":6059.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Why is that person or that family suffering so much? Oh, they must be bad."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6059.55,"end":6076.84,"speaker":"Fr Stephen De Young","text":"Must be something going on. There must be something wrong. Right. Another really bad one. Is that sin or illness or. Hey, the world is kind of illusory. It isn't real. And this is Sorry, Mary Baker Eddie. For the first time, I know, Boom."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6077.56,"end":6094.48,"speaker":"Fr Andrew Stephen Damick","text":"In almost three years of podcasting together, finally get to say Sorry, Mary Baker Eddie. I don't know if we have any Christian Science people that listen to this show, but if we do, I want to hear from you. I just want to know that you're out there and say, welcome Science and."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6094.48,"end":6097.96,"speaker":"Fr Stephen De Young","text":"Health with Key to the Scriptures. I say the nay."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6098.28,"end":6133.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, and my favorite. Okay, I just have to throw this out there for those of you who have not read a certain little book called Orthodoxy and Heterodoxy. One of my favorite. There's a series of sermons Sermon lessons that they read from Mary Baker Eddy's stuff. And one of them is called something like, is the world and everything in it the result of atomic force? I think that's what it is. But I mean, it's this idea, Right. That everything is just the function of mind, you know, so sickness is because you're thinking bad."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6134.44,"end":6136.84,"speaker":"Fr Stephen De Young","text":"Yes. Which is what sin is within that system."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6137.16,"end":6137.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6138.36,"end":6162.46,"speaker":"Fr Stephen De Young","text":"It's sort of this, this delusion and it's sort of. If you look at her influences, man, I'm really trashing the Christian Scientists. I was much nicer to the Mormons. But if you look at her influences, it's a bunch of half rate quasi Hindu grifters in the early 20th century. Sort of people who set themselves up as quote unquote, swamis and stuff."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6162.62,"end":6182.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that whole sort of new thought movement is. I'm sorry, it's really wacky. It's actually, you know, it's interesting. You can trace it down into the mid 20th century word faith. Faith healers. Like there's this line that you can trace pretty easily between that movement in the 19th century and then this other stuff. So."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6183.3,"end":6188.34,"speaker":"Fr Stephen De Young","text":"Yeah. And again, the reason I'm going harder on this is how destructive it is."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6188.58,"end":6188.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6189.46,"end":6197.3,"speaker":"Fr Stephen De Young","text":"People refusing to give their children medical care. Right, right. This is serious stuff at this point. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6197.3,"end":6199.46,"speaker":"Fr Andrew Stephen Damick","text":"Faith harder and everything will be fine."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6199.94,"end":6206.82,"speaker":"Fr Stephen De Young","text":"This isn't just like, you know, you added the filioque to the creed. Right. Which is bad enough. Sorry, Roman Catholic friends."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6207.7,"end":6210.86,"speaker":"Fr Andrew Stephen Damick","text":"But who else did not apologize to in the."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6211.65,"end":6218.13,"speaker":"Fr Stephen De Young","text":"This is a whole. I didn't think they were either one. It's a whole other level of destructiveness. Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6218.13,"end":6223.05,"speaker":"Fr Andrew Stephen Damick","text":"You thought this would be an innocuous, unctuous episode. Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6223.05,"end":6226.05,"speaker":"Fr Stephen De Young","text":"Yes. It has not been so unctuous after all."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6229.49,"end":6238.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. So that sense that the world and of course sickness is illusory, that's kind of the second in our rogues gallery of errors relationships."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6238.74,"end":6245.22,"speaker":"Fr Stephen De Young","text":"As my father once pointed out to me, he had never been inside a Christian Science reading room where everyone wasn't wearing glasses."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6246.5,"end":6247.06,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6247.06,"end":6248.34,"speaker":"Fr Stephen De Young","text":"So take that as you will."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6254.66,"end":6256.1,"speaker":"Fr Andrew Stephen Damick","text":"That one for later. That's good."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6256.1,"end":6281.61,"speaker":"Fr Stephen De Young","text":"Yeah. So. But probably the most common one. Right. Because I don't know that we had any Christian Scientist or Church of Religious Science folks for me to run off just now. And as I said, not a lot of people would verbalize that. Oh, yes. If you get sick, it's because of. Because you sinned. Right. They wouldn't at least verbalize it that way."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6281.69,"end":6282.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6282.41,"end":6289.53,"speaker":"Fr Stephen De Young","text":"This, this third one is Held by just about everybody who's an American."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6290.57,"end":6292.89,"speaker":"Fr Andrew Stephen Damick","text":"And usually unconsciously."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6293.69,"end":6294.37,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6294.37,"end":6297.45,"speaker":"Fr Andrew Stephen Damick","text":"I mean, often consciously, but usually unconsciously."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6297.77,"end":6309.05,"speaker":"Fr Stephen De Young","text":"Yeah. And that's that there are these partitioned sort of separate spheres. There's sort of physical health. Right. Which is this science based thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6309.53,"end":6309.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6309.85,"end":6314.73,"speaker":"Fr Stephen De Young","text":"Of biochemistry and et cetera, et cetera. There's mental health."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6315.21,"end":6317.13,"speaker":"Fr Andrew Stephen Damick","text":"And there may be a crossover between these things."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6317.13,"end":6325.25,"speaker":"Fr Stephen De Young","text":"Right. Which. Well, there's mental health, which may also be reducible to biochemistry or may not, depending on your point of view. Yeah, but that's a separate thing."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6325.81,"end":6326.37,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6326.45,"end":6341.81,"speaker":"Fr Stephen De Young","text":"And then there's spiritual health or issues of sin, which are this third separate other thing and that ultimately they don't connect. And in a lot of cases, this is a reaction to especially the first bad view."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6342.53,"end":6343.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6343.01,"end":6353.1,"speaker":"Fr Stephen De Young","text":"Right. So they would don't want to say they're horrified by someone saying, oh, you got sick because you sinned. And so they say, look, no, sin and physical health have nothing to do with each other."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6353.34,"end":6357.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Look, it's just an illness, you know, this is not your fault."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6360.14,"end":6394.69,"speaker":"Fr Stephen De Young","text":"Sin is this legal thing of sin and forgiveness. Mental health is this other thing that we address through psychoanalysis or psychotherapy. Right. And then physical health is this. This sort of other thing. Right. And so the problem with this is, even though a lot of people, if not most Americans, when asked, will say, yes, these are these separate spheres, functionally, we all know that they overlap all the time."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6395.33,"end":6397.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because you're having one kind of experience."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6399.17,"end":6399.65,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6399.65,"end":6482.83,"speaker":"Fr Andrew Stephen Damick","text":"All at once. You know, the wretchedness that you feel in the midst of having Covid for the eighth time or whatever is not. You can't just say, well, my body's kind of feeling like crap, but I'm good. Like, you might say that to yourself, but that is not how you feel. That's not how you really are being. And like I, you know, to try to work that out of my head, the sort of thought experiment that worked for me was saints suffering from disease. Right. So a saint is a very holy person. You would certainly never say about them, well, they're suffering a disease because of their sins, because of their bad sins. You wouldn't say that. And certainly, you know, we're not going to say it's an illusion, but we might be tempted to say, well, you know, their soul is in great shape, but their body, you know, or God has allowed this to happen to them, you know, whatever. Right. But they are not partitioned out because they're still embodied humans. So a saint might well feel while they have maybe some major Ailment, they might feel depression, they might feel the sense of spiritual struggle. Those things are going to go along with it. That doesn't mean they're any less holy."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6483.95,"end":6484.31,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6484.31,"end":6492.27,"speaker":"Fr Andrew Stephen Damick","text":"You know, it's still a physical, spiritual, embodied, soulful, all at once thing. You know, it's, it's all together. It's, it's one."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6492.75,"end":6497.07,"speaker":"Fr Stephen De Young","text":"Yeah. If you're living with chronic pain, you're going to experience periods of depression."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6498.03,"end":6498.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6498.39,"end":6501.47,"speaker":"Fr Stephen De Young","text":"And especially during those periods of depression, it's going to be hard to pray."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6502.51,"end":6504.71,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or, or maybe anger, which."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6504.71,"end":6505.15,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6505.39,"end":6516.65,"speaker":"Fr Andrew Stephen Damick","text":"I mean, anger is a spiritual experience too. You know, it's all those things together. You know, it's a spiritual and physical, it's spiritual and physical. Like you feel, you feel energized when you're angry. Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6517.05,"end":6550.58,"speaker":"Fr Stephen De Young","text":"And if you're dealing with crippling anxiety and stress, that's going to have physical consequences to your physical body. That's going to do damage to your physical body. That's going to make it again, very difficult to pray. It's going to make it very difficult to focus. It's going to make it very difficult to find time to attend church and, and live the Christian life the way you know, you should. Right. There's not a causative relationship here. Right. And Right. All of this is real. None of it is illusory."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6550.74,"end":6552.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, and, and also."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6552.18,"end":6554.18,"speaker":"Fr Stephen De Young","text":"But it all overlaps. You're a whole person."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6554.42,"end":6601.82,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And I mean, I think one of the reasons why people try to separate it out is because they're looking for solutions. Right. So like, well, look, you've got a headache, just, you know, take the pill, you know, which, okay, you take a pill, you might well feel better. It's true. But the experience is more than just a pain in your head. It's also all these other things at the same time, as we said. And so shouldn't you also be praying? Shouldn't you also be maybe dealing with like your, your headache might well be the connected to other things going on in your life, you know, shouldn't you also deal with them all those things together? If you just constantly treat the symptom, then you might not be dealing with the overall true disease."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6602.38,"end":6608.62,"speaker":"Fr Stephen De Young","text":"Right. And healing brought to one part of that. Right. So certain people could only address certain parts of that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6609.1,"end":6609.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6609.74,"end":6612.86,"speaker":"Fr Stephen De Young","text":"So your local family doctor cannot address the spiritual part."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6613.66,"end":6614.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. Probably not."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6614.62,"end":6617.82,"speaker":"Fr Stephen De Young","text":"I as a priest cannot address the physical part."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6618.78,"end":6620.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's not your deal."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6620.22,"end":6634.9,"speaker":"Fr Stephen De Young","text":"Right. Like if you've got low grade kidney failure. Right. You need to go to a doctor not to me. Right. While you're getting the treatment for kidney failure, I will come and talk to you and hear your confession and anoint you with oil."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6635.06,"end":6639.86,"speaker":"Fr Andrew Stephen Damick","text":"Are you saying people who eat Cajun food might have kidney failure issues or. I don't know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6640.5,"end":6643.86,"speaker":"Fr Stephen De Young","text":"I don't know. Dehydration from all the sweating we do in August? I don't know."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6645.47,"end":6655.87,"speaker":"Fr Andrew Stephen Damick","text":"But I mean, it should be emphasized, right, that what you can do for that person and what the kidney doctor does for that person are both from God. Both of those things are from God."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6656.03,"end":6657.47,"speaker":"Fr Stephen De Young","text":"And are both things they need."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6658.27,"end":6658.67,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6659.39,"end":6776.36,"speaker":"Fr Stephen De Young","text":"Right. Just getting your physical health in order, if your mental and your spiritual health are out of whack, isn't going to do a lot of good for you because it's going to start failing too, because these things overlap and vice versa, right. When you're struggling with mental illness or physical illness, as that starts to be alleviated, that struggle starts to be alleviated and you get help with those things. One of the things that does is, for example, open up space for repentance, for going and making amends, for going and dealing with things that, you know, you need to deal with as a Christian, but that you couldn't because of the other things that were going on. Right. So these things all go together. Not only does the. The suffering overlap, right. And relate, but the healing, right. Is holistic and the healing overlaps. And so what we're talking about, when we're talking about healing in this full orbed sense, the kind of healing that we're praying for when we perform the anointing of the sick, right? This is the restoration of the whole human person. So that includes your biological life, includes your spiritual life, the life of the soul, right. Which is the life of the body. It includes the health of the relationships that you have with the world around you and the people around you. It includes the restoration of your identity because your identity is formed out of those relationships and those interactions and those roles you play, right. Society, all of that is restored as you are healed. And so it's not just like, oh, my body is healed, my soul is healed, my mind is healed. Right? You are healed."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6778.05,"end":6778.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6779.09,"end":6807.82,"speaker":"Fr Stephen De Young","text":"The you that you are is what's healed. Right? So all that said, right, obviously, you know, there are a whole lot of people who receive the anointing of the sick and not only aren't healed immediately, sometimes aren't healed at all. Sometimes it's someone who's approaching physical death. And even though they received the anointing of the sick, they still die. Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6807.82,"end":6808.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6809.42,"end":6821.1,"speaker":"Fr Stephen De Young","text":"So why is that? Does God not want to heal people? Is there some stuff he can't heal? Is there something they did wrong to not receive the healing? Right. Well, we've already ruled that last one out. Right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6821.42,"end":6828.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well. And just like it's our practice generally to anoint people when we full well believe that they're dying."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6829.98,"end":6830.3,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6831.42,"end":6836.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Is that like Hail Mary pass or whatever they were trying to do that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6837.34,"end":6848.78,"speaker":"Fr Stephen De Young","text":"We don't do in the Orthodox Church? We don't do last rites per se for our Roman Catholic friends. We do the anointing at various points. But that includes when someone's on their deathbed, we will go and give them the anointing of the sick."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6849.02,"end":6849.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6850.78,"end":6853.9,"speaker":"Fr Stephen De Young","text":"So our unction is less extreme, you might say."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6856.01,"end":6856.33,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6860.57,"end":6873.53,"speaker":"Fr Stephen De Young","text":"So why is this? Well, you remember, and we've talked about this, I know, several times on the show, all the way back in Genesis, chapter three, it is not good for man to live forever in this state."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6875.21,"end":6876.17,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, that."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6876.57,"end":6914.23,"speaker":"Fr Stephen De Young","text":"And it still isn't. Yeah, it still isn't. Right. St. Paul was still able to say, you know, it's better for me to depart this life, but it's better for you if I stay. Right. And so it is not aimed at the sacrament of unction. And God's healing in general is not aimed at keeping humans alive forever in this world. Lazarus died again later."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6917.91,"end":6920.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, everybody who got raised died again later."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6920.55,"end":6925.27,"speaker":"Fr Stephen De Young","text":"Yeah. All the people who Jesus healed died eventually, right?"}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6925.27,"end":6925.75,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":6928.07,"end":7032.65,"speaker":"Fr Stephen De Young","text":"But the healing we receive in this life, the restoration we receive, the partial restoration we receive this life, gives us more time to repent, gives us more time in this world to serve the purpose of our life in this world, which is repentance, which is transformation. But there's a point at which that is done, Right. Where the repentance we need to do is done or we've run out of chances. You don't want to be gracious to us, we run our chances. But on the positive side, that what God required of us to of repentance in terms of the good works he's given us to do in this world, etc. That's done. And then it is time for us, for our life in this world to end. And that is because the ultimate, the final restoration of the human person and our identity, where we really become who we are, is in the bodily resurrection. That's what this is aimed at. So the healing we receive now is sort of a temporary measure. It's sort of a foretaste. Right. It's a gift. It's a blessing. It's a little bit of an extension of our lives here to allow us to do what we need to do. Right. But it's not a substitute. It's definitely not a way to try to avoid us moving on through death as Christ died to our bodily resurrection as he was raised from the dead. Yeah, it's an anticipation of it, not a staving off of it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7036.49,"end":7518.75,"speaker":"Fr Andrew Stephen Damick","text":"So as we wrap up, the first thing I want to say is, I can't believe we're at almost. We're actually right at this moment under two hours. How about that? Maybe it's because we extracted a lot of giggling that we would have otherwise included, I don't know. But on a much more serious note, there's a couple things I want to leave everybody with. So one is if you've ever been at a holy unction service that I've served, especially during the years that I was doing pastoral ministry still, and I preached afterwards, which I did once in a while, I would often raise one question, which is, okay, we're all coming in here for this healing sacrament. Why is it that everybody is not walking out miraculously cured of whatever they walked in here with? Right. And that's even aside from the fact that most people who come into the unction service are probably relatively well in soul and relatively well in body anyway. But, you know, especially as you get past middle age, you got something that hurts, probably something that's uncomfortable on a regular basis. Why doesn't holy unction just make that go away? I mean, if you've listened up to this point, you probably know the answer to that, which is, it's not that this is some kind of head fake on God's part. Like, yeah, yeah, this is the healing sacrament. But suckers, you know, most of you are not going to get healed most of the time. That's not it at all. That's not it at all. This sacrament is for the healing of soul and body. And, and it's not like, well, okay, well, we got the soul in, even though the body isn't really going for anything at this point. No, that's not it at all. Because as we started out, what who is a human? You are a body. You are an ensouled body, an enlivened, animated body. It's who you are. And so the sacrament affects your body in all of the senses. That that means not just in terms of the materiality that we tend to think about when we think about the body, although including that for sure. But also, you know, frankly, see our body episodes, all of your powers, your potentialities, all those things together. So is it not working? It is. It is. But whereas it's aiming. And the whole point of it is the resurrected person, it's aiming towards the resurrection. And how do you. How are you resurrected with the resurrection of life rather than the resurrection of damnation? You're raised to the resurrection of life by faithfulness to Christ, by holding fast to him, by always coming back to him. And that's what unction is for. It aims at that, at enabling you to do that in this life so that in the resurrection, you are who you're supposed to be in. In. In its. In your fullness. The second thing I wanted to mention, and that's related to the first for sure, is a lot more personal, but I know it's. But it's not exclusive to me because I know that probably a lot of you listening out there have experienced this. So if you're married, there's a good chance that you and your spouse have experienced a miscarriage. Statistically, it's a really good chance, and that's a difficult thing to experience. My wife and I have experienced that. And there's so many feelings that go along with that. Right. It's not just a sense of a loss of potential. Like, you know, you're coming up with baby names, you're maybe outfitting a room, you're telling your other kids if you've got them. It's not just that, but there's also a sense of not quite knowing what to do with a person who died but was never really present to you in the most palpable way. Certainly mom feels the presence of that child in ways that nobody else does, and she's the one who suffers the most. And there's a lot of things you can do to heal from that suffering, but that's not the thing that I want to talk about. Rather, I want to pass on to you something that was passed on to me that had obviously been passed on before. So in one of these experiences that we had, I was actually away from my wife at the time. We were not in the same part of the country. And it was tough, very, very tough for that to be the. I mean, you know, we couldn't have planned for that. And so I was actually at an event with a number of other clergy, and I ran into one of our bishops, and I'll just go ahead and say who it was, because I'm grateful that he for this. It was Bishop John. So if you're in the Antiochanish Diocese, you might know Bishop John. And he says to me, how are you doing? And it wasn't just casual, you know, you ever talk to him? He's very. He's a good pastor, kind of all the time. And, you know, I knew him. I know him. I've known him for years. And so I told him. I told him what had happened. And he passed this on to me. He said, you know, have you ever heard what Father Thomas Hopko used to say about this situation? I said, you know what? I have not. And he said, and now I'm not passing this on to you to tell you that this is some kind of dogmatic teaching, but it's something that I believe is true. Okay? That's where I'm going to put it. He said this. God gives everyone everything that they need in order to be saved. Everyone in this world. God gives them everything that they need. Everything in your life is there for you, for your salvation. And if you use it, you'll be saved. You have what you need. And what Fr. Thomas Hopko would say is that when God takes someone like this, in this situation, a situation of miscarriage, it's because that person already has. They're already fit, they're already ready to go. And so it's their moment. God is already receiving them. Again, I'm not saying this is some kind of dogmatic teaching. If you don't believe this, you're not Christian or not Orthodox or whatever. But I think that this aims at a lot of what we're talking about, that the ultimate goal for us as creations of God is to be with him, is to be fit to be with him, to be prepared to be with Him. And that's what unction is aimed at. That's what unction is for. Just because we don't walk away with miracle cures doesn't mean it's not working. Just as with any of the other sacraments, just because you don't walk away glowing or whatever, doesn't mean it's not working. It's making you more and more fit for the kingdom of God, more and more fit, ultimately for the resurrection, for this embodied whole humanity cured of corruption, with God forever. That's what it's for. Father Stephen."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7521.79,"end":7906.66,"speaker":"Fr Stephen De Young","text":"You do need to speak for yourself a little bit. I am positively radiant nearly all the time. That is the adjective, I think, that best describes me in most people's minds. So earlier when we were talking, I made a reference to essence, not preceding existence, right that who you are does not precede the life you live. And are more philosophically inclined or Francophilic listeners may have caught a sort of reference to Jean Paul Sartre and his famous among nerds axiom that existence precedes essence. And by that he meant that we sort of come into being and we aren't anything in particular. And as we make choices in our life, those choices define who we are. And he used the example at one point of how you can compose your life like a melody through the choices you make. And, you know, I mean, that sounds nice, but it's the opposite extreme, right? It's the opposite extreme. So on one side you have those who would tell us that you know before you're even born, right? You are X, you will always be X. X is just going to play out over your life, right? On the other side, you have people who, like Jean Paul Sartre, who are so obsessed with the idea of ultimate freedom that they're not willing to acknowledge that you're born in a particular place, in a particular time, in a particular body, with particular genetics, a particular heritage. You speak a particular language, and that shapes how you think about things and how you see the world. And you have particular experiences early in life that aren't subject to your control. He wants to ignore all of that. And in between, we have one of the truths we were kind of trying to get at in this episode, coming back to what Father Staniloy said about a human person being in some sense, absolute. Because that quality that God has given to us, that he's built into our constitution of being able to step outside of, to evaluate. And I won't go down this rabbit hole now, but you can go back to the episode. This is really a function of the news of reason in the truest sense. To look at our lives, to, like the prodigal son, come to our senses. That is something that we possess as a capacity as part of our human nature at every moment of our lives. Not just at the first moment or at the early moments, but until the very last moment when we draw our last breath. Meaning no matter how you've spent the last umpteen years, no matter who you've been, no matter how distorted that is, no matter how much guilt that's heaped upon you, no matter how much you've hurt yourself and other people, no matter how much damage you've done, no matter what people think of you, no matter what you think of yourself, that can all change. You can break character. You don't have to keep playing the part you've been playing. You don't have to keep operating within the relationships and the patterns that you've been operating in. But that's also not, again, contra at least one reading of Sartre, not something you do by snapping your fingers. That's not something you can declare. It's not something you can wake up one day and just say, okay, done with all that. I'm a whole new person now. It starts there and then. It takes a lot of work. The work of repentance, the work of making new choices, the work of repairing damaged relationships, of repairing loss of respect from other people and for yourself. The work of making peace where you've been making conflict and trying to win. The work of being healed as a whole and complete person in every way. Transforming yourself, transforming your life. Because again, identity is not found back before our birth. It's not found at our birth. It's not found at some high point in our life. Age 30, age 40. Right? It's found at the point of the bodily resurrection. That is the point in our life and our existence where we most truly will be who we are. And until then, we are actively shaping that, actively transforming that. And free not to pivot on a dime. Free not from the consequences of our past actions as if they can just be brushed aside, but free to begin the work of becoming that person who we want to be on that day instead of the person who we may have been."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7907.78,"end":7932.75,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that is our show for tonight. Thank you very much for listening everyone. If you didn't get through to us live, we would still love to hear from you. You can email us@lordofspiritscientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7932.75,"end":7943.31,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Then I put my codes in the machine but the world I found Was made of faulty dreams."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7944.11,"end":7958.39,"speaker":"Fr Andrew Stephen Damick","text":"If you are on Facebook, that dark, dark place, but not as dark as Twitter, follow our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7959.27,"end":7971.19,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air, fly out of the doldrums and recall the log from the early database of your love."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7971.83,"end":7974.47,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night and May God bless you."}
{"episode_id":"LOS - #062 - 2023-02-23 - Unctuous","start":7995.28,"end":8032.35,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
