{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":0.4,"end":65.06,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":65.78,"end":80.22,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Giants, killers. Man, I can't believe I messed up my phrase there. I don't know. Giant killers, dragon slayers, bat people. You're listening to the Lord of Spirits podcast, my co host."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":80.22,"end":83.58,"speaker":"Fr Stephen De Young","text":"As long as you don't hinder gender, you can do those other things to those other things."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":83.58,"end":126.74,"speaker":"Fr Andrew Stephen Damick","text":"Duly noted. My co Host, Father Stephen DeYoung, Editor in Chief of the Ettenmoors, is with me straight from the swamp in Lafayette, Louisiana. And I'm Father Andrew Steven Damick in Emmaus, Pennsylvania. Three square miles of glory perched precariously atop the arcane tower of podcasting, hovering dozens of stories above a disused gateway to the underworld former crematorium. And we're live. And if you are listening to us live, you can call us at 855-23-7-2346 and you can talk to us. This is not an all Q and A episode tonight. We're actually covering some, you know, some pre planned content. We'll get to your calls in just a minute at the beginning of our second half and Mike need Fland again will be taking your calls."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":126.74,"end":129.94,"speaker":"Fr Stephen De Young","text":"So what happened to Trudy? They're giving us the trainees now."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":132.1,"end":136.66,"speaker":"Fr Andrew Stephen Damick","text":"Trudy's been promoted. Trudy's like in charge. She's in charge of the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":137.06,"end":142.74,"speaker":"Fr Stephen De Young","text":"All the more reason we should have her as the A lister of this on our squad here."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":143.03,"end":153.67,"speaker":"Fr Andrew Stephen Damick","text":"I think Trudy got a life. She doesn't want to be with us at nights anymore, you know, so that's where it is. You going to be okay?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":154.71,"end":155.35,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":155.35,"end":156.23,"speaker":"Fr Andrew Stephen Damick","text":"It's depressing."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":156.95,"end":160.23,"speaker":"Fr Stephen De Young","text":"We just we just finished kind of breaking her in in terms of our."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":161.03,"end":161.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":161.99,"end":165.19,"speaker":"Fr Stephen De Young","text":"Wacky morning show antics, you know, and."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":165.19,"end":171.43,"speaker":"Fr Andrew Stephen Damick","text":"Now feel a little abandoned. Is this the first time you've had feelings on the radio?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":171.67,"end":173.75,"speaker":"Fr Stephen De Young","text":"It's not even. No, it's not feelings."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":173.75,"end":175.03,"speaker":"Fr Andrew Stephen Damick","text":"It's not feelings. Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":175.03,"end":186.47,"speaker":"Fr Stephen De Young","text":"It's just checking, you know, it's just kind of, you know, it's all right now. Now we gotta, you know, break in this Mike deadpan guy or Bedpan or whatever his name is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":188.07,"end":190.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know, I know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":190.47,"end":199.11,"speaker":"Fr Stephen De Young","text":"Are we safe? Is this like an unpromotable guy? Like, I mean, he's going nowhere in life, so we could safely assume we'll have him for the rest of this show's run."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":199.73,"end":203.09,"speaker":"Fr Andrew Stephen Damick","text":"It could be. I mean, of course, you know, how long is this show really going to run?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":203.57,"end":206.21,"speaker":"Fr Stephen De Young","text":"You know, who knows? This could be the last episode right now."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":206.21,"end":208.77,"speaker":"Fr Andrew Stephen Damick","text":"It could be. It absolutely could be."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":209.81,"end":214.53,"speaker":"Fr Stephen De Young","text":"Before we begin, it'd be weird, given what you're about to talk about, but possible last episode."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":215.73,"end":271.87,"speaker":"Fr Andrew Stephen Damick","text":"In case you people haven't heard, the Lord of Spirits Conference is going to be back for its second manifestation this October, 2nd through 5th, 2025, at the Antiochin Village in Ligonier, Pennsylvania, featuring none other than our very own Reverend Doctor Swamp Ogre himself, the Very Reverend Doctor Joseph Lucas of Miami, Richard Rowdy Roddy Roland, and your humble servant. You can get your tickets@ancientfaith.com events. And I recommend everybody get those tickets quickly because I think there's only like 40 rooms or so left at the Antiochian Village, which means that close to 60% are currently taken. Now we will have commuter tickets for people who don't get rooms at the village, but there is a max and we did hit it last year. So yeah, get your tickets. This could well be the very last time. And we're super not kidding about that. It probably will be the last conference we do last night. Pierce. Pierce."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":272.27,"end":279.31,"speaker":"Fr Stephen De Young","text":"Very well. Yeah. Because my demands to do each one continue to escalate. So eventually we just don't have the budget tipping point."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":279.55,"end":288.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't have a budget for like another two story cake that, you know, a group of Finnish fusiliers pop out of."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":289.5,"end":293.1,"speaker":"Fr Stephen De Young","text":"Yeah, the second private jet for my dogs. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":293.18,"end":297.82,"speaker":"Fr Andrew Stephen Damick","text":"I mean, they're heathen dogs. You can't baptize them. They're forever pagans."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":298.06,"end":301.02,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. That's why they need their own separate jet."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":301.02,"end":301.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":301.66,"end":302.22,"speaker":"Fr Stephen De Young","text":"Maintain it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":302.22,"end":310.7,"speaker":"Fr Andrew Stephen Damick","text":"I understand. You know. Yeah. Don't want to contaminate them. Right. So everybody remember our episode that we did? I think this was In. Was this in year two or year three? I'm trying to remember now."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":311.48,"end":313.64,"speaker":"Fr Stephen De Young","text":"It was Fair circle, man. I don't know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":313.8,"end":336.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Moderately early on, it was called the Priest Shall Make Atonement. That was the one with. With the goats. So we're talking about atonement again tonight, but we're picking back up with our series on Apocrypha, and we're looking specifically at the text called the Apocalypse of Abraham. So, Father, I assume this is about how Abraham is causing the end of the world, because isn't that what apocalypse means?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":336.53,"end":352.69,"speaker":"Fr Stephen De Young","text":"Well, that depends if someone in the past sees and knows about the end of the world. Is there some implied causation there? Yeah, no, it's about how Abraham became a zombie."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":354.77,"end":360.69,"speaker":"Fr Andrew Stephen Damick","text":"Zombie Abraham. Wait, I don't know how. I have to work out the lyrics for that as we go on. As you were."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":361.33,"end":383.54,"speaker":"Fr Stephen De Young","text":"Yeah, I feel like. See, that song is a good example of one where I feel like they had kind of a catchy hook, Right. Father Abraham had many sons. Many sons had Father Abraham. And then, like, they kind of didn't know where to go with it. They're like, well, I'm one of them, so are you. And then you get to the. So let's just praise the Lord. Like, they clearly ran out of, like, steam. Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":384.02,"end":387.98,"speaker":"Fr Andrew Stephen Damick","text":"I mean, once you brought that chiastic beginning, like, what do you do after that?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":387.98,"end":424.95,"speaker":"Fr Stephen De Young","text":"Like, just praise the Lord, guys. You know? You know, it's sort of like when the lead singer runs out of lyrics, so he just sort of goes over and poses next to the guitar player during his solo, and it's like, check this guy out. It's the children's praise song equivalent, I feel. Yeah. But the Apocalypse of Abraham, which is probably everybody's secretary, favorite piece of Slavonic preserved Apocrypha. Right after Second Enoch."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":425.19,"end":426.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":431.35,"end":438.71,"speaker":"Fr Stephen De Young","text":"I mean, we'll do Enoch. I think that's safe, right? Like, yeah, so they'll get to Second Enix someday. We'll do First Enoch."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":439.67,"end":442.03,"speaker":"Fr Andrew Stephen Damick","text":"That's right. And although, do we even need to."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":442.03,"end":446.55,"speaker":"Fr Stephen De Young","text":"Do the first Enoch in this series since it's all we talk about all the time?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":446.55,"end":447.47,"speaker":"Fr Andrew Stephen Damick","text":"I've heard that as well."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":447.87,"end":449.15,"speaker":"Fr Stephen De Young","text":"Yes, that's what I've been told."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":451.47,"end":451.75,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":451.75,"end":530.66,"speaker":"Fr Stephen De Young","text":"So, yeah, so the Apocalypse of Abraham is a piece of Anakin literature, even though it's not the Apocalypse of Enoch. And so the Anakin literature. We've talked about other things that are part of the Anakin literature. Like, we did our episode on the Book of Jubilees, which is Enoch literature, even though Again, it's not one of the numbered books of Enoch, and Enoch is not even especially prominent in it. Right. It's written from the perspective of Moses on Mount Sinai. And so when we talk about Enochic literature, we're not really talking about just stuff about Enoch. We're talking about. And yes, I will continue to pronounce it Enoch. I don't care what people think. I like Land of the Lost, what can I say? But the, the anarchic literature, we're talking about literature that, in the Second Temple period, that deals with a certain set of themes, certain topics and themes that don't necessarily involve Enoch himself. So the, the Enoch and Enakic literature is really referring to the Book of First Enoch, not the person of Enoch."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":530.9,"end":531.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":532.5,"end":581.7,"speaker":"Fr Stephen De Young","text":"So the Book of First Enoch is a piece of Second Temple Jewish literature. It's apocalyptic. It deals with particular themes related to the giants and Azazel really are probably the two primary things. Right. And so the Book of Jubilees has a bunch of material dealing with the giants and Noah and the flood. That's why it tends to get categorized as an archic literature. In the case of the Apocalypse of Abraham, it's going to be because of Azazel showing up. And there's a. I don't know if it made it into the YouTube thumbnail, but in the advertisements for tonight's episode, we had a lovely woodcut of Azazel."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":582.02,"end":589.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know you never, you never look. But yes, our YouTube thumbnail not only has that woodcut, but it also says apocalyptic goat demon."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":590.07,"end":591.11,"speaker":"Fr Stephen De Young","text":"Oh, well, there you go."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":591.43,"end":593.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you're welcome."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":593.59,"end":597.19,"speaker":"Fr Stephen De Young","text":"And that, that woodcut, I think, is pretty metal. That's all I'm saying it is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":598.87,"end":599.27,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":599.91,"end":701.84,"speaker":"Fr Stephen De Young","text":"But yeah, so it's a Zazel at his appearance, at his prominence in the Apocalypse of Abraham and the fact that it is a piece of apocalyptic literature that causes the Apocalypse of Abraham to be classified as Anakin literature. Even though. And I know people are going to get less excited, the Apocalypse of Abraham does not really deal expressly with giants. I'm just letting that sink in for everybody now that the disappointment is washed over you all. There is other interesting stuff, though, about the Apocalypse of Abraham. So this is like most of the Second Temple Jewish literature, the Second Temple texts that we've talked about on the show and in this series, one that was not preserved within Judaism. So Rabbinic Judaism did not keep copies of the Apocalypse of Abraham. You ask a rabbi about the Apocalypse of Abraham, they're probably not going to know what you're talking about. Unless they studied this in particular. Right. So it wasn't preserved in Jewish circles, it was preserved in Christian circles. But unlike some of the texts we've talked about, like the Testament of the twelve Patriarchs, where we've got manuscripts in Christian monasteries, like on Mount Athos and Marsaba Monastery, this one was not necessarily preserved in Orthodox Christian circles."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":702,"end":709.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it only ends up. Well, we'll talk about them. But with one particular heretical group in the Balkans."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":709.76,"end":822.36,"speaker":"Fr Stephen De Young","text":"Yes. And so the copies we have of it are in Slavonic and they're medieval Slavonic manuscripts. They're medieval Slavonic manuscripts that were being used by this heretical sect that we're going to talk a little bit more about in a minute here. So that said, if the only copies we have are medieval and in Slavonic, why would anybody think that this is actually a, a Jewish text, let alone a Second Temple Jewish text? Right. Wouldn't it more likely be a subtext come up with by this sect? Right. How do we know it's not? Well, there's a couple ways we know it's not. So one of the things is just the genre and the type of literature it is and the way it reads the. There are a number of touch points with other Second Temple Jewish literature, but a big giveaway is that there are a bunch of Semitic names like Azazel, but not limited to that. Semitic names that come from a Semitic language that are translated directly into Slavonic. So what do I mean by that? Well, okay, so if you think about the Old Testament, most of the names we know from, for Old Testament figures and even a lot of New Testament figures come to us from the Latin name."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":823.48,"end":832.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is Latin, from Greek, from Hebrew. So it's gone through a few hops."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":832.89,"end":835.85,"speaker":"Fr Stephen De Young","text":"So we talk about Moses, not about Moishe."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":835.93,"end":836.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":839.61,"end":857.6,"speaker":"Fr Stephen De Young","text":"And we talk about Elijah. Right. Unless you're around Greeks. Right. You talk about Elias, but even that is from Elyas, which is from Eliyahu. Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":857.6,"end":858.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":859.32,"end":869.48,"speaker":"Fr Stephen De Young","text":"So it's gone through. And every time it goes through these names, it gets transformed and it gets transformed more. Like the name Louis or Lewis is actually from Elijah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":871.16,"end":873.96,"speaker":"Fr Andrew Stephen Damick","text":"Wait, really? Isn't it? Yes, Ludovicos."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":874.68,"end":887.48,"speaker":"Fr Stephen De Young","text":"Ultimately it's, it's just, it's just gone through a couple more from Elias. Right. You say so a couple more transformations or James from."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":887.64,"end":889.8,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I mean, let's not even talk about James."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":890.12,"end":892.8,"speaker":"Fr Stephen De Young","text":"Yeah, but so there's these, these transformations."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":892.8,"end":894.36,"speaker":"Fr Andrew Stephen Damick","text":"Long and winding robe there."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":894.92,"end":1006.89,"speaker":"Fr Stephen De Young","text":"And so you could tell. And you may have had, you know, if you've been at an Orthodox church for matins or vespers or something, where they're. They're doing the things for an Old Testament saint and they're using the Greek translations, you probably didn't know who they were talking about. Like, there's this stuff about Elias and Elysias, you know, which in English are more commonly known as Elijah and Elisha. Yeah, but that's going back a step. But so in this case you have names like Azazel, Yehoel is another. We're going to talk about some others that have just gone straight from a Semitic language into Slavonic. They haven't passed through Greek because we know what happens to those names when they go through Greek, because we have like Greek translations of the Old Testament, for example, and other texts we have that are like, of the church fathers or of course, the Bible itself in Slavonic. Right. We can see how things go from Greek to Slavonic. And these names go direct from a Semitic language. So that Semitic language is probably Aramaic, some dialect of Aramaic. That's hard to demonstrate. Right. Like, to prove, because we have this gap. So we could tell from these features of the text. Yeah, this was probably written in some dialect of Aramaic, but we don't have any Aramaic manuscripts. We don't have any textual evidence to trace. We don't know exactly where the text came from that ended up in the Balkans in the Middle Ages."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1007.21,"end":1015.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean. I mean, this is characteristic of a lot of these kinds of texts that they only exist in a translation, you know?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1015.29,"end":1015.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1015.69,"end":1027.06,"speaker":"Fr Andrew Stephen Damick","text":"We just don't have the older version. I mean, most texts from the ancient world did not survive. We only have a minority of them. A little minority, probably."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1028.18,"end":1093.98,"speaker":"Fr Stephen De Young","text":"Yeah. So we can't trace that. That means we also can't trace where it came from. Like, did it come up through Syria? There's some Aramaic traditions in Georgia. Like, did it come through there? Where exactly? The whole history of the text is kind of untraceable at this point, but in terms of when we would date. So that means we've got to take a lot of relative features of the text and that kind of thing to try and figure out how far back this would date from. And so while it conforms to a lot of tropes and things in other Second Temple Jewish literature, especially other Anakic literature from the Second Temple period, there are no explicitly Christian references. So what I mean by that is like we did an episode where we talked about the Ascension of Isaiah, and in the Ascension of Isaiah, there were a couple chapters added that were kind of really on the nose."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1094.06,"end":1095.7,"speaker":"Fr Andrew Stephen Damick","text":"Obviously Christian. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1095.7,"end":1102.06,"speaker":"Fr Stephen De Young","text":"Right. Where it was sort of like this was fulfilled when Jesus did this and this and this. Right, right, right, right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1102.88,"end":1110.4,"speaker":"Fr Andrew Stephen Damick","text":"You know, Christians kind of improving on the text, which sounds crazy to us now, but was completely a normal thing back in the day."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1110.8,"end":1132.99,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. There's nothing like that in this text. Right. Not even. There's not even anything that we could really tell for sure. Came from the heretical sect that was using it in the sense that. Right. Oh, this is explicitly one of the doctrines they taught. Right. Being laid out here. There's not that really either."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1133.31,"end":1135.87,"speaker":"Fr Andrew Stephen Damick","text":"Which strongly suggests that it was pretty well preserved."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1136.11,"end":1136.55,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1136.55,"end":1138.35,"speaker":"Fr Andrew Stephen Damick","text":"From its original status."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1138.83,"end":1163.64,"speaker":"Fr Stephen De Young","text":"Right. And so based on some things. And at a certain point here, later this first half, when we're talking about the contents, we'll get into a little deeper on why. But it's generally dated to somewhere toward the end of the first century A.D. probably around 80 A.D. 80. So shortly after the destruction of the temple in Jerusalem from a non Christian Jewish writer."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1163.72,"end":1167.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which that destruction was in the year 70, for those who don't remember."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1168.52,"end":1187.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It's one of those things I take for granted, but that's because I've spent too much time studying the New Testament. But. Yeah. So we've been mentioning this heretical Balkan sect who we're talking about are the Bogomeals."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1188.01,"end":1190.33,"speaker":"Fr Andrew Stephen Damick","text":"I know it has the best name. Or I prefer this."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1190.41,"end":1190.81,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1191.13,"end":1192.89,"speaker":"Fr Andrew Stephen Damick","text":"The pronunciation Bogumil."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1194.33,"end":1200.09,"speaker":"Fr Stephen De Young","text":"Well, I see. I say Bogomiel because it's like you bought a meal and now you get one free."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1200.97,"end":1203.29,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1207.45,"end":1220.96,"speaker":"Fr Stephen De Young","text":"And you know how much I like to get things free. Big Dutch. So, yeah, the Bogovilles had a pretty good run of it as a heretical sect."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1222.48,"end":1223.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1223.2,"end":1227.6,"speaker":"Fr Stephen De Young","text":"They're around for about 500 years. So."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1228,"end":1236.4,"speaker":"Fr Andrew Stephen Damick","text":"And they were roughly like in the. The region called Macedonia. Now we're going to get a bunch of calls."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1236.81,"end":1239.17,"speaker":"Fr Stephen De Young","text":"Oh, yeah, Macedonia. You're angry. The Greeks."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1239.17,"end":1239.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1239.49,"end":1245.13,"speaker":"Fr Stephen De Young","text":"But also a lot of. A lot of the former Yugoslavia. So Bosnia Herzegovina."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1245.37,"end":1248.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. Like. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1248.33,"end":1252.53,"speaker":"Fr Stephen De Young","text":"Croatia. I mean, it was Serbia."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1252.53,"end":1260.17,"speaker":"Fr Andrew Stephen Damick","text":"It was basically. I think at the time, it was basically Bulgarian empire. That region. Essentially Bulgarian empire. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1260.49,"end":1262.09,"speaker":"Fr Stephen De Young","text":"So. But that area."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1262.71,"end":1262.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1262.87,"end":1340.04,"speaker":"Fr Stephen De Young","text":"Yeah. They're around for about 500 years. When we get into their beliefs, you'll see why they're kind of hard to stamp out. So they. They come into being somewhere around 950 AD. 950. And generally in part of the region referred to as Macedonia. But we're not totally sure. We're not even absolutely sure who the founder was. There are a couple of figures who are sort of regarded, who were sort of regarded as saints, sort of equivalent by the Bogovilles because they did miracles and stuff, who are associated with the beginning of the sect. But it's not totally clear if either of them, or both, or neither were the actual historical founders of it or whether they were just early famous adherents of it. Right. Who did things. And then it was finally stamped out in 1463, which you may notice is like 10 years after the fall of Constantinople, because. Yes. That's when the Turks reached Bosnia."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1340.52,"end":1345.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they just kind of got rid of a number of groups that they were not on board."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1345.57,"end":1347.01,"speaker":"Fr Stephen De Young","text":"The Turks just killed them all."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1347.81,"end":1352.61,"speaker":"Fr Andrew Stephen Damick","text":"So that was all those that were left. I mean, I don't think there were a lot left at that point."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1352.77,"end":1503.73,"speaker":"Fr Stephen De Young","text":"No, no. Well, the Turk, as the Turks moved through, they had been. I mean, they'd been persecuted by the Christian Church too, but the Turks were just slaughtering them. Right. As they went. They had no use for them. And we'll see why here as we talk about the beliefs a little bit. But because they're extinct. That's part of the reason why we don't. Right. We have texts like this, like the Apocalypse of Abraham that were preserved, but the Apocalypse of Abraham wasn't written by them. We just know they used it, you know, so it's not like we have a lot of firsthand like, oh, here's our insider perspective on Bogomil history. Right. We don't have that really. Right. What we do have about them is all written by non Bogomils. Right. Talking about them. And then we have some texts that were used by them, but not necessarily written by them. So we have to kind of conjecture how they made use of them. So. But the Bogomils represented pretty much bog standard Gnosticism. Like, if you're at all familiar with gnosticism in the 2nd and 3rd and 4th centuries AD, this is just a 10th to 15th century sort of re flowering of the same kind of ideas. That being, you know, premise number one, the material creation was created by the devil or by an evil God. They seem to have refined their Marcionism a little bit so that it's not just a straight dualism of good God, evil God or the Old Testament God being the evil God. But they still had the material creation being created by the devil, whereas the spiritual world that was created by the actual God is sort of holy and pure. And so based on that, you get all of the anti material, anti worldly kind of gnostic theological stuff that you would expect. And one of those things, which is part of what makes this hard and what made it hard to get rid of them for a while, is that they rejected any idea of an institutional church."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1505.89,"end":1506.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1506.69,"end":1508.29,"speaker":"Fr Stephen De Young","text":"So they didn't have any kind of ordination."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1509.57,"end":1522.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, a lot of their deal is, it's funny, like they. They reject institutional church, they reject civil authorities, they, you know, they reject sacraments."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1524.53,"end":1524.97,"speaker":"Fr Stephen De Young","text":"It's."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1524.97,"end":1533.41,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting. I mean, this is kind of a. I'm not going to say that they're exactly the same, just say Anabaptists as Protestants, but."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1533.81,"end":1536.01,"speaker":"Fr Stephen De Young","text":"Or certain radical."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1536.01,"end":1536.97,"speaker":"Fr Andrew Stephen Damick","text":"Radical Reformation."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1536.97,"end":1539.2,"speaker":"Fr Stephen De Young","text":"Radical Reformation. Radical Reformation, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1540.07,"end":1556.31,"speaker":"Fr Andrew Stephen Damick","text":"But it's interesting. There's a certain list of things that they're on board with that are the same as this. And this is this feeling that keeps cropping up over church history. Established churches always have some group like this that kind of reacts against them and comes out from them."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1556.63,"end":1565.03,"speaker":"Fr Stephen De Young","text":"And so you have these figures, like I referred to those two. One of them was named Peter and I can't remember the name of the other one, but they're just sort of charismatic figures."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1565.75,"end":1566.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1566.23,"end":1624.51,"speaker":"Fr Stephen De Young","text":"Who are part of the sect. They don't have any official. They don't have bishops, they don't have priests. They don't have ministers or pastors or any kind of clergy. They don't have any kind of sacraments. It's very much sort of a spirituality. Right. And a set of mystical, mainly mystical practices that people were participating in. So they face persecution, you know, in Orthodox and Roman Catholic countries for being sort of both political dissidents and religious dissidents and heretics. Right. But the Turks, when they came in and take over, their rule number one is you're now going to submit to Turkish rule. And so people like the Bogomils, who said, no, we submit to no human."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1625.79,"end":1626.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1626.43,"end":1631.71,"speaker":"Fr Stephen De Young","text":"That wasn't popular with the Turks in the 15th century."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1631.95,"end":1642.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it wasn't. And it wasn't like some of the weird Russian sects that could just run off into the wilderness and no one. And people are like, no, we're not going to chase you over seven time zones. Go ahead."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1643.35,"end":1665.03,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So, you know, they took Constantinople, but the Orthodox, including the Patriarch. Right. You could use the Patriarch to help govern your Christian subjects. Right. Your Christian subjects will generally Right. To submit to the civil authorities. Right. So that's a different case. The Bogoville's, on the other hand, are like, no, we're not Going to listen to you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1665.03,"end":1666.63,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1667.35,"end":1707.03,"speaker":"Fr Stephen De Young","text":"And there's no leadership for them to co opt. Right. So that left one sort of solution to that problem, and that's why they got wiped out. Now, that said. So the Apocalypse of Abraham is a text that was used by this essentially Gnostic sect. But this is kind of a footnote, but. I know, I never do those, but this is kind of a footnote, But St. Epiphanius of Salamis, who I know we've mentioned before on the show, author."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1707.03,"end":1707.99,"speaker":"Fr Andrew Stephen Damick","text":"Of the Bread Box."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1708.55,"end":1709.91,"speaker":"Fr Stephen De Young","text":"Yes. The Panarion."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1710.23,"end":1719.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Patron saint of the second edition of Orthodoxy and Heterodoxy, which was released on his feast day."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1719.99,"end":1720.87,"speaker":"Fr Stephen De Young","text":"Well, there we go."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1721.35,"end":1724.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Not on purpose. It just worked out that way."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1725.46,"end":1728.58,"speaker":"Fr Stephen De Young","text":"Do you fancy yourself a refuter of heresies, Father Andrew?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1731.54,"end":1738.58,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I'm nice. I'm way nicer than St. Epifanios. I mean, go read his stuff, people. I mean, he just doesn't hold back."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1738.98,"end":1742.02,"speaker":"Fr Stephen De Young","text":"Or do you fancy yourself in general? Or are you just fancy?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1743.94,"end":1745.46,"speaker":"Fr Andrew Stephen Damick","text":"I do like fancy coffees."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1746.02,"end":1762.6,"speaker":"Fr Stephen De Young","text":"There you go. You're a fancy lad. I think I wasn't going to go that far. Okay, so we'll have to find out. See, what we need to do is ask your dad, see if he's got a picture of you dressed like Blue Boy. Right. Somewhere at home."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1762.76,"end":1764.2,"speaker":"Fr Andrew Stephen Damick","text":"Thank God, that doesn't exist."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1769.08,"end":1784.07,"speaker":"Fr Stephen De Young","text":"But St. Abifadius in the Predarian was. He did refute a series of heresies, including a bunch of forms of Gnosticism from the original era of Gnosticism. And in there he describes a Gnostic text called the Apocalypse of Abraham."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1784.79,"end":1789.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, same name, but probably not the same text as what we're talking about."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1789.07,"end":1791.51,"speaker":"Fr Stephen De Young","text":"But as far as we can tell, not the same text because."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1791.51,"end":1795.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because the way he describes it is not. Does not describe this text."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1795.75,"end":1796.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1796.39,"end":1797.03,"speaker":"Fr Andrew Stephen Damick","text":"Something else."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1797.03,"end":1823.11,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, so he describes. Oh, they have this text and da, da, da, da, da. And the da, da, da, da. And the Slavonic texts we have do not match at all. And as we said, there seems to be good evidence that this was translated directly into Slavonic from some Semitic language. Right. And what St. Epiphanius would have been looking at would have been in Greek."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1823.91,"end":1824.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1824.79,"end":1842.21,"speaker":"Fr Stephen De Young","text":"So you could. Well, was there some Greek version of this? Is it a whole other text? Is it related to this? Frankly, we don't know. I mean, we did. We have no evidence. We don't know. All we know for sure is that the text St. Epifanios describes, that he was looking at. And the text we have in Slavonic are clearly not the same text."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1842.85,"end":1843.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":1844.69,"end":2007.15,"speaker":"Fr Stephen De Young","text":"There's no way to determine if there's some kind of relationship between the two other than the title. But this happens a lot. When we talked about the. The assumption of Moses, we talked about how when you start digging around in the Church Fathers, they refer to a testament of Moses and an assumption of Moses, and it's not clear if they're the same book. I mean, this happens a lot, right? Because you see ancient authors referring to the title of a book, and then we find a book somewhere with the same or a similar title. It's easy to just assume, oh, this must be the exact same book. But often it's not clear. Right. This is a common occurrence that the relationship between the two is actually not so clear. So all that said about where we got this text, and it is important that we point out that it's preserved by the Bogovilles, right? That it's preserved by this. This heretical sect. Because when we're looking at the teaching of this, there's a difference with the. When we talked about the Testament of Abraham, for example, that's been preserved at Mount Athos, right. And Marsaba Monastery and is among the Dead Sea Scrolls, right? That means the fact that Christian monks were copying this over and over and over again for century after century after century to preserve it was obviously, it's not scripture. They weren't reading from it liturgically, but that was sort of an endorsement of the contents. They thought, there's something valuable here that we need to preserve in terms of the interpretation and understanding of the Scriptures that's presented here. Right? So this was not preserved in that way. So we are not looking at the Apocalypse of Abraham. And from the perspective of, oh, here's a summary of early Christian tradition about anything, okay? But through this heretical sect, having preserved it, we have this text that gives us a window back to around AD 80 to a Jewish writer and how he looked at things and how he thought about things. Right? The world and events in the world and the Scriptures gives us a window back in time to that point. And that's why we're talking about it and how we're going to use it tonight as we talk about it. Here's how people were thinking around the time the New Testament's being written."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2007.87,"end":2009.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2010.27,"end":2014.99,"speaker":"Fr Stephen De Young","text":"Some Jewish people were thinking around the time the New Testament was being written."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2014.99,"end":2039.24,"speaker":"Fr Andrew Stephen Damick","text":"Because, reminder, we're talking in the first century especially, but in the century or two before, and probably, I don't know, maybe even more than that. It's really Judaisms. There's a lot of different views, a lot of different groups. There's no Pope of Judaism saying this is what everybody has to do. So this represents a Judaism, or at least one person, their views."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2039.24,"end":2047.19,"speaker":"Fr Stephen De Young","text":"Now, some Jewish people thought. And remember, all the authors of the New Testament are Second Temple Jews. And Christianity is a Judaism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2047.67,"end":2048.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2048.39,"end":2051.83,"speaker":"Fr Stephen De Young","text":"In the first century A.D. right. It is one of the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2051.83,"end":2052.27,"speaker":"Fr Andrew Stephen Damick","text":"Judaism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2052.27,"end":2107.11,"speaker":"Fr Stephen De Young","text":"Judaism. Yeah. So we'll see. There are. So you can see some connections in thought between the original author of this Jewish author of this text in the first century and some of the New Testament authors. We'll see as we go. And how they were thinking about things, the Bogomils just is the favor of preserving the text without reference to them and their weird doctrines. So the text actually begins sort of in Abraham's youth. There are a lot of stories in Jewish tradition about Abraham's youth. Because Right. When you're reading through Genesis, you get the story of the Tower of Babel, and then you get the story of Abraham with no time marker whatsoever."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2107.91,"end":2109.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How much time has passed?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2109.71,"end":2113.59,"speaker":"Fr Stephen De Young","text":"How old is he, if any. Is this even after the Tower of Babel?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2113.99,"end":2122.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Is he living during the time of the Tower of Babel? It kind of suggests that sort of by virtue of the proximity."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2122.71,"end":2178.59,"speaker":"Fr Stephen De Young","text":"But there are Jewish traditions to that effect. Right. And so that fact that we're just kind of dropped in on Abraham and that when we're dropped in on him, God has chosen him for this whole thing. Right. He's living in Ur, living among the pagans in the biggest city in the world during the Sumerian Renaissance, and God just, boom, has already picked him. And so you get a lot of traditions developing about, well, why had God picked him out of all the people in the world at the time, and what had happened earlier in his life and how did his life relate to the Tower of Babel and what was going on there? It raises all these questions. And those questions generated a variety of traditions that can't totally be merged with each other. They're separate strands. And so one of these strands gets preserved here."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2180.03,"end":2180.43,"speaker":"Caller Gregory","text":"And."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2182.52,"end":2197.56,"speaker":"Fr Stephen De Young","text":"The. Probably the big distinguishing feature of that at the beginning of the Apocalypse of Abraham is Abraham's father, Tara, who is presented as an idol maker by trade."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2198.52,"end":2208.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which in. In Genesis, it's pretty clear that he's an idolater in that he's a pagan. But this is kind of taking it several steps further than that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2208.04,"end":2210.6,"speaker":"Fr Stephen De Young","text":"Right. Well, it's it's fairly clear in Genesis."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2210.68,"end":2211.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2211.63,"end":2225.79,"speaker":"Fr Stephen De Young","text":"There's the them stopping in Haran, which if you know about the moon God, makes sense. But also there's a reference in Joshua when Joshua is giving his sort of final speech, talks about how Abraham's family were idolaters."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2225.95,"end":2226.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2227.39,"end":2232.59,"speaker":"Fr Stephen De Young","text":"Beyond it, but yeah, there's a difference between being an idolater and being a professional idol maker."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2233.31,"end":2233.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2235.71,"end":2297.77,"speaker":"Fr Stephen De Young","text":"That'S sort of next level. And so as an idol maker, there's this sort of dispute that breaks out between him and Abraham, his son, who's being kind of a smart alecky kid, where Tara is trying to teach him about the making of idols and is explaining to him how when you make an idol, that idol sort of embodies one of these spiritual powers or forces in the world, like the storm or like, take your pick, God of whatever. Right. And how we've talked about idolatry on the show, right. That it's now embodied in this idol and so can be manipulated, worshiped, et cetera, et cetera, et cetera. Right. And he's trying to teach this to his son Abraham. Abraham, however, sort of rejoinders, Right. That, well, all of those powers you list are opposed to one another."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2299.13,"end":2312.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is, you know, basically a kind of good first century philosophical argument. Because one of the big concerns is, well, there has to be something above everything or something that starts everything."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2313.45,"end":2317.97,"speaker":"Fr Stephen De Young","text":"Right. Nothing. None of them could be ultimate because they all have some opposite. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2317.97,"end":2318.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2318.37,"end":2337.8,"speaker":"Fr Stephen De Young","text":"Got this God who brings a plentiful harvest. You've got this other God who brings famine. You've got, you know, this God who people look to to be healed of maladies. You have this other God like Reshef, that, you know, brings plague."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2338.12,"end":2353.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, not only does it present that kind of philosophical side, but also this is participates in the standard biblical polemic against paganism, which is these guys are a bunch of small, weak spirits that can't deliver."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2354.3,"end":2393.03,"speaker":"Fr Stephen De Young","text":"Right. And in the stories that are constructed around which pagan worship is constructed, these gods are all opposed to each other and fighting and at odds with each other. So like a pagan can't really deny that even beyond just the philosophical side. Right. Like, yeah, you know, you even look at like Persephone. Right. And Demeter. You have this opposition between Demeter and Hades. Right. Like, yeah, there's all these opposing forces. So there must be some other God who is actually the first principle, who is above and who made all of these others."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2393.51,"end":2393.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2393.91,"end":2398.63,"speaker":"Fr Stephen De Young","text":"Right. And again, notice this is more the biblical version of quote unquote monotheism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2399.65,"end":2410.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. There are multiple gods, but then one most high God, who, unlike the pagan most high gods, is the actual creator God of everything and is omnipotent."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2410.37,"end":2451.1,"speaker":"Fr Stephen De Young","text":"Right. Who is the God of gods. Right, yeah. Who all those powers serve and worship, as we're reminded over and over again in liturgy every week. And so God sort of resolves this dispute between Father and Son by sending fire from heaven that roasts and kills Tara and blows up his idol shop and destroys everything. Yeah. Thus proving that Abraham was right. Doesn't totally conform to the biblical story of Abraham, but, you know, basically compatible."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2452.7,"end":2457.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You'd think that if that really happened, it would have been mentioned though in the Bible. I don't know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2457.44,"end":2460.48,"speaker":"Fr Stephen De Young","text":"But yeah, I mean, it seems like a key event."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2460.96,"end":2461.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2462.4,"end":2464.64,"speaker":"Fr Stephen De Young","text":"Like it would only kind of dying at Haran."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2464.8,"end":2488.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. I mean, do you think, okay, I have a question, I have a question. So do you think that stuff like this is on some level self consciously fiction? You know, like, like, okay, I know it didn't turn out this way, but for the sake of our story, I'm going to write it this way to kind of make my point about idolatry. Well, see, I'm asking you to speculate."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2488.37,"end":2490.53,"speaker":"Fr Stephen De Young","text":"But that's a very modern question."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2491.01,"end":2492.61,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2493.09,"end":2495.73,"speaker":"Fr Stephen De Young","text":"You're told a story. Did that really happen?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2496.53,"end":2498.53,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure, sure, sure."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2499.25,"end":2511.19,"speaker":"Fr Stephen De Young","text":"Right. Like, so I don't think, especially when you're talking about something that's ancient history at the time it's being told."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2511.59,"end":2513.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thousands of years before."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2513.35,"end":2525.43,"speaker":"Fr Stephen De Young","text":"Right. You're, you're trying to communicate something with that story. Like, is every word of it quote unquote, literally true? Like, there's not even a way to ask that question in most ancient languages."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2525.51,"end":2530.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I think it probably just comes down to like, what are their expectations for these different kinds of texts?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2531.35,"end":2531.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2532.32,"end":2541.84,"speaker":"Fr Andrew Stephen Damick","text":"You know, and this text is not trying to be anything other than what it is, which is a certain kind of commentary on the Bible in some level."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2542.32,"end":2573.77,"speaker":"Fr Stephen De Young","text":"Right. Which it's a certain type of question. Right. And I know when I say this, there's people out there who like, find it hard to believe. Well, how could they not have asked that question? Right. Well, there's lots of questions you don't ask when you hear a story. Like every year I read the Parable of the Good Samaritan. Okay. Nobody ever interrupts me and asks, what was his name? Right. I mean, that's a perfectly valid question."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2574.25,"end":2575.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, sure."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2576.09,"end":2584.81,"speaker":"Fr Stephen De Young","text":"But right. If, if someone actually did interrupt me and Ask that that would be a sign that, like, they didn't understand what was happening with me telling this story."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2585.33,"end":2586.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2588.61,"end":2601.65,"speaker":"Fr Stephen De Young","text":"Right. Or where was this? You know, like, yeah, those are questions about facticity. Right. Like, so."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2604.13,"end":2604.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2604.53,"end":2620.13,"speaker":"Fr Stephen De Young","text":"That these were understood to sort of function in this way. So this is communicating to you something about idolatry, something about paganism, something about the difference between Abraham and the other people in the world during Abraham's life."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2620.29,"end":2621.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even his dad."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2622.13,"end":2651.48,"speaker":"Fr Stephen De Young","text":"Right. Including his own family. Yeah. So it's communicating those things. Right. And asking those other questions at that time would have just been taken to be, like, missing the point they would have looked at. Do you really not get what we're talking about here? Like, yeah, yeah. And of course, there's no way to ask a question like, well, what if you had a time machine? Or what if you had a video camera? Because there were neither of those ideas."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2651.64,"end":2652.04,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2653.4,"end":2667.4,"speaker":"Fr Stephen De Young","text":"In existence. And even the word real, right? Like, did that really happen? What do you mean, real?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2669.16,"end":2669.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2669.8,"end":2734.36,"speaker":"Fr Stephen De Young","text":"Like, would a video camera have picked it up and would it have looked exactly this way? Like, are those the exact words that that person said? No more, no less. Right. Like, those questions, again, those questions aren't really getting it right. Not understanding how writing and storytelling and communication happened in the ancient world. And that's why I pretty. I would put forward that that's why people with these various traditions weren't concerned with the fact that they kind of contradict each other. Right. So someone could tell this story about Tara, and then someone else could talk about them trying to throw Abraham into a brick furnace while they were building the Tower of Babel because he wouldn't worship idols. And I don't think if you ask someone who is familiar with both of those traditional stories, I think if you said, do those contradict each other? They would have said no."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2735.56,"end":2737.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they're not trying to do."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2738.52,"end":2743.72,"speaker":"Fr Stephen De Young","text":"They're communicating the same thing about the relationship between Abraham and his idolatrous society."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2744.47,"end":2744.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2745.75,"end":2769.27,"speaker":"Fr Stephen De Young","text":"Right. Even though we would say, well, no, one of those must be true and one of those must be false. At least they could both be false. But they can't both be true. Right. Insert any modern person talking about the four Gospels, right. Was there one angel or two angels? One of these is a lie."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2771.41,"end":2774.29,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, 50% of Legion and this guy. 50."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2775.01,"end":2852.67,"speaker":"Fr Stephen De Young","text":"Yeah. So that's just a miss. Yeah. And again, I know it's hard for us as modern people to not think like modern people. Right. Not ask the questions we ask, because those are the questions We've been brought up and taught to ask. Right. But you have to accept one of the basic steps of humility in general is accepting the fact that other people, even other people who live in the world you do at the same time and in relatively the same place, see things very differently than you do. And that doesn't mean that you're right and they're all wrong. That's just a basic aspect of humility. Let alone people who live in radically different times and places and cultures. Right. Who are going to see things differently than you and you asserting, well, no, mine is right and they're all wrong is not. It's arrogant. We'll just leave it at that. So after. After that terror rising moment."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2854.03,"end":2854.51,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2855.39,"end":2860.51,"speaker":"Fr Stephen De Young","text":"Oh, you didn't even get how that. That's a digging in the crates reference. You didn't get the half of it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2861.39,"end":2862.19,"speaker":"Fr Andrew Stephen Damick","text":"That's okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2862.35,"end":2883.05,"speaker":"Fr Stephen De Young","text":"Someone out there did. I'm confident now after that one reference I made that somebody got like to idiot box. Like, I'm convinced now. No reference I can make is too obscure. Someone out there gets every one of them. Not the same person. But if you ever meet somebody who's."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2883.05,"end":2883.77,"speaker":"Fr Andrew Stephen Damick","text":"Getting all of them."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2885.85,"end":2949.35,"speaker":"Fr Stephen De Young","text":"I'll be deeply disturbed and take it as a challenge. So after that, there's kind of a smash cut. So we move into another thing. There's sort of three pieces to the apocalypse of Abraham. That's sort of piece one. Piece two has to do with Abraham being brought to Mount Horeb to make a sacrifice. Not Isaac in this case. Right. So this is not telling the story of Abraham's potential sacrifice of Isaac. This is a different sacrifice. And this sacrifice looks suspiciously like the Day of Atonement. There are goats involved. Now again, you may be going, well, wait a second. The Day of Atonement doesn't exist until Leviticus 16. Abraham is back in Genesis. Why would he be doing a Day of Atonement thing? Well, we'll get to that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2950.23,"end":2951.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2951.19,"end":2982.52,"speaker":"Fr Stephen De Young","text":"But this is another one of those, you know, is this asserting a literal time. Is this asserting that Abraham practiced the Day of Atonement, like really as a historical fact? I mean, the answer to that is basically no. But also that's a misunderstanding of what the text is doing. So there are goats involved. Right, but so Abraham in this has sort of a guide who's helping him."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2982.84,"end":2989.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, which is. I mean, this is pretty standard for Apocalypse is there's always a psychopomp, but."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2989.32,"end":2998.84,"speaker":"Fr Stephen De Young","text":"In this case, the psychopomp is also a priest who is helping him and is Also an angelic being of some type."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":2999.24,"end":3001.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, with an interesting name, with a."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3001.76,"end":3083.9,"speaker":"Fr Stephen De Young","text":"Very suspicious name, that being Yehoel, which means Yahweh God. Right. That's the name of this being. So that's odd, right? Unless you consider. Right. So for example, in the Torah, when we see the angel of the Lord introduced, who's going to lead Israel and who ends up leading Israel through the Exodus, through the wilderness, through the conquest, and then leaves at the beginning of the Book of Judges, right. What God says will identify the angel of the Lord is that God will place his name in him. So here we have this angelic being who bears the name of God, right? Yahweh Hashem. Right. The name right, is placed upon him. And so this is an instance in the apocalypse of Abraham and from its author in the first century A.D. of what we've talked about before on the show, this idea of a second power in heaven, right. That there is a being who is visible, who interacts with people, who has a bodily form, who is Yahweh, but who is distinguished from Yahweh, the God of Israel who cannot be seen and have you live afterwards."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3085.1,"end":3097.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, within a Christian context, See John, chapter 1, identifying this figure as Jesus of Nazareth. But right. In this text, which is not a Christian text, you're not going to get that, right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3097.98,"end":3109.5,"speaker":"Fr Stephen De Young","text":"You don't get that second part, Right. And the fact that you don't get that is again, like I said, this is why we know there aren't direct Christian elements, right, where somebody's come in and kind of said, aha. And that is, you know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3109.5,"end":3109.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3112.34,"end":3204.38,"speaker":"Fr Stephen De Young","text":"But so he's dressed like a Levitical priest when he shows up in white with a golden sash. So the idea is that this being also has some kind of heavenly priesthood. And so this heavenly priest is now going to sort of walk Abraham through how to do this ritual sacrifice. And to make this sort of even more direct, Azazel, who sort of mentioned in the Day of Atonement ritual, right? The one goat is for Yahweh, the other goat is for Azazel. Azazel also shows up in person. So Yahweh, the God of Israel, shows up in person, in the person of Yehoel. And Azazel shows up in person first as this sort of giant, ugly raven thing. And that raven form, is it just. Cause like ravens are black and they're cool, man. And it's goth. It's a reference to remember. And we've talked about this on the show before, we Were talking about covenants when Abraham did the covenant ritual and he cut the animals in half and split them in half while he was waiting for God to arrive, he had to shoo the birds away."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3205.26,"end":3207.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. So they're kind of getting in the way of."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3207.26,"end":3222.94,"speaker":"Fr Stephen De Young","text":"From the carcasses. So they were trying to sort of disrupt. So the reason he appears as a raven is Azazel's here to kind of try to disrupt this sacrificial ritual. Later on he transforms into his dragon form."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3224.06,"end":3225.34,"speaker":"Fr Andrew Stephen Damick","text":"Is this his final form?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3228.24,"end":3235.36,"speaker":"Fr Stephen De Young","text":"I don't know. I mean, I think. No, I think this is actually his original form."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3236,"end":3241.84,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's interesting because. Especially interesting because, like, usually Azazel is just referred to as being out there somewhere."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3242.48,"end":3242.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3243.04,"end":3246.8,"speaker":"Fr Andrew Stephen Damick","text":"You know, and here he is, like, ready to rumble."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3247.6,"end":3254.96,"speaker":"Fr Stephen De Young","text":"Right, right. And like in the. I mean, you see him in first Enoch, like scheming with the other rebel angels and stuff, right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3255.2,"end":3256,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3256.4,"end":3313.57,"speaker":"Fr Stephen De Young","text":"But he's not like manifesting like this. Right? Yeah, but so he manifests in this dragon form, which is we're going to see a little later in the text of the Apocalypse of Abraham is presenting him as the serpent that shows up in Genesis. Right? The dragon. Right. So this dragon being used the same way it's used in the. In the book of Revelation. Right. To refer to that primordial. Right. Being the devil. So this atonement sacrificial ritual that Abraham is doing here is sort of. This, this section is apocalyptic also in that it's sort of presenting. Okay, here's sort of the spiritual reality that's going on with the idea of atonement."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3314.83,"end":3315.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3315.71,"end":3333.63,"speaker":"Fr Stephen De Young","text":"Right. Because your average Israelite or Judahite or Judean who went to the Day of Atonement ritual, like, didn't see a dragon fighting, Right. Like an angelic penis or anything. Right. What visually. Right. It would have increased attendance, but."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3334.59,"end":3335.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes, it would."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3336.27,"end":3341.55,"speaker":"Fr Stephen De Young","text":"But they didn't actually, you know, like, directly see that. Right. But Abraham is sort of directly seeing that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3341.94,"end":3344.34,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Like, this is what's really going on."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3344.42,"end":3344.82,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3344.82,"end":3355.3,"speaker":"Fr Andrew Stephen Damick","text":"You know, which, I mean, this is like. I mean, this is like the Apocalypse of John is sort of showing you what's really going on, you know, from this higher. On this higher level."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3355.78,"end":3356.14,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3356.14,"end":3363.46,"speaker":"Fr Andrew Stephen Damick","text":"In terms of, you know, what are ordinary people on the ground doing? But here's what's really going on in the heavens in connection with what they're doing."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3363.62,"end":3368.66,"speaker":"Fr Stephen De Young","text":"Right. So we're going to pull back the veil. Right? So this is sort of the cosmic stuff that's going on."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3369.76,"end":3370,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3370.48,"end":3423.33,"speaker":"Fr Stephen De Young","text":"While a Human priest is standing there sacrificing goats or a goat. Right. And sending another one away. Right. But then sort of through this sort of cosmic atonement ritual, Azazel gets defeated and bound and punished and Yehoel sort of emerges victorious. Right. So the idea here is that underlying the reality of sacrifice is a kind of spiritual warfare. And this then gets into why this is associated with Abraham. Right. Even though there's this sort of temporal problem of like, well, wait a minute, the Day of Atonement isn't instituted until Leviticus 16. That's not only post, like Exodus, that's post Sinai. Right, right. Centuries from Abraham."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3423.59,"end":3423.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3426.63,"end":3435.35,"speaker":"Fr Stephen De Young","text":"We're not going to argue about how many, but centuries from Abraham. But so part of what happens, this."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3435.35,"end":3435.67,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3437.67,"end":3459.77,"speaker":"Fr Stephen De Young","text":"A form of argumentation in the kind of texts that are making arguments, but also just a way of narratively presenting things. In narrative texts of the Second Temple period, if you associate something with a figure from Genesis who sort of precedes the Torah, you're presenting whatever you're presenting as being sort of more ultimate than the Torah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3460.81,"end":3508.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and this, this feeds into, or I should say, draws on the sense that, I don't know, almost every ancient culture has, which is that something that's before something else is. Is greater and everything else is, you know, like, like the earlier thing, later things are derived from it. And so therefore it has to be greater. Right. Like just like, for instance, people will say that all of philosophy is just footnotes to Plato. Right. They'll say stuff like that. The idea that Plato is the, the, you know, the ultimate, the greatest philosopher, whatever, which is why then, you know, when Jesus talks about the Messiah being David's Lord and yet also his son, he, you know, he blows their minds by saying that because they're like, well, if he's David's son, then isn't David greater? Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3508.31,"end":3509.67,"speaker":"Fr Stephen De Young","text":"Sort of a paradox. Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3509.67,"end":3519.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's a standard way of thinking which is that earlier things are greater and everything else is, you know, comes later, it's lesser, derivative, etc."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3519.43,"end":3523.67,"speaker":"Fr Stephen De Young","text":"And that's why there's this fascination in Second Temple literature with the figure of Enoch."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3524.23,"end":3525.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3525.67,"end":3534.74,"speaker":"Fr Stephen De Young","text":"Right. Because he's sort of before all of this. He's before the Flood even. Right. He's like, he's sort of the first, like, truly urgent, righteous man."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3535.22,"end":3538.1,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. So righteous that he ascends into heaven."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3538.26,"end":3551.46,"speaker":"Fr Stephen De Young","text":"Yeah. And so whatever he sees, whatever he knew, whatever he had to teach would be sort of more ultimate than anything that came later. More primordial. Right. More. More the deep wisdom. Right. Than the. Than the later things."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3551.62,"end":3552.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3553.14,"end":3583.87,"speaker":"Fr Stephen De Young","text":"And so associating this with Abraham is a way of saying, like, this is sort of the really real reality that lies behind the ritual described in Leviticus. Right. And you even find essentially, like, this is essentially the argument that St. Paul is doing, or a type of this argument that St. Paul is doing in Galatians and Romans when he sort of goes back before the Torah to Abraham to talk about faithfulness."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3584.51,"end":3585.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3585.31,"end":3589.39,"speaker":"Fr Stephen De Young","text":"And the promises to Abraham a greater, more ancient law."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3589.63,"end":3590.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3590.39,"end":3721.56,"speaker":"Fr Stephen De Young","text":"Like, and this is before, this is. Right. And so what comes later doesn't sort of get rid of that. Right. It adds to that. Right. It brings more than that, but it doesn't sort of void that or get rid of that. Yeah. And so that's kind of the idea here behind, even though, again, if you ask the question is this, did this literally happen? Right. Like, that doesn't work, but that's what the text is trying to do. So then the last part of the apocalypse of Abraham is sort of the apocalypse proper in that this is where Abraham sort of goes on this spiritual journey through the cosmos with Yahoel as his guide. Right. As the psychopomp, which is sort of your typical apocalyptic literature thing, Spiritual being is a guide. Right. Human is taken up into the heavenly places. From that perspective, he sees all kinds of truths that underlie the events on earth in the past and the present and the future. Right. So, interestingly, in terms of the identity of Yahoel, again, when they first ascend up into the heavens, they go sort of past the. The four living creatures, the four cherubim, because that's what cherubim means as living creatures. Keruvim means beasts. Right. From Daniel and Ezekiel and Revelation for that matter. Even though Revelation hadn't been written yet, when the apocalypse of Abraham was. Right. But we talked about how in Ezekiel, those were the four main constellations in Babylonian astrology. So the idea is that was like the four quadrants of the heavens were represented by those four creatures. And so if God is enthroned on top of them, he's above the sun, moon and stars. He's above the heavenly host. Right. And when Abraham and Yahoel ascend up above them, Yahoel is like, placed above them."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3723.81,"end":3728.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the same Ezekiel second power in heaven indication going on there."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3728.93,"end":3780.75,"speaker":"Fr Stephen De Young","text":"Right. So that's another element there that. That points to that, and so that points to above it. And so then Yahel takes Abraham on this tour of the cosmos. And then after they've toured the cosmos, Abraham finds out that, oh wait, that wasn't the actual cosmos. That was the. That that God had made. Had created a prototype, like prototype or blueprint or proof of concept for the cosmos before he created the cosmos from it. And Yahoyel had actually taken Abraham on a tour of that model of the blueprint. So Abraham had been shown things the way they were supposed to be. Seems to be the idea in the original."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3781.15,"end":3781.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3781.55,"end":3787.59,"speaker":"Fr Stephen De Young","text":"The way things were as God created them, not necessarily the way they actually were or turned out."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3787.59,"end":3805.55,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you could, you can see where. Although it doesn't have to be this way, but you can see where Gnostics like the Bogumils would be into this idea. Like they would say, oh, well, see that's. That's sort of the. The real, the true cosmos. And we just were down here. We're left in this kind of lesser."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3805.93,"end":3806.97,"speaker":"Fr Stephen De Young","text":"Yeah, lame copy."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3807.21,"end":3811.25,"speaker":"Fr Andrew Stephen Damick","text":"Not real. Yeah, yeah, exactly. But it's. That's not the only way."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3811.25,"end":3813.61,"speaker":"Fr Stephen De Young","text":"Sticks river have terminal play doh. Brain."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3813.61,"end":3814.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3814.81,"end":3816.73,"speaker":"Fr Stephen De Young","text":"This is shadow. This is not real."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3817.13,"end":3820.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3820.13,"end":3824.41,"speaker":"Fr Stephen De Young","text":"And so you could see how it could be interpreted that way. But it doesn't have to be interpreted that way."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3824.41,"end":3825.21,"speaker":"Fr Andrew Stephen Damick","text":"No, no."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3828.17,"end":3862.5,"speaker":"Fr Stephen De Young","text":"So. And then Abraham sort of gets a. After getting a tour of sort of physical cosmos or cosmos in terms of space, he kind of gets a tour of time and history. So he sees Adam and Eve being expelled from paradise. And the language and everything that's used, first of all, very obviously intended to connect the expulsion of humanity from paradise to the exile of Judah to Babylon."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3862.9,"end":3863.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3864.18,"end":3874.5,"speaker":"Fr Stephen De Young","text":"And both of those events are characterized. Are connected here and are characterized as being handed over to Azazel."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3874.9,"end":3880.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because Azazel is that demon that's on the outside of the place where God dwells with his people."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3881.06,"end":3887.46,"speaker":"Fr Stephen De Young","text":"Right, right. It's sort of the rest of the world where God isn't. Is still under the power of Azazel."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3887.83,"end":3889.27,"speaker":"Fr Andrew Stephen Damick","text":"The scary thing out in the woods."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3889.75,"end":3901.75,"speaker":"Fr Stephen De Young","text":"Yeah, the Black Goat of the woods with a thousand young snow. That's. That's Shub niggurath. Just a little Lovecraft live in things."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3902.95,"end":3904.47,"speaker":"Fr Andrew Stephen Damick","text":"I can't read that stuff."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3906.87,"end":3912.15,"speaker":"Fr Stephen De Young","text":"I don't know, man. Having a creature called the Black Goat of the woods with a thousand young is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3912.15,"end":3913.19,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that is pretty cool."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3913.19,"end":3914.59,"speaker":"Fr Stephen De Young","text":"Nicely creepy in and of itself."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3914.59,"end":3921.85,"speaker":"Fr Andrew Stephen Damick","text":"And, and you know, and my literary hero JR Tolkien apparently was into. Or at least did read Lovecraft."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3922.17,"end":3928.57,"speaker":"Fr Stephen De Young","text":"Oh, it's very. It's very clear when you read that Lewis had To like when you read the space trilogy."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3928.65,"end":3936.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure, sure, sure. I mean, the Watcher in the water is probably, you know, on some level a Lovecraftian beast."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3936.81,"end":3952.96,"speaker":"Fr Stephen De Young","text":"Yeah. But so, and, and this connection, by the way, is one of the. Between the exile and the expulsion from paradise is something you find everywhere in Second Temple Jewish texts."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3953.28,"end":3954.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3954.04,"end":3973.32,"speaker":"Fr Stephen De Young","text":"Like drawing those two things together. So, but here it has that wrinkle and, and, and this being handed over to Azazel, being expelled into the realm controlled by Azazel. Here's another connection to the New Testament. Think about how St. Paul on two different occasions talks about somebody being excommunicated from the churches being handed over to Satan."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3973.95,"end":3983.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is basically the idea of anathema, which is, look, you have to stand outside where it's cold and scary and there's demons until you're ready to repent and come back."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":3984.35,"end":4015.73,"speaker":"Fr Stephen De Young","text":"Right, right. And so, yeah. So you can see. And again, this is written after St. Paul lived. This person isn't cribbing from St. Paul. St. Paul's not cribbing from them. We're talking about just how did Jewish people think in the first century about these things? Right. There are certain common motifs and way of thinking about. Ways of thinking about these things. And then the Apocalypse of Abraham talks about Cain being possessed by Azazel. He's the first person who that happens to, but not the last."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4016.45,"end":4027.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, this connects with that idea that in Genesis 4, that crouching at your door thing where you know, which is a demonic force that's going to take him over."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4029.42,"end":4077.07,"speaker":"Fr Stephen De Young","text":"Right. And when Azazel takes somebody over, he uses that person to attack the righteous. So Cain kills Abel. But all through history there are these people under the control of Azazel who try to attack God's people and destroy them and attack the righteous and destroy them. And this is related to what we saw in the earlier section. So you've got Azazel there in his dragon form and you've got Yahoel there, but the actions going on in the world are taking place. The sacrifice itself is being done by Abraham. Right. There's a human who's doing the thing. Right. And the spiritual warfare is kind of happening around him. So the same kind of thing is happening with Cain, except it goes the other way."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4079.74,"end":4079.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4079.94,"end":4158.07,"speaker":"Fr Stephen De Young","text":"So it's depicting what happens in Genesis 4, where God speaks to Cain, but then sin is crouching at his door. Right. As. As if. Right. Much like with Abraham. There's God there. Right. Yehoel, there's God there on the one side and Azazel on the other. Right. And Cain chooses to be possessed by Azazel and bring Azazel's works into the world by killing his brother. Right. So this, this section, as we're going through history, sort of culminates in a description of the destruction of the second temple. And this is why we're pretty sure it was after AD 70 that this was written. Because Right. After it describes the destruction of the second temple, it goes on to describe these sort of 12 steps or 12 eras or 12 things that unfold before the end of time, before the end of days. Right. And those 12 things are like super cryptic and mysterious. Not like Book of Revelation or Daniel cryptic, like Nostradamus cryptic."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4159.13,"end":4163.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. Open to massive different kinds of interpretations."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4163.93,"end":4286.73,"speaker":"Fr Stephen De Young","text":"Yes, like wildly different. Right, yeah. And so someone could say, well, how do you know that the destruction of the second Temple wasn't also being predicted? Well, it's described in very on the nose, straightforward terms. Right. And it's the last thing described in those kind of terms before we get cryptic, which pretty strongly implies that that was for the original writer of this. That was history already. Yeah, that was the past already. Because of how he writes about it. There's no vagaries at all about the destruction of the second temple. But then as soon as you get past the destruction of the second temple, everything gets really vague and weird and symbolic and. Right. Very open to interpretation. So it's pretty, pretty firm that this was written shortly after. Right. By a non Christian Jewish writer. And then when you get to the end of the 12 things, you start getting things. They're still described symbolically and stuff, but it's stuff we're more familiar with. Like he has the idea of the final trumpet there, which you also see in St. Paul in second Thessalonians. And then after the final trumpet, the Messiah comes and destroys Azazel and destroys his enemies, and then the last judgment happens and the Resurrection. Right. So we go back to sort of the familiar end of the world Things within 1st century Judaism and early Christianity that we're used to at the end of that. And so there's just these 12 things in between there that are weird and mysterious. Notice also though, that so we had this image of Abraham doing this sacrifice that brought about the defeat of Azazel. And now that same event is described as not Yahoel, but the Messiah defeating Azazel and that happening at the end of the world."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4289.06,"end":4302.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a sense in which the sacrifice of Abraham as the Day of Atonement is kind of doing everything, all. All of that salvific stuff everywhere in history all at the same time."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4302.58,"end":4314.1,"speaker":"Fr Stephen De Young","text":"Yeah. It's sort of this cosmic event more than a. Yeah. Like claimed historical event and points to some kind of cosmic atonement that we're going to talk about some more in the second half."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4314.26,"end":4315.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4316.32,"end":4333.28,"speaker":"Fr Stephen De Young","text":"So the last thing to really comment about in the text of the Apocalypse of Abraham itself before we move to that second half is within the cryptic parts, there is this description. This cryptic description. Right. Of a man who comes."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4334.4,"end":4335.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4335.28,"end":4343.93,"speaker":"Fr Stephen De Young","text":"And that's all the description we're given of him, is that he is a man. No one stood up and interrupted and said, what's his name?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4346.33,"end":4347.09,"speaker":"Fr Andrew Stephen Damick","text":"So just."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4347.09,"end":4364.89,"speaker":"Fr Stephen De Young","text":"Amen. And so here's the description in the cryptic part. A man comes. Some of the followers of Azazel and people from the pagan nations and some of the sons of Abraham worship this man."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4365.69,"end":4366.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4367.06,"end":4370.02,"speaker":"Fr Stephen De Young","text":"But then some other sons of Abraham beat this man."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4371.14,"end":4371.7,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4372.42,"end":4415.25,"speaker":"Fr Stephen De Young","text":"And then after the man recovers from his beating, all those folks begin to worship him again. And when he sees this, when Abraham sees this, Abraham gets told by God through Yahel that the man. Right. Is going to be one of Abraham's descendants. Then that person is going to relieve the persecution of the Jewish people and that he will be stood up on the last day and stood up there in the Slavonic maybe covering up a word for like, resurrection, like rising and be raised on the last day."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4416.05,"end":4430.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Yeah. So if there's anything maybe that we might possibly think of as, oh, here's the Christian bit, this might be it, maybe. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4430.49,"end":4432.05,"speaker":"Fr Stephen De Young","text":"Because that kind of sounds like Jesus."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4432.05,"end":4441.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. But it should be pointed out that nothing in there isn't found in some way in the Old Testament already."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4441.97,"end":4449.01,"speaker":"Fr Stephen De Young","text":"Well, yes, but also, if this was coming from a Christian, you wouldn't have him recovering from a beating, you'd have him get killed."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4449.01,"end":4451.98,"speaker":"Fr Andrew Stephen Damick","text":"Killed and come back to life. Exactly, exactly."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4451.98,"end":4473.58,"speaker":"Fr Stephen De Young","text":"Right. Which we don't have. So there's no death and resurrection here until he's raised up on the last day. Right. And what he does seems to be in relation primarily to the pagan nations."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4475.26,"end":4478.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Rather than to Israel, not Israel itself."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4479.24,"end":4493.32,"speaker":"Fr Stephen De Young","text":"Right. And so what seems to be going on here is that this is actually a reference to Jesus, that by the time it's being written, it's a historical reference to Jesus. Because we're about 50 years after the fact."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4495.4,"end":4500.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And by this point, Jesus is very, very, very well known and the church is Beginning to expand considerably."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4501.4,"end":4511.6,"speaker":"Fr Stephen De Young","text":"Right. And so this is representing a non Christian Jewish perspective on nascent Gentile Christianity."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4513.04,"end":4522.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's this sense of, okay, all these Gentiles are coming to worship Israel's God. Can we make."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4522.6,"end":4524.08,"speaker":"Fr Stephen De Young","text":"That's good for Jewish people."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4524.32,"end":4525.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's good."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4525.96,"end":4528.76,"speaker":"Fr Stephen De Young","text":"Providing them some relief from persecution and this kind of thing."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4528.76,"end":4534,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's good. So how can we. Without saying, yeah, Jesus is our Messiah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4535.08,"end":4537.68,"speaker":"Fr Stephen De Young","text":"Without saying he rose from the dead, without saying he's the Messiah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4537.68,"end":4537.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4537.96,"end":4540.36,"speaker":"Fr Stephen De Young","text":"So this is written by someone who isn't a Christian."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4540.84,"end":4541.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4541.28,"end":4543.64,"speaker":"Fr Stephen De Young","text":"Sort of like sees Christianity as beneficial."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4544.92,"end":4556.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. How can space for him in our. In our world? And it turns out that there is actually a figure that was expected amongst some Jewish people."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4556.36,"end":4573.54,"speaker":"Fr Stephen De Young","text":"There is a category for this that gets applied here. So this is one of the earliest instances, I think, of the application of this category to Jesus by a Jewish author. That category being what's called the Messiah Ben Joseph."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4574.02,"end":4583.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You call everybody that. We. I can't remember which episode it was now, but we talked in an earlier episode about there being a tradition of multiple messiahs."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4584.34,"end":4587.54,"speaker":"Fr Stephen De Young","text":"We did an episode, I think, on just Messiah in general."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4587.54,"end":4588.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4588.54,"end":4592.1,"speaker":"Fr Stephen De Young","text":"And I think we even briefly talked about Messiah Ben Joseph in that. A category."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4592.1,"end":4600.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's not just that there's multiple different versions of the Messiah. There are traditions in which there are multiple messiahs. Like there will be more than one."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4600.5,"end":4640.87,"speaker":"Fr Stephen De Young","text":"And they'll do priestly one, a kingly one. Right. So the one we usually think of as the Messiah would be the kingly Messiah, the Messiah Ben David, the son of David. Right. The King in David's line. Right. That's usually when we just say the Jewish Messiah or the Messiah, that's usually what we're talking about in our parlance. But there are pieces of Jewish tradition about other messiah figures. Messiah Ben Joseph, the son of Joseph is in Joseph in the book of Genesis, as in Ephraim, the largest and central tribe of the northern kingdom of Israel that got dispersed."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4641.03,"end":4643.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then closely associated then with the Gentiles."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4644.2,"end":4777.85,"speaker":"Fr Stephen De Young","text":"Right. So then if you think about when we talked about the testaments of the twelve patriarchs previously in this series, we talked about how in a couple of those testaments, it talks about the. The northern tribes of Israel being reconstituted since they were dispersed among the Gentiles like seed. They're going to be reconstituted from the returning Gentiles coming back to worship people, the nations coming back to worship Israel's God. The figure of the Messiah Ben Joseph, the Messiah, the son of Joseph, the son of Ephraim, is this figure who would come and gather regather the northern kingdom by gathering people from the nations to worship the God of Israel, to leave aside idolatry, to leave aside other sinfulness and come to worship Israel's God. And at various points throughout history, Jewish writers, non Christian Jewish writers have to varying degrees recognized Jesus of Nazareth as this figure or as maybe being this figure or Christianity as a religion being this figure for these various reasons. So the Apocalypse of Abraham seems to be at least so far, the earliest testimony we have. And I don't know how much earlier you could get testimony than AD 80. But to a non Christian Jewish person sort of applying these traditions to Jesus of Nazareth to say that they don't believe he's the Messiah Ben David, which of course we as Christians do. Right. Believe he's the Davidic Messiah. But to say he is a Messiah in some sense and to recognize what's happening in Christianity as a good thing and a movement of God. Right. That's not an artificial thing that Rabbinic Judaism dreamed up centuries later to try to get along better with Christians. That is a tradition from very early on. Right. And applying that to Jesus starts to happen places like here very early on."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4778.01,"end":4795.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. All right. Well, that's basically our summary of the Apocalypse of Abraham. We're going to offer some more commentary on exactly everything that is going on when we get back after the break. First, we'll take a couple of questions right after this break. So we'll see you in a second."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4796.23,"end":4812.54,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4817.66,"end":4820.42,"speaker":"Fr Stephen De Young","text":"The centuries after the Protestant Reformation brought."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4820.42,"end":4823.34,"speaker":"Announcer","text":"About a radical reinterpretation of The Epistles."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4823.34,"end":4827.02,"speaker":"Fr Stephen De Young","text":"Of St. Paul, disconnected from any historical reality."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4827.5,"end":4833.59,"speaker":"Announcer","text":"But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4833.91,"end":4839.67,"speaker":"Fr Stephen De Young","text":"In St. Paul the Pharisee, Jewish Apostle to all nations, Father Stephen DeYoung surveys."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4839.67,"end":4842.55,"speaker":"Announcer","text":"Paul's life and writings, interpreting them within."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4842.55,"end":4845.27,"speaker":"Fr Stephen De Young","text":"The holy tradition of the Orthodox Church."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4845.43,"end":4856.59,"speaker":"Announcer","text":"This survey is followed by De Young's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology. By using words and ideas grounded in."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4856.59,"end":4873.53,"speaker":"Fr Stephen De Young","text":"1St century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancient faith.com Again, that is store.ancient faith.com."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4875.05,"end":4891.14,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4891.7,"end":4900.94,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. On this episode of the Lord of Spirits podcast, we are talking about the apocalypse of Abraham. One of those."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4900.94,"end":4903.54,"speaker":"Fr Stephen De Young","text":"I just, I just got an important communication from Amazon."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4903.7,"end":4904.42,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4904.74,"end":4908.5,"speaker":"Fr Stephen De Young","text":"They want me to organize my space with stylish bookcases."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4909.72,"end":4913.32,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if you need to go do that, go ahead."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4914.44,"end":4915.88,"speaker":"Fr Stephen De Young","text":"I don't know, I'd probably take too long."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4918.52,"end":4920.52,"speaker":"Fr Andrew Stephen Damick","text":"I'm sure the heathen dogs would get in the way."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4921.56,"end":4924.2,"speaker":"Fr Stephen De Young","text":"Oh, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4924.28,"end":4940.11,"speaker":"Fr Andrew Stephen Damick","text":"So if at all. Right, we are going to take a couple of questions. So waiting very patiently, all the way from the great white frigid north Ontario, we have Amir. So, Amir, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4941.23,"end":4942.67,"speaker":"Caller Gregory","text":"Hello, Fathers, can you hear me?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4942.99,"end":4945.31,"speaker":"Fr Andrew Stephen Damick","text":"We hear you. Welcome. Awesome."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4945.39,"end":4982.39,"speaker":"Caller Gregory","text":"Awesome. Yeah. So I have a question about, are there any books that are dangerous to read? Because I was reading about St Ignatius, Brench and Hope. I'm saying that. Right. But he was talking about this one monk on Mount Athos and he read the Imitation of Christ. I can't remember which Catholic author, but. And the monk became so delusional, it was just deep into pre lust. He was like chained up or whatever, feeling hot to the. To the touch or whatever. So I was wondering, like, can that like, happen? Are there books where we should avoid something like that or anything?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":4983.43,"end":5029.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, and yeah, that was written by Thomas a Kempis, by the way, from the 15th century. I mean, certainly there have been times in the history of the church where like books have been destroyed. Right. Particularly when you're talking during some of the Imperial era, the Roman Imperial era, Byzantine Empire. But I don't recall. I mean, Father, correct me if I'm wrong about this, but I don't recall conciliar decrees forbidding certain things from being read. Like, you must not ever read this and that is a rule for all Christians or something like that, I think. Well, go ahead. Yeah, go ahead."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5029.94,"end":5031.62,"speaker":"Fr Stephen De Young","text":"You got to contextualize it a little."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5031.7,"end":5033.38,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. My thought is like."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5033.38,"end":5036.42,"speaker":"Fr Stephen De Young","text":"Is like the vast majority of Christians couldn't read for most of history."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5036.42,"end":5038.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. But also it's."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5038.18,"end":5039.06,"speaker":"Fr Stephen De Young","text":"It wasn't an issue."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5039.3,"end":5144.74,"speaker":"Fr Andrew Stephen Damick","text":"What? Yeah, I mean, I think, like, if someone came to me, I would say, well, what is it? Why do you Want to read this book? You know, are you doing research? Are you planning to submit yourself to the wisdom or, you know, information, whatever contained herein? Because, like the idea that reading Thomas a Kempis is going to kind of magically destroy your spiritual life, I don't think that that's true. I mean, I don't know the particulars of this, the story about this Athena monk, you know, and why, why he did that, what he was hoping to accomplish by that. Obviously it was not a good idea for him. Many people have read it and, you know, didn't, you know, didn't fall into some kind of delusion or whatever. Although I'm sure someone's going to write it and say, actually every single person who has ever read it. I don't think that's true. So, I mean, I, I would say, you know, it's, it's just like anything. Like, you know, on some level all things are lawful, but not all things are expedient. You know, is it a good idea? Is it worth your time? Is this something that's actually going to be valuable? You know, I mean, mind you, there are some kinds of literature that are completely unredeemable. Like, you know, you should not read pornography, not because there's a rule against it, but because it's terribly bad for you. You know, like, it's just. We don't need a rule against it. It's just, it's like, it's like, yes, there's a rule. Do not drink poison. That's a rule. Like, no, you just shouldn't drink poison because it's going to kill you. You know, I guess I'm not aware of like officially forbidden books. Well, I don't know."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5145.06,"end":5164.59,"speaker":"Fr Stephen De Young","text":"Yeah. So for the most part. Right. 99% of the time, this is a very personalized question that really should be between a person and their spiritual father. Right, Right. It's not is this a book that should be read? It's is this a book I should be reading right now?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5165.39,"end":5165.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5166.35,"end":5265.29,"speaker":"Fr Stephen De Young","text":"Right. And that's gonna be different for different people. Right. Like, I famously, for decades now, because I'm an old man, have read Nietzsche every Lent. And that's not like a spiritual discipline I recommend to people. Right. There's a lot of people who don't need to be reading Nietzsche where it's either a waste of time or might be deleterious to them in some way. Right. So that's not right. My conscience has been seared as by a hot iron. So there's no damage. Further damage possible to My soul. But so 99% of the time it has to do with the person, right? And that's. I'm also leaving in the has to do with the person category. Books that are just frivolous, right? Because as we talked about with the whole clean and unclean thing, the opposite of holy is common, not evil. Right? And so like reading novels that are just dumb entertainment because you need a break and you need relaxation as a human with human physical and mental limitations. Right? Like reading Charles Dickens, which is the literary equivalent of a sitcom. Come on. It absolutely is massive shade. Charles Dickens would be writing sitcoms if he was alive today. That's serialized a chapter at a time in newspapers. Every sitcom has done an adaptation of A Christmas Carol."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5265.29,"end":5267.49,"speaker":"Fr Andrew Stephen Damick","text":"It's just an indication of how we've fallen."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5268.13,"end":5351.17,"speaker":"Fr Stephen De Young","text":"QED Anyway. Right. But just reading, you know that, that's fine, right? Like, I'm not saying there's something wrong with that. Now even that you need to discuss with your spiritual father because there's an issue of, you know, how much of your time are you spending doing that. Right. If you have a job that's mentally taxing and you want to come home for an hour and read some John Grisham novel or Stephen King novel or something just to unwind at the end of the day, that might be totally spiritually healthy and fine for you. There are other people who become obsessive about all kinds of things and who that might not be good or they might be squirreling away way too much time that they should be using on other things, doing that. Right. There are actually in the world evil books. There are. There are literal evil books. You will probably not run into them. You won't just run into them walking around. This is going to come off as kind of a tease, but I'm not going to go further into the story. But just through a long series of events, I was mailed a copy of an 18th century German literal magical text."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5351.81,"end":5352.29,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5352.53,"end":5361.33,"speaker":"Fr Stephen De Young","text":"Actually surprised to dispose of it. And literally an hour of it sitting in my mailbox box, warped and rotted out the wood of my mailbox."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5361.57,"end":5362.37,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5364.05,"end":5401.26,"speaker":"Fr Stephen De Young","text":"Yeah, I burned it, for the record. So there are actual evil books out there that no one should read and no one should even own. Right. But unless you're going out looking for, like, occult books. And by occult books, I don't mean the ones you find in the like, astrology occult section at Barnes and Noble that are about crystal power and stuff, Those are just dumb. You will lose IQ points reading them. But, like, they're not going to bring demons into your home. Right. There are, actually. I'm talking about actual evil books. You have to go out and find them on purpose."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5401.26,"end":5401.86,"speaker":"Fr Andrew Stephen Damick","text":"For the most part."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5401.86,"end":5441.43,"speaker":"Fr Stephen De Young","text":"Yeah. And don't. Right. Don't do that. Seems obvious, but those books are. And have been. These are the kind of books that. Like in the Book of Acts, when they say they're coming out and burning their mat. Their books of sorcery and stuff. Right. Those are the kind of books I'm talking about. Right. That's not Dungeons and Dragons books. That's not. Right. Rock albums. Right. This is a whole other thing. And when you're around it, you know it. So. But that's, you know, this fraction of a percent of books in the world."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5441.67,"end":5444.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Well, does that help you, Amir?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5445.75,"end":5449.35,"speaker":"Caller Gregory","text":"That does. If I can just add one comment, if that's okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5449.75,"end":5450.15,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5450.71,"end":5466.93,"speaker":"Caller Gregory","text":"Yeah. So, one thing about this question. I know it's a fake book, but the Swan book, like the Necronomicon or whatever, I can't remember who it's by, but that. Guess that that just reminds me of it saying, oh, if I read this, I'm going to go crazy or whatever, you know? But, yeah, let's just."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5467.57,"end":5469.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That's a fictional book, though."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5469.65,"end":5470.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5470.69,"end":5474.85,"speaker":"Fr Stephen De Young","text":"Now, my wife has a cookbook based on it called the Necronom Nom Nomomicon."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5477.49,"end":5494.51,"speaker":"Fr Andrew Stephen Damick","text":"Of course she does. All right, thanks for calling, Amir. We're going to take one more call. And we have Gregory calling from. At least his phone says he's from Jacksonville, Florida. Although. Are you from Jacksonville?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5496.19,"end":5497.79,"speaker":"Caller Gregory","text":"I am now from Jacksonville."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5498.19,"end":5506.35,"speaker":"Fr Andrew Stephen Damick","text":"I was in Colorado. You were from Colorado. Actually, now that I look closely at the call board, your phone does say you're from Colorado, but you say that you're from Jacksonville."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5506.35,"end":5508.49,"speaker":"Fr Stephen De Young","text":"And we believe you've gone from the heights to the depths of."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5509.12,"end":5510.8,"speaker":"Fr Andrew Stephen Damick","text":"Oh, boy. It's true."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5510.8,"end":5513.2,"speaker":"Caller Gregory","text":"Fitting for my question. I have a question about dragons."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5513.6,"end":5514.04,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5514.04,"end":5516.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay. You've come to the right place."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5516.56,"end":5570.71,"speaker":"Caller Gregory","text":"From the heights, you said, then, the word cherub is translatable to living creature. And I know that seraph can mean serpent or, like, fiery. And I guess it just occurred to me, I cued into the idea that I've been always interested in St. George, that dragon slayer. And I'm of firm belief that what he fought was maybe. Maybe not carbon based, but it was definitely a dragon. Like, unquestionably a dragon. So I'm wondering if maybe you can bring some clarification to the idea of, like, the falling of angels and the falling of higher angels being capable of being, in a sense, living, but also maybe not necessarily carbon based, but still we can interact with them and St. George can slay one. And so I just want to see the. If you have anything that maybe you can share with me about, about that relationship."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5571.59,"end":5676.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, there's like dragons. I mean, there's good dragons and bad dragons. You know, I mean, generally speaking, particularly in, in Western Christian tradition, most dragons are bad, although not all, but, you know, and, and in, and in the orthodox tradition, yeah, there's bad dragons, right? The serpent, the devil, you know, all this kind of stuff. But there are also good dragons, you know, which are the obedient seraphim. And you can even see like I was actually at a. I was actually at a Greek monastery in California this past weekend, and on their iconostasis, they had both good and bad dragons. So you could tell the good ones because they were up on top of the ikanostasis, like right next to the cross, you know, kind of honoring the cross and guarding the cross. So these were functioning like seraphim. And. But then among other images on the, the holy doors, these incredible, beautiful carved wood holy doors, you see dragons that are being scared away by angels with swords. So clearly those are not good dragons because they're being attacked by angels, you know. So, you know, St. George is, is, you know, obviously functioning in that same way, right? He's functioning this kind of michaelic way, you know, like St. Michael the, the dragon slayer, kind of the original dragon slayer in a lot of ways, as he's depicted in the book of Revelation and stuff. So, I mean, Father, I mean, comment on this idea of, of living creatures. I mean, how does that. Like I tend to think that, for instance, the reason that western dragons have four feet is because of this kind of almost a half merger of seraphim with cherubim, you know, because cherubim are usually depicted as four footed, but seraphim either no feet or maybe just."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5677.21,"end":5684.73,"speaker":"Fr Stephen De Young","text":"Well, yeah, so it's also worth mentioning that according to the Cynicsarian of his feast, St. Michael is also a seraphim."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5685.37,"end":5688.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So dragon on dragon action."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5688.81,"end":5751.89,"speaker":"Fr Stephen De Young","text":"Yeah, but yeah, so what, what's really meant by caravim is like a lama, Su actually the original context. So think, you know, it gets translated, Zoe, right? Like living creature in Greek and then the faces, the four faces are described, Right. But the idea is more of like a sphinx like creature from our perspective, right? What we think of when we think of a sphinx or a lamassu, which is the Babylonian version that has like a human head and then like a lion body and wings. So it's more a sort of typical theriomorph thing than a dragon thing. That's. And so like in. For Babylonians, those were different because the dragons were sort of the primordial gods."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5755.34,"end":5755.9,"speaker":"Fr Andrew Stephen Damick","text":"Whereas."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5757.98,"end":5884.54,"speaker":"Fr Stephen De Young","text":"The Lamassu, which would correspond more to the Cherubim, were sort of the guardians, the throne guardians of the gods. Right. So they're sort of. There was a definite rank system there. They get merged a little more. So what you really have happening in the Hebrew Bible is that the Hebrew Bible is constantly interacting with neighboring traditions and those traditions are not identical. So for example, a lot of the Hebrew Bible is interacting at the same time with Mesopotamian traditions and Egyptian traditions, and then also Canaanite traditions in addition. But so when you think about Egyptian traditions and the way serpents function in Egyptian tradition, it's much closer to the way that the Lamassu, the Keruvim function in Mesopotamian traditions, whereas the dragons are sort of elevated above that in Mesopotamian tradition. And so I think that's why you get the places in the Hebrew Bible where you get this kind of equivalence and semi merger between Seraphim and cherubim is because these different roles in Egyptian versus Mesopotamian tradition and the Hebrew Bible interacting with both of those at the same time, if that makes sense. But yeah, it doesn't take either of those as being 100% accurate. It doesn't, like pick one and say, okay, this is the one that's true. Both of those sets of pagan traditions aren't actually true. It's interacting with and trying to refine both of them. And so you get a little loss of clarity between those, those two sets of beings."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5888.97,"end":5891.69,"speaker":"Fr Andrew Stephen Damick","text":"Does that help clear things up for you, Gregory?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5892.01,"end":5942.34,"speaker":"Caller Gregory","text":"There's a million follow ups, but I'll try my best to retain those for like maybe an email chain or something for the Facebook group Okie doke. I guess mainly it was, it was mainly just the idea of, I guess, Cherubim, Seraphim are mentioned as being the highest ranks among angels before their fall. And then after their fall, you would assume that they still sort of hang on to this title as like biggest brute, you know, and the idea of the spiritual world and the physical world just being the world, like there is no one and then the other. There's just. There is. Right. It's mostly the idea of what St. George accomplished to me is more than just like, oh, he kicked a demon out by Praying. And it's a little bit more violent, like physical on physical. I guess I'm just making sure I'm not like in a really bad wrong thinking with that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5942.34,"end":5962.21,"speaker":"Fr Stephen De Young","text":"But it's also not like he killed one of the last surviving dinosaurs. Right, right. That kind of total materialist kind of way of going about it from a young Earth perspective. Right. Of like, oh, just some random dinosaur had survived in Libya and St. George killed it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":5962.21,"end":6022.53,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it should be mentioned, right. Like, St. George accumulates lots and lots of different elements to his story, but the one that's always the most important is that he's a martyr. Right. And to me, that's, you know, there's so many, so much in our hymns about the martyrs defeating demons by virtue of being martyred that I think that that's the key to interpreting what's going on there. That doesn't mean that we shouldn't tell the story in the way that it's traditionally told. We absolutely should. Absolutely should. But I think it's important, you know, as Father Stephen alluded to, to not make it like, about, oh, he was just this amazing soldier who killed a big lizard, you know, a demon lizard, but a lizard, you know, but, but."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6022.53,"end":6024.93,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, There's a golden mean."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6025.57,"end":6026.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6026.41,"end":6036.88,"speaker":"Fr Stephen De Young","text":"Between these two extremes of just spiritualizing everything or just trying to turn everything into a modernist materialist kind of thing."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6037.2,"end":6065.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. All right, thank you very much for calling. Okey doke. Well, where are we going now, Father? When we talk some more Atonement stuff, I think. I mean, it's interesting. We did that episode on Atonement a while ago now, a few years ago now, and it's still one of the ones, I think, that a lot of people come back to and a lot of people have questions about and are really fired up about. So, I mean, this text offers us the opportunity to go deeper. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6065.85,"end":6066.49,"speaker":"Fr Stephen De Young","text":"Touch on some of that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6066.49,"end":6067.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6068.33,"end":6154.32,"speaker":"Fr Stephen De Young","text":"Well, so as we said, we've got a depiction in this text, again from at least some quantity, some element of the Judaisms of the Second Temple period who are, as we see in this text, looking for a kind of cosmic day of atonement to happen. Right. A kind of cosmic atoa. Tap it. And so what we want to do for the rest of this half is kind of talk about, well, why would they be looking for that? And what would the shape of that cosmic atonement that they were looking for be right? And spoilers, in the third half, we're going to be talking about Christ's Atonement and how that relates to this expectation, this Jewish expectation of a cosmic atonement. Right. How those. How those things intersect. Right. The actual fulfillment of it in Christ, how that intersects with the Jewish expectation. So when we talk about kind of this cosmic day of atonement we're looking for, we're talking about a fulfilled day of atonement. So this is not something completely different than the day of atonement in Leviticus 16. It is not just like, well, that thing stinks or it's dumb, so we're going to get rid of it. We're going to replace it with something else. That's not what they're looking for."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6154.4,"end":6156.16,"speaker":"Fr Andrew Stephen Damick","text":"No. That's not what fulfillment means."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6156.96,"end":6161.59,"speaker":"Fr Stephen De Young","text":"This is fulfilled in the sense of filled full, like we've talked about before."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6161.99,"end":6163.59,"speaker":"Fr Andrew Stephen Damick","text":"So this is its final form."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6163.99,"end":6186.79,"speaker":"Fr Stephen De Young","text":"Right? Yeah. Taking the structure. Taking the structure, the meaning, the effect, the power of the day of Atonement and filling that up. Right. The ultimate example. Right. The ultimate instance of it. Right. That's what we're talking about. And so that's why we've been describing it as cosmic. This is not cosmic. Like it has to do with space."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6187.87,"end":6188.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6188.67,"end":6232.03,"speaker":"Fr Stephen De Young","text":"Silver Surfer does not make an appearance. This is cosmic in the sense of. It has to do with the whole cosmos. Right. The whole creation. So it's gonna affect the whole creation. And there are several reasons why people in the Second Temple period, especially in the first century bc, the first century AD where this text is written, why they're looking for that kind of thing. Right. And one big one is that Yom Kippur, the Day of Atonement, the ritual that they've been doing since it was given in Leviticus 16, kind of points to its own limits."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6233.47,"end":6234.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6234.91,"end":6248.2,"speaker":"Fr Stephen De Young","text":"It's just limited by nature. And you could tell that. Right. By the practice of it. Right. Practicing it is going to show you the limitations. Right. So, for example, we have to do it every year."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6248.76,"end":6256.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which suggests that it kind of wears off or is needed again, you know, Meaning it's not."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6258.68,"end":6264.24,"speaker":"Fr Stephen De Young","text":"It's limited in its effectiveness. It's limited in the duration of its effectiveness, at least. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6264.24,"end":6264.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6265.27,"end":6318.59,"speaker":"Fr Stephen De Young","text":"That we have to keep doing this. It's additional to the other sin offerings and peace offerings. So they've got this daily and weekly cycle of sin offerings and peace offerings going on to deal with sin. And then we also need to do the day of Atonement once a year. Right. So clearly, the Day of Atonement by itself is somewhat limited in terms of how it's able to deal with sin, which is the very problem it's there to deal with. Now, that said, we have to be careful. This is, again, a point that St. Paul always makes very carefully when he's talking about the fulfillment of things, of the Torah. That this is not to say Yom Kippur was bad, the day of atonement was bad, that it didn't work. It did everything it was supposed to do. It did everything Leviticus 16 said it would do."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6319.51,"end":6319.75,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6320.31,"end":6341.03,"speaker":"Fr Stephen De Young","text":"The problem is not with the Day of atonement. The problem is not with the Torah. The problem is with humans, the humans who are trying to practice it and failing. Right? So the reason you have to do it every year and the reason you have to do all these other sin offerings, and this is human sinfulness, Right. The real problem is that the humans keep sinning."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6341.91,"end":6342.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6342.63,"end":6376.62,"speaker":"Fr Stephen De Young","text":"The people in the camp keep sinning. The Israelites keep sinning and making this. This perpetual thing that has to be. That has to be dealt with. Right. And remember what we're talking about when we talk about the Israelites keep sinning. Because a lot of us were brought up in a. In a Western Christian context, for lack of a better term, where we look at sinning as, oh, making bad choices, doing bad things. Well, people just keep doing bad things. They just knock it off."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6376.86,"end":6377.26,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6379.1,"end":6385.58,"speaker":"Fr Stephen De Young","text":"You know, that would make confession really easy for me if I could just, you know, people come and tell me what they did and I could just go, well, knock it off."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6386.14,"end":6387.42,"speaker":"Fr Andrew Stephen Damick","text":"Stop sinning."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6387.74,"end":6389.66,"speaker":"Fr Stephen De Young","text":"Yeah, just quit it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6389.82,"end":6394.62,"speaker":"Fr Andrew Stephen Damick","text":"I thought about preaching sermons like that, but stop it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6395.58,"end":6396.46,"speaker":"Fr Stephen De Young","text":"Come on, man."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6396.9,"end":6397.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6399.54,"end":6447.83,"speaker":"Fr Stephen De Young","text":"We all know that's not how it works, right? That sin is this power, right? That has a hold of people like it's described in the Apocalypse of Abraham. And that's getting that from the Hebrew scriptures, right? That sin is something that takes a hold of you, and once it's got a hold of you, you can't just stop. Yeah, right. You can't just quit. Right? It's. You're not free to do that anymore when sin has you in its grip. And so every year, the day of atonement is dealing with the sins that people have committed, which are like symptoms of the disease, right? And it's dealing with the effects and the stain and the taint."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6449.28,"end":6449.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6449.68,"end":6503.54,"speaker":"Fr Stephen De Young","text":"Of. Of the sin, but the people remain infected with the sin itself. So it would be like if you had a horrible disease and we treated your symptoms so that you could function. And once a year, we cleaned out your whole house and burned all your bedding and clothes and gave you new so that you wouldn't spread the disease. Right. But never actually tried to cure your disease because maybe we couldn't. Right. And so we had to just keep treating it and treating it and treating it. That wouldn't mean there was a problem with the treatments that mean there's a problem with this disease. Right. So we see that limit there. But then complicating that even further."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6505.3,"end":6505.58,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6505.58,"end":6586.31,"speaker":"Fr Stephen De Young","text":"This is something that doesn't weigh on us, Right. In the way that it weighed on the Jewish people of the first century bc, the first century AD Is it's not just that this was true, but also they were still living under the consequences of that sin and the failure of their fathers to correctly manage that sinfulness with the Torah. Right. So the Northern Kingdom, most of the tribes of Israel, most of the people of Israel had been destroyed and were just gone, had been wiped out by the Assyrians and those who were left. Right. The Judeans were the descendants of the tribe of Judah and a few from Benjamin and some Levites. Right. They had all been exiled in Babylon. And while some of them had taken the opportunity to go back to Judea, a lot of them hadn't. And when they got back to Judea, it wasn't the same. Right. I mean, they built a new temple, but the glory of God sort of didn't show up."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6586.95,"end":6589.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They all kind of noticed that the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6589.47,"end":6600.47,"speaker":"Fr Stephen De Young","text":"Hasmoneans managed to get independence for Judea briefly. But it was briefly. Then they were under the Romans, which is worse than the Greeks in a lot of ways."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6602.87,"end":6603.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6604.15,"end":6648.57,"speaker":"Fr Stephen De Young","text":"And so that exile wasn't really over. The Jewish people who were left were scattered all over the world. The ones in Palestine were not doing well under the Romans, exile hadn't truly ended. And so this is something. And now, you know, at the time, the Apocalypse of Abraham was getting rid. The second temple has been destroyed by the Romans and the Romans are trying, deliberately trying to de Judaize the whole region. Right. Just building a third Temple and purifying the sanctuary with goat blood was not going to solve all this."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6649.53,"end":6653.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was just a temporary measure to clean things up."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6654.17,"end":6660.33,"speaker":"Fr Stephen De Young","text":"Right. That wasn't going to fix everything because building the second Temple and purifying it with blood had not fixed everything."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6664.4,"end":6664.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6665.12,"end":6689.5,"speaker":"Fr Stephen De Young","text":"So it's not just we have this disease and the Day of Atonement is treating it but not curing it. It's. We've actually deteriorated from this disease to a point that's near terminal. And because that treatment can't cure the disease, it also can't restore us to health and bring us back to life."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6691.98,"end":6692.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6693.98,"end":6703.02,"speaker":"Fr Stephen De Young","text":"So I see how this isn't going to do it. And so from that perspective, they then envision, okay, well, what would do it?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6704.38,"end":6705.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6705.42,"end":6722.87,"speaker":"Fr Stephen De Young","text":"What version of this form? We have this form, this shape, this outline, this pattern in the day of atonement. What version of that, what form of that could solve the problem, could restore us to health, could cure us, could do the job."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6723.59,"end":6723.95,"speaker":"Caller Gregory","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6723.95,"end":6752.93,"speaker":"Fr Stephen De Young","text":"And that's where the images that we get, for example, in the apocalypse of Abraham and in other Second Temple Jewish writings of this cosmic atonement. Frankly, the picture we get. We're talking about this more in the third half of the picture we get in the New Testament. Right. Of the atonement. Right. That's where this comes in. Right. So we need to have a purification, but it needs to be a final purification. Right, right. Well, that doesn't need to be repeated. It needs to be dealt with once and for all."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6753.17,"end":6773.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I think, like, especially if you think about where the Jews are at this point in their history, you know, I mean, as you said, they weren't of the Greeks, they were under the Romans. And this is not great, but like, but there's no clear. There's no set. There's no way. There's no way that things are going to be like they were under David."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6774.26,"end":6776.02,"speaker":"Fr Stephen De Young","text":"Without God directly intervening."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6776.1,"end":6800.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Like. Like the world is encroaching in on them. Empires have taken an interest in them and have taken their spot over and over again. You know, like it's. And they cannot keep them at bay. They do not have the power for that. You know, so this idea of this final hope, it only makes sense that there's going to be this desire there."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6800.92,"end":6832.78,"speaker":"Fr Stephen De Young","text":"Right, right. And so, yeah, and even just them starting to now practice the Torah again wouldn't cut it without God directly intervening. Right. So the Pharisaic position at this time was not, oh, if we all just start following the Torah perfectly, we'll all be fine. No, the Pharisaic position was if we begin to follow the Torah and show our faithfulness to God in contrast to our previous unfaithfulness, then God will intervene."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6834.54,"end":6836.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6836.3,"end":6863.3,"speaker":"Fr Stephen De Young","text":"That will bring about God's intervention. So this isn't like, oh, well, the Pharisees thought just Torah keeping was the solution to everything. And, you know, then there were these other dissident groups who thought God was going to apocalyptically intervene. No, this is. This is across the board. The question is how will God intervene? Can we do something to bring about God intervening? And how will he intervene? Those are the discussions."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6863.38,"end":6877.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is one of the things I think, that underlines if you actually read the Torah, like, there's this, especially this dispensationalist idea that the Torah is kind of, you know, track A for salvation and then Jesus, it's a."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6877.98,"end":6879.38,"speaker":"Fr Stephen De Young","text":"Means of personal salvation."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6879.7,"end":6893.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Did you read it, though? Does it say that ever anywhere in it like, that these commandments are going to result in this? Doesn't say that. It's just not in there, you know?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6894.02,"end":6906.82,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. So even the Pharisees like this, the only people who thought God wasn't going to intervene directly were the Sadducees. And that's why they became Roman collaborators, right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6906.82,"end":6908.18,"speaker":"Fr Andrew Stephen Damick","text":"Because like this, that's why they got."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6908.18,"end":6913.38,"speaker":"Fr Stephen De Young","text":"Rich on this Earth, because they're like, there's nothing else coming. We need to just do what we need to do here."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6914.02,"end":6914.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6918.5,"end":6920.9,"speaker":"Fr Stephen De Young","text":"It was kind of nihilistic, being a Sadducee."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6920.9,"end":6921.66,"speaker":"Fr Andrew Stephen Damick","text":"You live only once."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6921.66,"end":6926.58,"speaker":"Fr Stephen De Young","text":"Why? They don't exist anymore. They got what they wanted anyway."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6927.86,"end":6930.82,"speaker":"Fr Andrew Stephen Damick","text":"Or as someone once said, they have their reward."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":6931.3,"end":7021.39,"speaker":"Fr Stephen De Young","text":"Right? So there has to be this final intervention by God. And in terms of that final intervention, that final atonement, that has to be a purification not just of a sanctuary or of a camp or of a nation, but of the whole Kosmos, the whole universe, the whole creation has to be purified, right? Meaning. And what that means is the things that are done in the day of atonement have to be done finally and completely. So the devil, Azazel, whatever we want to call him, right? And all the powers of evil, right, the demonic powers have to be dealt with in a final way, right? Bound, imprisoned, punished, done sin as a power in the world, right? Sin came into the world through Adam. St. Paul summarizes for us in Romans 5, right? Through 1 man, sin came into the world. Sin needs to be removed from the world. That power of sin, that thing that was stalking Cain, needs to be shoved back in its box, which is the same box as Azel the devil and his ilk need are going to be imprisoned in, right? That needs to go away because then human beings will be free. Freedom is not being able to do what you want. Freedom is being able to flourish."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7022.51,"end":7026.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7027.95,"end":7031.63,"speaker":"Fr Stephen De Young","text":"Freedom is free. The freedom to destroy yourself is not freedom."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7034.83,"end":7035.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7035.55,"end":7038.43,"speaker":"Fr Stephen De Young","text":"The freedom to sin is not actual freedom. That's slavery."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7038.83,"end":7075.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's like I. I recently. I recently gave a sermon in which I was talking about how, you know, slavery to sin is is described as debt in some places in the New Testament. And that continuing to sin even after you've been forgiven is like paying a debt that you don't have to pay. You know, you keep paying it as though you're still enslaved to that, that creditor, but you're, but you're not. You know, you can, you're free. You don't have to do it anymore. You can live. You can live."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7075.56,"end":7075.96,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7077,"end":7078.6,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that's the second half."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7078.6,"end":7078.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7078.92,"end":7079.32,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7079.32,"end":7087.56,"speaker":"Fr Stephen De Young","text":"Go ahead. Go ahead, Father I was just going to say. So now, third half we're going to talk about. Okay, this is the shape of the expectation and a little bit of why they had it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7087.96,"end":7088.72,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7088.72,"end":7096.59,"speaker":"Fr Stephen De Young","text":"And now we're going to talk in the third half about. With that in mind, let's look at Christ's atonement."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7096.75,"end":7102.03,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed. All right. We're going to take our second and final break, and we'll be right back with this episode of the Lord of Spirits."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7102.11,"end":7118.44,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8558-AF-RADIO."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7124.76,"end":7168.62,"speaker":"Fr Andrew Stephen Damick","text":"This March, join us for the 31 Books of March sale event at Ancient Faith Store. In celebration of the event's 10th anniversary, we're offering a large selection of books at 50% off every day from March 1st through March 31st. Over 150 titles. We set each morning at 9am Central Explore Books on orthodox faith, theology, history and more, all at a discounted price. You'll also find children's books and titles by popular podcasters and hosts from Ancient Faith Radio. Each day brings a fresh collection of books at incredible Savings. Visit us at store.ancientfaith.com there's not a day you'll want to miss during the 31 book of March."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7172.86,"end":7189.02,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7189.58,"end":7194.78,"speaker":"Fr Stephen De Young","text":"And Rebecca, back when she big famous commercial lady used to slum it with us."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7195.1,"end":7206.66,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right. I told people that was the voice of Trudy we just heard. Some people don't unless they've ever called, they may not know what Trudy actually sounds like or or right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7206.66,"end":7214.38,"speaker":"Fr Stephen De Young","text":"Think about this, maybe if you hang around with us too long, either of us, you end up just becoming a disembodied voice."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7215.58,"end":7217.18,"speaker":"Fr Andrew Stephen Damick","text":"Is that what happened to Steve?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7217.5,"end":7219.42,"speaker":"Fr Stephen De Young","text":"I think maybe. And now it happened to."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7220.16,"end":7235.12,"speaker":"Fr Andrew Stephen Damick","text":"I feel a little bit bad because sometimes when people meet Steve, they will. And they hear him talk like, you're the voice of Steve. He's like, I'm a person. So, guys, if you meet Steve, don't call him that. Don't call him that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7235.28,"end":7252.6,"speaker":"Fr Stephen De Young","text":"I mean, you know, we, we all saw what this kind of invisible joke did to John Cena. He finally snapped. So I'm expecting a Steve Cristoforo heel turn, like any day now. He's just gonna start lashing out at random children who are fans of his work."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7255.8,"end":7307.71,"speaker":"Fr Andrew Stephen Damick","text":"It's just a TV show. Yeah. I also want to say. So I mentioned the beginning. Everybody get your tickets for Lord of Spirits Fest in October. I also just want to throw out, especially for those listening live, my final speaking engagement for this lent is happening this weekend. I'm going to be at St. John the Baptist Antiochian Orthodox Church in Post Falls, Idaho. This weekend we're doing a retreat all day long and it's free. So people up there in eastern Washington, western northern panhandle of Idaho, which actually, by the way, apparently father includes our YouTube guy, Simon. Simon told me he's gonna come to the retreat. So everybody, if you come to the retreat, you can meet ancient faith celebrity Simon Nelson, the YouTube."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7307.71,"end":7309.11,"speaker":"Fr Stephen De Young","text":"He'd be showing you his drawings."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7309.75,"end":7320.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So bring your YouTubes and you can have Simon sign them right there at the retreat. I mean, that should be pretty great way up there in northern Idaho."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7322.07,"end":7323.99,"speaker":"Fr Stephen De Young","text":"Once again, masterful self shill."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7324.23,"end":7336.63,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Thank you very much. Okay, so what's in the third half, Father? Isn't this really all just about penal substitutionary atonement?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7338.95,"end":7342.15,"speaker":"Fr Stephen De Young","text":"Well, we're going to do a PSA about psa."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7342.47,"end":7345.47,"speaker":"Fr Andrew Stephen Damick","text":"Nice. I mean, it's low hanging fruit, but thank you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7345.47,"end":7347.99,"speaker":"Fr Stephen De Young","text":"It is. Yeah. We didn't get any calls yet."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7348.47,"end":7352.73,"speaker":"Fr Andrew Stephen Damick","text":"I'm kind of surprised. We didn't get any calls. I turned them all off."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7352.81,"end":7353.37,"speaker":"Fr Stephen De Young","text":"We will."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7353.85,"end":7354.89,"speaker":"Fr Andrew Stephen Damick","text":"I've had it with people."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7355.37,"end":7358.41,"speaker":"Fr Stephen De Young","text":"Once you start talking about penal substitutionary atonement, people go crazy."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7360.89,"end":7361.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7361.85,"end":7377.21,"speaker":"Fr Stephen De Young","text":"Yeah. So I'd like to think that us talking about addressing penal substitutionary atonement at this point would be beating a dead horse. But this horse is very alive."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7378.08,"end":7379.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh, totally. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7379.44,"end":7380.76,"speaker":"Fr Stephen De Young","text":"And kick in, right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7380.76,"end":7381.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7381.12,"end":7386.92,"speaker":"Fr Stephen De Young","text":"Like, despite the best efforts of a growing number of people, even within Protestantism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7386.92,"end":7387.28,"speaker":"Caller Gregory","text":"Now."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7389.2,"end":7417.96,"speaker":"Fr Stephen De Young","text":"To point out that that dog don't hunt. But this is going to be less, as may have happened in certain previous episodes. Father Andrew and I using PSA as a pinata and more by way of clarification, be a little bit of hitting it with a stick."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7418.2,"end":7420.12,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's pretty fun."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7420.84,"end":7482.87,"speaker":"Fr Stephen De Young","text":"Yes. And ironic. What do you think about it? But so. But one of the first things we could say in the context of what we're talking about in this episode is the kind of cosmic atonement we were just talking about that comes out of the Hebrew scriptures and this expectation and this need felt by Jewish people of the 1st century BC, 1st century AD penal substitution. And penal substitution. Atonement doesn't do a cosmic atonement like that. It fundamentally doesn't answer that. The needs. Those needs. Right. Right now you can say, well, okay, the New Testament just completely redefines atonement and blows all their expectations out of the water. Maybe except for the fact that penal substitutionary atonement is less full than what they were expecting, not more."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7483.74,"end":7487.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The expectation is for a cosmic cleanup."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7489.5,"end":7491.42,"speaker":"Fr Stephen De Young","text":"And that's not what penal substitution does."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7491.58,"end":7494.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For an individual debt fix."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7494.62,"end":7498.38,"speaker":"Fr Stephen De Young","text":"Right. Penal substitution does nothing about the cosmos or creation."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7499.42,"end":7503.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because it's at all. Yeah. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7504.62,"end":7508.3,"speaker":"Fr Stephen De Young","text":"Penal substitution is completely individualistic."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7508.87,"end":7512.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, where's Israel in all of that? Like, not even in the picture."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7512.83,"end":7565.55,"speaker":"Fr Stephen De Young","text":"Even community of Israel. All that's totally out of the picture. It's just a question of what Christ atonement is thought to do in the case of certain individuals. Not even all individuals usually. Right. Certain individuals. But has nothing to do with creation. Nothing to do with sin is a power. It's just a question of sins and punishment. Right. So that said. So it sort of fails that test. Right. So people will say, like, what I mean by this is people will make this argument sometimes. And I don't think it's an accurate argument. I think if you study. Right. Who. Who the Messiah was in Jewish expectation. I don't think the argument I'm about to make holds water. The dog doesn't hunt."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7565.71,"end":7566.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7567.23,"end":7700.58,"speaker":"Fr Stephen De Young","text":"But you will hear people say who haven't really studied it. And if you want to study it, you could start by listening to our episode on messiahship. But they'll say, well, okay, there was this expectation at the time of Jesus of this kind of political messiah, Allah, John Hyrcanus or one of the Hasmoneans. Right. One of one of the Maccabean rulers who would come in and overthrow the Romans. But Jesus comes as the actual Messiah and he Blows that out of the water. He does so much more than that. Right. So even though I don't think that's correct about Jewish expectation, the argument itself at least kind of makes sense because you have a small expectation, oh, this person is going to set up a political kingdom on earth over a particular strip of land. Right. Versus what Christ actually did, which is so much bigger than that. But here with atonement, the expectation was for this cosmic thing that would radically transform the entire creation, purifying it from sin and evil, dealing with the demonic powers once and for all, all of these things. And instead we got, well, okay, God isn't going to punish you individual person for the individual sins you have committed. That's far more narrow and small and finite than the expectation. Yeah, that's the opposite of fulfillment. That's a denuded kind of thing. But we also, we need to write. One of the things that I feel like we haven't done adequately when we've talked, when we've critiqued penal substitution before, is clarify exactly what it is. Because almost every discussion I enter into about this with anyone, including orthodox people, shows me that most people have no idea what it is. Right? And so they'll either say like it seems right to me or I reject based on. And what they're actually talking about isn't what penal substitutionary atonement is. So we want to kind of hear."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7701.04,"end":7707.68,"speaker":"Fr Andrew Stephen Damick","text":"Clarify what it is. Who originally defines that? Is that like, is that a John Calvin thing? Is that, I mean, who's really laying that?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7707.68,"end":7711.12,"speaker":"Fr Stephen De Young","text":"It comes out of the Calvinist strand of reformed tradition."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7711.28,"end":7712.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7713.76,"end":7738.41,"speaker":"Fr Stephen De Young","text":"Now previous to that and what still holds in the Roman Catholic Church, give or take. I mean, there's a really real problem of pointing at anything and defining what actual Roman Catholic doctrine is now, as exemplified by the fact that anytime we or anyone else not Roman Catholic tries to do it, we're always told we're wrong."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7739.93,"end":7742.33,"speaker":"Fr Andrew Stephen Damick","text":"Have you considered you might just always be wrong, Father?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7742.57,"end":7755.69,"speaker":"Fr Stephen De Young","text":"Yeah, well, it's impossible. It is impossible for a non Roman Catholic to correctly even define. Not like they might have a valid argument against it, but even define what it is, even describe what it is, you can't do."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7755.88,"end":7762.2,"speaker":"Fr Andrew Stephen Damick","text":"It is, I mean, it is a moving target. Especially, especially, especially over the last like 150 years."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7762.2,"end":7772.72,"speaker":"Fr Stephen De Young","text":"It's just right, because if I quote the Council of Trent, somebody will point at something else. If I quote the Catechism of the Catholic Church. Oh, well, that's not authoritative. That's just suggested. If I go right, you can go you can go on and on forever. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7772.72,"end":7774.24,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, if you want to play."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7774.24,"end":7779,"speaker":"Fr Stephen De Young","text":"That game at any time, I have actually just nailed it beyond reproach. I just get called mean."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7779.4,"end":7779.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7779.8,"end":7781.4,"speaker":"Fr Stephen De Young","text":"So I'm not even bothering anymore."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7781.4,"end":7783.27,"speaker":"Fr Andrew Stephen Damick","text":"I mean, okay, you are mean."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7783.35,"end":7794.95,"speaker":"Fr Stephen De Young","text":"But, yes, I'm a mean man. Cruel and vicious at my core. But, yes, a wonderful community of people around me in my parish. But they. They're the best."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7795.19,"end":7797.35,"speaker":"Fr Andrew Stephen Damick","text":"And you, tyrant overlord, who is you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7797.35,"end":7800.43,"speaker":"Fr Stephen De Young","text":"Are there for their sins, Lord, to get over them every Sunday."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7800.43,"end":7805.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. Okay, but yeah. So, like, is it related to. I mean, there is this medieval."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7805.83,"end":7808.55,"speaker":"Fr Stephen De Young","text":"Right. And that's what I'm talking about. Catholicism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7808.55,"end":7809.99,"speaker":"Fr Andrew Stephen Damick","text":"Satisfaction, at least."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7810.47,"end":7825.83,"speaker":"Fr Stephen De Young","text":"Yeah. You know, to some extent. At least They've never rejected Anselm of Canterbury, who they consider a saint. Right. And cornea Somo. So satisfaction theory is what prevailed for many centuries, at least."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7826.39,"end":7826.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7826.75,"end":7828.71,"speaker":"Fr Stephen De Young","text":"I mean, and it's within Roman Catholicism."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7828.87,"end":7843.1,"speaker":"Fr Andrew Stephen Damick","text":"And it's baked into. It's baked into. It's baked into the whole purgatory model, too. Right. Which is like, your sins can be forgiven, but you still have to offer satisfaction to God for those sins. So you're going to kind of toast for a while and then you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7843.1,"end":7849.14,"speaker":"Fr Stephen De Young","text":"Well, that's. Now, you see, you're going down too far into the. Then we got to explain temporal guilt and stuff."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7849.14,"end":7850.38,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, I know. Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7850.38,"end":7851.94,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. We don't go that far down the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7851.94,"end":7854.7,"speaker":"Fr Andrew Stephen Damick","text":"Rabbit trail, but leave that for another day. But it is. It is there."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7854.7,"end":7925.27,"speaker":"Fr Stephen De Young","text":"The idea of satisfaction theory is there's a problem between God and humans. Right. That's humans sinning. Right. And human sinning is an affront to God, whom they're sinning against. Right. And that situation needs to be made right. Right. There needs to be justice. This situation has to be resolved somehow. And in. The idea of satisfaction is that Christ offers himself as a sacrifice to the Father. The Father is pleased with that sacrifice. And so because he is pleased with the sacrifice that Christ offers him, Right. He accepts that sacrifice and things are made right between God and man. His need for justice is satisfied by the sacrifice of Christ. And then the benefits of that are given to human, individual human persons in a variety of ways. We won't go down all those rabbit trails."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7925.27,"end":7927.47,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure. Because that's not what this show is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7927.47,"end":7942.07,"speaker":"Fr Stephen De Young","text":"Right. But there is no element here of. As the penal and penal substitution of God punishing Christ for people's particular sins."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7943.2,"end":7949.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You flipped off your brother the other day. And so Jesus has to experience this."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7951.52,"end":7957.6,"speaker":"Fr Stephen De Young","text":"We just got a window into Father Andrew's home life by the example that immediately sprang to mind."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7957.6,"end":7963.68,"speaker":"Fr Andrew Stephen Damick","text":"Actually, I don't think I've seen my kids flipping each other the bird. Thank God. I'm not saying they're always nice to each other."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7964.08,"end":7965.88,"speaker":"Fr Stephen De Young","text":"You were thinking about Clyde Anyway."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7965.88,"end":7969.37,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":7972.09,"end":8059.63,"speaker":"Fr Stephen De Young","text":"Yeah, so. So that's a different thing than penal substitutionary atonement. The Roman Catholic Church has never traditionally believed in penal substitutionary atonement. Right. In fact, built into. You read Roman Catholic doctrinal expressions about this, they talk about how one drop of Christ's blood, him offering one drop of his blood would have been sufficient as a sacrifice. Right. To make atonement for the whole world because he's offering it as a pleasing sacrifice to God. So there's no kind of idea. This is within a better understanding. Right. I don't think it's perfect because it's a little different than the orthodox view, but a better still, a better in the 11th century understanding of sacrifice, for example, than what you find later, especially in Protestant circles. So that's not penal substitution. Penal substitution comes about within the Reformed tradition because it has to. It has to. You can't really hold to penal substitution and not be a Calvinist. It doesn't work. Because what penal substitution says is that there is a punishment for the particular sins committed by particular people."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8062.11,"end":8064.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like it's a crime and punishment idea."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8064.51,"end":8105.5,"speaker":"Fr Stephen De Young","text":"And Christ in the past took the punishment for particular sins committed by particular people and therefore those people are not punished for those sins. Meaning you have to accept that L in Tulip limited atonement to really believe in penal substitution. Now you could be a universalist, as we've pointed out before when we talked about universalism on the show. Right. Someone like David Bentley Hart is basically a liberal Calvinist. Yeah, he's like a Bardian Calvinist."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8105.58,"end":8107.86,"speaker":"Fr Andrew Stephen Damick","text":"It's all just Monarch Barth was reformed."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8107.86,"end":8151.83,"speaker":"Fr Stephen De Young","text":"He's a Calvinist who says just basically everybody's elect. Right. You just say every human is elect. Right. Or you have to say some subset of humans. Right. But it does not make sense for anyone to say Christ took the punishment for sins xyz committed by person a but they didn't accept Jesus. And so now God is going to also punish them for those same sins. Right. That doesn't make sense. So if you're going to believe in people's substitutionary atonement, you have to be some kind of Calvinist. The original Arminians, not Armenians."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8154.87,"end":8159.8,"speaker":"Fr Andrew Stephen Damick","text":"There are Armenian Armenians. They could be wearing Armani."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8160.04,"end":8223.93,"speaker":"Fr Stephen De Young","text":"And there's an Armenian comedian, but right. The, the, the original Arminians believed. Did not believe that Christ. Well not, I shouldn't say the original Armenians, the original remonstrant Arminians did. But that's not who we think of as Arminians. Who we think of as Arminians are Wesleyan Arminians. And the Wesleyan Arminians, Wesley did not say, Right. That Christ died for everyone's sins in a penal substitution way. The distinction between him and a Calvinist was the Calvinist said God chose according to his will, according to his good pleasure, whose sins Christ would die for. Whereas the Arminian, the Wesleyan Arminians said God knew in advance who would accept Christ and so Christ died only for those sins. But either way you got the limited atonement part."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8224.33,"end":8227.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8227.65,"end":8234.89,"speaker":"Fr Stephen De Young","text":"So that doesn't get you out of that. Right. Wesleyan Arminians are sort of like three point, maybe four point Calvinists, honestly."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8238.34,"end":8238.58,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8240.74,"end":8294.12,"speaker":"Fr Stephen De Young","text":"That'S what we're talking about. We're talking about PSA to some extent right now. That is not Orthodox. The Orthodox Church does not, nor has it ever taught penal substitutionary atonement. Okay. Despite what you may have heard from some catechumen slash inquirer online or self appointed teacher online. Right. Despite what you may have heard from some very well meaning priests and monks and maybe even some bishops somewhere. Well, why would they say things like that then? Well, I'm not talking about cranks on the Internet, Right. Who can explain their wacky behavior. I'm talking about the well meaning priests and monks and maybe even bishops somewhere."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8294.44,"end":8294.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8294.84,"end":8296.68,"speaker":"Fr Stephen De Young","text":"What's going on there? Why are they saying that?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8296.92,"end":8310.6,"speaker":"Fr Andrew Stephen Damick","text":"It's. Yeah, it's, it's because like there are certain kind of shorthands that are being used to define penal substitutionary atonement that aren't actually what it really is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8310.92,"end":8315.63,"speaker":"Fr Stephen De Young","text":"Right, right. And so. And this is on both sides."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8316.19,"end":8317.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8317.07,"end":8338.9,"speaker":"Fr Stephen De Young","text":"Right. This is on both sides in the sense that this isn't just these well meaning Orthodox people. There's a lot of Protestants who would say, would say that they do believe in penal substitutionary atonement who don't actually understand what it is. Right. Or who, when you explain to them what it is, they're like, oh no, I don't believe that. Right. So just saying Christ died for our sins, that is not penal substitutionary atonement."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8339.53,"end":8339.77,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8340.17,"end":8340.97,"speaker":"Fr Stephen De Young","text":"Necessarily."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8341.61,"end":8342.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8343.05,"end":8349.77,"speaker":"Fr Stephen De Young","text":"Okay. That's open to a wide variety of interpretations of in what sense Christ died for our sins."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8349.93,"end":8350.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8351.21,"end":8359.05,"speaker":"Fr Stephen De Young","text":"Even saying Christ died in our place in some way is not necessarily Penal substitution."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8359.05,"end":8363.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's sort of substitutionary on some level, but. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8363.93,"end":8365.13,"speaker":"Fr Stephen De Young","text":"Or on our behalf."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8365.92,"end":8366.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8367.28,"end":8450.24,"speaker":"Fr Stephen De Young","text":"Which is actually closer to what the Greek says in those passages. He died on our behalf. He died with benefit to us. That's not penal substitution. Okay? So here's the core. Here's the very core of this and why the Orthodox Church has never accepted it. Okay? And this is very clear, the teaching of Calvin and the Calvinist tradition. We've talked before on the show about how St. John of Damascus distinguishes between two kinds of death. And this is a basic theological distinction in Orthodox theology. He isn't saying this to innovate. He's saying this in his expositing on theology and summarizing the theology of the Fathers before him. Okay? So this is. He considers this basic Christian theology, that there's two kinds of death. Death is used in the Scriptures, in our tradition in two different senses. One of them is physical death. Physical death is when the human soul is separated from the human body. The other way it is used is to refer to spiritual death, when the human soul is separated from God, which is the source of life. And that's why it can be called death for humans."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8450.56,"end":8450.96,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8451.52,"end":8485.97,"speaker":"Fr Stephen De Young","text":"When God says to Adam, on the day you eat of the tree, you will surely die, he's talking about spiritual death. And that happens to Adam on the day he eats of the tree. His soul is to some extent cut off from God, who is the source of life. He's cut off from the tree of life. And the effect that has is that it eventually brings about his physical death. Then his soul is separated from his body until the bodily resurrection he defines us."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8485.97,"end":8486.49,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8487.45,"end":8553.94,"speaker":"Fr Stephen De Young","text":"So you will sometimes hear folks, orthodox and otherwise, who are trying to defend the idea of penal substitution, who will say, well, Christ died in our place. And they'll want to say, well, no, I'm talking about physical death, right? Because this is people who accept Chalcedonian Christology. The claim we're making, when we say Christ died on the cross, or even more provocatively, God died on the cross, the claim we're making is not that the divine nature somehow died, died. Death never means ceased to exist, right? You notice here, right, Never means anything like that. What we are saying is our Lord Jesus Christ is a divine person who takes upon himself human nature. That human nature includes a human soul and a human body. And so Christ allows, because he does it voluntarily, his human soul to be separated from his human body."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8554.34,"end":8556.7,"speaker":"Fr Andrew Stephen Damick","text":"That's what death is. That's what physical death is."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8556.7,"end":8561.74,"speaker":"Fr Stephen De Young","text":"That's what death means for everyone is that your human soul is separated from your human body. Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8561.74,"end":8571.38,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, I mean, it leads to a very natural question. If people say, well, Christ died in our place. And it's like, well, but doesn't everyone still die?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8571.86,"end":8579.51,"speaker":"Fr Stephen De Young","text":"Right. So if someone wants to say, well, that's what we're talking about. We're talking about physical death. I'm still going to die a physical death."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8580.07,"end":8583.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he didn't do it in your place. He didn't die."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8583.03,"end":8585.91,"speaker":"Fr Stephen De Young","text":"He didn't do it instead of me. I'm still going to die a physical death."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8586.39,"end":8586.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8586.83,"end":8635,"speaker":"Fr Stephen De Young","text":"Right. And we say this in the prayer that priests say often preparing for liturgy. Liturgy, Right. That Christ's human soul is separated from his human body. His human body goes into the tomb. His human soul descends into Hades to harrow it. Right. And as God, he is everywhere present, filling all things. He is with the thief in paradise. He is on the throne with the Father, the Spirit. Right. Et cetera, et cetera. Right. That's what we're saying about Christ. Okay. So for this to work, for penal substitution to work fundamentally, and this is the claim Calvin and the Calvinist tradition make, Christ has to experience spiritual death on the cross."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8636.04,"end":8639.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is the separation of the soul from God."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8640.28,"end":8650.84,"speaker":"Fr Stephen De Young","text":"Right. Christ's human soul has to be separated from God. This is what Calvin and those of the Calvinist tradition who teach fetal substitutionary atonement say happened."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8651.24,"end":8656.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's why you get. Some people will say, well, on the cross, God turns his back on Jesus."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8656.36,"end":8658.75,"speaker":"Fr Stephen De Young","text":"Right. And. And suffered hell on."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8659.15,"end":8674.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And they'll misunderstand. They'll misquote Christ's reference to Psalm 21:22, where he's actually referring to the whole psalm and not just to one line."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8675.31,"end":8677.79,"speaker":"Fr Stephen De Young","text":"And that claim is heretical."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8678.59,"end":8688.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because, I mean, what does that mean? The Father is separated from the Son? Like, what does that mean about who God is? How can. Is he not God anymore? Like, I mean, what's going on? It's just nuts. Just."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8688.77,"end":8851.34,"speaker":"Fr Stephen De Young","text":"You either have to be a trinitarian heretic or a christological heretic to hold to it. Or you could be. Or you could be William Lane Craig and go for the hat trick. But if you're not a Christian. Right. Like William Laid Craig is not, you could just make up a religion and do whatever you want theologically. And I know that sounds harsh when I say that, but I have, through a slight proxy. Proxy on a live stream, questioned William Lane Craig about this and his argument to defend his view of penal substitution with Christ. He appealed to the fact that he is a self described neo Apollinarian, Apollinarianism being a condemned heresy with his Christology. He doesn't believe Jesus has a human soul. That was his answer to me questioning him about this. Okay? So I'm not being harsh. I'm taking him at his word that he's, that he's has heretical views of these things that put him outside of Christianity according to the, not like the later ecumenical councils that Protestants don't like. Like the first one, right. Like the second one, the ones that produce the Nicene Creed, the ones that supposedly all Christians agree on. He doesn't. Right. So, but I mean, and I'm going to be blunt here again. When you read the Reformed tradition and they're talking about this issue, most of them opt to become Christological heretics in that they basically adopt a Nestorian Christology where Christ's humanity and divinity are separate, at least on the cross, that Christ's humanity is in some way separated from his own divine nature, from his own godhood in order to make this penal substitution thing work. So this is, this is a theological debacle, right? And so to those well meaning clergy and monastics and stuff out there, if somehow you hear this, who go around saying things like, oh no, we accept penal substitutionary atonement because we think Christ died for our sins. Stop saying that. That's not what penal substitutionary atonement means. Okay, you don't believe this, right? We don't co. Sign this."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8852.3,"end":8852.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8853.82,"end":8874.94,"speaker":"Fr Stephen De Young","text":"Okay. We do not think it is possible that Christ's human soul could be in any way, for any period of time separated from God. Not, not possible. Not in our tradition. And if you're paying attention to the liturgics and Lent and Holy Week and everything, our tradition over and over again says the opposite."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8876.88,"end":8877.12,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8877.6,"end":8948.99,"speaker":"Fr Stephen De Young","text":"That it's, it's kind of amazing that Christ was able to be dead for as long as he was because it was impossible for him as God to see decay. For his soul to remain separate from his body for that long is itself wondrous and miraculous. But he had something he was doing in harrowing Hades and in fulfilling the Sabbath, resting in the tomb, right? So we need to just leave off with this, right? We don't believe this. No one should believe this, right? Protestants who aren't Calvinists definitely should not believe this. And even Calvinists, some of them are coming around, right? Like you don't need this, right? This penal substitutionary atonement Right. It's not coming out of the Bible and it breaks the rest of your logic. It requires you to believe things about who Christ is and about the Holy Trinity that you know are wrong in other contexts. Right. So let's leave that off. So enough, enough negativity. You know, I hate negativity."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8949.23,"end":8949.91,"speaker":"Fr Andrew Stephen Damick","text":"So negative."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":8949.91,"end":9122.85,"speaker":"Fr Stephen De Young","text":"Love to focus on the positive. What are the positive images we get? Well, it's related to what we were talking about in the second half, right? We have two main positive images of what Christ does in his death and. Oh yeah, resurrection. We'll get to that in a second. Right. And those are related to two different feasts, right, in the Hebrew Bible. The first one is Pascha, Passover. Pesach. Right, Passover. And what's happening in Passover? Right. We've talked about this before the show, so we won't believe, won't belabor it. Now. There's no penal substitution going on there at all. Right. What's going on at the passover is manumission, people being set free from slavery in Egypt and the judgment, as God himself says on the Passover night, the judgment of the Egyptian gods, the judgment being rendered against the demonic powers and the people being set free. And this is fulfilled in Christ, filled full in that in Christ we're not just set free from living as slaves to some Egyptians on this earth, but we're set free from the powers of sin and death. And the judgment that's rendered is not just against, not just the Egyptian gods being exposed as being not really gods, but all of those dark powers being defeated once and for all. Right? The other feast is what we've been talking about tonight, the day of atonement. And again, you go back to our atonement episodes. Nothing about people's penal substitution going on there at all. Right. In Leviticus 16, you have two elements, expiation, sin being taken away and the purification and purgation of the sanctuary. Right? The purification and the sins being sent return to sender, back to their origin, back to Azazel. And the cosmic atonement we were talking about in the second half is the fulfillment of that Christ accomplishes, that he purifies, according to 1 John 2. 2 the whole world that was previously under the power of the evil one, according to 1 John 5, right? But now has been purified. He defeats the power of sin. He defeats, destroys the works of the evil one, as one John says, right? And accomplishes this cosmic day of atonement. And this is summed up in a very simple phrase. Uttered by St. John the Forerunner, when he says about Christ, behold the Lamb of God who takes away the sins of the world."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9123.81,"end":9124.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9124.21,"end":9126.37,"speaker":"Fr Stephen De Young","text":"Because he has pushed these together."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9126.53,"end":9132.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lamb of God is Passover language. Taking the sins away. That's atonement day language."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9133.25,"end":9144.25,"speaker":"Fr Stephen De Young","text":"Right. These are brought together in the one person of Christ and in his action of atonement, which includes the cross doesn't begin there."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9145.13,"end":9145.41,"speaker":"Caller Gregory","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9145.41,"end":9190.06,"speaker":"Fr Stephen De Young","text":"As Saint Athanasius tells us, it begins when he's conceived, which we celebrated a couple days ago. And doesn't end at the cross either, but continues into and through the resurrection, through the ascension and his enthronement on into. Right. His glorious appearing. But I want to pause for a minute to talk about. Hey, what about the Resurrection? Because I think there is a real imbalance in Western Christian thought because the questions Father Andrew and I get in response to us talking about atonement."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9190.61,"end":9193.09,"speaker":"Fr Andrew Stephen Damick","text":"And I'll say, by the way, I know you're about to finish the sentence."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9193.09,"end":9193.45,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9193.45,"end":9197.37,"speaker":"Fr Andrew Stephen Damick","text":"But like, the YouTube chat has been lit up with exactly these kinds of questions."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9197.37,"end":9203.41,"speaker":"Fr Stephen De Young","text":"Yes. Well, what about the Cross then? Well, what does the cross do then? It's the cross, the cross, the cross, crucifixion. The cross, the crucifixion."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9203.65,"end":9204.21,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9209.25,"end":9218.77,"speaker":"Fr Stephen De Young","text":"Where that's the central point. That's the end all and be. All right. Like, everything's accomplished right there. It's done. Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9219.17,"end":9220.17,"speaker":"Fr Andrew Stephen Damick","text":"Which is kind of funny."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9220.17,"end":9222.13,"speaker":"Fr Stephen De Young","text":"I mean, what about the Resurrection?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9222.29,"end":9226.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'll say. By the way, just to telegraph our next episode is going to be about the cross."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9227.33,"end":9227.73,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9227.73,"end":9229.09,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, come back later."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9229.25,"end":9231.81,"speaker":"Fr Stephen De Young","text":"But we're going to get right to that question."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9232.37,"end":9244.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. But, like, it's. It's interesting, you know, when Jesus says, it is finished. He's not dead yet. You ever notice that? Guys, I just want to put that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9244.26,"end":9247.82,"speaker":"Fr Stephen De Young","text":"Out there, and we'll talk more about that, what that means next time."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9247.82,"end":9249.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9249.42,"end":9253.26,"speaker":"Fr Stephen De Young","text":"But. But we don't stop at Good Friday."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9255.42,"end":9255.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9255.9,"end":9260.86,"speaker":"Fr Stephen De Young","text":"In fact, we just celebrated the Sunday of the Cross, and it's smack in the middle of Lent."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9262.06,"end":9263.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9263.98,"end":9341.02,"speaker":"Fr Stephen De Young","text":"Lent is not preparing for the cross. Lent is not preparing for Good Friday. Len is preparing for the celebration of the Resurrection. So people are stopping a little too early in their thinking. Right. Because when St. Paul talks about Christ's death and resurrection, Right. He sometimes refers to the cross. But when St. Paul refers to the cross, if you read closely and follow what he's saying, the cross for him includes the whole sequence of events. The cross includes Christ's whole life and all the suffering. And everything he endured leading up to the actual crucifixion. But it also includes his resurrection. Right. And the cross part, the part about being dead. Right. The part about suffering. That part we've already got. Right. We're already spiritually dead. Israel was already dead. They were dry bones in a valley. See Ezekiel, which we read right before."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9341.02,"end":9345.02,"speaker":"Fr Andrew Stephen Damick","text":"Pascha as part of the Holy Saturday series of synopsis."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9346.55,"end":9377.47,"speaker":"Fr Stephen De Young","text":"Already dead, Right. We got that part. What we're looking for is the renewed life, the new start, the renewal of our nature. Right. The freedom that comes on the other side. Right. Of Passover, of Pascha. Right. That's what we're looking for. That's what we're hoping for. That's what our trust is in. That's what we're preparing to celebrate. Right. And so if you just stop."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9379.47,"end":9379.83,"speaker":"Fr Andrew Stephen Damick","text":"At."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9379.83,"end":9397.87,"speaker":"Fr Stephen De Young","text":"The cross and try and view that as the end all and be all of atonement and of salvation. Right. You're really missing a lot of the core of Christianity which actually surrounds the fact that Christ. You know, I'm saying this early, but Christ is risen. He still is, even when it's during Lent."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9398.1,"end":9398.26,"speaker":"Caller Gregory","text":"Right."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9398.26,"end":9455.42,"speaker":"Fr Stephen De Young","text":"It's not like he stops being risen. Right. That's at the core of the Christian proclamation. Right. All kinds of Jewish people and lots of atheists and lots of people of other religions, not Muslims, but just about everybody else acknowledges that Christ was crucified. What separates Christians is that we believe he's risen. So we should think about that a little. Right. And if our mind and our theological thinking can't move through the crucifixion to the Resurrection, we've got a blockage there that needs to be cleared in our thinking. But that said, we'll get into the cross more next episode."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9455.66,"end":9678.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Well, to wrap things up briefly here at the end, I mean, I think. I think especially in looking at this text, which has this profound hope for the atoning of all things, let us say, the cleaning up of all things, and God's intervention and pushing the devil away, you know, from. From this world and sending the sin back to him and all this kind of stuff. I mean, I. I think that that's very applicable for this moment in human history where many of us, maybe not the whole world, but certainly many of us here in the west, and particularly many of us in America often, you know, at this moment, I think many of us feel like the world is closing in around us. Like I hear people say all the time, the world is crazy. Whether that has always been the case or Whatever doesn't matter too much because we were having that experience. People feel like our society is cracking, you know, and one of the reactions that I see people have is, is despair. And, you know, despair, you know, for some people, that leads them over the edge and they'll take their own life or whatever. But also what despair does is it can be nihilistic and harm other people. So, like, despair is kind of the basis for terrorism, you know, for mass shootings and all this kind of stuff. I mean, this is why so many people who commit these mass shootings, the last person they shoot is themselves. Because that, you know, in some sense, they feel that the world has fallen to pieces, that there's nothing there for them. And Christianity absolutely has critique for the world. Absolutely. Of course it has critique for the world, but what it has more than anything else is hope. Christ didn't come into this world to condemn it, but to save it. He's, you know, that is explicitly in the Scripture. Again, that doesn't mean there's no critique. It doesn't mean that sin isn't condemned. But fundamentally, what the message of Jesus is to the world is a message of hope, of rescue from all of this darkness, of rescue from slavery to sinful passions, which is really about involvement with demonic powers. And one of the things I like about the text that we talked about tonight is that it makes that spiritual warfare very, very explicit. I mean, you actually see this demonic being, Azazel, who is essentially the devil, in a number of these kinds of texts. You see him on the scene and being battled against, interestingly, by Abraham, right? Yes. God, his angels, and so forth are all involved. But. But Abraham is the locus of all of that. And our call is to be sons of Abraham. Our call is to be, you know, his offspring, to use the language of St. Paul. And if we are Abraham's offspring, meaning we are. If we are the faithful, if we do as Abraham did, then that means that we inherit the promises to become like the stars, right? To become like the angels. Because that's what was promised to Abraham from the beginning. And that's what salvation ultimately is, is it's becoming equal to the angels, as Jesus says. And so I, you know, even though maybe this is not one of the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9678.97,"end":9680.09,"speaker":"Fr Stephen De Young","text":"Sort of the greatest hits of the."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9680.09,"end":9754.67,"speaker":"Fr Andrew Stephen Damick","text":"Apocrypha, although, I mean, I think this is a really interesting text, it may not be the ones that, you know, people clamor about the most, I still find it absolutely fascinating and very hopeful. You know, it tells this story in a particular way. That I think connects with us Here in the 21st century west very well, not just in terms of the assessment of how we feel the world is at this moment, but also in terms of, okay, here's what we do. Right. And, you know, if you're going to imitate Abraham in this particular text, it's about offering those sacrifices both in the literal sense of participating in the Divine Liturgy, but also in the. The broader sense of offering ourselves as living sacrifices, as. As turning over what it is that we have to God so that can be transformed and made salvific for us. Yeah. So I. I really enjoyed this, this discussion. And even though this is a text not written by a Christian, obviously Christians can get a whole lot out of it, A lot of beautiful, beautiful stuff. So, yeah, thank you. Thank you, Father, for guiding this conversation. So what is it that you have to say here at the end of all things?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9755.39,"end":9760.43,"speaker":"Fr Stephen De Young","text":"So. Well, hopefully not. I don't know that I'm ready for that."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9760.51,"end":9761.23,"speaker":"Fr Andrew Stephen Damick","text":"All these things."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9761.23,"end":9762.67,"speaker":"Fr Stephen De Young","text":"I should be more ready than I am."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9763.66,"end":9764.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9765.5,"end":9954.06,"speaker":"Fr Stephen De Young","text":"But, yeah, so I know this. What I'm about to talk about is something I've talked about probably even fairly recently on the show. But I find myself in real life, meaning as a. As a priest dealing with a group of parishioners and trying to help them and guide them and just family members and everybody in general, I find myself having to say this over and over and over again, which tells me that probably, if. If I say it over this microphone to people, there's probably at least some folks out there who need to hear it again, even if I have talked about it recently, the Christianity that those of us, at least in the United States, again, I can only speak about that experience because I haven't had any others. Christianity we grew up around came from one of two categories, largely. And, you know, people who want to defend those types of Christianity will call this a caricature. I don't care anymore what you want to say about what I say, but this, what I'm about to say, even if you think it's a caricature of what they're trying to teach, this is what a lot of the people within these traditions have actually received. Right. So it's very easy to defend some tradition based on what's in the books and what's, you know, what, what we would mean to say. Right. But I'm talking about what the people who I encounter, the people who talk to me about spiritual things, the people who come to me and give confessions, what they've received from the Christianity they've grew up around, how that has shaped them, how they think because of it. Right? And if, if people, representatives of those groups want to say that's not what they meant to teach, cool, but maybe some introspection on why that's not what people are receiving. Anyway, what people have received comes into two categories. One is sort of the smiling Bob Shuler school of God loves you just the way you are and you don't have to do anything. Just don't worry about it. Just smile and be happy and listen to the hymns of your choice that you enjoy. Right? That worked. I'm going to get be very blunt. That worked really well with boomers. That seemed to answer something they needed to hear. Maybe they're a generation who grew up with very dissatisfied perfectionist parents. And so just hearing you're fine just the way you are was what they needed. Right? But that, that doesn't work on subsequent generations because subsequent generations are more realistic or nihilistic, depending on your point of view, and know there's something deeply wrong with themselves and with the world around them. So just telling them over again, no, no, you're fine. Everything's fine. Everything. It doesn't work. Right? That's why those kind of churches are all empty. Now, the other school of thought is pretty much the exact opposite. It's God that doesn't really love you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9955.98,"end":9956.38,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":9957.02,"end":10105.77,"speaker":"Fr Stephen De Young","text":"In fact, he's pretty angry with you and he's getting ready to send you to hell. Right? And the only way to avoid that is depending on your tradition, right? Is for you to love him nonetheless, really sincerely, and there's a rabbit hole to go down. How sincere am I ever really and. Or do that. Plus live your life at a certain way and follow certain rules which will differ based on tradition and which you will inevitably fail at that second one is most of the people who I interact with on spiritual matters, and it's almost like they've been taught and they've internalized that their life in this world is this sort of really horrible reality show, almost like Squid Game and Like God is about weeding out contestants and narrowing it down to this faithful few. And everybody else goes to hell, goes to eternal punishment, except for this faithful few who again, depending on your tradition, he may just pick or, you know, they're the ones who really did it, right? They're the ones who really loved him sincerely, or they're the ones who really live their life the right way. And any way you slice those things, most people, again, are realistic enough that when they look at their life, they don't see a lot of evidence in their life and their actions that they're one of the people God picked, or they don't see a lot of evidence in their life that they're really sincere about following God, or they don't see a lot of evidence in their life that they're really toeing the line and living the life they know they should be living. Meaning most people are walking around, right? Like religious people walking around thinking they're probably going to end up in hell, that God is probably mad at them most of the time, and that he's looking for them to make some misstep. So, boom."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10108.01,"end":10108.37,"speaker":"Caller Gregory","text":"Right?"}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10108.37,"end":10334.54,"speaker":"Fr Stephen De Young","text":"They can. They can get nailed. Also, most atheists are walking around doing the same thing. They're protesting constantly that there is no God because they can't deal with that guilt and stuff that they've internalized. They can't live like that. No one can live like that. But their rap route to trying to live like that and deal with the cognitive dissonance is just to deny that any of it's true over and over and over again, publicly, loudly, to every one who will listen, right? Whereas the religious people are just in this kind of quiet desperation of, how do I figure this out? Right? So let me reiterate again, right? And penal substitution pays plays a big part in this. That's why I'm bringing it up in this context. God loves you. Jesus said so. St. John's Gospel. The Father himself loves you. He is not angry at you. He does not want to destroy you for your sins. There is no power of justice that commands him to do so. No one commands him to do anything. He loves you. He wants you to find salvation. But salvation is a thing you have to actually do. He wants you to do it. The Bible says so. God wills that all men be saved and come to the knowledge of the truth. But you have to do it. He empowers you to do it. He forgives you when you mess up trying to do it. He heals you when you damage yourself trying to do it and failing. He is entirely on your side. The God who created the universe is entirely on your side. And the saints are on your side. And the church is on your side. Everyone is on your side, right? Christ is advocating for you. Everything is set up for us. When St. Paul says to us, continue to work out your salvation with fear and trembling, you don't stop there, like Kierkegaard did. Read the next verse. Because it is God who is Working in you to will and to do according to his pleasure. We continue on and we work out our salvation because we know that God is on our side and empowering us to do it and loving us and loving other people through us. We need to. And we need to pray about that. We need to pray it, we need to repeat it. We need to kind of imitate what the atheists are doing. We need to say it out loud. We need to say it to each other. We need to say it to everyone who will listen, right? That God loves you and wants you to find salvation, wants you to be healed, wants you to be set free from sin. He wants all these things for you. It doesn't mean you have nothing to do. That doesn't mean you're fine just the way you are. You know, you're not fine just the way you are, right? But it means that he is there to help you to grow, to be transformed into the person who you need to be and want to be the person he created you to be for eternity. That's the actual message of Christianity. Don't accept any substitutes for that ever at all, for any reason. That's what I have to say."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10335.26,"end":10361.27,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight, everyone. Thank you very much for listening. If you didn't happen to get through to us live, we'd still like to hear from you. You can email us@lordofspiritscientientfaith.com you can message our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits if you have basic questions about our Orthodox Christianity or you need help to find a parish, because that is where we live this life. Head over to orthodoxintro.org and join us."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10361.27,"end":10372.15,"speaker":"Fr Stephen De Young","text":"For our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. I sailed the sea of desolation and dropped my anchor there I plumbed the depths of isolation Walked its length and was not scared."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10372.55,"end":10382.4,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, you can join our discussion group, leave reviews and ratings and share the show with a friend who's going to benefit from it."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10382.8,"end":10394.96,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to as faith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. Went from end to end to end and then from there I went again the road that only this one knows off to nowhere Here I go."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10395.68,"end":10398.16,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless you."}
{"episode_id":"LOS - #113 - 2025-03-27 - Apocalypse of Abraham and Atonement Revisited","start":10406.09,"end":10443.14,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
