{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":0.24,"end":64.45,"speaker":"Audience Member","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":65.33,"end":109.91,"speaker":"Fr Andrew Stephen Damick","text":"Greetings, giant killers, dragon slayers, pursuivants of the perfidiously paranormal. You are listening to the Lord of Spirits podcast and this is episode 121. I don't know, a few episodes back, I thought it was a good idea to start giving these numbers just so we could all feel a little bit more exhausted. My co host, Father Stephen DeYoung, the Material Menace that menaces the phantom menace is with me, straight from the swamp in Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, perched precariously atop the arcane tower of podcasting, hovering dozens of stories above a disused gateway to the underworld. And this is a pre recorded episode, so we're not taking any calls for this one. Next time though, Next time it'll be all calls. So get ready."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":109.91,"end":111.79,"speaker":"Fr Stephen De Young","text":"Feel free to call and see what happens though."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":111.79,"end":117.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, as we always say, has that ever happened? We don't know. Probably because there's no one actually sitting there next to."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":117.63,"end":120.35,"speaker":"Fr Stephen De Young","text":"There might be tonight though. There might be someone sitting there lonely and bored."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":120.91,"end":121.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Poor."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":122.35,"end":123.79,"speaker":"Fr Stephen De Young","text":"Brighten up their day with a phone call."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":124.59,"end":132.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Everyone, everyone say a prayer for Mike Degan. He has to spend his nights at the Ancient Faith Studio. What else could he be doing with this time?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":132.31,"end":135.23,"speaker":"Fr Stephen De Young","text":"I don't know, Mike. Simple plan, Dagann."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":136.12,"end":212,"speaker":"Fr Andrew Stephen Damick","text":"That's right. So, yes. So this Lord of Spirits episode is brought to you by the Antiochian men. So this November 5th through 8th, 2026, you can join them in Temple Georgia for their second annual Antiochian Men conference and retreat, which is titled no Man Left Behind. Brotherhood is a Path to Salvation. This event is a Unique blend, much like a coffee of spiritual formation. Hands on challenges and real brotherhood. With talks from Father Barnabas Powell, Father Hans Jacobsee, Father Michael Butler, and our very own Father Stephen DeYoung. This is open. That's right. This is open to all men 18 and older. So everyone is welcome to join. And yes, this is the line that they gave me. All are welcome to join in preparation for battle both seen and unseen. Early bird registration. Right. I think we should do, we should do, we should write our own script for this. That begins with. In a world of seen and unseen where early bird registration is just $275 and that includes three nights and nine meals. So don't eat all your meals on the first day because you'll use them up."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":213.68,"end":221.52,"speaker":"Fr Stephen De Young","text":"You're not going to beat that price. I do have to say, as a Dutchman, you can tell there are two Dutch priests involved in the planning here."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":222.76,"end":225.56,"speaker":"Fr Andrew Stephen Damick","text":"What can we get that is absolutely the cheapest thing ever."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":225.56,"end":239,"speaker":"Fr Stephen De Young","text":"3 nights accommodations and 9 meals for 2 set. Like is gruel available? Come on, man. It's actually, it's actually, it's, it's. I mean it's cafeteria food at a campground, but it's. Yeah, it's, it's pretty good."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":239,"end":257.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So this is an all QA episode too, but it's pre recorded. This is a Speak Pipe palooza, as it were. So I have lined up. This is, this is a 21 questions episode, literally. Although actually some of these people have asked more than one question. So it's really 21 questioners."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":257.38,"end":258.18,"speaker":"Fr Stephen De Young","text":"These people."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":258.34,"end":276.66,"speaker":"Fr Andrew Stephen Damick","text":"I know you people, you people. But enough of these have stacked up in our inbox that we decided to go ahead and empty it on out and just sort of see what hits the ground. So you ready for the lightning round or the. I don't know, I'm trying to come up with something pithy to say. It's not coming."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":276.82,"end":278.26,"speaker":"Fr Stephen De Young","text":"A lightning round isn't going to work."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":278.26,"end":279.54,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that'd be too fast."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":279.7,"end":280.9,"speaker":"Fr Stephen De Young","text":"I'm going to end up rambling."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":281.7,"end":313.45,"speaker":"Fr Andrew Stephen Damick","text":"Okay, this first half, I have to say, by the way, many of you had all kinds of but what abouts and so forth for our episodes about authority, Mosaic, succession, apostolic succession. So we have decided to entertain a few of those and I've just dumped them all here at the beginning of this rebel scum. Nice, nice. So this first one comes from Anthony who has a question about the obedience of Roman Catholic priests. Why they're asking us about this, I don't know. But here you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":313.61,"end":389.15,"speaker":"Audience Member","text":"Dear fathers, thank you for taking this call and hopefully answering my question. My name is Anthony. I'm calling from the peaceful town of Memphis, Tennessee. I'm a Greek Orthodox American and I have benefited immensely from your podcast and show. So thank you so much for that. I just finished listening the very latest episode to show on apostolic succession and it brought to mind in terms of obedience, it brought to mind a comment that was made in your episode with regard to baptism that Father Stephen mentioned that there is Roman Catholic priest somewhere in Louisiana who against the edicts of his parish or bishopry or the Pope of Rome for that matter, baptizes people who are not have 100% of their faculties or something to that effect. So I was wondering, would you justify a priest, a Roman Catholic priest, not being obedient to his bishop Pope, whereas obviously we do have obedience that any priest owes to his bishop within the Orthodox Church. Is it a matter of not being Orthodox or how would you rationalize that? Thank you so very much for everything that you do and God bless you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":389.23,"end":398.37,"speaker":"Fr Andrew Stephen Damick","text":"I feel like there's a lot of loaded in there. Like would, would you rationalize the actions of Roman Catholic priest who is disobeying his bishop?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":398.37,"end":418.45,"speaker":"Fr Stephen De Young","text":"Father Stephen, somewhat definitionally, if you are in some kind of ecclesial body or religious body other than the Orthodox Church to a certain extent and a differing extent depending on the group, your salvation hinges on you being disobedient."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":418.69,"end":418.81,"speaker":"Audience Member","text":"No."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":418.81,"end":422.37,"speaker":"Fr Andrew Stephen Damick","text":"There we go. See, that'll satisfy a lot of our anti ecumenist listeners."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":423.25,"end":450.7,"speaker":"Fr Stephen De Young","text":"Yes, because. Because. Right, because the reason why I think I'll speak for myself here, people should become orthodox is that the Orthodox Church has correctly guarded and preserved the way of salvation to varying degrees. Other religious bodies have not perfectly preserved it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":450.7,"end":452.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean this is Orthodox."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":452.9,"end":522.25,"speaker":"Fr Stephen De Young","text":"Yes. Therefore the guides and authorities in those bodies are not going to 100% lead you down the correct path. And so to varying degrees you're going to have to be at least inconsistent with if not, and we talk about this all the time, Roman Catholics are totally cool when we talk about in terms of Protestants, like I don't think every Calvinist is going to hell, but I also know a lot of Calvinists and I know most of them live in a way that is not consistent with the really bad and problematic parts of their doctrine. And that is a blessed inconsistency. That is a blessed inconsistency. If you believe something that is incorrect, but you live not according to that incorrect belief, that is a good inconsistency for me as an Orthodox priest. The same applies to Roman Catholicism. And if you want a quick guide to where are the places where I think Roman Catholics should not follow Roman Catholic doctrine. That would be every place where it's different than orthodox doctrine. I think everyone on earth should live their life as an orthodox Christian. That's much easier if you join the Orthodox Church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":522.49,"end":611.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think based on a lot of the questions that we got, not only in the Facebook group, but emails and I mean, those two episodes clearly excited a lot of people. I think frankly, it's because, as we said in those episodes, I mean, most of our listeners are American and like, authority is just a thing we generally have a problem with on principle. Like, it's just inherently suspicious. Yeah, yeah, exactly. You know, how dare you tell me what to do? Like, for instance, you know, the. The assumption behind Anthony's question seems to be that we are just sort of baldly pro authority. Like all authority must be obeyed, no matter what. It's interesting, even in, I mean, you know, even in, in the book of Acts, right, where the apostles say we must obey God rather than men, they're not saying we must obey the dictates of our own conscience rather than men. It's we must obey God rather than men. Which is not an anti authoritarian thing to say or should say. Anti authority. I don't know. But. But in any event, it's not anti authority because the apostles are the authority and they're setting up authorities. They're not saying, now everybody needs to work this out for themselves. But yes, the question is the legitimacy of the authority. Just because someone has some kind of title or clerical role doesn't make them have authority from the apostles. Authority from God. All right, so these next few questions are kind of along some of these same lines. So this one comes from Jonah, who talks about this question in the context of iconoclasm."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":612.14,"end":676.39,"speaker":"Audience Member","text":"Good evening, Fathers. I had a question about episcopal authority and obedience. I understand your explanation that a bishop can be factually or even theologically wrong, but still authoritatively correct. But what happens when heresy and authoritative rulings are deeply connected? Like the Council of Eria, which notably endorsed iconoclasm and ordered the removal of icons. There wasn't just an abstract error. It directly impacted worship. Yet monks like St Stephen the younger, who weren't bishops and held no ecclesiastical authority, disobeyed that ruling by keeping and venerating icons and still they're commemorated as saints. Was this an exception? Not the role situation where someone like St. Stephen had clarity from the Holy Spirit that justified disobeying his bishop? And if so, how would someone know that it's truly the Holy Spirit guiding them and not pride or personal conviction? I want to understand how obedience and truth interact, especially in cases where the authoritative teaching seems bound up with real damaging error."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":677.51,"end":706.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So a number of questions we've gotten about those episodes are exactly along these lines, like, what happens if your bishop teaches heresy? Which probably at the time, during the Iconoclast controversy, the fact that it was a controversy was an indication that not everyone was super certain that it was a heresy or not. There was some question about whether this was a heresy or not. Obviously, a number of the saints gave their lives because they believed that it was, and they were right in doing so."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":707.11,"end":709.11,"speaker":"Fr Stephen De Young","text":"But they were executed."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":709.35,"end":711.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":711.75,"end":713.19,"speaker":"Fr Stephen De Young","text":"They went to their deaths."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":713.83,"end":714.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. They didn't."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":715.19,"end":716.95,"speaker":"Fr Stephen De Young","text":"I think that's one of the deaths of the authorities."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":717.35,"end":751.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's rather than like, they did not say, oh, I'm going to set up a separate church hierarchy. I think that's one of the big things, especially when you're looking at the, the first millennium and all the, the various christological and other kinds of theological controversies, is that the fights were ultimately in many, when it comes down to who's going to be a bishop or whatever, the fights were over the Episcopal see itself, not over, you know, creating a separate church. It was the heretics who largely were known for, if they felt like they had to, creating a separate church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":752.05,"end":754.09,"speaker":"Fr Stephen De Young","text":"I mean, you know, the Maddox, like Donatus."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":754.09,"end":773.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. So, like. But okay, so what do you do? You know, this is the big hypothetical. Although it's hard for me to, I don't know, I, I, I, as I get older, I, I'm less interested in hypotheticals, but I understand their value. Hypothetically, you know, if your bishop says, smash all your icons, destroy all your icons, do you say, okay, well, you're the bishop."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":774.69,"end":777.01,"speaker":"Fr Stephen De Young","text":"Okay, so here's the problem."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":777.91,"end":778.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":779.91,"end":802.23,"speaker":"Fr Stephen De Young","text":"This will be revelatory maybe to female listeners, but not to male listeners. Because here's part of the problem. Men, when they're just standing around, like, waiting in line somewhere waiting for something, you know, they are running through weird fantasy scenarios in their head about what if a guy broke in here and took hostages? What would I do?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":802.23,"end":803.27,"speaker":"Fr Andrew Stephen Damick","text":"How would I take them out?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":803.64,"end":807.8,"speaker":"Fr Stephen De Young","text":"Right. Imagine themselves as like Steven Seagal or something. Yes. Men all do this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":807.8,"end":811.16,"speaker":"Fr Andrew Stephen Damick","text":"I mean, they often are having arguments with people in their heads. Often it's their wives."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":812.04,"end":817.88,"speaker":"Fr Stephen De Young","text":"Yes. And this is, so this is sort of the theological equivalent, to be blunt."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":818.04,"end":818.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":818.44,"end":910.27,"speaker":"Fr Stephen De Young","text":"That's why we Mostly get these questions from male listeners. Yeah, what would I do if they iconic class came and started, right? Oh, no. I would stand up like. Okay, first of all, come on, guys, let's set that aside, okay? It's not a hypothetical. It's a fantasy, okay? And number two, this caller. I'm not picking on this caller because this caller actually hit on something. The bad part of this is coming from pride, okay? You are not Saint Maximus the Confessor. You are not Saint Stephen the New. Neither am I, okay? I have nothing to teach Saint Maximus the Confessor about obedience, okay? He could. He could teach me. I have Nothing to teach St Stephen the new about obedience. He can teach me, okay? But no one listening to this, okay? And your humble hosts, none of us are these great saints, okay? We're not. And we're not gonna be. None of you listening. God has not called you to make a heroic stand against the whole church, which has fallen into error. And if you start thinking that way at all, that is what our Slavic friends call prelest. That is spiritual delusion. You're not. You're not called to that, okay? You're not even called to judge. You're not called to be the one who sorts out which bishops are really orthodox and which ones aren't. You're not. And you doing that is coming out of pride, 100%. There's no when is it pride and when is it something else? It's all pride."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":910.75,"end":911.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":912.44,"end":925.08,"speaker":"Fr Stephen De Young","text":"That is not your calling. I guarantee it. I also say with confidence you're not called to be a pillar saint. There are a bunch of other calling. The fact that you're listening to this tells me that that's not your calling."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":925.4,"end":926.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":927.16,"end":965.41,"speaker":"Fr Stephen De Young","text":"You're probably called like 99% of the Orthodox Christians in history and 99.99999999% of humans who have ever lived to live a calm and peaceful life in godliness and sanctity. That's what you're called to, and that includes obedience. That doesn't include you making some kind of heroic stand for the truth. Okay? That's a nice fantasy when you're standing in line somewhere, and probably a better one than being an action hero, because at least you're being a saint instead of Steven Seagal."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":965.41,"end":1016.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, And I would also add this might make some of our listeners cancel us, but you throw a big bone to the anti ecumenists at the beginning. So now I'm going to hit them from behind. A lot of people having fantasies about standing up for the truth in the face of the way that your bishop happens to handle the incredibly extraordinary situation of what happens when there's a virus on the loose and killing a lot of people. I saw, like, it's amazing to me. I've seen people refer to, quote, the heresy of Covidism. I'm like, the what of what? You know, it's not, it's not. It's actually a bunch of guys muddling through, trying to figure out the best thing to do in what was a temporary emergency and is basically over now. So."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1016.29,"end":1028.77,"speaker":"Fr Stephen De Young","text":"But here's the thing. If you set out to be the next St. Mark of Ephesus, you're actually going to be the next Arius or Donatus and. Except you're going to be less successful and less famous."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1029.25,"end":1029.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1030.61,"end":1032.61,"speaker":"Fr Stephen De Young","text":"You're going to be a footnote heretic."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1032.61,"end":1033.73,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1034.13,"end":1035.25,"speaker":"Fr Stephen De Young","text":"Don't nobody want that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1035.33,"end":1042.37,"speaker":"Fr Andrew Stephen Damick","text":"All right, here's another one. I think this might be very similar, but we'll just hear what James has to say about this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1044.69,"end":1125.94,"speaker":"Audience Member","text":"Hi, Father is Bless. This is James Cruz calling from Northern Virginia. I was just listening to your last episode on authority and it's all good stuff. I'm calling about the principle at the end of the last episode where Father Andrew was saying that the Orthodox Church has no tradition of disobedience or going against the bishop. And the one story that came to mind was during the story of the. During the Iconoclast period when the one bishop voted basically that icons were idolatry and when he went back to his town, was driven out of town by his parishioners or, you know, the people there. So I'm wondering how that works into the idea of what you guys were saying. Bishop's always being right and there is no, like, there's no grassroots authority or power to overrule authority. So what was going on in that time, Was that just wrong of those people? Was that the Holy Spirit working through a large group of people maybe as an exception to the rule, maybe just a one off, or is there a different way of understanding that? So thanks."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1126.64,"end":1130.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this one gives another twist to the question."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1130.56,"end":1131.68,"speaker":"Fr Stephen De Young","text":"The populist version."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1131.68,"end":1176.78,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yes. Right. I mean, I remember it's funny and I actually misremembered this or maybe I remembered correctly, but the thing that I remembered was actually incorrect. That one of the things that was said in the wake of the Council of Florence, where of course the Orthodox bishops, most orthodox bishops, very infamously capitulated to, you know, trinitarian heresy, that is the filioque clause, in order, basically, as Part of a kind of a political deal to get military help from the west against the encroachment of the Turks. That it was said that Isadore of Kyiv, that when he went back home, you know, he was attacked by crowds and dragged through the streets, et cetera, et cetera, et cetera. And I mean, have you heard that story? I remember hearing that story over and over again."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1177.18,"end":1177.98,"speaker":"Fr Stephen De Young","text":"I don't know. Maybe."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1177.98,"end":1180.66,"speaker":"Fr Andrew Stephen Damick","text":"Maybe. And what's funny is that's long after."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1180.66,"end":1181.82,"speaker":"Fr Stephen De Young","text":"I lose interest in the world."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1181.82,"end":1183.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1183.1,"end":1183.9,"speaker":"Fr Stephen De Young","text":"Thousand years after."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1183.9,"end":1304.75,"speaker":"Fr Andrew Stephen Damick","text":"A thousand years after. And the reason why I happened to look this up was I was putting it in a piece of writing and someone asked me about one of the. My editor actually asked me about one of the details, and so I decided to go look it up, and I realized that that story is completely not true. What happened was it was actually the local secular ruler who deposed him, and he left and went on to become a Catholic cardinal and actually, yeah, lived out the rest of his life in the West. So that's not how that went down at all. But the other thing I want to say about the Council of Florence, since this often gets brought up as an example of, oh, you know, the people need to rise up when their bishops are wrong. And it is true that there was some civil unrest in some places or whatever, but it was not that all the bishops capitulated, and only Saint Mark of Ephesus did not. There were bishops there from Georgia who did not capitulate either. They did not sign on either. And indeed, there was a whole lot going on. Like the Patriarchate of Antioch, Patriarch of Antioch was not there, but was essentially. He was opposing it. I mean, there was actually a lot of opposition in the Orthodox East. It wasn't like, oh, everybody capitulated, became a uniat, except for this one guy. That is not the actual story people. So that means that there were bishops leading people in the appropriate orthodox way at that time. Lots of them. Not just the one, but I. The thing I want to say about this populist version is, yes, you might say, okay, a heretical bishop getting dragged through the streets, that's the judgment of God. And especially if you are that bishop, that is how you should see it. But the judgment of God comes at the hands of people who are not necessarily doing good and holy things. Like when the Assyrians came in and carried off the 10 northern tribes of Israel, that is interpreted in the Scripture as being the judgment of God."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1304.75,"end":1306.59,"speaker":"Fr Stephen De Young","text":"Massacred most of them, right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1306.75,"end":1382.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, massacred Carried off. I mean, and these are the. Again, these are the worst people on earth, the Assyrians, at that point. I mean, this is. This is literally like. I think it was. Was it SR. Haddon who. Who beheaded a bunch of his nobles and then wore them as some kind of freakish necklace around just to show. Right. This, this is the kind of people we're talking about. The scriptures do not say that they were doing that. The Assyrians are good and holy and righteous people. So just because something is the means by which the will of God is carried out doesn't mean that those people are doing the right thing in and of itself. You know, in the case of Isidore of Kiev, who was deposed by the secular ruler of his area, do we really want to enshrine that as a principle in the Orthodox Church that it's cool? I mean, it's happened many times in history. Do we think it's good, Is this a good thing that secular rulers should be given the imprimatur by the Church to depose the hierarchs that they regard as heretical, that they regard as not a good idea, you know, is doing the wrong thing. It's pretty dangerous grounds. Kind of makes you rethink that whole Symphonia thing, huh? Which is not orthodox doctrine, by the way. Everybody."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1382.86,"end":1396.06,"speaker":"Fr Stephen De Young","text":"Yeah, the. So part of the problem, and I know this is a hard shift. We've talked about this a lot on the show. Orthodoxy is not a system of doctrine that you assent to."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1396.78,"end":1397.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1398.02,"end":1401.3,"speaker":"Fr Stephen De Young","text":"It is not a certain narrative of history."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1402.1,"end":1402.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1403.06,"end":1455.59,"speaker":"Fr Stephen De Young","text":"Sign off on these evaluations. That's not what Orthodoxy is. Orthodoxy is a way of you and me living our actual real life in the world now today. And if you try to live your life in the world now today with the idea that you need to judge everything your spiritual father says to you as to whether it is correct or not, whether it's really orthodox or not, you will not have a spiritual father. You will have a guy who occasionally gives you advice that you follow or don't follow as you see fit. That's not the same thing. So, frankly, if you're going to do that, if you're one of my parishioners and you're listening, and that's how you approach confession, don't bother coming to confession. You're wasting my time."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1458.39,"end":1459.07,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1459.07,"end":1478.31,"speaker":"Fr Stephen De Young","text":"If you have no intent of, you know, doing anything I say, I mean, it's this. What are we doing? What do we put? If you want a spiritual father to help you find salvation, you're going to have to do what he says. You're going to have to do it uncritically because if you evaluate every word he says, again, it's a waste of time. It's a sham."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1478.39,"end":1478.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1479.17,"end":1518.68,"speaker":"Fr Stephen De Young","text":"If you're not going to submit yourself to the life of the church, if you're just going to live the way you see fit, in addition to the arrogance and pride I was talking about before, where you're assuming that, well, you have all your theology. Correct. So you can evaluate the bishop's theology and decide if he's a heretic or not, aside from the just implied arrogance there, that you have it all together, you have no guides. You have no guides. You might as well not be a member of the church because you're not going to listen. You're going to judge. You're going to judge the church. You can't live your life that way. And I don't think any of the people asking these questions want to live their life that way or even do live their life that way."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1518.68,"end":1525.44,"speaker":"Fr Andrew Stephen Damick","text":"No, no, they're trying to figure out how to do this thing which is so different from the way the rest of the world functions."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1525.6,"end":1539.92,"speaker":"Fr Stephen De Young","text":"But so you need to, in your head, you need to make that break of, wait. Orthodoxy is not an abstract system of doctrine. The canons are not these abstract principles that I apply. That's not how any of this works."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1539.92,"end":1573.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think it's the same spirit that drives the whole profile picture change. I stand with whatever like. And that is regarded as, or, you know, posting the appropriate opinions on, on Twitter or whatever. This, this is regarded as an actual act rather than just. You know, it's funny, we. You don't hear the phrase virtue signaling as much these days. And maybe it's because it's now become accepted that, that that is virtue that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1573.97,"end":1577.53,"speaker":"Fr Stephen De Young","text":"These sort of verbal affirmations spin off piety signaling."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1577.53,"end":1600.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, there you go. That. And, and so, you know, with, with the retreat of humans into more of a digital space, then I think that these kinds of purity tests are, Are becoming more and more the definition in some people's heads of, of what it means to be faithful. I actually did see it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1600.59,"end":1601.95,"speaker":"Fr Stephen De Young","text":"It's just Protestantism."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1601.95,"end":1603.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, there you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1603.79,"end":1611.23,"speaker":"Fr Stephen De Young","text":"No, it's late faithfulness, late stage. You have the right opinions, you believe the right things, you have the right beliefs. Therefore you're a good person. You're one of the elect."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1611.59,"end":1613.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I did see a."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1614.63,"end":1615.67,"speaker":"Fr Stephen De Young","text":"No works required."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1616.07,"end":1640.32,"speaker":"Fr Andrew Stephen Damick","text":"I did see a bright, a little bit of a bright piece of hope. Recently, because I saw this survey where they asked a bunch of 8 to 12 year olds, like, what would they really rather be doing with their time? And the majority of them, even if they had smartphones and access to screens and stuff, said that they wanted unstructured time outside. So there you go, everybody."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1640.56,"end":1642.56,"speaker":"Fr Stephen De Young","text":"Parents crave touching grass."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1642.72,"end":1671.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, people want it, but parents, it's a little bit harder. Yes, unstructured time outside, it's a little bit harder. But that's what kids actually seem to desire. One hitch, of course, and we'll have to push back against the world about this, is that in many cases, unstructured time outside for kids is not dangerous because they're having unstructured time outside. It's sometimes dangerous because your neighbors think they should not be having unstructured time outside and may call the police. So don't do that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1671.84,"end":1672.96,"speaker":"Fr Stephen De Young","text":"Nobody likes a rat."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1672.96,"end":1675.2,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Don't do that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1675.52,"end":1676.48,"speaker":"Fr Stephen De Young","text":"A stoolie."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1676.48,"end":1684,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. All right, our next one comes from Rob, who has a question about the principalities and powers of Michigan."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1685.52,"end":1694.08,"speaker":"Audience Member","text":"Hello, fathers. This is Rob, formerly of Kalamazoo, and I'm calling to ask about a conversation."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1694.16,"end":1699.02,"speaker":"Fr Stephen De Young","text":"Had maybe two episodes ago with a."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1699.26,"end":1705.58,"speaker":"Audience Member","text":"Northern Michigander who denied their belonging to Michigan."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1706.3,"end":1707.98,"speaker":"Fr Stephen De Young","text":"And you know, this broke my heart."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1708.22,"end":1713.46,"speaker":"Audience Member","text":"As a born and raised Michigander. And is this, is this a spirit."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1713.46,"end":1715.66,"speaker":"Fr Andrew Stephen Damick","text":"Of rebellion and the powers placed over."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1715.66,"end":1719.02,"speaker":"Audience Member","text":"Us, you know, we're implored by Paul."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1719.02,"end":1726.96,"speaker":"Fr Andrew Stephen Damick","text":"To slaves obey their masters. Is this a failure to obey the authority and Lansing put over them?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1726.96,"end":1733,"speaker":"Audience Member","text":"Is this a spirit of rebellion that needs to be repented against? God bless. Thank you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1733,"end":1741.52,"speaker":"Fr Andrew Stephen Damick","text":"I have to say I like that phrase, repented against, imprecatory repentance. Is that a thing?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1744.56,"end":1749.12,"speaker":"Fr Stephen De Young","text":"I don't know. I think the Hoopers do utter imprecations against the trolls."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1749.12,"end":1761.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, that does happen. I mean, trolls are real, especially in that area. I mean, they have all those, you know, Finnish people up there in the Upper Peninsula. So I'm sure the trolls there from Finland."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1762.36,"end":1788.43,"speaker":"Fr Stephen De Young","text":"The question though, is, is Lansing the real authority in Michigan? If you've been to Lansing, it's hard to believe. And we all know that there was a pact signed somewhere yielding western Michigan to the Dutch and eastern Michigan to the Arabs. So I think those are the actual power blocks we're dealing with."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1788.75,"end":1791.55,"speaker":"Fr Andrew Stephen Damick","text":"Dearborn is the capital of Eastern Michigan."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1791.79,"end":1797.63,"speaker":"Fr Stephen De Young","text":"Grand Rapids and Grand Rapids in the west capital of Western Michigan with the dependencies of Zealand and Holland."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1798.59,"end":1805.36,"speaker":"Fr Andrew Stephen Damick","text":"All right, our next one comes from Father Emmanuel, who is my almost neighbor in Reading, Pennsylvania."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1806.8,"end":1893.73,"speaker":"Audience Member","text":"Hi, Podfathers. This is Father Emanuel from Reading, Pennsylvania. I really enjoyed your two episodes on authority. They came at a great time for me because we are going through the Gospel of Matthew in our parish Bible study, and we're in chapter 23 right now. So thank you. I have two questions regarding some of the things you talked about. One question that a parishioner had during Bible study was, what happened to the people whom they, the Pharisees, shut out of the kingdom? If they are unjustly shutting the door of the kingdom against others, is God really going to condemn innocent people for bad rulings made by those in authority? Obviously, God is not bound by his own rules, but I thought it was a good question and I wanted your thoughts. The other question is to push back slightly on your analysis of Roman Catholic hierarchy. I appreciated the criticism of the authority structure and that a local synod cannot do anything without the Pope. Though I am not and never have been Roman Catholic. I don't believe that a diocesan bishop needs the permission of the Pope to ordain a deacon or a presbyter. So rather than saying that their bishops have the authority of presbyters, might it be more accurate to say that all their diocesan bishops essentially function as auxiliaries to their one patriarch? And since this is the show of poor segues, speaking of those Catholics, reminds me of an. I'm actually that I have for Father Stephen. Pasta does not have any leavening agents. So it's not wet bread. It's really wet. Azymes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1894.61,"end":1895.57,"speaker":"Fr Andrew Stephen Damick","text":"Shots fired."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1897.25,"end":1905.29,"speaker":"Fr Stephen De Young","text":"Well, the question do azymes count as bread? It's commonly referred to as unleavened bread."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1905.29,"end":1911.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. There's actually Eucharistic implications there. I mean, this is an old, old argument."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1911.41,"end":1914.53,"speaker":"Fr Stephen De Young","text":"If you're doing the Eucharist with Pasta, you're a heretic. You're right out."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1914.53,"end":1915.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's for sure."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1916.51,"end":1919.71,"speaker":"Fr Stephen De Young","text":"I know those Italians get up to some shenanigans, but I don't think even they do that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1920.43,"end":1952.48,"speaker":"Fr Andrew Stephen Damick","text":"The thing that occurred to me about his second question about are Roman Catholic bishops? Should we just define them as auxiliaries? I mean, that was not the basis on which you were making the comment that you made about them really just having kind of almost Presbyterian authority rather than truly Episcopal authority, because they can be, you know, the Pope can. The Pope can unilaterally assign or depose any bishop in the Catholic Church anywhere and has immediate jurisdictional authority in every single parish. Right. If he walks in the door, he's the boss. The local bishop is not the boss."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1953.28,"end":1957.76,"speaker":"Fr Stephen De Young","text":"He could make that particular church, a part of his see, and remove it from the bishop's diocese."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1957.76,"end":1996.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. But one thing I wanted to point out, and this might be a spicy take, is that. And a lot of orthodox may not really realize this, but if you actually read all of the canons from the ecumenical councils that pertain to episcopal authority, you will not see defined anywhere in those councils. Now, certainly a number of the autocephalous churches have made these definitions themselves, but the ecumenical councils have no space in them for auxiliary bishops. It's not a thing, actually, in the universal canonical tradition of the Orthodox Church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":1996.63,"end":2008.35,"speaker":"Fr Stephen De Young","text":"Well, I think the argument would be. Is that it's basically an evolution of the office of core episcopos."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2008.35,"end":2025.01,"speaker":"Fr Andrew Stephen Damick","text":"Core episcopos. Right. Yeah. And honestly, it doesn't even quite match what Father Emanuel was saying, because auxiliaries in the Orthodox Church, they can ordain, but they don't have the authority to decide to ordain on their own. Like they're."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2025.33,"end":2028.13,"speaker":"Fr Stephen De Young","text":"I don't think Roman Catholic bishops do either, for the record."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2029.41,"end":2031.85,"speaker":"Fr Andrew Stephen Damick","text":"Does it have to. I don't. I don't know. The process of. Has to, actually."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2031.85,"end":2038.29,"speaker":"Fr Stephen De Young","text":"So I don't know all the ins. I don't know all the ins and outs, but I have. I have received Roman Catholic clergy into the Orthodox Church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2038.45,"end":2038.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2039.65,"end":2049.9,"speaker":"Fr Stephen De Young","text":"And while their resignation is processed through the local diocese and bishop, it actually goes to Rome."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2050.3,"end":2052.14,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. I know that Rome."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2052.14,"end":2054.38,"speaker":"Fr Stephen De Young","text":"I'm sure the Pope himself isn't handling all of those."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2054.38,"end":2055.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm sure he's got an office somewhere."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2056.06,"end":2060.06,"speaker":"Fr Stephen De Young","text":"He's got an office. He's got secretaries. He's got. But they're doing it in his name."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2060.14,"end":2068.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like it's his office. Ultimately, even the Vatican has to approve elevations to the rank of monsignor. That has to go through."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2068.62,"end":2080.44,"speaker":"Fr Stephen De Young","text":"I think if a priest resigning in southern Louisiana has to go through the Vatican, I find it hard to believe that the Archbishop of Lafayette could just ordain whoever he wants, whenever he wants with no."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2081,"end":2115.42,"speaker":"Fr Andrew Stephen Damick","text":"Maybe he can, but the idea of a bishop that does not actually have territory that he is the sole governor of, that's not in orthodox canonical tradition. That's why I sometimes will say auxiliary bishops are not really canonical. They're more like a. A corp. Episkopos, which is kind of a fuzzy thing anyway. Titular bishops are technically canonical, but kind of hilarious because they officially have a territory, but there's nobody in that territory."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2115.42,"end":2116.46,"speaker":"Fr Stephen De Young","text":"They're nowhere near it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2116.62,"end":2118.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they're not in it. Yeah, exactly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2119.02,"end":2129.43,"speaker":"Fr Stephen De Young","text":"So for those who don't know. Cora Episkopos, that's the bishop of the Cora. The cora was the sort of farmland or countryside around a city."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2129.43,"end":2131.15,"speaker":"Fr Andrew Stephen Damick","text":"Country Bishop Ish."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2131.15,"end":2215.32,"speaker":"Fr Stephen De Young","text":"Right. So you'd have a city in the ancient world, and then obviously all the agriculture for that city is taking place in the lands around it, and there are little villages and stuff around it. So, for example, you see this in the New Testament. You've got Jerusalem, the city, but then outside you've got, like, Bethany, you've got these little villages that are part of these farming communities. And so in the ancient church, you have the bishop of the city, and you only have one bishop per city. But he would have sort of under him a core episcopos who was over that territory, outside the city walls, like the countryside, all those villages and those kind of things. And so, just for practical reasons, the bishop of, say, Antioch wasn't able to go and visit all of those little village churches, and he had a whole city worth of church to deal with. So that's what a core episcopus sort of was. And that's why I was saying an auxiliary bishop is kind of an evolution of that in that it's sort of a bishop now has a canonical territory that he cannot fully oversee by himself. And so he has."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2216.68,"end":2284.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What's weird about auxiliaries in our day is that they give them titles of towns or cities that are inside the diocese of another of the ruling bishop, but they don't actually have a sort of episcopal sovereignty over that city that they have the title of. It's just a title. It's a weird role. I mean, I have worked very closely with a number of auxiliary bishops, and I often say that it is the worst job in the Orthodox Church because it has lots of responsibility, but often no real authority. They're always having to look to someone else, say, is it okay for me to do this? Which, you know, that's the norm for, like, a parish priest, but it's all very clearly laid out. No one expects the parish priest to be the bishop. People do expect that of auxiliaries, but they're not really the bishop. They're a bishop, but not really the bishop. So it's kind of a difficult, very difficult role to live with. All right, this next one comes from Milan, who is asking question about the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2284.14,"end":2291.42,"speaker":"Fr Stephen De Young","text":"Sense, for the record, if anyone's listening, I think the Antiochian Archdiocese does everything right. I don't know what Father Andrew was."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2291.42,"end":2295.66,"speaker":"Fr Andrew Stephen Damick","text":"Everything. Absolutely. I'm just speaking historically."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2296.3,"end":2299.66,"speaker":"Fr Stephen De Young","text":"Somebody doesn't know what side their bread is buttered on. Anyway, here we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2301.34,"end":2316.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay, so this next one is from Milan and not, not the city in Italy, but the Serbian name. I'm sure this, I don't know this, this fellow is Serbian, but it is a Serbian name. And he has a question about the census that Moses took father's place."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2316.48,"end":2361.64,"speaker":"Audience Member","text":"This is Milan from Toronto, Canada. In the book of Numbers, the Lord tells to Moses to take a census of the children of Israel, cutting through the desert, counting only 20 year old males and older. And the numbers that come back are quite substantial. 40,000, 50,000 per trial tribe or 20,000 for Levites. So in total, if we count women and children, that's probably over a million people walking through the desert. So if it's possible, I would like, I would like you to, to provide any commentary to that, if possible. Should we take that literally or should we take that like a narrative that's changed over time? Any comment would help. Thank you so much. Much."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2362.68,"end":2369.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what's, what's with those numbers in the Book of Numbers, Father? This is not something I've ever studied at all. Are they symbolic?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2369.88,"end":2374.44,"speaker":"Fr Stephen De Young","text":"Somebody doesn't want to wait for my numbers Bible studies to get released on whole Council of God. I see."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2374.44,"end":2379.44,"speaker":"Fr Andrew Stephen Damick","text":"It's true. I mean, it's going to be a while. Are you in numbers yet in real time? Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2379.44,"end":2382.36,"speaker":"Fr Stephen De Young","text":"Oh, yeah, yeah. We're getting toward the end of numbers in real time."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2382.6,"end":2382.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2382.96,"end":2387.12,"speaker":"Fr Stephen De Young","text":"I think we're still in Exodus in what's getting released. So that tells you how we are right now."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2387.12,"end":2393.49,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of, you know, the lobe on the fatty liver, bits in between that has to be covered."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2394.13,"end":2397.45,"speaker":"Fr Stephen De Young","text":"Not to mention the dimensions of various tabernacle furnishings."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2397.45,"end":2397.97,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2398.05,"end":2407.41,"speaker":"Fr Stephen De Young","text":"Yeah. So I know we've talked about this before, but the first problem you have with trying to take biblical numbers literally is which ones?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2408.45,"end":2411.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Different manuscripts, different traditions."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2411.29,"end":2413.89,"speaker":"Fr Stephen De Young","text":"Because if you look at, well, Greek and Hebrew are radically different."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2413.89,"end":2415.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2415.65,"end":2441.53,"speaker":"Fr Stephen De Young","text":"The numbers are radically different all over the place. And there's a reason for that. They didn't have numerals, so they wrote numbers using letters like which letter of the Alphabet it was and then sort of line them up. And to make it even more confusing, especially in Hebrew, sometimes those letters that are lined up to record a number actually make a word by happenstance."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2441.53,"end":2451.33,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean we're probably most people are familiar with, with Roman numerals. It's actually a very. Roman numerals are actually a much simpler and more precise form of this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2452.21,"end":2483.4,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Because Roman numerals are letters. Yeah, they are Roman letters, but it's at least a standardized system. Whereas Hebrew and Greek will both use every letter of the Alphabet. And so, just as a real, real straightforward example, right, in the New Testament, we've got first, second, and third John. The Greek titles are actually John Alpha, John Beta, John Yama. And when you're just doing that, okay, we go, yeah, ABC, 1, 2, 3. Yeah, we get it, right. Jackson 5, whatever."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2485.4,"end":2486.16,"speaker":"Fr Andrew Stephen Damick","text":"Is that our first?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2486.16,"end":2520.71,"speaker":"Fr Stephen De Young","text":"But when you're recording, like, 853,212 with letters. And so that's why when you go into a Greek translation, right, you get. Right, the numbers all get confused. The other thing you have to remember is that numbers were always rounded off in the ancient world. So, for example, we'll see if Father Andrew knows this. How many men in the Roman legions were commanded by a centurion?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2521.45,"end":2525.33,"speaker":"Fr Andrew Stephen Damick","text":"Well, the word means 100, but I'm sure it's not."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2525.33,"end":2527.09,"speaker":"Fr Stephen De Young","text":"But you could tell this is a trap, right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2527.09,"end":2528.41,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2529.45,"end":2530.41,"speaker":"Fr Stephen De Young","text":"The answer is 90."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2530.81,"end":2531.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2532.01,"end":2545.21,"speaker":"Fr Stephen De Young","text":"So it's about 100. There's a lot, right? There's a lot of rat. There's a lot of just generalization. And this is particularly true with the number 1,000."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2546.42,"end":2546.82,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2546.98,"end":2575.98,"speaker":"Fr Stephen De Young","text":"So there's actually a word for thousand in Kylios where we get kilism from, right? In Greek, it means a thousand. And so we as modern people hear a thousand, and we think 1,001 more than 999, one less than 1,001. But thousand Kelios in Greek, especially when you go back, the earlier you go just means crowd."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2577.18,"end":2577.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2577.62,"end":2579.66,"speaker":"Fr Stephen De Young","text":"And I mean I bunch or pile."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2579.74,"end":2599.02,"speaker":"Fr Andrew Stephen Damick","text":"And it's interesting, like in modern English, because we do have this idea of precision in numbers, but we still want to have words that do this kind of thing. What we do is we make up words that sound like numbers. So, like, oh, yeah, there was a gazillion. You know, how many is a gazillion? It's just a whole lot."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2599.1,"end":2605.11,"speaker":"Fr Stephen De Young","text":"Right. But so that could just refer to that word kilios could just be used to refer to, like, a pile or."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2605.11,"end":2607.31,"speaker":"Fr Andrew Stephen Damick","text":"One sagan, which is billions and billions."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2608.19,"end":2624.99,"speaker":"Fr Stephen De Young","text":"Like, you'll say, you know, so what it will say, the way it'll be translated into English was, in the market, there were 5,000 fish. And you're like, seriously, they had 5,000 fish at this fish market? And what it really just means is five heaps of fish."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2625.38,"end":2626.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2626.42,"end":2668.01,"speaker":"Fr Stephen De Young","text":"And he didn't count all the fish in a heap. And so this is what's going on in those census numbers. That's why they're all round numbers of thousands. It's some number of thousands. And so those thousands are probably the big clan units. The big groups of people, like a clan extend big. A set of extended families that were related to each other in a clan. The tribes are made up of clans. So when you read 20,000, that's really saying there's like 20 clans of people. And that big group of people might have been like 150 or 132 or 187."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2668.25,"end":2671.29,"speaker":"Fr Andrew Stephen Damick","text":"Twenty heaps, actually, in Old English."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2671.29,"end":2674.25,"speaker":"Fr Stephen De Young","text":"Or 500 or 600. Right. We don't know for sure."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2674.25,"end":2680.17,"speaker":"Fr Andrew Stephen Damick","text":"In Old English, heap, which is the origin of our modern word, heap, can refer to just a bunch of people."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2681.35,"end":2682.15,"speaker":"Fr Stephen De Young","text":"Okay, well, there you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2682.79,"end":2693.51,"speaker":"Fr Andrew Stephen Damick","text":"I think. I don't know. I haven't had the chance to look this up, but I think that might even be the original sense of it. It just means a bunch of. You travel around with your heap, which. I love that so much."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2694.55,"end":2705.51,"speaker":"Fr Stephen De Young","text":"Yeah. You don't take those numbers literally. There were not a million people. They would have died. It's not possible. The amount of livestock, the amount of sacrifices that would have been required."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2706.08,"end":2713.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And just the sheer logistical complexity of a moving group that size."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2714.72,"end":2715.16,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2715.16,"end":2724.72,"speaker":"Fr Andrew Stephen Damick","text":"You know, like, there's a reason that large armies moving is just a huge problem in and of itself and causes a lot of destruction and death and disease."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2725.36,"end":2732.56,"speaker":"Fr Stephen De Young","text":"Right. So we know it was more on the 187 side than on the 800 or 900 side."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2732.76,"end":2733,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2733,"end":2758.68,"speaker":"Fr Stephen De Young","text":"In terms of what those thousands mean. So what that gives you. And so the bigger thing is the numbers in this passage and in other passages are never what the text is trying to communicate. The purpose of the text is not to tell you the precise number of people there were in each tribe. If it was, it wouldn't be rounded off to the thousands, would it?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2760.13,"end":2765.25,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it doesn't just so happen to always be perfectly rounded off to the thousands. Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2767.09,"end":2824.96,"speaker":"Fr Stephen De Young","text":"It gives you the relative size of the tribes, which becomes important for various reasons as the story unfolds. The fact that numbers begins and ends with the census. You have a generation that came out of Egypt that gets numbered at the beginning. You have the next generation after they've died off that gets numbered at the end gives you an idea of the respective sizes of those generations. Right. You could compare the numbers bigger, smaller, and that's a key part of what's going on in the book of numbers. And then it's also related to those respective Sizes are then also related to, I mean, directly in the text there, the Torah to the land that's granted to the different tribes in the different places. And then with the Levites, it gets even more particular because the particular Levite clans within the tribe and families within the clans get assigned particular duties vis a vis the tabernacle and later the temple."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2825.68,"end":2836.32,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, for our last question for this half a query that is related to these issues of manuscripts and such. So this is Rachel with a question about the Codex Sinaiticus."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2836.88,"end":2893.54,"speaker":"Audience Member","text":"Hi. My question is about Codex Sinaiticus. Why do we say that German guy Tischendorf discovered in hands and air quotes here, discovered it when it was clearly in possession of St. Catherine's also, like, I mean, it's cool that we have, like, a really old text, but, like, does it really matter? Like, I mean, you can make a critical addition with it, but with the received text is the text that has authority. Right. So, like, I'm in the Greek Orthodox Archdiocese of America, so the text that has authority is the one that we read in that church. So. Yeah, does it really even matter? And then also, just like, a question about language. Like, you know, I know Hebrew is the first language, but the Hebrew text is not the text that we read in the church. It's the whatever version of the Septuagint or the New Testament that we have. So I guess, like, what is the point of learning, like, Hebrew to read that, like, if that text has no authority? I was just curious your thoughts on that. Thanks so much."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2894.34,"end":2911.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, the first bit, I think, is the easiest one about Tischendorf. Yes. Obviously he did not discover it in this. The. The Codex Sinaiticus in the sense of no one knew where it was, but probably. Well, I mean, it is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2911.99,"end":2913.11,"speaker":"Fr Stephen De Young","text":"He kind of did."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2913.19,"end":2919.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it seems like it wasn't really getting a lot of attention there at Saint Cat. No."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2919.91,"end":2925.14,"speaker":"Fr Stephen De Young","text":"So here's the thing. People don't realize how new archeology is, right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2925.3,"end":2928.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Even antiquarianism itself, the idea that old."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2928.86,"end":2945.46,"speaker":"Fr Stephen De Young","text":"Things are a very new thing. So it is true that he found a bunch of leaves of Codex Sinaiticus about to be burned there. Not because there was something wrong with them, because they were leaves that fell out of an old book, an old Bible. And so you dispose of those by burning."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2945.86,"end":2948.58,"speaker":"Fr Andrew Stephen Damick","text":"It's the discovery of the sense of, you guys don't know what you have."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2948.98,"end":2994.44,"speaker":"Fr Stephen De Young","text":"Right. Because the monks, oh, this is a really old Bible that's falling apart. Make a new copy of it and then dispose of that one properly. By burning it. So he discovered it in the sense that he recovered it as an artifact, as an antiquarian artifact, and then gave it as a gift to the czar. By the way, the way that that book got out of Orthodox hands was after the Russian Revolution, the government was broke because the German revolution failed, and so they sold it to the Brits. But yeah, and Codex Sinaiticus, by the way, is entirely in Greek. And it's one of the things. She even kind of made the argument there, which is completely mistaken. And we'll dismantle here in a second."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2994.44,"end":2996.08,"speaker":"Fr Andrew Stephen Damick","text":"But, yes, this is the more important part."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":2998.08,"end":3021.44,"speaker":"Fr Stephen De Young","text":"The argument that all these people are like, oh, Codex AG is it doesn't matter for the New Testament, Texas Receptus or whatever. Right. Whatever they want to say is the official text. It's like, yeah, okay, where do you think we got our text of the Greek Old Testament? Any text of the quote unquote Septuagint that you buy is based on Codex Alexandrinus and Codex Satanicus."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3021.76,"end":3029.91,"speaker":"Fr Andrew Stephen Damick","text":"And there's not, if I recall, there's not much difference between them. Is that right between those two?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3029.91,"end":3031.11,"speaker":"Fr Stephen De Young","text":"No, there's not that much difference."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3031.11,"end":3031.39,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3031.39,"end":3055.51,"speaker":"Fr Stephen De Young","text":"But now Koenigseid Atticus has three correcting hands. I mean, it gets really complicated when you get into the textual criticism part of it, but. And most people, their eyes roll back in their head. A friend of the show, Bart Ehrman, was here with us. He's into that. I mean, that's his thing is text criticism. We could talk about the second correcting hand of Codex Sina Atticus all day, he and I, and bore you all to tears."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3055.51,"end":3058.27,"speaker":"Fr Andrew Stephen Damick","text":"But he's always welcome to come on the show and do that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3058.67,"end":3078.67,"speaker":"Fr Stephen De Young","text":"Yes, he's more New Testament textual criticism, but I sure he'd still be cool to talk about. But anyway, it's all in Greek. We're missing the first part of Genesis, actually. That is part that fell off. Right. The front of the book. So it's important because it's an early Greek textual witness to the Old Testament. Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3079.79,"end":3082,"speaker":"Fr Andrew Stephen Damick","text":"Mid fourth century. For people don't know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3082,"end":3095.32,"speaker":"Fr Stephen De Young","text":"Yeah. AD yeah. And before the Dead Sea Scrolls. That was really early. Right. That was way earlier than the Hebrew text we had before the Dead Sea Scrolls."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3096.28,"end":3106.92,"speaker":"Fr Andrew Stephen Damick","text":"Tischendorf finds the old testament in 1844, which might seem like a long time ago, but it's pretty recent in terms of the modern world."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3107.27,"end":3118.87,"speaker":"Fr Stephen De Young","text":"The Orthodox Church. Yeah. It is true that the biblical text that has authority is the one that they read in your church. That for most of Our listeners would be an English text."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3119.67,"end":3120.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3123.75,"end":3170.15,"speaker":"Fr Stephen De Young","text":"Not to put too fine a point on it, but even if you're in a Greek church that's doing the scripture readings in Greek, the original Greek, they're not reading from the Texas Receptus. The Texas Receptus is, is a second generation text after Erasmus'. Erasmus of Rotterdam. See, this is Western Europe. Western Europe in the 16th century. TR actually comes out of Stephanus's later. But anyway, that's a compiled Western Greek text. And most of the Book of Revelation in that text is back translated into Greek from the Latin version."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3170.15,"end":3170.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3170.63,"end":3173.83,"speaker":"Fr Stephen De Young","text":"Because Erasmus didn't have any Greek manuscripts of most of Revelation."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3173.91,"end":3175.43,"speaker":"Fr Andrew Stephen Damick","text":"That's not how it was recepted."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3176.31,"end":3176.79,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3177.35,"end":3178.23,"speaker":"Fr Andrew Stephen Damick","text":"By anybody."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3179.99,"end":3196.06,"speaker":"Fr Stephen De Young","text":"And it has things. That's why it has things in it. Like the Kama Johannium, the, The reference to the Trinity in First John, which, if you think that's authoritative for Orthodoxy, I urge you to get the patriarchal Greek New Testament text and read the footnote."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3196.06,"end":3201.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not that we don't believe the content of that you believe in the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3201.06,"end":3202.38,"speaker":"Fr Stephen De Young","text":"Trinity, but it's just."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3202.46,"end":3203.58,"speaker":"Fr Andrew Stephen Damick","text":"That's just not in the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3203.74,"end":3210.38,"speaker":"Fr Stephen De Young","text":"Don't you think a church father would have quoted that at some point in the 4th century if that was in First John?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3210.46,"end":3211.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3213.2,"end":3252.18,"speaker":"Fr Stephen De Young","text":"None of them do anyway. So that's. But yeah, in fact. In fact, the patriarchal Greek text, which is the text you would be reading in your Greek Orthodox Church if they were reading it in Greek. The patriarchal Greek text has 0 manuscripts in common with the Textus Receptus. None. The patriarchal Greek text was compiled in 1904, and then they did a new edition in 1912. The 1912 edition is really what. Because they made a bunch of corrections, is based on 250 lectionary manuscripts."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3252.66,"end":3257.54,"speaker":"Fr Andrew Stephen Damick","text":"And when we say manuscript, we should remember, by the way, that that means handwritten document."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3257.62,"end":3269.47,"speaker":"Fr Stephen De Young","text":"Yes, handwritten. Because at the beginning of the 20th century, the churches in Greece, the vast majority of them, were still using handwritten gospel books and epistle books."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3270.43,"end":3271.15,"speaker":"Fr Andrew Stephen Damick","text":"300 years."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3271.31,"end":3273.55,"speaker":"Fr Stephen De Young","text":"Because the Turks wouldn't let them operate a printing press."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3273.55,"end":3276.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As I say, 300 years after the introduction of the printing press into Europe."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3276.99,"end":3335.72,"speaker":"Fr Stephen De Young","text":"Yes. Okay, so these are from handwritten man. 250 of them. That's why you need 250 of them. Because any handwritten text, you're going to have errors and typos and things that are illegible because they got smudged. 250 of them handwritten were brought together. The ones actually being used in Greek churches in Greece at that time. And they compiled this critical edition, the patriarchal text from that Texas Receptus was compiled hundreds of years earlier from a much smaller and completely different set of manuscripts by a Dutchman in Western Europe and printed. There is no connection between the two, unfortunately. One of the several unfortunate things that has happened in the United States based on a lot of evangelicals joining the Orthodox Church, is that some of them have brought some of their weird King James only arguments with them into the church. And this is one of them."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3337.16,"end":3337.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3338.68,"end":3378.58,"speaker":"Fr Stephen De Young","text":"So Codex Sinaiticus is a Bible that was used at St Catherine's Monastery on Mount Sinai, meaning it was the authoritative text at St Catherine's Monastery on Mt Sinai. It is an Orthodox Bible. All of these manuscripts that Bart Ehrman writes about when he talks about text criticism of the New Testament, those are Orthodox Bibles. They're all Orthodox Bibles from different places in different times in the Orthodox Church. So they are all part of our."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3378.58,"end":3379.82,"speaker":"Fr Andrew Stephen Damick","text":"Tradition, even with their."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3379.98,"end":3405.02,"speaker":"Fr Stephen De Young","text":"There is no single authoritative text of the Old or New Testaments in the Orthodox Church. We don't even all have the same books of the Old Testament. And as I've said many times, the Septuagint as a collection of specific books in Greek and a particular Greek text does not exist. That is not a thing that exists."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3407.42,"end":3409.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and if it did, Codex."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3409.62,"end":3410.7,"speaker":"Fr Stephen De Young","text":"Sinaiticus would be it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3411.02,"end":3412.14,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3412.14,"end":3412.74,"speaker":"Fr Stephen De Young","text":"By the way."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3412.74,"end":3464.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, and it's interesting that people talk about the Septuagint in those terms, but like pick up any good translation of it. And by that I'm referring to like, you know, a scholarly translation or one that has some academic apparatus in it. Right. And read the introduction and just see what it says about the manuscript basis for what they're doing. It's not like they picked up this single book from somewhere that was handed down from on high and sat and translated that book. It is a compilation of lots of different things and not just different books, but different parts of books being kind of merged together. Because like, okay, we think this manuscript has this part. Correct. And this or better or whatever, that's the way that a Bible is. That's how Bibles work printed here in the 21st century. And it's frankly the way that they worked when they were all just being hand copied."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3464.53,"end":3468.77,"speaker":"Fr Stephen De Young","text":"Yeah. If you were hand copying and you're looking at the original and you can't tell what it says, what do you do?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3469.17,"end":3471.09,"speaker":"Fr Andrew Stephen Damick","text":"You look at something else. If you got it or it looks."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3471.09,"end":3474.53,"speaker":"Fr Stephen De Young","text":"Weird to you and you Think there's an error, you go and find another copy and you compare."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3474.77,"end":3476.09,"speaker":"Fr Andrew Stephen Damick","text":"Or if you don't have something else."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3476.09,"end":3477.73,"speaker":"Fr Stephen De Young","text":"Guess what you just did. Text criticism."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3477.73,"end":3484.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you don't have something else, you might say, oh, this seems wrong. I'm going to fix the spelling here. You know, that's. That's totally."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3484.94,"end":3486.66,"speaker":"Fr Stephen De Young","text":"You've made a conjectural emendation."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3486.66,"end":3487.38,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3488.82,"end":3573.8,"speaker":"Fr Stephen De Young","text":"Now, in terms of Hebrew, why learn Hebrew? Since I'm not afraid of ticking off the Greeks, The Greek Old Testament. Neither the Greek Old Testament nor the New Testament are written in Greek. Koine or Kini Greek does not exist. It is not a thing. We'll get back to that in a second. The Old Testament in Greek is a translation. It is a translation from another language. As a translation from another language, if you don't know the language it's translated from, if you can't read the original, it's not that the Greek translation is meaningless. It's a good translation. And we believe that some of the choices that were made and how it was translated even reflect important insights and important spiritual wisdom. But you can't fully understand it because, for example, there are grammatical structures in quote unquote, the Septuagint that are not Greek grammatical structures that you won't understand unless you understand the Hebrew that it was translated from. And you won't know where choices were made and what those choices were and understand their significance if you don't know anything about the original. And also the original is the original."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3575.56,"end":3577.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and this is not something."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3577.72,"end":3583.68,"speaker":"Fr Stephen De Young","text":"That the Orthodox Church doesn't acknowledge. The Russian Synodal Bible, the Old Testament is translated from the Masoretic text."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3583.68,"end":3586.6,"speaker":"Fr Andrew Stephen Damick","text":"That's right. For all of you anti MT people out there."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3587.65,"end":3589.73,"speaker":"Fr Stephen De Young","text":"So there's a lot of ridiculous urban legends."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3589.81,"end":3599.65,"speaker":"Fr Andrew Stephen Damick","text":"I think it should be underlined also that, like, that doesn't make it some kind of secret code that unless you know all these languages, you can't possibly receive any benefit from the scripture."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3600.05,"end":3601.57,"speaker":"Fr Stephen De Young","text":"No. You're hearing it in English."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3601.73,"end":3602.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3602.05,"end":3603.41,"speaker":"Fr Stephen De Young","text":"You can understand it in English."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3603.65,"end":3605.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3607.01,"end":3617.81,"speaker":"Fr Stephen De Young","text":"But that's different than saying that we do this weird thing where now, again, this King James only thing, where now the English is more authoritative than the original somehow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3618.07,"end":3624.03,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it would be so nice if that were true. But just out of my sense of English chauvinism."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3624.03,"end":3718.38,"speaker":"Fr Stephen De Young","text":"But so in terms of Koine or Kini Greek not existing, I continued to throw out the challenge I've always thrown out about this. Name one other text written in that Greek, the Apostolic Fathers. Aren't written in that kind of Greek. They're written in actual Greek. Philo wrote in actual Greek. There is nothing except the New Testament that's in that version of Greek. It's not the common Greek spoken by the people. It's the Greek spoken by a very particular set of people, people who had Hebrew and Aramaic as their first language. So the Greek of the New Testament is to actual Greek, the actual Greek language at the time, as Yiddish is to German, it is a Jewish dialect of Greek used by Jewish Greek speakers. And so it is full of what are called Hebraisms. It's full of grammatical structures and turns of phrase and things that mean nothing in Greek. If you don't understand the Hebrew, you will misunderstand them. Part of how you get Protestantism, a big part of how you get, like Luther's reading of St. Paul is translating terms that St. Paul uses or that the New Testament in general uses according to their pagan Greek meanings, ideas like propitiation and sacrifice and those kind of things rather than their Old Testament meanings."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3720.7,"end":3721.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3721.18,"end":3729.6,"speaker":"Fr Stephen De Young","text":"In the original Jewish and Hebrew context. So you want to get Protestantism because that's how you get Protestantism. All right, well, prepper Teddy gets real Greek."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3729.84,"end":3737.04,"speaker":"Fr Andrew Stephen Damick","text":"On that note, we will wrap up this half and we'll take our first break and we'll be right back on this all pre recorded Q and A episode."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3737.12,"end":3743.76,"speaker":"Audience Member","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment on the next part of the Lord of Spirits."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3757.44,"end":3784.73,"speaker":"Fr Stephen De Young","text":"For centuries, Byzantine music has sustained Orthodox worship around the world. Now the St. John Cucuzelis Institute of Liturgical Arts offers online classes in notation, theory and practice and free classes in liturgics with a faculty led by John Michael Boyer, author of the acclaimed book Byzantine the Received Tradition. Registration is open now for classes in September at Kuku. That's K O U K O u Z e L I S.net."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3787.77,"end":3793.37,"speaker":"Audience Member","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3794.89,"end":3821.39,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. So we just spent, I don't know, more than an hour of your life answering various questions, a number of them related to our episodes on authority that we did earlier this year. And now we have a cornucopia of different kinds of questions. So our first one comes from Clint, who has a question about the fall of angels. And also wonder is one of those perennial questions that all of us have. Who is Moloch?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3822.99,"end":3823.99,"speaker":"Audience Member","text":"Hello, fathers."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3823.99,"end":3824.35,"speaker":"Fr Stephen De Young","text":"Bless."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3824.59,"end":3829.63,"speaker":"Audience Member","text":"My name is Clint and I have a question about the 5ish Falls episode."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3830.35,"end":3831.67,"speaker":"Fr Stephen De Young","text":"And my question was kind of like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3831.67,"end":3864.41,"speaker":"Audience Member","text":"A where are they now and who's left? Kind of deal. And so I looked on the Facebook group chat first for the answer. But then while I was looking for the answer on the Facebook page, I saw that people were saying that the angels all fell at the same time, but that we experienced it at different times. So I was wondering if you guys could clarify that. And then lastly, unrelatedly, my question is, who is Moloch?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3864.73,"end":3866.25,"speaker":"Fr Andrew Stephen Damick","text":"Why does he think that's unrelated?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3869.29,"end":3870.01,"speaker":"Fr Stephen De Young","text":"It's all related."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3870.09,"end":3872.81,"speaker":"Fr Andrew Stephen Damick","text":"It's all related. Everything is one man. That's like heroin."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3872.81,"end":3874.33,"speaker":"Fr Stephen De Young","text":"Get out the corkboard and the pins."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3874.41,"end":3874.97,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3875.37,"end":3876.33,"speaker":"Fr Stephen De Young","text":"It's all connected."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3876.97,"end":3941.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think we've addressed this a number of times in the past. But just to reiterate, time works for angels differently than it does for us or the thing that we call time, which I know you're going to say is just a complete illusion, Father. Along with space, they don't have that. They have something else that they call time. And, you know, obligatory plug for George Manserides book, Time and man, which kind of goes into all this stuff, the way that it works out in the church Fathers. But I think that Clint, basically, you have it roughly correct that from one point of view, you could say that the angelic fall kind of happens all simultaneously. But then from a human point of view, in history, there's various points at which there are falls. But I think it's important to reiterate that by fall, we don't mean turned to evil, but rather being thrown out of heaven. Like, we mean it a little bit more literally than just a sense of going bad. Because the fall of Adam and Eve is a fall down the mountain, so to speak."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3941.6,"end":3942.68,"speaker":"Fr Stephen De Young","text":"Expulsion from paradise."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3942.68,"end":3958.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's expulsion from paradise. It's not where they sinned, it's where they're thrown out. Or the fall of the devil. Right. He's clearly, if you can think it in terms of linear time, he's turned to evil at some point, and then after that point, he's thrown out of heaven."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3959.82,"end":3963.86,"speaker":"Fr Stephen De Young","text":"If there are indeed points of time like that for the devil in his."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3963.86,"end":3972.14,"speaker":"Fr Andrew Stephen Damick","text":"Own experience, it's a point of view problem. Humans, we have a certain point of view in this life, and that's what we've got occasionally."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3972.14,"end":3975.1,"speaker":"Fr Stephen De Young","text":"Time is not a thing that has material existence."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3976.14,"end":3976.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3977.18,"end":3981.58,"speaker":"Fr Stephen De Young","text":"It is not absolute. It is an element of human experience."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3981.9,"end":3985.98,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Moloch, this is the. The child sacrifice God."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3985.98,"end":3986.38,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3988.22,"end":3996.7,"speaker":"Fr Stephen De Young","text":"Yeah. I'm assuming. I mean, he Might have been making a howl reference. I don't know. But I'm assuming he means the one in the Bible. Yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":3996.95,"end":4015.15,"speaker":"Fr Andrew Stephen Damick","text":"And I've seen. I mean, maybe you could, maybe you could flesh this out if you know something about it. I'm sure you probably do. I've seen people say that. Some scholars will say that this was not a real deity that was actually being worshiped, but it's just a term that shows up in the Bible or maybe a conflation with some other deity. I don't know. I don't have my dictionary of deities."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4015.15,"end":4029.61,"speaker":"Fr Stephen De Young","text":"And the reason, the reason they do that is that Molec is essentially a participle of based on word melek."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4030.25,"end":4030.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4030.57,"end":4031.45,"speaker":"Fr Stephen De Young","text":"Which is king."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4031.45,"end":4031.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4032.33,"end":4084.21,"speaker":"Fr Stephen De Young","text":"And so Molech would be like he who rules or he who exercises kingship. Right. And so that could be a generic term. Right. Just like El and BAAL or baal. Right. Could be generic terms that mean God or lord, but they also, in Canaanite stories refer to particular beings. And so molech, the same thing. Yes. It could just be ruler or rulers. In fact, we were just talking about the Greek translation of the Old Testament. There's a couple places where they translate it instead of transliterating it. It says, don't offer your children to the rulers in the Greek. So there's a place where if you don't know the Hebrew, you won't know what's going on. Right. Like what does that mean? Offer to the rulers. What? Yeah, like for military service. What are they talking about?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4084.93,"end":4085.97,"speaker":"Fr Andrew Stephen Damick","text":"No, janissaries."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4086.93,"end":4165.84,"speaker":"Fr Stephen De Young","text":"So yes, this is referring to a particular Canaanite deity, but in general, again, it's not used in the sense that, like when there are commandments not to sacrifice your children to Molech, that doesn't mean, like it's okay to sacrifice your children to other pagan gods. Right, right. That means any of them, like it's a broader paste. Right. All those who work with dairy products. It's across the board. And so beyond just a particular Canaanite deity, there's for. In Phoenician practice, for example, we know, and we actually do know this despite modern apologists and sorry, Lebanese folks who want to see yourselves as Phoenicians, they sacrificed a lot of their children to pay to demons. Okay, yeah. This was a common practice. And the, the, frankly, the Bible is usually talking more about, is more concerned with condemning the practice than it is about describing any particular deity, Canaanite or Cydonian or whatever, to which the children were being sacrificed. It's more concerned with Stopping the child sacrifices."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4166.08,"end":4198.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, as we've said a number of times in the podcast, it's interesting to try to work out the identities and details of all these demonic cults, but the main purpose in scriptures is to say, do this, don't do this, not, oh, here's a dictionary of deities and demons in the Old Testament, as useful as that can be. So. All right, so our next question comes from David, who is asking whether a particular kind of Hindu ritual might be a Nephilim ritual."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4201.24,"end":4254.91,"speaker":"Audience Member","text":"Hello, Fathers, this is David calling from Huntsville, Alabama. I'm a local Orthodox Christian here attending St. Michael the Archangel Serbian Orthodox Parish. Love the program. Thank you guys so much for what you do. Just had a question about the Hindu ritual of Maithuna M a I T H in which a Hindu couple will call upon Shakti and Shiva, asking that they might be embodiments of those two deities. And I was wondering if this is a continuation of the Nephilim ritual and if not, what it is considered and why it wouldn't be considered a continuation of that. And if it is a continuation of that, what we are supposed to do about it? Just pray. Do we, you know, raise awareness with our fellow Christians or, you know, how do we approach something like this that's."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4254.91,"end":4256.39,"speaker":"Fr Stephen De Young","text":"Still going on in our world?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4257.51,"end":4259.19,"speaker":"Audience Member","text":"Again, thank you for everything you do."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4259.43,"end":4266.87,"speaker":"Fr Andrew Stephen Damick","text":"And yeah, so had you heard of this one before, Father? My thuna."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4267.03,"end":4268.63,"speaker":"Fr Stephen De Young","text":"Yeah, variations. Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4268.63,"end":4288.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I had heard of it, but I'd never really looked it up. And there are some significant differences. Number one, one thing that David does not mention, that this is part of, as I think it would be pronounced Tantra or Tantra as you know, English speakers would usually say. So parental advisory."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4288.65,"end":4300.43,"speaker":"Fr Stephen De Young","text":"This is Hinduism is a, is a broad category. Hinduism just means the, the religion of the Indian people. Yes, broad swath of practices, huge number."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4300.43,"end":4302.35,"speaker":"Fr Andrew Stephen Damick","text":"Of different religious traditions, all in that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4302.35,"end":4304.11,"speaker":"Fr Stephen De Young","text":"Region under that category."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4304.59,"end":4310.15,"speaker":"Fr Andrew Stephen Damick","text":"So this particular one, I mean, you can look this up. Kids. No, not kids. Don't. Adults. Adults."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4310.15,"end":4311.23,"speaker":"Fr Stephen De Young","text":"You can look this up. Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4312.19,"end":4367.81,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, there was the general. How I refer to our research as kids. I don't know. I know what's wrong with me. You can look this. It's. So it is a sexual ritual and yes, there is calling upon of Hindu deities, but it, it does not seem to have the purpose of conceiving a child. And the reason I say that is at least in the, based on the summary that I have read, being a non specialist in this field, very much a non specialist, that in the summary it notes that one of the goals of this theoretical kind of spiritual enlightenment that they're engaging in. One of the. I shouldn't say one of the goals, but one of the means is that that which the man contributes to conception not be delivered. We'll just say that that is part of what's going on. So. So, yes, it's not for."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4367.81,"end":4369.93,"speaker":"Fr Stephen De Young","text":"Everybody knows that part of tantric yoga, don't they?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4369.93,"end":4371.53,"speaker":"Fr Andrew Stephen Damick","text":"I hope not. I don't know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4371.53,"end":4375.13,"speaker":"Fr Stephen De Young","text":"Have you never read an article about Sting anyway?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4375.37,"end":4378.17,"speaker":"Fr Andrew Stephen Damick","text":"I don't think I've ever read any articles about Sting."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4378.17,"end":4380.65,"speaker":"Fr Stephen De Young","text":"Now that I have. You never seen the movie Go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4381.8,"end":4383.08,"speaker":"Fr Andrew Stephen Damick","text":"I have not seen the movie."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4383.08,"end":4384.48,"speaker":"Fr Stephen De Young","text":"Doug Liman movie. Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4384.48,"end":4384.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4385.48,"end":4386.52,"speaker":"Fr Stephen De Young","text":"That explains a lot."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4387.56,"end":4403.16,"speaker":"Fr Andrew Stephen Damick","text":"Says so much about me, doesn't it? So, yeah. And then, you know, the question he asked, like, well, what are we supposed to do about it? I mean, obviously, if you have neighbors that are not converting, don't do that to Christ, you know, try to convert them, you know. But yeah, don't do this. Right. That's the main thing."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4403.72,"end":4406.28,"speaker":"Fr Stephen De Young","text":"Yoga in general, not great. Tantric yoga."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4407.93,"end":4409.29,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4410.09,"end":4441.44,"speaker":"Fr Stephen De Young","text":"But, yeah, this. And so just more broadly, Hinduism is basically ancient paganism. That's one of the interesting things about it is, like we said, it's a variety of things, but it's basically the variety of things you get in ancient paganism. So you get like the Brahman stuff, which is the more refined version, more like, you know, Plato's paganism. And then you get everything down to just sort of straight out idol worship and everything in between. Right. Like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4441.52,"end":4444.72,"speaker":"Fr Andrew Stephen Damick","text":"And not every sex ritual is a Nephilim ritual."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4444.72,"end":4466.89,"speaker":"Fr Stephen De Young","text":"Yes, there are plenty of sexual rituals and sexual immorality in those rituals of all kinds going on in the ancient world. Right. They weren't all related, really, to be. When we're talking about the Nephilim thing, there's a couple of elements that are important. Number one is conceiving a child. But even more important than that, to even be in the category, you've got to have a king or a ruler involved."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4467.21,"end":4477.37,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right, this next one, I don't know, actually. I don't know what you're going to say about this. So I'm wondering if you're going to drive away all of our homeschooling listeners, so we'll just see what happens."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4478.17,"end":4478.81,"speaker":"Fr Stephen De Young","text":"Why not?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4478.81,"end":4491.35,"speaker":"Fr Andrew Stephen Damick","text":"Why not? So this is from John, and he had a question about a comment that you made, Father, about Western civilization not being a thing. So what does that have to do then with classical education?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4492.71,"end":4508.87,"speaker":"Fr Stephen De Young","text":"This is reader John in mid North Indiana in your time. See what's Become of Me episode. In early August 2024, Father Stephen fairly zestfully tore into the idea, which we all are in varying degrees taught in."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4508.87,"end":4512.15,"speaker":"Audience Member","text":"School, that there exists such a thing."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4512.15,"end":4531.06,"speaker":"Fr Stephen De Young","text":"As Western civilization with a march of progress from Sumer to present. I appreciated that. But it certainly leaves me with a question. What then are we to make of Christian classical education, which draws on those Greek and pagan sources as part of."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4531.06,"end":4533.02,"speaker":"Audience Member","text":"Our history, our culture?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4533.82,"end":4539.02,"speaker":"Fr Stephen De Young","text":"What should an orthodox day school look like if not like classical education?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4540.15,"end":4545.39,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I have a comment about that before you drop a huge portion of our listenership."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4545.39,"end":4549.43,"speaker":"Fr Stephen De Young","text":"Yes, before I run everyone off. Yeah, I'll actually hear what you have to say."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4549.43,"end":4575.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go. Actually, I will say, I don't know if I've referenced this on the show before or not. Maybe. Probably. We've been doing this. This is hundreds of hours of this now. So I do not remember. It actually always kind of cracks me up just a little bit in an endearing way when someone says, could you tell me if you guys have ever said anything about this on your show? And I'm like, I don't know. It's like 350 some hours of stuff. I don't remember everything that we've said."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4575.38,"end":4580.66,"speaker":"Fr Stephen De Young","text":"Anyway, correct answer is yes, yes, probably. And then just leave it there."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4580.82,"end":4581.54,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4582.02,"end":4583.38,"speaker":"Fr Stephen De Young","text":"Would you care to expand on that?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4583.38,"end":4717.09,"speaker":"Fr Andrew Stephen Damick","text":"No, but I am a big fan of St. Basil the Great's text, which is often given the title An Address to Young Men on the Right Use of Greek Literature. As far as I know, he did not give it that title, but it is what is happening in that text. You can look this up on the Internet and read it for yourself. And what he says in that text is that it is valuable to read the texts of. You know, because this is his cultural context. Right. It is valuable to read the texts of Greek paganism, whether it's the stories or the philosophical texts or whatever. But he also says you should not do so indiscriminately. Don't just accept everything that's in there. And, you know, now he'll say, for instance, you know, when you read this, be deaf to that. And by that he does not mean don't read it, because obviously you wouldn't even know that those portions are in there if you weren't reading it. But rather, he means, if you. If you read something bad in one of these texts, something that is not in alignment with the commandments of God, then don't obey that. Don't take it into yourself as the way that you know something that should form who you are. And he says, if you see something virtuous, then that's good. And he demonstrates how to do this from this text itself that he wrote because it is full, full, full, full of classical references and there's a few translations that you can find on the Internet that actually annotate all the text he references in this. So this is a guy who clearly knew these things really, really, really well. So that means we have a very good, strong patristic witness to the idea of don't be a puritan about these things. Don't just say, oh, it's all just, you know, that's from those pagans and, you know, just burn it. Burn it with fire. But rather take what's good and leave what's bad. This is the original be the bee. In fact, he uses the image of the bee, you know, the bee who gathers what it needs from the flowers and takes that back to the hive and leaves behind whatever it does not need. And I mean, the subsequent question of what should a. What should an orthodox Christian day school look like? I mean, it should look like the way that the people putting it together, what seems best to them. I'm a fan of do what is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4717.09,"end":4721.69,"speaker":"Fr Stephen De Young","text":"Right in your own eyes, people. That's Father Andrew's message for you today."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4722.09,"end":4765.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, the thing is, I'm a fan of various things that are called classical education. But the truth is, if you actually look into this with the professionals who are working on this kind of stuff, they will tell you that there are multiple different models that are all going by this name. So how that works out locally is going to largely depend on what your local teachers are capable of doing and what the parents would kind of like to happen. But the point is that it should be Orthodox and it should be teaching orthodox Christianity. Certainly, I think, based on what you said, Father, I don't think that it should be about the glories of ancient Rome. To me, it's the mixed bag that is ancient Rome. That seems to be St. Basil's approach to it. So that's my opinion. What's yours?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4766.37,"end":4776.53,"speaker":"Fr Stephen De Young","text":"So you're being very egalitarian in your presuppositions. Yes. Because St. Basil the Great stay education was not universal."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4776.85,"end":4778.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4779.01,"end":4831.86,"speaker":"Fr Stephen De Young","text":"So part of what we have to ask in terms of interpreting what he says in that text is, who's he talking to? Who was it, who was being educated and for what purpose? And the reason I bring that up is really. That's the guiding question. If you're talking about educating your own children or the children of your community, to what end? And I think in the classical education model, there is this idea which I think at one point was actually really well lampooned, but which most people don't take to this extreme. Back in the early 90s, there was a really popular book by a conservative political guy that was basically like, you know, the reason we have all these problems with crime and juvenile delinquency is people don't read the classics anymore."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4831.86,"end":4833.66,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is this maybe Bill Bennett?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4834.06,"end":4835.02,"speaker":"Fr Stephen De Young","text":"Yeah, Bill Bennett."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4835.02,"end":4835.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4836.3,"end":4845.28,"speaker":"Fr Stephen De Young","text":"And that was sort of lampooned, right? Like, you know. Yes. If we could just get everybody slinging crack to read Aristophanes the Clouds, like all our problems would be."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4845.28,"end":4845.38,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4847.61,"end":4858.61,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I, I remember, I remember, you know, when I was an undergrad, I recall, like, some of this discussion happened because I was reading a lot of, of course, English Renaissance literature. So what is classical education?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4858.61,"end":4859.33,"speaker":"Fr Stephen De Young","text":"As what does."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4859.33,"end":4888.08,"speaker":"Fr Andrew Stephen Damick","text":"As one does. I still occasionally do. And so this question comes up, of course, you know, because Renaissance English writers are all very concerned about, you know, the classical literature. Right. But I remember the professor at one point saying, you know, there was this idea, especially in the 19th century, that education, if we have universal education and all these things, that that will bring virtue and world peace and all this kind of stuff. Right. And he pointed out, he said a."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4888.08,"end":4889.6,"speaker":"Fr Stephen De Young","text":"Lot of enlightenment sensibilities."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4889.76,"end":4924.26,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, exactly. And he pointed out, he said, people still talk this way, but the world doesn't really believe it anymore. And the point in history that he gave was, and I'm sure you could probably put it to World War I maybe, but he gave a point in World War II, he said, just because you have a lot of education and a lot of, you know, know how and so forth does not mean you're going to be virtuous. And how do we know that? Because how do you exterminate at 6 million Jews? Well, that's an engineering problem. It's an engineering problem."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4926.11,"end":4928.59,"speaker":"Fr Stephen De Young","text":"Now we're going to get all the weirdos commenting on."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4929.07,"end":4929.71,"speaker":"Fr Andrew Stephen Damick","text":"Let them."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4930.19,"end":4930.91,"speaker":"Audience Member","text":"Recording."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4930.91,"end":4937.23,"speaker":"Fr Andrew Stephen Damick","text":"Let them. I know, let them. Yeah. I mean, this is what we. This is technomancy, Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4937.23,"end":4947.87,"speaker":"Fr Stephen De Young","text":"Yeah. The American education system, back when it was just through high school, when we first started doing universal education in the US Was prepare, basically to prepare people to work office jobs."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4948.75,"end":4951.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or factory jobs, frankly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":4951.43,"end":5012.89,"speaker":"Fr Stephen De Young","text":"There was a baseline. There was a baseline amount of information you needed to do that effectively. You needed a little math you needed a little, you know, you need to be able to communicate effectively to a certain degree. But mostly you needed to be taught to show up at a certain time, to sit behind a desk, to take scheduled breaks. We add in homework because that'll make people more open to like taking a little work home with them or maybe staying a little late until their work is done, even if it's outside of the regular hours. When college became more ubiquitous, when getting a college degree wasn't a rare thing, and we started making the shift to a college degree being what a high school diploma used to be, then, well, what is college? All of college is here. Read all this material and summarize it for me in a report. Because that's what the jobs everyone was going to do required them to do. Take information, summarize it in a report for their boss or supervisor or fellow employees. Now we invented AI, so all those jobs are going to go away and everyone's panicking."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5012.97,"end":5030.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I have to say, by the way, I saw this, this graph recently where someone saw there was this massive drop in, I think it was chat GPT usage, like in early June. And someone's like, what happened to chat GPT? And someone commented, all of the cheaters went on vacation from school."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5031.45,"end":5035.45,"speaker":"Fr Stephen De Young","text":"Yeah, it's not even cheating anymore."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5035.77,"end":5036.17,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5036.57,"end":5220.52,"speaker":"Fr Stephen De Young","text":"In the sense that what's the point? What's the point of teaching a kid how to do that if we have a tool that could do it much more quickly and efficiently and for free? Yeah, those jobs aren't going to exist. And everyone's panicking because when they automated all the blue collar jobs, nobody cared. But now that they're automating the white collar jobs now people are worried. But so that then raises the question, what even is the point anymore? That's what I mean by what is the purpose? What are you educating them to do? That's why I think, frankly paraphrase St. Paul, I have no word from the Lord on this. The Orthodox Church in her history has existed in societies with wildly diverse systems of education, right. In terms of how many and who got educated and how and in what. So I don't think there's a cookie cutter orthodox answer to this either. But to me, I think the new approaches that are basically like, okay, this kid wants to get into science, what does he need to learn and know and know how to do in order to go into that field? Or they want to be a lawyer, or they want to be a truck driver, or they want to be a farmer, whatever they want to Be education needs to be tailored to giving them the skills they need to be able to function and live their life in a society. And this basic idea goes all the way back to Plato. I'm going to actually say something nice about Plato. In the Republic, the purpose of education is to create good citizens for the society. And so every society structures its education in order to construct such citizens. And that's even true in terms of lack of education. When you have a society that's structured in such a way that it needs a broad, uneducated class to do certain types of menial work, they will deny education to those people. But so going forward, I think education really needs to be in terms of the life of the person involved, because frankly, we don't know 50 years from now what a job is even going to look like. The current wage labor system, the way we have it already has broken down. And I don't think we'll still exist 50 years from now because it can't. The way it's already collapsing, I don't think that's functional. And so trying to guess at what a kid born today is going to need to know to get a job that's not going to work other than just having a whole life's pursuit. Right. Science, the law, whatever it is they want to do, and then educating that and following their own bent. Like if they're bent the way Father Andrew is bent, they could study English Renaissance literature. Father Andrew doesn't need to spend a lot of time studying particle physics."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5220.76,"end":5222.52,"speaker":"Fr Andrew Stephen Damick","text":"I think I've spent zero time."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5223,"end":5234.05,"speaker":"Fr Stephen De Young","text":"Yes. But somebody else who's fascinated by particle physics or astrophysics or some other science, chemistry or whatever, they don't have a lot of need to read English Renaissance literature."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5234.29,"end":5236.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Are you sure about that?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5237.81,"end":5262.42,"speaker":"Fr Stephen De Young","text":"Right. If the desire strikes them at some point, hey, I'm a firm believer in public libraries. And so, yeah, I think education needs to be structured more. And things are in certain circles at least, are moving this way, need to be structured more around the student and their personal goals and things. And not trying to divine some here is what an educated person looks like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5262.58,"end":5290.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I think with the collapse that's going on of higher education that lots and lots of a la carte approaches to this are just taking its place because people still want to learn. So lots of online degrees, lots of very particular kinds of things that people are doing. So, yeah, I mean, I would say, John, if you're putting together a school, work out what works best for the people who are doing it, you know, the demand and the students. Yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5290.65,"end":5292.37,"speaker":"Fr Stephen De Young","text":"And the group of students. You have not."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5292.37,"end":5305.09,"speaker":"Fr Andrew Stephen Damick","text":"Not every school needs to be for every student. That's okay. It's okay. All right. This half actually will be the tale of Two Zacks. So this is our first of the two Zacks. And this Zach has a question about the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5305.09,"end":5307.13,"speaker":"Fr Stephen De Young","text":"Zach. And there we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5307.45,"end":5313.81,"speaker":"Fr Andrew Stephen Damick","text":"A question about the Passover and the Eucharist and Christ's body and blood and kind of all mixed together. So here we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5315,"end":5399.88,"speaker":"Audience Member","text":"Hello, podfathers, this is Zach from Joplin, Missouri, and I'm calling in with a question about the Eucharist and its relationship to the Passover meal. In Father Stephen's newest book, St. Paul the Pharisee, as well as in Religion of the Apostles, he notes that the Eucharist was generally patterned after the thank offering, as it's one of the few sacrifices that can be practiced outside the temple. He also notes that the first Christian Jews practiced all the same rituals as before, going to the temple, sacrificing and participating in the feasts, but with new meaning in light of the Messiah having come. For instance, the Passover was still celebrated by Christians, but it now referred to Christ's body and blood. My question is, if Christ's body and blood fulfills the meaning of the Passover, which is the defining ritual that made one an Israelite, and if it was instituted by Christ at the Passover, how is it that early Christians so quickly jumped to celebrating this same meal regularly, but as a thank offering even outside the Passover feast time? It wouldn't make sense for Christians to begin celebrating the Passover weekly. And that's not even what they claimed they were doing. However, they did claim that the Eucharist was also the body of blood of Christ, just as the Passover meal was. If they're not celebrating Passover weekly, on what basis did the early Christians begin to take this distinctly Passover related meal and begin offering it up as a thank offering? Any help on this point would be appreciated. Thanks so much. Looking forward to hopefully getting an answer."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5400.36,"end":5407.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, this is firmly, completely within your bailiwick. I'm not even sure how to. How to suss this one out, actually."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5408.2,"end":5411.56,"speaker":"Fr Stephen De Young","text":"So, yeah, so they were celebrating Passover weekly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5412.28,"end":5413,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5413.88,"end":5416.44,"speaker":"Fr Stephen De Young","text":"We have a weekly cycle in the Orthodox Church, right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5416.52,"end":5418.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, every Sunday is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5418.62,"end":5420.14,"speaker":"Fr Stephen De Young","text":"Is possible resurrection."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5420.14,"end":5420.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5421.1,"end":5578.22,"speaker":"Fr Stephen De Young","text":"And so, yeah, so there's contained. There's sort of the assumption that they were doing that, but no, that's exactly what they were doing. They were commaring Christ's resurrection and so then the other piece of the question is sort of implying that that would have been an innovation, but that's a misunderstanding of the relationship that Jewish people of the Second Temple period saw between the Sabbath and Passover. So when we, in the episode we did about the Book of Jubilees that I'm about to teach a course on free plug for Peugeot and the Orthodox Studies Institute, et al, we talked about how the Feast, in that case the Feast of Pentecost, is sort of eternally taking place in heaven. And so the idea is that the cycles on earth sort of at certain points, contact what's already going on eternally in heaven. And so, in the same way that every Sabbath was a participation in the rest of God, which was both the seventh day of creation and the rest into which humanity and Israel would enter into at the end, every Sabbath day was a participation in that. That both the protological and the eschatological, both the seventh day of creation and that future rest. The same way every Sabbath was a participation in the Passover. And if you look at the Sabbath meal and the blessings and those kind of things, you can see there's a connection there. And you find the language within the Torah itself that refers to, for example, the Passover is the Sabbath of Sabbaths, even when it doesn't fall on the Sabbath. So the idea essentially to whittle it down is every Sunday is Pascha. Pascha is the Pascha of Paschas. And this is our answer, by the way, to every once in a while, I will get some higher church or confessional Protestant person who will say, you know, why do you celebrate Pascha or Easter on one day? Every Sunday is a celebration of the Resurrection. And I'm like, yes, yes. Why are those two at odds with each other?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5578.7,"end":5589.93,"speaker":"Fr Andrew Stephen Damick","text":"Right? I mean, this is just another version of the, you know, why are you saying some days are holy? Isn't. Shouldn't every day be holy? It's like saying, okay, shouldn't every day be your birthday? You know, like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5590.81,"end":5591.21,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5591.21,"end":5591.45,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5591.45,"end":5592.49,"speaker":"Fr Stephen De Young","text":"Some days are common."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5592.73,"end":5593.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5593.85,"end":5597.29,"speaker":"Fr Stephen De Young","text":"And some days are holy. Otherwise they're not holy. You can't set apart everything."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5597.85,"end":5598.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5598.41,"end":5600.77,"speaker":"Fr Stephen De Young","text":"It has to set apart from anything. Exactly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5600.77,"end":5614.14,"speaker":"Fr Andrew Stephen Damick","text":"Set apart from. All right. Okay. So Mark has a question about the angelic stewardship of creation and what we might call fairies. Good morning, Fathers."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5614.14,"end":5618.58,"speaker":"Audience Member","text":"My name is Mark. I'm from Canada. I just have a question."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5619.06,"end":5627.02,"speaker":"Fr Andrew Stephen Damick","text":"I kind of remember or. I don't know if this is a false memory. Looking back on talk about, you know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5627.02,"end":5637.82,"speaker":"Audience Member","text":"Angels maybe having different roles and Maintaining the, you know, the known universe in certain regards. And I also was wondering if that kind of corresponds with."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5637.82,"end":5643.23,"speaker":"Fr Andrew Stephen Damick","text":"I know in a lot of Eastern culture there's kind of that forest worship, let's say, or, you know, praying to."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5643.23,"end":5647.91,"speaker":"Audience Member","text":"Spirits of the forest. I know spirits, let's say."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5650.07,"end":5654.39,"speaker":"Fr Andrew Stephen Damick","text":"You'Ve said in the past, spirits like fairies or that kind of idea."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5654.71,"end":5655.99,"speaker":"Audience Member","text":"Mischievous creatures."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5656.55,"end":5657.79,"speaker":"Fr Andrew Stephen Damick","text":"There's not really a middle ground."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5657.79,"end":5660.55,"speaker":"Audience Member","text":"There's either angels who are fallen or not fallen."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5661.19,"end":5669.64,"speaker":"Fr Andrew Stephen Damick","text":"And so I was just wondering if praying, you know, intercessory prayers to, you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5669.64,"end":5676.76,"speaker":"Audience Member","text":"Know, appreciate nature, things like that, if. If that would be something that's way off base or like, is there something."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5676.76,"end":5680.32,"speaker":"Fr Andrew Stephen Damick","text":"To those kind of Eastern cultures that. That have the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5680.48,"end":5682.8,"speaker":"Audience Member","text":"The force worship, but maybe worship is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5682.8,"end":5684.72,"speaker":"Fr Andrew Stephen Damick","text":"Isn't the right term and they're."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5684.72,"end":5688.96,"speaker":"Audience Member","text":"They're going too far. Would love to hear your thoughts. Thanks. Bye."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5689.68,"end":5746.84,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, I. My basic take on this is that, you know, what these pagan cultures, frankly, what they say about spirits and places and, you know, all that is basically correct. I mean, this is like if you read the book of Jubilees, for instance, right? You get made explicit what's kind of implied in the biblical text, that angels are over the creation, various elements of creation. And so they're just sort of recognizing that same thing. But obviously the way that they're going about interacting with that reality in a pagan way, where they're offering worship, for instance, as I know, my understanding anyways, of Shinto, that they. They offer worship to the. The kami or kamis, I'm not sure how to correctly pluralize that. You know, the sort of the. The spirits of a particular place or thing. That is not what Christians do. But. But yeah, I mean, it's not wrong, this idea that there are spirits that govern all creation. What do you think, Father?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5747.48,"end":5761.2,"speaker":"Fr Stephen De Young","text":"Right. Well, yeah. And if by intercession you mean, like, let everything that hath breath praise the Lord, you know, or the Psalms, talking about, you know, the trees and animals and stuff, worshiping God, you know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5761.2,"end":5761.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5761.96,"end":5804.46,"speaker":"Fr Stephen De Young","text":"But yeah, you don't offer worship to them. And I mean, with patron saints of a particular place or thing, you know, we know that saint's name and we could ask for that saint's intercession. And there's a handful of angels who are named, but I don't know the name of the angel of the Atchafalaya Swamp, such that I could invoke his prayers to ward off alligators or whatever that would be. So when you start going, oh, spirit of the swamp, you know, you start entering into pagan territory very quickly when that's not something that's been sort of directly revealed to you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5805.1,"end":5814.46,"speaker":"Fr Andrew Stephen Damick","text":"All right, so now our question from the other Zach, Zach 2.0. He wants to know, how do we help people who are tempted by Satanism?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5815.26,"end":5881.99,"speaker":"Audience Member","text":"Good afternoon, gentlemen. I've noticed that there are some sinister people pushing leveean Satanism on vulnerable young people in online spaces. They say God is a tyrant because he allows suffering and Satan is the moral one because he gave humans forbidden knowledge and wants us to feel good. They also refer to how religious institutions have a reputation of not being accepting of non traditional orientations and lifestyles. My question is threefold. Number one, how would you spread the gospel to a young person captured by Satanic propaganda? Number two, how would you combat these predatory online Satanists? And number three, what is the orthodox opinion on the Jewish idea of Hasatan? As the tester, I often lead with promoting the Holy Spirit and God's love in a very general way. And if they get hung up on logic, I make the logical argument that just because we don't understand why God allows suffering doesn't mean that God doesn't exist or isn't moral. It just means we don't understand. So I'm curious what you all have to say. I think there's a great need for compassionate people to put work in on the dark corners of Reddit and other social media sites. Yeah, cheers."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":5883.11,"end":6087.7,"speaker":"Fr Andrew Stephen Damick","text":"I mean I, the first thing I would say is I don't know about trying to convert people on Reddit, but you know, more power to you, Zach. But even though like Levan Satanism is this modern construct, like one of the arguments that Zach mentions there of, you know, the idea that, well, Satan wants us to feel good and he wants us to give us things, you know, and God allows suffering and it's like, well, number one, it's not like even their version of Satan can prevent suffering. You know, so like the polemic that's in the scripture against pagan gods that they're basically powerless and can't provide you with what they claim to provide you is just still applies. But I think especially a lot of these modern ideas like Church of Satan and so forth, they tend to, to present their version of Satan as not being an actual spirit, but rather as an idea that a lot of it is very kind of parasitic on Christianity. Essentially it's, here's some things that we think are contradictions in Christianity and therefore you should not believe it and rather embrace this thing about making yourself feel good. Instead, which explains, you know, then why Zach mentions people who are trying to make themselves feel good by pursuing sexual desires that are not in accordance with God's commands. So I don't know, it is hard for me to take some of these modern constructed things seriously because they don't have a lot of depth to them. Also, there's not actually a lot of people really truly following them. There are a handful of people who like to make themselves heard over it and put up disgusting statues in front of, in front of state houses if they possibly can, that kind of thing. But honestly, Zach, I think if you just say to people, well, we just don't understand this. I mean, that is true. Right, but that's not going to be very convincing if you're trying to do apologetics in this regard. To me, the central answer to this, what might be called the question of theodicy, you know, the problem of suffering and of an all powerful God, is that God's approach to suffering is to become one of us and to suffer with us and for us not to stand back and snap his fingers and say, you know, no more suffering. Because I do believe that the world that God created is the best possible world that could be created. There's nothing to compare it against anyway, but that God's creation, even knowing full well everything that would go wrong, was for ultimately the salvation and exaltation of human beings. And I think particularly if someone has lived a little bit of life and have suffered and seen their own personal growth and the growth of the people they love and their families and their friends through that suffering, then their view of suffering is probably going to be a bit different than someone who frankly hasn't suffered very much. You don't, frankly, you know, honestly, that I'm aware of, you don't see these kinds of movements in countries where life is much more suffering than it is in the comfortable United States of America here in 2025. So that's my collection of thoughts about all that. What you got Abuna?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6089.54,"end":6101.63,"speaker":"Fr Stephen De Young","text":"So, I mean, yeah, Reddit is a wretched hive of scum and villainy, but it's true that, you know, frankly."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6104.35,"end":6104.63,"speaker":"Audience Member","text":"I."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6104.63,"end":6118.33,"speaker":"Fr Stephen De Young","text":"Think there's a fundamental cultural misread here. Like real levee and Satanism doesn't exist anymore. Yeah, just like you can't have Aleister Crowley now. They would be canceled so fast."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6118.49,"end":6120.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6120.73,"end":6166.12,"speaker":"Fr Stephen De Young","text":"So fast. The era of free love is over and those two guys are exhibit A and B of all cults become sex cults. Right. Like it ends up being about especially the Cult leader having sex with a lot of people, like, that's just not a thing anymore. And that's primarily what they're talking about. Oh, say pleasure. Enjoy yourself. All these rules. It's like the problem is they have this incredibly stuffy and weird set of rules now. Yes, you can say in the current day sexual politics, the only real rule is consent. But they've so complicated consent now."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6168.05,"end":6168.29,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6168.37,"end":6172.21,"speaker":"Fr Stephen De Young","text":"Like Zoomers are an almost sexless generation. Like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6172.29,"end":6173.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they don't know what the rules are."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6173.77,"end":6177.09,"speaker":"Fr Stephen De Young","text":"The kids aren't going out and having sex. Teen pregnancy rates are actually way down."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6177.09,"end":6180.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not because there's a huge outbreak of Christian morality."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6180.93,"end":6184.21,"speaker":"Fr Stephen De Young","text":"No, no. It's because this weird morality."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6184.29,"end":6184.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6185.01,"end":6194.13,"speaker":"Fr Stephen De Young","text":"That makes it. Right. Almost impossible. Right. Like hookup culture is mostly dead. All of this stuff is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6194.21,"end":6194.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6194.57,"end":6207.27,"speaker":"Fr Stephen De Young","text":"And it's reflected in movies like when. When Father Andrew and I were kids. Right. Coming up. Even movies that were mostly appropriate for family audiences would have a sex scene."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6207.27,"end":6207.79,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6207.79,"end":6209.83,"speaker":"Fr Stephen De Young","text":"Parents hand would shoot over and cover your eyes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6209.83,"end":6210.83,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6211.07,"end":6264.41,"speaker":"Fr Stephen De Young","text":"That's the 80s for you. Like what was life? Name a Marvel movie with a sex scene in it. Like there aren't sexy and. And now when Nosferatu came out, which vampire movies have always had this heavy sexual element to them. Right. In vampire stories, the younger generation of people, not Christians, just the younger generation of people in general, like Zoomers who went and saw Nosferatu and Gen Alpha who went and saw Nosferatu were like, this is pornographic. They felt awkward sitting in a movie theater because of it. So I really don't think. I think the appeal of Satanism now, frankly, is are you an atheist who wants to be even more of an Edge Lord? Call yourself a Satanist? I really think that's where we're at. And that's why the outreach is to young people. That's why the outreach is to adolescents."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6264.41,"end":6266.01,"speaker":"Fr Andrew Stephen Damick","text":"And it's. And that's."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6266.01,"end":6268.17,"speaker":"Fr Stephen De Young","text":"No adult is taking that seriously anymore."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6268.17,"end":6290.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that. Right. I think it is this Edge Lord thing and that it's. It's ultimately parasitic on Christianity. Like it would not exist if Christianity were not at least a part of the cultural conversation. Yeah. So he also asked about, you know, the. He said the Jewish concept of hasatan. I mean, that just means the Satan. Right. The opposer."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6291.15,"end":6293.23,"speaker":"Fr Stephen De Young","text":"Yeah. There's several episodes where we talk about that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6293.23,"end":6295.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. All right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6295.15,"end":6298.59,"speaker":"Fr Stephen De Young","text":"I have a chapter on that. Religion of the apostles or a section that is true."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6298.67,"end":6314.94,"speaker":"Fr Andrew Stephen Damick","text":"The Dark Powers. So this will be our Final question for this half, and it's a question from Hugo. He wants to know if Greek influence on the church fathers obscured Second Temple Jewish understandings. So here we go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6315.18,"end":6369.84,"speaker":"Audience Member","text":"Hello, my name is Hugo and I'm tuning in from Sweden. Actually, I'm a Lutheran, but I'm very interested in Orthodoxy, so it would be very interesting to hear your thoughts on this question that I have. So during the centuries after Christ, as the number of Greek Christians started to surpass the number of Jewish ones, do you think that this in any way led to the church sort of losing contact with its roots in Second Temple Judaism, with the effect then that the subsequent fathers started to draw more and more from Greek philosophy than Second Temple Judaism? I have a friend who makes this claim, and one of the points he makes is that the struggles to define Christological and other theological doctrines during the first millennia was an effect of this. And I myself, I'm not sure what to make of this, but what do you think? Grace and peace to you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6370.8,"end":6380.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this seems to me to be a variation on. Was it Gibbon who made this? Or, I'm sorry, Harnack. Wasn't it Harnack who made this claim that there was kind of this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6380.12,"end":6386.75,"speaker":"Fr Stephen De Young","text":"Yeah, this very common Protestant, professional Protestant, like, serious confessional Protestant argument."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6386.75,"end":6396.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now this is a variation on that because there's this idea of. Okay, there's this ancient Semitic thing, and then, you know, the Catholic Church usually. Right. Is the bad guy in this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6397.15,"end":6403.71,"speaker":"Fr Stephen De Young","text":"Well, that's not the most. The more sophisticated version is about the relationship between Athens and Jerusalem."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6403.79,"end":6405.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. Now the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6405.43,"end":6412.3,"speaker":"Fr Stephen De Young","text":"What, you have this fundamentally Semitic religion that then gets, as they would say, recast in Greek philosophical terms."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6412.46,"end":6419.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now Hugo brings in Second Temple Judaism, which usually those conversations don't take into account."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6420.06,"end":6422.54,"speaker":"Fr Stephen De Young","text":"They talk about Judaism in general or the New Testament."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6422.54,"end":6455.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. They're not looking at the texts that we've discussed many times on this podcast. So what do you think? I mean, I think we've shown really well throughout this podcast that Orthodox tradition has retained the. The religion of Second Temple Judaism and, And, you know, obviously with the transformations of Christianity involved, and even if it's not being explicitly mentioned by some of the church fathers, the sense of it is still there. The, the, you know, the meaning of it, the purpose of it, the shape of it is still there. What do you think?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6456.31,"end":6611.84,"speaker":"Fr Stephen De Young","text":"Well, so part of this, that's an argument that's made by Western Christians, and part of the reason for it is the history of Christianity in Western Europe. So I'm not Referring to the west in some vague construct sense. I'm talking about like Western Europe, the actual location, Latin North Africa, for as long as that was a thing, for the few centuries that that was a thing. And that's that there is very much a platonist period following St. Augustine. There's a Platonist period in Western Christianity. You look at people like B all the way up through Anselm. Most people have never read any Anselm in their life. They've heard various things about Curdeus Homo and atonement theory and they usually misinterpret him and think he taught penal substitution, which he did not. But that's not most of what. Even if they had corneas homo. Right. That's not most of what Anselm wrote. Right. The pros logian, the monologian. He was mostly a Platonist philosopher. So there's that whole period before the rise of Scholasticism where in Western Europe and Western North Africa following Augustine, the Platonic metaphysics was brought into and really transformed Christian theology. And if you want someone wiser than me arguing that, read Vladimir Lasky's Mystical Theology of the Eastern Church. So they're coming at it from that perspective because when they look at what they consider to be patristics, which is first and foremost St. Augustine, they see Platonism. So they say, oh, and that Platonism seems to be very different, especially Platonic metaphysics, as we've pointed out many times on this show, is very different than the, the metaphysical understandings that underlie, like the Scriptures coming from an ancient Near Eastern and then Hebrew, then second Temple Jewish perspective. And so then that understanding, when they do read the Greek fathers, those understandings and that metaphysics gets read into the Greek fathers. But there are fundamental problems with trying to understand, for example the Ecumenical Councils that way. So it is true that what's happening at the Ecumenical Councils is that the truths regarding the revelation, the self revelation of God and the person of Jesus Christ are being expressed in the Greek language, which is not a Semitic language."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6612,"end":6612.56,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6613.12,"end":6656.79,"speaker":"Fr Stephen De Young","text":"And they still had to do that because tying it back, the New Testament wasn't really written in Greek. So an actual Greek expression of the Christian faith remained to be done and had to be done starting in the 4th century once Christianity became legal. And so that's what they're doing. They're finding Greek terms. Obviously some of these Greek terms that they're using are terms that were also used by Greek philosophers, Greek poets. Right. Like they're not just making up a whole slew of new Words that didn't exist, just all neologisms, they're using words that exist, okay? But if you interpret those words."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6658.87,"end":6659.19,"speaker":"Fr Andrew Stephen Damick","text":"If."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6659.19,"end":6771.39,"speaker":"Fr Stephen De Young","text":"You interpret those words in the way that they were used in pagan philosophy, you will fundamentally misunderstand the councils. This is what's really responsible, for example, and this is exhibit A for me. This is why we have the Oriental Orthodox Churches. The word nature as it was used in Greek philosophy was a particular referent meaning. The word starts being used in 4th century BC Greek philosophy when they discovered the concept of heredity. If you take two large cows and breed them together, they have large babies, most of the time, small cows, you get small babies. They didn't know. DNA, they didn't know, but they started to understand this concept of heredity. And so nature was referring to the nature of a particular entity, like a particular person. And you see this reflected, like in Plato. So Plato's Republic, there are different kinds of people. People have different natures. There are people who have the nature to become philosophers. There are people who have the nature to be workers. And that's about it. Field workers or whatever. For Aristotle, there are what he calls natural slaves. They're just born and they have the nature. That's what they're suited for. And so having them as anything other than a slave is wrong. That's how it's used in pagan philosophy. Nature refers to the qualities often received through heredity of a particular being. Okay, that's not how St. Paul uses the word feces."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6773.15,"end":6773.95,"speaker":"Fr Andrew Stephen Damick","text":"At all."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6774.59,"end":6865.57,"speaker":"Fr Stephen De Young","text":"In fact, Paul uses it the exact opposite way. The word physis never occurs in the Greek translation of the Old Testament. It does appear in a couple of the latter books of the Old Testament that were originally written in Greek, like second Maccabees. So St. Paul is using it. There's no, like, Hebrew word that's translated by it. But the way St. Paul uses it when you study his Epistles, nature is the exact opposite. It's not of an individual. Nature is more what makes a thing a thing. And it is something that is shared by all of those things. So there is a human nature that is shared by all humans for him. So all humans share in human nature. And therefore, since all humans have the same nature, he can say things like, there's no male or female, slave or free, etc. Etc. He's building this idea off of the idea that all humans are made in the image of God. So they all have the same nature. And they're all, as he says repeatedly, all descended from one man. Why is it Important that we're all descended from one man. The connection between heredity and nature. If we're all descended from one man, we all have the same nature. That is the use of nature that the Councils use. Like, if you understand the Trinity, when they say there's one divine nature, if you understand it in the Greek philosophical way, then that would mean there's one divine person. You'd be a modalist."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6865.73,"end":6867.69,"speaker":"Fr Andrew Stephen Damick","text":"I think everyone who Christ, two natures."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6867.69,"end":6868.81,"speaker":"Fr Stephen De Young","text":"Let me get to the Oriental Orthodox."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6868.81,"end":6869.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, go ahead, go ahead."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6870.17,"end":6880.09,"speaker":"Fr Stephen De Young","text":"So when Calcine comes along and says Christ has two natures according to his divine nature, he's consubstantial with the Father, the Spirit, according to his human nature, he's consubstantial with us."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6880.17,"end":6880.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6880.57,"end":6940.7,"speaker":"Fr Stephen De Young","text":"Homo usio is with us. The Oriental Orthodox read the word nature in that philosophical sense because St. Cyril of Alexandria at a couple of points, used it in that philosophical sense. And so they say, well, you're saying there's two persons. You're saying Christ is two different people. He has two different nature. That means he's two different things. And so they misunderstand it. Whereas the Council is using it the way St. Paul used it. He shares our humanity, he shares the Father and the Spirit's divinity. So even when the Councils are using Greek terms that were also used by Greek philosophers, they're not using them in the Greek philosophical sense. They're using that language the way it's used in Second Temple Judaism, and they're using it to describe the same realities of the faith, of the apostolic faith, just in a new language to a new audience. Now, go ahead."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6940.78,"end":6957.09,"speaker":"Fr Andrew Stephen Damick","text":"I was going to recommend for anyone who's really interested in all the sort of receipts of the way that early Christianity interacted with. With Greek philosophical language and so forth. The magisterial book on this is Yaroslav Pelican's Christianity and Classical Culture."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6958.13,"end":6959.89,"speaker":"Fr Stephen De Young","text":"He's talking about the Cappadocians in particular."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6960.13,"end":6973.17,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. But they're kind of. I don't know, in some ways, I think they're kind of ground zero for this. But, yeah, I mean, it is the standard work on this question, honestly. So very, very worth reading."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6973.17,"end":6974.53,"speaker":"Fr Stephen De Young","text":"This is just me spinning yarn."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6974.86,"end":6980.54,"speaker":"Fr Andrew Stephen Damick","text":"This is exactly, exactly. All right, well, that wraps up the second half. And we will be right back."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":6980.86,"end":7000.62,"speaker":"Audience Member","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment on the next part of the Lord of Spirits. The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7001.29,"end":7004.09,"speaker":"Fr Andrew Stephen Damick","text":"But Paul operated during his entire life."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7004.17,"end":7007.29,"speaker":"Audience Member","text":"As a faithful Pharisee within the Roman Jewish world."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7007.61,"end":7013.37,"speaker":"Fr Andrew Stephen Damick","text":"In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7013.37,"end":7016.17,"speaker":"Audience Member","text":"Paul's life and writings, interpreting them within."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7016.17,"end":7018.97,"speaker":"Fr Stephen De Young","text":"The holy tradition of the Orthodox Church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7019.13,"end":7021.57,"speaker":"Audience Member","text":"This survey is followed by De Young's."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7021.57,"end":7024.45,"speaker":"Fr Stephen De Young","text":"Interpretive translation of St. Paul's epistles, which."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7024.45,"end":7053.09,"speaker":"Audience Member","text":"Deliberately avoids overly familiar terminology. By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7054.6,"end":7074.36,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the third half of this all Q A episode, the Lord of Spirits podcast. This is a pre recorded of course next time is going to be all live Q A. So give us a ring next time and we'll talk about almost anything that's on your mind. Not anything, but almost anything. So."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7074.52,"end":7076.84,"speaker":"Fr Stephen De Young","text":"Well, I'll talk about anything, Father Stephen."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7076.84,"end":7078.44,"speaker":"Fr Andrew Stephen Damick","text":"Of course we'll talk about whatever."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7078.84,"end":7087.26,"speaker":"Fr Stephen De Young","text":"Father Andrew, maybe sit atop too lofty a perch to address your meager concerns. That's right, I will sink to your level."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7087.26,"end":7095.78,"speaker":"Fr Andrew Stephen Damick","text":"My ivory tower. Okay, so this first question comes from Elizabeth, who has a question about the Romanov Martyrs."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7099.3,"end":7172.43,"speaker":"Audience Member","text":"Hello podfathers, my name is Elizabeth from California and I'm curious about something that I just heard at the end of your most recent Q A. It's actually my first time listening to this podcast. However, I have been listening or reading both of your works via podcasts and books, but was curious about the last comment regarding martyrdom and that being kind of like a cause in itself for sainthood. And that is something I have always been a little curious about in certain circumstances. And I'm wondering how that would apply to, for example, how the Russian martyrs of the Romanov family are considered martyrs. Right, but just curious because it doesn't seem like they were martyred for their faith, but rather because of the political position and was just hoping you could explain that better. Please excuse my barking dog in the background."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7172.91,"end":7292.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so there is a book that was published by the. Oh, it's a monastery in Cyprus, but I think it's called Royal Martyrs or Romanov Martyrs that came out that has. I mean it is valuable if nothing else for the amazing photographs that are actually in it, but it is a very, very detailed book. I will say this, though, Elizabeth, that not all Orthodox who venerate the Romanovs who were killed around World War I classify them as martyrs. So there are some, but then there are also, I think when the Moscow Patriarchate canonized them, they didn't canon. If I'm correct about this, I'm pretty sure about this, they didn't canonize them as martyrs, but rather as what they call passion bearers, which means that they, you know, accepted their death in a Christlike fashion, which is not quite the same thing as being killed for your faith. That said, though, there are some saints that are classified as martyrs who were not directly killed for their faith, and yet we still call them martyrs, like Saint Thecla. Right? Isn't that right, Father? She wasn't actually outright slaughtered. She ran into this crack that opened up in front of her and it closed around her, and she's regarded as a martyr or another. Like the seven sleepers of Ephesus. You know, they escape into a cave, they escape from persecution, and while they're sleeping, that cave gets bricked up. Although I don't think that they knew that they were in there, as I recall. And they're regarded as martyrs. And so, I mean, the word is a little bit broader than just, I'm going to kill you because you're a Christian. It can have a greater meaning than that. So on some level, it doesn't really matter because it's not like the particular label that goes on. A saint is the most important thing about them, although we do have them."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7292.78,"end":7304.94,"speaker":"Fr Stephen De Young","text":"But I. I also think, though, we're. We're imposing a kind of secularity on early 20th century Russia that didn't exist in early 20th century Russia."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7305.02,"end":7307.02,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. Okay, say more."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7307.82,"end":7339.43,"speaker":"Fr Stephen De Young","text":"Meaning? Well, meaning. I mean, for us, there was no real religion involved in John Wilkes Booth shooting Lincoln. Like, there's no religious anything involved in that. Right. It's an assassination of a political leader by someone from an opposed political faction or even Archduke Franz Ferdinand. Right. Gets blown up by an anarchist, or when George H.W. bush and the CIA assassinated John Kennedy."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7343.35,"end":7343.83,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7345.19,"end":7356.23,"speaker":"Fr Stephen De Young","text":"Hey, where was he that day? Find me the answer. Anyway, okay. Like, see, that's going to be the."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7356.23,"end":7358.03,"speaker":"Fr Andrew Stephen Damick","text":"Bit that people are going to talk about from this episode."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7358.03,"end":7367.51,"speaker":"Fr Stephen De Young","text":"That's going to be the takeaway. Where was he that day? Anyway? Both he and Barbara, to the day they died, said they didn't remember."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7368.15,"end":7368.63,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7369.19,"end":7454.82,"speaker":"Fr Stephen De Young","text":"Where he was. He was in Texas somewhere working for the CIA, but he doesn't remember Anyway, so there's. There's no religious anything going on there in the, in the minds of the people. It's, it's quote unquote secular political thing. But that's not who the czar was in Russian culture. You got to remember Russia was still a feudal society. F E U D A L Not resistance is feudal. But I've always thought it would be cool to do a Star Trek story where the Borg travel back to like the Middle ages so that you could do a resistance is feudal joke. Yeah, but, but it's still a feudal society. The Tsar, the Christian emperor is the representative of God on earth. Culturally, the Tsar attends the full. Is required to attend the full cycle of monastic services. There is no remotely concept of separation of church and state. You have then Vladimir Ilyich Lenin, who is the leader of a group called the League of the Militant Godless."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7457.7,"end":7461.78,"speaker":"Fr Andrew Stephen Damick","text":"Feels like it should be a steampunk villain faction."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7462.58,"end":7469.54,"speaker":"Fr Stephen De Young","text":"Okay. The League of the Militant Godless. And I have had atheists try to argue with me that that was not a militant atheist organization."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7469.86,"end":7470.34,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7471.14,"end":7471.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7471.94,"end":7472.42,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7473.46,"end":7479.1,"speaker":"Fr Stephen De Young","text":"Okay, so the, the leader of the League of the Militant Godless takes power."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7479.42,"end":7481.9,"speaker":"Fr Andrew Stephen Damick","text":"Former Orthodox seminarian, by the way."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7481.9,"end":7483.06,"speaker":"Fr Stephen De Young","text":"It is. No, that's Stalin."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7483.06,"end":7484.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sorry. Yeah, that's right. Excuse me, Excuse me."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7484.7,"end":7566.96,"speaker":"Fr Stephen De Young","text":"Takes power in a state where there's no separation of church and state and kills not only the man, but the whole family of the man, including. Right. A sister who's a nun who is considered to be the representative of God on earth by the whole society. You can tell me that had, that, had the religious element had nothing to do with that. I mean, I don't see how you could argue that, that there was no religious motivation in his killing. So I think part of the reason why people don't understand how they're martyrs is that they don't understand what Russian culture was like at that time. And they were just coming out of, at the end of the 19th century, a huge religious revival at flowering of the Orthodox Church in Russian culture. So they don't understand the religious element and anti Christian element of what Lenin was doing directly opposing Christ, his church and seeking to kill the representatives of Christ and his church on earth, which was part of his motivation and that is what makes them classifiable as martyrs."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7568.24,"end":7572.48,"speaker":"Fr Andrew Stephen Damick","text":"All right, so our next one comes from Matt who is asking about Orthodox evangelism."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7573.28,"end":7626.99,"speaker":"Audience Member","text":"Hi Fathers, it's Matt from Calgary, Canada. Hey, I grew up in Protestant circles and in the Protestant world evangelism is at the very least spoken of often and it's talked about as the work of all people. Who follow Christ. And that seems all well and good. When Christ is spoken well of and when people articulate well the gospel, Glory to God. However, when people misrepresent Christ or misrepresent what the gospel is because they've been self appointed evangelists, that seems like it could have different consequences. What do you think of that? I'd be curious to hear you talk as well about what it means to evangelize from an orthodox perspective whose job at is. And hey, what is the gospel that you evangelize with? I know, loaded question. Look forward to hearing your response. God bless you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7627.79,"end":7631.31,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. Should I just promote my book? Just kidding."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7632.11,"end":7633.63,"speaker":"Fr Stephen De Young","text":"I was like, I could stop you."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7635.55,"end":7692.3,"speaker":"Fr Andrew Stephen Damick","text":"Hey, we, we often sell your books on this show. So you know, I, well it, so it is related. So you know, my little book Arise oh God is about the gospel. But I will say, like, what is the gospel? It's, who is Jesus Christ? What did he do and what does he expect of us? Right? That's, that's the gospel. I do believe that evangelism is everyone's job, Every orthodox Christian's job. That does not mean that I think everyone needs to be an evangelist in the sense of spending their time preaching or teaching. But I think everyone should share with their family, their friends, the people around them, the good things that Christ has done for them. I do not think that live a good moral life and then wait for someone to ask you why. You're like, that is actually evangelism. You know, you can't preach."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7692.3,"end":7693.74,"speaker":"Fr Stephen De Young","text":"It's not a bad thing to do though."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7693.74,"end":7695.26,"speaker":"Fr Andrew Stephen Damick","text":"It's not a bad thing to do."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7695.26,"end":7699.4,"speaker":"Fr Stephen De Young","text":"But it's not, it doesn't actually living out your faith is. I mean that's a good."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7699.56,"end":7710.88,"speaker":"Fr Andrew Stephen Damick","text":"Doesn't. That doesn't constitute evangelism. You know, preaching involves preaching. Like, like I hate, well, I mean like I hate that saying, you know, we made it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7710.88,"end":7712.24,"speaker":"Fr Stephen De Young","text":"We may disagree a little about, okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7712.24,"end":7776.3,"speaker":"Fr Andrew Stephen Damick","text":"Maybe, but I hate that saying, preach the gospel at all times, if necessary, use words. I hate that because, because the whole point of that is, is, you know, it makes me feel uncomfortable to talk about Jesus. I'm just going to be good. But, but I think that every person, according to his ability and what he has, evangelizes according to that. So they may not be preaching sermons, but certainly you can share, as I said, what God has done for you and, and the, the beautiful orthodox Christian life that you have. I mean, you know, Matt mentions what, what happens when the gospel is preached badly. Well, yes, preaching another gospel is bad. And it's explicitly said to be bad in the New Testament. So yes, a distorted gospel can have distorted effects. We pray that God would still work in whatever capacity, you know, whatever capacity is needed, even where it's distorted. But that's why we, we preach the true gospel of who Christ really is, what he really did, what he really expects. So yes, that's what I think. Tell me where you disagree."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7777.9,"end":7787.35,"speaker":"Fr Stephen De Young","text":"Well, I mean, so in terms of defining what is the like what St. Paul talks about. Right. The gospel that he preaches. So I'm not disagreeing with you about the definition."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7787.43,"end":7787.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7787.99,"end":7792.23,"speaker":"Fr Stephen De Young","text":"Like, okay, I think so."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7794.23,"end":7794.71,"speaker":"Audience Member","text":"When you're."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7794.71,"end":7800.31,"speaker":"Fr Stephen De Young","text":"Talking about preaching the gospel and telling, I'm gonna here, I'm gonna tell you all this stuff. What's the goal?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7801.35,"end":7801.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7803.19,"end":7812.34,"speaker":"Fr Stephen De Young","text":"If you've done it successfully, if you've done it effectively, what's the goal? It still sounds like to me, at least the way you just framed it, the goal is to get somebody to make a decision."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7813.62,"end":7814.58,"speaker":"Fr Andrew Stephen Damick","text":"That's not what I think."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7815.62,"end":7821.46,"speaker":"Fr Stephen De Young","text":"Well, I know, but that's kind of what it. Like I've told you now who Christ is and what he did and what he expects of you. So now."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7822.74,"end":7828.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, the point is to draw someone into faithfulness to Christ to the whatever extent they're able at that moment."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7828.98,"end":7845.69,"speaker":"Fr Stephen De Young","text":"Right. And so to me that conditions though, the whole thing, because when we people hear evangelism and someone from an evangelical background, like our caller, thinks about evangelism, they're thinking about trying to get somebody to make a decision. Yeah, I mean there's, there's a reason for that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7845.69,"end":7851.41,"speaker":"Fr Andrew Stephen Damick","text":"Again, literally, this is the very first thing that I, this is the very first thing that I say in the book is, you know, the gospel is."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7851.41,"end":7876.18,"speaker":"Fr Stephen De Young","text":"Not a sales pitch if you're in, in the mid. But well, not just a sales. I mean, it does become that. This comes out of like mid 20th century, like in the mid 20th century in the United States at least. This is probably true in other English speaking cultures. People grew up in a fundamentally Christian culture, including they probably as kids at least were taken to church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7876.82,"end":7877.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7877.62,"end":7914.68,"speaker":"Fr Stephen De Young","text":"Possibly against their will to some church of some type. And they were this broadly Christian culture. And so when you're campus Crusade or you're whoever. Right. I'm not picking on them. You're an evangelist. Your goal is to get those people who are basically culturally Christian and you kind of have a knowledge of this stuff. Your goal is to try and get them to commit to take it seriously. Hey, remember that stuff you learned in Sunday School as a kid, you need to commit to that and take it seriously and start living that out. And so it became about just getting people to commit."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7915.32,"end":7915.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7915.88,"end":7920.68,"speaker":"Fr Stephen De Young","text":"And it makes sense in that context now. Number one, we don't live in that culture anymore."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7920.92,"end":7921.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7921.8,"end":7944.6,"speaker":"Fr Stephen De Young","text":"So that whole approach don't work no more because people aren't growing up in a basically Christian culture. There are lots of people who are adults now who have never been in a church service in their life of any kind. They don't have that background. So that whole approach won't work. But also that was very conditioned to a sort of cultural moment. If our goal is to draw someone to faithfulness in Christ."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7945.16,"end":7945.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7946.44,"end":7980.53,"speaker":"Fr Stephen De Young","text":"And it's not about making a commitment or a decision or a turn in your head. I think the way you live your life publicly and around people is actually more powerful and effective in accomplishing that goal and a bigger part of it than convincing them that certain things are true. And I think it is a much bigger problem today that the people who go out and represent themselves as preaching the gospel don't live it out in any way."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7982.29,"end":7982.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7982.65,"end":7994.62,"speaker":"Fr Stephen De Young","text":"And live out, in fact, something far removed from it. I think that's a bigger problem than the fact that even, even the worst of, you know, TV preachers has got the gospel wrong."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7995.9,"end":7996.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":7996.3,"end":8040.15,"speaker":"Fr Stephen De Young","text":"That it's details. Because their, their behavior, their failure to live out the gospel drives people away from Christianity at all. Where they don't even want to hear the nuance of. Well, really, what he was preaching wasn't correct. This is the correct way to understand this. They don't even want to hear that because they don't want to hear about Christianity. So I actually think the way we live is way more important. And I tell this to catechumens about their families and family members because a lot of people come into the Orthodox Church from some other tradition. They have family members in that other tradition who aren't super happy about them coming into the Orthodox Church."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8040.31,"end":8040.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8040.67,"end":8056.59,"speaker":"Fr Stephen De Young","text":"That happens a lot. And there's this tendency of people like, well, what do I need to say to them? How do I convince them that this or that part of Orthodoxy that they don't like is actually right? And I tell them, you don't. Don't even talk to them about it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8056.59,"end":8056.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8058.11,"end":8071.79,"speaker":"Fr Stephen De Young","text":"Just live your life as an Orthodox Christian. And if you're doing that and you're serious about that, then your life is going to be transformed. That's the whole theosis thing. Your life is going to be transformed in ways that you may not even realize is happening, but that they will see."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8073.27,"end":8093.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I think the main thing, when. If you're trying to talk to somebody about anything, if they're not in a place where they can hear you, where they can receive what you're saying, then you might actually be harming the relationship or harming their ability to conform to Christ by saying those things to them at a point where they can't receive it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8095.83,"end":8103.89,"speaker":"Fr Stephen De Young","text":"I think we don't live in a world where people separate the speaker from the message."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8104.77,"end":8105.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8105.49,"end":8114.85,"speaker":"Fr Stephen De Young","text":"Where they could say, I think, well, yeah, that guy's problematic. I don't like that guy. That guy's a problem. But look at what he said. What he said. He said some really good things. I don't think people could do that anymore."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8114.85,"end":8139.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, people. It's interesting. People often will. Will. They'll appeal to that idea. Like, you could say, well, this guy is horrible. They're like, yeah, but is he wrong? Yeah, it's like, well, okay, you can say that. But the problem is that someone could be saying all kinds of things that are true. But if the way that they live and the way they present themselves is not in accordance with that truth, then the plausibility of the truth goes way down for people."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8140.78,"end":8152.1,"speaker":"Fr Stephen De Young","text":"Now, in our present day, people evaluate a person and how they live and who they are, and then based on that, decide whether they want to hear anything they have to say about anything."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8152.1,"end":8180.21,"speaker":"Fr Andrew Stephen Damick","text":"Which I honestly, like, might sound like to. To someone who's. Who's dedicated to enlightenment values. That might sound crazy. You say, well, look, if something is true, it's true, you know, whether the person saying it is bad or not. But that's basically in accordance, like, with what Saint Athanasius at one point says, and on the Incarnation, where he takes it from another angle. But he said, unless you are attempting to imitate the lives of the saints, you can't actually understand their teachings."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8181.7,"end":8182.1,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8183.46,"end":8187.86,"speaker":"Fr Andrew Stephen Damick","text":"So I feel like it's kind of an orthodox turn we've taken maybe a little bit."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8188.34,"end":8189.78,"speaker":"Fr Stephen De Young","text":"That doesn't mean you have to be perfect."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8189.94,"end":8191.02,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8191.02,"end":8193.06,"speaker":"Fr Stephen De Young","text":"That means you have to be publicly repentant."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8193.3,"end":8193.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8194.26,"end":8195.3,"speaker":"Fr Stephen De Young","text":"When you mess up."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8196.58,"end":8213.12,"speaker":"Fr Andrew Stephen Damick","text":"All right, our next question comes. So that one's from Matt. This next is from Matthew. And Matthew wants to know, if we say that only Christ was without sin, then why do we also say that the Theotokos or John the Forerunner were sinless?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8214.72,"end":8234,"speaker":"Audience Member","text":"Hello, Fathers, this is Matthew from Longmont, Colorado, and I have a question for you. We state that Jesus alone is without sin, and yet at the same time, we will say that Mary and John the Baptist were without sin. How can this be? Thank you for your consideration."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8234.5,"end":8240.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Pretty straightforward. Clearly, we mean two different things by that. Yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8242.02,"end":8328.29,"speaker":"Fr Stephen De Young","text":"There's a difference between saying someone is without sin, which we say Christ alone is without sin. We really say God alone is without sin. And then Christ is God, so transitive property. But we say that the Theotokos, St. John, the Forerunner, among others, did not commit any sins. And those are two different things. And so I understand popular conception is those are the same thing. Right. A lot of Protestant perspectives, sin is just breaking a rule, violating a known commandment. Right. Transgression, known commandment, and that's it. But if you understand sin the way we've talked about it a lot, the way it's presented in the Bible as a force that is at work in the world and in your heart, and that there are. There's a whole spectrum from thoughts to temptations, to on and on. Before you commit. Actually commit a sin, then you understand that you can be. Not commit any sins and still not be sinless in the sense that Christ is sinless. In fact, there's a lot of language in the. In the Old Testament, especially when you look at, say, the way the Book of Wisdom or Sirach interprets certain earlier parts of the Old Testament, like they talk about Enoch being taken out of the world before it could corrupt him. Enoch is another one of those people who we say did not commit any sins."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8328.45,"end":8334.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the model, then is that there is this force at work on him."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8336.29,"end":8337.77,"speaker":"Fr Stephen De Young","text":"And in the world that he's living in."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8337.77,"end":8338.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8338.85,"end":8340.53,"speaker":"Fr Stephen De Young","text":"And there are people sinning around him."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8341.1,"end":8348.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. Whereas with Christ, even though there's sin around, it's not actually at work on him because it can't do that to him."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8348.54,"end":8349.26,"speaker":"Fr Stephen De Young","text":"It doesn't touch him."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8349.26,"end":8353.58,"speaker":"Fr Andrew Stephen Damick","text":"He's. To use the technical term, he's impassible. Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8353.58,"end":8357.26,"speaker":"Fr Stephen De Young","text":"Whereas St. John the Forerunner is still mortal. He died."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8357.58,"end":8358.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He would."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8358.86,"end":8359.66,"speaker":"Fr Stephen De Young","text":"You could kill him."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8361.42,"end":8373.76,"speaker":"Fr Andrew Stephen Damick","text":"You could kill him whether he willed it or not. Whereas Christ laid down his life of his own accord. That doesn't just mean he volunteered or that he didn't fight back. We saw him do that on the cross where it said that he bowed his head."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8373.76,"end":8374.72,"speaker":"Fr Stephen De Young","text":"He voluntarily died."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8374.72,"end":8400.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He bowed his head and then gave up his Spirit. No one took it from him. This is an important distinction, and it makes sense of what seems like contradictory language within the orthodox tradition, unless we understand what the distinction there is. All right, this next one comes from Patrick, who is asking about the the early 20th century Russian Orthodox theologian Father Sergei Bulgakov."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8402.39,"end":8454.25,"speaker":"Audience Member","text":"Greetings, Fathers. In light of him writing on topics that you all have touched on in the podcast, such as the study of wisdom and universalism, I wanted to ask you how we should view Father Sergius Bulgakov. While some of his theological positions, such as his views on sofioli, had been controversial, he was also deeply respected by several prominent Orthodox figures, including St. Mary of Paris and Metropolitan Anthony Bloom. Given this, is it appropriate to approach his work discerningly, eating the meat and spitting out the bones, as you might with other complex thinkers, Would it be worth reading his writings, such as his book on angels titled Jacob's Ladder, for example, which I've heard a lot of good things about? Or do the experience, extent and seriousness of his theological errors render his writings more harmful than helpful for Orthodox readers?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8455.69,"end":8518.99,"speaker":"Fr Andrew Stephen Damick","text":"Now, I have only a general outline in my head of the controversy surrounding Father Sergei Bulgakov, his conversations with Florovsky and all that kind of stuff. I will point out, though, it's worth noting, that there's actually another priest with this exact same name. That's, I think they're roughly contemporaneous and he's not the same person this other one wrote. He especially wrote like liturgical manuals. So sometimes if you're, if you're, not, if you're not familiar with Bulgakov, you might come across a reference to this other priest who has exactly the same name. Their middle names are probably different now that I think about it. Unless they dad had the same, you know, their fathers had the same name, which is entirely possible. So it's worth making that distinction. But yeah, is it worth it, Father? I mean, it's a, it can be a very sticky subject. And there's even some who say that, that the theologian Bulgakov was a heretic, even though I think he was, as I recall, he was exonerated or, you know, charges were dropped, so to speak, of heresy."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8519.55,"end":8521.39,"speaker":"Fr Stephen De Young","text":"There's a lot of esoteric speculation."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8522.35,"end":8524.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's why it can be so complicated."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8525.14,"end":8571.37,"speaker":"Fr Stephen De Young","text":"He's frankly a lot like Origen. One of the differences being, like, you don't have to read Origen. You could read St. Gregory the Theologian and St. Basil the Great and St. Jerome even in his biblical commentaries and sort of get Origen pre chewed. You get all the good stuff without any of the bad stuff, like through other saints. And we don't have that with Bulgakov yet. Nobody has come along and sort of sifted it and there's some weird stuff. But then there are Bulgakov devotees who, anytime you point out the weird stuff will say, oh, no, you're misinterpreting it. He really means something much more nuanced and da, da, da, da, da. And maybe that's. Maybe that's true. Maybe it's just. He wrote a lot of books that are very hard to read."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8571.61,"end":8579.7,"speaker":"Fr Andrew Stephen Damick","text":"They are. I tried. There was a point where I tried a little bit. I'm like, yeah, no, there are some very intelligent people."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8579.94,"end":8615.34,"speaker":"Fr Stephen De Young","text":"I'm thinking of you, George William Friedrich Hegel, who are just bad writers. If the mark of good writing is being able to convey your ideas to another person through text, then he is a horrible writer. And that may be what was behind the heresy charges. And then them getting withdrawn may have just been complete misunderstanding because maybe he's just not a very good writer. Maybe he's really hard to translate. I don't know. But I do know there's a lot of. It's very easy for a person reading it to go off on weird tangents. We'll put it that way."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8615.34,"end":8615.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8616.06,"end":8726.25,"speaker":"Fr Stephen De Young","text":"Whether those were intended by him or reflect his thought at all or not. You know, fine. I'll leave that an open question. So whenever I'm asked about these kind of odd or, you know, figures. Figures at the edge. There's nothing wrong with being out at the fringe. There's always a center and then there's an edge. And we need the people on the edge, on the outskirts. Right. Saint Simeon the Theologian was one of those, frankly, in his day. He says a lot of the. We were talking about the authority of bishops. He says a lot of interesting things about the authority of bishops in his stuff. But he's, in his day, the center. Certain things were going on in the center that weren't great. And so you need someone removed from it out on the edge, you know, like Elijah and Ahab. Right. To be a corrective. And that corrective tends to push at least toward the other extreme in order to try to balance things out. And so there's nothing wrong with being out of the edge. The problem is when somebody takes a figure who's out on the edge and tries to make them the center. To me, that would be the best if you really want a decent defense of origin. Like. Right. Like if I was going to do a debate and someone gave me the topic, you have to defend origin. That would be how I would defend Origin. I would say he was out on the edge. And the problem only came when, later there were Certain people trying to move him to the center, but that if you let him exist out there on the edge right now, there on the fringe, he serves this function in balancing everything out. But anyway, and so I see Bulgakov the same way. And so at what point in your theological education do you start. Need to. Need to start reading the people out on the edge? Well, you'd have to be pretty well read in a whole lot."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8727.93,"end":8728.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8728.37,"end":8731.81,"speaker":"Fr Stephen De Young","text":"Before I would say, okay, the next place you need to go is Bulgoga."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8731.81,"end":8741.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I feel like I don't have the background and I mean, I've read a lot of the stuff that would be in the background, you know, but frankly, I just don't want to put in the work."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8741.93,"end":8796.34,"speaker":"Fr Stephen De Young","text":"But yeah, I mean, starting with being super conversant in the church fathers, but then you have to move beyond that. You'd have to read later writers and then you'd have to get into Russian theology in the medieval period and the early modern period because he's in conversation with all that. And then you'd have to get in touch with certain European trends and thought and philosophy and things that are going on. Like, to really understand, you'd have to have this very deep. To really get what's going on there, you would have to do all that. And then I think he could be read usefully. But the average, like English speaking Orthodox Christian in the United States who has not read everything St. Gregory the Theologian wrote yet. No, you should don't read Bulgak. You're not ready. And it's not going to be as profitable. It's not going to be as profitable to you as a whole bunch of other things you could read instead."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8796.34,"end":8796.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8797.06,"end":8811.22,"speaker":"Fr Stephen De Young","text":"Not only do you not have the background to really understand it, but there's other stuff you could read that would be much more profitable for you right now immediately than reading a more modern to contemporary edge figure."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8812.5,"end":8821.22,"speaker":"Fr Andrew Stephen Damick","text":"All righty. The next one in our potpourri. This is from Stephen and she has a question."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8821.22,"end":8826.54,"speaker":"Fr Stephen De Young","text":"That's potpourri as in the Jeopardy category, not potpourri as in Roman Catholicism."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8826.54,"end":8832.82,"speaker":"Fr Andrew Stephen Damick","text":"There's a slight difference in how you pronounce them. Potpourri versus Popery. Do you hear the difference there?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8833.22,"end":8833.7,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8834.34,"end":8842.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right. No potpourri here, but rather in our potpourri. Here's Steph asking a question about forgiveness."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8843.06,"end":8888.39,"speaker":"Audience Member","text":"Hello, Fathers, it's Steph here, one of your Protestant friends from Manchester in England. And I have a question about forgiveness. I had thought that I had forgiven somebody who had hurt my family. And myself. But I was recently surprised when I felt quite angry towards her. I want to know how we can know if we've truly forgiven somebody. How can we forgive someone when the effects of what they've done are evident every day? What does it look like? Is it that we're not angry anymore or is it that we forget what they have done? And also if we don't forgive, how can we be forgiven by God? Does he. What does he do if we can't forgive? I'd appreciate your answer to this. Thank you very much."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8890.07,"end":8948.84,"speaker":"Fr Andrew Stephen Damick","text":"This is a good question and I don't know about. For you, but it comes up a lot in confession, I think. And I think it's because there's this concept of forgiveness in English speaking culture, which I think that Steph is kind of functioning from. I'm not sure, but often I hear it when people say things like I just can't forgive him for what he did, you know, or something like that. And what people usually mean by that is I have very negative feelings towards that person and they're not going away. So is, is those feelings going away what forgiveness is? No, no, it's. It's not to forgive is. I mean, ultimately forgive. Forgiveness is actually. Is a financial term. Right. So I think a more literal translation, correct me if I'm wrong here, Father of the Lord's Prayer is, forgive us our debts as we forgive our debtors. Is that right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8949.08,"end":8951.64,"speaker":"Fr Stephen De Young","text":"Well, no, that's one of the versions anyway."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8951.64,"end":8952.52,"speaker":"Fr Andrew Stephen Damick","text":"One version. Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8952.52,"end":8953.76,"speaker":"Fr Stephen De Young","text":"Really complicated. Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":8953.76,"end":9173.49,"speaker":"Fr Andrew Stephen Damick","text":"But in any event, Gospels. Yeah, forgiveness is. It is a financial term among other things. And you know, in this case, to forgive a debt is not to. Not to extract repayment of the debt, to say, you know what, it's good, don't pay. And of course, you know, as we know, this is all in. In the ancient world, this is Roman Empire particularly. This is bound up with slavery and all this kind of stuff. But it's. It's really about not exacting revenge, not exacting repayment. Right. That is what it means to forgive. So it's an action that you're not taking, you're not going and squeezing that person for what they owe you. Whether it's, I think that they owe me an apology or they owe me restitution or whatever it might be, you know, they. They owe me. Sitting there and listening to me scream at them, you know, whatever it is that we think is going to make us feel better. But yeah, it's possible to forgive someone without having any happy feelings about them or Maybe even having lots of negative feelings about them. Because it's also like in the scripture, where we're told in everything, give thanks. We're not told in everything. Feel thankful. It's give thanks. Which you can give thanks without feeling thankful. And indeed, actually sometimes the act of giving thanks can eventually alter the feelings. Altering the feelings is not the goal. It certainly is nice when that happens, but it's not the goal. Just as to forgive someone, it's nice if your feelings change and it certainly helps and it's easier, right? But it's not the goal. You can't tell your feelings now, feel this way instead of this way. You know, it's not a conscious choice you can just simply make. That's not how human beings work. But you can choose to forgive. You can choose to take the action of not exacting revenge, of not exacting repayment. And that's going to involve struggle because you're going to have those negative feelings. So I could have a negative feeling towards someone who's done something bad to me or my family, and I could, you know, think, okay, I'm going to go blast them, or I'm going to send a strongly worded email, or I'm going to, you know, whatever it might be, choosing not to do that and then not doing that, that's what forgiveness entails. To really decide this is what I'm going to not do and then don't do it. And then I would also add, pray for that person. Pray that God would release you from the feelings that you're having if you're able do good to that person. They not might not be able to, you might not. That might just be too much, but you can at least not do bad to them. That doesn't mean to forgive someone, doesn't mean that you trust them again. So, like, you know, if Father Stephen or I committed an act that was worthy of deposition from the priesthood, we could be forgiven. We could, you know, confess that sin and be forgiven. But that doesn't mean that we're going to be able to serve as priests again. The trust doesn't have to be given back. You can be forgiven your sins, you can become a saint, but that doesn't mean that the trust is going to come back. So forgiving someone doesn't necessarily mean that everything has to be the way that it was before or that you're going to trust them with whatever position they had with you before. It doesn't mean that. It just means not taking revenge is really kind of the basic or you know, extracting repayment. So. Yeah. You got anything to say, to add to, subtract to? Actually."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9175.33,"end":9182.29,"speaker":"Fr Stephen De Young","text":"Sort of all the above. Now, I don't know the whole feelings discourse. I don't have feelings, so I can't really enter into that. I don't know what that's like."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9183.41,"end":9185.57,"speaker":"Fr Andrew Stephen Damick","text":"Father Steven just forgives everyone all the time."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9186.37,"end":9189.33,"speaker":"Fr Stephen De Young","text":"Well, no, it just. It has nothing to do with feelings for me whatsoever."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9190.05,"end":9190.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9191.17,"end":9195.97,"speaker":"Fr Stephen De Young","text":"So. But that's not to say I don't ever experience emotions like rage."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9199.09,"end":9199.29,"speaker":"Audience Member","text":"But."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9199.29,"end":9266.28,"speaker":"Fr Stephen De Young","text":"But that's part of what we're talking about here, right? To me, little kids and a lot of adults picket scabs. And you can keep telling them, you know, if you keep picking at that, it's not going to heal. But they're drawn to it and they keep picking at it and they keep rehearting themselves. And a lot of times when we have bitterness or grudges or anger from these past things, that's sort of what we're doing. And the reason why that makes us unable to receive God's forgiveness is that a big part of what forgiveness means is actual healing. And as long as we keep picking at the scab and reopening the wound, we're not going to receive the healing from God of that wound that was inflicted on us because we keep reopening it. But we look at it as if, if I let this go, if I just let this go, I'm doing that person a favor, and I don't owe them any favors. Right?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9266.44,"end":9266.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9267.72,"end":9403.49,"speaker":"Fr Stephen De Young","text":"And so I don't want to let it go. Right. And reality check, this person who you just had these feelings about does not know that you had those thoughts or feelings. And I bet if you went and told them, they wouldn't care. So you're not doing anything to them. By holding onto a grudge or holding on to anger or holding on to bitterness, you are doing absolutely nothing to that other person who you're angry at. You are only doing something to yourself. So my bishop has compared that to drinking poison and hoping the other person dies. Yeah, that's not how that works. So the reason God wants you to let go of those things is not that he doesn't care about how you were hurt. It's not that the way you were hurt was okay or fine. It's not that you're ever going to forget it happened. It's because he doesn't want to see you keep hurting yourself. You were hurt once by that person, you were injured once by that person, and now you're reopening it, you're hurting and re. Injuring yourself. That person may have peace in their life. You don't. That person may have love in their life and joy. You don't, because you're still doing this to yourself. That's why God wants you to let go of it. To let go of it so it can be healed and so you'll know you've forgiven that person. Meaning you'll know you've been healed from that wound they inflicted on you. When you can think about it without the anger and the resentment and the bitterness, when you could look back on it and not have those passions kind of well up within you. Right. So, yes, the fact that they're still welling up within you shows that there's still some healing that needs to happen. But you don't need that other person to do it. You can do that. You and God, with you letting go of it and God healing it."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9403.57,"end":9407.57,"speaker":"Fr Andrew Stephen Damick","text":"I think prayer for the other person is really the biggest thing in terms of learning to let go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9408.44,"end":9408.64,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9408.64,"end":9408.96,"speaker":"Fr Andrew Stephen Damick","text":"I think."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9408.96,"end":9414.12,"speaker":"Fr Stephen De Young","text":"And that's the way of doing it and just asking God to heal you from it. Asking God to help you learn from it and move on."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9414.12,"end":9429.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. All right, a couple more questions. This next one comes from Stephen, who is quite deliberately asking for the. For etymology to happen on the. On the show. So I. I can't help it, you know, but anyway, here's. Here's Stephen."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9429.32,"end":9430.6,"speaker":"Fr Stephen De Young","text":"That's your bailiwick."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9430.6,"end":9431.16,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9432.04,"end":9494.81,"speaker":"Audience Member","text":"Hello, my name is Stephen, and I am in Bozeman, Montana, recently baptized in the Orthodox church. And in my journey, I've been thinking a lot about the word grace and my history and Protestantism. Grace typically meaning something like solely, just unmerited favor, similar to mercy, perhaps. And the difference of moving into the idea that grace is an energy of God, you know, God himself. And I've been thinking about, like, how we've used that word in the past as Protestants and how that's been used in the past for human history. And I got it thinking about this colloquialism of abuse of grace in terms of, like, the king graced us with his presence. And I was hoping to enter into the etymology corner and hear if there's any more historic connection to the idea of grace being an energy of God rather than just something else. All right, Etymology with Father Andrew."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9495.54,"end":9700.2,"speaker":"Fr Andrew Stephen Damick","text":"There we go. I haven't played that version of the theme in a long time. Yes. So, I mean, there's a couple of different words in play here. There's the Greek word charis, which gets translated as grace. And it's got a range of meanings to it from the ancient, the modern. It seems like the earliest versions that they come. It comes from the root, the same root as the verb hero, which means, you know, be happy. That's the kind of the basic sense. But then you also have the. Which is that greeting, which gets translated as rejoice, sort of hail. But then also, like in the noun form, it can mean beauty, elegance, charm. It can mean grace in the sense of being graceful, like we talk about it in English. But it can also have this idea of a favorable disposition towards someone else. It can also be gratitude or thanks. And literally the word can mean a gift as well. So if someone is charismatic, literally they are gifted, right? So it can mean gift. And also there's even a sense in the Greek of it can mean an influence as well. So all of that stuff is there. I'm not. If, if Greek has this idiom of to grace with presence. I couldn't find that in English, though. That phrase, this colloquialism comes from the late 16th century. And it comes that. That version of it comes from a 13th century form of it that comes into English from. From French. And, you know, the English word grace ultimately comes from the Latin grazia. And it's, it's, you know, comes from thanks or, you know, but also, you know, showing favor once again or eventually, like in the mid 15th century, you can have the idea of giving grace to something or lending grace to something. So then that's where then you get the sense of gracing with your presence. And it usually means someone of higher status doing a favor for people in lower status by being with them. It seems like in modern English, it's largely used almost sarcastically, like thank you for gracing us with your presence. So there's not, in the theological usage of God, of grace being God's presence with us, there is not a direct connection with that English colloquialism. However, I think it's perfectly valid to use that as a way to explain what orthodox theology means by grace, that it is the presence of God with us. But it also includes all of this other idea of, you know, gift of beauty and elegance and all these things, I think, all together. So, yeah, I mean, the. As with anything, you don't want to look at the etymological roots and say, this is what this means, because this is what etymologically, historically it meant. But I think you can use all of the. This cloud of meanings within the Etymologies of both the Greek and the English as a way to talk about what grace means to us theologically, even though, you know, theologically has this in some ways a more precise kind of meaning. Yeah, that's what I've got on all that. So, Father, what. What. What might you want to. To add to say about grace?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9700.68,"end":9702.96,"speaker":"Fr Stephen De Young","text":"That's why I'm not. Yeah, that's fine with me."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9702.96,"end":9709.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's fine with you. Okay, that's good. How about that? Write this down, everybody. He just."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9709.92,"end":9717.45,"speaker":"Fr Stephen De Young","text":"Yeah, no, I mean the. You asked me about English etymologies. Like, again, language came into existence long after I was born with the world, so."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9718.97,"end":9736.49,"speaker":"Fr Andrew Stephen Damick","text":"Well, there was proto Germanic. Although, did you know, did you know that Chrysostom, as a way to try to convert Aryans back to orthodoxy, actually had Gothic liturgies done in Constantinople? Because there are a lot of Gothic Aryans there."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9736.81,"end":9737.84,"speaker":"Fr Stephen De Young","text":"Yeah, don't."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9739.36,"end":9740.08,"speaker":"Fr Andrew Stephen Damick","text":"Pretty cool."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9740.08,"end":9742,"speaker":"Fr Stephen De Young","text":"Anyway, I'm not going to say that on the air."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9742.24,"end":9742.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9742.96,"end":9746.52,"speaker":"Fr Stephen De Young","text":"I was about to say, don't look something up, and then I'm like, wait, everyone will look that up."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9746.52,"end":9768.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Don't think of pink elephants. Yeah, yeah. Okay. All right, we have one. One last question on this all pre recorded Q and A episode of Lord of the Spirits. So this is from Nicholas, who has some ideas for an animated production. Father's Bless Nicholas from St Nicholas in."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9768.43,"end":9815.02,"speaker":"Audience Member","text":"Portland, Oregon, here with a shout out to all my fellow parishioners listening and a random idea to run by you. Random Pascha is the feast of feasts, but we have no Rankin Bass style family special for the occasion. Imagine an illustrated short film telling the harrowing of Hades straight from the Gospel of Nicodemus with our hymns woven in. But here's the fun part. Who would voice Satan? Jack Nicholson out of retirement going full joker. Christopher Walken's strange cadence and unpredictable menace. Might there be a role for friend of the show, Bart Ehrman? And who should sing the Paschal hymns? Perhaps we could make this a personal Jesus jam with Dave Gaughan from Depeche Mode. Are you as ready as I am to see a Harrowing of Hell animated special? Fathers, I'd really love to hear your thoughts."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9816.79,"end":9821.59,"speaker":"Fr Andrew Stephen Damick","text":"What do you think, Father? Yeah. Who should be the voice of Satan in an animal? I don't know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9821.59,"end":9828.55,"speaker":"Fr Stephen De Young","text":"Gilbert Gottfried is dead. So Roseanne Barr. Wow."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9832.39,"end":9839.19,"speaker":"Fr Andrew Stephen Damick","text":"That'S an idea. I was gonna say if we could pick dead people, I mean, I could go full serious and say Christopher Lee. Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9840.55,"end":9847.85,"speaker":"Fr Stephen De Young","text":"See, you don't want to go that way. I would pick Random person with very mellow, nondescript voice."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9847.93,"end":9852.97,"speaker":"Fr Andrew Stephen Damick","text":"Although if you're going to go really distinctive, like you suggested with Gilbert Gottfried. How about Joe Pesci? Huh?"}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9853.85,"end":9855.61,"speaker":"Fr Stephen De Young","text":"Yeah, he's retired, too."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9855.85,"end":9864.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a good idea. And I think Rankin Bastard. Although Rankin Bass still exists. But they have. They're not in their final form."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9864.89,"end":9867.53,"speaker":"Fr Stephen De Young","text":"Mel Gibson might beat you to the punch. He's got that."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9868.17,"end":9870.65,"speaker":"Fr Andrew Stephen Damick","text":"I know. I'm very. I'm very."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9870.65,"end":9872.33,"speaker":"Fr Stephen De Young","text":"He's turned it into two movies now."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9872.33,"end":9873.65,"speaker":"Fr Andrew Stephen Damick","text":"I'm very leery of this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9873.65,"end":9876.67,"speaker":"Fr Stephen De Young","text":"How could that go wrong? The Hobbit, Right."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9878.67,"end":9885.23,"speaker":"Fr Andrew Stephen Damick","text":"See, I haven't said. This is the first time in this whole episode I've said right. As far as I know. So I saved it to the very end."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9887.23,"end":9889.43,"speaker":"Fr Stephen De Young","text":"You probably said it 83 other times. It didn't even."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9889.43,"end":9896.51,"speaker":"Fr Andrew Stephen Damick","text":"Just didn't remember. That's true. That's the way it goes. So. Well, it's a good idea. Nicholas, let us know when you put together your production company to make this."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9896.51,"end":9898.55,"speaker":"Fr Stephen De Young","text":"You compete with Mel Gibson, though? I don't know."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9898.55,"end":9905.33,"speaker":"Fr Andrew Stephen Damick","text":"I could be done. I mean, you know, not every set of a contest has to come out front. In fact, most of them don't."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9905.33,"end":9907.41,"speaker":"Fr Stephen De Young","text":"I don't know. He was on Mount Athos. He might be."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9907.49,"end":9908.25,"speaker":"Fr Andrew Stephen Damick","text":"That is true."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9908.25,"end":9917.65,"speaker":"Fr Stephen De Young","text":"Did he get some extra hocus with an empty chair? Why be communed with an empty chair like that? Dog don't hunt."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9918.21,"end":9918.93,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9919.01,"end":9921.25,"speaker":"Fr Stephen De Young","text":"We got our own chairs and we got people sitting in them."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9921.89,"end":9954.47,"speaker":"Fr Andrew Stephen Damick","text":"Lots of Stacy at Hillandar Monastery. Right, so that's our soda for today. Thank you, everyone. Thank you very much, everyone, for listening. Next time it's going to be all Q and A, but all live. So definitely make sure you call in and we want to hear from you. You can also email us, though, @lordofspiritsancientfaith.com you can message us at our Facebook page. You can leave us a voicemail, as all these people did@speakpipe.com LordOfSpirits and if you've got basic questions about Orthodox Christianity or you need help to find a parish, go to orthodoxintro.org."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9956.32,"end":9966,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. As I'm closing in, imposing on your slumber, you call on me as bells begin to chime."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9966.72,"end":9981.45,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can follow our page. You can also join our seven plus thousand strong discussion group and leave reviews and ratings in all the places and make sure that you share this with a friend."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9982.41,"end":9993.05,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to h faith.com support and help make sure we and lots of other AFR podcasters stay on the air hammering the nails into a sacred coffin. You call on me for powers Clandestine."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":9994.17,"end":9996.65,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night, and may God bless you all."}
{"episode_id":"LOS - #122 - 2025-08-19 - Pantheon and Pandemonium XVII Asynchronous Q&A August 2025","start":10003.37,"end":10040.6,"speaker":"Audience Member","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power, and rich in and wisdom and strength, and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
