{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1.12,"end":65.69,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":67.05,"end":156.32,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, all of you giant killers and dragon slayers. You are listening to Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855- AF-RADIO. That's 855-237-2346. And our very own Matush Kha Trudy is taking your calls tonight, which we're going to get to in the second part of our show. It's our annual Halloween special. It's that beautiful night on the podcast when everyone thinks we're going to weigh in on whether trick or treating is okay or whether you should do trunk or treat or harvest festivals in the church parking lot, or whether Halloween is secretly pagan, but instead we talk about mocking and beating up demons because that's what Christianity has always done. So whether you utterly reject Halloween as all the work of the dark powers or celebrate it as their defeat, one of the themes that we see connected with Halloween is the theme of madness. And that's what our show is about. Tonight we're going to be talking about how insanity is depicted in ancient sources, the transformation of human beings by insanity, and whether there is any discernible difference between mental illness, divine madness and demonic possessions. So my first question for you, Father Stephen, because it's always the big slow pitch at the beginning, is whether it's actually possible to experience what Freddie Mercury sings in Queen's 1991 single, I'm going Slightly Mad."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":157.92,"end":188.95,"speaker":"Fr Stephen De Young","text":"That may be possible, however, when it Comes to madness. Tonight, we're going to go one step beyond and not just slightly mad, we're going whole hog. And because it won't fit in later, and you mentioned weighing in on trick or treating, I feel like I need to give to our audience, especially the late teenage, maybe even into college age members of our audience, my trick or treating cheat code."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":189.19,"end":190.31,"speaker":"Fr Andrew Stephen Damick","text":"All right, here we go."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":190.79,"end":262.18,"speaker":"Fr Stephen De Young","text":"So this is the trick or treating cheat code. Here's what you do. So this year it will be easy because Halloween is on a Monday. So which means you could do this Tuesday morning. You need to do this on the first weekday morning after Halloween. You go to a well to do suburban area of your town. You go there about 10, 10:30 in the morning, right. Go door to door, say trick or treat when they look at you weird, right? You say, you give an excuse. You say, I had to take my, my kid brother or sister trick or treating yesterday. I didn't get to go. Whatever you want to say, whatever your conscience will allow. But here's what happens. The housewives who are at home do not want the leftover candy in their house. And therefore you will receive without having to wear a costume, without having to engage in any effort, whole bags of candy."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":263.38,"end":264.58,"speaker":"Fr Andrew Stephen Damick","text":"I feel like you've done this."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":265.22,"end":282.61,"speaker":"Fr Stephen De Young","text":"I have absolutely done this. Not recently, but it works. This is the cheat code for trick or treating. So to all of you high school and college age listeners, I give this to you free of charge. I'd ask only that you in turn pass it on to the next generation."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":283.57,"end":297.97,"speaker":"Fr Andrew Stephen Damick","text":"I've always wondered though, like, what would happen, I mean, because I'm always interested in getting weird looks from people. What would happen if we went like, if orthodox went trick or treating on the eve of our own All Saints Day, which would be like what, in June?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":298.93,"end":302.37,"speaker":"Fr Stephen De Young","text":"Or just what, you know, October 31st on the old calendar."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":303.33,"end":307.28,"speaker":"Fr Andrew Stephen Damick","text":"It really? Really? Yeah. Wait 13 more days. Hey everybody."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":308.56,"end":319.52,"speaker":"Fr Stephen De Young","text":"See then the old calendar Western, right? The trick is totally a thing. Yeah, yeah. But the morning after, that's the trick."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":319.68,"end":320.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":322,"end":330,"speaker":"Fr Stephen De Young","text":"So, but now, so tonight, because last year was our first edition, was the monster Manual."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":330.4,"end":330.96,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":332.09,"end":369.86,"speaker":"Fr Stephen De Young","text":"Tonight is our second edition. So it's the Monstrous Compendium. And this is apropos not only because it's the second edition, but the old heads out there will know that when the Monstrous Compendium was originally released, it was a three ring binder. Oh, that's right. Into which loose leaf supplementary pages were placed. Yeah. As you bought expansions. And what we're going to be talking about tonight is actually a collection of loose leaf pages taken from last year's episode."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":370.02,"end":370.7,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":370.7,"end":372.66,"speaker":"Fr Stephen De Young","text":"That were never broadcast because."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":372.74,"end":398.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because last year, I mean, we're not exactly known for going short. Although I'm kind of hoping that I can get home a little bit, a little bit earlier tonight because I have to get up very early. But yeah, I think three hours are close to that last year and yet we had another whole act worth of material. Right. So that's kind of what we're doing this time."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":398.85,"end":409.41,"speaker":"Fr Stephen De Young","text":"Yes, yes. So this is the supplement that we are placing in a new three ring binder to deliver it to you tonight. In an incredible strain on the metaphor."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":409.74,"end":413.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now it's just PDFs. Everybody just has bootleg PDFs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":415.5,"end":469.2,"speaker":"Fr Stephen De Young","text":"Not in my day, anyway. Old man yells at clouds. But so as mentioned, we're going to be talking about madness and mad men and mad women, because we're not sexist. And how that was seen in the ancient world, how that's been seen historically, examples of those trends that we see in scripture, we're going to focus on one major biblical example and then what that means in terms of our experience in the church and so in the ancient world. And I say ancient world now because this goes beyond the ancient Near East. This is pretty much. Pretty much everywhere, right? Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":469.2,"end":469.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":470.44,"end":561.82,"speaker":"Fr Stephen De Young","text":"The depiction of the madman or the wild person is that that person is treated not just as being mad or outside of the regular social order, but as also having some kind of connection to the spiritual or the divine. Right. And we see kind of the. The polarity of people who are sort of set outside the social order through a relationship with the divine. I say polarity because there's two figures, right, in the relationship in the Epic of Gilgamesh, between Gilgamesh and Enkidu. Right? So Gilgamesh sort of stands outside, in his case, sort of above the regular social order. Even of Uruk, where he's king by virtue of the fact that we're told he is 2/3 divine. Right. He is 2/3 APKALLU. Right. He's a giant for those who get excited about such things. Right. So that places him as a sort of God king. Right. His peers are not even like the noble people or the upper class of Uruk. His peers are the gods."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":562.62,"end":563.82,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":564.22,"end":630.34,"speaker":"Fr Stephen De Young","text":"He's above the human social order. Enkidu. Right. The wild man who's out in the wilderness also stands outside that social order. But on the other end, right. He's hairy all over. He's like a beast. Right. Or like an animal. Right. Despite being human. And that wildness is taken in the text to be just as much evidence of his quasi divine status as Gilgamesh's exalted position is of his. And the element of being disassociated from the social order is very important here. Right. So Aristotle, in his politics says this. He says that he presents human beings as political animals. Right. That we are just constituted, it's part of human nature, that we live in community."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":631.5,"end":640.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we political in the sense of, you know, government, necessarily just the police, you know, the city, the society."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":640.86,"end":686.12,"speaker":"Fr Stephen De Young","text":"Right. And that could be ordered in various different ways. But that we have these social structures. Right, right. Whether that's, you know, a nomadic clan that's biologically related or a Greek city state or whatever. Right. That, that we live in a community. Right. We live in a society. Right. So we have this kind of social order. And Aristotle even says in order to live outside of any kind of social structure, one has to be either a beast or a God. Right. That means you're either superhuman or subhuman. Right. For him. And that's what's. What allows you to live in that way."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":686.53,"end":691.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's otherness of a very deep, deep nature."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":692.05,"end":806.79,"speaker":"Fr Stephen De Young","text":"Right, right. And this kind of thing was seen to be a result, generally, as we mentioned, of some kind of contact with the divine which took different forms. Right. This could be in the context of an experience, this could be in the context of something ongoing. So, for example, Socrates, right, has a demon, he says, that dwells within him, Right. That whispers wisdom to his soul. And that divine spirit in his mind that is within him allows him to stand outside the social order of Athens and thereby critique it and question it. Right. He's not sort of fully part of it, he's not sort of immersed in it, but he's able to stand outside of it in order to ask questions about basic matters of justice and that kind of thing and that kind of idea. That, of course, is where we get the word genius. Right. So we've talked about before on the show when sacrifices were offered, whether it was incense or animal sacrifices or cakes or whatever. It was sacrifice that was sacrificed to the emperor in Rome. It was actually being sacrificed to the genius of the emperor, the divine spirit of the emperor. And there are statues of various emperors, starting with Augustus, where they're holding a sort of spirit that to us looks kind of like an angel, because it's a little winged spirit thing, like in their hand that is supposed to be their genius. It's Supposed to represent that spirit. Right. That divine spirit that causes the emperor to stand above and apart, but it also conveyed what we mean by genius."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":808.15,"end":813.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Very, very gifted in an almost. Almost superhuman way."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":813.59,"end":846.46,"speaker":"Fr Stephen De Young","text":"Right, right. And that allows them to rise above what is common and normal for humans. But just as we have the idea today of the eccentric genius, Right. Albert Einstein couldn't manage to comb his hair, Right. Had, you know, 20 of the same suit, because he didn't want to spend time thinking about what to wear. You know, we have. We have this image that's always been included there, too."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":847.5,"end":848.7,"speaker":"Fr Andrew Stephen Damick","text":"The doors look weird."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":849.39,"end":879.87,"speaker":"Fr Stephen De Young","text":"Part of this giftedness. Yeah. Part of this being able to stand apart from society also makes you at least a little off. Right. Like, it's that being separated from society creates this certain uncanniness and oddness when compared to the social structures. And so this gives us the idea of there being individuals in these different ancient cultures who are sort of touched by the gods. Touched being another word for that encounter."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":881.05,"end":881.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":881.65,"end":882.01,"speaker":"Fr Stephen De Young","text":"For."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":882.25,"end":887.05,"speaker":"Fr Andrew Stephen Damick","text":"For contact or in. Or in old Southern American English, touched."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":887.37,"end":887.85,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":888.01,"end":889.45,"speaker":"Fr Andrew Stephen Damick","text":"He's a bit. Or touched."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":889.53,"end":900.97,"speaker":"Fr Stephen De Young","text":"Touched in the head. Yeah, yeah, that's right. But one of the keys here is that that was not seen as a negative thing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":902.33,"end":902.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":902.89,"end":919.21,"speaker":"Fr Stephen De Young","text":"Even when. Even when we're talking about somebody like Enkidu, Right. Who's this wild man. Right. Enkidu, by virtue of being this sort of wild man who's been touched by the gods, that's what makes him worthy to be Gilgamesh's friend."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":920.57,"end":924.81,"speaker":"Fr Andrew Stephen Damick","text":"I mean, something. I have a whole new take on that TV show, Touched by an Angel."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":924.81,"end":925.29,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":926.17,"end":929.29,"speaker":"Fr Andrew Stephen Damick","text":"It's just. Sorry."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":929.77,"end":932.89,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, That's a Roma Downey one."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":933.36,"end":933.52,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":933.52,"end":953.92,"speaker":"Fr Stephen De Young","text":"That was always a weird title to me because it's not like Roma Downey just went around, like, touching people, touching people's faces in public or something. I mean, that would have been a very different show. She got arrested, probably. But so. So this wasn't considered a negative thing in any of these ancient cultures. In fact, these people would be sought out."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":954.56,"end":955.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":955.2,"end":959.62,"speaker":"Fr Stephen De Young","text":"For their wisdom, for their divine perspective. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":959.62,"end":962.3,"speaker":"Fr Andrew Stephen Damick","text":"Always a little, like, dangerous, right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":963.18,"end":965.26,"speaker":"Fr Stephen De Young","text":"Well, yeah, because they're off. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":965.34,"end":968.34,"speaker":"Fr Andrew Stephen Damick","text":"They don't fit, you know, quite know what you're going to get, but."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":968.34,"end":1032.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But, you know, if you can find them, you can hire the eight. No, you can find the, These, these people and potentially, because they stand at this remove. Right. They can advise you in a way that normal people can't. Right. And so we even see this and we're going to Talk more about this later in the show. We see this in. As we talked about in our episode on prophecy and prophets, we see this in some of the Old Testament prophets, and we see this with holy fools within the Christian tradition, that there is a tradition of those who have had a kind of contact with God, with Yahweh, the God of Israel, and that contact with him has removed them from the regular cultured society in a certain way."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1032.18,"end":1035.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're kind of not right in a certain."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1036.93,"end":1050.93,"speaker":"Fr Stephen De Young","text":"But the same dynamic pertains that they're seen to have wisdom, though, based on that and to be able to convey things. But we'll get into that more a little bit later. But now I'm going to say something nice about Michel Foucault."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1054.21,"end":1056.21,"speaker":"Fr Andrew Stephen Damick","text":"This might be the one nice thing there is to say."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1056.29,"end":1059.21,"speaker":"Fr Stephen De Young","text":"I don't know, there might be a."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1059.21,"end":1059.97,"speaker":"Fr Andrew Stephen Damick","text":"Couple of other things."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1060.61,"end":1066.21,"speaker":"Fr Stephen De Young","text":"Well, I was going to say he had a nice head of hair, but he was completely bald, so can't even do that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1069.5,"end":1069.74,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1072.06,"end":1096.86,"speaker":"Fr Stephen De Young","text":"So I don't want to spend too much time talking about Foucault himself. Right. But there's an early Foucault and a late Foucault, and the transition from early Foucault to late Foucault involved him being in the California desert and taking hallucinogenic drugs. And I know we have some listeners who are fans of psychedelics, but actually late Foucault is worse."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1097.19,"end":1098.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't do drugs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1098.35,"end":1154.9,"speaker":"Fr Stephen De Young","text":"Late Foucault is worse than early Foucault. So the psychedelics did not help him. That's but one of the first. We're saying about him, one of the first majorly important things that Foucault wrote, and you can see how this would fit into his kind of post structuralist project was called Madness and Civilization, A History of Insanity in the Age of Reason, which basically is a history of the concept of insanity or madness. Right. Sort of in the Western world, especially focusing on Western Europe because he was French. And what's interesting about this is he kind of constructs a genealogy of the idea of madness and how the way in which people view madness and insanity and then mental illness, how that has changed over time."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1155.3,"end":1159.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And how certain social construct element to the whole thing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1160.5,"end":1161.58,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1161.58,"end":1161.94,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1161.94,"end":1177.3,"speaker":"Fr Stephen De Young","text":"That what it meant to be mad in ancient Greece, what it meant to be mad in medieval France, what it meant to be mad in early modern England, and what it means to be mentally ill today are not the same thing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1177.91,"end":1178.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1178.71,"end":1270.07,"speaker":"Fr Stephen De Young","text":"Even though we're using similar terminology. So he, he talks about, he starts by talking about, by talking about what we were just talking about how in the ancient world this was seen as this spiritual or metaphysical reality. Right. That, that people saw someone who was outside the social orders being, having some kind of special contact with the gods. Right. And that it was not a negative thing. But then he shows how as we get into the medieval period in Western Europe, how insanity becomes, and madness becomes a socio political category where someone who is opposed to some element of the current social order or unable to adapt to it, or unwilling to adapt to it, or even who just is a political dissident against a particular king or noble, that person gets branded as insane, that person is mad because they won't conform to the current social structures and they're put into the early asylums. They're essentially imprisoned at that point in history. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1271.11,"end":1344.51,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's interesting to think about. I'm reminded now of. So as you know, from my background in theater, I'm an aficionado of some really obscure bits of theatrical history. And one of them is an, I think it was late, was it late 60s, early 70s show called Anyone Can Whistle, which had the late, now late Angela Lansbury in it. So when she died, everyone's like, oh, Murder She Wrote. And I'm like, oh, anyone Can Whistle. Like it lasted like three days on Broadway. It was super unpopular. But anyway, the conceit behind the show is there's a small town and there's an insane asylum in town and somehow the gates are left unlocked and so all the insane people come out and begin to mix with everybody else and no one's actually quite sure who's insane and who's not. Right. Before it was, well, those are the people in there who are imprisoned. It's interesting to think about that. We lock these people up, it's basically a prison sentence. And yet as you said, sometimes they're just sort of political dissidents or whatever, that there's not necessarily something essentially different about them, you know?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1345.15,"end":1349.95,"speaker":"Fr Stephen De Young","text":"Right, right. And, and that is, by the way, that's not just something that happened in the medieval period."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1350.19,"end":1350.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1350.91,"end":1387.85,"speaker":"Fr Stephen De Young","text":"There have been various political regimes even up to the present time that have used insanity as an excuse to lock up political dissidents. Yeah, right. They haven't actually committed a crime. Right. So they use insanity as the label to do that. Sort of the one institution that you have in medieval Western Europe that kind of preserves some of the earlier understanding of madness is the king having a fool."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1388.33,"end":1403.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is big in Shakespeare to Bring it back to theater. You know, various kinds of fools in Shakespeare's plays, some who are, they're all kind of funny, but some are mean, some are happy, some are just deeply weird."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1404.62,"end":1410.78,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. This is the person who, because they're a fool, they can kind of say what they want."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1411.1,"end":1422.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And often they're the truth teller to the king. He's the one person in the room who can actually say that kind of stuff. And the king may listen to. Although there are various fools throughout history."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1422.62,"end":1425.71,"speaker":"Fr Stephen De Young","text":"Who, you know, cross went too far."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1425.87,"end":1434.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. But the institution is that it's this truth telling, you know, figure who can kind of say whatever and not get in trouble."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1435.31,"end":1461.25,"speaker":"Fr Stephen De Young","text":"Right, right. And that, and that's sort of a social construction there that preserves that earlier view of the fool, the madman. Right. Of madness. This also became a tool used well into the 20th century. Right. Against women. Right. So the word hysteria comes from the word for woman."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1461.25,"end":1462.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1462.53,"end":1483.28,"speaker":"Fr Stephen De Young","text":"For womanhood. And if you look at, you can go online and find these, the Trans Alleghenian Saint asylum is a good example. And you look at the people in the 19th and early 20th century who were locked up there and you'll find a ton of women and the mental illness for which they were put into this asylum will just be listed as like woman troubles."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1484.56,"end":1497.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Literally hysteria. Because I mean, to be hysterical, you know, it was decided that had something to do having to do with having a uterus, you know, like the word hysterectomy."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1497.08,"end":1498.12,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1498.12,"end":1499.36,"speaker":"Fr Andrew Stephen Damick","text":"To have it removed. Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1499.76,"end":1531.89,"speaker":"Fr Stephen De Young","text":"And so the, the idea there was that any woman who wasn't willing to conform to the particular roles of whatever culture they were in that she was supposed to conform to could end up in an asylum. This is before no fault divorce. It was actually very difficult for a man to divorce his wife, but it was actually easier for him to have her put in an asylum to get a divorce by just alleging things like moodiness. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1532.45,"end":1532.93,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1534.05,"end":1574.46,"speaker":"Fr Stephen De Young","text":"So it ain't right. But, but you can see how their madness has become something very different. Right. It's now become this sociopolitical category that's used to deal with societal dissidents. You're. You're not part of our societal structures. And it's not that that's good anymore. That's now bad and you're now dangerous and so you need to be confined. Right, right. And then this idea sort of segues. There's not like a clear cutoff point, but it segues into the modern idea of mental illness."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1574.94,"end":1575.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1575.74,"end":1580.06,"speaker":"Fr Stephen De Young","text":"Right. Where it becomes Sort of medicalized, Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1580.22,"end":1584.87,"speaker":"Fr Andrew Stephen Damick","text":"Looking for chemical, material, kinds of causes."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1585.67,"end":1593.27,"speaker":"Fr Stephen De Young","text":"Yeah. And if you look at the early, quote, unquote, medical treatments, they're very barbaric. Right. The early 20th century, people start doing lobotomies."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1593.59,"end":1594.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Shock treatment."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1594.95,"end":1657.59,"speaker":"Fr Stephen De Young","text":"Shock. Right. But that's an attempt to try to at least quasi medicalize this. Right. And make it a mental illness. So you have someone who is a sociopath, they are sick in a way that means that they can't operate within society. And so they need to be isolated from society. And so instead of asylums, we have mental hospitals. Right. And that becomes medicalized. But so this shows us, Right. Looking at this thing that Foucault kind of charts, this shows us that the whole idea of madness, that whole category, madness or insanity or whatever term we want to use, that that's this fluid category, Right. It doesn't just meet. Refer to one thing throughout history. Right. Or one type of person. And a person who would be considered mad in one era might not be in another."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1658.79,"end":1659.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1660.07,"end":1743.28,"speaker":"Fr Stephen De Young","text":"Or even in different. In different cultures and different places in the same era. Right. What. What would be considered mad in one place might not be right in another. And so we have this. This sort of fluid concept. But where the fluidity comes in. Right. The constant behind all these definitions is that that madness or insanity is always over against the social constructions of that culture at that time. So there's a set of social constructions, political, economic, religious, et cetera, et cetera, et cetera. Right. That a person is living within, in that culture, in that society. And the constant through time is that the people who don't fit within that either because they can't or they aren't willing to. Right. They're the ones who get the label mad or insane. And we can. When you chart, as they've been doing in modern times, charting rates of mental illness, we can see that that rate of mental illness fluctuates."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1743.76,"end":1750.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Why is it that some periods seem to have more people who are mentally ill than others?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1751.37,"end":1756.65,"speaker":"Fr Stephen De Young","text":"Right. And that's because there are societal shifts."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1757.53,"end":1758.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1758.17,"end":1764.53,"speaker":"Fr Stephen De Young","text":"With which people are trying to. Are trying to compensate and."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1764.53,"end":1764.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1764.81,"end":1765.69,"speaker":"Fr Stephen De Young","text":"I mean, and live."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1766.01,"end":1784.13,"speaker":"Fr Andrew Stephen Damick","text":"As I say, like, on the one hand, it's, as you said, people trying to compensate. Right. But on the other hand, I would also say. And maybe this is just another angle from. To describe the exact same thing as society shifts. People who used to have just been sane are now considered to be insane because they're not like everybody else."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1784.69,"end":1791.09,"speaker":"Fr Stephen De Young","text":"Right. They're not able to adapt and Conform. Yeah, to the new. To the new state of things. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1791.09,"end":1824.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, like, I'm reminded of Brave New World by Aldous Huxley, where you've got this character of John the Savage, who is the most sort of normal person in the book, and he speaks in Shakespearean English, which is lovely because that's where he learned English. And yet he's considered to be a savage by all these people who are living this very kind of anesthetized pleasure life. You know, he's the deeply weird one and has to live on some kind of reservation because he's not like them."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1824.67,"end":1829.31,"speaker":"Fr Stephen De Young","text":"Right, right. And that's portraying exactly this. Right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1829.31,"end":1829.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1830.35,"end":1887.27,"speaker":"Fr Stephen De Young","text":"Um, yeah. And. And this is something that. That, that charts across the board. There are parts of the country now, Right. Where there's a huge rise in. In depression and mental illness and people self medicating that illness with. With drugs and alcohol and things. Right. And when you dig a little deeper, the places where that's happening are places where there's been some massive shift, Right. In terms of how people are or aren't able to live. And they're struggling to. They're struggling to adapt. And there are people who are just better adapted to other ways of life. So there are not a lot of people who are adapted to thrive spending 40 hours a week at a cubicle farm. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1887.59,"end":1888.23,"speaker":"Fr Andrew Stephen Damick","text":"Make me."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1889.35,"end":1940.35,"speaker":"Fr Stephen De Young","text":"Yeah. And so when they try to live that way, they experience anxiety and all of these other things. Whereas you take some of those people and you have them, you know, doing farm work and they're fine. Like in that other context, in that other way of life, they're adapted to it and it suits them and vice versa. There's probably somebody who really thrives in a cubicle farm. I don't know who that person is, but there might be. But there can be going even farther than that. There can be an are and have been historically, there have been societies and cultures that have become dysfunctional to a point where. Where they only offer unnatural and inhuman ways of living."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1941.07,"end":1942.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1943.31,"end":1948.27,"speaker":"Fr Stephen De Young","text":"Unnatural and going against human nature. Inhuman in that no human can live that way."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1949.31,"end":1958.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I think probably a lot of people feel. And there are certainly days when I feel that our society is moving more and more in that direction."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1960.11,"end":1969.4,"speaker":"Fr Stephen De Young","text":"Yeah. Now we're just blackmailing everybody tonight. Happy Halloween. No, we're not. No, we're not."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1969.48,"end":1973.64,"speaker":"Fr Andrew Stephen Damick","text":"It's funny. It's funny. Sometimes people take us a little too literally."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1974.12,"end":1974.6,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":1975.48,"end":2006.62,"speaker":"Fr Andrew Stephen Damick","text":"Like, I don't want to pull the veil back too much here. You know, pay no Attention to the man behind the curtain. But just in case, because we did get a couple emails from people from our last Q and A show where we had, you know, we played a clip where someone was, you know, functioning in a deeply pilled way or if you wanted to find it, and they're like, is that the direction your show is going? Like, no, it was a joke, really. Just a joke. Anyway."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2006.78,"end":2010.22,"speaker":"Fr Stephen De Young","text":"Yes, but in this case, my unrelenting pessimism is real."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2010.7,"end":2019.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. But, yeah, I mean, but pessimism for the current construct of our society. Not pessimism in terms."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2019.8,"end":2020.28,"speaker":"Fr Stephen De Young","text":"No, no."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2021.72,"end":2022.4,"speaker":"Fr Andrew Stephen Damick","text":"The art."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2022.4,"end":2030.84,"speaker":"Fr Stephen De Young","text":"Semi. Yeah. I don't think there's any hope in princes and sons of men in whom there is no salvation."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2031,"end":2031.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2034.36,"end":2073,"speaker":"Fr Stephen De Young","text":"But Right, so you can come to that point, right, where, you know, just the society is so dysfunctional that it will make everyone in it. Right, yeah, dysfunctional. And. And this is not unrelated, Right. So it's not unrelated to what we talked about in the last episode, right. When, when we talked about there being a spirit, Right. That's behind and motivate. Motivating these societies. One of the things that identifies, as we talked about, a demonic spirit behind these things is that it is anti human."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2073.72,"end":2076.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's destructive. It tears people to pieces."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2077.24,"end":2107.89,"speaker":"Fr Stephen De Young","text":"Right. Demons hate and want to destroy humanity. Right. So when we talk about these anti human constructs, Right. That the societal constructs are built in such a way that it's inhuman. Right. We're also. That's the same. We're talking about the same thing as when we talk about there being this demonic spirit that's motivating and driving that society and that culture. Right. Just to give an example, okay. War is demonic."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2109.65,"end":2110.21,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2112.53,"end":2139.34,"speaker":"Fr Stephen De Young","text":"No human being can naturally thrive and adjust. Right. And find salvation through, you know, the desperate quest to not die, to save as many of your friends as you can and to kill an enemy. Right. I mean, people are thrust into that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2139.5,"end":2139.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2139.86,"end":2142.94,"speaker":"Fr Stephen De Young","text":"Into that inhuman situation and try to be heroic."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2142.94,"end":2149.42,"speaker":"Fr Andrew Stephen Damick","text":"You can. I mean, there are good things that can happen in the midst of that for sure, but it's in spite of it."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2150.23,"end":2150.35,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2150.35,"end":2150.79,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2151.35,"end":2151.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2151.99,"end":2157.67,"speaker":"Fr Andrew Stephen Damick","text":"That's because you acted in a way that's actually contrary to the spirit of that time and place."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2157.75,"end":2165.83,"speaker":"Fr Stephen De Young","text":"Right. You, you don't go. And anyone who's actually been to war will tell you you don't go there on purpose to try to find salvation."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2166.55,"end":2168.07,"speaker":"Fr Andrew Stephen Damick","text":"No, no."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2168.87,"end":2195.76,"speaker":"Fr Stephen De Young","text":"Right. God can bring good out of any evil, but that's not. Right. So you can create these, these inhuman situations and there are these Spirits behind it. Right. But this points to the limits that exist on disciplines of psychology and psychoanalysis."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2196.96,"end":2203.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they can't solve the big problem. They can just try to help you cope."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2204.37,"end":2215.81,"speaker":"Fr Stephen De Young","text":"Right. And this is from either side. Right. Whether we want to talk about it spiritually, like in the last episode. Right. Like psychoanalysts can't do exorcisms."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2216.05,"end":2216.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2216.77,"end":2228.29,"speaker":"Fr Stephen De Young","text":"Like they can't drive out that kind of spirit and invoke. Right. The Holy Spirit. This is the difference between confession and therapy."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2228.61,"end":2229.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2230.22,"end":2230.46,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2231.26,"end":2232.86,"speaker":"Fr Andrew Stephen Damick","text":"Not that we're saying therapy is bad."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2233.1,"end":2234.46,"speaker":"Fr Stephen De Young","text":"No. But it's a different thing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2234.54,"end":2235.9,"speaker":"Fr Andrew Stephen Damick","text":"But it has limits. Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2235.98,"end":2265.21,"speaker":"Fr Stephen De Young","text":"Yeah. It's a different thing. And it can't get to what confession gets to. Right. It's a different thing. Or from the other side, if we want to look at it from the side we've been talking about tonight. Right. There's this limitation where if I'm doing counseling, I have a person sitting in front of me who I'm trying to counsel. But I can't change all of the social structures that that person is forced to interact with on a daily basis."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2265.61,"end":2266.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2267.45,"end":2289.46,"speaker":"Fr Stephen De Young","text":"I can only try to help him adapt. And depending on how inhuman those structures are, it may be impossible for him to fully adapt or her. Right. It may be impossible. So, yes, therapy, counseling, useful but limited. They're useful within a sphere."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2290.1,"end":2290.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2290.5,"end":2306.66,"speaker":"Fr Stephen De Young","text":"They can't replace the sacraments and they can't replace some other things that we're going to talk about deeper into the show to actually address some of these, these, these social structures."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2307.06,"end":2307.62,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2307.86,"end":2338.32,"speaker":"Fr Stephen De Young","text":"But the key here is that regardless of how the way humans have structured their lives in these various different ways through human history, that this category of madness is a category that's used for those who stand outside of that order, however it's been constructed, however it exists, however it's functioning or dysfunctioning at the time."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2339.12,"end":2352.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, we're going to take a short break, and when we come back, we're going to talk about one of my favorite figures from the Old Testament, Nebuchadnezzar. So we'll be right back."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2353.2,"end":2369.5,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 851-AF-ADIO."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2374.7,"end":2422.24,"speaker":"Fr Andrew Stephen Damick","text":"Introducing a new book from Ancient Faith Publishing in the Whole Counsel of God, Fr. Stephen DeYoung gives an overview of what the Bible is and what is its place in the Life of an Orthodox Christian, correcting many Protestant misconceptions along the way. Issues covered include inspiration, inerrancy, the formation of the biblical canon, the various texts and their provenance, the place of Scripture within Orthodox tradition, and how an Orthodox Christian should read, study and interpret the Bible. The whole counsel of God is now available in paperback, ebook and audiobook@store.ancientfaith.com that's store.ancientfaith.com we're back now with the Lord."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2422.24,"end":2436.8,"speaker":"Announcer","text":"Of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2440.8,"end":2445.76,"speaker":"Fr Andrew Stephen Damick","text":"Man, I don't know who they got to do the voiceover for that ad, but he's great. Such inflection."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2446.66,"end":2447.7,"speaker":"Fr Stephen De Young","text":"You would think so."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2448.66,"end":2455.78,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he does exactly like I would do it. I'm just putting that out there. Welcome back."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2455.78,"end":2461.46,"speaker":"Fr Stephen De Young","text":"I was just. I was just sitting there thinking, I don't remember writing any of that, but I guess that's what's in the book."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2463.46,"end":2463.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2463.86,"end":2464.74,"speaker":"Fr Stephen De Young","text":"Automatic writing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2466.74,"end":2478.81,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. It's the second half, everybody. We're talking about madness of various sorts. It's our Halloween episode, and you're welcome to give us a ring at 855-AF-RADIO. That's 855-2372-346."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2479.29,"end":2481.77,"speaker":"Fr Stephen De Young","text":"It's 855-AFFIDIO."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2481.93,"end":2482.81,"speaker":"Fr Andrew Stephen Damick","text":"AFRAIDIO."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2482.89,"end":2483.93,"speaker":"Fr Stephen De Young","text":"Just for Halloween."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2486.57,"end":2487.97,"speaker":"Fr Andrew Stephen Damick","text":"It's true. Just."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2487.97,"end":2488.65,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2489.45,"end":2496.33,"speaker":"Fr Andrew Stephen Damick","text":"I look at that every time and I think that. But I'm like, no, don't say that. Because then people will think that there's an I in there where you go, that's okay."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2496.57,"end":2497.45,"speaker":"Fr Stephen De Young","text":"They'll figure it out."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2497.69,"end":2508.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Anyway, okay, so Nebuchadnezzar, or as it appears in some sources, Nabu Kodanozor."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2508.85,"end":2512.21,"speaker":"Fr Stephen De Young","text":"Yes. It's actually Nabu Keduru Utser."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2513.17,"end":2514.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which just rolls off the tongue."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2514.65,"end":2522.37,"speaker":"Fr Stephen De Young","text":"That'd be really technical. And that's why you get the pedants among us saying, actually, it should be Nebuchadrezzar, not Nezer."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2522.77,"end":2523.25,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2523.57,"end":2527.23,"speaker":"Fr Stephen De Young","text":"Right? Yeah. So those are people to be watched carefully."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2527.31,"end":2528.47,"speaker":"Fr Andrew Stephen Damick","text":"And there's an Uncle Nez."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2528.47,"end":2529.39,"speaker":"Fr Stephen De Young","text":"You just have to keep an eye."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2529.39,"end":2534.35,"speaker":"Fr Andrew Stephen Damick","text":"On them in that one episode of Veggietales. Just putting that out there."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2534.35,"end":2538.27,"speaker":"Fr Stephen De Young","text":"It's also the ship in the original Matrix movie, but."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2538.43,"end":2540.59,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true. Wow."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2541.79,"end":2546.99,"speaker":"Fr Stephen De Young","text":"So, yeah, Naboo Kaduru utser means Naboo who is one of the main gods."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2547.39,"end":2547.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2549.8,"end":2553.08,"speaker":"Fr Stephen De Young","text":"In Babylonian life, Naboo watch over my heir."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2554.44,"end":2558.6,"speaker":"Fr Andrew Stephen Damick","text":"My heir. Like H e I r. Yes. Yeah, yeah. Okay."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2558.6,"end":2563.32,"speaker":"Fr Stephen De Young","text":"Yeah. As in, like, his dad named him this because he wanted him to survive to adulthood and become king."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2563.72,"end":2564.2,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2565.56,"end":2614.52,"speaker":"Fr Stephen De Young","text":"He's actually Nebuchadnezzar the second, but his dad was not the first and was essentially the founder of the Neo Babylonian empire, which is the Babylonian empire that we see come and take Judah into exile in the Old Testament. And so we're only talking about, like the 6th century B.C. relatively recent by my standards, but we actually have a lot of stuff, a lot of inscriptions, including in the things he built in Babylon. He had his name stamped on every brick."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2616.68,"end":2620.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow. That's a little narcissistic."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2621.24,"end":2622.44,"speaker":"Fr Stephen De Young","text":"Little bit."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2623.16,"end":2627.56,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow. That just puts a whole other spin on this dude."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2627.96,"end":2639.37,"speaker":"Fr Stephen De Young","text":"And for old school DC fans or for people who have watched Black Adam already, Naboo, also a lord of order who lives within the helm of Dr. Fate."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2639.85,"end":2644.25,"speaker":"Fr Andrew Stephen Damick","text":"There we go. I'm not a big DC fan."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2644.41,"end":2686.94,"speaker":"Fr Stephen De Young","text":"Just gotta cover the ground. Cover the ground. Do this. Right. So there are a bunch of places where we see Nebuchadnezzar in the Old Testament. Daniel is one of the chief ones. And we're going to talk about in this second half a particular story regarding Nebuchadnezzar that made him the subject of a William Blake painting that was used, I know, as an image for this episode tonight. I think we also actually used it as the image for last year and then didn't end up getting to this material. So it made no sense."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2687.5,"end":2690.46,"speaker":"Fr Andrew Stephen Damick","text":"That's right. So that's why we recycled the pic."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2692.06,"end":2697.5,"speaker":"Fr Stephen De Young","text":"So that was the COVID of the Loose Leaf expansion for tonight."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2697.74,"end":2698.3,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2698.54,"end":2699.66,"speaker":"Fr Stephen De Young","text":"In the compendium."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2699.82,"end":2700.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2700.98,"end":2710.62,"speaker":"Fr Stephen De Young","text":"And so this particular story about Nebuchadnezzar and Daniel begins when Nebuchadnezzar has a dream."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2711.18,"end":2715.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So isn't this where he's telling it to Daniel?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2716.39,"end":2731.63,"speaker":"Fr Stephen De Young","text":"Right. Well, yeah. First he has the dream and he calls in. He calls in his regular court magician guys and they're like, I got nothing. So then finally he calls in Daniel to interpret the dream."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2731.63,"end":2739.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this is from Daniel, chapter four. And depending on if you're reading the Greek Daniel or the Hebrew Daniel, it."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2739.23,"end":2743.95,"speaker":"Fr Stephen De Young","text":"Might be different verses, but anyways, technically it's the Aramaic Daniel in chapter."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2743.95,"end":2858.99,"speaker":"Fr Andrew Stephen Damick","text":"Oh, excuse me. All right, all right, so here's how it goes. I, Nebuchadnezzar, was at ease in my house and prospering in my palace I saw a dream that made me afraid As I lay in bed the fancies and the visions of my head Alarmed me At Last Daniel came in before me, he who is named Belteshazzar, after the name of my God, and in whom is the spirit of the holy gods. And I told him the dream, saying, O Belteshazzar, chief of the magicians. Because I know that the spirit of the holy gods is in you and that no mystery is too difficult for you. Tell me the visions of my dream that I saw and their interpretation. The visions of my head as I lay in bed were these. I saw and behold, a tree in the midst of the earth, and its height was great. The tree grew and became strong, and its top reached to heaven, and it was visible to the end of the whole earth. Its leaves were beautiful and its fruit abundant, and in it was food for all. The beasts of the field found shade under it. And the birds of the heaven lived in its branches, and all flesh was fed from it. I saw in the visions of my head as I lay in bed. And behold, a watcher, a holy one, came down from heaven. He proclaimed aloud and said, chop down the tree and lop off its branches. Strip off its leaves and scatter its fruit. Let the beasts flee from under it and the birds from its branches, but leave the stump of its roots in the earth, bound with a band of iron and bronze amid the tender grass of the field. Let him be wet with the dew of heaven. Let his portion be with the beasts in the grass of the earth. Let his mind be changed from a man's, and let a beast's mind be given to him, and let seven periods of time pass over him. The sentences by the decree of the watchers, the decision by the word of the holy ones to the end. That the living may know that the Most High rules the kingdom of men and gives it to whom he will, and sets over it the lowliest of men."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2861.95,"end":2864.63,"speaker":"Fr Stephen De Young","text":"So that's pretty self explanatory, isn't it?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2864.63,"end":2874.27,"speaker":"Fr Andrew Stephen Damick","text":"Though we do have some fun Easter eggs in there for longtime listeners. Watchers. A couple of references to watchers."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2874.35,"end":2884.52,"speaker":"Fr Stephen De Young","text":"So, for example. Yeah, and well, and there's this reference. Right, right off the bat. Right. He calls Daniel by the Babylonian name he was given, Belteshazzar."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2884.76,"end":2889,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that bell at the beginning is baal, Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2889.96,"end":2902.12,"speaker":"Fr Stephen De Young","text":"That's the sort of Babylonization, the Neo Babylonian empire of BAAL from Sin. That's why he says called Belteshazzar after the name of my God."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2902.59,"end":2903.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2903.31,"end":2938.12,"speaker":"Fr Stephen De Young","text":"So that's the God who Nebuchadnezzar is worshiping. And this is why you may have noticed. Well, you may not have Noticed this yet? Unless you're, like, just super familiar with Daniel, but if you go and look at a lot of English translations, when he says to Daniel, in whom is the spirit of the holy gods? Is how we translate it. But it'll say, in whom is the spirit of the holy God? And in verse nine also, they'll have holy God instead of holy gods. So the word is Elohim, right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2938.12,"end":2938.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. The plural."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2940,"end":2967.61,"speaker":"Fr Stephen De Young","text":"So that could be Elohim being used to refer to God as it commonly is in the Old Testament, or that could mean gods. The reason why we're reading it as gods is because here in verse eight, Nebuchadnezzar says, you know, that he's named Belteshazzar after the name of my God, Right? So Nebuchadnezzar's God is Bell, Right. He doesn't consider the God of. Of the Jews his God."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2967.93,"end":2968.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2968.33,"end":2968.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2968.73,"end":2971.21,"speaker":"Fr Andrew Stephen Damick","text":"So he's. He's a pagan, Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":2971.61,"end":3112.94,"speaker":"Fr Stephen De Young","text":"So he would. He. At least at this point. Right. Maybe not so much in a little bit here, but that's at least right now he's gonna go. He is, Right. And so he is seeing Daniel when he says, in whom is the spirit of the holy gods? Right. And when he calls him the chief of the magicians, Right. He's seeing him as one of these people who's touched by the gods, Right. Who has this special relationship with the gods. And that potentially, at least for Nebuchadnezzar, means that he might be able to interpret these dreams. Right. Because as we've talked about before on the show, dreams are sort of the activity of the noose, Right? So this is. These are seen to be sort of spiritual realities. Right? And so if Daniel has this connection with these spirits, with these spiritual beings, they are more aware of these spiritual realities and can explain them and serve as a guide to them. Right. That's how Nebuchadnezzar is thinking about this. And so he has this vision then of. Of this tree that grows tall and strong and huge and fills the whole earth. Right. And Right. Which. Well, we'll just summarize it now. We'll get to the interpretation in a second. Right. Fills the whole earth. And. And then a watcher, Right. As Father Andrew mentioned for all you Book of Enoch fans, right, the term watcher to refer to a certain class of holy ones, a certain class of angelic beings. Here it is in the canonical scriptures. We're not making this up, even if you're not Ethiopian. And it's one of them who comes and announces that there is this sentence, there's this decree that this tree is going to be chopped down. Right. But the stump is not going to be removed. Right. And then there's kind of a mixing of the metaphor, because the tree is not going to have a man's mind, apparently it was a tree with a man's mind, and now it's going to have a beast's mind."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3113.18,"end":3124.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it just sort of flips at that point. It's tree it, it. And then it's, let him be wet with the dew of heaven. Let his portion be with the beasts. Yeah. Let his mind be changed."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3125.07,"end":3196.22,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, and the last thing to note is that at the end, right, this sentence is the decree. This is the decree of the watchers. The decision by the word of the Holy ones to the end of that is in order that. So that the living, all the living. Right. On earth, the people on Earth may know that the Most High rules the kingdom of men and gives it to whom he will, and sets over it the lowliest of men. Right. So this decision is presented as having been taken by the divine council. Yeah, Right. It's not just this angel does not just come and announce, here's what God says. Right. But he says, this is the decree of the council, obviously, over which God presides. And the purpose of this decree makes it very clear that the most high God who presides in that council is above the rest of it. Right, right. It's going to show who's in charge. So then Daniel is then able to interpret this dream."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3197.42,"end":3306.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So continuing on, this begins with, well, in some versions, verse 19, then Daniel, whose name was Belteshazzar, was dismayed for a while, and his thoughts alarmed him. The king answered and said, belteshazzar, let not the dream or the interpretation alarm you. Belteshazzar answered and said, my Lord, may the dream be for those who hate you, and its interpretation for your enemies. The tree you saw, which grew and became strong, so that its top reached to heaven, and it was visible to the end of the whole earth, whose leaves were beautiful and its fruit abundant, and in which food was for all, under which beasts of the field found shade, and in whose branches the birds of the heavens lived. It is you, O king, who have grown and become strong. Your greatness has grown and reaches to heaven and your dominion to the ends of the earth. And because the king saw a watcher, a holy One, coming down from heaven. This is the interpretation, O King. It is a decree of the Most High, which has come upon my lord the king, that you shall be driven from among men, and your dwelling shall be with the beasts of the field. Ye shall be made to eat grass like an ox, and you shall be wet with the dew of heaven. And seven periods of time shall pass over you till you know that the Most High rules the kingdom of men and gives it to whom he will. And as it was commanded to leave the stump of the roots of the tree, your kingdom shall be confirmed for you from the time that you know that heaven rules. Therefore, O king, let my counsel be acceptable to you. Break off your sins by practicing righteousness and your iniquities by showing mercy to the oppressed, that there may perhaps be a lengthening of your prosperity. Yeah. So he gets this offer of potential for repentance at the end. Do what you're supposed to do."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3306.83,"end":3318.47,"speaker":"Fr Stephen De Young","text":"Right? Right. So Daniel at first doesn't want to tell him, Right. Because as we mentioned, sometimes the fool goes too far, Right. And he doesn't know how Nebuchadnezzar is going to react. But he."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3318.47,"end":3323.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he says, you know, like, I hope this is actually about your enemies, but it's not."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3323.79,"end":3354.69,"speaker":"Fr Stephen De Young","text":"Yeah. But it's kind of about you. Yeah. And so, right. This is. This is him. He's grown strong. He's extended his power through the Neo Babylonian empire over the whole world. But he needs to learn something, right? He needs to learn something. He needs to learn that it is the most high God who rules over the world."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3355.09,"end":3355.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3355.89,"end":3402.69,"speaker":"Fr Stephen De Young","text":"And who gives authority within it? The person who. He wants to have it. And that's why he needs to learn that as verse 26 says, heaven rules not him. Right. And in order for him to learn that he is going to have this experience of being driven from men, not only is he not going to occupy this position atop. Right. The Babylonian empire adopt the social structures of his time, but he is going to be driven out from them and live like an animal. Right. But as you mentioned, Daniel concludes by saying, hey, this is the sentence. But you know what? If you were to repent now and learn this lesson now, then none of this would have to happen."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3403.33,"end":3409.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. But that's not the way it went down."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3409.44,"end":3410,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3410,"end":3446.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Because you get, you know, this is the next thing, Right. The next verse, all this came upon King Nebuchadnezzar. And skipping ahead a few verses, immediately the word was fulfilled against Nebuchadnezzar. He was driven from among men and ate grass like an ox. And his body was wet with the dew of heaven till his hair Grew as long as eagle's feathers and his nails were like birds claws, which, you know, if you look at that William Blake painting of Nebuchadnezzar, that's exactly what's depicted. It's this kind of almost werewolf sort of image, you know, the way we imagine a werewolf anyway."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3446.68,"end":3583.8,"speaker":"Fr Stephen De Young","text":"Right, right. And so we have to remember this is the Neo Babylonian empire, right? This is our, our latest and in some ways last really instantiation of Mesopotamian culture, self consciously harkening back to the original Babylonian empire, right, Of Hammurabi and the Amurru, right? This is, this is his self concept. And so essentially he goes from being able to see himself as Gilgamesh, right? This God king, this divine king who in some way stands over and above the social order with the other gods as his peers, to being more like Enkidu, to being this wild man out in the, in the wilderness, right through this encounter, he has right, with God mediated through these angelic beings. And so not only is the most high God not his peer, right? But even the watchers who pronounce this judgment are not his peers, even the angelic beings, right? And so he, from his perspective, right, the way the Assyrian and Babylonian empires essentially worked, it wasn't. They didn't have like a federal government then, like local governments in the different city states, right? Because they didn't have the communication abilities to do that. Right, right. So you still had kings in these different city states. Those kings were just vassals of the emperor of the high king. So in this case of Nebuchadnezzar. And so Nebuchadnezzar, when he made that king a vassal, which would happen in one of two ways. Either he'd conquer a city, right. Or be about to conquer a city and the king would cut a deal to become his vassal, or he'd conquer a city, kill the current king and install a vassal."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3584.12,"end":3585.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the new king."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3587.08,"end":3656.85,"speaker":"Fr Stephen De Young","text":"And when he did that, he would issue them a covenant, right? He would cut them a covenant and say, hey, I'm the king, you're now my vassal, right? Here's what I will will do for you, right? In terms of someone attacks you, I will bring my army to defend the city, etc, etc, here's what you're going to do for me in terms of taxes, in terms of tribute, whatever else. So how many soldiers you're going to field for my army and then here are the consequences if you break this. Here's what I'm going to do to you if you don't obey the agreement I've just given you. So it's not a contract. It's not a mutual agreement. It's given by the suzerain to the vassal. And so what God is here showing Nebuchadnezzar is that even though he's the king, he's the emperor, he's the suzerain, he's the high king, he is at best a vassal of God Most High. And there will be consequences if he does not live up to the responsibilities that he has as God's vassal."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3657.17,"end":3662.45,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Then this is the consequence. He becomes Beastman."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3663.01,"end":3665.25,"speaker":"Fr Stephen De Young","text":"Right. But this does not last forever."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3665.65,"end":3696.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes. No, it doesn't. You know, so, yeah, Starting with verse 34 again, depending on which version you're looking at. At the end of the days, I, Nebuchadnezzar, lifted my eyes to heaven and my reason returned to me. And I blessed the Most High and praised and honored him who lives forever. For his dominion is an everlasting dominion, and his kingdom endures from generation to generation. All the inhabitants of the Earth are counted as nothing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3696.96,"end":3697.22,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3697.37,"end":3741,"speaker":"Fr Andrew Stephen Damick","text":"And he does according to his will among the host of heaven and among the inhabitants of the earth. And none can stay his hand or say to him, what have you done? At the same time, my reason returned to me, and for the glory of my kingdom, my majesty and splendor returned to me. My counselors and my lords sought me, and I was established in my kingdom, and still more greatness was added to me. Now I, Nebuchadnezzar, praise and extol and honor the king of Heaven. For all his works are right and his ways are just, and those who walk in pride, he is able to humble. The thing especially about that last line is. I mean, that almost sounds like he could be right out of the Psalms. Right? That's the way he talks now. He talks like the Psalms. Yes."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3741.32,"end":3749.86,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so who knows in the age to come if we won't encounter Nebuchadnezzar there, huh?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3751.7,"end":3753.74,"speaker":"Fr Andrew Stephen Damick","text":"Don't go naming any churches after him just yet."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3753.74,"end":3762.74,"speaker":"Fr Stephen De Young","text":"Yeah, no, I'm not authorized to tell you to do that. Anyway, above my pay grade. But just. Who knows?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3764.34,"end":3764.74,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3769.14,"end":3794.28,"speaker":"Fr Stephen De Young","text":"Notice some things here that there has been a profound shift in his thinking. Yeah, right. Why is there all this about the Most High? That he lives forever. His dominion is an everlasting dominion. His kingdom endures from generation to generation. Right. Well, because Babylonian, Mesopotamian religion, there had been a series of succession myths."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3794.6,"end":3808.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. This is one of these things that is a mark of the Most High God, according to the Bible, about how he's different from all other spiritual beings. Who among the gods is like unto thou, O Lord?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3808.83,"end":3820.59,"speaker":"Fr Stephen De Young","text":"Right, right. And so the gods he used to worship. Right. Nabu, Marduk, Bel, these are gods who were born and who die."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3821.23,"end":3862.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think it's worth underlining once again that if you sometimes when people critique Christianity, they sort of treat it like it's basically saying the same things about its God that all the other religions say about their gods. But if you actually look at what those religions say about their gods, it's not on the same level. Like, just take what they say about their own religion. You know, setting aside the question of whether the claims are true or false, they don't actually make those kinds of claims about their gods. That they're from everlasting, that they're all powerful, that they're, you know, that's just not a thing. Just not even there. No paganism does that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3863.06,"end":3886.87,"speaker":"Fr Stephen De Young","text":"Right. And not only were they born and can they die, but whatever rule, whatever dominion, whatever kingdoms, they have come into being at a certain point and can fall to other gods. And so that's why he goes so far in verse 35 to say he does according to his will, not just among the inhabitants of the earth, not just among humans, but among the host of heaven."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3887.11,"end":3889.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's in charge amongst the gods."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3890.39,"end":3919.39,"speaker":"Fr Stephen De Young","text":"So he's saying there is as much difference between the most high God and the gods as there is between the gods and humans, effectively. Right. So he's had a profound shift here. Yeah. Right. And he's come to understand exactly the lesson he was supposed to understand, Right. That his kingdom and any power he has is delegated."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3921.31,"end":3930.43,"speaker":"Fr Andrew Stephen Damick","text":"And temporal. Right. Like the whole world of his empire is temporary, it's constructed, and it's going to fall apart."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":3931.23,"end":3999.22,"speaker":"Fr Stephen De Young","text":"Right, Right. And so what's happened here in terms of our overarching theme that we're talking about tonight? Right, because this is, you know, Nebuchadnezzar is driven mad, right, in order to learn this lesson, and that is that he is removed for a time from this entire social construction of the Babylonian empire. Right. From the whole cultural history of it, the cycle of feasts, the gods, all of that. He's removed from it. He's living as not even a human, let alone as a Babylonian. Right. He's completely removed from that. And what that allows is for him to be reoriented, right. To reality, to the reality of the cosmos. Right. To the reality of God's creation, to the reality of his human nature. And to come to really understand his place in the creation and in the cosmic order, in cosmic justice. And then once he understands that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4002.02,"end":4002.34,"speaker":"Fr Andrew Stephen Damick","text":"He."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4002.34,"end":4042.45,"speaker":"Fr Stephen De Young","text":"In this case, re enters those structures, but in a different way and in a way that who knows, maybe if he'd lived longer would have been transformative to those structures. But he didn't live that long after this and his son was a ne' er do well, so he had a fail son, as many great kings do. But this shows that he had to be removed from it in order to be reoriented and be able to approach it from another angle in a different way with a new wisdom and a new perspective. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4044.93,"end":4052.78,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that being said, we're going to go ahead and take our second break and we'll be right back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4053.42,"end":4069.42,"speaker":"Announcer","text":"Father Andrew Stephen Damick and Fr. Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF. RA."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4075.03,"end":4159.28,"speaker":"John Maddox","text":"Hi, I'm John Maddox, CEO of Ancient Faith Ministries. When my wife and I started Ancient Faith radio back in 2004, we did so with the understanding that the success and growth of this fledging ministry would be entirely dependent on the will of God, as expressed through the generous support of its listeners. As the station moved from our back porch to our basement to the state of the art studio in which it currently resides, we have never wavered from this commitment to keeping AFR a free resource for Orthodox Christians, depending only on listener contributions for its continued existence. We do not have gated content at Ancient Faith Radio requiring some sort of subscription fee, nor do we look to make a profit from the content we provide. That said, it does take a great deal of money for AFR to maintain its high standard of quality and keep up with the ever changing world of Internet radio. And as always, our ability to do so is solely reliant on you, the listener. Would you consider becoming a participant in the work of Ancient Faith Radio, partnering with us to bring the orthodox Christian faith to the modern world? Donate today by going to ancientfaith.com and clicking on Donate in the upper right hand corner. Thanks in advance for your generosity."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4163.2,"end":4179.28,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4180.86,"end":4185.74,"speaker":"Fr Andrew Stephen Damick","text":"Thanks. Voice of Steve. We're back now with the third half of Lord of Spirits. We're talking about."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4185.9,"end":4189.58,"speaker":"Fr Stephen De Young","text":"You know, I like the ragtime piano in that one."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4189.9,"end":4191.18,"speaker":"Fr Andrew Stephen Damick","text":"I know that was a little."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4192.3,"end":4194.62,"speaker":"Fr Stephen De Young","text":"I felt like Sting was about to happen."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4195.18,"end":4195.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4196.3,"end":4200.7,"speaker":"Fr Stephen De Young","text":"And I never realized it, but I think John Maddox is kind of a Paul Newman type."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4202.06,"end":4207.02,"speaker":"Fr Andrew Stephen Damick","text":"Huh? Huh. I'm gonna have to think about that one for a while. I think it might be true, though."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4207.19,"end":4208.47,"speaker":"Fr Stephen De Young","text":"Just dwell on that a little bit."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4209.27,"end":4211.27,"speaker":"Fr Andrew Stephen Damick","text":"Now suddenly I'm seeing him in Cool Hand Luke."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4211.91,"end":4214.15,"speaker":"Fr Stephen De Young","text":"Yeah. No man can eat 50 eggs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4214.63,"end":4233.27,"speaker":"Fr Andrew Stephen Damick","text":"Some men you just can't. Anyway, yes, so we're talking about divine madness. Actually, several different kinds of madness. And we just talked about Nebuchadnezzar or Nebuchadnezzor or Nebuchadrezzar or the longer version you said earlier."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4234.39,"end":4235.99,"speaker":"Fr Stephen De Young","text":"Nabu keduru utser."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4236.33,"end":4241.57,"speaker":"Fr Andrew Stephen Damick","text":"There we go. That would be hard to put on a license plate. I'm just, you know, for people."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4241.57,"end":4243.93,"speaker":"Fr Stephen De Young","text":"Most states at least. Yes, yes. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4244.89,"end":4249.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The Neo Babylonian Empire. That's available on your free license plate."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4250.25,"end":4262.49,"speaker":"Fr Stephen De Young","text":"But for the record, we're not talking about the all I wanted was a Pepsi, just one Pepsi and she wouldn't give it to me type of madness. Wow. Even though that will result in you being put in an institution."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4263.18,"end":4265.98,"speaker":"Fr Andrew Stephen Damick","text":"Wow. That's an old, old callback."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4268.22,"end":4271.58,"speaker":"Fr Stephen De Young","text":"So there are five people who got that, but those are my people."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4273.34,"end":4274.62,"speaker":"Fr Andrew Stephen Damick","text":"Call in, let us know."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4277.34,"end":4279.98,"speaker":"Fr Stephen De Young","text":"We don't need a bunch of calls that are just. I got that one."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4280.94,"end":4281.98,"speaker":"Fr Andrew Stephen Damick","text":"I caught that reference."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4282.62,"end":4284.54,"speaker":"Fr Stephen De Young","text":"Quick, send US Captain America GIFs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4284.7,"end":4285.98,"speaker":"Fr Andrew Stephen Damick","text":"We'll know what that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4285.98,"end":4287.42,"speaker":"Fr Stephen De Young","text":"Yes, that is acceptable."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4287.5,"end":4323.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, Right. So, yes, this is our Halloween episode. So we always talk about crazy stuff on Halloween. Our Halloween episode. And indeed, this time, we're talking about craziness itself. So. Yeah, yeah, yeah. What is the difference between madness and divine madness? Mental illness, demonic possession. Like, is there a way to test, to see, you know, what somebody's got? Then they need to go to the doctor, the exorcist, insane asylum. I mean, what do you. How do you. How do you. How do you know?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4324.22,"end":4371.95,"speaker":"Fr Stephen De Young","text":"Right? And this. I mean, and. And these questions come up on. On all sides, right? So in. In our culture, right, as we were talking about earlier in the first half, we now, right, We. We talk about mental illness, and we see this in. In sort of medical terms. And so this raises. And by medical, we mean, at least we're trying to be scientific in our approach to it, right? And sometimes we are. Sometimes maybe not so much still, but we're trying. And so this comes up on the one hand, right. How do you tell someone who is the contemporary equivalent of a fool for Christ in the Christian tradition from someone who is mentally ill? Because."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4371.95,"end":4372.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4372.31,"end":4386.75,"speaker":"Fr Stephen De Young","text":"Because I've encountered people. I was gonna say I've encountered someone who said they had a vision of me before they met me. I've encountered. You know, as a priest, this happens. Right. So you encounter people who say they've had visions."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4387.07,"end":4387.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4387.51,"end":4388.99,"speaker":"Fr Stephen De Young","text":"Say they've had experiences."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4389.39,"end":4442.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I. My favorite. Maybe. I don't know if that's the right word. I mean, no disrespect. When. When I was in seminary. You might have had to do this, too. I don't remember. Part of what we did as part of our seminary study was prison ministry, and there was a psych ward as part of the ministry. And there was one guy, I can't remember his name now, but he used to say to the priest who would come and visit, he would say, now, look, Father, I'm Jesus Christ and you are my servant, and so I have some things for you to do. And as far as we knew, this guy truly believed what he was saying. I mean, he would not be the first person to claim to be Jesus in the modern period. I think we have 100 of those every week, it seems like."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4443.71,"end":4489.07,"speaker":"Fr Stephen De Young","text":"Right, right. So we accept as orthodox Christians that there is such a thing as a fool for Christ. Also, there are a lot of people who might present themselves in religious terms, but who we would ultimately say are mentally ill. This is not wisdom coming from God, but this is a person who is mentally ill who needs certain types of help and assistance. Right. And then on the other side. Right. On the other side, you have. Because our contemporary society, we think about mental illness in this medicalized right and scientized way. Who will say, for example, that the examples of demonic possession in the Bible even are just mental illness?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4489.23,"end":4490.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4490.27,"end":4496.15,"speaker":"Fr Stephen De Young","text":"And ancient people were just primitive and dumb and didn't understand the concept of mental illness."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4496.15,"end":4499.31,"speaker":"Fr Andrew Stephen Damick","text":"And so, yeah, he doesn't need an exorcism. He needs a prescription."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4499.55,"end":4527.51,"speaker":"Fr Stephen De Young","text":"Right, right. And so how do you distinguish between someone who is mentally ill, someone who is demon possessed, or a demonized person? Right. Where is the problem? Something that's going to be solved by an exorcism and repentance. Where is it? I mean, repentance is always good, but where is it? Where do we not need an exorcism? And we just need sort of repentance and medication or what have you. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4528.07,"end":4530.55,"speaker":"Fr Andrew Stephen Damick","text":"Maybe just some therapy. Talk it out."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4532.32,"end":4554,"speaker":"Fr Stephen De Young","text":"So within this. Right. Mental illness is sort of the broader category. Right. Because mental illness is essentially the way we now talk about what used to be called insanity, what before that was called madness. Right. So it's this broader category that includes lots of different phenomena, lots of different things."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4554.08,"end":4571.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And this is like we started out with, you know, people who, for whatever reason, can't or won't function within or flourish within society. And we're, you know, with no comment about the origin of that. Like, it's just they can't or won't."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4571.21,"end":4572.97,"speaker":"Fr Stephen De Young","text":"Or whatever for a variety of reasons."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4572.97,"end":4573.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yes."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4573.53,"end":4573.73,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4573.73,"end":4575.17,"speaker":"Fr Andrew Stephen Damick","text":"There's lots of possible reasons."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4575.25,"end":4606.7,"speaker":"Fr Stephen De Young","text":"Unable to flourish. If it's severe, they can't even function. Right. In society the way it's currently ordered. Right. And so that's. We're using that as the broad category. Right. And so when we talk about someone who's a fool for Christ or a holy fool. Right. We're talking about a person who's not functioning within society as presently ordered due to an experience of God. Due to an experience, an encounter they've had with God which has set them outside of."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4607.58,"end":4608.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4608.38,"end":4616.04,"speaker":"Fr Stephen De Young","text":"Those societal structures so that they can sort of testify to it. Right. We'll get into that more in a minute."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4616.2,"end":4617.16,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4617.32,"end":4636.77,"speaker":"Fr Stephen De Young","text":"And when we talk about a person coming into my head, when we talk about a person who's demonically possessed. Right. We're talking about a person who's not functioning within society due to being controlled by an inhuman and or anti human spiritual force."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4637.25,"end":4640.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they've been touched by something else."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4640.93,"end":4643.89,"speaker":"Fr Stephen De Young","text":"That'S not God that is now controlling them."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4644.29,"end":4648.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's not even just having one experience. It's an ongoing thing."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4649.73,"end":4670.23,"speaker":"Fr Stephen De Young","text":"Right. And that's why they're outside. Right. So there could be any number of causes for someone being outside and unable to function within the social order. Two of those are what we would call someone being a fool for Christ or someone being demonically possessed. And then there are a whole array of others that fall into that. That would fall into the category of mental illness."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4670.55,"end":4671.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4673.35,"end":4721.48,"speaker":"Fr Stephen De Young","text":"So we talked previously in our episode about prophets and prophecy. We talked a little bit about this idea of the holy fool or the fool for Christ, because some of those characteristics we see in various Old Testament prophets. Right. So these people have an encounter with God, this prophetic call, and then based on that, they are removed from sort of society. So St. Elias, the prophet Elijah, right out in the wilderness, St. John the forerunner, likewise taking up his lifestyle. Ezekiel has visions and then wanders around Naked, not wearing any clothes, or like."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4722.04,"end":4725,"speaker":"Fr Andrew Stephen Damick","text":"Hosea with like, you know, his marriage."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4725.48,"end":4725.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4725.84,"end":4728.84,"speaker":"Fr Andrew Stephen Damick","text":"That's deeply weird. Deeply weird in that society."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4729.48,"end":4744.96,"speaker":"Fr Stephen De Young","text":"Right. And so they're sort of transgressing societal norms. They're not living within these societal structures. But the reason they're doing it is that this experience they've had with God has set them outside of it so that they can come and then testify to it. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4746.8,"end":4748.8,"speaker":"Fr Andrew Stephen Damick","text":"Corrective character that's going on."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4749.36,"end":4786.58,"speaker":"Fr Stephen De Young","text":"Right. They have to stand outside it to critique it, to question it. Right. To point out where it's gone wrong. And so when it comes to someone who might present themselves as a fool for Christ or might have some attributes that might cause you to wonder that if someone is presenting in that way, but the wisdom they're claiming to have from God, the testimony they're claiming to give is not of a sort of consistent character. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4787.06,"end":4791.22,"speaker":"Fr Andrew Stephen Damick","text":"Is not prophetic or it's not leading people to repentance."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4791.54,"end":4815.76,"speaker":"Fr Stephen De Young","text":"Right. Bringing people to repentance, applying the message of God. Right. Then that would be a case where we say, okay, this person is not functioning as a fool for Christ. This is a mentally ill person. Saint Cyril of Moscow is another famous holy fool who lived naked in Russia in the streets for several years and didn't die. So that was a sign of something."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4816.08,"end":4818.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it gets very, very cold."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4821.37,"end":4826.65,"speaker":"Fr Stephen De Young","text":"One episode, went and confronted Ivan the Terrible, hauled a big slab of meat."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4828.25,"end":4830.01,"speaker":"Fr Andrew Stephen Damick","text":"Wasn't that Basil the fool for Christ? Is it?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4830.01,"end":4831.61,"speaker":"Fr Stephen De Young","text":"That was Basil the fool for Christ. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4831.61,"end":4832.17,"speaker":"Fr Andrew Stephen Damick","text":"You're right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4832.17,"end":4849.69,"speaker":"Fr Stephen De Young","text":"That's Basil. Hauled the slab of meat before Ivan the Terrible, threw it front of him and said, take and eat. He said, I can. It's Lent. He said, then why do you feast on the blood of men? Right. Yeah. So he is fulfilled fulfilling this prophetic role."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4850.25,"end":4850.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4850.97,"end":4889.26,"speaker":"Fr Stephen De Young","text":"Right. He's the only one who can dare call the Tsar to repentance. Right. And so the odd behavior, the quote unquote crazy behavior that he's engaging in. Right. We could see the purpose behind it. And so we can understand this person as a fool for Christ. Right. So to use an archetypal example for a demoniac. Archetypal not only because of the length of the story, but also because of the number of times we read it. Every year, the Orthodox Church, for some."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4889.26,"end":4892.34,"speaker":"Fr Andrew Stephen Damick","text":"Reason, two or three on Sundays. Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4893.06,"end":4897.7,"speaker":"Fr Stephen De Young","text":"Is the story of the Gadarene or Gerasene demoniac."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4898.02,"end":4899.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The one with the pigs, everybody."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4900.16,"end":4902.8,"speaker":"Fr Stephen De Young","text":"Right. With Legion, the devil, Ham, that whole story."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4903.12,"end":4908.8,"speaker":"Fr Andrew Stephen Damick","text":"That's right. I hope everybody made that joke or heard that joke this past Sunday, that."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4908.8,"end":4919.52,"speaker":"Fr Stephen De Young","text":"Is the traditional dad joke for. And since we're called Father, as Orthodox priest, we have to make dad jokes or you're falling out on the job."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4919.84,"end":4922,"speaker":"Fr Andrew Stephen Damick","text":"It's canonical. So."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4924.48,"end":4945.08,"speaker":"Fr Stephen De Young","text":"This demoniac, when we first encounter him, has been removed from society. Right. He's living in the tombs, naked. Right. Running around, living like an animal. Right. But there's no sort of testimony coming from him to the society at large."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4946.12,"end":4946.52,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4946.92,"end":4949.48,"speaker":"Fr Stephen De Young","text":"He's menacing the local people."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4949.64,"end":4950.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4952.6,"end":4965.09,"speaker":"Fr Stephen De Young","text":"In various ways. And it's important to note here that people don't just end up demon possessed like this by accident one day."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4965.41,"end":4976.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not like they're walking down the road and a demon sneaks up on them and just slithers into their brain, takes control of them. Like you don't accidentally get demon possessed."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4976.85,"end":4979.57,"speaker":"Fr Stephen De Young","text":"Right. Or they played with a Ouija board once at a slumber party."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4980.11,"end":4980.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4981.47,"end":4987.07,"speaker":"Fr Stephen De Young","text":"Not that that's a good thing to do, but that's not instantly going to get you possessed by a thousand demons. Right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4987.15,"end":4987.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4987.71,"end":4989.47,"speaker":"Fr Stephen De Young","text":"And have you running naked in the tombs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":4989.71,"end":5020.96,"speaker":"Fr Andrew Stephen Damick","text":"No, this is, it's just like, you know, it's the opposite effect of if you live a holy life, then you become a peer of the angels and you function like the angels. If you live an evil life and like really evil, then you become like the demons. And you are not in the divine council, you're in whatever the opposite of that is. You're in the infernal. Well, it's not a council. The infernal mob, Lord."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5020.96,"end":5029,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And so this is something that happened to him. He ended up in this state over a long period of time."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5029.56,"end":5031,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5032.61,"end":5078.86,"speaker":"Fr Stephen De Young","text":"Living in more and more demonic way. And that actually makes this a very hopeful story because it means that if he was not too far gone for Christ to come and heal him, then pretty much nobody else is too far gone either. Right. But note here that once the demons are cast out, right. And they go to the pigs and the pigs jump in the sea, Christ doesn't reintegrate this man into his gentile. Galilean society. We know it's gentiles because they're herding pigs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5079.34,"end":5079.74,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5080.3,"end":5091.17,"speaker":"Fr Stephen De Young","text":"Right. He doesn't say, well, good, now you can go get a job and become a tax paying Galilean. Right. Go find yourself a wife, have a couple of kids, settle down."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5093.01,"end":5095.25,"speaker":"Fr Andrew Stephen Damick","text":"The Galilean dream, Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5095.89,"end":5120.06,"speaker":"Fr Stephen De Young","text":"So this is about Christ reintegrating this person into society. He doesn't want to reintegrate into society. He begs Christ to go with him and become A disciple, to leave all that behind and go become a disciple. Christ instead turns him into an apostle. He sends him. He says, you need to stay here and you need to tell everyone what happened."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5120.06,"end":5129.18,"speaker":"Fr Andrew Stephen Damick","text":"Tell everybody what God has done for you. It's interesting. I mean, this is one of. There's moments where Christ says, now don't tell anybody. But this is one where he says, now go and tell."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5129.66,"end":5140.95,"speaker":"Fr Stephen De Young","text":"Right. And so he now has this apostolic and prophetic mission that begins with what? With his encounter with God in the person of Jesus Christ."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5141.59,"end":5142.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5142.79,"end":5154.95,"speaker":"Fr Stephen De Young","text":"And so now he becomes set apart from society in the opposite way. So now he can go and testify to that gentile Galilean society about who Christ is."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5155.43,"end":5159.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So instead of being kind of a demonic fool, he's a holy fool now."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5159.75,"end":5192.36,"speaker":"Fr Stephen De Young","text":"Right, right. And so this connection to experiences can also be true in a lot of cases with other broader types of mental illness, where experiences in life, ongoing experiences in life, trauma, these kinds of things in life can change a person in such a way that they're no longer able to adapt to the social structures that they might have previously felt at home in."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5193.15,"end":5209.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, like a really good example, you know, you brought up warfare earlier. People come home with ptsd, sometimes they can the trauma. You know, they can sometimes adapt and sometimes they can't. Sometimes they just come back and they are never the same."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5210.59,"end":5212.35,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5214.75,"end":5215.15,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5217.71,"end":5253.98,"speaker":"Fr Stephen De Young","text":"When. A big part of why this understanding is important in terms of the social order and whether or not we can and will and should adapt to it is that there are a number of different ways in which the phrase the world is used in scripture. But one of those ways refers to the world almost as this sort of oppressive entity, like the world, the flesh and the devil. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5253.98,"end":5254.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5256.54,"end":5267.1,"speaker":"Fr Stephen De Young","text":"And there's a way of reading that if you're, say, a Gnostic or a Puritan, in which that means the things in the world, the material world."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5267.42,"end":5280.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's not how it's in the scripture. And that's like, that's why, for instance, you know, Jesus says they came not to condemn the world, but to save it. That's a different usage of the world."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5280.74,"end":5296.58,"speaker":"Fr Stephen De Young","text":"Right, right. And so this understanding of the world is about the social order that humans construct in the world. Right. Never forget Cain built the first city."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5297.06,"end":5297.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5298.9,"end":5329.35,"speaker":"Fr Stephen De Young","text":"First police is him. Right. It's about these pathological orders that we construct in the world. And by those being the social constructs in the world, there is an innate pressure on every one of us to conform to that. Why? Well, it's not fun being unable to function and unable to flourish in the world you live in."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5332.94,"end":5333.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5333.98,"end":5399.35,"speaker":"Fr Stephen De Young","text":"So for us in contemporary society, most of the people listening to this, right, we have to find a way to make enough money to buy the goods and services we need to shelter ourselves, clothe ourselves, feed ourselves. Right. We have to find a way to function within the order as it exists now, to survive within it, let alone flourish. Right, Right. Let alone try to work toward our salvation and do these other things. So there's always this pressure to confor. Because conformity, at least in theory, makes life within that order easier. Right. It might not make human flourishing easier, but it makes life in that order easier. Right. And so the world has always been this force, just like it was for Nebuchadnezzar, Right. Just as it was for the first Christians in the pagan Roman Empire who faced all this pressure to participate in the festivals, to make the sacrifices so they could be in a trade guild, Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5399.35,"end":5399.75,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5401.67,"end":5405.83,"speaker":"Fr Stephen De Young","text":"Be good Romans, and then everything would get easier."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5406.31,"end":5406.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5406.63,"end":5428.69,"speaker":"Fr Stephen De Young","text":"And this exists for Christians today who live in Islamic countries or who live in countries with some kind of tyrannical social order that's expressly anti Christian. Right. If you just become a good citizen of whatever this is, if you just convert, if you just shift, if you just stop being a Christian so much."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5429.25,"end":5429.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5429.61,"end":5432.85,"speaker":"Fr Stephen De Young","text":"Just be normal, everything will go easier for you."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5434.29,"end":5434.65,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5434.65,"end":5453.25,"speaker":"Fr Stephen De Young","text":"Everything will go easy for you. And that's what the world is. The world is that set of social structures that are constantly a temptation, a seduction. Right. This force, this enemy of us finding our salvation."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5453.73,"end":5464.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and this connects, of course, directly with what we were talking about the last episode, because what animates that sense of the world is demonic spirit."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5465.49,"end":5467.81,"speaker":"Fr Stephen De Young","text":"Right? That's what's animating that order."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5468.21,"end":5468.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5469.62,"end":5478.34,"speaker":"Fr Stephen De Young","text":"The spirit of the age is not the Holy Spirit. Right. The spirit of the age to come is the Holy Spirit, but not this present evil age."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5482.02,"end":5505.31,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Yeah. So I mean, you know that the goal of being Christian then is not to be a good citizen. It's, it's, you know, of the world. It's to be a good citizen of the kingdom of Christ. Which doesn't mean you need to be a menace to society, but that you, you know."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5505.47,"end":5506.11,"speaker":"Fr Stephen De Young","text":"Aww."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5507.15,"end":5511.07,"speaker":"Fr Andrew Stephen Damick","text":"Hey, I can make the. Well, actually, that's not that an obscure reference, but."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5511.23,"end":5512.91,"speaker":"Fr Stephen De Young","text":"No, I was just saying I want to be a menace."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5512.99,"end":5643.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no, you may not. Yeah, it's not to be a menace, you know, a menace to society, but rather to. To. To bring the order of God into it. Right. So, yeah, be a good citizen of Christ's kingdom, which can make you look crazy to the world at times. So. Well, to. To wrap up, there was a conversation I was privy to recently. Actually, you were there too, Father Stephen, which is recently our diocesan clergy had our annual, what's called Clergy Synaxis. And Father Stephen was our speaker. And one of the features of the gathering is always conversations with our bishop, which is always great. And someone brought up to him and asked him to speak about something that's a very controversial subject in our time. Right. And I won't get into what it is exactly, because that's a whole other can of worms, but it's a moral issue, you know, it's an anthropology issue. I'll just put it that way. And it was interesting to watch him, like, he didn't have a prepared statement. By no means does the bishop think or say or teach anything that's out of step with orthodox tradition with regards to this issue. Not at all. But it was interesting to. To hear him sort of think out loud how he wanted to say what he was going to say. He didn't have a prepared statement. And actually, I think my bishop almost never has a prepared statement. The couple times I know he's walked in with one, he said something else entirely because that's just what he wanted to say. But in any event, it was interesting to listen to what he said because there was one point where his first reaction was almost like, well, that's just kind of just a distraction, you know, and certainly understanding that people who are dealing with this issue and maybe suffering from it, that they need pastoral care."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5643.26,"end":5643.66,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5643.66,"end":5963.86,"speaker":"Fr Andrew Stephen Damick","text":"Because another thing he said, he says, well, this is just a matter of sin, and we know what to do about sin. We repent, you know, that's what we do about sin. Right. So you teach repentance, you got to teach it with love, apply it in a very beautiful pastoral way. But there was one point where he said, and this is where he kind of ended up, he said, you know, if you really are committed to the life of the church, especially to the life of prayer and worship, but the whole. The whole matrix of what it is that we do as orthodox Christians, you know, the prayer, the fasting, the almsgiving, the learning, the active love for our family and for our neighbor, for our fellow parishioners, etc. He said, if you really are doing that, and the more that you do that, you actually discover that these questions, these very controversial issues of our time, that not only will they not control you. And this is what he said. They actually become invisible. Now, by that, he didn't mean you get to ignore what's going on in the world. That's not what he meant. But what he meant was that your perspective changes so much because. And this is my interpretation of what he said, my sort of paraphrase of it, you realize the story you're really in, you know, and when you know that the real story of what's going on in the world is a matter of Christ's rescue of us from these demonic influences, and you realize that the real battle is a spiritual battle, then those are the tools that you begin to apply in every situation. And so it's not that the knots that people get tied into or sometimes tie themselves up into as a result of a lot of the big controversies of our day. It's not that we look and just say, oh, well, just, you know, come on, shape up, just stop it. You know, that's not what. That's not what he meant at all. But rather, there's a sense that you begin to see those things in true perspective. And when you. What you then bring to them is the wholeness and the beauty and the glory and the sanity, the sanity of God. Right. You know, just like, you know, I know a lot of the people listening to this show are parents. I'm a parent. And your kids will often act in ways that seem kind of nuts. You know, sometimes they just completely lose it. And it's really easy to get caught up in their craziness, you know, to become obsessed with it. But if you keep your perspective and you watch your child, you know, melting down in front of you, number one, you don't stop loving them. And you don't turn towards them not caring about what's going on with them. You care because they're suffering. Clearly, even when they're losing their minds in a destructive way, they're suffering. Absolutely right. But you also have the perspective to know that it's possible to come out of that, that it's possible for that not to be the way that you function anymore. That's possible to become sane. Right. And I thought that was what was so beautiful about what the bishop said is, you know, it was. He was really speaking as a father to children, a father to fathers of children also. And that the way of having sanity, the way of really becoming whole, is to conform ourselves to the kingdom of God. And the more that we do that, then we're able to bring that to other people. And so he always One of his big sayings, he always says is, you know, a priest should spend, you know, the table that should concern the priest the most is the altar table, not the desk in his office. And it's true, it's absolutely true. But that's not true just of priests, right? It's true for all of us. And when we bring ourselves into that ordered way of living, which is the way that God has given us in his body, the Church, when we conform ourselves, you know, connecting back to our previous episode, to what the Holy Spirit is leading us to do by being obedient to the commandments, by doing all these things that we know to do, all the things that your priest asks you to do that maybe you don't do so much, then we are able, number one, we will, as a result, kind of be taken outside of society like we've been talking about. We'll be holy fools on some level, but more importantly, we will be oriented to the life of the world to come. We'll be oriented to the kingdom of God. That's not just in the future, but is also breaking into this moment. And so I just wanted to pass on that very, very beautiful word that he gave us, although I probably said it in a thousand more words than he ever would have. He's pretty to the point in the way that he talks. Father Stephen, what's your final comments for this evening?"}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5964.5,"end":5966.1,"speaker":"Fr Stephen De Young","text":"So I'm going the opposite tack."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5966.5,"end":5967.14,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":5967.3,"end":6727.8,"speaker":"Fr Stephen De Young","text":"I'm going straight after, as my example, a hot button social issue in cancellation attempt number four. So I want to dig a little deeper in terms of where we ended. And this is ultimately, hopefully going to be to get past the whole black pill pessimism thing to, to something at least potentially positive for us. And that is we have to recognize the fact that what's the right word to use? So the Church as she stands before Christ is holy and blameless and pure, right? Not so, at least in the present time. Are individual Christian communities in which we live right? Or at least which we visit, which is part of the problem. I'll come back to here in a minute. And in many ways this is especially true, I think, for us who live in countries where there is not a sense of antithesis between what we were just calling the world, the culture, the political realities, the economic realities, the social constructions in which we live. When we're in a country where there's not a sense of antithesis between that and Christianity, we've become especially prone to our Christian communities being co opted by those social constructions. And used as a means to promote conformity to them. Used as a way to make people good citizens, to make people good people. And this has been so thorough going, for example, in some English speaking countries that the word Christian now is essentially an adjective that means proper or good or put together. Right? Means the equivalent of clean cut, right? Your Christian name is your proper name. Right? And this is a massive problem for everyone who is attempting to work out their salvation in a Christian community when the Christian community itself, rather than providing respite in a different direction from conformity to the world, is actually being used as a tool for conformity to the world. And as I mentioned, I'm now going to pick a completely non controversial example. I'm going to talk about marriage and same sex marriage as an example. So on one hand, right, on one hand we have what is currently called, and again, I primarily always have to speak for the United States because that's where I live, that's what I'm most familiar with. We have communities where the current version of conservatism has taken reign. I say current version of conservatism because today's conservative is always yesterday's liberal and last week's radical right. So the position that's being conserved at any given point in time is usually a fairly late position that would have been radical not that long before. But so for example, we have the, the current conservative position where it's taken hold in Christian communities which has taken the nuclear family. We've, I've talked about this before on this show, but they've taken the nuclear family, which is sort of the last surviving bare fossilized remnant of what family once was the extended family, the clan, right, the people group, this last remaining little vestige and has made that now the end all and be all. And as is the tendency with conservativism, whatever the current social structures are, are thought to be number one natural. This just conforms to nature and to be essentially eternal. This is the way it's always been, right? You're hard pressed to find a lot of nuclear families in the Bible, but I digress. And so it is purely on the nuclear family. Well, what does that do? Right? Well that makes unmarried people in those Christian communities feel like second class citizens. That makes them feel even more isolated and alone than they might already do because they don't have a partner to share their life with. That makes part of the nuclear families having children. So that makes couples who are unable to have children feel ostra. Ostracized and they're looked at with suspicion, sometimes outright called selfish. And this dysfunction, right, within the Christian community is not helping any of these people flourish as humans or find salvation, right? But a foreign cultural view has come in and taken hold. And you don't find anything better on what we still, in the United States at least call the other side, where we have the more progressive or liberal or however we want to inadequately use terms. And I think we see this most clearly when we come to the issue of same sex marriage, because those, and there are even a few of these folks in the Orthodox church, I won't name names. Most of the people listening probably know who I'm talking about, who see same sex marriage as something that, that should happen within their local orthodox Christian communities. And the way they portray it is they will say, well, we need to accept people who identify as homosexual, who want to be in monogamous lifelong relationships with a partner. But what's going on here, right? Because the whole basis for monogamous lifelong marriage, right, if we want to go with the Bible, it's that as Christ said, God created humanity, male and female, and they become one flesh and there's at least the potential there to produce children. So biblically, that's the basis for monogamous marriage. And if we don't want to go biblically because some of those same folks aren't so big on literal interpretations of the Bible, we could just go at this from a biological and zoological perspective. Higher mammals mate for life, biologically male and female higher mammals mate for life and raise children. So that's the whole basis for it. So why then would someone who wants to present themselves as in some way progressive or radical argue that the answer for a person who, because they experience same sex desires, homosexual desires, is outside of the current social order, why would they think that? The answer for that is to parrot this sort of nuclear family structure, this sort of monogamous marriage structure, right? Because they're not actually challenging the structure. It's not radical at all. It's actually kind of reactionary. They're trying to just widen the category enough that we can squeeze some more people into it. We can get some more people to conform, right, without questioning what's being held as an ideal. And it's not because these people care about these folks who identify as homosexual. They don't care about them at all, but they want to preserve the social constructions that they personally are beneficiaries of and they want to assuage their own personal neurotic guilt at benefiting from them by Diversifying them or making them more inclusive so they want to pry it open just a little, right? These same folks, right? These are the folks who don't want to talk about the military industrial complex. They just want to diversify the army and then everything will be cool. So that's not a solution either, right? Both of these quote unquote sides are just trying to preserve a status quo and conform more people to the world and use Christian communities as a way to do that, as a way to funnel people into it. So what's the alternative? This is the good news part, right? Is that we do have an alternative as Christians. As Christians, we do not have to conform to any of the social structures of this world. We can live and be in the world in a completely different way, in Christ. And so we can take our Christian communities, our parishes, and we can transform them from a place that's visited a couple times a week, a venue for us for worship, right? For a certain type of activity. We can transform them into actual communities, into communities where we can create a family structure, a new family structure in Christ that is part of the household of God. St. Paul talks about this all the time. That goes beyond the nuclear family that's a result of the industrial revolution or the diversified nuclear family. That's the weird compromise position, but that is a social unit and a family that has a place for unmarried people and a role for them in our community. That has a place for couples who, for whatever reason, don't have children. That has a place for married couples that do have children. That is a place where we all can be freed from these and all the other ideas and concepts and constructs in our society that are preventing us from drawing closer to Christ, that are trying to get us to conform to them instead of to Christ, where we can be free to flourish and come to know Jesus ever more deeply. And we'll know we're being successful in doing this. We'll know that we really have this type of community. Not just when everybody thinks we're weird. That'll be step one, right? St. Peter says we should be like aliens and strangers in the world, not at home. But we'll know we're really doing it when they start hating us. Will know we're really doing it when they don't just think we're weird, but that they think we're dangerous, when they think that we're insane, when our existence threatens the people who love and create these often demonic social orders. Cain killed Abel because Abel's existence as a righteous person was a threat to Him. The Jewish authorities had to crucify Christ because His very existence was a threat to them. And most of us today so far are so conformed to the social order that we're no threat to anybody. But we can be. And together and working together, we can find salvation in the process."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6728.6,"end":6748.09,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight, our Halloween episode. Thank you everyone for listening. If you didn't get through to us live, we'd still love to hear from you. You can email us@lordofspiritsandfaith.com you can send us a message or Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6748.81,"end":6758.55,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific Tuesday morning next week out in the suburbs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6759.98,"end":6776.14,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page join our discussion group. Also, everyone make sure you check out the new Ancient Faith Radio app on both Android and iPhone. If you have one of those machines, leave reviews and ratings everywhere. But most importantly, please share the show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6776.62,"end":6787.73,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of AFR podcasters stay on the air. And don't worry this weekend no one likes your kids enough to give them free drugs."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6788.85,"end":6792.05,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless and keep you."}
{"episode_id":"LOS - #054 - 2022-10-27 - Monstrous Compendium","start":6801.65,"end":6838.84,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
