{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":0.24,"end":64.84,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":67.24,"end":154.96,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania and my co host father Stephen DeYoung is with me from Lafayette, Louisiana. Now, because this episode is releasing on American Thanksgiving. It is a pre recorded show so. So don't call this time. Save your calls for next time. That said, we did get some voicemails from some of you that we will be including in this episode. So tonight, or actually it's today when I'm recording, but whatever you're listening. Tonight we're going to be continuing our four part series on the Christology of the Old Testament. This is part two. Last time we talked about the angel of the Lord and this time we're going to be discussing the word of the Lord or the word of God. This is another phrase that gets people confused sometimes. What does word of God mean exactly? Is it the Bible? Is it Christ? Can we use the phrase for both? Well, it turns out that the scripture itself uses the phrase very consistently. So this episode is dedicated to taking a close look. Not at every single example. That would be hours and hours long. Not that that has ever really stopped us before, of course. But we'll be looking at the paradigmatic uses of the word of God or the word of the Lord in the Bible, which will then tell us something very significant about the Christian faith. So it's got the word in there, Father. So is this just talking about language?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":156.56,"end":156.96,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":157.04,"end":157.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":161.68,"end":164.44,"speaker":"Fr Stephen De Young","text":"I want to clarify something for the record though before we begin."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":164.44,"end":164.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":165.96,"end":194.65,"speaker":"Fr Stephen De Young","text":"I was perfectly willing to come and broadcast live on Thanksgiving night. I wanted to be with our listeners as they recovered from gorging on Turkey to celebrate New England Puritanism and their revisionist history of the founding of the country. But it's not a beast disease. I was alone. I was alone in that desire. And so it's going to be pre recorded."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":194.65,"end":205.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When people hear this, I'm going to be traveling to see family and our producer Trudy will be doing probably good things with her own family. So, yeah, we're going to have the night off."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":206.49,"end":216.57,"speaker":"Fr Stephen De Young","text":"I'll probably be watching an old horror movie, but so enjoy the Detroit Lion. The Detroit Lions will have already lost by that time."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":216.65,"end":221.84,"speaker":"Fr Andrew Stephen Damick","text":"Oh, so that's the game with a pointed ball, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":222.72,"end":224.56,"speaker":"Fr Stephen De Young","text":"Yes, the one that looks like Kibby."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":224.72,"end":225.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":225.6,"end":231.04,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah. But I wanted to just lay that out for the rest."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":231.04,"end":239.28,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so to begin, I wanted to play one of the voicemails that we got from one of you, our listeners."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":240.48,"end":305.68,"speaker":"Photani","text":"Hi, fathers. My name is Olga Karpushina. I'm calling from Kazakhstan. My, my question is, as a former linguist, I would want to know, when we talk about the word of God, of the Lord, what realm will that word belong to? In general linguistics, we have two terms, lang and parole. These terms were coined by structural linguist. Basically, lung would be theoretical, like language that pre exists any utterances like, like Platonic idea, I would say. Whereas parole would be individual, like speech, concrete revealed language in use. So when, when we talk about the word like which, which category will that word belong to? Would it be the realm of lung or parole?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":305.68,"end":306,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":308.8,"end":320.4,"speaker":"Photani","text":"If it is parole, if it is pronounced, then who pronounced that? Would it be Jesus Christ, because he's the only one who has the body or what? Just curious. Thank you."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":320.96,"end":328.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Olga from Kazakhstan, I think this might be our first call from Kazakhstan, right? I think, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":328.24,"end":330.44,"speaker":"Fr Stephen De Young","text":"At least directly from Kazakhstan that we're aware of."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":330.44,"end":422.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So Olga, the linguist, she was asking about whether the sense of the word of the Lord or the word of God, if it could be understood in terms of linguistic theory. Now I had to dig deep within my memory banks to even refresh my mind as to exactly what the terms she means or using. So forgive me, I am not a linguist. I just like to study the stuff that's kind of linguistics adjacent. But. So she was asking about called structuralism, which is a particular theory of linguistics that arose in the mid 20th century. And she mentioned Saussure, who is one of these theorists from that time. And he came up with this distinction between now he's using the French words langue and parole, which we could translate into English roughly as language or speech. So the idea is language is. It's the whole sort of world of conversation that exists within a culture. Okay. If that makes sense. And then speech is, you know, what one person is saying. And so she was asking whether this sense of the word of the Lord or the word of God, if it fits into one of those two categories. Right. If I'm understanding correctly, and forgive me, Olga, if I'm getting this wrong, but that's my understanding after having looked this up. So what do you think about that, Father? Does that schema work for this?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":424.27,"end":456.2,"speaker":"Fr Stephen De Young","text":"Well, it doesn't fit neatly into either category. Right. Because, of course, the ancient world, they didn't have those terms. They didn't speak French. But I think we're gonna see, as we go through here in the first half, we're gonna talk about this at a more sort of conceptual level and sort of a history of interpretation level that of the two, it is closer to long to the first category."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":456.28,"end":456.88,"speaker":"Fr Andrew Stephen Damick","text":"Language."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":456.88,"end":473.35,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, closer. But it doesn't neatly fit there because I think there's a. There's a. A little bit more going on than just the linguistic level, as we're going to see."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":475.99,"end":476.39,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":476.63,"end":478.71,"speaker":"Fr Stephen De Young","text":"Yeah, let's get into that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":478.71,"end":479.35,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":479.99,"end":506.43,"speaker":"Fr Stephen De Young","text":"All right. So one of the problems is that we've inherited from our aforementioned New England Puritan beginnings, at least in American Christianity, the tendency to use the phrase word of God and even word of the Lord sometimes, but more commonly, word of God to refer to the Bible."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":506.59,"end":507.55,"speaker":"Fr Andrew Stephen Damick","text":"The word of God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":508.43,"end":508.91,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":508.91,"end":510.59,"speaker":"Fr Andrew Stephen Damick","text":"Pronounced exactly like that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":511.23,"end":515.79,"speaker":"Fr Stephen De Young","text":"Yeah. And I'm going to say that has an O with an apostrophe in it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":516.43,"end":519.09,"speaker":"Fr Andrew Stephen Damick","text":"Word. Oh, God. Like. Like Jack o' lantern."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":519.57,"end":556.97,"speaker":"Fr Stephen De Young","text":"Yeah. Filet o' fish and tam o' shanter. But so obviously, you know, people are free to invent technical terms and use them however they like. Right. We can't be the. As much as you'd like to, we can't be the word police. Right. But I would like to, believe me, but we do have to point out that in the Bible, the phrase word of God or word of the Lord is never used to refer to the Bible."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":557.29,"end":563.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's really what we're focusing on is how does the Bible use this language?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":565.21,"end":600.42,"speaker":"Fr Stephen De Young","text":"Right, right. Because it's the biblical use of it that's going to be then picked up by the church fathers and picked up by later, later Christian tradition. And that's not to say that there's not some sense in which that could apply to the Bible, but it is to say if, when you think of the word of God. What comes into your brain is the Bible. You're going to end up misinterpreting a bunch of things when you see that phrase in the Bible. In fact, the Bible doesn't call itself anything in the Bible really. Because the Bible doesn't talk about the Bible."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":600.83,"end":604.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a singular book the way that we have it now."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":605.07,"end":630.34,"speaker":"Fr Stephen De Young","text":"Yeah, right. It doesn't talk about itself as sort of this cohesive unit. Right. What you do have are references to scriptures, to written things literally. And so you will have texts in the scriptures which are written later, referring to things written earlier as scriptures, as things written. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":630.34,"end":643.22,"speaker":"Fr Andrew Stephen Damick","text":"Now I know that that happens in the New Testament. Often referring to the Old Testament as the scriptures. I can't recall. Do you get that in the Old Testament. Does the Old Testament ever refer to other Old Testament texts as the scriptures?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":643.7,"end":661.81,"speaker":"Fr Stephen De Young","text":"Well, it depends on what you mean by the Old Testament. Most of, if we're talking about the rabbinic and most protestant canon, then not really."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":661.97,"end":664.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay. The short Old Testament, as it were."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":665.33,"end":710.6,"speaker":"Fr Stephen De Young","text":"Right. Because I mean, you see the Torah, but it's referred to as the Torah. Right. It's its own thing. Right. It is referred to as like a unit. Right, right. When you get into some of what some folks would call the deuterocanonical books or the longer canon or how you want to take that, you see the earlier books referred to in various ways, Right. As the oracles of God or as, as things written. And that is picked up then in the, in the texts that make up the New Testament. Because every text that is in the New Testament is a piece of second Temple Jewish literature, technically."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":710.84,"end":712.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":712.92,"end":751.77,"speaker":"Fr Stephen De Young","text":"So, yeah, so that is kind of picked up there. That starts before that. Right. But the particular reason for that reference, why the things written down is a meaningful statement. Right. That's not a meaningful statement for us today. We jot down notes, grocery lists, you know, reminders, post it notes. Right, right. So just the fact that somebody wrote something somewhere is kind of meaningless now. But, but at this time in history, remember, this is an incredibly expensive process. This is a process that requires skills that the vast majority of the people in the world do not have."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":752.09,"end":864.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that probably if there is a modern equivalent, maybe our phrase set in stone might be the closer. You know, the only referent that we would use, like, you know, the sense of, like, okay, that's going to be a very expensive long term proposition, actually carve this text in stone, you know, that it's so important and Huge. That we're going to go ahead and make a monument. Right, Right. Yeah. And it was, you know, when we were talking about this, during our briefing for this episode, the thing that occurred to me was, so back in the before times, when I was an undergrad, I actually took a course in Hindu traditions. Not because I was ever interested in becoming a Hindu, I was just know, interested in world religions. But I remember the professor, and maybe I'm misremembering this, or maybe he got it wrong. I don't know. But the professor saying at one point that the Hindu scriptures, their tradition actually functions almost exactly the opposite way, that in their ancient period, just about the only thing that you find written down is, like, really inconsequential things that you might be liable to forget, like, you know, a grocery list or whatever. And that the reason why they did it that way is because they spent a massive amount of time committing their sacred stories to memory and they were passed on orally all this time. But it's interesting that within the world that the Jewish and Christian scriptures arise, that it's exactly the opposite, that it was so expensive and took so much work to put a text down. You would only put down something really important, you know, in. On paper or parchment or whatever. I imagine they probably had. They must have had some ways to jot down notes. But was that mostly done, like, with a wax stylus or something like that?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":865.55,"end":873.95,"speaker":"Fr Stephen De Young","text":"Well, most people weren't literate at all, but you would make little notations and stuff, like numbers, and that kind of thing was done on pottery shards."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":874.11,"end":874.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":874.99,"end":877.55,"speaker":"Fr Stephen De Young","text":"Which were everywhere. Astraka. You know, they're the."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":877.96,"end":878.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":878.36,"end":879.8,"speaker":"Fr Stephen De Young","text":"Scratch paper of the ancient world."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":879.96,"end":882.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Basically the Internet of its day, you know."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":882.36,"end":882.84,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":884.68,"end":887.68,"speaker":"Fr Andrew Stephen Damick","text":"But all the garbage you would write on it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":887.68,"end":895.64,"speaker":"Fr Stephen De Young","text":"Yeah, Right, right. And it's. It's not only the writing. Right. But it's the. Then the preserve it. The copying and the preserving."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":895.72,"end":896.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":896.68,"end":1002.69,"speaker":"Fr Stephen De Young","text":"Right. Over time, protection from the elements and, you know, and continuing to copy and recopy these things, which was also an expensive and fair process. So, as you said, essentially these texts from the ancient world were sort of literary monuments. Right. And so they were sort of treated as such. So the fact that something had been written down and preserved, this means it's significant. So when you say it is written right or is it not written right, that gives it this weight not only of the initial investment in writing it down, but. But also that weight of tradition, of it having been now handed down to us. Right. As something that was vitally important. From our forebears and. Yeah, and so we've probably said on the show before, but it probably bears repeating in this context to give people an idea. In the first century, to get a copy of something the size of the book of Romans, just the book of Romans, which, which is 16 chapters, not that long, you could read it one sitting. A copy of that would have cost the equivalent of $5,000 in the ancient world. So that gives you an idea. Right. You did. You didn't go and put something down like that. And people didn't pay to have copies made for just junk, for fanfic and, you know, like random. Random stuff. And so. Yeah, the corollary of this, of course, is that if the expense and cost and time and effort required gave these things this great value, it means that things posted on the Internet, which are cheap as free and require almost no thought or effort, have no value whatsoever."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1002.93,"end":1023.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I just looked this up just for fun. So the book of Romans in most English translations is about a little over 7,000 words long, which, I mean, that's. If you're writing a 7,000 word paper in college, that's about, what, 15, 20 pages?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1024.46,"end":1025.74,"speaker":"Fr Stephen De Young","text":"23 pages, maybe."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1025.74,"end":1047.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So that would take a month to copy down. Well, and to have it committed to. I mean, just to think about that, like, you know, I can sit down and write 7,000 words probably in a couple days if I really know what I'm doing. But then the work, you know, it's just, it's really astonishing to think about the work required to do."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1047.99,"end":1050.31,"speaker":"Fr Stephen De Young","text":"Right. You don't have to make your own paper."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1050.31,"end":1063.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't have to make my own paper. I don't have to have good handwriting. You know, I don't have to set it down really precisely so that it's exact and, you know. Right. And this is usually with ink or something like that. So erasing it would not be easy."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1063.27,"end":1064.71,"speaker":"Fr Stephen De Young","text":"You don't have to make your own ink."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1065.67,"end":1066.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1067.99,"end":1077.71,"speaker":"Fr Stephen De Young","text":"We don't think about that. Right. Like the Dead Sea Scrolls, a lot of them are. If it's parchment, that's beaten out reeds. If it's vellum, that's an animal skin."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1077.71,"end":1078.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1078.55,"end":1099.92,"speaker":"Fr Stephen De Young","text":"That's been cleaned. And the advantage of an animal skin is you could kind of erase because you could scrape it. Now, you could only do that so much. Right, right. But you could, you could usually take off a layer and write over it. In fact, we have things that were copied over, repeated repeatedly that way. And then the Dead Sea Scrolls, they made their ink using the soot from the oil lamps that they use."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1099.92,"end":1100.4,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1103.6,"end":1115.04,"speaker":"Fr Stephen De Young","text":"Yeah. Then you'd have to sharpen a stylus. Right. And then you'd have to. And you could only work while there was bright enough daylight for you to see, really, because trying to do that by candlelight was almost impossible. Make a copy."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1115.04,"end":1155.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And looking like. I've spent a little bit of time looking at the Beowulf manuscript and we're not doing our reading in the class from the manuscript, but occasionally we are looking at pages of manuscript and it's not the easiest thing in the world to read or to copy, you know, and there's errors. We find scribal errors all over it, you know, so it's, it's a really. It's a very high level of qualification in order to be able to make a book in the ancient world, you know, it's not just about banging something out that's a few thousand words and then sending it to your printer. Boom. You know. Yeah. So, yes, the Scriptures, it has all this weight behind it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1156.21,"end":1189.2,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so that's probably the most common way Word of God is used now. Some modern, mostly Protestant, though there's some Roman Catholic theology that goes down this kind of road, this general kind of road also that wants to kind of separate the concept of the Word of God. Because it's very clear that again, in the Scriptures, the concept of the Word of God goes beyond the written word, to say the least."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1189.44,"end":1191.12,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, sure. Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1191.2,"end":1293.77,"speaker":"Fr Stephen De Young","text":"And so there's been an effort to kind of acknowledge that and separate it. But this is taking kind of a weird form, largely initiated by our 19th century German friends who did this by. And this is one particular paradigm, but I think it illustrates kind of what they're doing, the idea that within the written text is found in some way the Word of God. But that's like a kernel. Then the written word itself is like a husk. And so there is then some process by which sort of the Word of God is extracted or revealed or brought out or cleared from the written text. Right. So that may be a particular interpretive process. Sometimes that's a spiritual interpretive process or where it's like the Holy Spirit enlightens the mind and so you can extract the actual Word of God from the written text. That can be a much more material and mundane process. Like you follow this particular exegetical method, this particular interpretive method, and this gives you the real Word of God and gets rid of the rest of the. If you're, if you're Karl Barth this is preaching. When, when the, the text is sort of preached and proclaimed, it becomes the word of God in some sense, like to the hearers."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1295.05,"end":1300.33,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that almost sounds like the sort of Calvinist theory of the Eucharist. At least my understanding of it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1300.73,"end":1302.77,"speaker":"Fr Stephen De Young","text":"Well, that's because Carl Barth was a Calvinist."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1302.77,"end":1304.65,"speaker":"Fr Andrew Stephen Damick","text":"There you are. Good night, everybody."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1305.05,"end":1305.53,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1308.85,"end":1309.49,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1310.85,"end":1317.49,"speaker":"Fr Stephen De Young","text":"So there are, so there are those kind of theories."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1317.49,"end":1317.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1317.89,"end":1358.21,"speaker":"Fr Stephen De Young","text":"But the problem with those theories too is that it's looking at the word of God in terms of some kind of discursive message. Right. It's still a text, whether you identify it with the text of scripture, with a preached text, with a heard text, with a reality or an idea that comes into being in the brain or the mind, or before the noose of the person who is reading and studying. In all of those cases, you're still dealing with the word of God in that kind of sense."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1358.87,"end":1360.95,"speaker":"Fr Andrew Stephen Damick","text":"And that it's mainly language."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1361.83,"end":1370.31,"speaker":"Fr Stephen De Young","text":"Right. And so what we're going to see, I think as we go forward here tonight, it's night somewhere."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1372.07,"end":1373.83,"speaker":"Fr Andrew Stephen Damick","text":"It's night in Kazakhstan, I bet."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1374.23,"end":1391.29,"speaker":"Fr Stephen De Young","text":"Yeah. That, that there, it doesn't just mean more than that, it means something different than that. Yeah, there's a, there's not just a quantitative issue, there's a qualitative issue here in terms of the, the understanding."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1393.77,"end":1409.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so, so where do we go from here? Probably the, the word. The word that probably comes to most people's minds when thinking about this if they know that we're not just talking about the Bible. Is, is the word logos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1409.61,"end":1410.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1410.26,"end":1432.42,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this figure is huge, especially the first chapter of John, which, don't worry everybody, we're going to actually dedicate an entire half in this episode to the beginning of John's Gospel. But it looms large in Greek philosophy. There's all kinds of stuff like that. So how does Logos then figure into all of this?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1433.38,"end":1510.32,"speaker":"Fr Stephen De Young","text":"Right. Well, most of the modern scholarship has viewed that introduction to St. John's Gospel that we'll be talking about soon, soon TM as the sort of locus classicus. Right. For discussing Logos in this sense. The word of God. Right. The Logos, Theu. Right. And as you might expect us to think, because this has been dominated by 19th century Germans, they've kind of gone down a wrong road in doing that. Right. Not, not wrong in seeing that as, as the locus classic is not, not going down the wrong road in terms of seeing that chapter is very important. That's why we're going to come back to it. But A wrong road in terms of how they approach that passage. And then once they've approached that passage that way, the way they then read their conclusions into all kinds of other things. And so methodology in most cases determines your results. Right. Like."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1510.72,"end":1512.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1512.16,"end":1531.42,"speaker":"Fr Stephen De Young","text":"So. And in this case, the primary way that they've approached it is, as you mentioned, from this kind of philosophical background. So coming out of Central European critical studies, I'll try to lay off them a little. At least blame some French people, too."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1532.46,"end":1538.14,"speaker":"Fr Andrew Stephen Damick","text":"Well, we started out this episode with the Frenchmans. Yeah. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1541.26,"end":1553.23,"speaker":"Fr Stephen De Young","text":"St. John's gospel and the Johannine literature in general in the New Testament was seen as being very Greek. Now you may say, well, it's written."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1553.23,"end":1558.35,"speaker":"Fr Andrew Stephen Damick","text":"In Greek and Greeked, you know, like it's Hellenized."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1558.59,"end":1591.08,"speaker":"Fr Stephen De Young","text":"Yeah, right, right. And this is part of a paradigm that comes out of. It's not a coincidence that the parts of Europe that produce this is actually more Germany than France. And why it's more Germany than France or Italy is that this is really coming out of early modern Protestant theological movements. This distinction gets made between what is Hebraic or Semitic on one hand and what is Greek or Hellenic or Hellenistic on the other."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1591.4,"end":1644.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that the reason that that comes into play is because in the Reformation, there's this desire to try to scrape away all of the layers that Rome supposedly had accumulated on top of the pure gospel. And so, you know, you can even see this, for instance, the way that Martin Luther approaches putting together his own Bible in German. Right. Where he favors for the Old Testament texts that he can only find in Hebrew and disfavors, ones that are only extant in Greek. So there's this idea that the pure, pristine Gospel is a sort of a Jewish thing. And then the reason that Rome stacks all this stuff on top is because of a Hellenizing, paganizing, even, you know, impetus."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1644.52,"end":1644.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1644.84,"end":1696.68,"speaker":"Fr Andrew Stephen Damick","text":"And so then what that does is it gives you a very neat project, or at least it seems to be a very neat project, of jumping backwards in time and saying, okay, we can just sort of ignore the Church Fathers. Although, to be fair, a number of the earliest reformers had great respect for the Church Fathers and quoted them and so forth, but that it's not really necessary to be. You know, they're not really authoritative. Let's just jump back to what's before that, and we can find the pure, pristine Christian faith and we don't have to worry about any of this sort of Hellenizing stuff. But as you mentioned, of course, that narrative then gets picked up and even turned against the New Testament itself. Right. You know, now, okay, even the New Testament is now suspect because it's. It also is hellenized. And look, whoa, look, there's a Logos right there at the beginning of John's gospel. See what he's doing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1697.56,"end":1705.84,"speaker":"Fr Stephen De Young","text":"Right. And as an orthodox Christian, obviously, I agree that there were plenty of Barnacles on the 16th century Roman Catholic Church."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1705.84,"end":1706.52,"speaker":"Fr Andrew Stephen Damick","text":"Yes, for sure."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1706.52,"end":1728.93,"speaker":"Fr Stephen De Young","text":"But when you start scraping the barnacles, you have to stop at a certain point or you'll put holes in the hull and sink the ship. Right. And I mean, this really even started during the Reformation proper. Right. You had people like Socinas, you had people who start saying, well, you know, this whole doctrine of the Trinity things sure looks Greek to me."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1728.93,"end":1736.69,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, right, right. And so Trinitarian writers, thank God, they didn't really prevail very much, but they're there for sure."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1736.69,"end":1751.37,"speaker":"Fr Stephen De Young","text":"They did. They're still around. There's still folks around who are very. And make that same argument. This is just this Greek terminology that's not in the Bible. And you know, it's just philosophical stuff. And we need to get back to more Jewish stuff."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1752.81,"end":1753.09,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1753.09,"end":1766.73,"speaker":"Fr Stephen De Young","text":"Yeah, and as you said, that then gets focused in on the New Testament itself. And the Johannine literature becomes very much their focus in saying this is they start saying it's much later than the rest of the New Testament."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1766.73,"end":1767.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1767.52,"end":1810.27,"speaker":"Fr Stephen De Young","text":"That the early layer of the church is very Hebrew and very Jewish. So stuff like the Synoptic Gospels as opposed to St. John's Gospel and St. Paul's epistles as opposed to the general epistles. Right. And so this gets stratified and it gets to the point where in the early 20th century, our German friends are just straight out saying that they think St. John's gospel and these kind of things are Gnostic or proto Gnostic or, you know, but essentially they're tending in the direction of Gnosticism because it is Hellenized over against Jewish."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1810.27,"end":1810.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1813.19,"end":1828.23,"speaker":"Fr Stephen De Young","text":"So that means that as they approach, for example, John chapter one and say, what does St. John mean by logos? By Logos the who? By the word of God. Right. What does he mean? They go straight to Greek philosophy."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1828.23,"end":1828.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1829.75,"end":1876.44,"speaker":"Fr Stephen De Young","text":"Do not pass the Old Testament. Do not collect $200. Right. And the first place where you really see a kind of important philosophical use of logos that really sets the tone for probably the most common way we still use words derived from the Greek word logos today is in Heraclitus, who uses logos to refer in two ways. First to refer to ordered Structures out in the world. Okay, right. In nature, in the cosmos. Right. There are these ordered structures out there. And then because there are these ordered structures out there in the world, we can then have an ordered account and discourse about those objects in the world."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1876.44,"end":1908.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's a logos out there, then we can express a logos of that stuff. Which is then why you have all of these English words that end with ology. You know, it's. The idea is this is the human logos about this logos that we can observe, you know, and, and, and I mean, people will often gloss that suffix of sorts to mean. It means study of, but it doesn't quite mean that actually. It's. It's broader than that. It's this idea, like you said, of an ordered account, a whole discourse about that particular subject, whatever it is."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":1909.12,"end":2039.46,"speaker":"Fr Stephen De Young","text":"Right. Which of course then obviously has to presuppose that there is some order out there to be described in an orderly fashion. Because if it's just chaos out there, then you can't give an ordered account of it. Sort of by definition. Right. There's no chaos, no life on earth. Right. Has an order to it. So we could study biologos. Right. The biology. Right, right. And ontology. Right. Being is order, so we could have ontology. Right. And on and on and on and on and on. So that's. That's kind of an Ur layer of this that. That lies behind later philosophical uses. None of the later philosophical uses are going to deny that. They're all going to nuance that or add to that, build upon that. One of the most influential comes in Stoicism. The major change Stoicism makes when they talk about the logos is that the Stoics see the logos as an active force, not just as they sort of inert order. Right. Or just a structure, but as a sort of active force, an ordering, as it were. Yeah. They talk about a spermaticos logos that is seed in the sense that the logos brings life from lifelessness. It's like this positive organizing principle, like a world soul or a demiurge that's in everything and that is actively working and producing things. That includes in people. And so there is this sort of element of the divine that's in everyone and everything within, within Stoicism, and that is actively doing something. Right, Right. So then on this journey to get to St. John, right, you. You inevitably stop in Philo of Alexandria or Philo Alexandrinus, if you want to."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2039.46,"end":2048.02,"speaker":"Fr Andrew Stephen Damick","text":"Be fancy, who is usually the gloss of who he is, is he's a Quote unquote, Hellenistic Jew. Right. That's the way he's usually described. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2048.1,"end":2058.98,"speaker":"Fr Stephen De Young","text":"Because he lived in Alexandria, Egypt. He was part of the Egyptian Jewish community. Obviously Alexandria in Egypt was a center of great philosophical and general learning. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2059.3,"end":2060.42,"speaker":"Fr Andrew Stephen Damick","text":"He's writing in Greek."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2060.82,"end":2082.47,"speaker":"Fr Stephen De Young","text":"He's writing in Greek. He's interacting with philosophical sources and philosophical ideas. And so the typical read of him taken by these scholars has been that he's just what they call a Middle Platonist. Right. As opposed to like a classical Platonist or a Neoplatonist. He's a Middle Platonist. He's somewhere in between."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2082.63,"end":2083.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2084.23,"end":2109.92,"speaker":"Fr Stephen De Young","text":"And that he basically Hellenized Judaism, that he sort of took Judaism pre existing Judaism and put it through the sausage machine and that that grid grounded up to fit into Greek philosophical categories. And so it's kind of this, this melding, but then it's not really true to pre existing Judaism."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2110.08,"end":2114.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's a Hellenizing of Judaism."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2115.21,"end":2164.8,"speaker":"Fr Stephen De Young","text":"Right. And so this, this relates to something we've, we've talked about a lot. This tendency for the people of any era, but especially in the modern era, to just assume that Old Testament Judaism is exactly like Rabbinic Judaism. Right, right. And so you hold up Philo and you hold up Rabbinic Judaism and they don't look a lot alike. Right. What he writes looks more like Greek literature than it looks like Rabbinic Judaism. Therefore. See exhi. Right. And there are a number of individual sort of topics within that. Like they'll point out, like, oh, see, Philo thinks that you have to have these intermediary beings between God and creation because God can't lower himself to creation. See, that's really Platonic, that's almost gnostic and etc. Etc."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2164.88,"end":2166.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2166.48,"end":2173.28,"speaker":"Fr Stephen De Young","text":"So we are going to here in a little bit get, come back to Philo and talk about a different way to read him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2173.44,"end":2232.39,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And so, so here's the kicker is that, you know, when, when the Dead Sea Scrolls were dug up, which of course we've referred to lots of times on this show, and they have all these texts in them from the Second Temple Jewish period. It's actually shown that Philo is pretty much in alignment with them. And in fact he's actually super Jewish and not Hellenizing it at all. And you know that there's this, and this trove of Second Temple Jewish literature that are found in the Dead Sea Scrolls shows that actually there isn't a Greek influence and in fact often abominates Hellenism entirely. Like it's very Deliberately kind of against it. So if you compare that against Philo, then you actually get a really different image and a really different image of the Gospel of John as well."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2233.11,"end":2265.89,"speaker":"Fr Stephen De Young","text":"Right. Because so when we talk about the Dead Sea Scrolls, there's two categories of Dead Sea Scrolls. One of them is copies of texts that we have elsewhere. Right. So they have texts of most of the books of the Old Testament. They have texts that are in some people's Old Testaments and not other people's Old Testaments. They have a lot of copies of Enoch and Jubilees and some other texts like that that we have other places. There are also what are called the sectarian documents or the sectarian documents."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2266.21,"end":2268.29,"speaker":"Fr Andrew Stephen Damick","text":"What does that mean? Why are they called sectarian?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2268.85,"end":2274.61,"speaker":"Fr Stephen De Young","text":"They're called that because these are specific to the community at Qumran that produced the Dead Sea Scrolls."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2274.77,"end":2276.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So they're not found anywhere else."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2277.41,"end":2314.97,"speaker":"Fr Stephen De Young","text":"Right. So it's like if you went through all my books and papers, you would find copies of a lot of books. Right. That other people have copies of. Right. You would might also find the bound copy of my dissertation that other people don't necessarily have. Right. You'd also find just a lot of papers of mine, like old school papers. Right. Seminar papers, PhD papers that weren't published anywhere, that are just mine. And you would find signed documents and things that were particular to me and my house and my life. So the sectarian documents are all those things that are particular to that community and to their way of life and their organization."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2316.09,"end":2321.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We can refer to your dissertation as your sectarian text then."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2321.45,"end":2489.2,"speaker":"Fr Stephen De Young","text":"Yes, yes. It is a De Young sectarian document and apocryphal because it is hidden. So when we look at those sectarian texts. Right. That gives us an idea of the particular things about that community. The other texts give us an idea about more general shape of Judaism. Right. On a whole. But you can't take the sectarian text and say, oh, well, see, Jews everywhere believed xyz, because it's here in this text that we only found at Qumran. Right. You have to just say, well, we know they thought it was. Yeah, right, right, right. So when you look at particularly those sectarian texts, you find a lot of the themes that are in St. John's Gospel and in his Epistles and even the Book of Revelation. And specifically, you find a lot of the themes that people were pointing to to try and say he was Greek and borderline Gnostic. Right. So this like a lot of dualisms between light and darkness and children of light and Children of darkness and those who are of God and those who are of the devil. Those were all thought to be. Oh, look, Dualism, Plato. Ah, see? Huh. But it turns out that was very common Second Temple Jewish way of seeing things like insiders to the community, outsiders of community, hostile world. Outside that this was not uncommon. And so now not only has the whole this is the least Jewish literature in the New Testament thing been debunked, now there are a lot of scholars arguing that the Johannine literature is some of the most Jewish, some of the most deeply immersed in Second Temple Jewish thought in terms of the thought life. Right. And the worship life, as opposed to. It's not that St. Matthew's gospel isn't Jewish somehow, but. But in terms of reflecting that kind of theological and liturgical thought, you find actually more of that in Saint. In the Johannian literature than in. In a lot of the other literature. Well, so that means if we're going to say that. Okay, fair enough for us as Christians, Chapter 1 of St. John's Gospel, locus Classicus. For what we, what Logos, the what the word of God is, then we have to come to it not by way of Greek philosophical traditions, but by way of Hebrew and Jewish traditions. Right. So we have to start in the Old Testament."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2489.36,"end":2493.6,"speaker":"Fr Andrew Stephen Damick","text":"All right. We said all that to say this."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2494.56,"end":2505.31,"speaker":"Fr Stephen De Young","text":"Right. Well, you know, there are a lot of things that you'd think should go without saying. Right, yeah. Like if you understand the New Testament, start with the Old Testament. No, that's a big fight."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2505.47,"end":2507.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and you know, like I."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2507.03,"end":2508.27,"speaker":"Fr Stephen De Young","text":"Was, it's scholarly circus."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2508.27,"end":2538.2,"speaker":"Fr Andrew Stephen Damick","text":"I was raised with this idea about St. John's gospel. Not to impugn it. Right. But just simply to say, oh, well, St. John is using these pre existing Greek philosophical concepts in order to, you know, begin sort of talking to the nations, was, I think, the way that it was. It was usually described to me, you know, that he deliberately is using Greek Logos philosophy to make his case. So I mean, there is a kind of conservative version. Right. Of all of that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2538.36,"end":2540.36,"speaker":"Fr Stephen De Young","text":"Right. This isn't just all whack jobs."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2540.52,"end":2541.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2542.04,"end":2542.88,"speaker":"Fr Stephen De Young","text":"Well, meaning people."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2542.88,"end":2555.77,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly, exactly. But I think a lot of it just comes from, like you said, there's this assumption that comes as a result of the concerns of the Reformation and. And then it just sort of cascades from there in a lot of different ways."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2556.17,"end":2568.01,"speaker":"Fr Stephen De Young","text":"Yeah, right. It establishes a paradigm and that paradigm then gets applied in ways that the people who came up with that paradigm didn't necessarily intend. Some of them, they would have been appalled By."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2568.33,"end":2568.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2568.81,"end":2573.21,"speaker":"Fr Stephen De Young","text":"But it sort of takes it. Once you let something loose into the world, it takes its own course. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2573.69,"end":2625.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I'll just say, before we get into what we're really going to talk about in this episode, for those who are interested in maybe looking at this question in the other direction temporally, like, okay, what does it look like for this Christianity and classical culture to interact? What does it look like after the New Testament stuff? There is a great book that has exactly that title, Christianity and Classical Culture by Yaroslav Pelikan. And he shows, frankly, how what happens is instead of the church being Hellenized, Hellenism became Christianized is what actually occurred. The influence went the other way, that it transformed classical culture by virtue of its contact with Christianity. So just to put a plug out there for a book by a guy who really does know what he's talking about and may God rest his soul."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2626.15,"end":2642.61,"speaker":"Fr Stephen De Young","text":"Right, yeah. And that's why we're going to spend the time we're about to spend on Philo, for example, is to understand that because this paradigm isn't just applied to fight like Philo, you know, unless you're at least a little bit of a Bible nerd, you've probably never heard of him, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2642.69,"end":2643.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2643.13,"end":2656.25,"speaker":"Fr Stephen De Young","text":"He's not a church father. He's not a saint. Right. You know, like rehabilitating him is not crucial, but the paradigm and the judgment and the way of reading that's applied to him is also applied by the same people to the church fathers."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2656.25,"end":2657.74,"speaker":"Fr Andrew Stephen Damick","text":"Right? Exactly, exactly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2657.74,"end":2673.42,"speaker":"Fr Stephen De Young","text":"And there it becomes important. Right. Because you're talking about undermining sort of fundamental Christian doctrines. Right. Which are no longer seen by some of our friends as fundamental Christian doctrines because they're now quote, unquote, Greek."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2673.5,"end":2674.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2674.94,"end":2675.86,"speaker":"Fr Stephen De Young","text":"That come in later."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2675.86,"end":2688.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So but before all that, before all of that way, way deep into the Old Testament, you have this phrase exists in Hebrew. So what is it in Hebrew?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2689.24,"end":2714.12,"speaker":"Fr Stephen De Young","text":"So you have this debar Yahweh. Right. Which Yahweh, obviously is the name of the God of Israel. And then the word before that is debar, which is usually translated as word. And so that phrase is usually. You'll see it in your English Bibles. It's not really translating it, but you'll see it in your English Bibles as the word of the Lord."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2714.44,"end":2714.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2714.6,"end":2716,"speaker":"Fr Stephen De Young","text":"Or Lord in all caps."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2716,"end":2721.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or sometimes word of God and then God in all caps. Because they're trying to communicate Yahweh with that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2721.96,"end":2778.19,"speaker":"Fr Stephen De Young","text":"Right. And so this is very similar to what we talked about last time, when we talked about the angel of the Lord, right, Where it was malak, Yahweh, right. Where you have the two words sort of set next to each other, right. And then they relate to each other. And the word of is put in there in English sort of to punt in terms of the relationship between the two. But so we have to start in this case with dabar and what that means. It can be translated word, but it has a very broad range of meaning. So if you go and decide, I'm going to learn biblical Hebrew today, and you go and you buy a set of biblical Hebrew flashcards, the flashcard for debar will say on the back, word, comma, matter, comma, thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2782.19,"end":2785.07,"speaker":"Fr Andrew Stephen Damick","text":"Which is even broader than the Greek concept of logos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2786.03,"end":2795.31,"speaker":"Fr Stephen De Young","text":"Right. So that's wide open, but you can tell from. And matter. There is not matter like material. It's matter like a matter, a matter of discussion."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2795.47,"end":2797.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. A matter for issue or a question."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2798.11,"end":2852.89,"speaker":"Fr Stephen De Young","text":"Right, right. And so this is word kind of in the sense of concept. Right. Like, and it's thing, the way we would say that's not a thing or that is a thing. Right. Like, it's, It's. It's not. It's definitely not limited to a written word or even a spoken word. Right. It goes sort of beyond that. Okay, Right. So, but it is the kind of thing that would be communicated in language, right? It is something that would be communicated, and language would be one way to communicate it, I should say. We've talked about others, music, art, ritual. Right. But it's. It's, you know, it's. It's. What would be behind that, Right. It would be the. If you talk about the sign and the thing signified, this would be the thing signified."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2852.97,"end":2856.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right, right. The referent, as it were. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2856.82,"end":2881.85,"speaker":"Fr Stephen De Young","text":"Right. And so when you put that, just like as we talked out, talked about with the angel of the Lord, when you put the two words together, there is a way in which that could be taken in a possessive sense. Right. Like Yahweh's word. Right. And that's borne out. There are places in the Old Testament where the God of Israel says, refers to my word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2882.33,"end":2891.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's where you kind of get some space then for the English use of. Of where, which we often use to refer to something as, you know, possessive or genitive."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2892.01,"end":2902.01,"speaker":"Fr Stephen De Young","text":"Right, right. But there are also other English ways to sort of talked about last time, like Fistful of Dollars."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2902.09,"end":2902.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2904.17,"end":2904.57,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2907.48,"end":2907.72,"speaker":"Steve","text":"The."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2907.8,"end":2928.08,"speaker":"Fr Stephen De Young","text":"And one way is that it's kind of adjectival Right. So like another example from the Scriptures, if we say the crown of glory, right. That's not a crown, that's made of glory. Right. Glory isn't the substance that makes it up. And it's not a crown that belongs to glory."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2928.08,"end":2928.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2928.6,"end":2992.64,"speaker":"Fr Stephen De Young","text":"It's a glorious crown. Right? Yeah, yeah. It's being used like an adjective. Right. And so just like we talked about with the angel of the Lord, another way of reading this is we said that could just be the Yahweh angel. Right. This could be the Yahweh word. Right. And that's another way to understand. And, and that gets at, as we're going to see a way in which this is referred to in a personal sense. In the same way that sort of the Yahweh angel sort of is Yahweh, we're going to see that the word of Yahweh sort of is Yahweh. Right? Now, sometimes in the Hebrew they will use the word rima instead of debar. And this is a place where I'm going to have to reemphasize. I know how mad people got when I talked about the different words for love. They always do when I bring that up. But synonyms are a thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2992.8,"end":2994.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes, there are synonyms in the Bible."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":2994.8,"end":3000.56,"speaker":"Fr Stephen De Young","text":"Synonyms are dabarim. Oh, yeah. See what I did there? Nice."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3000.88,"end":3035.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because I know much is made of this by, especially our friends in the Word Faith Pentecostal movement where they literally. It's Rhema Bible College. Right. Or, you know, the, the Rhema Institute. You know, it's rhema. Really. Well, if you're pronouncing it with modern Greek pronunciation, you know, this idea that it's the spoken word versus the more kind of conceptual word, but, but actual biblical usage pretty much makes them synonyms. Right. Debar and, and rima."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3036.22,"end":3036.66,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3036.66,"end":3042.38,"speaker":"Fr Andrew Stephen Damick","text":"Or yeah, yeah, I mean, rima, the, the Greek term logos. Yeah. Excuse me? Yeah, logos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3043.04,"end":3063.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. And. And so, yeah, they're just synonyms. Sometimes. Sometimes, you know, there's not a reason. It's just a particular author's preference or that kind of thing. To prove that they're a technical term, you have to demonstrate that each term is only used consistently one way in a given writer."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3063.36,"end":3064.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3064.72,"end":3074.81,"speaker":"Fr Stephen De Young","text":"And then you can prove that now again, a modern person is perfectly fine to make theological distinctions and label them with Greek words. Yes, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3074.81,"end":3078.89,"speaker":"Fr Andrew Stephen Damick","text":"But they shouldn't in the modern day that. That's the way the Bible uses those words."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3079.29,"end":3086.09,"speaker":"Fr Stephen De Young","text":"Right. Because then the problem is people go back and read those distinctions back into the Bible. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3086.17,"end":3086.73,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3086.81,"end":3089.69,"speaker":"Fr Stephen De Young","text":"Right. And that gives you a false sense. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3090.01,"end":3184.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one of the proofs that you know that these words are interchangeable, they are synonyms, is the way that it gets worked out in translations, which, you know, what is a translation. A translation is on some level, an interpretation because it shows you what the understanding of the translator is when he translates a particular word. One of the examples that I ran across, actually, while studying Old English is so Alvric, who was an abbot in England that did a lot of translations of religious texts. He was translating Genesis chapter three from the Vulgate, from the Latin Vulgate into Old English. And I can't remember if I've mentioned this on this podcast before. I don't think so. But he, you know, in. When. When the serpent is speaking to Eve and he says to her, you know, don't you know you'll be as gods? That's. That's the word that's used in. In. In the Latin. Right. It's the word for gods. Whereas when. When Alvric translated it, he has the serpent say, don't you know, you'll be as ang. Angels. Which it's interesting because Old English does have a word for gods. I mean, it's basically God, by the way. Good. You know, but he translates as angels, which shows what his understanding of what's being talked about there is. And so that's an example of the way that translation lets you know what the understanding of the translator is. And so that's why you can then use translations as a way to kind of triangulate backwards to see how these texts are received in particular communities and. And what the understanding of them is."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3186.15,"end":3191.11,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. And. And, yeah, all translations require interpretation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3191.11,"end":3191.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3191.35,"end":3193.43,"speaker":"Fr Stephen De Young","text":"I mean, there's no such thing as a neutral translation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3193.43,"end":3194.63,"speaker":"Fr Andrew Stephen Damick","text":"There's no way around it. Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3194.79,"end":3198.23,"speaker":"Fr Stephen De Young","text":"Yeah. Words in one language do not equal words in another language."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3198.23,"end":3198.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3198.67,"end":3201.71,"speaker":"Fr Stephen De Young","text":"Even if they're related etymologically, they still aren't equal."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3201.71,"end":3205.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even if the languages are closely related, it's just still."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3205.19,"end":3205.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3205.95,"end":3207.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3209.39,"end":3290.71,"speaker":"Fr Stephen De Young","text":"So with that in mind. Right. What happens? This is going to be sort of an object case, and then we're going to sort of put this into practice with. With the rest of the Bible and the other two halves of the program. What if we approach Philo and the things that Philo says about the Logos from the perspective of the Old Testament, from the perspective of Second Temple Judaism rather than from the perspective of Greek philosophy? And this discussion is going to owe A lot to Daniel Boyarin's reappraisal of Philo. Daniel Boyarin is an Orthodox Jewish scholar of Second Temple Judaism, including teaching on the New Testament, because he sees it as firmly within Second Temple Judaism. And so he approaches it from of that way too. But he has done sort of a major reevaluation of Philo as an important part for him of his Jewish tradition and wanting to show how he actually brought Jewish ideas into Middle Platonism rather than vice versa. And so, yeah, so he wants to see Philo as Judaizing Hellenism, not Hellenizing Judaism."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3290.92,"end":3307.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, as we mentioned, that Pelican book shows the Church Fathers doing basically exactly that. Christianizing Hellenism, not Hellenizing Christianity. So, I mean, in that way, Philo is kind of functioning in a sort of pre patristic way."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3308.92,"end":3311.36,"speaker":"Fr Stephen De Young","text":"Right. He's doing this a similar kind of thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3311.36,"end":3311.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3313.32,"end":3392.31,"speaker":"Fr Stephen De Young","text":"Trying to explain Judaism to Greeks the way the early Fathers would be explaining Christianity to Greeks and also just Judaizing Hellenism and Hellenizing Judaism. I know that sounds a lot alike, right? That sounds like maybe we were just playing a word game, right? You got your peanut butter and my chocolate. You got your chocolate in my peanut butter. Let's try it. But the key here is which of the two is controlling. That's what we're talking about, Right. We're talking about which is the master, which is the servant in this relationship. Right. Is it for Philo, is it Judaism that's in charge and he's using Greek ideas in service of that? Or is he using Greek, Is he appealing to Greek ideas and using Jewish language and ideas in service of that? Right. And the same thing then, with the Church Fathers and Christianity, are they Christians who are using Greek language and Greek ideas to serve the explanation of the Christian faith, or are they, as they've been accused, are they basically just Greek amateur philosophers throwing in some Christian language here and there? Right. Kind of in service of their Greek ideas?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3392.39,"end":3406.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you can tell that our position is that for Philo, it's Judaism that's in charge, and for the Church Fathers, it's Christianity that's in charge. And Hellenism is being put in service of those things."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3407.57,"end":3450.73,"speaker":"Fr Stephen De Young","text":"Yes. Just like translations, I am not neutral and I make no pretense to neutrality on this or anything else. Right. So, but looking at some of these same ideas that were used to say that Philo is basically a Platonist primarily. Right. If we approach those from the perspective of the teaching of the Old Testament and The perspective of Second Temple ideas. Right. So let's say we approach this impurity of the material world where he talks about God having these intermediaries between himself and the material creation. Right. Well, we've talked about that in past episodes. Right. This is. This is the Tower of Babel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3451.69,"end":3451.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3452.01,"end":3473.29,"speaker":"Fr Stephen De Young","text":"That because of the whole death by holiness problem, right. That produces the tabernacle, the Torah, the angelic princes of the nations, all of that is because for God to be close to sinful humanity, it's not that the material world is corrupt in and of itself by virtue of being material, but it has been corrupted."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3473.53,"end":3474.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3474.77,"end":3481.47,"speaker":"Fr Stephen De Young","text":"And so God's holiness is destructive. He has to step back and have these intermediaries out of love for his creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3481.47,"end":3486.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's that. It's the. It's the death by holiness thing. Yeah, yeah, that's what's going."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3486.27,"end":3553.16,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so it's very clear when, when you read Philo from this perspective, that, that Philo is talking about the Logos as sort of the supreme mediator between the two, because he's the one who sort of presides in the divine council. He's the one who, among all of these beings, these angelic beings, who. Philo is not shy about calling gods plural, but he is sort of supreme among them. Right. And sort of the commander of them and who mediate God to creations. And these intermediaries are not like Gnostic emanations from God. There's not sort of this scale of being with God at the top and matter at the bottom, and they're somewhere in between on these different levels. These are. Philo is very clear. These are created beings, these are created gods who are not worshiped in their own right. Who are created by God and assigned sort of administrative duties. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3553.32,"end":3555.88,"speaker":"Fr Andrew Stephen Damick","text":"Yep. The divine counsel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3556.68,"end":3557.24,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3558.76,"end":3559.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3559.32,"end":3602.79,"speaker":"Fr Stephen De Young","text":"And you know, you look at sort of a subset of this is that he sees the Logos as being the. The Logos, the Word, as being the instrument through which God creates the creation. Right. And again, you could take that in this sort of Platonic way, the way the later Gnostics did, because Plato's Timaeus was found, for example, amid the Nag Hammadi texts. Right. Just mixed in with the Gnostic texts. In Plato's Timaeus, there is. Because the good, Right. Being itself, can't know lesser things. Right. It's sort of naturally detached from everything else that exists."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3602.79,"end":3604.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Only itself."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3604.75,"end":3639.17,"speaker":"Fr Stephen De Young","text":"Right. There's. There's this lesser being, the demiurge, Right. Who sort of loves the good and so fashions things sort of as best it can after the good. And so if you approach Philo from that direction, you could say, oh, see, the Logos is like the demiurge, right. It's this lesser thing that creates. Right. But if we approach this from perspective of the Old Testament, you Crack Open Genesis 1, right. Right. From the beginning, God creates by speaking the word, Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3639.49,"end":3640.05,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3640.13,"end":3669.18,"speaker":"Fr Stephen De Young","text":"That's the instrument through which he creates is the word in Genesis. It's got nothing to do with anything of the Timaeus, right? Now, now, would Philo, if he was talking to a Platonist, would Philo have pointed to that and drawn some connection to try to help the Platonist understand what he was saying about Genesis? Probably. Right, right, right. But that doesn't mean that he means the same thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3669.18,"end":3685.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he could say, look, look, look, pal, it's. It's like the demiurge, but. But here's some important ways in which that is not true as well. Again, one of the distinctions that you like to draw a lot, there's continuities and there's discontinuities. And the discontinuities are very important."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3687.57,"end":3711.4,"speaker":"Fr Stephen De Young","text":"Right. And so he not only has the Logos there at the beginning of the creation, remember, creating is putting things in order. Right. And it's not only that he puts things in order, but for Philo, the Logos continues to be present and keep things in that order. You can compare to that Colossians 1:17."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3713,"end":3722.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. So Colossians 1:17, saying about Christ, and he is before all things, and in him all things hold together."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3724.36,"end":3742.68,"speaker":"Fr Stephen De Young","text":"Right. So that same kind of idea. Right. It's coming from St. Paul. And so one of the key discontinuities, as you were just mentioning, between some of these other views is that Philo clearly holds that the Logos is a person."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3742.92,"end":3743.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3743.48,"end":3744.44,"speaker":"Fr Stephen De Young","text":"A personal being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3744.44,"end":3748.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not a kind of emanation or. I mean, that's probably the most obvious."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3748.68,"end":3751.72,"speaker":"Fr Stephen De Young","text":"Thing, but, you know, or a power or force."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3751.8,"end":3752.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3752.92,"end":3762.96,"speaker":"Fr Stephen De Young","text":"Like the. Like the Logos in Stoicism. Right. Where it's this sort of force. Yeah. And power, but sees it as a person with an identity."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3762.96,"end":3770.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, one of the powers in heaven. Right. One of the two powers in heaven. One of the. You know. Yeah, Yep, yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3770.52,"end":3783.24,"speaker":"Fr Stephen De Young","text":"Right. And Philo goes so far at one point to refer to the Logos as the firstborn of God. Now, don't get too excited. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3784.68,"end":3787.99,"speaker":"Fr Andrew Stephen Damick","text":"I was about to get excited, but then I remember the notes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3788.63,"end":3808.15,"speaker":"Fr Stephen De Young","text":"Yeah, right. This, you know. Oh, wait, we got vegetarianism at least here. Right. And Philo actually has three he actually has a concept of the Spirit too. But ultimately when you get into the details, Philo was basically what we would later call a semi Aryan."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3808.31,"end":3808.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3809.59,"end":3820.79,"speaker":"Fr Stephen De Young","text":"He believed that the, the Logos and the Spirit sort of came into being, but they were produced from God's own essence."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3820.95,"end":3823.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they're kind of creations on some level."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3824.55,"end":3826.55,"speaker":"Fr Stephen De Young","text":"Right. But they're not made of other stuff."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3826.95,"end":3843.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. And I mean, it's important, you know, when we talk about Philo and we mention up to this point, pretty much we would agree with almost all these things he says we're not claiming him as some kind of shadow church father or whatever."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3843.29,"end":3843.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3843.61,"end":3850.57,"speaker":"Fr Andrew Stephen Damick","text":"He's not a Christian, you know, he does not have the gospel presented to him. But it's interesting how much he gets. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3851.61,"end":3863.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, because what he's reflecting is he's reflecting in Greek. Right. Sort of the pre existing ideas of Second Temple Judaism. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3863.93,"end":3865.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This stuff is in the end."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3865.85,"end":3893.27,"speaker":"Fr Stephen De Young","text":"Yeah. And the apostles are going to take this because the apostles are worshiping the same way, believing the same things, reading the same texts, but they're going to encounter the person of Jesus Christ and that's going to let them connect the dots. Right. That's going to let them make the big important connection here. And just as a callback to our last episode, Philo also identifies the Logos as the angel of the Lord."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3893.67,"end":3894.31,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3894.31,"end":3911.75,"speaker":"Fr Stephen De Young","text":"So he says, when Debar Yahweh or Malak Yahweh shall show up in the Old Testament, it's the same person. It's the same person. The same second power in heaven kind of idea that we've talked about before. And so lastly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3911.83,"end":3919.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and this is right before we go to our first break, we're going to shift away from Alexandria and head back down into Palestine."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3920.39,"end":3923.23,"speaker":"Fr Stephen De Young","text":"Yeah. And it's environs. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3923.23,"end":3924.39,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And thereabouts."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3925.66,"end":3945.1,"speaker":"Fr Stephen De Young","text":"Yeah. And that's to. We're gonna have some fun with Aramaic briefly. And that's in what are called the Targums. And the Targums are. They're, they're usually referred to as Aramaic translations of the Hebrew Scriptures."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3945.9,"end":3959.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. But, but they're not exactly. And, and the reason. Yeah, so, so what are they? So by the first century, people in Palestine and Israel don't speak Hebrew."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3959.88,"end":3960.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":3960.2,"end":4019.49,"speaker":"Fr Andrew Stephen Damick","text":"It's just a liturgical language by this point. And only those who are really educated in that actually will be able to speak it. And so what they would do is if you'd go to the synagogue, the scripture would be read in Hebrew by someone who could Read out loud in Hebrew. And then there would be a Targum recited, which is essentially a summary of the Hebrew text, but in Aramaic. So the idea. So, you know, if you went there, since if you were a local, you know, you would speak Aramaic or maybe Greek also, and you would hear it read in Hebrew, you wouldn't know what it said. And then someone would read this Targum that would basically say, okay, what he just said was. And then he would read off the summary, and then you would be able to get that, because you would understand that in Aramaic, because again, Hebrew is not being a spoken language in the first century. It's already just a liturgical language by that point."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4020.21,"end":4028.05,"speaker":"Fr Stephen De Young","text":"So we will now have a profound test of Father Andrew's honesty, since this is prerecorded, because I am about to actually."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4028.21,"end":4029.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, go for it. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4029.09,"end":4034.99,"speaker":"Fr Stephen De Young","text":"No, actually, will this remain in the recorded episode or will he edit it to make himself correct me?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4035.15,"end":4036.91,"speaker":"Fr Andrew Stephen Damick","text":"That was my best understanding."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4037.63,"end":4042.39,"speaker":"Fr Stephen De Young","text":"Yeah. So one of those things was not quite right. And one of those things was the opposite of correct."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4042.39,"end":4046.03,"speaker":"Fr Andrew Stephen Damick","text":"Okay, great. So hook me up, yo."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4046.43,"end":4061.97,"speaker":"Fr Stephen De Young","text":"So the one that was not quite right was if you went to a synagogue in the first century in particular, you would be just as, depending on where you are in the world, maybe more likely to. To only hear the scriptures read in Greek."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4061.97,"end":4064.97,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay, that is true. I was thinking about Palestine."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4064.97,"end":4066.73,"speaker":"Fr Stephen De Young","text":"That's the not quite right part."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4066.73,"end":4068.33,"speaker":"Fr Andrew Stephen Damick","text":"Okay, gotcha, gotcha."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4068.33,"end":4103.19,"speaker":"Fr Stephen De Young","text":"But even in Palestine, even in Galilee, for example, they were primarily using Greek if you're in Judea. Right. So the rule was you had to. This is how highly they respected in pre Christian Second Temple Judaism, how highly they respected the Greek translations of the Old Testament, was that you could read it instead of the Hebrew in synagogues, you could not read the Aramaic instead of the Hebrew. If you read the Aramaic, you had to also read the Hebrew. Okay, okay. So that's the part that wasn't quite right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4103.19,"end":4103.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4104.63,"end":4116.23,"speaker":"Fr Stephen De Young","text":"So the part that was the opposite of correct is you can say, right, it's okay. Instead of. Well, I'm kind of doing a Plato riff there. It's subtle. Anyway."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4118.36,"end":4121.08,"speaker":"Fr Andrew Stephen Damick","text":"So the."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4121.16,"end":4125,"speaker":"Fr Stephen De Young","text":"The Targums were actually not summaries, they're actually expansions."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4125.56,"end":4126.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I see."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4126.44,"end":4127.6,"speaker":"Fr Stephen De Young","text":"Of the Hebrew text."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4127.6,"end":4131.4,"speaker":"Fr Andrew Stephen Damick","text":"Well, I wasn't as strong as I. As I suspected for a second there that I was going to be."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4131.96,"end":4139.16,"speaker":"Fr Stephen De Young","text":"So they would. The text was translated into Aramaic, but then it was also expanded upon and elaborated."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4139.16,"end":4139.68,"speaker":"Fr Andrew Stephen Damick","text":"I see."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4139.68,"end":4201.02,"speaker":"Fr Stephen De Young","text":"And different Targums, which are usually named based on where they were found or based on a Rabbi associated with them. There's a bunch of different. The city they were found in, like in Egypt, that kind of thing. Different Targums had different philosophies. So some of them would be more like the message that we talked about last time, where it's an expansion in the sense that it would get sort of really colloquial or use like four or five words to explain the meaning of one Hebrew word. Right. To kind of get at what they thought. The idea was this is why you couldn't read it instead of the Hebrew. Right. Because it might give you the wrong idea. Right. They weren't necessarily endorsing what every commentator thought, but some of them were even wilder than that. Some of them have whole stories that aren't in the Hebrew text just inserted, like traditional stories and stuff. So you can find. There's a wealth of literature from this period just found in the Targums in these versions of stories."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4201.6,"end":4203.6,"speaker":"Fr Andrew Stephen Damick","text":"So they function as commentaries as well, then."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4204.16,"end":4230.89,"speaker":"Fr Stephen De Young","text":"Right, right. And one of the most interesting things, I'm just going to throw this out and then do nothing with it. So deal with it, everybody, as you try to fight off your turkey coma and keep listening to this episode. So when Christ famously from the cross says, eli, Eli lama sabachthani."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4230.89,"end":4231.41,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4231.73,"end":4242.69,"speaker":"Fr Stephen De Young","text":"Right. And we know he's quoting Psalm 22 because he's praying Psalm 22. He's praying the Targum of it. That's Aramaic, not Hebrew."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4242.69,"end":4244.05,"speaker":"Fr Andrew Stephen Damick","text":"I knew he was doing Aramaic."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4245.09,"end":4245.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4245.57,"end":4247.77,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4247.77,"end":4250.37,"speaker":"Fr Stephen De Young","text":"And now I'm going to do nothing with that. I just threw it out there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4250.45,"end":4251.01,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4251.73,"end":4252.93,"speaker":"Fr Stephen De Young","text":"Do with it what you will."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4253.01,"end":4260.21,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's not a big secret. See, I'm actually feeling okay that I wasn't actually as hard as I suspected I was about to be."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4260.21,"end":4261.21,"speaker":"Fr Stephen De Young","text":"I try to be kind."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4261.37,"end":4262.65,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Very nice."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4262.89,"end":4264.29,"speaker":"Fr Stephen De Young","text":"I often fail, but I try."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4264.29,"end":4267.13,"speaker":"Fr Andrew Stephen Damick","text":"You can brutalize me when we. When we hit the stop button."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4269.53,"end":4310.94,"speaker":"Fr Stephen De Young","text":"So, okay, so, yes, I withstood you to your face in Antioch. No. So, right. So one of. One of these minor expansions of the text or commentaries on the text. Right. Is that we frequently see in Targum, and this is across several different Targums. We see that places where Yahweh, where the Lord, the name of the God of Israel is mentioned, there will be inserted where there isn't in the Hebrew text. Memra, which is the word. Word. Memra is word Aramaic."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4311.43,"end":4311.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4311.91,"end":4417.5,"speaker":"Fr Stephen De Young","text":"And so it's basically even in places where it doesn't say the word of the Lord. It just Says the Lord, this will add it. So it says word of the Lord. And this isn't haphazard. There's a pattern. This gets added. Places where God is seen by somebody, where Yahweh is described as having body parts, where Yahweh eats with someone, any of those things that have to do with having a body or being seen, any of those where it isn't already present, Memorah gets added. So it's the word of the Lord. And this is a way, within this interpretation of the text. This is a way to deal with one of the problems we were, we talked about last time. Like in Exodus, we're in the same chapter, Right. Talk to Moses, talks to Yahweh face to face, mouth to mouth. The way a man speaks to his friend. And then was eight or nine verses later, you can't see me and live. Right, right. This is one of the ways of dealing with that. Right. It's making they. They see this pattern in some parts of the text and we're going to go through those parts in our second half. They see this pattern in parts of the Old Testament where there's this figure of the word of Yahweh, the word of the Lord who has seen and interacted with and does these things. And then there's this other sense in which Yahweh can't be seen. And their way of doing that is. Well, we'll take this distinction that we see in some parts of the Old Testament and we'll just make it consistent across the whole thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4419.43,"end":4425.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, cool. All right. Well, with that, we're going to go ahead and go to our first break and we'll be right back."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4426.39,"end":4439.11,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4439.43,"end":4483.51,"speaker":"Steve","text":"That's 855-AF-RADIO. St. Ignatius, first century bishop of Antioch, called the God Bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God. Fr. Andrew Damoch recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he martyrdom, salvation in Christ, the Bishop, the unity of the Church and the Eucharist."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4483.67,"end":4488.87,"speaker":"Fr Andrew Stephen Damick","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense which."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4488.87,"end":4490.55,"speaker":"Fr Stephen De Young","text":"That can be challenging for us because."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4490.87,"end":4492.87,"speaker":"Fr Andrew Stephen Damick","text":"Number one, he doesn't seem to have."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4492.87,"end":4503.71,"speaker":"Fr Stephen De Young","text":"Any reticence at all about going to martyrdom. Like, there's no sense of, well, this is what I have to do. You know, I wish I didn't have to, but this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4503.95,"end":4514.51,"speaker":"Steve","text":"To find this book and others like it. You can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4514.51,"end":4529.32,"speaker":"Announcer","text":"Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-7-2346. That's 8-55-AF radio."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4535.56,"end":4553.41,"speaker":"Fr Andrew Stephen Damick","text":"Well, welcome to the second half of the show. And normally, normally we would take your calls like you just heard the voice of Steve say. But again, this is a pre recorded episode. Hope everyone at least the United States is having a great Thanksgiving. If you're outside the United States, well, I hope you're having a very nice day wherever it is that you are."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4553.97,"end":4556.25,"speaker":"Fr Stephen De Young","text":"You're really disappointed that this isn't live."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4556.25,"end":4556.77,"speaker":"Fr Andrew Stephen Damick","text":"I am."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4557.09,"end":4558.17,"speaker":"Fr Stephen De Young","text":"No reason for it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4558.17,"end":4576.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So. Okay. Well, we have another message that was left for us. And this one is we'll kind of wonderfully introduce what we're talking about in the second half. This one, our caller is asking about something he read in the Book of Jubilees. So here it is."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4577.02,"end":4578.62,"speaker":"Photani","text":"Hello, Father Andrew and Father Stephen."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4578.62,"end":4579.98,"speaker":"Fr Stephen De Young","text":"This is Thano from Illinois."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4580.38,"end":4582.62,"speaker":"Photani","text":"I finally caved and downloaded an audiobook."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4582.62,"end":4591.58,"speaker":"Fr Stephen De Young","text":"Version of the Book of Jubilees. And as I was listening, my ears perked up at the following verse from the beginning of chapter 14. On the new moon in the third."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4591.58,"end":4593.22,"speaker":"Photani","text":"Month, the word of the Lord came."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4593.22,"end":4596.9,"speaker":"Fr Stephen De Young","text":"To Abram in a dream, saying, fear not, Abram, I am thy defender and."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4596.9,"end":4601.54,"speaker":"Photani","text":"Thy reward will be exceeding great. It seems like an Occam's razor reading."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4601.54,"end":4605.91,"speaker":"Fr Stephen De Young","text":"Of this passage would suggest that the word here is just God's immaterial voice."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4605.91,"end":4609.27,"speaker":"Photani","text":"Not necessarily the second person of the Trinity."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4609.75,"end":4611.87,"speaker":"Fr Stephen De Young","text":"I've wondered for quite some time prior."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4611.87,"end":4619.59,"speaker":"Photani","text":"To the Gospel of John, what evidence is there that the word of the Lord is indeed the hypostasis of God, Christ. Thank you."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4619.75,"end":4627.43,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Jubilees, chapter 14, right? It's basically a rehashing of Genesis 15, isn't it?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4628.23,"end":4629.43,"speaker":"Fr Stephen De Young","text":"A light remix."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4629.43,"end":4632.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There you go. A Targum, maybe? No."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4632.55,"end":4633.03,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4634.1,"end":4634.98,"speaker":"Fr Andrew Stephen Damick","text":"As I've just learned."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4634.98,"end":4637.86,"speaker":"Fr Stephen De Young","text":"Honestly. Honestly, sort of. Yeah, sort of."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4637.86,"end":4638.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4639.06,"end":4642.02,"speaker":"Fr Stephen De Young","text":"There's a, there's a paper kind of thing. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4643.86,"end":4645.62,"speaker":"Fr Andrew Stephen Damick","text":"Not for me. I'm not writing that paper."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4645.86,"end":4650.14,"speaker":"Fr Stephen De Young","text":"Yeah, but, you know, I mean, not exactly, but there's a. There. There something there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4650.14,"end":4650.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4652.02,"end":4659.86,"speaker":"Fr Stephen De Young","text":"So. Yeah, and it's. It's a sort of light remix of. Of Genesis 15, verses 1 through 7."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4659.86,"end":4675.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The word of the Lord comes to Abram in a dream in Jubilees. And so that's the basis of Thanos question. But then in Genesis 15, it's not a dream exactly. It's. What. What's the word that's used there?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4676.28,"end":4677.4,"speaker":"Fr Stephen De Young","text":"It's in a vision."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4677.48,"end":4683.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which dream? Vision. I mean, you know, these are often the same kind of thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4684.36,"end":4715.62,"speaker":"Fr Stephen De Young","text":"Yeah. They're. They're. They're not totally dissimilar. And probably the. The connection is based on sort of a. I mean, Jubilees is written much later. Right. So we're talking in the post exilic period. And so you have a lot in. As you see in the book of Daniel. Right. In Babylonian thought, you have a lot of dream prophecy. Whereas when you're looking at that period of ancient Israel's history, that would be reflected in Genesis. Prophets were seers."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4715.78,"end":4716.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4716.22,"end":4738.6,"speaker":"Fr Stephen De Young","text":"Right. Who saw, you know, visions. So that. That's probably the connection. There is. Try to get at the same idea and that this is a prophetic thing, but. Yes, but. So if the word of Yahweh comes to Abram in a vision, that tells you right off the bat, Right. That he's seeing something."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4738.6,"end":4740.12,"speaker":"Fr Andrew Stephen Damick","text":"It's visual. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4740.28,"end":4749.77,"speaker":"Fr Stephen De Young","text":"So that's not. It's not, as it's sometimes depicted in movies or just in our imagination, that the word of the Lord coming to someone means they hear a voice."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4749.77,"end":4752.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A disembodied voice."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4754.45,"end":4810.86,"speaker":"Fr Stephen De Young","text":"They hear Morgan Freeman somewhere off speaking, and that's it. No, so they see someone. Right. And so Abram, in this instance, in Genesis 15, in verse 2 and verse 8, he calls this person who he's seeing the Lord Yahweh, which creates kind of a problem for English translations, at least modern English translations, because they are sticking by the rabbinic Jewish thing of not wanting to print the name Yahweh. But their general pattern is that when they get that, they replace it with Lord in all caps. But if they did that here, then Abram would be calling him the Lord. Lord."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4811.18,"end":4816.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they translate it usually as Lord God, and then God in all caps."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4817.02,"end":4819.58,"speaker":"Fr Stephen De Young","text":"Yeah. Even though the word God is nowhere in the text."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4819.66,"end":4821.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It simply says Yahweh."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4822.62,"end":4848.17,"speaker":"Fr Stephen De Young","text":"Yeah. So this is. Add this to the list of reasons why we just go ahead and say it to convey what's actually there in the text. But the important thing here is that this figure, who is identified in the narrative of verse one as the Word of Yahweh, who comes to him in a vision, is called by Abram, Lord Yahweh. And the figure does not correct him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4848.41,"end":4849.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4849.61,"end":4855.37,"speaker":"Fr Stephen De Young","text":"Doesn't say, wait, wait, wait. I'm just messenger. I'm just this guy named Word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4855.45,"end":4871.67,"speaker":"Fr Andrew Stephen Damick","text":"So it's clear that Abram refers to the word of the Lord who comes to him as being Yahweh, the God of Israel. And the Word of the Lord does not say, no, no, no, no, don't call me that. He accepts it because it's true. Yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4872.47,"end":4883.51,"speaker":"Fr Stephen De Young","text":"And it isn't that there's a switcheroo that happens here, because in verse four, after the first time Abram calls him that he is again referred to as the Word of Yahweh."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4883.59,"end":4883.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4885.19,"end":4889.47,"speaker":"Fr Stephen De Young","text":"And then in verse seven, the Word of Yahweh calls himself Yahweh."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4889.7,"end":4894.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then in verse 8, Abram again calls him Lord Yahweh."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4894.9,"end":4909.7,"speaker":"Fr Stephen De Young","text":"Right. So we see here a pattern with the Devar Yahweh that we already saw last time with the angel of the Lord with the Malak Yahweh, that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4912.02,"end":4912.38,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4912.38,"end":4951.05,"speaker":"Fr Stephen De Young","text":"Figure, this person, is both identified as Yahweh, the God of Israel, but also distinguished by the addition of another word. Right. In this case, the word Word in the last episode, the word angel or messenger. Right. So that's sort of our Exhibit A from the Old Testament. And as you mentioned at the beginning, I know last time we went through every mention of the angel of the Lord, at least in passing, at least briefly. We honestly can't do that for a word of the Lord."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4951.05,"end":4952.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a bunch."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4952.01,"end":4969.53,"speaker":"Fr Stephen De Young","text":"And Word of God, there's too many. But so we're going to talk about some very important ones. And then after we've gone through some very significant ones, we're going to sort of give some more general statements about certain portions of the Old Testament that will sort of convey the overall idea."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4969.53,"end":4992.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I. And I should point out here like, okay, so I just checked in. I checked the esv. I mean, mind you, different translations could do this differently, but I just checked the ESV, and there are 274 instances of word of the Lord that exists in the ESV. Right. And let's check Word of God 51 for Word of God. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4993.1,"end":4996.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. We don't have time to do each of those."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4996.02,"end":4996.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":4996.86,"end":5001.14,"speaker":"Fr Stephen De Young","text":"So, but we're Going to, I think, cover the ground adequately in the second half."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5001.14,"end":5001.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5002.32,"end":5004.64,"speaker":"Fr Stephen De Young","text":"And if you disagree, send your hate mail to Father Andrew."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5004.64,"end":5007.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep. I'll take it. Delete, delete, delete."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5009.84,"end":5017.6,"speaker":"Fr Stephen De Young","text":"So the next really significant one that we want to look at in a little depth is in first Samuel, chapter three."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5017.76,"end":5018.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5018.88,"end":5032.17,"speaker":"Fr Stephen De Young","text":"And this. It's the first 21 verses of that chapter. And this is basically the call of Samuel to be a prophet. So Samuel is at this point, a ute."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5035.05,"end":5035.77,"speaker":"Fr Andrew Stephen Damick","text":"Young guy."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5036.41,"end":5087.59,"speaker":"Fr Stephen De Young","text":"Yeah. And he has gone to, you know, I guess because they're trying to be consistent. There are a bunch of English translations that say he was in this passion, that he was sleeping in the temple of the Lord. Now, this is First Samuel. David isn't even king yet. I don't think David is even born yet, let alone Solomon. There is no temple. It's the house of the Lord. It's talking about at Shiloh, the place where the tabernacle was with the Ark of the Covenant. And when it says that he's sleeping in the temple of Yahweh, where the Ark of the Covenant was, it does not mean he's sleeping in the holy of holies on a cot. It means that the locale where he lives there. Yeah, yes, yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5087.83,"end":5088.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5089.03,"end":5133.43,"speaker":"Fr Stephen De Young","text":"So just to clarify that, but. So he's currently. Eli is the high priest, and his sons, his ne' er do. Well, sons are serving as priests. And so now this is the point where Samuel is going to be called to become a prophet. And in establishing that situation in verse one of that chapter, describing sort of the dire situation that Israel is still in, because, remember, we're coming out of the Book of Judges, so things are pretty dire. Yeah, they're still dire. We're told in that first verse that the word of Yahweh is rare because there are not many visions."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5134.72,"end":5146.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's an interesting way to put it. Which again, underlines that an encounter with the word of the Lord is a visual encounter."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5147.92,"end":5149.68,"speaker":"Fr Stephen De Young","text":"Right. It's an encounter with someone."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5150.08,"end":5152.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Someone that you can see."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5153.52,"end":5181.65,"speaker":"Fr Stephen De Young","text":"Yeah. Not with just an idea or a thought or a whisper or that kind of thing. And we're told that in verse seven, that Samuel himself did not know Yahweh, the God of Israel, because he hadn't seen the word of Yahweh. And the way that's phrased usually in the English translation will say something like, the word of Yahweh had not been revealed to him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5181.65,"end":5184.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's what it is in the esv."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5185.46,"end":5185.62,"speaker":"Photani","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5185.62,"end":5196.1,"speaker":"Fr Stephen De Young","text":"And that's kind of Ambiguous as to exactly what that means. Right. Because revealed to him could be a voice, could be a printed text. Could be. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5196.18,"end":5196.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5197.54,"end":5204.58,"speaker":"Fr Stephen De Young","text":"But the word there in Hebrew actually means to uncover or unveil or display something."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5205.3,"end":5209.7,"speaker":"Fr Andrew Stephen Damick","text":"So I'm guessing that in the Greek Old Testament that they use apocalypto for this."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5209.7,"end":5210.14,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5210.14,"end":5213.3,"speaker":"Fr Andrew Stephen Damick","text":"Which literally means unveiling or taking away the veil."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5213.3,"end":5216.52,"speaker":"Fr Stephen De Young","text":"Right, right, right. So the idea is it's there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5217.56,"end":5217.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5218.2,"end":5299.52,"speaker":"Fr Stephen De Young","text":"You just can't see it until the veil is removed. So, again, this is vision language again. And this establishes that the way he would have come to know the God of Israel is through seeing the word of Yahweh. Right, yeah. And so that first verse means that the word of Yahweh is rare. There's not many visions. That means the knowledge of God is kind of lost to Israel, and Samuel is being called as a prophet. To counter that, that also means that. Right. When we talk about, in The New Testament, St. John's Gospel, again, being a very important center of this idea, talking about people not being able to come to know God apart from Christ. Right. This is part and parcel of the same theology in the Old Testament that there is this figure, there is this person, the word of Yahweh, through whom. That's the only way people come to know Yahweh, through an encounter with the Word or with someone who the Word sends out, someone who does see the Word, and who he then sends out to proclaim what he says."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5299.6,"end":5303.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the prophets. Yeah, exactly. Prophets and, you know, later apostles."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5303.96,"end":5305.04,"speaker":"Fr Stephen De Young","text":"The apostles, yeah. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5305.04,"end":5305.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5307.36,"end":5354.04,"speaker":"Fr Stephen De Young","text":"And so within this story, Samuel's a kid, he's sleeping, and he hears this voice calling out to him. And three times the voice calls out to him and says, hey, Samuel. Samuel, wake up. Right. And he thinks it's Eli, because Eli is now an old man. He's the high priest. Samuel's there helping him, Right. So he goes running over to Eli to see what he wants. And the. The first couple times, Eli's like, go to bed. I didn't say anything. Right. Buzz off, puzzle. Younger, if you're Dutch. Right. Sends him back to bed. The third time, Eli figures out something's going on. Right? Like, I'm not calling you, but clearly you're. You're hearing someone call to you."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5354.04,"end":5364.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what's interesting to me about that is that it's. It sounds so much like a voice, like a human voice, apparently, that Samuel can think that it's Eli."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5364.88,"end":5367.6,"speaker":"Fr Stephen De Young","text":"Right. So it isn't like thundering off the rafters."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5368.08,"end":5368.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5369.28,"end":5383.87,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. It isn't like metallic sounding or. Yeah. And so that third time he says, okay, well, next time say, well, here I am. Right. See what it says to you?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5383.87,"end":5386.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Speak, Lord, for your servant hears."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5386.75,"end":5421.61,"speaker":"Fr Stephen De Young","text":"Yeah. And so he says, okay, Right. And so then in verse 10 of that chapter, we get the fourth time, but we're told that Yahweh comes and stands as at the other times, calling to him. He stands by his bed. So that tells us that since it's as the other times, all four times, again, it's not just a voice calling out to him, but Yahweh has come and stood next to his bed."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5421.61,"end":5424.69,"speaker":"Fr Andrew Stephen Damick","text":"There's a bodily. Yeah, a bodily presence."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5425.33,"end":5450.13,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. And so after the call, he then, you know, Samuel responds. That time he interacts. Right. With. With Yahweh, the God of Israel, judgment is pronounced against Eli and his family. And then in verses 20 and 21, it summarizes what just happened."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5450.29,"end":5471.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So it says this. And all Israel from Dan to Beersheba, knew that Samuel was established as a prophet of the Lord. And the Lord appeared again at Shiloh. For the Lord revealed himself to Samuel at Shiloh by the word of the Lord. And again, that revealed is that sense of uncovering or unveiling or being displayed."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5472.23,"end":5474.23,"speaker":"Fr Stephen De Young","text":"Right. It's that same word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5474.47,"end":5475.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5475.11,"end":5497.12,"speaker":"Fr Stephen De Young","text":"The Lord uncovered himself to Samuel by the word of the Lord. So the first time that verb is used, it's used that the word of Yahweh had not been unveiled to him. And here it said that he is certainly a prophet because Yahweh revealed himself to him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5498.16,"end":5500.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. By the word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5500.36,"end":5525.05,"speaker":"Fr Stephen De Young","text":"By the word of the Lord. Right. So he came to know the God of Israel through seeing the debar. Yahweh, the word of the Lord. So another similar example comes in the first chapter of Jeremiah. And this is actually Jeremiah's call to be a prophet."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5525.05,"end":5538.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, as I recall hearing you say, St. Paul just totally cribs this when describing his own call, which I mean rightfully. Right. He's not making stuff up. But. Okay, so."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5538.31,"end":5547.03,"speaker":"Fr Stephen De Young","text":"Right. And that shows you how St. Paul sees his call to be an apostle, that he sees it as in continuity with what the prophets were doing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5547.03,"end":5565.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Jeremiah 1, 4, 5, this is Jeremiah speaking. Now, the word of the Lord came to me saying, before I formed you in the womb, I knew you. And before you were born, I consecrated you, I appointed you a prophet to the nations."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5566.3,"end":5601.59,"speaker":"Fr Stephen De Young","text":"Right. So the word of Yahweh comes to him. Right. It doesn't say he heard the word of Yahweh. Right. So unless you think like a sheaf of loose leaf paper with these words on it floated down out of the sky. Right. And landed in Jeremiah's lap, which is very clearly not what it's saying. Right, yeah. This is the word of the Lord is someone who speaks. Right. And even though it's identified as the word of Yahweh, he says, the first person, I formed you in the womb."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5601.75,"end":5615.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. So this is the word of Yahweh saying things that only Yahweh could say, that he created Jeremiah, that he knew him and consecrated him and appointed him to be a prophet to the nations."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5616.47,"end":5641.15,"speaker":"Fr Stephen De Young","text":"Right. And then in verse six, the very next verse, when Jeremiah responds, he calls him again the Lord Yahweh. And you get the weird Lord, all caps, God thing, because again, Lord, Lord sounds weird in English. And then in verse nine, we're told that Yahweh puts out his hand and touches Jeremiah's mouth."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5642.74,"end":5643.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5643.3,"end":5644.9,"speaker":"Fr Stephen De Young","text":"So if you had any doubts."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5645.14,"end":5647.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Another very bodily experience."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5648.18,"end":5661.22,"speaker":"Fr Stephen De Young","text":"Right. That he was there in person. Right. He puts out his hand and touches his mouth. And he says in that after touching his mouth, behold, I have put my words plural in your mouth."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5662.02,"end":5662.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5662.98,"end":5670.88,"speaker":"Fr Stephen De Young","text":"So the word capital W, puts words, puts his words in the mouth of the prophet."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5671.52,"end":5763.54,"speaker":"Fr Andrew Stephen Damick","text":"We mentioned all of these instances. Again, there's hundreds and hundreds of usages of these phrases. Right. In the Bible. We can't go over all of them, but we mention all of them to give you a kind of key for understanding when you read the Bible, when you see all these hundreds of instances yourself to understand what this phrase means, the word of the Lord or the word of God. The word of Yahweh. Right. So there's three things that I think are really important to understand here. Number one is that this is a person. This is a person talking to people and appearing to people. Number two, that again, that this person is seen and interacts bodily with people, with the prophets especially. And then the third one is that this person is Yahweh, is the God of Israel and is also distinguished from Yahweh, meaning that this is God. This is a second person who is God. You know, there's God, the one most often simply called Yahweh. And then there's also Yahweh, the word Yahweh, that these are two persons who are both Yahweh, the God of Israel, and yet they're not the same person. Right. They're distinguished from each other. And if you keep these three things in mind, whenever you see that phrase, the word of the Lord or the word of God in Scriptures, you're going to be able to read that much more fruitfully, I think, whenever you see that. And again, hundreds of places that this is used."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5764.58,"end":5775.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so the rest of this half, we're going to talk about some sort of general examples and ways that plays out in different other parts of the Old Testament."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5775.66,"end":5776.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5776.53,"end":5862.17,"speaker":"Fr Stephen De Young","text":"Again, we can't go into detail on every single instance, but. But how that kind of plays out. So, for example, in what's called the Hexateuch, Right. Which is when you lump in Joshua with the Pentateuch. Right. Or the Torah. Right. And there. There are valid reasons to do that. Right. Like, for example, Joshua, it's in the book of Joshua that, like, the conquest and everything that gets started at the end of Numbers and in Deuteronomy, like, comes to completion. Right. So there's sort of an arc of the story. Right. Leading from Exodus to the end of Joshua. And even at the end of Joshua. Right. The conquest is seen as sort of completing, in a certain sense, the promises to Abraham regarding the land. So you have this arc from Genesis through Joshua there. Right. From Genesis 12 all the way to the end of Joshua. So there are reasons to do that thematically. Right. And literarily. And there are themes that sort of run through all six. And one of those is that there's this way in which the phrase the word of the Lord, the debar Yahweh, is used vis a vis the behavior of the people. Right. The people are said to be rebelling against the word of the Lord or offending against the word of the Lord or ignoring the word of the Lord."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5862.17,"end":5867.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which doesn't mean they just broke a thing he said to them. It means."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5868.17,"end":5868.57,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5868.73,"end":5872.21,"speaker":"Fr Andrew Stephen Damick","text":"They're rebelling against this person right there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5872.21,"end":5886.09,"speaker":"Fr Stephen De Young","text":"That would be a weird way of speaking. Yeah, right. I would. If. If you're. If you told your kid to do something and he didn't do it, you wouldn't go to them and say you have rebelled against the word. Which I spoke to you. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5886.09,"end":5889.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I may say that kind of thing to them, but you might."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5890.61,"end":5891.33,"speaker":"Fr Stephen De Young","text":"That's fair."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5891.41,"end":5891.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5892.37,"end":5896.49,"speaker":"Fr Stephen De Young","text":"But most folks. Sorry, not Father Andrew."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5896.49,"end":5901.25,"speaker":"Fr Andrew Stephen Damick","text":"My children do complain to me. Like, why are you talking that way? Because it's awesome."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5902.45,"end":5906.13,"speaker":"Fr Stephen De Young","text":"Your house is just an issue of Thor all the time written by Stan Lee."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5908.05,"end":5908.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5911.73,"end":5920.37,"speaker":"Fr Stephen De Young","text":"Yeah. So you wouldn't say you rebelled against the piece of paper on the fridge that listed Your chores. Right. You would say you rebelled against me."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5920.37,"end":5921.97,"speaker":"Fr Andrew Stephen Damick","text":"Which we do have two or three of those."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5925.97,"end":5981.36,"speaker":"Fr Stephen De Young","text":"Because it's an act of offense against the person. Right. Who wrote the chores or who gave the command. Right. That's who it's. It's directed at. Now, if we understand this identification of this figure we talked last time about the angel of the Lord who's there with them in person during this stretch Right. From. From the Exodus through Joshua. Right. That they're actively rebelling against him. And then what did he say in Judges when he left? Right. That they had ignored him, rebelled against him, grieved him. Right. All of those things. Things. So there is this. This person whom they are rebelling against. Yeah, we see. There's a few interesting things we could touch on real quick, right. In the Psalms. Right. So like Psalm 18:30."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":5982.08,"end":6010.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is interesting. It says this God, his way is perfect. The word of the Lord proves true. He is a shield for all those who take refuge in him. So I mean, if again, if you read this as the word of the Lord is just a thing that God says, then it doesn't make then sense that he would. It would say immediately after that he is a shield for all those who take refuge in him. The word of the Lord is this he who is this shield, you know?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6011,"end":6016.18,"speaker":"Fr Stephen De Young","text":"Right. That is how he proves true, is that he is a shield for all who take refuge in him. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6016.18,"end":6017.02,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6017.66,"end":6026.54,"speaker":"Fr Stephen De Young","text":"And then we even get some Holy Spirit as well in Psalm 33 or 32 in the Greek verses 4 through 6."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6026.62,"end":6066.09,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. So this is how this reads. For the word of the Lord is upright, and all his work is done in faithfulness. He loves righteousness and justice. The earth is full of the steadfast love of the Lord. By the word of the Lord, the heavens were made, and by the breath of his mouth, all their host. And you know, for those of you who know a little bit of Hebrew or Greek, you can guess that breath there is ruach in Hebrew and pneumati in Greek. Spirit. Right. It's the Spirit is what's mentioned there. By the spirit of his mouth, all of their hosts remain."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6066.98,"end":6086.74,"speaker":"Fr Stephen De Young","text":"Right. And so in verse six, you get what is a reasonably common analogy in the Church Fathers regarding the Holy Trinity of God, his Word and the breath. Right. That carries the word that's coming right out of this psalm. But also."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6088.9,"end":6089.94,"speaker":"Fr Andrew Stephen Damick","text":"Notice that the word of."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6089.94,"end":6105.66,"speaker":"Fr Stephen De Young","text":"The Lord is associated with the making of the heavens. Right. So the setting in order, and the Spirit is then associated with the host with Filling it with life. Right. Those two aspects of creation that we talked about a few times on this show."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6105.66,"end":6134.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what you see all the way back in Genesis chapter one. Yep. Yeah. So, okay, so Psalm 105, 19, again, this is just very brief, but until what he had said came to pass, the Word of the Lord tested him. Which again, doesn't make sense if you're just talking about a word. Like you're not tested by a word. He's being tested by this person, by the Lord himself."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6135.75,"end":6186.31,"speaker":"Fr Stephen De Young","text":"Right. And then, of course, very commonly, and we saw specific examples of the word actually appearing to prophets, usually at their calling. But there are also. That's also just a common phrase all through all of the prophets is the word of the Lord came to this prophet. And then when the prophet goes to pass on that information, encounters this person, the Word of the Lord is sent out to proclaim this. They will say, hear the word of Yahweh, hear the Word of the Lord. Right? And then follow that up with the Word of the Lord says, the word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6186.31,"end":6201.36,"speaker":"Fr Andrew Stephen Damick","text":"Of Yahweh says, yeah, the Word says it's not. And the word reads this way, you know, or whatever. It's. It's again, he's passing on a message because he saw and spoke, spoke with the Word of the Lord face to face."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6202,"end":6227.18,"speaker":"Fr Stephen De Young","text":"Right? And when it says the word of Yahweh says, it's not like he then quotes the Torah. Right, Right. This is new prophecy. This is when the Word of Yahweh came to me. He said, and now I'm relaying that to you. And it's used interchangeably in the same prophet during the same oracle. It will alternate between the Word of Yahweh says, and just Yahweh says, yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6227.18,"end":6252.91,"speaker":"Fr Andrew Stephen Damick","text":"And it's interesting. I mean, one of the passages we looked at, I suggest everybody look this one up. In Malachi chapter one, which starts out this way, right? The Word of the Lord comes to him and over and over again. Then you get the Lord of Hosts says, the Lord of Hosts says. So in that chapter in particular, it's underlined this idea that the Word of the Lord is the Lord of Hosts. He's the one who presides over the armies of God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6255.23,"end":6289.24,"speaker":"Fr Stephen De Young","text":"And then there's this pattern that you especially see it in other places too, but especially in first and Second Kings. And one locus where this happens a whole bunch of times is specifically in First Kings or Third Kingdoms 13. Because there's seven times just in that one chapter where it talks about something being done by the word of Yahweh, not in the sense of like somehow that strengthened me, but in the sense of the word of Yahweh did this thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6289.4,"end":6292.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. He's a person."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6292.16,"end":6302.44,"speaker":"Fr Stephen De Young","text":"He's doing stuff the word of Yahweh said, the word of Yahweh did. Right. Where it's an agent, which means it's a person."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6302.76,"end":6344.07,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. And there's another one, and this is a passage that should be familiar to all of us who listen to this show by now. 1 Kings 22. This is where Ahab is about to get it. And the prophet Micaiah comes to him and actually tells him, warns him, warns him what's about to happen. And he still doesn't repent. But so Micaiah says to him in verse 19, therefore hear the word of the Lord. I saw the Lord sitting on his throne and all the host of heaven standing beside him on his right hand and on his left. Again, that's a reference to the word of the Lord as the Lord of hosts, the one who's presiding in the divine council."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6344.55,"end":6349.11,"speaker":"Fr Stephen De Young","text":"Right. And he's the one particularly presiding in the council and sort of issuing the decree."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6349.59,"end":6372.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. He's the spokesman, right? Yeah, yeah, yeah. So, I mean, all of these are using these very sort of personal terms to talk about the word of the Lord. He does things. He says things. You know, he's the spokesman. He's the ruler of the divine council. Again, this is not just the words that God says. This is something much, much bigger than that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6372.76,"end":6410.17,"speaker":"Fr Stephen De Young","text":"Right. And so what we're going to see when we come back in the third half and we finally now get to our actual topic. No, we finally get to the first chapter of St. John's gospel. We're going to see St. John is going to take all of this from, from the Hebrew scriptures, from what would become the Christian Old Testament, to take all of these ideas. And this is going to be the basis for what he has to tell us concerning Christ in his gospel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6410.17,"end":6410.41,"speaker":"Photani","text":"And."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6410.56,"end":6413.68,"speaker":"Fr Stephen De Young","text":"And he's going to lay that out in the prologue here at the beginning."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6413.84,"end":6416.96,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we're going to take a short break and we'll be right back."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6417.04,"end":6433.36,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6435.68,"end":6466.61,"speaker":"Steve","text":"Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting. These stories of life in an inner city, immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6466.85,"end":6473.21,"speaker":"Fr Andrew Stephen Damick","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6473.21,"end":6477.97,"speaker":"Photani","text":"Out any work in the church. The woman was a stalwart, a tovarish."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6477.97,"end":6479.25,"speaker":"Fr Andrew Stephen Damick","text":"You could count on."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6479.97,"end":6487.05,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6487.05,"end":6489.58,"speaker":"Fr Andrew Stephen Damick","text":"Church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6489.58,"end":6494.66,"speaker":"Fr Stephen De Young","text":"Dervish parish didn't even know her name. It wasn't anything they thought about."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6495.38,"end":6505.94,"speaker":"Steve","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6505.94,"end":6520.99,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 885-523-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6527.63,"end":6543.88,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, welcome back. It's the third half of the Lord of Spirits. Once again. This is not a live show, so don't, don't call tonight. We'll get back to your calls next time. But we do have a voicemail that was left for us by Photani who asked this."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6544.76,"end":6597.31,"speaker":"Photani","text":"Father's Bless. This is Photani from Ankh Morpork. I know you've spoken about this a little bit before, but in the beginning of John, when he talks about the Logos, I've heard even Orthodox people explain this as being entirely related to scripture, that scripture is, is kind of the only thing that's meant here. That scripture is the, the primary reference. And from what you've said about the word of the Lord coming to people, particularly in the Old Testament, it feels like that's not a great understanding. But I would like some more clarity on this. I'm sure other people would. Can you, can you talk a little bit about what Logos means and what the word of the Lord means in the Gospel of John? Thank you so much for all you do."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6597.31,"end":6616.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So, I mean, on some level, we've already kind of debunked this idea that the word of the Lord is a reference to the Bible. But I think probably the best way to really put the nail in this coffin, as you said, we're going to look at the beginning of St. John's gospel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6616.47,"end":6625.8,"speaker":"Fr Stephen De Young","text":"Right, Right, right. And she specifically guy. Referred even to the. Even here, which, you know, is kind of the. One of the weirder places to try to."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6626.36,"end":6626.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6627.08,"end":6629.32,"speaker":"Fr Stephen De Young","text":"Ramrod that definition."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6629.56,"end":6630.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6630.28,"end":6633.88,"speaker":"Fr Stephen De Young","text":"I do wonder if she was dressed as a bat. While phoning in."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6636.12,"end":6645.76,"speaker":"Fr Andrew Stephen Damick","text":"She has threatened to come to ancient faith events dressed as a bat. So this is. I mean, it is possible that she is preparing herself for that eventuality, but."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6646.23,"end":6649.47,"speaker":"Fr Stephen De Young","text":"Try as she might, she will never know what it's like to really be one."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6649.47,"end":6650.31,"speaker":"Fr Andrew Stephen Damick","text":"Should just be a person."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6650.31,"end":6652.31,"speaker":"Fr Stephen De Young","text":"Hate to be the one to break it to you. Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6652.31,"end":6653.07,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, Fotoni."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6653.07,"end":6659.75,"speaker":"Fr Stephen De Young","text":"You may know what. You may know what it's like to be Batgirl or Batwoman, but not what it's like to be an actual bat."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6660.71,"end":6673.75,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. It's okay. Well, the food is better for us humans, so just put that because, I mean, although, maybe it's great for them, maybe they love it, but. Yeah, we'll never know because we want. We don't know what it's like to be about."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6673.75,"end":6674.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6674.87,"end":6702.43,"speaker":"Fr Andrew Stephen Damick","text":"So. All right, so. St. John's St. John's this is called the prologue. The first 18 verses of St. John's first chapter in his Gospel. And notably, this is read in the Orthodox Church. Now, I know it's a generalization, But, I mean, 99.99% of Orthodox churches read this gospel at Pascha, at the feast of the Lord's resurrection. And that's the only time it doesn't get read for anything else."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6703.46,"end":6707.14,"speaker":"Fr Stephen De Young","text":"And if you don't, you're the one who has to explain it, not me."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6707.78,"end":6710.26,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yes. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6710.34,"end":6711.7,"speaker":"Fr Stephen De Young","text":"You have the burden of proof."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6711.7,"end":6727.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although, I mean, it should be. I should point out that in the small percentage of Orthodox churches, namely the Western rite, churches that don't read this for Pascha, they actually read it at the end of every Mass. Like, this is what they call the Last Gospel. So they're reading it all the time."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6729.07,"end":6739.55,"speaker":"Fr Stephen De Young","text":"That's overdoing it. It's not special anymore if you do it every week. That's what they taught me before I was Orthodox anyway."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6740.11,"end":6744.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There are special things I do every day. And they're special every time. Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6744.91,"end":6749.63,"speaker":"Fr Stephen De Young","text":"At most three times a year, whether you need it or not. That's all I'm saying."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6750.91,"end":6760.81,"speaker":"Fr Andrew Stephen Damick","text":"So, anyway, it's really underlined in one way or another in Christian liturgical tradition. Tradition. So let's just dive in. In the beginning was the Word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6763.93,"end":6765.05,"speaker":"Fr Stephen De Young","text":"Yeah, you can continue."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6765.05,"end":6803.68,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you want me to keep going? Okay, I will continue. I'll read the first couple of verses. Okay. So this is the esv and we're going to kind of take apart a lot of the translation here as we go. In the beginning was the Word, and the Word was with God. And the Word was God. He was in the beginning with God. So. Yeah. So the first verse then, and we're going to point this out, I'm going to read a little bit of Greek. The first verse goes like this. Enarchi in ologos. Che ologos in proston theon que theos in ologos. That's how it goes in Greek."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6805.52,"end":6806,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6806.56,"end":6812.15,"speaker":"Fr Andrew Stephen Damick","text":"So let's pull this apart bit by bit because I mean, this is, this is really important."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6812.71,"end":6825.19,"speaker":"Fr Stephen De Young","text":"Yeah. And when we say we're pulling apart the translation. Right. This is not an attack upon the ESV or any other English translation. There's not that much difference in how they translate John 1."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6825.19,"end":6828.23,"speaker":"Fr Andrew Stephen Damick","text":"It's sort of like let's take this apart to see how it works kind of thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6828.71,"end":6837.52,"speaker":"Fr Stephen De Young","text":"Right, right. Because. And you know the esv, like most English translations, was done by a committee, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6837.76,"end":6838.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6838.56,"end":6852.4,"speaker":"Fr Stephen De Young","text":"They may question what that means, because I still hold that no committee has ever done anything. Right. Some person on a committee did it and the other ones, you know, argued about it, argued about what that one person did."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6852.4,"end":6853.28,"speaker":"Fr Andrew Stephen Damick","text":"Editing happened."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6856,"end":6884.73,"speaker":"Fr Stephen De Young","text":"But the point being, when something goes through a committee like that, especially with, since the ESV is the rsv, we're talking about a committee that had various types of Protestant folks working on it, Roman Catholic folks involved, even Orthodox folks involved, you're gonna have to be really non committal theologically. Right. If you're talking about any passage with important theology, you're gonna have to do a lot of punts, lots of OFs, lots of ANDs."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6885.29,"end":6891.14,"speaker":"Fr Andrew Stephen Damick","text":"Because again, a translation is interpretation. There's just no way around that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6892.9,"end":6902.26,"speaker":"Fr Stephen De Young","text":"Right. And so we're just going to dig a little deeper past the committee to get closer to the text itself."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6902.26,"end":6907.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So nrhe. That's how it starts out. Right. So what does that mean exactly?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6907.3,"end":6908.7,"speaker":"Fr Stephen De Young","text":"It starts with in the beginning."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6908.7,"end":6909.34,"speaker":"Fr Andrew Stephen Damick","text":"In the beginning."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6909.34,"end":6916.94,"speaker":"Fr Stephen De Young","text":"Right. And that should take us back to the book of Genesis, which begins the exact same way."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6916.94,"end":6917.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6918.14,"end":6939.66,"speaker":"Fr Stephen De Young","text":"In Greek with those exact words. So we're going back to that point of Genesis 1:1 and what we're told by the second half of that first clause. Now in English, they're following the order of the words in the Greek when they say in the beginning was the word."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6939.91,"end":6944.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's exactly word for word, literally in that case. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6944.95,"end":6947.67,"speaker":"Fr Stephen De Young","text":"So the word there that's translated was."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6948.07,"end":6952.79,"speaker":"Fr Andrew Stephen Damick","text":"Which is in ita ni, nu, nu, ni."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6953.35,"end":6955.35,"speaker":"Fr Stephen De Young","text":"I'm gonna let you take all the heat from the Greeks."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6955.35,"end":6955.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay, great."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6956.15,"end":6957.43,"speaker":"Fr Stephen De Young","text":"I'm throwing you under the bus."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6957.43,"end":6963.19,"speaker":"Fr Andrew Stephen Damick","text":"I'll take it. I'll take it. So I don't say it in that Erasmian way, so I try not to. Anyway."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6963.75,"end":6967.26,"speaker":"Fr Stephen De Young","text":"Yeah. The question is, are you correctly saying it in the anyway?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6967.26,"end":6972.3,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I'm doing my best."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6972.94,"end":6988.02,"speaker":"Fr Stephen De Young","text":"Yeah. So with Greek, the. The tense system, we tend to think of verb tense purely in terms of time in English, because that's most of what it does in English."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6988.02,"end":6989.02,"speaker":"Fr Andrew Stephen Damick","text":"Past, present, future."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":6989.5,"end":7076.6,"speaker":"Fr Stephen De Young","text":"Yeah. Right. It's telling us primarily when the activity was taking place. Right. That's described by the verb. That's not the case in Ancient Greek. In ancient Greek, there is a temporal element. Right. It's not that it has nothing to do with time, but the primary thing that tense tells you in Ancient Greek is the is. It's telling you the type or the quote quality of the activity. Right. So, for example, there are two different Greek tenses that get translated by the English past tense. So this is, was, was, is past tense. Right. There's is, was, will be. Right. Present, past, future in English. But that past that was does two different tenses. So one of those tenses is what's called the aorist tense. Right. Which is spelled A O, R, I, S, T. And people say crazy things about the aorist. But in actuality, in Ancient Greek, the aorist tense is basically telling you pretty much nothing about the activity. It's sort of the neutral, the neutral tense. It's just telling you that something happened."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7076.68,"end":7081.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Neutral past tense, as it were. It's pretty close to English past tense."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7081.32,"end":7118.53,"speaker":"Fr Stephen De Young","text":"Right. Well, it ends up. It's. It's not. Again, the temporal element is not the primary element. But. But if something has happened, that means whoever's talking or writing about it, it's going to be in their past because it's happened already. Right, Right. So de facto is going to end up being in the past. The other tense that gets translated as past has a stronger temporal element. You are very deliberately saying that this is something that was going on in the past, and that is what's called the Greek imperfect tense."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7119.25,"end":7144.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which usually in English, an imperfect verb is one that is typically a gerund, you know, ends with ing. Right. So like, was being or had been being. And you know, like. Yeah. Or I mean, I'm. I am walking. That's an imperfect, a present, imperfect. Right. Or I'm talking, you know, anyway."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7144.74,"end":7152.47,"speaker":"Fr Stephen De Young","text":"Right, right. Whereas this is. It has that sort of continuous activity."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7152.47,"end":7152.83,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7152.83,"end":7169.39,"speaker":"Fr Stephen De Young","text":"Right. This is something that was going on for a while, but that while is in the past. Right, Right. So a sort of very literal way of translating that first clause would be in the beginning, the word was being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7170.99,"end":7173.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Meaning had been being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7173.95,"end":7193.08,"speaker":"Fr Stephen De Young","text":"Right. Or already was. Right. So in the beginning, when we go back there to Genesis 1:1, when God starts creating everything, the word, the Logos already was. Already was existing. Already was being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7194.92,"end":7200.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, yeah. Which again, doesn't make any sense if you're trying to say that this is about the Bible."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7201.24,"end":7204.6,"speaker":"Fr Stephen De Young","text":"Right. Or even just words plural."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7204.68,"end":7206.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7206.74,"end":7225.3,"speaker":"Fr Stephen De Young","text":"God was already talking. Right. That doesn't make sense. Right. But this also then is the. Is pre existence. Right. Not just pre existence of when Jesus was born on earth. Right. But pre existence, as in pre existing the creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7225.38,"end":7233.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. In the beginning, when everything was about to be created, the word had been being already. Already. It was, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7234.43,"end":7244.23,"speaker":"Fr Stephen De Young","text":"Right. And then. So then the second clause is after the. And so."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7244.23,"end":7251.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, here we go. Write in. Let me know how terrible my pronunciation is. Que ologos in proston theon."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7252.75,"end":7260.76,"speaker":"Fr Stephen De Young","text":"Right. So. And that's what's usually translated. And the word was with God. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7260.76,"end":7267.12,"speaker":"Fr Andrew Stephen Damick","text":"And that in there is again the same had been being or was. Already was. Or you know, was being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7267.2,"end":7335.29,"speaker":"Fr Stephen De Young","text":"Was being. Right, yeah. And then we've got the. The preposition pros. Right. So prepositions in Greek do different things depending on what type of verb and what type of object they're put with. Right. So pros can mean motion towards. Right. So if this was a verb of movement. Right. So if you said I was walking. Pros. Right. The store. Right. I was walking to the store. Toward the store. Right. And then it would depend on the verb tense. If I said walking, it would be toward. It was past tense. I walked. It would be I walked to the store. Right. Because it's in the past. Right, Right. So but this is a being verb. Right. Not a verb of motion. And so pros. In this case, with is not a bad translation, but it really even has more the concept of at. At. Like co. Location. Like there is a house at this street corner."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7335.45,"end":7335.85,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7336.65,"end":7340.33,"speaker":"Fr Stephen De Young","text":"Right. So you're saying there's the street corner is there and the house. They're both there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7341.08,"end":7357.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so the word was co. Located was at God. Although it's not just God here, it's not just theon, it's ton theon. So why is that important that there's this definite article there? Well, there's an article an article."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7357.88,"end":7367.69,"speaker":"Fr Stephen De Young","text":"Excuse me, don't be so definite. Greek in this era did not technically have a definite article, but anyway, it's."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7367.69,"end":7370.05,"speaker":"Fr Andrew Stephen Damick","text":"Sort of demonstratives mostly. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7370.77,"end":7371.25,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7373.09,"end":7373.49,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7376.05,"end":7406.06,"speaker":"Fr Stephen De Young","text":"This article is here because this is a common way in Greek. When you read Jewish texts that are in Greek, there are certain distinctions that are made in certain ways in the Hebrew. So for example, in the Hebrew of the Hebrew scriptures, it's very rare, not completely absent, but it's very rare that you see Yahweh, the God of Israel, referred to as just Ale."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7406.78,"end":7407.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7407.82,"end":7408.66,"speaker":"Fr Stephen De Young","text":"The word for God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7408.66,"end":7409.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7409.94,"end":7431.69,"speaker":"Fr Stephen De Young","text":"Right, yeah. Which you spelled like l in English. You almost always see it in the plural. Right. We've talked before about what's going on with the plural a little bit. But that's also a way of distinguishing between. Because El was also the name of a particular God, the father of baal."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7431.69,"end":7433.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A Canaanite pagan God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7433.89,"end":7437.57,"speaker":"Fr Stephen De Young","text":"Right, right. And so a way of distinguishing. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7437.97,"end":7438.37,"speaker":"Fr Andrew Stephen Damick","text":"Between."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7441.01,"end":7493.79,"speaker":"Fr Stephen De Young","text":"Between Yahweh, the God of Israel, and was to not use that exact form of the word. Right. And so God without an article can be used in a lot of ways in Greek. Right. It can be indefinite, it can mean a God. Right. It can even be sometimes used to just sort of mean divine. Right. Or divinity as a concept. Right. And so one of the ways that that would be expressed, the idea that this is God, the most high God. Right. Is by putting the article there in Greek, the God. Right. And so we of course don't translate it as the God, because that would be weird. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7493.79,"end":7494.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7496.07,"end":7514.96,"speaker":"Fr Stephen De Young","text":"Right. But so this is saying that the word is there. This again is co. Located with God, the God. Right, right. The creator God, Yahweh, the God of Israel, meaning they're both existing together. They're co. Located here at the beginning before anything is created."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7514.96,"end":7520.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a distinction. There's two persons that are both there at the beginning."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7520.92,"end":7521.32,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7521.4,"end":7528.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so the last clause is que theos in ologos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7529.79,"end":7530.27,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7530.51,"end":7530.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7531.31,"end":7533.11,"speaker":"Fr Stephen De Young","text":"Now notice. Yeah, go ahead."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7533.11,"end":7540.43,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say and. Which literally is. And God was being the word. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7541.95,"end":7552.26,"speaker":"Fr Stephen De Young","text":"But in that word order, it's important to note there's no def. Or there's no. You have me doing it now. There's no article there. Right. It's just K the os. Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7552.34,"end":7552.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7554.02,"end":7576.48,"speaker":"Fr Stephen De Young","text":"So it's not saying that the God was the word. Right. It's not contradicting what we just saw and saying there is no distinction. Right, right. There's no. There is an article before Logos, there's not an article before theos, which means. Right. That it's being predicated."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7577.11,"end":7577.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7577.35,"end":7579.51,"speaker":"Fr Stephen De Young","text":"So the word is a predicate, which."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7579.51,"end":7583.19,"speaker":"Fr Andrew Stephen Damick","text":"Is why usually in English they flip the order and say the word was God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7583.75,"end":7586.47,"speaker":"Fr Stephen De Young","text":"Right. Rather than with that same connotation of was being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7586.63,"end":7590.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly that. Een, een, een. It's three times in that verse."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7590.51,"end":7603.35,"speaker":"Fr Stephen De Young","text":"Right. Was already being. Right. That rules out all of your what we now call adoptionist Christologies. Yep. Right. That Christ at some point became God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7604.32,"end":7604.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7604.56,"end":7633.15,"speaker":"Fr Stephen De Young","text":"Right. This is saying he was already being God before anything was created. Right. That this is not a sort of later thing and these need to be ruled out, you say, well, why would that need to be ruled out? Wasn't that like a second century heresy or something? We've been talking about this second figure, this second power in heaven, the second figure. In the Old Testament there were lots of going theories within Second Temple Judaism as to who this was."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7633.39,"end":7638.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is John saying, no, no, no, no, no. This is what's true."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7638.67,"end":7648.23,"speaker":"Fr Stephen De Young","text":"Right. So this is. This is pre human. Right. So this means it can't be. Here are some of the theories. It can't be Enoch, it can't be Adam, it can't be Moses, it can't be David."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7648.23,"end":7648.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7648.59,"end":7648.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7648.99,"end":7651.71,"speaker":"Fr Andrew Stephen Damick","text":"Because this one is in the beginning, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7651.79,"end":7673.69,"speaker":"Fr Stephen De Young","text":"Before any of that. Right. So you have already here just in that first verse. Right. Just like was done with the debar Yahweh in the Old Testament, you have this figure who's distinguished from Yahweh, the God of Israel, and identified with Yahweh, the God of Israel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7673.69,"end":7674.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7674.81,"end":7677.69,"speaker":"Fr Stephen De Young","text":"And made co eternal with Yahweh, the God of Israel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7678.41,"end":7704.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. And then you get verse 2, which reads this way. Utos in energi prosthon theon, which I mean is sort of doubling down. You know, it's what we call an apposition for the first verse. It's just restating it in a slightly different way, you know. Utos, Right. Is that's the demonstrative. Right, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7704.46,"end":7704.98,"speaker":"Fr Stephen De Young","text":"This one."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7704.98,"end":7705.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7705.5,"end":7705.98,"speaker":"Fr Stephen De Young","text":"This one."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7705.98,"end":7717.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This one he said underline. This one had been being or was already being in the beginning. Co located with the God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7717.73,"end":7718.13,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7718.69,"end":7733.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, again, that's really clumsy to say it that way, which is why you would probably never put that in a Bible translation into English. But that's why it's useful for us to kind of, like I said, take it apart a little bit and have a look inside, you know?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7733.9,"end":7734.14,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7734.14,"end":7738.22,"speaker":"Fr Andrew Stephen Damick","text":"So you can see what's trying. What's going on there as best as we possibly can."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7739.26,"end":7773.16,"speaker":"Fr Stephen De Young","text":"Right. And so now we've started at Genesis 1:1, right? With. With where. Where is the word? Where is the Jabariwh? Where is this person? The word of the Lord? At the beginning. He's right there, right? Co located with God. He is both identified with the God of Israel, the creator God, and he is distinguished from the person of the creator God. And so now we move Forward into Genesis 2. 1, verse 2."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7773.24,"end":7775.4,"speaker":"Fr Andrew Stephen Damick","text":"John 1. Yeah. John 1, verse 2. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7775.56,"end":7783.24,"speaker":"Fr Stephen De Young","text":"Which is moving into. No, no, no, no, no, I'm sorry. John 1, verse 3. We're moving it to Genesis 1, verse 2."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7785,"end":7816.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is. I mean, in a lot of ways, that's what St. John is doing. He's recapitulating Genesis. Yeah, yeah. Okay, so this reads in English, all things were made through him, and without him was not anything made that was made. And I'll just read that real quick in Greek. Panda. Ye. Yo nen. Yeah, sorry."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7816.66,"end":7818.58,"speaker":"Fr Stephen De Young","text":"I don't know how the panda got in there, but okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7818.58,"end":7823.06,"speaker":"Fr Andrew Stephen Damick","text":"Panda. Yes. Pandemonium."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7824.58,"end":7837.06,"speaker":"Fr Stephen De Young","text":"So, right, and so this is. Remember Genesis 2, right? In the beginning, what does God do? He creates the heavens and the earth. Right, right. And the earth is without form and void. Right. So we have that statement first."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7839.55,"end":7839.79,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7842.43,"end":7847.15,"speaker":"Fr Stephen De Young","text":"It'S literally saying all things through him came into being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7847.79,"end":7855.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not made exactly. It's not, you know, pio or ktizo. Right. Which is the usual words for making something. It's."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7855.39,"end":7856.27,"speaker":"Fr Stephen De Young","text":"Or creating."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7856.27,"end":7860.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, creating. Yeah, it's a yenito. Came into being, you know."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7860.75,"end":7895.54,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Came to be. Yeah. So all things came to be through him. And then to clarify that, the second clause. And separate from him, apart from him, cut off from him, almost literally, not one thing that came into being came into being. Right, Right. So you have this category. All the things that came into being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7895.62,"end":7896.34,"speaker":"Fr Andrew Stephen Damick","text":"All the things."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7896.74,"end":7916.29,"speaker":"Fr Stephen De Young","text":"Right. All the things. Right. Everything. That's a thing. Right. All things came into being, came into being through him. Nothing in that category came into being apart from him. What does that imply? Well, that implies he is not in that category."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7917.72,"end":7919.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not a created thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7919.72,"end":7922.76,"speaker":"Fr Stephen De Young","text":"He is not in the category of things that came into being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7922.92,"end":7924.36,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. Not sorry, Arians."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7925.08,"end":7974.1,"speaker":"Fr Stephen De Young","text":"Yeah, right. Sort of definitionally there. And then secondly, that he is this instrument. Right. The logos is the instrument through which God creates. Right. And what is creation? As we've said several times, it's putting things in order. Right. Meaning the logos is here for St. John, both this creative intermediary so he's already serving this function as an intermediary between God and the creation. And he's also then the organizing principle, the logos, in that sense of structure, of rational structure within the created order. Right. He is then that principle by which things are put in order."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7974.1,"end":7984.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can just imagine Philo of Alexandria going, okay, yeah, okay, so far. You know, he's really on board with all of this so far. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7984.54,"end":7986.7,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7986.94,"end":7987.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7987.78,"end":7988.18,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":7988.18,"end":8007.54,"speaker":"Fr Andrew Stephen Damick","text":"So now, I mean, it's been really interesting up to this point, but now this is going to. This is the part that a lot of this was a little bit new to me and just is awesome. So I just have to say that to everybody. So verses four and five. I mean, I don't mean it's new to me in the sense I've never read this before, but understanding what's going on here in a deeper way, that's what's new."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8007.78,"end":8010.9,"speaker":"Fr Stephen De Young","text":"You have been to a Pascha service. I have been, is what you're saying."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8010.98,"end":8054.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Many, many, many times now. Okay, so verses 4 and 5. In him was life, and the life was the light of men. The light shines in the darkness, and the darkness has not overcome it, which. Okay, so the way I had been understanding this verse was essentially, it's talking about Jesus as the light of the world, which, I mean, he says that, right. In another place, I am the light of the world, you know, and that he's shining in the darkness and the dark, you know, so forth. But, okay, the life was the light of men. That's something that's kind of interesting, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8054.94,"end":8055.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8055.38,"end":8058.7,"speaker":"Fr Andrew Stephen Damick","text":"So what's going on inside this?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8059.66,"end":8062.22,"speaker":"Fr Stephen De Young","text":"So we're still in Genesis 1."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8062.22,"end":8064.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8064.74,"end":8067.02,"speaker":"Fr Stephen De Young","text":"We're now at the first day of creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8067.02,"end":8067.98,"speaker":"Fr Andrew Stephen Damick","text":"Let there be light."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8068.86,"end":8099.35,"speaker":"Fr Stephen De Young","text":"Right. And the light and the darkness are separated. Right. And so this is identifying the light of that first day of creation. Right. What is that light? Right, because the. The sun, moon, and stars haven't been created yet. Right, right. That's day four, which is in parallel to this. But isn't this. Right. And this is identifying that light that shown in the darkness that the darkness is not overcome it that was separated."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8099.7,"end":8099.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8099.86,"end":8110.26,"speaker":"Fr Stephen De Young","text":"That pushed back the darkness right on that first day. That light is the life that is in Christ, the life that is in the Logos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8110.34,"end":8110.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8110.9,"end":8112.58,"speaker":"Fr Stephen De Young","text":"So which is the life of God?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8112.66,"end":8135.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so. So just make sure everybody following along here, when God says, let there be light, this is the. St. John is interpreting that here as saying that that light is the life of Christ shining out from him. That's what's going on here. And it's about to get even cooler."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8136.27,"end":8168.91,"speaker":"Fr Stephen De Young","text":"Right. It's the life. Right. It's the life of God, that, that that is in Christ, that that shines for that. This is later on in St. John's Gospel. Right. Father has given it to the Son to have life in himself. Right, Right. So, but notice also, right. That that life was the light of. It's translated of men, but it's actually humanity. Right. This is from, from anthropos. Right. And the other word for man is going to be used later in the same passage. So it's a deliberate thing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8169.07,"end":8169.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8169.79,"end":8171.07,"speaker":"Fr Stephen De Young","text":"I mean, so this is humanity."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8171.07,"end":8184.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, and the way that I've, you know, generally have understood that is like, oh, yes, he enlightens mankind. They're receiving light from him, which, I mean, is not wrong. It's not wrong, but it's actually way deeper than that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8185.43,"end":8192.47,"speaker":"Fr Stephen De Young","text":"Right. Because there aren't any humans yet. Right. On the first day of creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8192.79,"end":8195.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We have to remember that this is still the first day of creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8196.47,"end":8237.09,"speaker":"Fr Stephen De Young","text":"Right. So what does that mean? This is telling us that this relationship between the life of God that is in Christ, that is in the Logos, that is in the eternal Logos, this life of Christ has this purpose of being the light of men. So that means that humanity is in view. God sharing his life with humanity through Christ, through. Through His Word is in view as the purpose for the beginning of creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8239.57,"end":8248.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. From that moment of let there be light, that humanity is already the purpose."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8249.65,"end":8261.34,"speaker":"Fr Stephen De Young","text":"Right. In view. And not just the creation of humans to roam around on this world. Right. But for God to share his divine life with humans."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8261.42,"end":8314.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in case you kind of wonder, are they going out on a limb here saying that that's what St. John is saying, that this is about the first day of creation. In case you wonder that St. Paul does the exact same thing in Second Corinthians 4, 6, where he says, for God, who said, let light shine out of darkness, has shown in our hearts to give the light of the knowledge of the glory of God in the face of Jesus Christ, St. Paul's saying exactly the same thing here. He's expanding a little bit on it, you know, talking about the glory of God, the face of Jesus Christ. But it's again, that same thing that the light that shines in the darkness at the very beginning of creation is sent out to shine into the hearts of human beings to give them the light of the knowledge of the glory, glory of God in the face of Jesus Christ. That's exactly what St. Paul says that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8314.67,"end":8326.51,"speaker":"Fr Stephen De Young","text":"Comes to us through Christ. And so this means that what we call theosis, right? Sharing in God's life, becoming like God, becoming sons of God. This is the purpose of creation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8326.75,"end":8331.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it begins at the moment of creation, right? Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8331.95,"end":8381.1,"speaker":"Fr Stephen De Young","text":"So the light that we're talking about is the life of God in Christ. It's theosis, it's salvation. That's what the light is. The light is not just another way, as we're going to see here in a minute, it's not just another way to refer to Christ poetically. This light that we're talking about salvation, and this is all through the Old Testament, the main language that's used to talk about theosis, to talk about salvation, is shining like the stars from Abraham to Daniel, Right, right. To the, the Book of Wisdom. Right. That, that the righteous shine like the stars in the day of the Lord and the stars. We know of that association with angels, with the angelic sons of God. So this is, this is the light that's being talked about."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8381.18,"end":8412.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's so cool. So, yeah, yeah. The light is the life of God in Christ. It is salvation shines out in the darkness. I mean, it becomes salvation in the sense that when human beings cooperate with that. Right. Then it becomes. But it's Christ doing. He begins to save us from the very beginning of the moment, of the beginning of creation. That's just astonishing. That's really cool. Okay, so moving on."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8413.32,"end":8415.08,"speaker":"Fr Stephen De Young","text":"Yeah, but St. John is not done."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8415.08,"end":8460.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's not done. I know. I could just say goodnight right now. I really could. So. Okay, verse six. I'm going to read six, nine. There was a man sent from God whose name was John. He came as a witness to bear witness about the light that all might believe through him. He was not the light, but came to bear witness about the light, the true light which gives light to everyone was coming into the world. Right. So I mean, just to disambiguate a touch here, when, when St. John the Evangelist, the Apostle, says there was a man sent from God whose name was John, he's not talking about himself. It's an. It's John the forerunner, John the Baptist, who's being mentioned here. Yeah, yeah, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8461.23,"end":8499.75,"speaker":"Fr Stephen De Young","text":"Right. And so St. John, right. Is, is this man, right? Now notice he's a man right off the bat. He's human who's sent from God, right? And he's sent to witness. To bear witness. What that means is that's about testifying Right. Like if you're called to give testimony in some kind of court case or adjudication. Right. To testify about. About the light. Now here we go. Translation. They have that all might believe through him. It's not clear. Believe what?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8502.31,"end":8505.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. No, it's become faithful."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8505.83,"end":8555.48,"speaker":"Fr Stephen De Young","text":"Yeah, Right. To become faithful. Because what is it that he's bearing witness about? The light. Remember, the light is this salvation. St. John comes to prepare the way, to prepare the path. So he bears witness. He testifies to the path. Right. To salvation. Right. He was not the light. He didn't have salvation in himself. Right. St. John didn't come to save everyone himself, but he came to bear witness to it. Right. And then we finally read that the true light which enlightens it's every human or all humans. Right. Was coming into the world. Now that. That was the pronoun that's used. There is a neuter pronoun."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8556.76,"end":8557.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8557.12,"end":8562.36,"speaker":"Fr Stephen De Young","text":"The Logos is referred to throughout this passage with masculine singular pronouns."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8563.16,"end":8565.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So, yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8566.68,"end":8581.72,"speaker":"Fr Stephen De Young","text":"So the, the true light, again, is not the person of the Logos. It's not the person of Christ. The true light here is that salvation, that life which is in Christ, the life of God which is in Christ, which is now coming into the world."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8582.04,"end":8582.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8582.8,"end":8583.84,"speaker":"Fr Stephen De Young","text":"So salvation."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8583.84,"end":8607.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. So again, you know, Christ does it another point, say, I am the light of the world. But this is not what this use of light is about. It's. It's, you know, in this case, light is the thing that's coming from Christ rather than being used to identify him. And as you said, there's differences in pronouns here which kind of let you know that that's what's going on."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8609.07,"end":8610.03,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8612.51,"end":8612.91,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8614.67,"end":8627.92,"speaker":"Fr Stephen De Young","text":"We now, when we get into the next section. Right. People are going to be tempted to jump ahead. Right. Because you say, oh, well, we're done with Genesis now. Now we've jumped all the way to St. John the Forerunner."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8628.47,"end":8628.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8629.75,"end":8639.35,"speaker":"Fr Stephen De Young","text":"But something interesting is going to happen here because in the next few verses that we're about to read, St John the Evangelist is still in the Old Testament."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8639.51,"end":8640.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8640.39,"end":8652.23,"speaker":"Fr Stephen De Young","text":"He's describing the Old Testament period of the prophets. So why did he talk about St. John first? Because St. John the forerunner is the paradigm for the prophets, even though he's the last one."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8652.71,"end":8668.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. This was another thing that was a little surprising to me, but it makes way more sense to read it this way that St. John is here again recapitulating the whole of the Old Testament within just a few verses here. Right, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8668.44,"end":8684.57,"speaker":"Fr Stephen De Young","text":"And so St. John sort of supremely testifies to the way of salvation. Right. He is the. The capstone of the prophets. He's the seal of the prophets. Right. But all of the prophets of the period, of the prophets of the Old Testament were doing that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8684.97,"end":8686.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8687.45,"end":8687.93,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8688.41,"end":8737,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so moving on, I'm going to read verses 10 through 13. He was in the world, and the world was made through him, yet the world did not know him. He came to his own, and his own people did not receive him. But to all who did receive him, who believed in his name, he gave the right to become children of God who were born not of blood, nor of the will of the flesh, nor of the will of man, but of God. So let's take this apart because this actually is a big sweep of history. It's not simply talking about when Christ, you know, St. John is actually not talking about what's about to happen in the rest of his gospel. This is still prologue, Right. This is still not what. You know. Yeah, yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8737.32,"end":8740.44,"speaker":"Fr Stephen De Young","text":"And spoilers. The Incarnation is going to happen in verse 14."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8741,"end":8751.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So when it says he was in the world and the world was made through him, yet the world did not know him. That's talking. That's before the incarnation still."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8751.72,"end":8771.1,"speaker":"Fr Stephen De Young","text":"Right. That's before the Word becomes flesh. The word was in. Was being. This is that same tense, was being in the world continuously before he became flesh, and the world was made through him. As we saw, he created the whole world, but the world out there did not know him. The nations."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8771.1,"end":8771.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8771.38,"end":8773.1,"speaker":"Fr Stephen De Young","text":"Did not know him. Right, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8773.1,"end":8779.62,"speaker":"Fr Andrew Stephen Damick","text":"And so. And then it moves forward. He moves forward and it says he came to his own and his own people did not receive him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8780.18,"end":8799.79,"speaker":"Fr Stephen De Young","text":"Right. And this is now Moses. He came to his own. He came to his own people. He was in the world, but then he came particularly the Logos. The Word of God came particularly to his own people, and his own people did not receive him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8799.79,"end":8826.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. He appears over and over again to the. To the prophets and they bring him to them. But he, over and over again, they. Excuse me. They over and over again reject him and turn away from him and rebel against him. That's what this verse 11 is. It's not about the rejection that he's about to experience as the incarnate Christ. This is about the unfaithfulness of Israel and the Old Covenant, though that is."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8826.96,"end":8828.2,"speaker":"Fr Stephen De Young","text":"Certainly part of this pattern."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8828.28,"end":8829.28,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, sure, sure, sure."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8829.28,"end":8837.61,"speaker":"Fr Stephen De Young","text":"Of course, the story of the Old Testament is the story of God drawing close to his people. Israel. And Israel rejected, rejecting him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8837.61,"end":8838.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8838.25,"end":8883,"speaker":"Fr Stephen De Young","text":"Right. Over and over again. And that's verse 12, right? Or verse 11. Verse 12 then. Right. But. But to whoever received him is what it sort of literally says, Right? Whoever received him. So again, there's this remnant idea. So there was this group within Israel who did receive him, even though Israel as a whole, his people as a whole did not. And to those he gave them authority. It's exousia in Greek. It's like freedom to act. Right. It's like agency. Right. He gave them the agency to become children of God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8883.72,"end":8892.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is children here, by the way. It's not sons, it's tecna, which obviously includes sons, but it's children in general."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8892.97,"end":8918.01,"speaker":"Fr Stephen De Young","text":"Right. But it is the same kind of idea. Right? This is talking about theosis again, Right? So it's not just that there were prophets pointing that way, it's that those who did receive him and did follow that way. Right? So again, Christ is the means, the Logos, the word of God. He's the means of salvation in the Old Testament also."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8918.59,"end":8920.03,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8920.03,"end":8921.79,"speaker":"Fr Stephen De Young","text":"Right, Sorry, dispensationalist friends."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8922.75,"end":8923.87,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, not sorry."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8925.79,"end":8946.96,"speaker":"Fr Stephen De Young","text":"So, Right. And notice also this language, right? They translate who believed in his name. I don't know exactly what that would mean, but it's more those who are faithful to his name. Remember what we talked about last time with the angel of the Lord, right? This the one who had his name placed in him."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8947.68,"end":8948.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":8948.08,"end":9000.76,"speaker":"Fr Stephen De Young","text":"Tabernacle of the Temple are the places where Yahweh put His name. Right. Those who were faithful to his name, they received him. And who were faithful to his name, they're the ones who received this. Yeah. And then, just in case you're not clear on exactly what this agency to become children of God is, verse 13 makes it pretty clear. Clear that we're talking about theosis. Because they're born, right? They're begotten, Literally begotten, yeah. Not of blood, meaning physical birth. Right. Where there's blood. Right. Nor of the will of the flesh. We'll keep it pg. You can guess what the will of the flesh is referring to in terms of producing children. Nor of the will of this man is amen anir. It's the word for a man, not for the will of a man. A guy decided he wanted to have a child."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9000.84,"end":9001.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9002.92,"end":9007,"speaker":"Fr Stephen De Young","text":"But of God, they're begotten of God. That's how they become children."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9007.08,"end":9061.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And just again, to underline this, St. Paul writes in Romans 8, 20, 23, essentially the same kind of thing. He says, for the creation was subjected to Futility, not willingly, but because of him who subjected it, in hope that the creation itself will be set free from its bondage to corruption and obtain the freedom of the glory of the children of God. For we know that the whole creation has been groaning together in the pains of childbirth until now. And not only the creation, but we ourselves, who have the first fruits of the Spirit, groan inwardly as we wait eagerly for adoption as sons, the redemption of our body. So this is St. Paul again saying that the whole telos of creation, its whole purpose is the revelation of the sons of God, the adoption, you know, as sons."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9061.83,"end":9062.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9062.15,"end":9074.35,"speaker":"Fr Andrew Stephen Damick","text":"That we're born of the will of God and that that's the purpose of creation itself right there. And that we're now in the stage of waiting eagerly for that because it hasn't yet come to its fullness."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9075.86,"end":9083.66,"speaker":"Fr Stephen De Young","text":"Right, right. And so now in verse 14, now we get to what St. John's gospel."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9083.66,"end":9086.98,"speaker":"Fr Andrew Stephen Damick","text":"Is going to be about. Yeah. This is about the Incarnation, and this is."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9087.06,"end":9099.1,"speaker":"Fr Stephen De Young","text":"Yeah. And St. John's gospel, remember, doesn't have a birth narrative. Right, right. It doesn't. This, this verse 14, this is talking about Jesus being born."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9099.1,"end":9102.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that stuff was covered by St. Luke. Right. You know."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9102.12,"end":9102.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9102.8,"end":9131.28,"speaker":"Fr Andrew Stephen Damick","text":"I mean, really. I mean, that's kind of what's going on here. Yeah. Okay, so verse 14. And the word became flesh and dwelt among us. And we have seen his glory, glory as of the only Son from the Father, full of grace and truth. So, I mean, the first thing there is, again, this is that language of the Word. And he came to be the same."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9131.28,"end":9135.12,"speaker":"Fr Stephen De Young","text":"Word, same Logos we were talking about from back in Genesis 1."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9135.28,"end":9135.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9136.24,"end":9137.84,"speaker":"Fr Stephen De Young","text":"Right. And all through Israel's history."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9138.16,"end":9146.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And then dwelt among us, which is. Okay. But it actually says tented or tabernacled."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9146.8,"end":9147.12,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9147.12,"end":9148.32,"speaker":"Fr Andrew Stephen Damick","text":"You get in some translations."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9149.2,"end":9150.8,"speaker":"Fr Stephen De Young","text":"Tabernacled is a real literal."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9150.88,"end":9164.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which has this sense of, you know, it's a sojourning, it's temporary. Right. He didn't build a palace amongst us. He tented among us. He tabernacled among us."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9165.03,"end":9185.8,"speaker":"Fr Stephen De Young","text":"Right. And also then Christ, as, I mean, later on in St. John's Gospel, we're going to get, you know, destroy this temple and I'll rebuild it in three days. And St. John helpfully gives us the editorial comment, by the way, he was referring to the temple of his body. Right. And so that's how we have to understand this glory language. Right. Because what happens in the tabernacle."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9185.88,"end":9186.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9186.32,"end":9209.32,"speaker":"Fr Stephen De Young","text":"The glory of God, it's Filled with the aphanic glory cloud. Right. The glory of God comes and fills the tabernacle. And so the Logos the becomes flesh tabernacles among us. And the glory of God, the presence of God is within him, and this is glory."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9210.33,"end":9212.01,"speaker":"Fr Andrew Stephen Damick","text":"Now, here we go."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9212.01,"end":9216.45,"speaker":"Fr Stephen De Young","text":"English you read says of the only Son from the Father."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9216.45,"end":9223.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In some translations, you get of the only begotten from the Father, which. It doesn't have the word son there. It's."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9224.09,"end":9224.65,"speaker":"Fr Stephen De Young","text":"At all."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9224.65,"end":9235.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. At all. I mean, that's a sort of a. Again, every translation is an interpretation. It's monoyenus is how it is in its inflected form there."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9236.42,"end":9260.42,"speaker":"Fr Stephen De Young","text":"Right. And so there's a couple of different verbs that are a couple different words that can end up giving you mono y niece, essentially. And then it gets declined. And so only begotten is what you'll see in, like the King James."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9260.83,"end":9260.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9260.95,"end":9295.88,"speaker":"Fr Stephen De Young","text":"And that kind of thing. So why would we say that? It doesn't necessarily mean that here? Well, that's context. Right. So we just had in verse 13, right. The use of that verb, begotten, that exact verb, to talk about the ones who become the children of God. Right. So if now in the very next verse, St. John says that Christ is the only one who is begotten, that doesn't make sense that it contradicts itself."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9296.44,"end":9297.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9297.88,"end":9305,"speaker":"Fr Stephen De Young","text":"The other meaning of mono yinis. Right. Is of its own genus, meaning unique."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9305,"end":9309.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One of a kind, literally a single of a kind."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9310.36,"end":9335.23,"speaker":"Fr Stephen De Young","text":"Right, right. And so even if we're carrying over the begotten idea, because we do have here for the first time in this passage, Otheos here is referred to as the Father. Right. It's the same person. Right. So if you want to carry that idea, we still want to say that Christ is unique among sons."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9335.47,"end":9335.87,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9336.19,"end":9340.91,"speaker":"Fr Stephen De Young","text":"Right. He's different than other children of God or sons of God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9341.24,"end":9341.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9342.12,"end":9345.64,"speaker":"Fr Stephen De Young","text":"So the uniqueness is what's being emphasized here."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9345.88,"end":9352.84,"speaker":"Fr Andrew Stephen Damick","text":"Minimally, however you translate the word, you need to have some sense of Christ's being unique."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9353.48,"end":9375.2,"speaker":"Fr Stephen De Young","text":"Right. But further, in the context here, it's the one who is uniquely from the Father. Why would he need to say from the Father in a unique sense? Well, because he's. He's just talked about. Remember when he brought up St. John the Forerunner, he was carefully distinguishing."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9375.2,"end":9378.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There was a man sent from John, from God. Yeah."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9378.6,"end":9391.12,"speaker":"Fr Stephen De Young","text":"Right, Right. And so. And St. John was the paradigm then for the other prophets. Right. So there are these other men sent from God. Right. Christ is uniquely from the Father."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9392.87,"end":9393.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9393.03,"end":9425.18,"speaker":"Fr Stephen De Young","text":"Christ is from the Father in a different sense. He goes for the Father in a different sense than prophets, even though prophets are also sent by God. This is a different thing. This is unique. And backing up that interpretation is the fact that in the very next verse, verse 15, St. John refer. St. John the Evangelist returns to St. John the Forerunner with this parenthetical comment to differentiate them again."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9425.26,"end":9446.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, which again, the parentheses are not in the original Greek text. But it's a good. You know, it makes sense to interpret it with, you know, translate it with parentheses. Okay, so verse 15, John bore witness about him and cried out, this was he of whom I said, he who comes after me ranks before me because he was before me."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9448.26,"end":9463.38,"speaker":"Fr Stephen De Young","text":"Right. And that's literally with that verb tense again. He was being before me. He existed before I existed. Right. So St. John is one of those people and things that comes into being, whereas Christ always was being."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9463.46,"end":9479.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is important because in the way that traditional cultures tend to think, whatever comes after something else usually is lesser or lower rank. Like, so every son is obedient to his father and his father is greater than he."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9479.92,"end":9480.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9480.36,"end":9503.16,"speaker":"Fr Andrew Stephen Damick","text":"Is the way that it generally goes. And so St. John is saying, look, even though he's coming after me, like I'm here on the scene first, and John is literally just a few months older, right. He's saying, even though he comes after me, he's actually before me. He ranks before me because he always was being. He is from of old, you know, and so I'm actually the lesser person here."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9503.96,"end":9507.04,"speaker":"Fr Stephen De Young","text":"Right, right. He's the. He's the newcomer."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9507.04,"end":9507.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9507.32,"end":9541.78,"speaker":"Fr Stephen De Young","text":"So again, this is not. There is now in the incarnation. This is a new thing. Right. There was this pattern he talked about in the Old Testament, but now this is a break of pattern. Right. The word becoming flesh is not just another instance of the word coming to humanity the way he came to humanity throughout the Old Testament. This is now different in a different sense. And then that's what's developed further in verses 16 and 17."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9542.18,"end":9583.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So those read like this. For from his fullness we have all received grace upon grace. For the law was given through Moses, grace and truth came through Jesus Christ. And you notice I emphasized. And we'll talk about this in a second here, given through Moses, grace and truth came through Jesus Christ. But probably the first thing I think that to me underlines what's going on in these two verses is that phrase that gets translated by the ESV is grace upon grace. But you said you think that it should be grace after grace, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9583.59,"end":9590.95,"speaker":"Fr Stephen De Young","text":"Yeah, yes. Grace after grace. Both of the things mentioned in verse 17 are in the category grace."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9591.59,"end":9593.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9593.11,"end":9598.15,"speaker":"Fr Stephen De Young","text":"The Torah, the law is in the category grace. Sorry, Martin Luther."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9600.22,"end":9603.02,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. Not. We've had a server with us this time around."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9604.22,"end":9624.02,"speaker":"Fr Stephen De Young","text":"Right? So. Right, so it's grace after grace. Right? And then 17, four. That's because. Yeah, right, right. So in both cases. So verse 16. Because. Right. And that's a. Why is it different? Right? How is it different? Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9624.02,"end":9629.35,"speaker":"Fr Andrew Stephen Damick","text":"It's. It's given. In this case, that's the verb through Moses. Well, no, first."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9629.67,"end":9645.27,"speaker":"Fr Stephen De Young","text":"How is. How is the incarnation of Christ the enfleshment of the word? How is that different from that pattern? Right? It's different because from the fullness of the Logos, we have all received grace after grace."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9645.27,"end":9646.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Okay. Excuse me."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9646.63,"end":9647.03,"speaker":"Fr Stephen De Young","text":"Because."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9647.75,"end":9648.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9648.79,"end":9658.81,"speaker":"Fr Stephen De Young","text":"The first grace, grace number one is that the law was given through Moses. The verb being given. Right, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9658.81,"end":9660.13,"speaker":"Fr Andrew Stephen Damick","text":"It's coming from someone else."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9660.69,"end":9693.07,"speaker":"Fr Stephen De Young","text":"Right? There is a giver and it isn't Moses. Right, right, right. It wasn't given by Moses, it was given through it. So someone else gave it. Who? Right, The Logos. Right. That was part of that Old Testament pattern. Right? So I was given through us, but grace and truth came and that came. Is that came into being Word again, this kind of context, it has an idea like arrived. Right, right. Came into this world. Right. Arrived right. Through Jesus Christ."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9693.15,"end":9703.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I, at least my understanding of. Part of why we shouldn't translate that has come into being. Exactly. Is because grace and truth are not like objects. They're not created objects."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9703.55,"end":9705.55,"speaker":"Fr Stephen De Young","text":"Right. There aren't things that didn't exist before."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9705.81,"end":9709.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, exactly. Yeah. They arrived."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9709.65,"end":9745.66,"speaker":"Fr Stephen De Young","text":"Yeah, right. They arrived through. Through the person of Jesus Christ. Right. And both of these, right, Are the Logos is the agent because the Logos is Jesus Christ who is full of grace and truth. Right. As we saw in verse 14. And the logos is the one who gave the Torah through Moses. Right. The Logos is behind both of those. But now he has arrived. Yeah, he is present. Yeah, Fully present."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9745.9,"end":9756.78,"speaker":"Fr Andrew Stephen Damick","text":"So saying that it might make people think that verse 18 doesn't make any sense because the first thing it says, and this really is our wrap up verse here, everybody."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9757.17,"end":9757.49,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9758.29,"end":9772.85,"speaker":"Fr Andrew Stephen Damick","text":"No one has ever seen God, the only God who is at the Father's side. He has made him known. Okay, so how can St. John say no one has ever seen God given everything that he just said?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9773.97,"end":9780.93,"speaker":"Fr Stephen De Young","text":"Right? And so this isn't a retcon, right, where it's like all that stuff where the city saw God Forget about it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9781.09,"end":9783.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9785.31,"end":9787.39,"speaker":"Fr Stephen De Young","text":"So he mentions the Father here."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9788.35,"end":9788.71,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9788.71,"end":9792.35,"speaker":"Fr Stephen De Young","text":"Right. No one has ever seen. So no one has seen the Father."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9794.03,"end":9794.39,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9794.39,"end":9798.99,"speaker":"Fr Stephen De Young","text":"And that word that's translated only in the ESV that you read is really this mono. Again."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9799.07,"end":9800.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Unique."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9800.67,"end":9816.98,"speaker":"Fr Stephen De Young","text":"Right, Unique. The unique God. Right. And there's a textual variant here. The ESV is kind of updated because it's. They had access to older forms of the text. The oldest form of the text has Monoionis Theos."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9816.98,"end":9818.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the unique God."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9818.66,"end":9823.22,"speaker":"Fr Stephen De Young","text":"The unique God. A lot of later texts have Monoionis."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9823.62,"end":9825.86,"speaker":"Fr Andrew Stephen Damick","text":"Eos, the unique Son."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9826.42,"end":9842.36,"speaker":"Fr Stephen De Young","text":"Unique son, Right. For our purposes here of what St. John is saying, it actually doesn't matter which it is. Right, Right. And our understanding that Christ is God, even in this text, read verse one, right?"}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9842.84,"end":9843.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9844.12,"end":9864.88,"speaker":"Fr Stephen De Young","text":"Even if it is. Even if we are to read Eos here. Fine. Right. We still understand that Christ is God. The idea there is the uniqueness, Right. This unique one, this unique one who is God and who is the Son also is the one who has made him known."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9865.35,"end":9866.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9866.23,"end":9866.95,"speaker":"Fr Stephen De Young","text":"Throughout history."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9867.43,"end":9881.51,"speaker":"Fr Andrew Stephen Damick","text":"The point here when, when John says no one has ever seen God, he's speaking of the Father. No one has ever seen the Father, but he's. He's revealed to mankind he's made known by the Son."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9882.39,"end":9914.79,"speaker":"Fr Stephen De Young","text":"That's the one by. Right. By the Yudi God, by the Logos, the. By the debary away. Right. Which is what we saw in the Old Testament. St. John is just reading that from the Old Testament, Right. So that means that the person who Moses spoke to face to face is the Logos, is Christ. The person who came and stood by Samuel's bed is Christ. The person who touched Jeremiah's lips is Christ. That's what St. John is saying here."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9914.95,"end":9951.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you might wonder like, okay, he's pulling all this out of the Old Testament, what's new here? There is something new, which is St. John is identifying Jesus Christ, the son of Mary, born in Bethlehem. He's saying this one that came and dwelt among us, tabernacled among us, is this word of the Lord whom we've always known. That's what's going on. He's making this identification is what's happening here."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9952.09,"end":9971.24,"speaker":"Fr Stephen De Young","text":"Right. And so then what's going to now unfold in the Gospel proceeds from that point. This one, the Dabario, eh, The second power in heaven, Right. This person who is acting all through the Old Testament, became flesh and dwelt among us. And now here's the story of that."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":9972.68,"end":10047.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in trying to Think about ways of summarizing this in my mind, not that you could really summarize it well, but I mean, try to think about what I can kind of lodge in my mind to understand, especially this phrase, the Word of the Lord or the Word of God. You know, the first thing that came to mind for me was that this is talking about Christ, the Son of God in his revelatory role. Right. This is him revealing God to mankind, revealing the truth. Right. But it's not quite enough, actually. I mean, it's true. That is true. Right. Better, I think would be to understand that the Word of the Lord or the Word of God is, is our Lord Jesus Christ as the kind of interface from God to creation. Right. So this is thinking in the top down sense. This is God reaching out to his creation. And it's manifest in multiple ways this notion that the Son of God is the Word of the Lord. Right. So yes, revelation for sure."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10047.72,"end":10048.04,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10048.04,"end":10202.2,"speaker":"Fr Andrew Stephen Damick","text":"He speaks and he tells things to the prophets, he teaches the apostles and so forth. But as we just saw in St. John's gospel at the beginning, creation itself, again, this is God interfacing with the creation. The act of creation itself is by the Word of the Lord. He's the one by whom, for whom, through whom all things are made. Right. And then also, and this was the part that, as you just already heard me, I'm just astonished about this, really. He's not only the one who. In whom we become as God, in whom we are divinized, deified, theosis, adoptionist, sons of God, but He sends his light out from the very beginning, beginning of creation itself. This is the Word of the Lord, sends that light out so that the humanity that he's about to create would receive it, would receive the glory that we see in his face, that would receive that light, that love of God that would transform us and make us into the sons of God. There's so many different kinds of language that are used to talk about our Lord Jesus Christ in scripture. And it's so appropriate, this episode we're focusing on this one phrase, the Word of the Lord or the Word of God. And this to me is the way to kind of understand, I don't want to say this side of Christ. He doesn't have sides. But at least this way of talking about him is that this is God reaching out to his creation, sometimes to create, sometimes to speak, but always to save. And always from the very beginning, to save, to transfigure, to enlighten, to fill us up with Himself as He prayed in his great high priestly prayer in John 17, that the glory that he received from the Father before all time will be given then to those who become faithful to him, to who are given this ability to become the sons of God. And my prayer for all of us is that we would see and receive that light as much as we're able. Father STEPHEN."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10205.08,"end":10574.39,"speaker":"Fr Stephen De Young","text":"So there's a couple things here, but the main one that I kind of want to focus on is what this means in terms of our view of the relationship between Christ and the world, and therefore between Christianity in our lives. Because we've been taught for a long time to compartmentalize our life, our mental life, our emotional life, our physical life into these sort of discrete sections and discrete areas. And some of them are not supposed to intrude on the others. We're told explicitly that that's bad if that happens. And what that does is it kind of splits our thinking and our brain and our understanding. So we think we can understand how to have a successful marriage or how to raise kids, or how to conduct ourselves in the workplace or carry out a career, or, even, you know, be on the parish council at our church, whatever it is. We think we can understand that without any direct reference to, like, religion, because that's over in its own category. And of course, Christ is there in that. In that religion category. But if we take seriously what the Scriptures are telling us about the Word of God and his relationship to creation, both at the beginning, when it was created throughout time, and holding it together in his interactions with humanity for salvation throughout. It's about setting in order, creating and putting things in order, establishing this rational order of the creation and within ourselves, such that Christ not only is the agent of that, but he also is that order. What does that mean? That's rarefied error. What that means is we can't understand anything if we don't understand and come to know Christ. We can't understand the simplest task in our everyday life. We can't understand the experiences we have every day. We can't understand the interactions we have with other people. We can't understand who we are, what it means to be human. We can't understand anything, how to interact, how to conduct ourselves, how to conduct ourselves as a community, as a polity, in any context, until we come to know Christ. The more we come to know Christ, the more we ourselves are set in order. And then everything else starts to fall into place. Everything else starts to make sense because He's. The sense of that lies behind it. He's the purpose that lies behind it. Anything we want to know, anything we want to accomplish, anything we want to heal, anything we want to fix, anything we want to understand. The only way to that is through Christ. That's coming at it one way, but it's also true the other way. It's true the other way. One of the other things that's happened due to that compartmentalization is once you separate these things, once you separate religion, and you separate Christianity from all these other aspects of life, once they're separated, you can then pit them against each other. We have a long heritage, especially in the United States, but probably I'm thinking elsewhere, at least in the west as well, of pitting religion, sometimes just referred to as faith, but pitting religion, pitting Christ, pitting the gospel over against science learning, academics studying, right, the learning of the creation. People have retreated as a result of overreacting to our 19th century German friends into this kind of trench warfare where you're following one or the other. But if the reality is that Christ is the sense that lies behind all these things, then any knowledge that is real knowledge, any knowledge that is true, that expresses truth, is knowledge of Christ. As we come to understand the creation, not just the material creation vis a vis science, but creation in terms of art and beauty and nature and emotional connections between people, the world around us. The more we come to understand it, the more deeply it will lead us to know Christ. And this creates a reciprocal relationship. Coming to know Christ allows us to understand the world in ourselves. Coming to understand the world in ourselves leaves us to come to know Christ when we're healthy and we're doing this effectively. Any knowledge that seeks to pull you away from Christ or attack your relationship with Christ, your closeness with Christ is knowledge, falsely so called. It's not knowledge. It's a lie by definition because anything opposed to the truth is a lie. And anything that is a truth, that is the truth is of Christ. So that's what I wanted to emphasize. I think this is a very important part. We've got two more parts of this series to go. Talking about Christ in the Scriptures, especially the Old Testament scriptures. But to me, this is the especially important part of Christ as the Logos, Theu who in these last days has become incarnate for our salvation. Amen."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10574.87,"end":10595.59,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for today. Thank you very much everyone for listening. If your message did not get included in this episode, we'd still love to hear from you, either via email@lordofspiritsancientfaith.com, or you can message us at our Lord of Spirits Podcast Facebook page. We do read everything but cannot respond to everything and we do save some of what you send for possible use."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10595.59,"end":10603.52,"speaker":"Fr Stephen De Young","text":"In future episodes and join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10603.6,"end":10615.6,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook as Father Stephen again is not like our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10616.56,"end":10629.29,"speaker":"Fr Stephen De Young","text":"And finally, while you're remembering that Jamestown preceded the Massachusetts Bay Colony, be sure to go to Ancient Faith Support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10629.45,"end":10632.33,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much, good night and God bless you."}
{"episode_id":"LOS - #032 - 2021-11-25 - The Word of the Lord","start":10634.89,"end":10672.1,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the the throne and the beasts and the elders and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
