{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":0.4,"end":65,"speaker":"Fr Stephen De Young","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":66.68,"end":130.49,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, everyone out there in radio land, you are listening to the Lord of Spirits podcast. My co Host, the Very Reverend Dr. Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-2372-346855. Afraidio Montes Ka Trudy is taking those calls tonight and we're going to get to those in the second part of our show. But before we do that, on October 26th through 29th, 2023, at the Antiochian Village in Western Pennsylvania, which I do not live near, that is the other Pennsylvania. I mean it's fine, but I just don't live there. We are going to be holding the first ever Lord of Spirits conference. Father Stephen and I are going to be there as well as Fathers David Subu and Lucas Christiansen. And we are very happy to mention that Archbishop Alexander Gallitzin will be speaking as well."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":131.13,"end":143.99,"speaker":"Fr Stephen De Young","text":"Also, folks, if you see Archbishop Alexander, do not harass him about Lord of Spirits. Yeah, please leave Ladika alone. Right, Leave him alone."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":144.15,"end":145.67,"speaker":"Fr Andrew Stephen Damick","text":"We're just very happy that he's coming."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":145.83,"end":147.51,"speaker":"Fr Stephen De Young","text":"Yes, he might reconsider."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":147.83,"end":151.51,"speaker":"Fr Andrew Stephen Damick","text":"Don't walk up to him in a bat costume and expect that he's gonna know what that's about."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":151.75,"end":153.35,"speaker":"Fr Stephen De Young","text":"Yes, he might."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":153.91,"end":192.09,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, there will be a D and D tournament as Father Stephen has forced me to mention on air repeatedly. We're still going to be, we're still working on the Schedule. But God willing, we're going to get some details out to you very soon. I have to say, though, that rooms are selling very fast. Like, really fast. It's crazy, crazy, crazy, crazy how fast they're selling. So if you want to come, I suggest you make up your mind to come. You can register and see what details are currently available@store.ancientfaith.com an events."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":192.41,"end":204.33,"speaker":"Fr Stephen De Young","text":"If the rooms sell out, I think we need to go straight. Or when the rooms sell out, I think we need to go straight to opening up an area for tent camping mud and just turn this into, like Lord of Spirits, Woodstock."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":204.81,"end":245.65,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Yeah, that'd be good in some ways, but not in others. Tonight, though, we're going to be continuing our series on the sacraments, the Orthodox Church, and we're going to be discussing the mystery of Holy Mary matrimony. Is marriage merely a human institution? Does it exist outside the church? Did the Church invent it as a sacrament in the 4th century? What does the rite of marriage actually do? That's what we're going to be discussing. And this is also one of those episodes that we have to say, even though we will not be getting graphic parents, please listen to this one before you consider sharing it with younger kids. Just FYI."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":246.45,"end":248.69,"speaker":"Fr Stephen De Young","text":"So I didn't warn you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":249.89,"end":258.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. So is this episode all about how marriage is just a thing that any two people who really love each other can go ahead and do?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":259.73,"end":260.13,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":262.37,"end":263.33,"speaker":"Fr Andrew Stephen Damick","text":"That's what I thought."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":263.57,"end":293.78,"speaker":"Fr Stephen De Young","text":"Yeah. Also, once again, I've talked to you folks. I'm including you even in this, Father Andrew. Now, okay, I've talked to you folks at Ancient Faith repeatedly about not wanting to be associated with that guy who was talking before we went live. He's frankly a heretic. He should not be on your airwaves. I don't even want to listen to him. I have never listened to him. But the little bits I've had to hear have set my teeth on edge, as it were."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":293.78,"end":300.7,"speaker":"Fr Andrew Stephen Damick","text":"Well, the 15,000 people who are not listening to this live do not even know what you're talking about. But so much the better."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":300.78,"end":306.84,"speaker":"Fr Stephen De Young","text":"Just in case, right? Disassociated, shunned, anathema."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":308.76,"end":310.12,"speaker":"Fr Andrew Stephen Damick","text":"But amen."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":310.12,"end":318.28,"speaker":"Fr Stephen De Young","text":"As you mentioned, marriage is what brings us together today. Do you even get that reference?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":318.36,"end":319.32,"speaker":"Fr Andrew Stephen Damick","text":"I do. I."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":319.4,"end":321.32,"speaker":"Fr Stephen De Young","text":"Okay, I saw that when it first."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":321.32,"end":323.24,"speaker":"Fr Andrew Stephen Damick","text":"Came out, as I'm sure you did as well."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":323.32,"end":326.56,"speaker":"Fr Stephen De Young","text":"Yes, yes, Many of our zygotes at."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":326.56,"end":333.1,"speaker":"Fr Andrew Stephen Damick","text":"The time, but back in the 1980s, when life is so much simpler and most of the popular music Was so much happier."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":333.74,"end":344.78,"speaker":"Fr Stephen De Young","text":"Yes, that's true, actually. Not all of it, though. Not all of it. Not the stuff from Britain. Well, wham aside. Okay, anyway, we're digressing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":346.78,"end":347.18,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":349.42,"end":355.98,"speaker":"Fr Stephen De Young","text":"We'Re gonna do what we usually do and start our discussion with the creation of humanity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":358.54,"end":360.86,"speaker":"Fr Andrew Stephen Damick","text":"Just a lot of good material in Adam, I tell you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":362.54,"end":365.02,"speaker":"Fr Stephen De Young","text":"Was that a deliberate pun?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":365.74,"end":366.86,"speaker":"Fr Andrew Stephen Damick","text":"I'll let you take that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":367.1,"end":392.29,"speaker":"Fr Stephen De Young","text":"Okay. So, as we've talked about, of course, many times, right. On the show, that humanity is created to bear the image of God. And we're phrasing that way on purpose, as longtime listeners will know, because this is sort of a verbal idea."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":393.25,"end":393.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":393.89,"end":470.39,"speaker":"Fr Stephen De Young","text":"The image of God is not sort of a static thing or a quality or something, but is a capacity that we are commanded to exercise in the world. And right off the bat, the first time humanity as male and female. Right. The first time we get the two biological sexes is in actually the end of Genesis 1, when we're told that humanity is created in the image of God, and male and female, God created them. Right. And this is. We've heard this so often, it doesn't strike us. And we're also living in a world which, as secular and materialistic as it may have become, is still deeply informed by Christianity. So that this doesn't hit us in the way it would have originally. Not just the idea that both male and female humans bear the image of God in the world. Right. But even that they're both human."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":472.39,"end":472.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":473.67,"end":477.03,"speaker":"Fr Stephen De Young","text":"Is pretty big for the late Bronze Age."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":477.75,"end":495.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, not only that, you know, like. Right. That. That ancient pagans generally regarded humans from various parts of the world as not even being from the same origin. So, like, the idea of humanity all kind of coming from one thing is not a thing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":495.62,"end":526.24,"speaker":"Fr Stephen De Young","text":"Yeah, from one. From one source. Right. Yeah, yeah. And then you get to the details of men and women in particular, you find somebody like aristotle in the 4th century BC who is a bold innovator, virtually a feminist by 4th century standard revolutionary, because he's the first person we know of to break with preceding Greek thought and say that men and women are the same species."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":528.72,"end":529.12,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":530.64,"end":578.01,"speaker":"Fr Stephen De Young","text":"Well, there is a but. But he did think they're the same species. If you read the Hippocratic Corpus, Right. Which you may be able to tell from the name, like, the Hippocratic Oath is the oath that physicians take. Right. The Hippocratic Corpus is sort of a collection. Not all of it goes back to Hippocrates himself, but a collection of Greek medical texts. They're very clear that men and women are not the same species. They are two different types of organisms. But Aristotle says they are the same. Now, he's only a feminist for his time because he says that female humans are sort of defective male humans."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":578.49,"end":587.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Isn't the idea that the fetus tries to become male and the ones that fail are female are born female?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":587.25,"end":612.42,"speaker":"Fr Stephen De Young","text":"Yes. So he kind of thinks women are a birth defect, but they're still human. Right. But that Aristotle's medical stuff is fascinating to me because it's so elaborate and so well worked out and so systematic and it makes so much sense. Except none of it's true. Right. It's all completely wrong. Amazing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":612.9,"end":615.62,"speaker":"Fr Andrew Stephen Damick","text":"You know, he's like a great world building fantasy author."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":617.78,"end":663.5,"speaker":"Fr Stephen De Young","text":"There is, there's just no connection to actual biology. But, but so if that in the 4th century BC, if that's a bold innovation. Right. We're talking about a text that has its roots at least, we'll say 700 years before that. At least. Yeah, right. 700 years before that. That says that not only are male and female humans both human, but both created by God, both bearing the image of God. Right. And therefore presented as being of equal value as human beings."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":664.06,"end":666.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's crazy. In the ancient world."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":666.22,"end":683.98,"speaker":"Fr Stephen De Young","text":"Yes. So, so I mean, this is radical. This is radical. Here we go. Somebody will quote this, right? The Bible teaches radical egalitarianism for the Bronze Age. To leave off the. For the Bronze Age part."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":684.3,"end":691.18,"speaker":"Fr Andrew Stephen Damick","text":"But it's going to be somebody's phone ringtone."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":691.5,"end":743.31,"speaker":"Fr Stephen De Young","text":"Yes. Just quote the rest and send your angry emails when you read that quote to Father Andrew. Ancientfaith.com Amen. So we then get into chapter two of Genesis. We're not going through the whole Bible this slow. I know that's the kind of thing we might do someday on this show, but not today. Today is not that day. But we get into the second chapter and there is this problem of Adam's aloneness. Right. This is the first time where God says something is not good. Everything else he created he said is good. He says it is not good that man is alone on the earth. And we tend, as we do as modern Western people to think of this in sort of psychological terms."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":743.87,"end":745.95,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Adam just feels really bad."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":746.19,"end":765.99,"speaker":"Fr Stephen De Young","text":"Adam's lonely. He's a sad boy in the garden because he's, he's all alone. And then, you know, the naming of the animals follows this. And I have literally heard people teach this as if the animals were brought before Adam to see if he could mate with any of them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":767.11,"end":771.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Already we're Heading up against the parental advisory with the mention."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":771.79,"end":778.07,"speaker":"Fr Stephen De Young","text":"Yes. You know, like, oh no, I can't marry this zebra. No, can't marry that goat either."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":778.31,"end":779.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And God throws up his hands."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":779.75,"end":814.13,"speaker":"Fr Stephen De Young","text":"Come on, Adam, look at all these animals. Yeah. Like God know that. Right. No, no. Right. None of that is true. That is fractally wrong, that whole foregoing interpretation. So in actuality, the idea of aloneness here is talking about the fact that there's only one of him. Right. Because remember, there's two commandments given to humanity to fill the earth and subdue it. Right. Put things in order, fill them with life."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":814.69,"end":815.17,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":815.17,"end":889.59,"speaker":"Fr Stephen De Young","text":"Right. Adam can't fill the world with life by himself. He can't reproduce by budding. That's not a power or capacity that he has. Right. So that's what the aloneness is about. Right. As we've mentioned on the show before, the naming of the animals we have, especially in Hittite excavations, we have images of the king standing with a rod and naming wild animals. And so this is an image of the king's authority to establish justice. Right. That he's putting things in order. So the wild animals are sort of being tamed or domesticated by him by virtue of him naming them, comprehending them. Right. So that's Adam doing that part of the job. So the idea is, well, Adam can do this one part of the job, but he can't do the other part of the job. And so for that to happen, God says he needs in Hebrew an atzer."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":889.59,"end":893.31,"speaker":"Fr Andrew Stephen Damick","text":"Kenegdo, which is the name of my next band."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":894.44,"end":901.96,"speaker":"Fr Stephen De Young","text":"Yeah, I thought he was that guy who got his arm cut off in the Mos Eisley Cantina. But wait, that was Pon da Baba. Nevermind."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":903.08,"end":906.52,"speaker":"Fr Andrew Stephen Damick","text":"That's probably true. It does sound like a George Lucas style name."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":906.68,"end":907.16,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":908.12,"end":910.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I really didn't think about that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":910.52,"end":917.24,"speaker":"Fr Stephen De Young","text":"If I saw the Hasbro Black series Eightzer Kadegdo figure, it would totally fit. There was like a hammerhead or something in there."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":917.24,"end":926.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I mean, this gets translated in the good old King James. Help meet. Which you see this sometimes like as a single word."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":926.38,"end":926.66,"speaker":"Fr Stephen De Young","text":"Help."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":926.66,"end":947.18,"speaker":"Fr Andrew Stephen Damick","text":"Meat. Yeah, but. But really it's. Which I mean is. You can do that in English, but really it's. It's help. And then meat is a more slightly archaic usage of meat, meaning appropriate. Right. Which you know, like when we. We translate the Oxyonestine hymn as it is truly meat."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":947.42,"end":948.7,"speaker":"Fr Stephen De Young","text":"Yes. It is eaten. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":949.01,"end":956.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yes, Right. It's truly meat and. Right. Or just. Yeah. Which in Greek is just action Este. Just Two words."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":956.29,"end":987.18,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Because it assumes that it. Yeah. So, yeah. So eights are. There is. Is like a helper or an assistant. Right. Someone who's going to cooperate in some sort of work. And then connecto means roughly fitting. This has a literal sense. That refers to the biology of male and female organisms fitting together."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":987.74,"end":988.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":989.02,"end":1030.1,"speaker":"Fr Stephen De Young","text":"He said euphemistically. But it goes beyond that. It includes that. But it goes beyond that. It's like two puzzle pieces that fit together. Right. Two halves of a whole that sort of dovetail. Right. It sort of meet. Meet in the middle and form one thing. Right. So Adam, at this point already, and I'm saying this to distinguish from certain other theories that you'll find in certain ancient authors, Adam is not an androgynous being. Right, Right. At this point."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1030.42,"end":1036.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because if. If he needs someone to fit together with him, then that means he's not both things or."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1037.06,"end":1044.74,"speaker":"Fr Stephen De Young","text":"Right, yeah, Right. He is not both things. He is not neither thing. Right. He is one of the two things. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1046.26,"end":1047.7,"speaker":"Fr Andrew Stephen Damick","text":"Without the other puzzle piece."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1047.78,"end":1066.27,"speaker":"Fr Stephen De Young","text":"Right, right. And that's just implied in the language. Right. And so in order to create this other person, I'm now going to ruin some more Sunday School. We may have talked about this other show before, so it may be pre."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1066.27,"end":1070.27,"speaker":"Fr Andrew Stephen Damick","text":"Ruined, but I get to play the etymology jingle for this, though."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1071.31,"end":1071.75,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1071.75,"end":1074.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, in a second."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1074.27,"end":1078.19,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Don't jump the gun. I know you're hovering on that button."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1078.59,"end":1080.83,"speaker":"Fr Andrew Stephen Damick","text":"I am. It's been a while since I played it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1083.07,"end":1099.71,"speaker":"Fr Stephen De Young","text":"So you were probably told at some point that Eve, even though she doesn't get called Eve until after the expulsion from paradise, that woman is made from Adam's rib."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1100.67,"end":1101.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1104.12,"end":1105.24,"speaker":"Fr Stephen De Young","text":"That's not what it says."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1105.96,"end":1109.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. We'll talk in a second about why it seems."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1109.04,"end":1110.04,"speaker":"Fr Stephen De Young","text":"In Hebrew or Greek."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1110.44,"end":1111.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1111.16,"end":1190.12,"speaker":"Fr Stephen De Young","text":"In Hebrew or Greek, that is not what it says. So the word that's used there. So, like, if you look up the Hebrew word, and I think also the Greek word in most biblical Lexica, you will find the meaning rib listed. But then if you look at the instances where it is used in the Bible, in either case, Hebrew or Greek, you will find that the only place where it's translated rib is here, and everywhere else, it's translated differently. That should tip you off that something's up everywhere else where this occurs. This refers to a side, and it's a side, like dorsal, ventral. It's very often used architecturally to refer to, like, one half of a symmetrical building. So the idea here actually, in. In the text is that Adam is pulled apart. That's why he goes into this sleep like death. Right. Because God is going to pull him in two. Right. And then the two halves get built up to be man and woman, ultimately, Adam and Eve. Right. Now you can go with the button."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1190.2,"end":1236.27,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right, here we go. Hey. All right, so how did we get rib? We spent. Well, this is my fault probably, but we spent several minutes the other day discussing this to try to figure out where the rib thing comes from. Because the word, as you said, the word in Hebrew and Greek, they do not mean rib. And I can affirm for everybody that English translations of the Bible from at least the 8th century have been translating this word as rib. So Old English, Middle English, Modern English, this is a grand old tradition of translating."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1236.27,"end":1240.88,"speaker":"Fr Stephen De Young","text":"Wait, wait a second, wait a second. Did you say English translations from the 8th century?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1241.52,"end":1242.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1242.56,"end":1249.04,"speaker":"Fr Stephen De Young","text":"You mean all that Reformation history stuff I was taught was wrong? Yes, that the Bible didn't exist anyway. Go ahead."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1249.04,"end":1377,"speaker":"Fr Andrew Stephen Damick","text":"Latin until then. Yes, that's right. Yes. Right. Yes. I have read parts of the Bible in Old English. It's great, actually. It's really cool. So, yeah, the earliest translations we have into English translate this word as rib. And they're translating not from the Greek or the Hebrew, they're translating from the Latin, vulgate. So I thought, okay, well, maybe the Latin has the word rib in there. And so the word that's there, and this is the inflected form, is costam. And when you look up, if you look that up in a Latin dictionary, it just says the first definition will be rib. And then after that it says side, side, side, various things that mean side. So it's not super clear exactly actually why it is that English translations have been using rib for 1300 years. But it seems that possibly there was an earlier sense of rib that meant it goes all the way back into proto Indo European. The root seems to mean something like roof or covering. And so then that gets used metaphorically to refer to the rib cage, the thing that covers or holds all the organs in. So, yeah, so English, you're going to see rib, typically, but it just really doesn't quite mean that. But this is one of these translations that doesn't seem to. We can't seem to quite shake it. It's not in every modern English translation of the Bible, but it sure isn't a lot of them. And one thing. See, this is the other part where the parental advisor kicks in. Now, so rib has been used in English long time as a slang word. To refer to women. And then I actually discovered a weird sense from, I think, the 16th century, the phrase rib joint, which I thought and always for me has meant like a barbecue place, you know, but apparently it's used to refer to brothels. So there you are, everybody. So if you needed a good reason not to say rib anymore, when you're looking at Genesis, the opening chapters of Genesis, there you are."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1377.9,"end":1383.1,"speaker":"Fr Stephen De Young","text":"I should have known better that as soon as we put that parental advisor, you just go completely out of control."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1385.26,"end":1387.22,"speaker":"Fr Andrew Stephen Damick","text":"Etymology can be pretty racy at times."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1387.22,"end":1391.42,"speaker":"Fr Stephen De Young","text":"Yeah, we're in a dangerous place because I was already out of control and now."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1393.26,"end":1395.18,"speaker":"Fr Andrew Stephen Damick","text":"Nothing'S holding us back. Except Trudy."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1395.58,"end":1399.94,"speaker":"Fr Stephen De Young","text":"Yeah. Who could shut this whole thing down before we're finished. She could."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1399.94,"end":1403.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. Obviously we haven't offended her enough yet."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1403.26,"end":1424.16,"speaker":"Fr Stephen De Young","text":"So we'll get there. So, side. So, like, side of beef. Yes. So Adam, when he awakens from his death, like, sleep, right. Looks, sees her, says, whoa, man. No, Hard."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1424.16,"end":1425.8,"speaker":"Fr Andrew Stephen Damick","text":"Hardbinger of haggis."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1425.96,"end":1435.68,"speaker":"Fr Stephen De Young","text":"Yes. So in Hebrew, it's man is ish and woman is isha."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1436.08,"end":1436.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1436.56,"end":1462.89,"speaker":"Fr Stephen De Young","text":"And so you have this. The. Say a similar kind of wordplay to man and woman, right. That there's a little added element. He says, I will call her woman because she is from the man. Right. From ish, from me. Right, from the man. And this is why he says, surely this is bone of my bone and flesh and my flesh. He means that literally."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1463.45,"end":1463.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1463.81,"end":1492.23,"speaker":"Fr Stephen De Young","text":"Right. He could even call her his better half and mean it literally. So, but. And this is why it is said that the. The two will be one flesh. Right. And there's the whole bit about leaving your father's house and cleaving to your wife. Leaving cleave."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1492.95,"end":1500.15,"speaker":"Fr Andrew Stephen Damick","text":"And this is another one I just had to point out. Cleave is one of those amazing English words that means something and its exact opposite."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1500.87,"end":1511.07,"speaker":"Fr Stephen De Young","text":"Yes, yes. And also means attacking up to three adjacent opponents in World of Warcraft. But that's a whole other topic."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1511.31,"end":1511.87,"speaker":"Fr Andrew Stephen Damick","text":"True."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1514.83,"end":1604.88,"speaker":"Fr Stephen De Young","text":"So this is here at the beginning of Genesis, right? And so this is at the core we're going to see that Christ himself is going to come back to this when talking about marriage. But this is sort of the core of marriage here, that humanity is divided into men and women. And in marriage, at least for those two persons, they come back together and form one flesh, one being. Right? So this is. This is the core understanding. And this is already in Genesis 2. This is before the expulsion from paradise and everything else, Right. This is the foundational level that marriage. Right. In Our sacrament series. Right. None of the other ones have gone back this far yet. Right. This is the earliest one. Right. And we're going to come back to why it's the earliest one. But to telegraph. Right. As we've seen from the discussion we've already had tonight, marriage is uniquely linked to the purpose for which man was created to exist in the world."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1605.76,"end":1611.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So it's a foundational, almost the original sacrament, really."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1612.4,"end":1656.04,"speaker":"Fr Stephen De Young","text":"Yes. And then when we move further in Genesis, when we get. Starting with chapter 12, we get into Abraham, we get into what are called chapters 12 through 50 are the patriarchal narratives. Right. We have these stories of the. The patriarchs and that patriarchy doesn't get smashed. But. And what makes these especially relevant to our discussion is if you're orthodox or you've ever been to an orthodox wedding service, we reference these marriages in particular within the prayers, within the marriage blessing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1657.16,"end":1672.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah. They all start with, bless them, O Lord, as thou didst Bless Abraham and Sarah. Bless them, O Lord, as thou dost bless Isaac and Rebecca, on and on without really saying much about them. Just sort of name dropping. We assume everyone reads their Bible."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1674.63,"end":1734.16,"speaker":"Fr Stephen De Young","text":"Yeah, we assume everybody knows who that is. Yes. Which we should. Which we should. I was thinking something else, but I'll leave that unsaid. So we. That, of course, starts with Abraham and Sarah. Right. And the dynamic between Abraham and Sarah in the story of Abraham is interesting, Right. Because Abraham, both in Genesis and then as that is read by, for example, St. Paul, Abraham is sort of the archetype of faithfulness in the Torah, Abraham is the faithful one. He's faithful even to the point of being willing to sacrifice his son. The one place where he has problems with faithfulness is with his wife, Sarah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1735.04,"end":1738.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's always trying to pawn her off as. No, this is my sister."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1739.04,"end":1779.67,"speaker":"Fr Stephen De Young","text":"Don't go speak her. I would prefer not to die. Pharaoh Biblic. Right. And the whole issue with Hagar, right, this is the one place where he sort of struggles. And when I say he struggles with faithfulness, I'm not doing a pun like being faithful to his wife, though obviously that's a problem here, too. But in each of those cases, it's actually the core issue is his faithfulness to God. Right, Right. Because God has told him that he's going to have a son by Sarah when he goes and sleeps with Hagar."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1779.92,"end":1782.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. They're always trying to come up with some alternate solution."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1783.76,"end":1795.36,"speaker":"Fr Stephen De Young","text":"And the reason. The reason he passes her off twice as his sister is because he's Scared someone is going to try to kill him to take her."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1796.16,"end":1796.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1797.2,"end":1843.77,"speaker":"Fr Stephen De Young","text":"Right. So it's a lack of trust. Right. In God for protection that that manifests. That's the one point of the struggle. And so part of, part of what happens in the relationship between Abraham and Sarah over the course of their lives, over the course of their relationship with each other as it plays out in the story of Abraham is him learning how to be faithful to God by treating her with the kind of dignity and respect that she is due. And that really culminates at what is really a very touching story, if we pause and read it closely, of his purchasing a tomb and his burial of her."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1844.25,"end":1844.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1845.53,"end":1894.19,"speaker":"Fr Stephen De Young","text":"At the end of. At the end of their lives together, then you move on to their son, Isaac and Rebecca. And Isaac and Rebecca are really presented in Genesis as the ideal couple. Like the ideal married couple. The ideal of marriage. They're Israel's sweethearts. Right. And you see this especially with their actual marriage, like their wedding is described briefly in Genesis 24:67. And there's this element that of course, we again, as modern people skim over very quickly."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1895.55,"end":1898.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it looks kind of just normal."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1898.11,"end":1961.57,"speaker":"Fr Stephen De Young","text":"Like, well, of course, duh, where it says Isaac loved Rebecca. We're like, well, yeah, duh, they're getting married. I hope so. Right. But that's a disconnect with most of world history and even a lot of the world today, people did not fall in love and get married for most of human history. Right. This is a very, very. Well, most of our romantic love stuff is a more. I was gonna say it's a very modern thing. It's actually more like a renaissance thing. But that idea, right, of. Of you meet someone and you fall in love. In reality, people were married still in a lot of the world today. Everywhere in the ancient world, it was an arranged marriage that happened when you came to adulthood, usually about 13. Right. When someone went through puberty, essentially, they were married off by arrangement of their families. Often didn't meet before the wedding day."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1961.97,"end":1981.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I should also add, by the way, on the other side of that, that at least I know this was the case in the Greco Roman world. I'm not sure about anywhere else. But if you fell in love with someone and you became lovesick, you know, the sense of obsession with them or whatever, which, you know, in our time, like this is a thing that's celebrated."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1981.73,"end":1984.13,"speaker":"Fr Stephen De Young","text":"But at that period, every pop song."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1984.21,"end":1985.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, exactly."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1985.57,"end":1987.77,"speaker":"Fr Stephen De Young","text":"Except break period songs, you could hire."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":1987.77,"end":2004.36,"speaker":"Fr Andrew Stephen Damick","text":"A doctor to come and cure you of this because they Saw it as deeply debilitating and not something to be pursued. In fact, you know, probably bad for the, bad for the family because, you know, almost certainly you weren't lovesick over the person that your parents had arranged for you to marry."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2004.76,"end":2010.52,"speaker":"Fr Stephen De Young","text":"Oh, yeah, yeah, yeah. It was a weakness of character that you would allow yourself to be carried away in such a way by."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2010.52,"end":2010.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2011.16,"end":2028.5,"speaker":"Fr Stephen De Young","text":"Frivolous emotions. Yep. So, yeah. So the fact that he loves his wife would have jumped out. Right. Because this was an arranged marriage too. Right. We have the story of how this marriage. She's his first cousin."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2029.22,"end":2032.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. They send the servant off to go find her."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2032.34,"end":2059.82,"speaker":"Fr Stephen De Young","text":"Yeah. Abraham doesn't want him to marry a Canaanite and so sends him back to their own people, which is his uncle's house. And it's his first cousin he's never met. Right. But he loves her. Right. And so the love is something that is giving. It's sort of like the soul to the body of their marriage. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2059.82,"end":2060.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2061.42,"end":2074.12,"speaker":"Fr Stephen De Young","text":"And it also stands out that this, that's very clearly being held up as the ideal. Isaac is one of the patriarchs who only has one wife ever."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2075.64,"end":2076.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2079.32,"end":2085,"speaker":"Fr Stephen De Young","text":"Right. There's no concubines, no polygamy, no nothing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2085.4,"end":2085.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2086.28,"end":2101.56,"speaker":"Fr Stephen De Young","text":"We're going to come back to that later. Right. But just, just notice it here. Yeah. And this I should be clear because I said, you know, people didn't marry for romantic love. This isn't talking about romantic love either. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2101.8,"end":2104.84,"speaker":"Fr Andrew Stephen Damick","text":"No, it's. Yeah. He's self sacrificial towards her."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2105.08,"end":2145.03,"speaker":"Fr Stephen De Young","text":"Right. So people have studied this and the concept of love is actually periodized sort of in human history. Right. As Father Andrew was mentioning, love in the ancient world was largely considered a weakness. It was like pity that you had some weakness or vulnerability towards someone or something. Right. And was not. Was completely disassociated from sexuality. No real connection with it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2145.27,"end":2145.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2147.27,"end":2230.51,"speaker":"Fr Stephen De Young","text":"And was often. Was more often used when it was used in some kind of positive sense. It was much more often used to talk about what we would call friendship than what we would call a romantic relationship. So the next phase after that is Christian love. This is secular folks. We'll talk about. There's Christian love, the idea what love comes to mean in Christianity in the New Testament, which is of course the New Testament is an interpretation of the Old Testament. So I'm not saying this suddenly starts with Christianity, but this is drawn from the Hebrew scriptures as well. But Christian love, that you should love your enemies, that you should love your neighbor, and Christian love, what differs with that? Is that Christian love? Not only is it directed. Is it to be directed toward everyone, even those who hate you, but involves taking concrete actions. It's not just a feeling. Right, right. And this, you could see this through one little bit of etymology that I'll steal from Father Andir, which is I."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2230.51,"end":2231.27,"speaker":"Fr Andrew Stephen Damick","text":"Don'T own it all."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2232.15,"end":2234.47,"speaker":"Fr Stephen De Young","text":"The Latin word for love is caritas."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2235.33,"end":2237.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes. From which we get our modern word charity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2237.41,"end":2245.01,"speaker":"Fr Stephen De Young","text":"Charity. Right. And in fact, you'll see English translations of like St. Augustine that will talk about faith, hope and charity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2245.73,"end":2246.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2247.33,"end":2272.78,"speaker":"Fr Stephen De Young","text":"And that's not because charity has radically changed its meaning. Right. It's that actually caring for others, doing works of love. Right. It is what Christian love meant. Right. It was a concrete thing. And this included within marriage. Right. It wasn't about having a certain feeling when you look at your wife or your husband."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2273.74,"end":2304.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's interesting. Even the modern English word love, at least historically, etymologically. Right. It actually doesn't mean any of this that we've just been talking about. It's actually related to words like libido. It doesn't come from libido, but it means. It refers to desire. Right. That's what that word. And you know, it's funny, we naturally use that word now, but the problem is we project that meaning back onto what's being talked about in these ancient contexts."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2305.19,"end":2332.54,"speaker":"Fr Stephen De Young","text":"Right, right. And you get the emergence of romantic love in the Renaissance, the high Medieval, late Medieval and Renaissance periods. Right. Where. This is where you start talking about courtly love, this kind of thing where love is sort of an affection toward an object, a feeling of reverence and awe toward an object, an appreciation of its beauty."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2333.82,"end":2334.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2334.22,"end":2340.86,"speaker":"Fr Stephen De Young","text":"And so you get these writings for people who are deeply in love with someone who they've maybe never met and never will."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2341.53,"end":2341.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2342.01,"end":2344.81,"speaker":"Fr Stephen De Young","text":"Dante and Beatrice, even though Dante is married to someone else."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2345.53,"end":2345.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2346.01,"end":2347.13,"speaker":"Fr Stephen De Young","text":"What kind of things?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2347.37,"end":2350.17,"speaker":"Fr Andrew Stephen Damick","text":"What. That's true."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2350.81,"end":2362.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, Right. These. These kind of things. And this is. This is where our concept of romantic love starts to emerge. Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2362.85,"end":2363.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep, Yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2364.17,"end":2377.71,"speaker":"Fr Stephen De Young","text":"Looking at that girl across your eighth grade class. Right. And thinking she's just the most wonderful thing you've ever seen. Right. That's. That's. This kind of love. Right. Which you got to see is greatly devalued from Christian love."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2378.51,"end":2378.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2379.15,"end":2394.91,"speaker":"Fr Stephen De Young","text":"Then when we move past that, we get to this Freudian period where it becomes desire. Right, right, right. Desire for someone. I desire to have them, I desire to possess them. I desire something from them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2397.82,"end":2417.1,"speaker":"Fr Andrew Stephen Damick","text":"And then. And then this gets mixed up with the Natural, normal feelings of friendship. And then that's where you get like our modern slogan you hear from some people, love is love. It's like, well, yeah, that you are experiencing is a combination of desire and probably friendship. But that's not what love is in the scripture."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2417.98,"end":2490.16,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that's. There's an old rabbinic story, or at least I was told it's an old rabbinic story. I don't know a lot of old rabbis, but where a man walks into a diner and he goes up to the lunch counter and sits down, and there's a guy sitting next to him eating a fish on a plate. And he looks at him and he says, how's the fish? And the guy says, oh, I love this fish. The second guy says, you love him. You just cooked him and cut him up and ate him. And the point there is, this is how in the modern. Modern times, 19th, 20th century, maybe to the 21st century, all too often this is actually right. It's not just, well, if you love him, well, why don't you marry him? Right. It's that we look at it as what he really loves is not the fish. Right. He wasn't going to put him in a bowl and take him home and feed him and care for him. Right. What he loved was how the fish made him feel, how the fish tasted."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2490.4,"end":2490.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2491.12,"end":2504.51,"speaker":"Fr Stephen De Young","text":"The gratification he got from the fish as he consumed it. And this is how we're taught to look at love. Love is about consumption. Love is about how someone or something makes us feel."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2505.47,"end":2513.31,"speaker":"Fr Andrew Stephen Damick","text":"And that's why, you know, the famous philosopher, when he asked, what is love, his next thought was, baby, don't hurt me."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2513.79,"end":2588.2,"speaker":"Fr Stephen De Young","text":"Yes, don't hurt me no more. So, yeah, so this is. We have to radically shift. We're talking about this now because, of course, Isaac is where this comes up. Isaac and Rebecca, that Isaac loved Rebecca. But as we go forward into things about spouses loving each other, we have to be very clear because of how misshapen these different ideas of love have been. What we really mean, and ultimately what we mean and what we will always come back to is that the love part, right, is always something concrete. It's always something you do, something you choose to do, and it's something you choose to do regardless of how you feel at that moment. And the reason I'm making this point is that a lot of us have been taught the opposite. We've been taught that somehow if you do something but you're not feeling it, that's somehow phony or Hypocritical or bad?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2588.68,"end":2596.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I would say that when you do something good when you're not feeling it, that's actually more virtuous."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2596.68,"end":2610.52,"speaker":"Fr Stephen De Young","text":"Yes. Yes. So this is something I always. In the premarital counseling sessions, this is something I always tell people when they're getting married. Right now, my wife and I were America's sweethearts. So this doesn't apply to us."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2610.68,"end":2611.48,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2611.72,"end":2721.2,"speaker":"Fr Stephen De Young","text":"We are just continuously, completely in love. But for most people, you know, you have these, especially as the wedding approaches, you know, and right after newlyweds, right. You have these very intense feelings. Right, of love. But eventually it's a few years later and your stomach's making weird noises in bed in the morning and no one's wearing any makeup and everybody's hair is sticking out in weird directions and you slept funny and there's smells and, you know, it's 6:00am and you have to get up and go to work and you're not looking at your spouse and feeling that same, you know, rub the Vaseline on the lens in the old movie, right? The fuzzy, oh, right, this person's the most handsome or beautiful person I've ever seen. Right. And if that's what you think love is, then what are you going to conclude after enough days like that? Well, love's gone, so I should probably go too, right? And that ain't it. That's not love. Love is when you're feeling those feelings, you show love and you do things that demonstrate your love for your spouse. And when you're not feeling it, you do the same things because faithfulness and love are sort of intimately connected in that way. And the feelings will come and come and go. So all that is to say, this is not saying Isaac felt some kind of warm feelings, right, that he, you know, wrote bad poetry for her that didn't rhyme."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2723.92,"end":2728.48,"speaker":"Fr Andrew Stephen Damick","text":"Blank verse is a very respectable form of love poetry. I'm just saying."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2728.8,"end":2735.36,"speaker":"Fr Stephen De Young","text":"I didn't say all poetry that doesn't rhyme is bad. I just said kind of."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2736,"end":2738.8,"speaker":"Fr Andrew Stephen Damick","text":"Bad poetry launched a thousand chips."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2739.12,"end":2764.34,"speaker":"Fr Stephen De Young","text":"The bad poetry that you write when you're in love with somebody as a teenager usually doesn't rhyme because if it does rhyme, it sounds like you're trying to rap at them. That's unattractive. So you try to make it poetic by not rhyming and it's just a mess. No 13 year old can write iambic pentameter, especially not when his love struck. Prove me wrong."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2765.54,"end":2769.02,"speaker":"Fr Andrew Stephen Damick","text":"I did try, but that was a long time ago. And I did not keep any of those."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2769.02,"end":2771.46,"speaker":"Fr Stephen De Young","text":"So you wrote bad poetry that didn't rhyme."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2771.75,"end":2772.87,"speaker":"Fr Andrew Stephen Damick","text":"See, I know."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2775.43,"end":2786.95,"speaker":"Fr Stephen De Young","text":"So exhibit A. So next we get to Jacob. And Jacob has a couple of wives and a couple of concubines."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2787.67,"end":2792.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I mean this is where the 12 tribes of Israel come from is these four women."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2794.15,"end":2800.64,"speaker":"Fr Stephen De Young","text":"And what we see in that family is all the issues associated with polygamy."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2800.96,"end":2803.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not great."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2803.4,"end":2805.6,"speaker":"Fr Stephen De Young","text":"See the rivalry between Leia and Rachel."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2806.32,"end":2806.88,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2807.76,"end":2816,"speaker":"Fr Stephen De Young","text":"Rivalries between the sons. You see with. I won't get too graphic about this, but you see with Reuben."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2817.12,"end":2817.6,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2818.4,"end":2820.56,"speaker":"Fr Stephen De Young","text":"Right. Incest problems."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2821.36,"end":2821.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2825.05,"end":2835.21,"speaker":"Fr Stephen De Young","text":"And all I'll say is to the modern day polygamous situations show those same exact issues. Right. Over and over again."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2835.69,"end":2837.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This has never been done well."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2838.33,"end":2878.27,"speaker":"Fr Stephen De Young","text":"Yes. So we're going to get more into this in a bit. But to say this here, often folks will say, well, the Bible doesn't condemn polygamy. That's not actually true. Like I said, we'll get back to it. But even if it were, even if it were, the scriptures can describe things and by the way they are described, expect you as a reader to understand and see, oh, this is not a good thing. It didn't work out well. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2878.27,"end":2879.79,"speaker":"Fr Andrew Stephen Damick","text":"It's never depicted as working."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2880.19,"end":2921.17,"speaker":"Fr Stephen De Young","text":"And to take a lesson from that. Right, right. Without having to cudgel you over the head and say, hey, don't do this. And especially when every time it's presented there are problems. What was the previous time to this? The whole thing with Hagar. That didn't go well. Right. So that's just. And the opposite assumption often seems to be made especially by our atheist friends. Right. Our non religious friends. Is that anything the Bible describes, it's endorsing?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2922.37,"end":2922.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2924.85,"end":2932.51,"speaker":"Fr Stephen De Young","text":"Right. Well, like the Bible says this happens. So the Bible's saying that's fine. It's like what? Timeout. Right. The Bible says idolatry happened."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2934.43,"end":2936.99,"speaker":"Fr Andrew Stephen Damick","text":"We literally don't treat any other book that way."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2937.31,"end":2958.83,"speaker":"Fr Stephen De Young","text":"Yes. The Bible says all kinds of horrible things happen. Right. All kinds of horrible sin. Right. We see God punishing sin. Right. We see God like, you know, the flood. Right. We see God reacting to sin. So if you read that, you wouldn't walk away. If you give it an honest Reed saying, oh, this is saying all that sin was cool."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2959.45,"end":2959.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2961.21,"end":2981.13,"speaker":"Fr Stephen De Young","text":"Right. So yeah. But we'll come back to the whole polygamy issue here. And then the last of these patriarchal marriages is not described in any great detail in the text of Genesis itself."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2981.69,"end":2982.17,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":2982.49,"end":3022.59,"speaker":"Fr Stephen De Young","text":"But flowers into something in later Jewish and Christian literature. And that's. We're told that Joseph in Egypt marries a woman named Asenath, or Asenath, depending on where you look. Hebrew vowels aren't written, but who is said to have been the daughter of a priest named Potiphar. Not the same one in the city that's later known as Heliopolis. That's obviously a Greek name."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3022.83,"end":3027.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It'd be kind of deeply weird if he married the daughter of the other Potiphar. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3028.35,"end":3047.56,"speaker":"Fr Stephen De Young","text":"Wait, what? Right. So. But we're just sort of told that of course, he has Manasseh and Ephraim. Right. So this creates this interesting little thing in the text where it's like, well, wait a minute, he married the daughter of a pagan priest."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3048.6,"end":3049.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Mixed marriage."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3049.68,"end":3054.44,"speaker":"Fr Stephen De Young","text":"He's not an Israelite. He's worshiping the Egyptian gods. That seems a little weird."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3054.84,"end":3063.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's this fun text. I can't remember the date of it is. But it's just. It's certainly before Christ. Right. Within the. A couple centuries before."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3063.55,"end":3067.91,"speaker":"Fr Stephen De Young","text":"Yeah. It's probably second century B.C."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3068.23,"end":3068.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3068.95,"end":3070.79,"speaker":"Fr Stephen De Young","text":"Maybe third, but probably second."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3071.11,"end":3109.05,"speaker":"Fr Andrew Stephen Damick","text":"Just titled Joseph and Azenith. You can find translations of this on the interwebs. It's not very long. You could read it all, I think less than an hour, probably. And it's basically a romance story. Right. But it's really more, in some ways the story of how Azanuth, like, she sees Joseph and he is hot stuff. And I mean, that's what the text essentially says, you know, lo, the man fair to look upon, you know, and let's see somebody. That's just dynamic equivalence. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3109.05,"end":3110.41,"speaker":"Fr Stephen De Young","text":"That's how I'm trying. Yeah, yeah, there we go."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3110.41,"end":3160.67,"speaker":"Fr Andrew Stephen Damick","text":"Dynamic equivalence. Yeah. And the implicit version, I must have him. Right. And. But, you know, she comes to him and he's like, no, you are a pagan. And she goes away, very sad. But eventually discovers, wait, I can become part of Israel and then we can be together. And so she does. It's the tale of her leaving idolatry and becoming part of Israel and worshiping Yahweh, the God of Israel, and they get married. So, you know, in this. So this comes from the sort of Hellenistic Jewish world, so it serves all kinds of interesting purposes in that world. Right. It's the story of a pagan becoming part of Israel and. And all that kind of stuff. But it's definitely a very different kind of character than the scriptural texts because it is. You know, she falls in love with him. Right, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3160.67,"end":3238.3,"speaker":"Fr Stephen De Young","text":"And it's. It's a. Yeah. I don't. We won't digress now and talk about how ancient romances are and are not related to the later concept of romantic love. But it's sort of. The literature is sort of an attempt to write. The problem it's aimed at is this. Well, wait, Joseph the patriarch marries a pagan. Right? Right. But the recasting of that as romance, of essentially her conversion story, which is a supernatural conversion story, which is referenced by Christ in one of his post resurrection appearances. Go back to a previous episode to find out more about that. Casserole is of theological importance. Right. So we can't know how much of its early popularity among Christians was because of what. Right. Because it became. Even though it was written as a Jewish text, this text became wildly popular in early Christianity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3238.62,"end":3239.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3239.9,"end":3246.06,"speaker":"Fr Stephen De Young","text":"And is found all over the place at Christian monasteries. Presumably the monasteries didn't have it for the romantic value."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3247.9,"end":3248.3,"speaker":"Fr Andrew Stephen Damick","text":"What."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3249.18,"end":3264.48,"speaker":"Fr Stephen De Young","text":"And more for the theological value. But when you think about the early church and you think about Gentiles coming to faith in Christ, you think about some of the imagery we're going to talk about later tonight of Christ as the bridegroom."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3265.2,"end":3265.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3266.08,"end":3301.26,"speaker":"Fr Stephen De Young","text":"You can see how that narrative of this woman who's coming out of paganism and becoming part of the household of God, how that would express a kind of Pauline theology to Gentile Christians. Right. It's sort of a very powerful narrative way beyond just, you know, oh, Joseph is described as good looking and she's described as good looking and."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3301.34,"end":3301.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3303.26,"end":3365.34,"speaker":"Fr Stephen De Young","text":"You know, and you know, she's from a small town and has to go back there and meets a divorced guy with a dog. And anyway, that's not actually in the story. That's every Hallmark movie. You can go watch those. It's a whole channel of them 24 7. So those are these patriarchal stories. And as we said at the beginning of that, those marriages are sort of highlighted in the Orthodox wedding service. So as we go forward in scripture, there is more about marriage. And obviously different genres of biblical literature are going to talk about this in different ways. One of the themes that you find, especially in wisdom literature, but also in the prophets, is the theme of finding love, finding joy with the wife of your youth."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3366.58,"end":3366.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3368.58,"end":3392.5,"speaker":"Fr Stephen De Young","text":"Right. So Proverbs 5:18 says very bluntly, let your fountain be blessed and rejoice in the wife of your youth, which is pretty straightforward. And the idea of the wife of your youth is that this is that person who you got hitched to at age 13."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3393.92,"end":3394.16,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3394.4,"end":3448.28,"speaker":"Fr Stephen De Young","text":"Right. Possibly not having ever met her, your family arranged it, who knows what she looked like and whether that was appealing to you. Who knows what her voice sounded like? Who knows if she honked when she laughed. Right. We don't know. But you were married to her, and now she is your wife. Many men in that kind of situation, in that kind of society, as you might imagine, once they were older, once they had found some measure of success in life, once they had more resources, would be tempted to go and divorce that wife who they maybe hadn't wanted to marry in the first place because they figured they could do better, go marry someone younger, someone who they found more attractive, someone who. Whatever. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3448.28,"end":3448.8,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3450.4,"end":3521.66,"speaker":"Fr Stephen De Young","text":"And, you know, that occasionally happens today, too, but that's even without our arranged marriages. And so the idea of finding joy, finding love with the wife of your youth is, again, a mode of faithfulness. Right. That faithfulness is not just right at one level. We've talked a lot on the show, especially in recent episodes, about faithfulness in terms of keeping the commandments of God and obedience. But faithfulness also has to do with the roles that we have, the places that we occupy in our communities, in our families. Right. In our. In our vocations. Right. We have these places we occupy, these roles that we play in them. And those roles and those places we occupy have certain expectations and responsibilities and duties."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3522.54,"end":3523.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3523.18,"end":3565.15,"speaker":"Fr Stephen De Young","text":"And a right way for them to be carried out in terms of bearing the image of God in the world. And a big part of faithfulness is not just not lying, not stealing, not murdering anybody. Right. All those are bad. But a big part of it is faithfully living out those roles, even though many of those roles, more now than ever before, but still now, many of those roles are not of our choosing. We don't get to choose who our parents are going to be, but by virtue of them being our parents, we have certain responsibilities to them that we have to exercise faithfully."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3565.55,"end":3598.67,"speaker":"Fr Andrew Stephen Damick","text":"I think this is one of the things that's really hard for, at least within our culture, for people to accept, because there's so much cultural emphasis on the idea of you can grow up to be whatever you want to be. You know, whatever it might. Whatever it might be. I didn't choose you. It's really remarkable how ingrained that idea is of sort of limitlessness, and yet that's really not a healthy way to be."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3601.23,"end":3604.27,"speaker":"Fr Stephen De Young","text":"And a refusal of responsibility unless we chose it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3605.31,"end":3605.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3607.63,"end":3610.99,"speaker":"Fr Stephen De Young","text":"I can only be responsible for something if I voluntarily choose to be."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3611.69,"end":3613.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3614.65,"end":3621.29,"speaker":"Fr Stephen De Young","text":"And that's just not so. I mean, in ancient cultures, you got to choose basically. None of it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3622.01,"end":3622.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3622.89,"end":3635.77,"speaker":"Fr Stephen De Young","text":"You didn't get to choose your spouse, whether you'd be able to have kids or not. What you do for a living, you are apprenticed off to somebody or you just grew up farming like 18 generations of your parents and grandparents had."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3636.41,"end":3643.99,"speaker":"Fr Andrew Stephen Damick","text":"No one says, so. You know, why don't you have a conversation with your guidance counselor about what you'd like to major in, and then we'll think about some placement for you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3644.23,"end":3670.31,"speaker":"Fr Stephen De Young","text":"You ate what food you could get and you'd hoped you could get enough of it to live. Right. You did get to choose whether you're going to get sick. I mean, you didn't choose any of it. Right? Now we have so much more choice. And possibly having all of those choices has made us feel like all the places we don't choose are shackles."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3671.4,"end":3671.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3673.96,"end":3696.36,"speaker":"Fr Stephen De Young","text":"But they were never shackles. They were opportunities to display faithfulness. So in this theme about the wife of your youth, the prophet Malachi, which, depending on what version of the Hebrew Bible, Old Testament, you're looking at, might be the last book, or it might not."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3698.12,"end":3698.52,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3700.53,"end":3707.65,"speaker":"Fr Stephen De Young","text":"Malachi says a little more in that context and says some interesting things that we're going to come back to a couple times tonight."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3707.97,"end":3714.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So God is taking them to task. So it starts off with this, Malachi is a prophet."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3714.65,"end":3715.73,"speaker":"Fr Stephen De Young","text":"So that goes without saying."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3715.97,"end":3720.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, exactly. Yeah, that's true. It's pretty much how it goes. Prophets don't show up and say, good job, everybody."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3720.93,"end":3722.13,"speaker":"Fr Stephen De Young","text":"Yeah, good job, good job."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3724.21,"end":3763.24,"speaker":"Fr Andrew Stephen Damick","text":"So Malachi 2, starting with verse 13, going through 15. And this second thing you do, you cover the Lord's altar with tears, with weeping and groaning, because he no longer regards the offering or accepts it with favor from your hand. But you say, why does he not? Because the Lord was witness between you and the wife of your youth to whom you have been faithless, though she is your companion and your wife by covenant, did he not make them one with a portion of the spirit in their union? And what was the one God seeking godly offspring? So guard yourselves in your spirit, and let none of you be faithless to the wife of your youth."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3765.24,"end":3778.04,"speaker":"Fr Stephen De Young","text":"Yeah. So the Israelites are sort of getting angry with God, as was their want, Right. Starting in the wilderness with Moses. Let's kill Moses and go back to Egypt. We had it better there."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3778.12,"end":3778.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3780.85,"end":3804.93,"speaker":"Fr Stephen De Young","text":"But this is happening again and they're getting angry, right? Because, you know, they're going and making the sacrifices that are commanded and at least going through those motions, but God is not hearing their prayers and giving them the blessings and the abundance and the victory and all of the things that they think God owes them in return."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3806.1,"end":3806.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3806.82,"end":3836.02,"speaker":"Fr Stephen De Young","text":"They think it's God's duty to provide those things to them. Right. And they're saying, why isn't God faithful to his covenant? And God here says to them, well, how about the wife of your youth? That was a covenant. You had a duty there. Right. Were you faithful to that? How can you then come to God and demand that he be faithful when you're faithless?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3837.62,"end":3847.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And recall way, you know, a few books behind where God said, if you do these things, then you will be blessed."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3847.94,"end":3855.86,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Not if you do the sacrifices correctly. You will be blessed, not pagans."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3855.86,"end":3856.9,"speaker":"Fr Andrew Stephen Damick","text":"This is not magic."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3857.62,"end":3913.01,"speaker":"Fr Stephen De Young","text":"Right. And so as I mentioned, we're going to come back to another aspect of that in Malachi a little later. So getting into the New Testament, a couple places where marriage is discussed sort of famously in the Pastoral Epistles 1 and 2, Timothy and Titus, St. Paul lays out the sort of requirements for who's a good candidate to be a bishop or a presbyter or a deacon. And one of the elements of that that's repeated and if you translate it very literally from the Greek, they have to be a one woman man. It's often translated to English as husband of one wife."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3913.79,"end":3914.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3915.79,"end":3930.91,"speaker":"Fr Stephen De Young","text":"And this is not primarily about polygamy. Polygamy was not being widely practiced amongst St. Paul's Gentile converts to Christianity. This is mostly about divorce and remarriage."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3931.87,"end":3936.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One woman man ever. Not one woman at a time."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3936.59,"end":3941.79,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Yes. This is consecutively, not just simultaneously."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3941.79,"end":3946.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. Neither digamy nor bigamy."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":3946.71,"end":4002.05,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. So this is more connected to what we were just talking about, about the wife of your youth. Right. And that's why this is a mark of character for one of these men who's being considered for a church office. Right. Is that he has done this. Right. He has been faithful to that wife of his youth. And if a person isn't faithful in executing those duties, because it also talks about how he conducts his household with his children, if he hasn't been faithful in those roles for whatever reason, doesn't matter why. Right. If he hasn't been able to. Right. Then we're not going to give him this additional role within the church community to which he probably will also not be able to be faithful if he hasn't been able to be faithful in these other ways."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4003.61,"end":4003.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4004.89,"end":4165.33,"speaker":"Fr Stephen De Young","text":"So that's why it's a mark here. This also communicates to us that it is the Norm for church leaders to be married. This is communicated a bunch of other places in a bunch of other ways. Even St. Paul, who isn't. Right, talks about how he would have the right to take a wife and children with him on his journeys the way St. Peter and the other apostles did. Right. So St. Peter had a wife and children. He had a mother in law who Jesus healed. So this was the norm. And it's what you would expect. Right. Because Christianity at this point is basically a Judaism. In Judaism, the norm was for people to be married. Right. And that remained a strong sort of norm. And the reason I'm emphasizing this so much is that I think this is particularly common in the modern West. I think this is an interpretive thing in the modern west, although it's kind of all around in the west, but this idea. And you can find some proof texts in the New Testament. You're hard pressed in the Old Testament, but in the New Testament you can find some proof texts to try to argue that celibacy is somehow superior to marriage in some way. Those are proof texts. They're taken out of context. It's not true. But at the very least. Right. Even if you want to give those texts some weight as proof texts on that side, there's a whole lot of weight on the other side. Right. Of marriage being the norm, including for apostles. Yeah, Right. Including for prophets in the Old Testament. Right. That this is. This is broadly the norm. And so we would understand that there are people with particular callings. Right. St. John the Forerunner had a very particular calling. Right. St. Paul had a particular calling. And that's St. Paul's argument about why he doesn't have a wife and children. He says, I have this particular calling. And to exercise and be faithful to this particular calling from God, it's better that I not have a wife and children that I bring with me. So it's about a particular calling. And this is important all around when looking at the saints in the church. Right. So when we look at Saint Simeon stylites, that story is not supposed to say to you, hey, if you were really holy, you'd go live on a pillar."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4168.12,"end":4168.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4168.84,"end":4265.21,"speaker":"Fr Stephen De Young","text":"That's not what that's saying. Right. He had a very peculiar, in all senses of the word calling from God that he was faithful to. If you're listening to this, you're listening to it on the Internet. So I could say, assuredly, you do not have that calling to be a pillar saint. Right. Have WI fi up there, or you're being wildly unfaithful. To it, at least if you do. But I'm pretty sure you don't. Anybody listening to this does not have that particular calling. You have a calling from God to do something. Right. But for 99% of the world, probably more than that. But that calling involves family life, right? Family life. Not everyone has to get married. Not everyone. Not you should feel bad about yourself if you're not Right. But the sort of married world, the world of family life, the world of the extended household, is what the vast majority of people in the world today and in the history of the world have been called to by God. And then there are exceptional cases where God calls someone to something else. So then we mentioned earlier the place where Christ talks about marriage in a significant way in St. Matthew's gospel and goes back to Genesis. So we could take a look at that. It's in response to an issue about divorce."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4265.77,"end":4340.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is Matthew 19, 3:12. And I'm just going to read it quickly because we probably are familiar with this passage. And Pharisees came up to him and tested him by saying, is it lawful to divorce one's wife for any cause? He answered, have you not read that? He who created them from the beginning, made them male and female, and said, therefore a man shall leave his father and his mother, and hold fast to his wife, and the two shall become one flesh. So they are no longer two, but one flesh. What therefore God has joined together, let not man separate. They said to him, why then did Moses command one to give a certificate of divorce and to send her away? He said to them, because of your hardness of heart, Moses allowed you to divorce your wives. But from the beginning it was not so. And I say to you, whoever divorces his wife, except for sexual immorality, and marries another, commits adultery. The disciples said to him, if such is the case of a man with his wife, it is better not to marry. But he said to them, not everyone can receive this saying, but only those to whom it is given. For there are eunuchs who have been so from birth, and there are eunuchs who have been made eunuchs by men. And there are eunuchs who have been, who have made themselves eunuchs for the sake of the kingdom of heaven. Let the one who is able to receive this receive it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4341.72,"end":4495.33,"speaker":"Fr Stephen De Young","text":"Yes. So a few comments on that. So notice when Christ describes marriage and it sort of doesn't matter. Right. So the truths that he conveys in his answer are not dependent on the question that led him to say them. Right. What do I mean by that. Right. It's not as if what he says when he quotes Genesis and what he says about marriage and God's original intent in marriage. It's not that. That only applies to questions about divorce. So if you ask a question about anything other than divorce, well, this verse is irrelevant. Right. As some would have it as silly as I just made that sound. But in addressing this question about divorce, Christ describes again the original intent of marriage, which is that the two become one flesh. And if God has made them one flesh, so God is here, the agent who joins them together. The joining together in one flesh is a divine action. Right. What we would call grace. Man cannot separate. Right. Let not man separate. So this is a human divorce, according to Christ's answer here is a human literally trying to defeat the purpose of God, trying to pull apart what God has joined together. So that's condemning divorce in the strongest terms and also describing marriage as. Right. Because he starts with made them male and female. Right. So that's what marriage is. At least the marriage that's being talked about here, the marriage that the Bible talks about, that's what it is. Right. And only one of each. Right. The two become one flesh. Right. And that's what Christ who says original tender marriage is. So of course their question is, well, then why did Moses say you could give her, Send her away? Now, that's not actually what Moses said. We won't go into it right now, but if you go and look it up."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4495.41,"end":4496.45,"speaker":"Fr Andrew Stephen Damick","text":"Sneaky, sneaky."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4496.85,"end":4505.73,"speaker":"Fr Stephen De Young","text":"Yeah. What Moses said was, if you're going to throw your wife out, you have to give her a certificate of divorce. That's not the same thing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4506.05,"end":4511.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a limitation on freewheeling, throwing women out."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4511.51,"end":4515.03,"speaker":"Fr Stephen De Young","text":"He's telling men they can't just abandon their wives and children."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4515.51,"end":4516.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4517.11,"end":4526.43,"speaker":"Fr Stephen De Young","text":"If you're going to leave your family, you have to give her a certificate of divorce. That was not saying, it's fine, don't worry about it. Abandoning your wife and kids."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4526.43,"end":4526.87,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4527.59,"end":4549.45,"speaker":"Fr Stephen De Young","text":"Right, Right. That Torah never said that at all. So they've turned it into this sort of out. Right. And so Christ basically says Moses knew what you people are like. He said, because of your hardness of heart. Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4549.45,"end":4549.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4550.97,"end":4592.14,"speaker":"Fr Stephen De Young","text":"Right. And so he knew some of you were going to abandon your wives and kids. And so he said, well, if you're going to do that, you have to at least do this. Right. At least give them a paper so they could move on with their life and not be stuck in this limbo. Right. Wondering where you went. And so he says, look, you're committing adultery, right? Why? Because God has joined the two of you together. And it's not just humans shouldn't pull that apart. It's humans can't pull that apart. That's why it's adultery."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4595.18,"end":4595.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4599.5,"end":4651.92,"speaker":"Fr Stephen De Young","text":"So then the other part of this that often gets misinterpreted is when the disciples then say, oh, if this is the case, it's better not to marry. And people will often interpret Jesus answer to them as saying, yeah, you're right. Yeah, you guys should all become eunuchs for the kingdom of God. Everyone should be celibate. Which is not at all what he's saying. That's not at all what he's saying. Because what the disciples are literally asking is, wait a minute, if I can't divorce my wife, if I can't abandon my wife and children, I don't want to get married. That's the question they're asking or the statement they're making."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4652.08,"end":4652.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4653.44,"end":4667.36,"speaker":"Fr Stephen De Young","text":"Okay. Christ is not endorsing that. So Christ's answer amounts to essentially, if that's how you feel, then yes, you should stay celibate."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4669.28,"end":4674.03,"speaker":"Fr Andrew Stephen Damick","text":"If it's your attitude, then then please don't yourself on some. On. On a woman."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4674.03,"end":4680.87,"speaker":"Fr Stephen De Young","text":"You know, you are bet. Because you are better off not getting married than getting married and committing adultery."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4681.43,"end":4681.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4682.47,"end":4717.12,"speaker":"Fr Stephen De Young","text":"Or getting married and abandoning your wife and children. Yes, it is better for you not to be married in that case. Right. So that said, last note here in the first half, that's getting back to as I said we would, polygamy. Right. So as I mentioned earlier, there is a place where polygamy is condemned. It's especially not clear in English translations."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4717.6,"end":4718.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4720,"end":4746.57,"speaker":"Fr Stephen De Young","text":"Because of the way they translate it. And you have to do a little bit of comparative Hebrew idiom to get what's going on. But in Leviticus 18:18. Right. It talks about that there's a command that says that you're not to marry a woman. Take a woman as a wife, as a rival to her sister."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4747.86,"end":4753.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which people take to say, okay, you're not allowed to marry sisters."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4753.3,"end":4754.66,"speaker":"Fr Stephen De Young","text":"Don't do what Jacob did."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4754.98,"end":4758.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4758.06,"end":4803.65,"speaker":"Fr Stephen De Young","text":"Don't marry two sisters. Like polygamy is. Okay, as long as they're not related. Right. Or at least not that closely related. But if you take that phrase of sort of marrying sister to sister, Right. And you look at other similar Hebrew idioms where there's like brother to brother or man to man. Right. The way that idiom is used in the Hebrew Bible, you find a whole Bunch of examples where, for example, the army will be arrayed man to man. And the idea of arraying them man to man or gathering them man to man means you're gathering up a whole bunch of them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4803.81,"end":4804.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a series."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4805.81,"end":4840.07,"speaker":"Fr Stephen De Young","text":"Right. Like a whole group. Right, yeah. Man to man is like sequence or series. Yeah. And so the idea here at the core, really, if you understand the Hebrew idiom, is don't keep getting married. Right. You marry one woman, don't marry a series of women. Right, right. Consecutively or simultaneously. And of course, we've already pointed out every example of polygamy in the Old Testament goes badly."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4840.55,"end":4841.11,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4842.07,"end":4856.72,"speaker":"Fr Stephen De Young","text":"Right. And that is only intensified when we're talking about the kings. Deuteronomy 17, 14, 20, in the commandments regarding the Kings, explicitly says the king is not to multiply wives to himself."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4857.52,"end":4862.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which you shouldn't read as say, well, the king's not allowed to be a polygamist, but everyone else is."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4862.56,"end":4869.44,"speaker":"Fr Stephen De Young","text":"Yes. One time when I pointed this out, I had someone say, oh, no, no, no, no. They were allowed to add wives, just not multiply them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4870.64,"end":4871,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4871,"end":4877.68,"speaker":"Fr Stephen De Young","text":"They're allowed to have a few, just not a ton. And I was like, what? But anyway."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4879.79,"end":4880.11,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4881.07,"end":4886.35,"speaker":"Fr Stephen De Young","text":"You can't get that from the original languages, we'll put it that way. That distinction between add and multiply."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4886.51,"end":4889.39,"speaker":"Fr Andrew Stephen Damick","text":"Well, there is this other religion which allows you to have up to four."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4890.11,"end":4894.03,"speaker":"Fr Stephen De Young","text":"There is. Provided you treat them all the same."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4894.27,"end":4895.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4896.19,"end":4939.1,"speaker":"Fr Stephen De Young","text":"Which we really need a good rabbinical commentary on the Quran. Right. Because I think the first thing a rabbi would do with that would be, you will never treat them all the same and therefore you can only have one. Right. Like, we'll turn that right back around. But we don't have that. So I wonder if actually there is such a thing. Write in evil period or something. That would be fascinating. Yeah. This email you can send me if you listener what you know of a rabbinical commentary on the Quran from any era, you can email me about it and I will read that email because I would be super curious about that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4939.26,"end":4942.06,"speaker":"Fr Andrew Stephen Damick","text":"All right. Lordofspaceandfaith.com everybody."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4942.22,"end":4993.72,"speaker":"Fr Stephen De Young","text":"Yeah, hate mail goes to Father Andrew. But that one you can send to me. But. Right. So the idea here, the king is very explicitly right not to. Not to do this. And in addition to the patriarchal stories we talked about where polygamy goes bad, in addition to King David, King Solomon, where polygamy goes bad. Even if you go back to the first example of polygamy in the scriptures, in the book of Genesis, It's Lamech who stands at the culmination of Cain's line at the end of Genesis 4, who sings the song to his two wives about how he's like, way better than God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4994.28,"end":4996.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the first polygamist."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":4996.44,"end":5007.24,"speaker":"Fr Stephen De Young","text":"Right. That's the first. He took to himself two wives. Right. We're not to think that part was okay and everything else he did was bad. That's described there."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5007.24,"end":5007.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5007.72,"end":5091.19,"speaker":"Fr Stephen De Young","text":"And there's a deliberate contrast being made in those genealogies which. Right. We don't maybe notice because we're not huge into genealogies. But the culmination of Cain's line is Lamech with his two wives. The culmination of Seth's line is Noah with his one wife and his sons who each had one wife, which is specified a wife. Right. So this is a very deliberate. Right. The rise of polygamy is presented in the book of Genesis as a sign of falling away from the original intent that Christ points to in Genesis. And so Christianity has never practiced polygamy. There were isolated Jewish sects that practiced it up until the 9th and 10th century, but mainstream Judaism left it alive, left it behind a long, long time ago, long before that. So, yeah, there's not a good case for polygamy out of. Out of the Bible. And pointing to examples of polygamy is not a good way to justify your favorite form of sexual immorality."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5092.31,"end":5092.87,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5093.91,"end":5094.79,"speaker":"Fr Stephen De Young","text":"On that note."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5095.47,"end":5100.19,"speaker":"Fr Andrew Stephen Damick","text":"All right, so we're going to go ahead and take our first break. We'll be right back."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5100.51,"end":5148.14,"speaker":"Fr Stephen De Young","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO. Ancient Faith Publishing is pleased to announce a new release that is part history, part theology, and part devotional. The Story of A History and Theology of Christ explores the complete life and teachings of our Lord from before his conception in Mary's womb until his ascension. Revered 20th century Egyptian elder and scholar Matthew the Poor wrote many volumes on."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5148.14,"end":5151.3,"speaker":"Fr Andrew Stephen Damick","text":"The subject of Christ's significance, life and."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5151.3,"end":5187.09,"speaker":"Fr Stephen De Young","text":"Teachings which translator James Helmi has distilled into one highly readable book that will make a valuable addition to every Christian's library. The Story of Jesus is now available in paperback and ebook@store.ancientfaith.com that's store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen Deyoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5188.61,"end":5202.14,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, voice from Steve. It's the second half of the Lord of Spirits podcast and we're talking about marriage, the sacrament of marriage, the mystery of marriage. This is not a call in show where you can get marital counseling."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5203.82,"end":5205.5,"speaker":"Fr Stephen De Young","text":"I'll try. I'll give it a shot."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5206.3,"end":5210.22,"speaker":"Fr Andrew Stephen Damick","text":"It's just not really a good idea. It's just not a good idea."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5210.7,"end":5212.46,"speaker":"Fr Stephen De Young","text":"You know, I try to steal the Lowe's bit."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5213.58,"end":5214.82,"speaker":"Fr Andrew Stephen Damick","text":"That's right. There is. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5214.82,"end":5215.98,"speaker":"Fr Stephen De Young","text":"We have a show like that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5216.54,"end":5240.1,"speaker":"Fr Andrew Stephen Damick","text":"Sort of. Yeah, yeah. But yes, call in 855-Araidio. We're discussing marriage, especially in the Bible. And we just talked about how saying you can have polygamy based on stuff the Bible says is just not a thing. Like literally there's no point where polygamy comes up where God says, and this worked out really well. Like it's just not."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5240.1,"end":5241.34,"speaker":"Fr Stephen De Young","text":"Or you should do this."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5241.58,"end":5243.1,"speaker":"Fr Andrew Stephen Damick","text":"Actual commandments against it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5243.82,"end":5257.75,"speaker":"Fr Stephen De Young","text":"Yes. So have to. This time it's personal. So we're moving from first half tonight was about marriage. Second half here we're going to talk about weddings."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5258.55,"end":5263.11,"speaker":"Fr Andrew Stephen Damick","text":"There we go. So, yes, the actual moment of making this thing come to be."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5263.11,"end":5266.23,"speaker":"Fr Stephen De Young","text":"Yes. The sort of sacramental thing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5266.79,"end":5267.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5267.27,"end":5281.76,"speaker":"Fr Stephen De Young","text":"And so we're going to start by going back to our friend, the prophet Malachi. And one particular verse out of that section we read before. This is Malachi 2, verse 15."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5282.32,"end":5323.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is cool, by the way. And I was, you know, when we were doing our briefing a couple days ago, I commented the father that, you know, I've read the whole Bible over my lifetime, a couple, you know, a few times, whatever. I just didn't remember this verse. You know, I think by the time you get to Malachi, you've got a little bit of Old Testament fatigue, you know. But this is cool. So listen to this everybody. Malachi 2:15. Did he not make them one with a portion of the spirit in their union? And what was the one God seeking godly offspring? So guard yourselves in your spirit and let none of you be faithless to the wife of your youth."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5327.3,"end":5335.84,"speaker":"Fr Stephen De Young","text":"So this is. And the contents of this are assumed in what we already saw Christ say."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5336.72,"end":5337.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5337.08,"end":5349.68,"speaker":"Fr Stephen De Young","text":"We talked about God joining them together. So we have. It's God actively making them one. So two becoming one flesh is not just a euphemistic description of sexuality."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5350.32,"end":5353.24,"speaker":"Fr Andrew Stephen Damick","text":"No. It's God joining them together as one."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5353.24,"end":5366.23,"speaker":"Fr Stephen De Young","text":"Right. It's a divine action. But this adds this Element of a portion of the spirit being breathed into the union by God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5366.23,"end":5366.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5367.83,"end":5373.99,"speaker":"Fr Stephen De Young","text":"So the two become one flesh and then that one flesh is made alive by the spirit of God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5374.71,"end":5387.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, and you know, see the spirit episode, among other things. But. But yeah, I mean, this is cool, the idea that the Holy Spirit comes into a portion of the spirit, is brought into the union of the husband and the wife."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5389.26,"end":5431.33,"speaker":"Fr Stephen De Young","text":"Yes. And makes the marriage alive. This is deliberately parallel to Adam's creation. Right. Adam is formed from the dust of the earth, and then the spirit is breathed into him and he becomes alive. Right. So the wedding. Right. The marriage, the sacrament, when God does this, when God joins two people together and they receive the spirit. Right. To make that marriage alive, that is an event. It's a moment. But the reality of it, the life of that marriage then extends through the rest of their lives."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5433.8,"end":5434.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5436.68,"end":5459.24,"speaker":"Fr Stephen De Young","text":"So this is always something. Again, I'm laying out all my premarital counseling tool bag tricks here, but a lot of times when people are getting married, you know, they will spend days and days and days and hours and hours and hours stressfully working on all the details of the wedding."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5459.96,"end":5460.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5460.6,"end":5465.32,"speaker":"Fr Stephen De Young","text":"Right. And as someone who had a wedding, it's all kind of a blur."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5466.52,"end":5466.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5468.92,"end":5487.54,"speaker":"Fr Stephen De Young","text":"It's over really fast. And then you're married for the rest of your lives, hopefully. And the amount of time we spend preparing to spend decades together, Lord willing, is a lot less than the amount of time we spend preparing for one afternoon."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5488.18,"end":5488.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5489.06,"end":5495.94,"speaker":"Fr Stephen De Young","text":"And making sure the invitations are on the right color parchment paper. Tasting cakes. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5496.42,"end":5506.74,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I do like to taste cakes. So. Yeah. Wedding plan. It's interesting to think about what we Often people hire wedding planners and so forth."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5507.46,"end":5513.62,"speaker":"Fr Stephen De Young","text":"Yes. You'd be better off hiring a financial planner to help you lay out your finances going into the future, that would be much more helpful."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5514.39,"end":5514.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5515.51,"end":5521.75,"speaker":"Fr Stephen De Young","text":"Than having that day be quote, unquote perfect that you'll barely remember because you were so fatigued and relieved at the same time. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5521.75,"end":5522.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5525.35,"end":5594.67,"speaker":"Fr Stephen De Young","text":"Old man yells at Clouds live on Ancient Faith Radio tonight. So the question then is, so where. If you want a proof text, then if you're looking for proof text, if you want a proof text, that marriage is a sacrament, not a sacrament falsely so called. Sorry, John Calvin, that proof text is Malachi 215 that we read. Right. That in the marriage God makes them, one gives a portion of the spirit in their union. That's not a human activity, that's not a civil function. That's not a contract. Right. That's a sacrament. And this is part of why marriage is the way it is in the Orthodox Church. There's some folks listening. I know. Who aren't Orthodox, may not. And even Orthodox people who've never been to an Orthodox wedding. Right. Because maybe they came into the Orthodox Church and just haven't had the opportunity to see one. One of the big things you notice in an Orthodox wedding is that we don't do vows."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5595.39,"end":5595.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5597.07,"end":5610.67,"speaker":"Fr Stephen De Young","text":"The people both get asked right before the service starts if they're there of their own free will. And then after that, they don't say a thing. They don't do. They're not doing something."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5611.07,"end":5612.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The wedding happens to them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5613.23,"end":5644.17,"speaker":"Fr Stephen De Young","text":"Yes. They are married. It's a passive. Right. And they are married to each other. Right. So it's God's action. So in the same way that in baptism, we have water, in Chrismation, we have miron oil, in the Eucharist, we have bread and wine, in the sacrament of marriage, we have a man and a woman. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5644.57,"end":5648.93,"speaker":"Fr Andrew Stephen Damick","text":"They're the ones being changed into another mode, so to speak."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5648.93,"end":5668.57,"speaker":"Fr Stephen De Young","text":"Yes. So that's. And that's what Malachi is pretty clearly expressing in a very quick way. Right. In one verse. So if we understand then it to be this sacrament. Right. Like, we know who in the Old Testament was doing the sacrifices."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5669.49,"end":5669.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5669.65,"end":5684.37,"speaker":"Fr Stephen De Young","text":"And we've talked about that. We know who's doing this. So who was performing weddings. Right. And what even was a wedding, Right. In the ancient world and in the Israelite and Jewish world."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5684.53,"end":5692.29,"speaker":"Fr Andrew Stephen Damick","text":"And weirdly, you could not. I'm just going to say this at the outset, you could not hire your own Elvis to do your wedding."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5692.53,"end":5908.92,"speaker":"Fr Stephen De Young","text":"Yes. They would have asked you who. But yeah, you couldn't get ordained online either. But so in most cases, the earliest phase. Right. So we're talking about the patriarchal period. Right. We're talking about it was the father of the extended family, patriarch, head of the household. Right. And we talked about that's because that was the person who was invested with the priesthood. That was the person who was doing the sacrifices at the time. Right, right. For the family. That was the family. They were the ones who were effectively. Right. The officiant of marriages within the household. Later that moved to the presbyters, the elders of the clans and tribes in Israel who were sort of the fathers of those extended units. And that's why marriage law was handled as everything else was. I think we've talked about this on the show before. You see these references in the Old Testament to people going to the city gates. Right. And to See those who sit at the city gates, those were the elders of that city. They would sit at the gates of the city and they would be there and they would perform these kind of functions of religious law, which included marriage law. Right. So if you think about the book of Ruth, when Boaz is going to act as kinsman, redeemer for youth, for Ruth, he goes to those elders, right, to say, here's who I am, here's who, here's who Ruth is. I'm the relative, I'm going to marry her. Right. He goes to the city gates to do that because that's where these elders are. So they sort of become the ones in charge of these things. While we're here, we need to make a note on bride prices. Yes, totally. Here's another totally non controversial element of the Bible to comment on. So in the Old Testament, you see this in many places that there was a bride price. And this continued into the New Testament period. This continued in a lot of cultures for a long time where the groom to be and, or his parents and family, an extended family would give gifts, sometimes money, sometimes, you know, sheep, cattle, goats. Right. Flocks and herds. Right. However the, however the economy functioned at the particular time, commodities would give those to the bride's family in return for the bride being released from that family and brought into his family through marriage. And sometimes in the really cool cases, rather than just giving gifts, you would perform some great heroic deeds."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5909.07,"end":5909.39,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5909.47,"end":5912.59,"speaker":"Fr Stephen De Young","text":"Like going and killing and circumcising a few hundred philistines."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5913.07,"end":5917.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or obtaining a sumeral from the crown of Morgoth. Just putting that out there."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5918.11,"end":5922.99,"speaker":"Fr Stephen De Young","text":"You know, these one podcast people, you're feeding them, you're throwing them raw meat, man. I know."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5924.99,"end":5930.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But I mean, you know, Jacob kind of does this, right? He has to spend seven years and then seven more years working, right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5930.95,"end":5979.32,"speaker":"Fr Stephen De Young","text":"Yeah. Because he doesn't have any money. So he trades labor, basically. Yeah, yeah. So this is often shorthanded by people. Right. Modern people will look at this and say, oh look, this guy's selling his daughter. Right. He's, he's buying a wife. He's, you know, and so this woman is just being treated like a commodity to be bought and sold. She's not being treated as a human, she's being treated like a slave. Right. All of this is sort of modern and silly and you're retrojecting things. Most of all, you're retrojecting modern economics into the ancient world. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5979.48,"end":5980.6,"speaker":"Fr Andrew Stephen Damick","text":"They're not capitalists."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":5980.68,"end":6058.86,"speaker":"Fr Stephen De Young","text":"They weren't capitalists. There's no such thing as commodities. People aren't buying and selling commodities in ancient Israel. Right. The idea here is that when you're dealing with this, the actual kind of economics of the time, which is almost entirely agrarian, when we're talking about ancient Israel and Judah, that your, your household, the members of your household, be they your children, grandchildren, nieces, nephews, Right. Everybody in the big extended family, all of those people are all essentially units of labor, meaning they're all working, they're all doing different tasks. Right. So the 13 year old girl who you're about to marry off is not sitting around her room reading Tiger Beat, Right. Listening to boy bands. Right. And you're gonna go and trade her for some goats. Right. It's, it's. She's out there tending animals, helping her mother, mending clothing, helping feed the workers. Right. She's part of the household. It has this role that she's playing that keeps the whole household functioning."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6059.66,"end":6060.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6060.06,"end":6063.58,"speaker":"Fr Stephen De Young","text":"And when you're doing subsistence farming, functioning means alive."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6064.14,"end":6068.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you lose somebody, that could be bad, that's bad for the family."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6069.35,"end":6085.51,"speaker":"Fr Stephen De Young","text":"Yes. And so losing this daughter, having his daughter leave this household and go to this other household. Right. The bride price is essentially paying restitution."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6088.07,"end":6088.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6088.79,"end":6102.4,"speaker":"Fr Stephen De Young","text":"I am doing something negative. This person by taking his daughter away from him, this is going to negatively affect his household. And so I'm going to pay restitution to him to make it right for what I'm doing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6103.2,"end":6103.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6104.64,"end":6108.24,"speaker":"Fr Stephen De Young","text":"There was an example of this in my own life. Oh."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6111.28,"end":6113.44,"speaker":"Fr Andrew Stephen Damick","text":"You'Re going to tell or are you just going to mention that?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6113.6,"end":6178.52,"speaker":"Fr Stephen De Young","text":"Yes. When my wife and I were engaged, I went to go and get her and we were going to drive back to, at the time, Pennsylvania. I went to get her in California, get her from the home of her father and her mother. She was my father in law's only daughter and I was taking her away from him. She had a dog, small Boston terrier named Bean. And this dog had become the apple of my father in law's eye. He loved this dog more than anything. She was my wife's dog at the time, fiance's dog. I could not take this man's daughter and his dog. I could not do this to him. No country song would suffice to express the pain I would have inflicted. And so we left the dog."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6182.04,"end":6184.84,"speaker":"Fr Andrew Stephen Damick","text":"I bet you've gotten a lot of mileage out of that in the years that have followed."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6184.92,"end":6185.4,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6187.96,"end":6188.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6190.12,"end":6197.08,"speaker":"Fr Stephen De Young","text":"So this is the idea. The idea is that taking this person out of their household, you're kind of doing an injury."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6197.48,"end":6199.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So you need to make up for that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6200.12,"end":6204.91,"speaker":"Fr Stephen De Young","text":"So there's restitution. That has to be. That has to be provided."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6205.15,"end":6215.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, like, and you know, the very famous, like Proverbs 31 bit praising, you know, a good woman largely praises her for her industriousness."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6216.03,"end":6219.39,"speaker":"Fr Stephen De Young","text":"Yes. For her quality as a unit of labor. Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6219.63,"end":6220.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6220.35,"end":6225.31,"speaker":"Fr Stephen De Young","text":"Talking about how she's sewing and making these things and selling them in the marketplace and da da, da, da, da, da."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6225.31,"end":6233.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Yeah. So, okay, so this is not going to be an etymology thing. This is more lexicography, because this is really just about definitions."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6233.89,"end":6237.41,"speaker":"Fr Stephen De Young","text":"But do another song. But nothing rhymes with lexicography."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6238.37,"end":6270.78,"speaker":"Fr Andrew Stephen Damick","text":"It's true. Now I'm thinking about. No, never mind. Yeah, so bride price, that's what we were just talking about. This is distinct from a couple of English words that everyone's probably familiar with. Well, the first one, more familiar, which is dowry. And then there's another English word, dower. So a dowry is a price that's paid to the groom along with the wife. Basically, here she is and here's some money or here's land or here's whatever goods."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6272.78,"end":6273.18,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6275.02,"end":6319.98,"speaker":"Fr Andrew Stephen Damick","text":"It functions within political marriages as almost a kind of like, well, there's a whole package of things I'm going to be sending you, including this woman. And then a dower is not exactly the opposite. A dower is a gift that the groom gives to his wife that she gets control over property, money, whatever, mainly so that if he should die, that she's not left with nothing. Right. These things are not the same thing as the bride price that we're talking about. And they're, relatively speaking, kind of later developments. Not always. But that's a different kind of thing than this sort of restitution concept that we were just talking about."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6321.9,"end":6326.38,"speaker":"Fr Stephen De Young","text":"Yes. We're not going to keep going and get to dowager and all that anyway."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6326.38,"end":6327.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that would be fun."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6328.62,"end":6330.06,"speaker":"Fr Stephen De Young","text":"It'd be fun for you, sir."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6330.06,"end":6331.34,"speaker":"Fr Andrew Stephen Damick","text":"That would be a different podcast."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6331.34,"end":6367.86,"speaker":"Fr Stephen De Young","text":"Fun for you. So, so we need to kind of address, because we're talking about, remember we're talking about weddings now. We're talking about marriage as a sacrament. One thing that's brought up sometimes as an objection, sometimes by good natured folks, even folks in the church who I think haven't fully thought it through is you'll hear people say, well, you know, weddings weren't really done in churches until like later centuries."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6369.54,"end":6370.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6370.5,"end":6382.66,"speaker":"Fr Stephen De Young","text":"And it seems like they were just kind of still doing Roman civil weddings or something. They'll say something like that. Right, right. You're laughing because you remember the briefing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6382.82,"end":6383.62,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6383.62,"end":6398.91,"speaker":"Fr Stephen De Young","text":"When we talked about this. So there, right off the jump, there's some obvious problems with this because, like, in the ancient world, what's a civil wedding? What's a secular wedding? Because what's a secular anything in the ancient world?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6399.71,"end":6405.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, civil society is not secular, it's just not a thing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6406.19,"end":6406.59,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6406.59,"end":6407.71,"speaker":"Fr Andrew Stephen Damick","text":"Everything involves gods."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6408.11,"end":6409.79,"speaker":"Fr Stephen De Young","text":"Gods all over the place, Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6410.19,"end":6410.67,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6411.15,"end":6453.97,"speaker":"Fr Stephen De Young","text":"There's not just sort of like, we have this, we have that, or like to think we have that, where we have these sort of neutral, secular, material, mathematical things over here and then these supernatural things over there. If we believe they exist at all, they're over there somewhere. Right. Like separate. But not only did everyone. Except that they were all there, they were all together all the time in the ancient world. Right. So that's not a distinction you can even make in order to sort of make that argument. But so then why weren't weddings done in churches?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6454.37,"end":6454.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6455.17,"end":6455.57,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6455.81,"end":6456.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6456.85,"end":6535.01,"speaker":"Fr Stephen De Young","text":"What were they like and what were they doing? Well, so we'll start with an example of a Jewish wedding in the first century. We've got one in the Bible, in St. John's Gospel, the wedding at Cana. Right. And we see that there are multiple days of feasting. Right. There's a wedding feast that's thrown, guests are invited. Right. And this, again, this is not a quote unquote, secular feast, whatever that would mean. This is a religious feast. Right. Some of the food there is probably from sacrificial animals. Right. So this is, this is this celebration of marriage, because again, we've seen from Malachi, we've seen from the way Christ read Genesis, that they understand that in the marriage God is doing something and that's what's being celebrated. Right. In the feast. But to put a fine point on it, within that feast, the sort of key moment of the marriage is when the bride and the groom would go into the bridal chamber and consummate the marriage. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6535.57,"end":6537.41,"speaker":"Fr Andrew Stephen Damick","text":"Without that, it's not a marriage."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6537.57,"end":6540.93,"speaker":"Fr Stephen De Young","text":"Right. And that's the moment when they're married."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6542.7,"end":6542.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6544.14,"end":6600.02,"speaker":"Fr Stephen De Young","text":"So, and then after that, and we're going to be semi euphemistic about this again, but after that, the bridegroom would typically emerge from the bridal chamber and display, usually on a cloth, the evidence of the bride's virginity up to that point. And again, somewhat euphemistically, if you listen closely to some of the liturgical hymns in Holy Week and Pascha, you will hear references to Christ emerging from the bridal chamber and to emblems of his victory that are connected to this sort of imagery. But so this is why you wouldn't have a wedding in the temple or in a synagogue, because it was not appropriate to consummate the marriage there."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6600.66,"end":6631.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, you know, we may recall, of course, St. Paul in First Corinthians, you know, aiming big criticism at people who involve themselves in pagan, you know, religious rituals because a significant element of them is sexual in the temple. And so, like, this is a pagan thing to do. You don't do sex in Christian and Jewish religious contexts."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6631.39,"end":6631.79,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6632.59,"end":6633.31,"speaker":"Fr Andrew Stephen Damick","text":"In that building."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6633.79,"end":6641.71,"speaker":"Fr Stephen De Young","text":"If you're reading First Corinthians in the original languages. So it's not the bowlerized English. He's telling them they can't do that in the church in Corinth either."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6642.19,"end":6643.35,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6643.35,"end":6679.71,"speaker":"Fr Stephen De Young","text":"There are very clearly some who were wanting to. Yeah, right. So right now there's nothing icky, Right. About sexuality. There's nothing icky about that. It's just there's appropriate and inappropriate places for things. Right, right. St. Paul says the marriage bed is holy and undefiled. Right. But it's not the altar in the temple either. Right. So that's sort of what's going on in a Jewish wedding. Now, if we're going to talk about."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6679.71,"end":6685.03,"speaker":"Fr Andrew Stephen Damick","text":"Roman weddings, this thing that supposedly Christians were doing for centuries until they decided."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6685.03,"end":6693.43,"speaker":"Fr Stephen De Young","text":"To turn into it. So if you're going to say that they weren't having some kind of quote unquote Christian wedding until, what, the fourth century, what do people say, fourth century, fifth century?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6693.43,"end":6695.95,"speaker":"Fr Andrew Stephen Damick","text":"I think that's usually. I mean, I'm not a liturgical history scholar."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6696.03,"end":6733.64,"speaker":"Fr Stephen De Young","text":"Somewhere in there where they say, oh, this is when they start being Christian weddings, you're kind of implying that this was going on even among Christians until the 4th and 5th centuries, 6th century, whatever you want to say. And I think we're going to see as we talk about what a Roman wedding looked like, and repeat of parental advisory here, why that dog don't hunt. Right. So the normal procedure for a Roman wedding is first, the betrothal agreement is made with the bride's father."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6734.44,"end":6736.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Still. Still G rated."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6736.68,"end":6765.89,"speaker":"Fr Stephen De Young","text":"Yes. To. To establish. So that agreement is made, bride price paid. Right. All that. That agreement is made. Now, most weddings were done unless there was some major reason in the month of June, because the month of June, people still get married in June. At the modern day, June is the month dedicated to Juno, who is the Roman goddess associated with Hera."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6766.93,"end":6767.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6767.81,"end":6774.85,"speaker":"Fr Stephen De Young","text":"Who is the goddess of marriage among her other things."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6775.01,"end":6781.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, if you aim your wedding at June, the reason why there is this tradition is it's literally a pagan Roman tradition."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6782.31,"end":6798.71,"speaker":"Fr Stephen De Young","text":"Yes. We may have just stopped 100 Baptist weddings this June just by pointing that out. So other gods and goddesses involved in this."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6799.11,"end":6800.67,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, this is where it gets weird."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6800.67,"end":6804.71,"speaker":"Fr Stephen De Young","text":"Everybody carries. Will make a little appearance, but of course, Venus, who you might expect."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6805.58,"end":6807.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Okay. Venus. Venus, if you will."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6810.06,"end":6815.74,"speaker":"Fr Stephen De Young","text":"And then the God Hymen, who was never God of weddings."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6815.98,"end":6818.9,"speaker":"Fr Andrew Stephen Damick","text":"God named Hyman, everybody, who is the."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6818.9,"end":6824.22,"speaker":"Fr Stephen De Young","text":"God of weddings and who was specifically associated with the consummation of the wedding."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6824.54,"end":6825.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6826.94,"end":6833.2,"speaker":"Fr Stephen De Young","text":"By the way, this is your reminder. We have to throw these out once in a while. The Julian calendar is pagan."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6834.08,"end":6835.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes. We'll continue."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6835.84,"end":6872.45,"speaker":"Fr Stephen De Young","text":"Right, so now some more gods come into the picture because every Roman household. Right. We're talking about the big extended family household headed by the pater familias. Right. Had Larry's, who are not like Larry Sanders or Larry David, spelled a little differently, and Darrell's. Yes. And their other brother Darrells. No. So the larys are a term for the household gods."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6872.69,"end":6876.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So these are the local deities that you keep in your house that are."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6876.29,"end":6878.13,"speaker":"Fr Stephen De Young","text":"Right, well. And this would be an accumulation."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6879.01,"end":6879.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6879.65,"end":6928.06,"speaker":"Fr Stephen De Young","text":"Right. So it would be from the family's history, where the family was originally from, the gods of that place, the gods of the place where they currently live, Gods, particularly associated with events in the family's past and with particular family members, sort of would all be collected together and there would be images of them at the hearth. Yeah, right. Which was generally in the central to the Roman home. And that's where people would gather and that's where worship would take place within. Right. The Roman household of those idols. So these household gods, though, as we've mentioned before on the show about pagan gods, were kind of possessive. Right, right. So it wasn't just like, oh, these are the gods we worship. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6928.14,"end":6931.1,"speaker":"Fr Andrew Stephen Damick","text":"Like there's a reciprocal relationship, like, this."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6931.1,"end":6939.26,"speaker":"Fr Stephen De Young","text":"Is the denomination we belong to. This was. Right. These are our gods and we are their people. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6939.26,"end":6939.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6940.63,"end":6960.07,"speaker":"Fr Stephen De Young","text":"And so. Right. So this is sort of a pagan further thought down the line of the bride price. Right. You're not only depriving the human father of his daughter. Right. But you're taking a person away from these gods."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6961.19,"end":6963.67,"speaker":"Fr Andrew Stephen Damick","text":"Right. So you're going to have to figure out what to do."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6964.31,"end":6970.15,"speaker":"Fr Stephen De Young","text":"Yeah. And this person is then going to belong to the gods of this other pagan household."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6970.64,"end":6981.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So you got to do something to kind of make the gods you Know the bride's family's gods. Okay. With the transfer."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6981.44,"end":6989.28,"speaker":"Fr Stephen De Young","text":"And make no mistake, they firmly believed that these gods, who we would say are demons, would kill the person potentially."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6989.52,"end":6990.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6990.56,"end":6994.96,"speaker":"Fr Stephen De Young","text":"Or inflict sterility on them or any number of other horrible things."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6994.96,"end":6995.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":6997.05,"end":7017.25,"speaker":"Fr Stephen De Young","text":"Because they weren't. These gods weren't your pals. Right. So there were two elements to this. So first, leading up to the time of the wedding, they'd offer a series of sacrifices to those gods to kind of butter them up. Yeah, Right. Make sure they're in a good mood going into it. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7017.25,"end":7017.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7018.81,"end":7046.2,"speaker":"Fr Stephen De Young","text":"And then when the time came for the wedding at night, the bridegroom would come to the house and fake kidnap the wife, and the bride would kick and scream and yell about how she didn't want to go. The idea being that this would trick the household gods into thinking she's not leaving of her own free will."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7046.44,"end":7049.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Don't blame her. She's being stolen."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7049.2,"end":7054.99,"speaker":"Fr Stephen De Young","text":"Right, right. She's not leaving you guys on purpose. She's getting drug away kicking and screaming. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7055.47,"end":7056.11,"speaker":"Fr Andrew Stephen Damick","text":"Amazing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7056.43,"end":7066.11,"speaker":"Fr Stephen De Young","text":"So they wouldn't get mad. Okay. So now there would be a procession from the bride's house back to the groom's house."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7066.83,"end":7073.15,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is a kind of like a. I don't know, you know, it's a space between. Right, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7073.15,"end":7090.2,"speaker":"Fr Stephen De Young","text":"And so this was considered a dangerous time for the bride because she is now not under the protection and ownership of those gods and she is not yet part of the groom's household and those gods."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7090.44,"end":7090.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7090.84,"end":7092.76,"speaker":"Fr Stephen De Young","text":"And so she's in this no God's land."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7093.08,"end":7097.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. So she is literally what ancient people would call an atheist."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7098.04,"end":7103.64,"speaker":"Fr Stephen De Young","text":"Yes. She has no gods right now, which means she's totally open to spiritual attack during this."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7104.43,"end":7104.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7105.31,"end":7151.6,"speaker":"Fr Stephen De Young","text":"And so those in the procession would carry these horns that were filled with oil and used as torches that were dedicated to the God carries which were believed to protect her on the trip. And they would sing a series of hymns to the God Hymen called the Hymena. During this journey, when they got to the groom's house, there was a ceremony with oil being rubbed on the threshold, which was to sort of signify her now becoming part of the groom's household and coming under the protection of those pagan gods. And then there was a bed or a couch called a lectus on which the marriage would be consummated."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7153.44,"end":7153.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7153.8,"end":7155.44,"speaker":"Fr Stephen De Young","text":"That's how pagan Romans got married."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7155.76,"end":7158.96,"speaker":"Fr Andrew Stephen Damick","text":"So when people say that Christians were just doing Roman marriages."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7159.63,"end":7162.67,"speaker":"Fr Stephen De Young","text":"Right. Christians weren't doing that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7162.91,"end":7163.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7164.11,"end":7165.39,"speaker":"Fr Stephen De Young","text":"I guarantee you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7166.03,"end":7171.07,"speaker":"Fr Andrew Stephen Damick","text":"So many steps along the way. Completely not. Not okay for Christians."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7171.31,"end":7194.29,"speaker":"Fr Stephen De Young","text":"Not actual Christians. Right. So, you know, what were they doing? So the question is it really, you know, oh, they were just doing Roman weddings until all of a sudden the church decided it was a sacrament in a later century. This is basically an argument from silence. We're pretty sure they weren't doing this."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7194.77,"end":7196.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't know exactly what they."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7196.77,"end":7309.55,"speaker":"Fr Stephen De Young","text":"Were, but we don't know exactly what they were doing until that later point. Now, again, the central moment here where the wedding is, it's when it's consummated, which you're not going to do in a church. Right, Right. But we know, for example. Right. Not just a question. I mean, obviously, when Christians are a minority in the Roman Empire, a lot of them probably weren't even Roman citizens and stuff. Right. So Jewish Christians would have been doing Jewish weddings, for example. Right. And there was probably some form of something. Right. That was being done. But we know that, for example, you don't even have to wait for Theodosius to become Emperor Saint Constantine, and if it gives you heebie jeebies, be calling him Saint Constantine. Wait until we get to the episode about the coronation of an emperor in this sacrament series. You're gonna be really excited. So when St. Constantine converted, one of the biggest evidences of the reality of his conversion to Christianity is the fact that he ended all of the pagan sacrifices being done by the military and being done in public by himself or by his agents, and he replaced all of those sacrifices with Christian priests celebrating the Eucharist before going into battle, before, you know, in civil functions. This is during Constantine's lifetime. So it is reasonable to believe that he did not leave Roman marriage untouched."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7310.11,"end":7310.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7311.07,"end":7331.47,"speaker":"Fr Stephen De Young","text":"Right. Right. Now, of course, there were still pagans out there who are probably still doing pagan weddings. Right. But Christians. There's Begar's belief that Christians were having pagan weddings."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7331.63,"end":7356.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so then, I mean, again, we can kind of speculate a little bit about why they eventually do show up in church, why you do start getting church weddings, you know, and clearly the sense, at least from the wedding service that we have, is that the key moment is no longer the consummation, it's that God is joining these people together."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7356.84,"end":7365.8,"speaker":"Fr Stephen De Young","text":"Right, right. And it appears that in the earliest evidence we have that the Eucharist was involved."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7366.36,"end":7366.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7368.2,"end":7434.87,"speaker":"Fr Stephen De Young","text":"Which would explain it being in a church and fits with this idea of replacing other sacrificial pagan rites with the sacrifice of the Eucharist, getting rid of those and bringing in the Eucharist as a way that it transitioned to a church in between, I would imagine we would see the same thing that we see in the rest of Christian worship, which is that they were doing an adapted form of the Jewish traditional wedding, you know, with. With Christian elements. Right. Christian scripture readings and that kind of thing. So. But really, it's an argument from silence, but we can go from the patterns that we see in Christian worship elsewhere in the restructuring of Roman society to make a pretty solid guess. Right. Of at least roughly, what was going on. Right. And. And that's furthered when you look at, for example, how St. Paul approaches these things. So a central element of what St. Paul is doing in all of his epistles is he's trying to reconstruct gentile identity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7435.99,"end":7436.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7436.43,"end":7449.35,"speaker":"Fr Stephen De Young","text":"And what do I mean by that? Well, yeah, gentile identity from any given nation was deeply steep. You couldn't separate paganism out from it. Right, right. We have a modern secular concept of like, ethnicity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7450.36,"end":7451.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And religions."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7452.12,"end":7509.75,"speaker":"Fr Stephen De Young","text":"Right. And religions that are separate things that doesn't exist in the ancient world. So what it meant to be a Greek was not just to have, like, grown up in Hellas. Right. Or to have your people be from there for many generations. What it meant to be a Greek was also to worship the Greek gods. Right. And to participate in the ritual life of Greece that surrounded those gods, the public festivals. Right. All of those things. That's what it meant to be Greek. Right. So what does it mean to be a Greek Christian? Now, we take that for granted, but for St. Paul, that wasn't something you could take for granted. Right. And so you can understand why in the early Church, you get, like, the opponents of St. Paul and Galatians who are saying, well, okay, you can't be pagans anymore, so why don't you be Jews?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7510.63,"end":7511.03,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7511.27,"end":7515.19,"speaker":"Fr Stephen De Young","text":"Right. Because you can't be a Greek anymore. You have to have some culture. You have to be something."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7515.83,"end":7516.23,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7516.39,"end":7541.28,"speaker":"Fr Stephen De Young","text":"Right. So you need to get circumcised, you need to keep Torah, you need to do all these things. You need to be Jewish. Right. You can't be Greeks anymore because Greek being Greek is being a pagan. Right. And St. Paul is saying, no, you're not to become Jews because you're not Jews. You're going to remain Greeks. But what it means to be Greek is going to change."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7542.88,"end":7543.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7543.84,"end":7558.88,"speaker":"Fr Stephen De Young","text":"And so a Greek Christian identity is forged. And that takes a couple centuries. St. Paul starts it, but you read all the problems he's having, for example, in first and Second Corinthians that we already referred To. Right. Difficult process."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7559.51,"end":7582.47,"speaker":"Fr Andrew Stephen Damick","text":"And even while the concept and the way of life gets worked out, the terminology largely isn't kept even early on. By the time you get to the Cappadocians and so forth. Greek, in terms of something other than language, Greek is used to refer to pagans. And if you're Christian, you're a Roman."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7583.35,"end":7585.99,"speaker":"Fr Stephen De Young","text":"Right? Greeks are the ones still following that way of life."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7586.15,"end":7603.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, the word Greek in various ways gets revived again in the 1819th century for other reasons. But yeah, but yeah, that identification of Greek with pagan holds on a long time even while they're kind of developing a Greek Christian life, just calling it something different."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7604.29,"end":7679.81,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so St. Paul is going to affirm, right. So he's got those folks on the one side who want people to become Jewish. On the other side he's got like the Jewish zealot tradition, right. That wants to overthrow societal structures within. Within Roman life. Right. And St. Paul is going to want to keep those social structures. That's the part of the gentile identity that he can keep. Right. Sort of, you know, families. Right. Marriage in general. Right. We don't need to get rid of marriage in general. Right. All of these relations, all these structures we can keep, but they need to be re infused. Paganism needs to be drawn out. They need to be re infused with Christ. Right. And so that's part of this transformation. And as a kind of aside, when folks, one of many things I'm a pessimist about is there being an American Orthodox Church anytime soon. And the big reason is that we still have to do precisely this, not figure out what it means to be American and Christian."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7680.29,"end":7680.69,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7680.93,"end":7772.27,"speaker":"Fr Stephen De Young","text":"Because there's an American Christianity and the more American it gets, the less it looks like Christianity, frankly. But figuring out what it means to be American and Orthodox Christian, we can't just take for granted that that's just an easy sub. In fact, the fact that America is deeply steeped in another form of Christianity, in sort of Puritan, Calvinist, Protestant Christianity sometimes makes it harder for us to make the distinctions that we need to make in order to form an American Orthodox identity. You know, when, if, if America was, you know, a Muslim country or a Hindu country, right. When we looked at cultural institutions, it would be a little easier for us to spot in the Hinduism case, the paganism, in the Muslim case, the Islamic parts. But when it's another form of Christianity, the distinctions get more subtle and more tricky and that identity could be a little harder, little harder to form. How does this apply to Weddings. Well, any priests listening know how this applies to weddings? Because there is a constant tension of. This is the traditional Orthodox wedding service versus here's the couple getting married, and here are the American elements that they want to incorporate into that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7772.59,"end":7774.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is what we want for our wedding, Father."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7775.8,"end":7817.64,"speaker":"Fr Stephen De Young","text":"Right. And it's American stuff. It's the music that people have in American weddings. It's the, you know, all these things. And we're still doing that work of sifting out. I have no doubt that if there's an America 200 years from now. Not sure. But if there is, and Orthodoxy is still here on these shores and thriving, that there will be little things in the Orthodox wedding service that are a little different from an Orthodox wedding service in other countries that will have incorporated certain bits and pieces. Right. That have baptized American cultural things. Right. But actually doing that now on the ground is very. Gets very difficult."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7817.88,"end":7818.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7818.76,"end":7866.7,"speaker":"Fr Stephen De Young","text":"Right. In. In hashing those things out. So a couple of. A couple of major ideas. Right. I've talked several times on the show about how practices generate ideas, not vice versa. Right. The changes in practice regarding Christian marriage that happen for Gentile Christians. Right. This massive shift from the pagan concepts surrounding marriage and weddings to the Christian concepts surrounding marriage and weddings. Two major cultural shifts that come out of this. I'm not saying they're the only two, but these are two big ones."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7866.94,"end":7872.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And these are things I think, in some ways we take for granted on some levels."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7872.38,"end":7882.3,"speaker":"Fr Stephen De Young","text":"Yes. Now, that are new from this dynamic of gentiles becoming Christians. What? The first one is male virginity."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7883.42,"end":7888.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which in the ancient world, like, it was just not a thing."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7888.8,"end":7912.48,"speaker":"Fr Stephen De Young","text":"Yes. No concept. Right. So it's built into the Roman wedding service that the bride is expected to be a virgin. Right. And in most ancient cultures, her being found to not be one biologically. Right. Meant it was an invalid marriage."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7913.44,"end":7913.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7914.72,"end":7936.4,"speaker":"Fr Stephen De Young","text":"And she might face dire consequences. But the Romans, for example, expected that men were not right. Not just. There was no expectation that a man would not have already been sexually active, but it was expected he would have been considered a weirdo, not ready to be married yet."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7937.2,"end":7944.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting how that has kind of crept back into our culture."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7945.22,"end":7976.24,"speaker":"Fr Stephen De Young","text":"Yes. And so the idea of male virginity as any kind of value is completely new. But we can understand how that would come about, because if a bride has to be a virgin, and if a male, a husband is expected not to be, that means you're going to have to have a class of. Sorry to say it, but we're talking about ancient Rome Women and young boys who are being used for sexual gratification by men."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7977.2,"end":7980.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. They're just. Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":7980.48,"end":8001.05,"speaker":"Fr Stephen De Young","text":"Because they're not. They're not finding that sexual gratification with the woman they're going to marry because she has to be a virgin. So there have to be these other people who men are using sexually. Right. And so Christianity obviously opposes that whole system of men seeking sexual gratification."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8001.13,"end":8004.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the whole. The whole thing. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8004.89,"end":8045.67,"speaker":"Fr Stephen De Young","text":"And so comes and seeks to eliminate that class of people, not by doing something horrible to them, but by making it so that they don't have to do that. Right. And therefore the expectation is, since they're not going to be engaging in that activity, that the husband is also going to have maintained their virginity. So that's a major shift. That's a kind of apocalypse shift. The other epochal shift that people completely take for granted today especially."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8045.91,"end":8046.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8046.59,"end":8050.23,"speaker":"Fr Stephen De Young","text":"This one in particular is the idea of consent."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8051.03,"end":8054.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That especially that women can say no."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8055.51,"end":8079.98,"speaker":"Fr Stephen De Young","text":"Yes. That women have a right of consent to sexual activity. So in Roman. In Roman culture, and I won't get into this in terms of the language, but I'll just say this is reflected in classical Latin sexuality. A man gratifying himself sexually was considered kind of like blowing your nose."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8081.1,"end":8081.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8081.46,"end":8091.9,"speaker":"Fr Stephen De Young","text":"Just sort of a bodily going to the bathroom. You went and found a receptacle. Right. And. And it didn't really matter. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8091.9,"end":8094.46,"speaker":"Fr Andrew Stephen Damick","text":"There wasn't this deep spiritual meaning or."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8095.74,"end":8107.99,"speaker":"Fr Stephen De Young","text":"And willing, unwilling. Right. The concept of rape at that time was basically only involved other people's wives and daughters."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8108.23,"end":8110.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was kind of a property crime, so to speak."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8112.39,"end":8152.16,"speaker":"Fr Stephen De Young","text":"Whereas Christianity, because of the very beginnings of monasticism, comes and says women have the right to dedicate themselves to God and remain virgins and not get married. It was not get married at first. Right. And if you read the early martyrologies of women saints in the early church, a huge proportion of them end up getting killed because they refuse to marry the pagan their father is trying to marry them off to."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8152.65,"end":8157.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, one after another, like almost all the early female margins martyrs are."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8157.49,"end":8160.17,"speaker":"Fr Stephen De Young","text":"This way, often by their own father."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8160.65,"end":8162.21,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8162.21,"end":8175.21,"speaker":"Fr Stephen De Young","text":"Right. So Christianity says this woman has the right to refuse to get married. Right. And then that grows into. Right, obviously the idea of sexual consent."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8176.09,"end":8193.88,"speaker":"Fr Andrew Stephen Damick","text":"And. And, you know, and St. Paul mentions this, and I can't remember which one of his epistles off the top of my head now, but he talks about married people consenting with one another, you know, to set aside marital relations for."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8193.88,"end":8194.96,"speaker":"Fr Stephen De Young","text":"The purpose of prayer."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8194.96,"end":8203.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, well, that said, we're going to take our second and final break, and we'll be right back with the third half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8203.69,"end":8304.31,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO, new from Ancient Faith Publishing. Psalms of Salvation. The strength of Abba Moses. Freedom, power, strength. These he would gain, then lose. Released from slavery and no longer frightened by his master's whip, Moses uses his new freedom and great physical strength to rob and destroy. Consumed by his own desires and unable to escape the reminders of his past, Moses must learn of the true source of freedom and power. Meet St. Moses the Strong, also known as St. Moses the Black, as he surpasses his physical strength with spiritual discipline, obtaining the crown that thieves can neither harm nor steal. The strength of Abba Moses, a graphic novel by Gabriel Wilson is now a available@store.ancient faith.com. that's store.ancient faith.com. we're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8305.67,"end":8343.5,"speaker":"Fr Andrew Stephen Damick","text":"And that was a very terrible dramatic commercial. I don't think I'd heard that one before. It's cool. It's good. By the way, that graphic novel, my kids love it. Sands of Salvation, we got a pre release copy and they're super into it, so. Yeah. Yeah. Well, welcome back, everybody. It's the third half of the Lord of Spirits podcast. We're talking about the holy mystery of marriage in this particular episode. And we just finished up in the second half, we talked about weddings in particular, and we got to hear all about Roman weddings, among other things, which was pretty weird and exciting. But that's, that's, that's how we do."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8343.82,"end":8347.02,"speaker":"Fr Stephen De Young","text":"Words you never thought you'd hear on Ancient Faith Radio live."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8347.34,"end":8350.46,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But we did give a little parental advisory at the beginning."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8350.62,"end":8382.5,"speaker":"Fr Stephen De Young","text":"We warned you. You knew the job was dangerous when you took it, so you mentioned the mystery of matrimony. And so here in the third half, we're talking about the mystery. And so this is, we're talking about the mystery. This, this sort of does two things. On one hand, this is sort of the spiritual reality that undergirds everything we've talked about tonight."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8382.9,"end":8383.82,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8383.82,"end":8442.68,"speaker":"Fr Stephen De Young","text":"Right on the other hand, this also represents sort of the fulfillment of everything that begins with the creation of Adam and Eve and is tied to what we mentioned back at the very beginning of the sort of special relationship that marriage has with the original purpose. Right. For which. For which humanity was created. And so it uses the word mystery. Right. But a sort of key verse from St. Paul, when he's talking about marriage in Ephesians 5, he kind of says this very plainly. Right. He says in Ephesians 5,32, this mystery is profound. And I am saying that it refers to Christ in the church."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8443.32,"end":8443.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8443.64,"end":8446.12,"speaker":"Fr Stephen De Young","text":"And this is why the authority does just kind of smack you over the head with it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8446.12,"end":8447.4,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8447.4,"end":8449.08,"speaker":"Fr Stephen De Young","text":"Here's what I'm getting at. Right?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8449.08,"end":8455.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is part of the passage that's read one of the passages read at the wedding service in the Orthodox church."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8456.68,"end":8472.65,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. Most people miss this part because before this you get the verse where he says that wives should obey their husbands. And then everyone shifts nervously in their seats."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8473.05,"end":8474.97,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they don't hear anything else after that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8475.13,"end":8476.33,"speaker":"Fr Stephen De Young","text":"It gets really awkward."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8479.85,"end":8505.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then it says that the husbands loved your wives as Christ loved the church. I mean, this has always led me, like I have this little fantasy about it's got to be the right couple, but you know, going out to preach the wedding sermon and just making it a two word wedding sermon. You know, just turn to the bride and say submit and turn to the groom and say die. Always wanted to do that."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8505.94,"end":8535.64,"speaker":"Fr Stephen De Young","text":"Yeah. And that's. And you could probably get away with it just because nobody's listening to what you say in the wedding sermon anyway, staring at the couple, you know what I mean? Like, oh, I should try it. You know, I remember when there was type, so. But yeah, the irony there, of course, is that when St. Paul said it, the wives obey. Your husband's part was non controversial and they didn't have any choice."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8536.04,"end":8538.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8538.12,"end":8556.24,"speaker":"Fr Stephen De Young","text":"He was talking to them about how they should do it, not telling them to do it, they were forced to do it. He was just that like how whereas the original hearers would have found love your wife so much you're willing to die for her. Again, we talked about love. We talked about the wife of your youth. That would have been the crazy part."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8556.48,"end":8564,"speaker":"Fr Andrew Stephen Damick","text":"Crazy, radical, revolutionary. Submit to each other. Wait a minute, what? Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8567.36,"end":8616.9,"speaker":"Fr Stephen De Young","text":"But what St. Paul is doing here when he talks about how marriage is the mystery of Christ in the church is he's drawing, he's sort of tapping a vein, right? He's drawing on A tradition that runs through the Old Testament and then into the Gospels. Right. Of course, the Gospels are written after St. Paul wrote that, but obviously Christ said the things beforehand, so he's drawing on this and kind of bringing it together. So we're going to. Kind of. Most of the rest of this third half is going to be us sort of walking through that. Right. And there are, there are. In the Old Testament, there are obvious examples of this. Probably the most well known obvious one is actually the Song of Songs or the Song of Solomon."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8617.06,"end":8617.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8619.54,"end":8656.53,"speaker":"Fr Stephen De Young","text":"And you get the. Which. Which obviously is this fairly sensual and fairly graphic, depending on how bowlized your English version is. Sorry. About. About husband and wife. And you get these debates, right, because you'll read commentary, right, that this is God in Israel, this is Christ in the church. Especially in Russian commentaries and of course more modern commentaries are like, no, this is about sex. Right. Because everything is. If you're a modern person."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8659.41,"end":8662.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. And politics. And politics, yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8662.77,"end":8667.29,"speaker":"Fr Stephen De Young","text":"The answer to that though, really is porque no los dos, Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8667.29,"end":8669.57,"speaker":"Fr Andrew Stephen Damick","text":"It's about all those things, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8669.65,"end":8694.5,"speaker":"Fr Stephen De Young","text":"Because as St. Paul says, right. Marriage is the mystery of. Of Christ and the church. There's some imagery like this even earlier on, right. So the Lord your God, right, Yahweh, your God is a jealous God, right. That you're not going to have any other gods. That jealousy there is. That's husband imagery."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8694.74,"end":8735.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And here's my chance to do another. A little bit of lexicography. Jealousy. This is one of my little rants, actually. Jealousy is the feeling that you have when you think you're going to lose something that belongs to you. So it's appropriate for husbands and wives to be jealous of one another in that sense. Obviously, if it becomes an obsession, you have a problem. But envy is when you want something that is not yours. That's the difference between the two. I don't know why, but whatever. Jealousy has come to mean both things here in late modern, whatever English we're speaking. But yeah, so there you go, everybody."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8736.39,"end":8742.31,"speaker":"Fr Stephen De Young","text":"I don't know that I would say jealousy is appropriate. Well, I mean, it's the appropriate word to use."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8742.71,"end":8756.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes, it's. Right. It's not appropriate in the sense that you should. Like when God says he's a jealous God, it's not saying that God is sitting there freaking out that he's going to lose something that belongs to him."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8756.23,"end":8759.94,"speaker":"Fr Stephen De Young","text":"Right. It's a benefit to a jealous husband."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8759.94,"end":8766.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's saying that he. That you belong to him. That's really what's being said about it, you know, not anybody else."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8766.74,"end":8776.26,"speaker":"Fr Stephen De Young","text":"I'm just saying, as. As Jacques Lacan pointed out. Oh. Being jealous is pathological, even if your wife is actually cheating on you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8779.94,"end":8784.18,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Is this where you saying something nice about Jacques Lacan?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8785.58,"end":8792.06,"speaker":"Fr Stephen De Young","text":"Well, it's. The reason it's pathological is that your jealousy is not based on the fact that she is cheating on you, because she might not be."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8792.38,"end":8792.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8794.06,"end":8796.54,"speaker":"Fr Stephen De Young","text":"It's just. It's somewhere inside yourself."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8796.86,"end":8797.34,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8797.42,"end":8804.14,"speaker":"Fr Stephen De Young","text":"Right. That was your Lacanian moment for probably this decade. Most of us."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8804.14,"end":8805.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Thank God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8806.46,"end":8820.42,"speaker":"Fr Stephen De Young","text":"So. But this. This imagery of. Of the marriage between God and Israel becomes particularly pronounced, although not in a very positive way, in the prophets."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8821.14,"end":8823.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right, right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8826.18,"end":8835.22,"speaker":"Fr Stephen De Young","text":"And there are some really graphic passages in the prophets that use this imagery. I couldn't talk Father Andrew into reading any of them."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8836.26,"end":8855.86,"speaker":"Fr Andrew Stephen Damick","text":"Let's just say that Ezekiel chapter 16 uses the word whore or whoring or whorings 17 times. 17 times to refer to Israel's behavior with regards to God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8856.98,"end":8914.91,"speaker":"Fr Stephen De Young","text":"Right? Yes. And that's the general cast of these. Right. Is that it's Israel as the unfaithful spouse. Right? Right. And God is the faithful husband. And so you get. Like in Jeremiah 2. 2. Right. Yahweh says, I remember the devotion of your youth, your love as a bride, how you followed me in the wilderness, in a land not sown, Sort of like how things started. And then chapter three, you get how things are going. Right. And not good. And Ezekiel 16, as Father Andrew mentioned, the whole book of Hosea. Right. The prophet Hosea is commanded to go and marry a prostitute to sort of enact in front of the people. Right. This. This idea. Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8914.91,"end":8916.39,"speaker":"Fr Andrew Stephen Damick","text":"You got a feel for Hosea."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8917.27,"end":8968.96,"speaker":"Fr Stephen De Young","text":"Right. And so why. Why is this imagery particularly appropriate? Right. Of God as spouse to his people. Right. It's particularly appropriate because it's an image of theosis. This is the most intimate human union. And in this human union, the. The two become one flesh, the spirit. Right. Makes that alive, livens and permeates that it is not identical to theosis. Right. But this is a. One of the best possible images of theosis."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8969.36,"end":8992.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And I think it's. It's worth pointing out. So when St. Paul says in Ephesians 5, this is a great mystery, but I speak of Christ in the church. He's not saying that Christ and the church is like human marriage. He's saying that human marriage is like Christ and the church. Like, it goes the other way. The Christ and the church is the."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8992.3,"end":8997.02,"speaker":"Fr Stephen De Young","text":"Original, because that's what humanity Was created for."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8997.73,"end":8999.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":8999.09,"end":9047.34,"speaker":"Fr Stephen De Young","text":"Was theosis. And so this shows us then that with. With marriage being right, this. This connection to. To that mystery, this is giving us. Right. Human marriage is as a means of. Of theosis. But so because of this overarching idea, very often, and sometimes we. I think we underestimate how often and how much the work of Christ. Right. Like there is no. Here's what we need to do. This is how I will sell books at Lifeway."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9049.06,"end":9049.54,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9049.94,"end":9052.1,"speaker":"Fr Stephen De Young","text":"The marital theory of atonement."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9052.34,"end":9053.3,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there you go."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9054.1,"end":9060.02,"speaker":"Fr Stephen De Young","text":"There's gold in them thar hills. Anyway, do it under a pen name. Anyway."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9062.18,"end":9063.14,"speaker":"Fr Andrew Stephen Damick","text":"We'Ll know it's you."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9063.62,"end":9107.96,"speaker":"Fr Stephen De Young","text":"Yes. No, but the work of Christ in salvation is described in terms of a wedding, in terms of a marriage. Right, Right. In terms of a courtship, in terms of a consummation, in terms of the feast. This is one of the fundamental ways in which it is described. There is a little bit of Second Temple Jewish literature related to this, which may kind of be in your Bible, depending on who you are, because it's in 4th Ezra."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9110.36,"end":9110.76,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9114.68,"end":9324.5,"speaker":"Fr Stephen De Young","text":"4Th Ezra is in an appendix in the Slavonic Bible. Right. We won't go into it now, but, you know, I'll say, well, it's part of the Slavonic Old Testament canon. And sometimes people say, well, it's in an appendix. And then I say, well, what exactly does that mean? And they don't know. So but it's in there. If you have the Slavonic Bible, St. Jerome did translate it into Latin as second Esdras. It's not in the Roman Catholic canon, but it's floating around there in the Vulgate, probably in an appendix, but in it, Ezra has a series of prophetic visions. And one of these is the vision of the bridegroom. And there is hymnography of Pascha in the Orthodox church that is drawn directly from this, which is pretty. I'm pretty sure why it's in an appendix in the Slavonic Bible because of its connection to that hymnography. So in this vision of the bridegroom, the bridegroom comes to the threshold of the bridal chamber and then dies before he's able to consummate the marriage. And so then there's this great mourning and wailing. How horrible this is. Right. But then the bridegroom is discovered alive and the consummation happens and there's all this rejoicing. Now there's a lot of debate about when for Ezra was written. Exactly. Most folks would peg it as a Jewish, a non Christian Jewish text from the late first century ad. And so because of that, critical scholars who don't want to see, who either aren't treating it as scripture because it's not in their Old Testament canon, or because they're ruling out any kind of Christian seeming interpretation will argue that this is about the Temple, that the bridegroom dying on the threshold is the temple being destroyed in Jerusalem, and that the sort of resurrection of the bridegroom is expressing some confidence that in the future the temple will be rebuilt. And they'll argue that Ezra is sort of comparing that to. In Ezra's own day. Right. Ezra is one of the returning Judahites from exile, you know, rebuilding. Well, building the second Temple. Right. Building the, rebuilding the temple after it was destroyed by the Babylonians. So but we don't have to say they're wrong to take a kind of obvious Christian interpretation of this because of course, Christ said about himself, St. John emphasizes about himself, destroy this temple and I will rebuild it in three days. Right, right, yeah. So again, if the question is, is this about the death and resurrection of Christ or is this about the destruction and rebuilding of the temple, you could say Porchos."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9324.74,"end":9326.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9330.1,"end":9366.29,"speaker":"Fr Stephen De Young","text":"So just some places then, where this bridegroom imagery shows up. I mean, there's bunches of it, but just some significant ones. In Christ's statement that's recorded in Matthew 9:5, 9, 15, Mark 2:19 and 20, and Luke 5:34 and 35, he talks about how the friends of the bridegroom do not fast while the bridegroom is present. Right. While they're, you know, but then when the bridegroom is gone, then they fast. Matthew 25, 1:10 is the parable of the ten virgins. Right. Who are waiting for the bridegroom."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9366.93,"end":9368.85,"speaker":"Fr Andrew Stephen Damick","text":"Also prominent in Holy week."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9369.25,"end":9424.36,"speaker":"Fr Stephen De Young","text":"Yeah. John 3:29 refers to St. John talking about St. John the forerunner. Christ calls him the friend of the bridegroom. Right. Who rejoices at the bridegroom's voice. So we have all of that through Christ's ministry, this presentation of Christ as the bridegroom preparing for the wedding. Then very significantly, I know I've commented on this before on the show and even recently, when you get into the story of Christ's death, his crucifixion, in St. John's gospel in particular, he starts pulling in all of this vocabulary and imagery from Genesis."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9424.92,"end":9428.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is the Adam and his not rib."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9429.25,"end":9494.29,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. In John 19:31, 37, this is where. Right. The. This is great. And Holy Friday. Christ has been Crucified. The next day is the Sabbath. That Sabbath is a high day. Right. It's the Passover. And so they can't leave him hanging on the cross overnight. And so as they're getting close to sunset, the call goes out, hey, go and break their legs. So they'll die. Right. And then once they're dead, we can take them down before sunset. They come to Christ, and he is already dead. And so the soldier pierces his side with a spear, and blood and water flow from it. When it says his side is pierced, his side is open. The Greek word there for side is plevron, which is the same word used for Adam's side in the Septuagint."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9494.93,"end":9495.89,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9496.21,"end":9521.02,"speaker":"Fr Stephen De Young","text":"And remember, we're told that Adam goes into a deathlike sleep. Christ has died, his side is opened. Out of his side comes blood and water, which. Pick your church, Father. Any church, Father. Right. Will point out to you that water is related to baptism and blood is related to the Eucharist, which constitute the church."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9522.3,"end":9528.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the church then is likened to woman, to Eve coming from Adam's side."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9528.78,"end":9621.01,"speaker":"Fr Stephen De Young","text":"His bride emerges from his side. And then when we get to the end of the New Testament In Revelation 19, verses 6 through 9, we find that sort of the consummation of all things is the great wedding feast of the Lamb, the great wedding feast of Christ. So this. This isn't just an image that gets picked up a few times. This is, hey, far more than the Day of Atonement or my dissertation about the Day of Atonement. But this imagery is used more concerning Christ's life, death, resurrection and return in the New Testament than the Day of Atonement is by a lot. Passover beats this, but this beats Day of Atonement by a lot. So when we're talking about this as a mystery, when we're talking about mysteries in general, the idea of mystery is connected to the idea of participation. Right. You don't, like, look at a mystery. I know we're used to mystery, like glass onion or something. Right. Like, who done it? Right. Like you're trying to figure out. You're trying to solve the puzzle. Right. And come to an answer. Right. But that's not the way mystery is used here. That's not the way mystery was used religiously in the ancient world, where mystery is sort of like, oh, this is a weird, cryptic puzzle that I have to decode."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9621.41,"end":9629.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it's an initiation. It's a participation in something. It's touching divinity, you know?"}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9629.33,"end":9629.73,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9629.73,"end":9630.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9630.69,"end":9664.14,"speaker":"Fr Stephen De Young","text":"And so this is yet another reason. Right. We gave you the proof text in the second half. But this is the core reason why. And this really starts in Genesis and ends in Revelation. The core reason why marriage is a sacrament is that marriage is a participation in this larger reality of Christ's marriage with the church, this cosmic reality of Christ's work, and therefore is a means and a path of theosis, of becoming like God."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":9667.99,"end":10205.6,"speaker":"Fr Andrew Stephen Damick","text":"So to wrap up, I kind of joked a little bit earlier that this is not a marital counseling session. And it's not. But naturally, one might say then, well, then what's the point of any of this? What's the application? And I think that, I mean, I've been married myself now for almost 20 years. A little bit later this year be 20 years for me and my wife. And I think she would definitely tell you that I'm not an expert at marriage. And so I'm not going to say that I am. And I also am not a trained marriage counselor or anything like that. But I have talked to a lot of people about marriage, certainly in my work as a priest, and I've thought about marriage. And I've been married for a while, while. And one of the things that I've noticed is that it's really easy to get kind of lost in the weeds, to get lost in whatever the particular problem of the moment is, and then often to make that problem grow so big in our regard that it can destroy the marriage or damage it. And so the question is at least partly, well, how do you prevent that? Or how do you get out of that? And I think that the things that we've talked about are one of the ways of dealing with that. What do I mean by that? Well, if we have a vision for where we're going and what the whole purpose of all of it is, then you gain perspective, right? You gain perspective that whatever it is that you're fighting about is less important than the marriage and that the marriage is not an end to itself. This is a really important point. This is where we've kind of arrived at, at the end of this episode. But I just want to emphasize this. The marriage is not an end to itself. The marriage is a means for salvation, a means of theosis, a means of becoming one with God. And we've talked about what theos entails many times. But just to reiterate, the way that you participate in God, the way that you enter into the mysteries of the church, is by doing the works of God. You do the things that he does. And so then you're participating in his life and you become more and more like him. Well, marriage is the place that most of us do that not all of us, but the vast majority of us are called to do it in that way. It doesn't mean that those who aren't called that it's some kind of lesser call or broken. If you're not, you know, if this is not your call. No, but we're talking about marriage in this particular case, so this is what we're talking about. We are given our spouses so that we may serve them as Christ served the church, so that we can love them as Christ loved the church. In doing that, then we are participating in the life of God. That's what it is. And you can do that no matter how you feel. Having been married for almost 20 years, I can tell you that not every single day do I wake up and feel head over heels about my wife. And I'm sure she does, not about me. But we can still do the things for each other that are serving each other and sacrificing for one another. I was really struck, as I said, by that verse from Malachi, chapter two. I think it's verse 15. Yeah, Malachi 2:15, about a portion of the spirit coming into the union of the husband and the wife. And I alluded earlier to our episode on spirits, if you didn't listen to that one very briefly. What is a spirit? A spirit is a sort of ordering force. I don't know if that's the right word, but an influencing, sort of pulling of the reins, as it were. You know, an actual being that's doing that. And so affecting, you know, a spirit can affect. Like we each have our own spirits that. That control our bodies, that live within our bodies and move them. And there's an animating spirit of groups of people, right. And so what's being said here in Malachi 215 is that the animating spirit of a wedding, of a marriage that is done by God is the Holy Spirit himself. And so that's one of the reasons that we point to this being truly a sacrament, because that's one of the things that sacraments are, is the Holy Spirit animating people for a particular purpose, for a particular vocation. And so the part of the cure, or I should say the cure, Right. There's a lot of different ways that we get there. But the cure for a diseased marriage and the nourishment for a marriage that is just beginning and for a marriage that is continuing is to seek out the Holy Spirit to earnestly be faithful in the Christian life. And so if spouses are doing that, then the Holy Spirit is animating their marriage. That's what's going on. And that's a powerful thing that I think takes some of the. It sort of deflates whatever it is that's darkening our marriages, right? When we're animated by demonic forces, if we realize that and reorient ourselves and recommit ourselves to living a life of faithfulness in Christ, then we become animated in our marriages by the Holy Spirit. And knowing that that's what makes the marriage what it is takes some of the pressure off of, I have to make this perfect, you know, or are off of the idea. I have this. We have this fatal flaw. We're just not meant for each other or whatever it might be. You know, if both people are seeking to be faithful to the leading of the Holy Spirit by doing the things that we know we're supposed to be doing as Christians following the commandments, then the Holy Spirit is animating our marriages. Even if only one person is doing that, we know from what scripture says that that actually sanctifies the other person, that there is an effect on them as well, right? That one person in a marriage who lives a godly life is affecting the marriage, because that's how it works. And so with this very full vision of what marriage is and what it's for and how God brings it into being and maintains it and deepens and so forth, I hope that we can be inspired in our own marriages or inspired towards marriage if we're not yet married, or at least inspired to pray for those who are married, whether we are married or not, whether we're called to be married or not, so that we can become that image of Christ in his church, as St. Paul says in Ephesians chapter 5, so that our marriages become evangelistic, so that our marriages become salvific, not just for the two people in it, and not just for their children, although certainly for all of them, but for all those who connect to them. One of the things that's prayed in the marriage service in the Orthodox Church is that the couple would shine like stars. And if you've listened to this podcast, you know exactly what that means. If you haven't listened to any of our episodes where we talk about that, that means that they shine with an angelic light, that they are shining with the light of God that shines through them to the whole world. To the whole world, Father."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10208.97,"end":10771.63,"speaker":"Fr Stephen De Young","text":"So building off of what Father Andrew said about the Cure Disintegration is the best album ever. Also Friday Love. I've taken a pretty good shot at getting myself cancelled a couple times with this. Maybe third time will be the charm. Here I go criticizing the nuclear family again. So when in doing this episode about the sacrament of marriage. And I didn't bring this up during the episode because of course we're talking about what we're talking about, but when I did this episode, I was thinking a lot about all of the people who had listened to it, who might hear it differently than we wanted. What do I mean by that? There's a lot of people out there, and we've got a lot of listeners who aren't married. And that's not necessarily by direct choice. People who want to be married but haven't found someone where it works out. People who have been widowed, who experienced being one flesh with someone and now feel torn apart having lost that person. Any number of other people, people who've been through divorces, people who've been through other situations, and they often can be in orthodox discussions of marriage, get kind of left in this liminal space between marriage and monasticism because, you know, they're not at the moment in a marriage, but neither are they monastics. And not only them, but, you know, couples who haven't been able to have children can feel marginalized Orthodox Christian communities, because sometimes assumptions are made about them. And in all of these things, we've lost sight of what family really is and the relationship between marriage and family. Because what we've had sold to us as a family and marriage is the nuclear family, husband, wife, kits. This, we're told, is the building block of all society. So if you don't fit into that, you're destroying society somehow, or you're a problem for society. And the problem, as I've said before on the show, is that that idea of a family is just too small. One of the major tensions on marriages in this country now is, is the fact that people have been told that this one other human is supposed to fulfill all of their needs. This one other person is supposed to be able to satisfy them in all ways. And guess what? There is no human who can do that for any other human. It's never happened. And if that's what you're looking for in marriage, your marriage is going to fall apart and your life is going to fall apart. Not only that, but then you get on one side. As I mentioned, anybody who isn't able to fit into that mold, not by choice, is sort of left feeling like, well, I don't have that one other person. So now I will always be alone, isolated and empty. And so it is. It's a destructive pattern to even have in our minds. The reality is that family is really structured around the idea, or it was in the ancient world and for most of human history and still in a lot of places today, around a big extended family, a big household. A household. And in that household, there were any number of people. They're all related to each other, they're all family, but they all have different roles, and they all have different things they're doing as part of that household that make that household run and make that family work and help fulfill each other's needs and support each other, protect each other, defend each other. And what marriage was was a person being brought into a household, a person coming into a household, being made part of a family. This is something going back to Joseph and Asenath. This is something that has happened to everyone who becomes a Christian. Everyone who comes into the church is, in a sense, having a wedding with Christ. They are being brought into the church. As St. Paul says over and over again, we are brought into the household of God. We use the term brothers and sisters very loosely, but it was meant very seriously by the first Christians. When you read the Book of Acts, when it refers to Christians in the Christian community, they're just called the brethren, the siblings, the brothers and sisters in this place, the family in this place. And that was extreme in the Roman world, because in the Roman world, you had deep obligations, duties, responsibilities to your family members based on your role in the family. And they understood that Christians, when they called someone brother, when they called someone sister, when they said they were family, that they were extending those obligations to all of these people, accepting these obligations on themselves, for all of these people who were not related to them, for all of these people from all over with all different personalities, all different interests, right? They were now calling them family. That meant they'd be willing to fight, to protect them. It meant they were going to meet their needs, they were going to care for them, they were going to support them. And so I made a reference to this, at least obliquely, earlier in the episode. But what we're talking about, when we talk about the world of the church, in terms of parishes, monasteries are a different thing. We'll do an episode soon. You guys may think, hey, we're six episodes into this Sacrament series. They're almost done. We're not almost done. We're going to keep going for a while. We're going to talk about monasticism, and that's a different thing. But when we talk about the world of your parish churches, right, we're talking about the world of marriage because we're talking about the household of God that is in the world. So even if you're not a married person, you're still part of this household. The children of the church may not be your biological children, but you're their aunts and uncles, you're the grandparents. And it's only when we really realize what it means that all of us have been brought into the household of God and that each of our parishes is a family that will really understand what the church as a community is supposed to be. That includes the fact that every family has the crazy cousins, has the uncle with weird boomer political opinions that he won't shut up about, Right? As the rebellious teenagers, our church community will too, Right? But in a family, we still love those people, right? We may laugh a little at some of their quirks, right? But we love each other. And so there's a way of understanding marriage and the world of marriage and the world of family and the household of God that doesn't exclude anyone. It's the exact opposite. It includes them. It gives people who don't have a family a family. People who don't have friends, friends, people who are alienated from society, a society to be a part of. And with that comes roles and responsibilities to which they're called to be faithful. And in being faithful to them, that's how we all work out our salvation together. So those are my thoughts. Amen."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10772.67,"end":10793.5,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for today. Thank you very much, everyone, for listening. If you didn't give us a call live, we'd still like to hear from you. You can email us at Lord of sports spirits@ancientfaith.com send Father Stephen that rabbinic commentary on the Quran. You can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and join us for our."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10793.5,"end":10803.78,"speaker":"Fr Stephen De Young","text":"Live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. And if you love whole bean coffee, Rootless Coffee in Flint, Michigan has what you're looking for."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10804.1,"end":10813.23,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can like our page. You can join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend who's going to benefit from it."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10813.95,"end":10824.51,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. I recommend the Danhausen Blend, the Dark Roast, and the Twin Peaks Inspired Blend."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10825.55,"end":10827.87,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you all."}
{"episode_id":"LOS - #060 - 2023-01-26 - One Flesh","start":10847.72,"end":10884.85,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
