{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":0.56,"end":65.17,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":67.73,"end":156.05,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, everyone. Welcome back to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you are listening to us live, you can call in at 855 AF radio. That's 855-237-2346. And Matuska Trudy will be taking your calls tonight. Be nice to her. We will get your calls in the second part of today's show. So tonight our show is about Pentecost, but in what is now classic Lord of Spirits form. We have some groundwork to lay before we get to our full point, so be patient and you'll find that this pays off at the end. As with any of the major feasts of the church, there are multiple angles from which one can look at them. With Pentecost, we could discuss the feast as the reversal of the Tower of Babel, what it means for Christians to acquire the Holy Spirit, who the Holy Spirit himself is, the gift of speaking in foreign languages, and so on. But our starting point tonight is, as with so many things on this podcast, way back in Genesis, in the first chapter of Genesis, God takes the formless void world and makes the heavens and the earth and all the life that is in them. And then in Genesis chapter two, the narrative backs up to the beginning again and retells the story, but with a focus on a place called Eden. So, Father Stephen, what exactly is Eden?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":157.81,"end":161.85,"speaker":"Fr Stephen De Young","text":"Well, Eden is the place where God is, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":161.85,"end":167.01,"speaker":"Fr Andrew Stephen Damick","text":"You mean it's not like some dusty town in an archaeological dig in Iraq somewhere or."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":167.17,"end":182.54,"speaker":"Fr Stephen De Young","text":"No, nor is it at the bottom of the Persian Gulf. Nor is it in the last. The last History Channel documentary I watched where they were trying to track down where it was said there's this city in what's now Turkey built on top of it."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":182.7,"end":184.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there are some who say it's in Missouri."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":185.9,"end":188.14,"speaker":"Fr Stephen De Young","text":"Yes, there's that. Jackson County."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":188.46,"end":189.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yes. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":189.98,"end":190.38,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":190.54,"end":193.98,"speaker":"Fr Andrew Stephen Damick","text":"I've been there. It's. It's lovely. It's quite lovely."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":194.3,"end":197.74,"speaker":"Fr Stephen De Young","text":"And there are those who say it's been paved over and put in a parking lot."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":198.06,"end":201.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes, but. And There's. There's our first 80s music reference for the evening."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":203.26,"end":203.82,"speaker":"Fr Stephen De Young","text":"80S."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":205.1,"end":208.62,"speaker":"Fr Andrew Stephen Damick","text":"I don't remember. I don't know. Yeah, I'll have to look that up now, but."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":209.26,"end":210.18,"speaker":"Fr Stephen De Young","text":"Sad. Just."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":210.18,"end":210.62,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":210.62,"end":211.74,"speaker":"Fr Stephen De Young","text":"Anyway, okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":212.7,"end":213.7,"speaker":"Fr Andrew Stephen Damick","text":"Eden's where God is."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":213.7,"end":228.4,"speaker":"Fr Stephen De Young","text":"This is. This is. Right. And this is. This is what we're going to be tracing for folks today to. To tell you what we're going to tell you starting at the beginning of the world. And we're tracing the place where God is."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":228.96,"end":229.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":229.76,"end":238,"speaker":"Fr Stephen De Young","text":"Where he is at different points in time. And so this is going to be connected to ideas of sacred space and sacred place."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":238.56,"end":244.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is a good one. To have already listened to the entire podcast up to this point in order to get."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":244.96,"end":248.98,"speaker":"Fr Stephen De Young","text":"Yeah. Hit pause, go back and listen to 30 Hours of."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":250.01,"end":263.37,"speaker":"Fr Andrew Stephen Damick","text":"You'll be fine. Yeah. I mean, you should still be able to follow it, but it'll be much richer if you've listened to the sacred geography episodes. If you listen to the body episodes. Yeah, yeah. But anyway, right, so here we are."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":264.09,"end":268.49,"speaker":"Fr Stephen De Young","text":"The place where God is, is also, of course, the place where you would go to meet God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":269.13,"end":269.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":269.85,"end":279.86,"speaker":"Fr Stephen De Young","text":"So you can. You can meet a Christian in Christian sands, you can meet the devil in Helsinki. But if you want to meet God, you have to go to certain places."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":280.82,"end":294.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the point being made by this is not that there's places where God isn't. Right. But rather, again, this is about human experience. Right. Where you meet God, as you said."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":294.34,"end":327.23,"speaker":"Fr Stephen De Young","text":"Right. This is about where the presence of God intrudes into the time and space that only exist as part of human experience. Right, right, right. So. And that's while. Yes, we as all Christians have historically affirmed that God is everywhere within creation. Right. It always has been. It's also very clear, just on a surface reading of the Bible, that there are places where he really, really is."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":328.37,"end":331.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":331.33,"end":374.78,"speaker":"Fr Stephen De Young","text":"And so it's that. That really, really is that we're going to be focusing on tonight. So the first of those places is paradise, which this is A little bit of review, because we've talked about this before, but paradise, of course, the word comes from a walled garden. It's a Persian loan word. Right. So it is this space that is walled off, sectioned off within the cosmos that has been created. And it is not the entire earth at the time of creation. Right. Because even though when it is planted in Genesis chapter two, God doesn't tell us east of where, he tells us."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":374.86,"end":376.14,"speaker":"Fr Andrew Stephen Damick","text":"That in the east."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":376.22,"end":384.88,"speaker":"Fr Stephen De Young","text":"Plants a garden in the east, which means it has a location. It means there is plenty of cosmos. That is not Eden at that point yet."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":385.28,"end":386.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's limited."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":387.36,"end":404.08,"speaker":"Fr Stephen De Young","text":"And when he creates Adam in Genesis 2, he creates him from the dust of the earth and then places him in Eden, meaning that that earth dirt that he's made out of came from somewhere outside."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":404.24,"end":404.96,"speaker":"Fr Andrew Stephen Damick","text":"Came from outside."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":405.78,"end":457.39,"speaker":"Fr Stephen De Young","text":"And that wall represents this. That there's this separation. Of course, we talked about how the intent was that Adam and Eve, as they came to maturity, or that time, Adam and woman, as they came to maturity, would then leave the garden and take Eden, take the presence of God with them, and would. Would participate in. Take part in. Be given the grace by God to participate in turning the whole cosmos into Eden, to filling the whole cosmos with God's presence. Of course, we also know from Genesis chapter three that that is not what happened. Right, right. And so at that point, humanity was expelled from the presence of God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":458.19,"end":512.79,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. And like most icons of this, you see them, you know, walking out of Eden, kind of looking over their shoulder, and there's, you know, a cherub there with his flaming sword. And some. You get Adam sitting down and weeping over what he's lost. But the main point is, as you said, that they're expelled from the presence of God. Whether that sort of literally means that they walk through, you know, a hole in the wall, in the walls, and, you know, like, it's not necessarily that way. The point is that they're not with God anymore in the way that they were before. We don't know if that entailed actually leaving a place the way we would think of it now. But. But that's. That's the way that iconography, iconographically, it's depicted, which is. And. And it's the way it's described in Scripture. So that's what we've got."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":512.79,"end":516.32,"speaker":"Fr Stephen De Young","text":"Right, right. And often iconography will even depict the wall."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":516.72,"end":518,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":519.12,"end":545.37,"speaker":"Fr Stephen De Young","text":"And so that wall, that barrier, rather than becoming a place that distinguishes the holy place from the rest of creation, it becomes a barrier between humanity and the presence of God. And this is often, as so many things are in the west, looked at as sort of a punishment."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":546.01,"end":547.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":547.13,"end":562.73,"speaker":"Fr Stephen De Young","text":"You, You. This was this nice place. This was this wonderful place, this blissful place, being in the presence of God. And now you've got to go out there into the crummy world because you were bad. Right, right. I'm sending you away because. Because you have offended me."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":563.53,"end":603.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. But that's not what it's about. Instead, it's as we've talked about on this podcast before, when, you know, when mankind is created, he's created immortal, created to be immortal and sustained as being immortal by God. But the problem is then, if an immortal being sins, he's crystallized in his rebellion against God. And so what happens is that God gives them mortality so that they would have the opportunity to repent, because you need mortality in order to be changeable in that particular way. And so actually being sent out is a mercy."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":604.71,"end":614.07,"speaker":"Fr Stephen De Young","text":"Right. It's. It's not, as God said, it's not good for man to live forever in this. In this state. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":614.07,"end":616.71,"speaker":"Fr Andrew Stephen Damick","text":"In the state crystallized sin. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":616.71,"end":618.87,"speaker":"Fr Stephen De Young","text":"Because then he would have been just like the Devil."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":619.99,"end":620.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":620.31,"end":672.62,"speaker":"Fr Stephen De Young","text":"Who also fell in Genesis 3. And that would also mean that the devil would have succeeded. Yeah, Right. Because that was the devil's goal. Right. The devil's goal was to destroy humanity, to make humanity like himself. That's always been his goal. That's still his goal is to make human persons like himself. So, yes, God prevents that victory by expelling humanity from his presence. And this dynamic that happens here in Genesis 3, we're going to see stretches all the way through the Scriptures. This idea that while humanity is sinful and while we're bearing in our bodies and our souls, our lives, the effects of our sin, it is dangerous for us to come into the presence of God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":673.18,"end":724.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this plays itself out in. Well, we're going to talk about a bunch of the ways that it does. But like, one immediate way, for instance, is where St. Paul talks about an unrepentant person in the Corinthian Church that has to be cast out until such time as they repent, because it's dangerous for them to be there. It's dangerous for that person to be within the presence of the church and receiving the holy mysteries while they're living an unrepentant life. And, I mean, this is also the basis for a lot of our eucharistic discipline. You know, when someone's not ready to receive the Eucharist because of some grave sin, they need to be purified before they're ready to. Because again, as St. Paul says, those who receive it in that way, some get sick and some die. You know, he says that it's dangerous, it's dangerous to be in the presence of God when you're not purified."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":726.32,"end":740.14,"speaker":"Fr Stephen De Young","text":"Right. And so just as in paradise, man had to be prevented from eating of the tree of life, so St. Paul has to prevent unrepentant people from trying to eat of the tree of life."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":741.26,"end":742.54,"speaker":"Fr Andrew Stephen Damick","text":"Because it would be bad for them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":742.54,"end":764.79,"speaker":"Fr Stephen De Young","text":"Suffering. Yes. And suffering. That faith. That faith. So this is an act of love by God, both to protect them from his holiness and to give them then the opportunity to potentially eventually come back."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":765.11,"end":765.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":766.15,"end":779.75,"speaker":"Fr Stephen De Young","text":"And so what then unfolds as we, as we move on in Genesis, what unfolds in Genesis 4 through 6 is we see what can happen in the worst case scenario."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":780.24,"end":781.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":781.48,"end":796.48,"speaker":"Fr Stephen De Young","text":"Where, where God is still very present in the earth with humanity and humanity is becoming more, starting with Cain is becoming more and more wicked and more and more corrupt, and it's being more and more dominated by sin."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":796.88,"end":797.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":797.24,"end":804.48,"speaker":"Fr Stephen De Young","text":"By, by the powers of death, by the powers of darkness. And that's building up and building up and building up."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":804.72,"end":806.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right in his face."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":806.95,"end":807.67,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":810.31,"end":834.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. And so this concept, and we're going to mention this a bunch of times, but this is an important concept. This is called death by holiness. And it's basically that if you are in the presence of God and not prepared to be, it's going to be really bad for you. Not because he's like mad or anything like that. It's just this is death by holiness. And we see it a bunch of times in scripture. So. And we're going to talk about it a number of those times."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":835.17,"end":855.49,"speaker":"Fr Stephen De Young","text":"Right. And, and the God's holiness is over and over again compared to fire. Yeah, Right. And in your, in your best case scenario of coming into the presence of God. Right. It's like putting iron into the fire and all the impurities are burned away."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":856.21,"end":857.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":857.57,"end":875.12,"speaker":"Fr Stephen De Young","text":"The, the iron is purified. That's your best case scenario. In the worst case scenario, the whole thing gets burned and melted away. Right. And so Isaiah, when the flaming coal is brought to his lips to purify them, that's not a pleasant experience. Don't try this at home."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":875.52,"end":875.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":878.08,"end":900.36,"speaker":"Fr Stephen De Young","text":"Burning coal pressed to your lips. Right. But that purifies him. Right. And so. Right. And this is, this is because of, of God's holiness and because of who he Is this is not that he likes going around, you know, torching people."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":901.48,"end":921.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this explains why then that cherub is put at the gate of the garden with a flaming sword. It's not to protect the garden from man defiling it. It's protective human beings from entering in a place that would destroy them. That's what it's doing there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":921.49,"end":942.44,"speaker":"Fr Stephen De Young","text":"Right. Because it would be. It would be better. Right. Remember, he's been. The. The. The cherub is there to keep them from the tree of life. It's better for them to die physically than to eat from the tree of life and be immortally dead spiritually."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":942.84,"end":943.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":944.44,"end":964.44,"speaker":"Fr Stephen De Young","text":"Right. So it's. It's to stop them from something worse. So as we see this evil and wickedness and sin and demonic activity and corruption build up in. In Genesis 4 through 6. This sort of culminates, as we've said before, most famously, famously, in the giants episode, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":964.52,"end":964.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":964.92,"end":983.71,"speaker":"Fr Stephen De Young","text":"This sort of culminates in. In Genesis 6, verses 1 through 4. And of Genesis 6, verses 1 through 4, verse 3 is sort of the poor ignored cousin Oliver of the whole situation that nobody ever talks about because everybody gets excited about the giants."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":983.87,"end":985.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. People do."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":986.19,"end":988.99,"speaker":"Fr Stephen De Young","text":"Which are in verses 1, 2, and 4, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":990.51,"end":1017.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So verse 3 says. So the Lord said. So this is right after the description of the giants coming around. So the Lord said, my spirit will not. And then some translation says, remain in others it says, contend with. So my spirit will not remain in. Or my spirit will not contend with humankind indefinitely. Since they are mortal, they will remain for 120 more years. That's what that verse says."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1018.1,"end":1018.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1018.66,"end":1020.18,"speaker":"Fr Andrew Stephen Damick","text":"So what's going on in that verse?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1020.66,"end":1090.28,"speaker":"Fr Stephen De Young","text":"Right? So God's spirit, the Holy Spirit, right. Is in the whole cosmos, right? He's everywhere present and filling all things. And that means that all of this sin and wickedness that's happening, building up to, up to and including what the giants are up to, is happening in God's presence. Right? And so there's this. This Hebrew verb that's used that is, can mean either abide in or remain in, or contend with. It could have a positive or negative connotation, depending on context. And I would suggest this happens very often with Hebrew, especially in Hebrew poetry, but in Hebrew in general. And you even get some of the New Testament writers, because they're thinking with a Hebrew, Aramaic brain doing this in the. In the New Testament, where they will deliberately use a word that could be taken in multiple senses and use it to kind of mean both. Right? It's porque no los dos. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1090.28,"end":1093.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. It's pun fully intended."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1095.28,"end":1129.5,"speaker":"Fr Stephen De Young","text":"Right. Remain. Remain in. Right meaning remain here in humankind, in the cosmos. Right. My spirit cannot long remain there. And part of the reason for that is my spirit being there is having to contend with. Right. It's a struggle. It's a battle. Right, Right. And now you notice he. He doesn't say here that he is going to depart."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1131.34,"end":1131.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1132.39,"end":1132.75,"speaker":"Fr Stephen De Young","text":"That's."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1132.75,"end":1134.55,"speaker":"Fr Andrew Stephen Damick","text":"That's. That's not this part."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1134.87,"end":1139.91,"speaker":"Fr Stephen De Young","text":"Right. He says. He says that the humans are going to depart."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1140.47,"end":1143.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're going to remain for 120more years and then."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1145.43,"end":1160.58,"speaker":"Fr Stephen De Young","text":"Right. So bad things are good. And so this is what produces the flood. The flood happens because God's presence remains in the world, and their wickedness doesn't."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1160.58,"end":1163.46,"speaker":"Fr Andrew Stephen Damick","text":"Stop death by holiness."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1163.7,"end":1181.7,"speaker":"Fr Stephen De Young","text":"And so life on earth, minus Noah and his family. Right. And the life of the ark of salvation is. Is wiped out because it is in. It is in God's presence and is wicked."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1182.02,"end":1194.25,"speaker":"Fr Andrew Stephen Damick","text":"I feel like in the back of my head there is like an Avengers Infinity War joke just percolating up somehow, you know, about destroying all life and it being inevitable and so forth."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1194.25,"end":1196.89,"speaker":"Fr Stephen De Young","text":"But it's just not more than 50%, though."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1196.89,"end":1203.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes, a little bit more than 50%. 99.999. Well, that's because Thanos isn't God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1203.29,"end":1204.93,"speaker":"Fr Stephen De Young","text":"Right. You just can't do that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1204.93,"end":1205.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1205.29,"end":1210.17,"speaker":"Fr Stephen De Young","text":"And the reason it's water. We've talked before the sea. Right. Yom. This is. This is chaos."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1210.33,"end":1211.53,"speaker":"Fr Andrew Stephen Damick","text":"Chaos. Yeah, the forces."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1211.85,"end":1228.8,"speaker":"Fr Stephen De Young","text":"So what God essentially does, the way the flood actually happens and the way it's described, it talks about the water coming up out of the ground and the water coming down out of the sky. Right. Which is reversing the second and third days of creation."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1229.2,"end":1229.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1230,"end":1248.11,"speaker":"Fr Stephen De Young","text":"Right. So God just stops restraining. He stops protecting humanity from the chaos and evil that he's unleashing in the world. This is how punishment works in the Bible."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1248.91,"end":1254.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's patience. Patience. God has patience for a while, and then it's like, okay, time's up."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1255.15,"end":1264.27,"speaker":"Fr Stephen De Young","text":"Right. When God punishes people, he's not actively torturing them or inflicting pain and suffering on them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1264.76,"end":1264.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1264.92,"end":1269.64,"speaker":"Fr Stephen De Young","text":"The way punishment works in the scriptures is God just stops protecting people."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1270.92,"end":1271.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1271.56,"end":1287.4,"speaker":"Fr Stephen De Young","text":"From their actions and from what they're doing and lets them suffer the consequences. Right, right. And so this is what happens here. He lets chaos come back and consume the cosmos and then he recreates again."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1288.84,"end":1289.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1289.64,"end":1291.63,"speaker":"Fr Stephen De Young","text":"Takes it back to Tohua Bohu."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1291.86,"end":1292.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1292.26,"end":1292.66,"speaker":"Fr Stephen De Young","text":"Then."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1292.66,"end":1295.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's the formless. Formless and Void."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1295.42,"end":1318.84,"speaker":"Fr Stephen De Young","text":"Right, right. Right. From Genesis, Genesis 1:2. And so then after, afterwards, we have this symbol of the rainbow, right? Which is not, as some folks might think. It's not like God tied this beautiful, shiny, colorful bow around the Earth, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1319.64,"end":1324.6,"speaker":"Fr Andrew Stephen Damick","text":"No, yeah, it's bow, like the weapon, like with arrows. Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1324.6,"end":1375.17,"speaker":"Fr Stephen De Young","text":"Bow like bow and arrows. And God sets it down, right? Says he places it in the clouds, he sets it down. Which is in the ancient near east, right? When someone's going to war, they're depicted iconographically, right, as holding a bow. Pharaoh's holding a bow. The king of Assyria is holding a bow, right? So God, setting his bow down, says, okay, I'm not gonna go to war with humanity anymore. Right. And you will know that this promise is true because you'll be able to look up at the sky and see my bow still sitting there, that I haven't picked it up again. Right. And so he's saying when he says he's not going to destroy the world again, right. He's saying, I'm not going to allow humanity to get to the point where it."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1375.25,"end":1375.65,"speaker":"Fr Andrew Stephen Damick","text":"It."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1375.89,"end":1391.81,"speaker":"Fr Stephen De Young","text":"They destroy themselves by being in my presence. And so that's why we see in Genesis 10 and 11, we see something at the same time very similar, but and very different unfold."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1392.13,"end":1423.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, and it doesn't take long, right, for things to start to go bad again. You know, Noah sets down and they start rebuilding, but there's wickedness within. I mean, we don't need to go into it, but there's wickedness within the house of Noah not too long after, you know, after all of this. And then eventually you get the 70 nations that are all descended from Noah, and they start doing bad things again, especially one particular construction project."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1423.76,"end":1467.83,"speaker":"Fr Stephen De Young","text":"Right, right, right, right. And there's some build up to that in the genealogies in Genesis 10, which, again, for some reason, not people's favorite part of Genesis, the genealogies. But there's this fella who shows up in the genealogies. There's a couple important things in those genealogies. Actually, I think we already referenced in a previous episode the prophecy that Noah's father, Lamech makes about Noah, which is really important. Framing the flood or that's actually the previous. That's before the flood. Sorry. In this. In this, at the table of nations in Genesis 10, that's laying out the 70 nations and how they're all descended, we run into this fella, Nimrod, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1468.23,"end":1476.59,"speaker":"Fr Andrew Stephen Damick","text":"Which is not just a way of referring to. It's not just an insulting thing to call somebody. It's an actual, actual person or, or."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1476.59,"end":1483.83,"speaker":"Fr Stephen De Young","text":"A super popular pendant from the 70s to have hanging amidst your chest hair. You can look that up if you call it back then."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1488.47,"end":1500.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So who is Nimrod? This actually came up in the Lord of Spirits Facebook group the other day. You know, asking, is Nimrod a giant? Because of the way he's described as being this mighty hunter before the Lord. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1502.16,"end":1502.48,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1503.2,"end":1504.32,"speaker":"Fr Andrew Stephen Damick","text":"Dun, dun, dun."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1506.96,"end":1518,"speaker":"Fr Stephen De Young","text":"So Nimrod is indeed. Nimrod is the. He's serving the purpose in the narrative of being the founder of Babylon."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1520.56,"end":1521.2,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1521.52,"end":1526.4,"speaker":"Fr Stephen De Young","text":"Now, there was actually another Assyrian city named after him, Nimrud."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1527.04,"end":1527.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1528.26,"end":1561.25,"speaker":"Fr Stephen De Young","text":"Which was. Which was the military center of the Assyrian empire much later, centuries later. But this is all part of Akad. This is all part of the northern part there. But the reason they're named after him is not that. Oh, hey, you remember that hunter guy in the Bible in the genealogy. Right. The reason for that is that Nimrod, or Nimrod is the. Lexically, it's the same name as the God Ninurta."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1562.13,"end":1568.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So who's that? I think a lot of us probably have never, never heard of Ninurta."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1569.41,"end":1576.45,"speaker":"Fr Stephen De Young","text":"Well, haven't you been reading your tablets from the library of Assur Banipal II?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1576.45,"end":1582.21,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, there's still 90% of them have not been translated yet, so I haven't gotten to those."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1583.17,"end":1601.89,"speaker":"Fr Stephen De Young","text":"Well, that's why people need to get to it. Come on, you're sleeping on these tablets. Ninurta is one of the primary gods of the pantheon and was one of the main gods of the original Babylonian empire."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1602.05,"end":1610.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Associated with farming, healing, hunting, law, scribes and war. So it's kind of a nice portfolio there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1610.61,"end":1654.72,"speaker":"Fr Stephen De Young","text":"Right. Because he was essentially, for a period of time, serving the function of most high God. Yeah. So if you're someone who has that role, even for a little while, you tend to take on a big package. Right, right, right. And now this is the original Babylonian empire. We, we have a bad gauge in our heads a lot of time of how old things are in the ancient Near East. So when we think of Babylon, because of the Old Testament, we may think of like, Nebuchadnezzar. Right, right. Or maybe his dad, Nabopolassar. That's the Neo Babylonian empire. That's the new one in the sixth and seventh centuries bc. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1655.92,"end":1658.04,"speaker":"Fr Andrew Stephen Damick","text":"This is what, a couple thousand years."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1658.04,"end":1674.58,"speaker":"Fr Stephen De Young","text":"Before that, the original one? Yeah. We're talking about like 2500 B.C. and a few centuries before and after so we're talking about like Hammurabi, we're talking about the Martu, who are the biblical Amorites. Right. Who we already talked about in the giants episode a little bit."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1674.74,"end":1675.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1675.14,"end":1764.73,"speaker":"Fr Stephen De Young","text":"So this is one of the gods of Babel of Babylon at that time. Right, at that time. And so what the, the text is doing in Genesis 10 is it's tying this to this particular Nephilim fellow, right. Who is the city founder figure who becomes the God Ninurta. He ends up. His spirit ends up being worshipped by the Babylonians. That's what's going on here. And it's part of Genesis showing us that. That the whole Nephilim thing is even starting to happen again. Yeah, right. Just like in the genealogy of Cain that we had before the flood. Now we've got this genealogy of the nations and. Oh, lookie, right. The whole Nephilim thing is happening again. And then we. This culminates with the Tower of Babel. We talked before about how the Babylonian Babili means the gate of God, the gate of the gods, and how this temple, this ziggurat that's being built was looked at and how they were trying to draw Yahweh, the most high God, down and, and sort of make him serve their purposes in their Z. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1764.73,"end":1799.5,"speaker":"Fr Andrew Stephen Damick","text":"It'S, it's, you know, being a gate, right? It's, it's essentially rather like trying to break into Eden. Right. You know, we'll make our own paradisaical garden on our own paradisaical mountain, and we're going to make God come down here and, and be with us and do what we want. Right. Which is, you know, that's not the way that God set things up in Eden. You know, it's, it's a, it's, it's a violent sort of aggressive technological, you know, kind of approach to relationship with God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1800.45,"end":1813.25,"speaker":"Fr Stephen De Young","text":"Right. And it's based on this in Genesis, that every future empire that's talked about in the scriptures all the way up through and including Rome is described in terms of Babylon."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1814.05,"end":1817.01,"speaker":"Fr Andrew Stephen Damick","text":"It's the prototypical bad civilization."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1817.33,"end":1838.59,"speaker":"Fr Stephen De Young","text":"Right. Starting with the city that Cain founded. Right. This is continuing that streak and that's going to continue all the way up into, into Rome. But so if the same thing is unfolding again, God has promised that he's not going to wipe everybody out again."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1839.07,"end":1840.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1841.31,"end":1885.18,"speaker":"Fr Stephen De Young","text":"And so all the people in the world are all gathered around the ziggurat. God is trying to calm down. He said he's not going to destroy them all again. So then what is the other option? The other option is for God to remove himself, to leave. Right, for God to leave. And so this is why, again, it is out of mercy. This is why God steps back at Babel. And as we read about more In Deuteronomy, chapter 32, why, when he steps back, he assigns the 70 nations of Genesis 10 to the sons of God, to angelic beings. Right. So there's this buffer between him and them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1885.9,"end":1887.66,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, so."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1887.9,"end":1889.42,"speaker":"Fr Stephen De Young","text":"So that they won't perish."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1890.22,"end":1920.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's, you know, it's fascinating how much of the action of what goes on in Scripture, and we're going to see this more and more as we talk, but it's fascinating to me how much of the action of what goes on in scripture is really about this very basic dynamic of dealing with the problem of death by holiness, you know, of people not being ready to be in the presence of God. And so then the things that happen as a result of that, you know, it's fascinating how this is kind of a unifying principle for so much of what's going on in Scripture."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1921.8,"end":1932.44,"speaker":"Fr Stephen De Young","text":"Yeah. And part of the reason we miss it so often is that in our contemporary world, we've almost completely lost the idea of sacred space."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1933.08,"end":1987.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right. You know, in fact, even. Even amongst Christians are like, well, isn't every place sacred? You know, which, which what that does is like, so. So that's correct. Although, you know, spoiler alert, that we'll talk about that later. But. But what it effectively does is it makes it so that nothing is. No place is sacred. Or just like, for instance, those who, who object to having holy days in the church calendar, like, well, every day should be like, it's Christmas. Well, when every day is Christmas, then no day is Christmas. Like you tell someone, every day should be like your birthday. Right. Well, then no day's your birthday. That's what tends to happen is this our sense of egalitarianism flattens everything out. Like that's in the intro to our show, is that secularism, materialism, makes everything flat. And, you know, this is part of what's going on."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1987.47,"end":1996.67,"speaker":"Fr Stephen De Young","text":"Right. It doesn't. It doesn't take what's lowly and broken and lift it up. No, it takes what is high and lifted up and pulls it down."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1997.07,"end":1997.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":1998.03,"end":2002.83,"speaker":"Fr Stephen De Young","text":"Right. And that's why iconoclasm is such a perfect instance of it."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2003.31,"end":2003.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2005.39,"end":2012.05,"speaker":"Fr Stephen De Young","text":"Is that it's pulling down and destroying. Right. Something that is otherwise beautiful and uplifting. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2012.05,"end":2040.46,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so now we've got. God has withdrawn himself from the nations and assigned angels to them to govern them by proxy. And you know, what happens with them later is. Well, we've talked about that before, but there's still this problem then of God's sort of active presence in the world being withdrawn and he's not going to just leave it that way. Right. Just let us be distant."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2041.42,"end":2041.82,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2041.82,"end":2042.86,"speaker":"Fr Andrew Stephen Damick","text":"Something's got to change."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2043.34,"end":2077.83,"speaker":"Fr Stephen De Young","text":"Right. Because the goal was. Right. Remember, the goal of the expulsion for paradise was so that there could be repentance, so that they wouldn't end up eternally condemned. And so the goal of withdrawing here again is so that the people won't perish because God doesn't want them to perish. Right. So what we get then in Genesis 12, beginning with Abraham, and there's a monster time lapse here, but what you get with Abraham in Genesis 12 is the beginning of salvation."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2078.23,"end":2095.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. And Abraham is living in the midst of Ur, probably around the time that they're building a big ziggurat. Right, Right. You know that he would have looked up and seen this thing and lived in its shadow."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2095.85,"end":2176.36,"speaker":"Fr Stephen De Young","text":"Yes. And that's, that's where the memory of that. That he was there in the ur3 period when the great ziggurat of Ur was being built. The memory of that is why you sometimes find in. Especially in Targumic traditions from later Israel, there are these things connecting Abraham to the building of the Tower of Babel, even though that. The text clearly doesn't do that. But there was this preserved oral memory of the building of a ziggurat in Abraham's lifetime. And those two things kind of got blended together due to their proximity in the, in the Genesis, the Genesis story. But so Abraham is, is the beginning then of salvation. This is what distinguishes. Lots of theories out there about what distinguishes Genesis 1 through 11 from the rest of the Book of Genesis. But sometimes genre, sometimes all kinds of things are suggested. But what really distinguishes it is that Genesis 1 through 11 is outlining the problem. Right. How we got here. And then Genesis 12 is the beginning of the solution. It's the beginning of salvation. And this is why when we get to the New Testament, anytime Saint Paul or someone else is talking about salvation, they start with Abraham."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2177.56,"end":2178.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2179.8,"end":2218.75,"speaker":"Fr Stephen De Young","text":"That's, that's where they go to. Because this is, this is the beginning now of, of the recovery. And so you have Abraham, who, who Yahweh draws near to personally and literally he draws close to him personally. He appears to him repeatedly. He stands in front of him and talks to him. Right. But Abraham and his immediate descendants are living as nomads. Right. They leave. Or. And. And Ur, in the Abraham story, notice, is identified as Ur of the Chaldees."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2219.95,"end":2221.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What's. What's that about?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2221.39,"end":2253.75,"speaker":"Fr Stephen De Young","text":"Yeah, it actually isn't Ur of the Chaldees. Or was it Sumeria? Not Aad? And it. And it was. The Babylonian empire didn't really exist at that time. It didn't control Ur. But more than that, the term Chaldean refers to the Neo Babylonian empire, but it's called Ur of the Chaldees in the Genesis text. Precisely to make the connection to the. To what just happened with Nimrod in the Tower of Babel."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2253.75,"end":2254.91,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2255.41,"end":2258.01,"speaker":"Fr Stephen De Young","text":"Chaldeans are Babylonians, sort of more like."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2258.01,"end":2259.89,"speaker":"Fr Andrew Stephen Damick","text":"Or like the Chaldees."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2260.85,"end":2261.53,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2261.53,"end":2262.29,"speaker":"Fr Andrew Stephen Damick","text":"Sort of. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2262.29,"end":2290.92,"speaker":"Fr Stephen De Young","text":"So it's, it's a. It's making the point that when. When God does come and appear to Abraham, Abram at that point and calls him out. Right. He's calling him now out of. Out of Babylon. He's calling him out of the city. God had already withdrawn himself from that, and now he's calling Abram out to come out with God away from that civilization."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2292.44,"end":2292.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2293.32,"end":2327.01,"speaker":"Fr Stephen De Young","text":"And so the place where God is, since Abraham, Isaac and Jacob and Jacob's sons are living nomadically, the place where God is, is with them wherever they are. Right. And so this is why all the way through up to. Up to Moses, and we'll be talking about Moses more in the second half. When God identifies himself, he doesn't identify himself as the God of a place."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2328.37,"end":2342.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which. Which is, you know, like what most. Most spirits of that time were associated with, you know, the local God, basically. Territorially local."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2342.81,"end":2358.97,"speaker":"Fr Stephen De Young","text":"Right, right. He's. He's in Genesis 1 through 11, He's God most High. He's just God. Right. God of gods. Right. From Genesis 12 on for a good long while, he's the God of Abraham, Isaac and Jacob."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2359.05,"end":2363.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it becomes local, but not local to a place. It's local to these people."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2363.5,"end":2363.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2364.14,"end":2365.5,"speaker":"Fr Andrew Stephen Damick","text":"He's with them people."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2365.66,"end":2367.02,"speaker":"Fr Stephen De Young","text":"Yes, he is with them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2367.5,"end":2369.1,"speaker":"Fr Andrew Stephen Damick","text":"Traveling around with them. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2369.1,"end":2371.82,"speaker":"Fr Stephen De Young","text":"And he. He appears to all of them bodily."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2372.38,"end":2372.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2373.5,"end":2393.83,"speaker":"Fr Stephen De Young","text":"And so what we see in terms of sacred space is not a temple or temples. Right. It's not that kind of thing. But at these places where Abraham, like at Mamre or Jacob, like at. At Bethel."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2394.07,"end":2394.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2394.71,"end":2404.79,"speaker":"Fr Stephen De Young","text":"Wrestles wrestles God there, where, where they encounter Yahweh personally, where he appears to them, where. Where they interact with him, they build an altar there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2405.59,"end":2405.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2407.03,"end":2421.12,"speaker":"Fr Stephen De Young","text":"And then that is the place when they come back ritually and offer sacrifice on that altar. They're making the time when they were there in the presence of God to be that time again."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2421.6,"end":2434.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they basically go on pilgrimage back to those places and by means of offering sacrifice, they're there again. They're. Then again, you have to think fourth dimensionally."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2434.96,"end":2436.2,"speaker":"Fr Stephen De Young","text":"Ritual time travel."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2436.2,"end":2437.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2438.72,"end":2443.41,"speaker":"Fr Stephen De Young","text":"They don't travel back in time, but then that time becomes this time, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2443.41,"end":2445.81,"speaker":"Fr Andrew Stephen Damick","text":"You know, and you don't have to go 88.8 miles per hour."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2445.81,"end":2480.82,"speaker":"Fr Stephen De Young","text":"Right, right, right, right. You need zero gigawatts of power. So, and, and as a note, if you actually look at those altars in the patriarchal narratives and the stories of the patriarchs in Genesis 12 through 50, there are 12 of them and there's one in each of the territories that God later assigned to the 12 tribes of Israel. So if they had done what they were supposed to do and taken the land they were supposed to take, each one of them would have had one of those shrines within their territory. But of course they didn't."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2482.58,"end":2483.46,"speaker":"Fr Andrew Stephen Damick","text":"Disappointing."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2483.78,"end":2484.18,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2485.46,"end":2485.86,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2488.1,"end":2510.87,"speaker":"Fr Stephen De Young","text":"I don't know if there was giggling or not, though. But anyway, so then before we, before we move to Act 2 and yeah, get to our friend Moses. So before Moses, there's. There's this big time gap between the patriarchs and the beginning of Exodus. Right, right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2510.87,"end":2530.7,"speaker":"Fr Andrew Stephen Damick","text":"It's like 5 to 700 years of space between them. I mean, you know, so basically, you know, Jacob and sons are in Egypt and then five to seven hundred years later you get the Exodus, right? You know, you go from what's going on, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2530.7,"end":2551.67,"speaker":"Fr Stephen De Young","text":"You go from 70, not coincidentally, people who go down into Egypt to, you know, what's going to become the nation of Israel. And so during that time, during that, these centuries, right? Where is the God of Abraham, Isaac and Jacob, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2551.67,"end":2564.15,"speaker":"Fr Andrew Stephen Damick","text":"Because during this time, I mean, as far as anyone on earth is concerned, they're dead. So God isn't hanging around in the cemetery, Right? Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2564.71,"end":2571.46,"speaker":"Fr Stephen De Young","text":"So the question, did God just withdraw again for a few hundred years and then come back to Moses? Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2571.62,"end":2577.62,"speaker":"Fr Andrew Stephen Damick","text":"Or follow them into Egypt? I mean, what would happen if he had followed them into Egypt? That would have been probably bad for the Egyptians, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2580.82,"end":2594.02,"speaker":"Fr Stephen De Young","text":"So as it later is, what's actually in the Bible and some archaeology tell us where he is during centuries."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2594.1,"end":2602.99,"speaker":"Fr Andrew Stephen Damick","text":"I'm just going to preface this everybody by saying I had no idea. I had no idea. This is. Yeah, yeah, yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2603.23,"end":2603.87,"speaker":"Fr Stephen De Young","text":"So we're."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2604.19,"end":2607.63,"speaker":"Fr Andrew Stephen Damick","text":"Put your, put your hats on so that your skulls don't explode too much here."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2608.83,"end":2618.51,"speaker":"Fr Stephen De Young","text":"So the earliest mention of the name Yahweh as a God that we have outside the Bible."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2618.99,"end":2619.63,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2620.51,"end":2632.11,"speaker":"Fr Stephen De Young","text":"Is on a wall at a temple at the city of Soleb in Nubia. So this is northern Sudan today."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2632.91,"end":2638.75,"speaker":"Fr Andrew Stephen Damick","text":"Right. This would have been an Egyptian settlement. Right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2638.75,"end":2664.8,"speaker":"Fr Stephen De Young","text":"It's an Egyptian temple built by Pharaoh Amenhotep III as a temple to Amun Re. And so on the walls of this temple there are these cartouches. Right. And a cartouche is sort of a way of marking off an inscription. So you have like usually an oval shape and then the hieroglyphics are within that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2665.2,"end":2682.93,"speaker":"Fr Andrew Stephen Damick","text":"I remember seeing those for the first time reading Asterix and Obelix comics when I was a kid because we had the Asterix and Cleopatra comic thanks to my dad, who bought it in Australia, if you can believe it. True story. That's how I learned about cartouches. I think I still have it actually."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2683.17,"end":2684.61,"speaker":"Fr Stephen De Young","text":"So, I mean, worth money?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2685.25,"end":2686.77,"speaker":"Fr Andrew Stephen Damick","text":"It's probably. Yeah, I don't know."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2687.41,"end":2688.45,"speaker":"Fr Stephen De Young","text":"So that's my first thought."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2688.69,"end":2702.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, yeah, I think, I mean I, if I do have it, I would have had it since like 1982. 81. I mean, it's a long time ago, but that's how I learned what a cartouche is."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2702.41,"end":2780.44,"speaker":"Fr Stephen De Young","text":"Right. So, so these, these cartouches are basically Amenhotep III bragging about all the people who he beat up on in war. Right. And where they were from and sometimes who their gods were and all that kind of stuff. A lot of trash talk. Right, right. And so in the midst of this was built in the early 14th century BC early 14th century would be sometime between like the year 1400 and 1350 BC is when this cartouche was carved. And it refers to one of the people who he had beaten in battle and taken slaves were the Shasu of the land belonging to Yahoo. Okay, so who these people was the common way of abbreviating Yahweh? It's, it still is. Benjamin Netanyahu has the name Yahweh in his last name. So every time Jewish people say his name, they're saying Yahweh."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2782.12,"end":2782.76,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2782.92,"end":2787.72,"speaker":"Fr Stephen De Young","text":"Some questions we occasionally get from listeners. Yes, right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2787.72,"end":2796.93,"speaker":"Fr Andrew Stephen Damick","text":"So, so yeah, I mean there's a lot of, there's a lot of Jewish names that include, you know, Yahweh in them in one way or another. Like Elijah, right? Isn't it like Eliyahu?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2797.01,"end":2800.13,"speaker":"Fr Stephen De Young","text":"Yes, yeah, that's the Yah, there's the Yahoo."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2800.13,"end":2800.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the Yah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2800.69,"end":2804.97,"speaker":"Fr Stephen De Young","text":"Yeah, Hallelujah. Right, The Yah at the."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2804.97,"end":2817.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah. Obadiah. Right. Isn't that. Yeah, yeah, yeah, yes, exactly. Right, so the Shasu of Yahweh's land."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2817.82,"end":2818.22,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2818.46,"end":2819.74,"speaker":"Fr Andrew Stephen Damick","text":"Who are these Shasu?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2819.98,"end":2829.58,"speaker":"Fr Stephen De Young","text":"It's not the land of Yahoo. Like, the name of the land was Yahoo. It's the Shasu who come from the land that belongs to the God Yahweh."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2829.66,"end":2831.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, It's a possessive genitive."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2831.5,"end":2845.02,"speaker":"Fr Stephen De Young","text":"Right, right. And there's a similar inscription in Amara west from. From the 13th century B.C. so from about 100 years later."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2845.18,"end":2845.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2845.66,"end":2859.78,"speaker":"Fr Stephen De Young","text":"That also talks about the Shasu who are from the land belonging to Yahu. And you don't have to look far to find out in Egyptian records that the Shasu are what they called the Edomites. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2859.78,"end":2865.02,"speaker":"Fr Andrew Stephen Damick","text":"So these are descendants of Esau, the brother of Jacob."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2865.18,"end":2889.34,"speaker":"Fr Stephen De Young","text":"Right, The Edomites, the descendants of Esau, the settled members of that group were called the Edomites. They were settled in the land of Edom around Mount Seir S E I R. And then there were also the Midianites, who you read about in the Old Testament were basically a mixed group of Edomites and Ishmaelites."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2890.86,"end":2891.42,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2892.44,"end":2896.2,"speaker":"Fr Stephen De Young","text":"So that's. That's who the Midianites are. So all these people are descended from Abraham."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2897.08,"end":2900.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, because they're sons, descendants of Esau."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2900.12,"end":2901.4,"speaker":"Fr Stephen De Young","text":"Yeah, according to Genesis."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2901.72,"end":2918.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's. And it's this bunch. So we actually meet one, Right. I don't know if we meet any before him, but. But we meet one in Exodus, when Moses goes out into the wilderness and spends, what is it, 40 years out there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2919.17,"end":2920.29,"speaker":"Fr Stephen De Young","text":"Moses goes on the lamb."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2921.01,"end":2922.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2922.61,"end":2926.69,"speaker":"Fr Stephen De Young","text":"You're killing somebody. Yeah, right. It's the law. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2926.85,"end":2943.97,"speaker":"Fr Andrew Stephen Damick","text":"So he. Right, so he's out there and he meets a local girl and marries her. That's Zipporah. And her father is Jethro. And he's a priest, and he's Midianite, and he's a priest of Yahweh."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2943.97,"end":2947.36,"speaker":"Fr Stephen De Young","text":"He's a priest of. Of the. Right. The Most High God. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2947.36,"end":2948.48,"speaker":"Fr Andrew Stephen Damick","text":"Of the Most High God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":2948.88,"end":3004.74,"speaker":"Fr Stephen De Young","text":"And so he's the one who then imparts, right, the knowledge of who Yahweh is to Moses, shows him where the Mountain of God is. Right? And when. When God introduces himself to Moses, he says, right, your forebears knew me as El Shaddai, as the God of the mountain, but you will know me as Yahweh. Right. So what this shows us both from, again, reading Exodus and from this archaeological find in terms of what the ancient Egyptians of that time knew about those people is that the worship of Yahweh had been continued by the rest of Abraham's descendants, at least to this point, who didn't go into Egypt."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3005.06,"end":3005.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3005.62,"end":3012.5,"speaker":"Fr Stephen De Young","text":"And it's not just this. Well, hey, look, there's Jethro. There's a bunch more about this."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3012.66,"end":3013.42,"speaker":"Fr Andrew Stephen Damick","text":"There's. Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3013.42,"end":3014.54,"speaker":"Fr Stephen De Young","text":"In the Old Testament."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3014.54,"end":3015.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3015.02,"end":3015.54,"speaker":"Fr Stephen De Young","text":"Closely."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3015.7,"end":3071.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's multiple references. And I'm just going to rattle off the. The references so people can look these up. Deuteronomy 2:1, 5, and 12, Joshua 24, 4, Judges 5:4. And then Ezekiel 35, verses 1 through 15. And they all reference Mount Seir, if I'm correct. S E I R. Once again, you could actually just do a word search on, you know, the Biblegateway.com for the word ser, and you'll see all these references to it. And like, for instance, the One in Judges 5, 4. Right. Lord, when you went out from Seir, when you marched from the region of Edom, the earth trembled and the heavens dropped. Yes. The clouds dropped water. So you get God, he's in this place called Seir, and it identifies as Edom, you know."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3071.35,"end":3078.95,"speaker":"Fr Stephen De Young","text":"Right. In Judges five, they're describing Yahweh coming to lead the people of Israel into Canaan, into the Promised Land."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3079.4,"end":3079.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3079.96,"end":3108.92,"speaker":"Fr Stephen De Young","text":"And he comes to do that from Mount Seir. Right, Right. So that's where he was there being worshiped by the Edomites. And then he comes from there to lead the people of Israel. In the Deuteronomy 2 verses that you mentioned first, it's that when. When the Israelites came to the Edom, they were just kind of hanging around there for a while, and. And God had to kind of tell him, hey, Moses, come on, get it, get it moving. We got to go into the Promised Land."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3109.16,"end":3115.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I'm here, but. Yeah, yeah, yeah, I'm here, but this is not. This is not the place."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3115.72,"end":3140.25,"speaker":"Fr Stephen De Young","text":"Right. And. But he says there, he says, you are not to take literally one foot. It says the length of one foot, one human foot. You're not take one foot of their land. Because Yahweh says he brought the Edomites there, gave them that land, and he's giving Canaan to the descendants of Jacob."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3140.97,"end":3149.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And isn't there a reference. Is this the 1 In Deuteronomy 2:12, the Horites who are in Syria now are those giant people?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3150.01,"end":3151.21,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3151.21,"end":3156.33,"speaker":"Fr Andrew Stephen Damick","text":"So God clears out giants and brings Edom in to live in Sarah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3156.33,"end":3162.19,"speaker":"Fr Stephen De Young","text":"Right. He used the Edomites to clean the giants out of the land and give it to them directly, parallel to what he's about to do in the book of. Of Joshua."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3162.67,"end":3163.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3163.23,"end":3241.67,"speaker":"Fr Stephen De Young","text":"Right. And so there's this direct parallel. God did the same thing with Edom that he's going to do with Israel. He did it there first. Joshua 24, verse 4 that you mentioned. That's at the end of the book of Joshua where Joshua is laying out how God had fulfilled all the promises about the land that he made to Abraham. Attention, our dispensationalist friends. The book of Joshua says that God in the conquest fulfilled all the promises about the land that he made to Abraham. It literally says that it's been fulfilled. Part of that fulfillment, According to Joshua 24, verse 4, is that God gave the land of Edom to the descendants of Esau and brought them in there and gave it to them. And then the last one of those references you read in Ezekiel is the other end. It's after Judah has gone into exile. And at the time Judah went into exile, the Edomites sort of used that opportunity to do some pillaging and some expanding of their territory and to sort of turn on their brothers and gloat. And so Ezekiel is promising the Edomites that because of their wickedness, they're going to suffer the same fate Judah did."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3242.31,"end":3242.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3243.44,"end":3252.88,"speaker":"Fr Stephen De Young","text":"So there's this direct parallel between what happens to Israel and what happens to Edom in the Old Testament. They're treated fundamentally the same way."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3253.68,"end":3260.48,"speaker":"Fr Andrew Stephen Damick","text":"Cool. Well, everybody, now you know where exactly God was during those 5 to 700 years."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3260.8,"end":3262.48,"speaker":"Fr Stephen De Young","text":"And knowing is half the battle."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3262.48,"end":3275.2,"speaker":"Fr Andrew Stephen Damick","text":"It GI anyway. Yes, it is. We'll be back in just a moment as we continue this discussion as we head towards Pentecost. But right now we'll take a break."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3275.92,"end":3292.24,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3297.93,"end":3362.59,"speaker":"Fr Stephen De Young","text":"This is an Ancient Faith Radio public service announcement. The Mental Health Task Force of the assembly of Canonical Orthodox Bishops has recently launched two mental health a National Directory of Orthodox mental health Professionals and an Orthodox mental health needs assessment that are available at www.assemblyofbishops.org. mental Health. The Directory of Orthodox Mental Health Professionals features licensed Orthodox Christian clinicians across the US who are available to serve as resources to those seeking mental health care, substance abuse care, and or professional consultation. While the Orthodox mental Health Needs Assessment is an anonymous survey for all Orthodox jurisdictions, clergy and LayPeople across the US the aggregate data from this survey will help the task force better understand and address the mental health needs of Orthodox faithful through the development of ministry resources. Once again, that web address is www.assemblyofbishops.org. mental health."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3363.71,"end":3379.79,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3382.04,"end":3388.68,"speaker":"Fr Andrew Stephen Damick","text":"You voice of Steve. Always great to hear from you. I actually had lunch with the Voice of Steve last week."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3389.08,"end":3390.04,"speaker":"Fr Stephen De Young","text":"Just his voice."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3390.36,"end":3396.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you know, actually his, his, his. His body was, was present in all of its."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3397.48,"end":3403.68,"speaker":"Fr Stephen De Young","text":"So this whole nexus of potentialities, this isn't like a Metatron situation that we have going on here."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3403.68,"end":3419.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yes. He's not the Metatron or Megatron. Yeah. So. All right. Well, we do have a caller waiting. She's been patiently waiting. Yvonne has a question about the Tree of Life. So, Yvonne, are you there?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3420.16,"end":3422.8,"speaker":"Yvonne","text":"Yes, I am. Thank you for taking my call."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3422.88,"end":3424,"speaker":"Fr Stephen De Young","text":"Can you hear me? You're welcome."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3424.08,"end":3426.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3426.64,"end":3457.65,"speaker":"Yvonne","text":"Great. It's actually about the tree of Knowledge. And it's a quick, quick question. And then if it's okay, I have another quick question after that. But everybody calls it the Tree of knowledge. But you know how it's the tree of knowledge of good and evil? Is that, are they saying it's the tree of like, judgment, like the old, you know, the old fashioned definition of judgment, which was like, discern, and I don't mean like condemnation, I mean like discerning, Knowing good and evil, knowing right and wrong. Is that, is that what that means?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3459.9,"end":3466.38,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I'm just gonna go out on a limb and say yes. Am I correct in my. Yes, Father. I just want to make sure."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3466.46,"end":3467.98,"speaker":"Fr Stephen De Young","text":"Stealing. Stealing my bit."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3468.14,"end":3468.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3468.7,"end":3471.1,"speaker":"Fr Stephen De Young","text":"What could I say? Yeah, if, if you can people say."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3471.1,"end":3472.78,"speaker":"Yvonne","text":"Like, oh, I'm sorry, go ahead."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3473.1,"end":3491.34,"speaker":"Fr Stephen De Young","text":"Well, I was gonna say if you, as you go forward in the, in the Old Testament, that phrase knowledge of good and evil, what it's used for in the rest of the Old Testament, sort of coming of age or maturity. Right. Like a child becomes an adult when they're able to know good and evil."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3492.06,"end":3492.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3492.94,"end":3521.3,"speaker":"Fr Stephen De Young","text":"So the idea is it's not an evil tree. The idea is that there would have been some point when Adam and Eve had reached a point of maturity where God would allow them then to come to that knowledge, right. They would have been mature enough and prepared for it. But they try to seize it for themselves, right. Or the devil gets them to seize it for themselves. Right, by telling them, you'll be like God if you do this, right. You'll sort of leapfrog the process."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3522.42,"end":3526.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so what was your, what was your follow up question then, Yvonne?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3526.18,"end":3569.03,"speaker":"Yvonne","text":"Well, then you were talking about. Oh, gosh, now I. Oh, Abraham Abram. Right. How he was in. By the Tower of Babel, you know, when it fell apart. So was he. Does it even matter? But is it true that he had the original language? You know, like how before the languages were divided, whatever. Like, would he have had the. Because if Paul said that when he said, what benefit is there in being a Jew? And then he goes, oh, much in every way because they're the keepers of the oracles of God, does that mean like that they had the pre Diluvian language? And would it even matter? Or did Abram have that if he was by Babel?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3569.59,"end":3600.11,"speaker":"Fr Andrew Stephen Damick","text":"So. Well, I mean, I would love to say that the original language was Lithuanian, of course, or old. Or Old English, one of the two, but likely not likely. Yeah. Yeah. No. So Abraham, you know, as we just said, Abraham was associated with the Tower of Babel in scripture. Right. But he's not actually there. He's a lot later. Right. So by the time we meet Abraham, the nations of the world have already been divided up into many, many languages."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3600.67,"end":3650.44,"speaker":"Yvonne","text":"So could he have had the first language? Like, could he have held onto it? You know what I mean? Because there's a. I know you said that genealogy is really boring, but there's a guy, he's an author and his name is Vaughn Heppner, V A U T G H N Hepner. And he writes these fictional books. But like I actually have, like, you know, because his books are so good and they're very, very easy to read. Like, he goes into the genealogy, that's what he does, of Genesis. But anyway, I think he suggested it in his books that maybe when Babel was spread out that one of the groups kept the original language. But I guess nobody did. I, I mean, anybody have had the pre Duluth? Like, is there anybody that just wiped out?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3650.84,"end":3652.68,"speaker":"Fr Stephen De Young","text":"I, I would, I would talk about."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3652.68,"end":3659.4,"speaker":"Yvonne","text":"Like the books of Enoch and stuff like that being from pre Diluvian. Like somebody would have to speak the language. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3660.12,"end":3700.3,"speaker":"Fr Stephen De Young","text":"Well, but we, we obviously we don't have any copies from back then. Yeah. But I, I think most likely it's gone. You could, you could try to do that with Sumerian, I guess, because Sumerian is a really weird language. It's not related to any other language in. In Earth history. It's. It's weird in that regard. But at the time Abram lived in the, in the Earth 3 period, he. I mean, there were Sumerian words that got incorporated into other languages, but he would have been speaking a version of Akkadian by that point."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3700.62,"end":3702.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is a Semitic language."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3703.02,"end":3704.98,"speaker":"Fr Stephen De Young","text":"Right? A Semitic language. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3704.98,"end":3725.57,"speaker":"Yvonne","text":"Because they do this genius. Like, if you follow the. If you like, do the math. Wait, who is Shem Hamp? One of the sons of Noah would have still been alive when Abram was alive. And like they suggested it in this book that they could have talked to each other or met. I guess it doesn't matter. It's all fictional. But."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3725.97,"end":3805.19,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. The problem with that approach. This will get people grumpy at me. The problem with taking that approach to the genealogies is that if you try to take any one of them literally in the Old Testament, you run into trouble with some of the other ones. First off, like, they. They don't match. And the way ancient genealogies were written, they didn't list every single generation. They just listed important figures. So especially the. The genealogy of. Of Abram. There's probably a lot being skipped. And here's why. Because if you take those numbers that you say there's no skip generations at all, then There are only 300 years between the flood and Abram. And it seems on or not the flood in Abraham, between the Tower of Babel and Abram. And it seems unlikely to me that you would go from all the people in the world being in one place to Abram being able to meet the pharaoh of Egypt. And they have a whole civilization over there in Egypt, and then they have a whole other civilization in Sumeria and another one in Syria, and there are kings and they're developed different languages and all that. That all of that could happen in 300 years."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3805.67,"end":3865.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's just not a thing. It's just not. Plus the other thing is that, you know, just even speaking from a linguistic point of view, language changes a lot. And there's no. Even if someone is safe living for hundreds of years, there's actually no reason to believe that they wouldn't change the way that they speak along with everybody else. Right. I mean, I've lived in different parts of the United States and I even lived on the island of Guam for a while. And the way that I talk has altered. Right. I do not sound like The Southerner that I was born to be. I sound now more like the Yankees among whom I live, you know, and. And that's just within my few decades of life. Languages change over time. They simply do. Especially when you don't have, you know, mass culture like television and radio and so forth and mass literacy. Everything just goes a lot more quickly in terms of the way that it changes. So it's just not plausible on any measure."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3865.84,"end":3866.24,"speaker":"Yvonne","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3867.28,"end":3869.36,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, does that answer your questions, Yvonne?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3869.36,"end":3871.52,"speaker":"Yvonne","text":"It does, it does. Thank you so very much."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3871.68,"end":3873.12,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, thank you for calling."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3873.68,"end":3874.16,"speaker":"Yvonne","text":"All right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3875.12,"end":3897.5,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, now that we've watched God come out of Seir and come to rescue his people in. In Egypt, although we should say we see that in progress. Yeah, let's go to another mountain. Right? Another significant mountain. Yeah. Yes, yes, another mountain that is being the mountain of God, and that's Sinai."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3897.98,"end":3983.35,"speaker":"Fr Stephen De Young","text":"Right. So we've already seen one transition, or a couple, actually. But we've seen this transition to God being the God of these particular human persons. Right, right. And being where they are. And then we saw him being at this mountain. Now we're at Sinai, of course. We see, well, at first with Moses. Right. We see the same pattern we saw with the patriarchs in the sense that Yahweh, the God of Israel, is with Moses. Right. He's with Moses and Aaron when they go back to Egypt. Right. He's now with them as people. But once we get to Sinai, we then get the instructions given to build the tabernacle. And so this then is going to be a transition where there's going to be this place where God is going to be, where his presence is going to be in this particular tent, which is going to be set up at the center of the Israelite camp. While they're wandering in the desert and making their way, they're going to pitch their tents and camp. And another thing that people love reading, their favorite part of the Torah is the detailed instructions in the Book of Numbers about the order in which the tribes march and where they set up camp in relation to each other and to the tabernacle. I know that's like the big. Everybody's super excited about that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3983.43,"end":3985.59,"speaker":"Fr Andrew Stephen Damick","text":"Let's do a big cosplay reenactment or something."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":3987.11,"end":4028.68,"speaker":"Fr Stephen De Young","text":"So. But the. The tribes camped around, Right. In a circle around the tabernacle. Right, right. And that just that way of camping, you have God dwelling in the midst of his people. And you also have this idea starting to develop that we're going to go into more detail here. In a minute of these sort of concentric circles leading out from where the presence of God is. Right, right. You've got the presence of God in the tabernacle, then the next circle out, you've got the camp, and then outside, then you've got outside the camp. So this is, in a certain way a return to the way things were in Eden or Paradise."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4029.32,"end":4030.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4030.44,"end":4048.78,"speaker":"Fr Stephen De Young","text":"Because you had the walled garden. Right. And then you had the world outside of it, and you now have the world outside the camp, and then the camp with the. With the tabernacle at its center. And that's why you get the Edenic imagery in the tabernacle."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4049.18,"end":4049.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4051.5,"end":4081.52,"speaker":"Fr Stephen De Young","text":"So but for our purposes tonight, where we're eventually going to talk about Pentecost, the most important part of this, and we talked before the sacred geography and stuff, we talked about a little bit about the tabernacle there from that other perspective, but we want to talk about what unfolds in Leviticus 8 through 10 as the tabernacle is put into service and consecrated."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4081.6,"end":4091.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so before we get to that, we actually do have a caller. So Christopher is calling and. Christopher, are you there?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4091.68,"end":4092.24,"speaker":"Fr Stephen De Young","text":"I am."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4093.1,"end":4102.14,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, Christopher, welcome to the Lord of Spirits podcast. What is your question or comment or insinuation for us this evening?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4102.94,"end":4106.78,"speaker":"Fr Stephen De Young","text":"Well, I'm reading or just actually just finished Father Stephen's book."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4107.5,"end":4109.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you have a book? You have a book, Father Stephen?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4110.38,"end":4116.94,"speaker":"Fr Stephen De Young","text":"He does, yeah. I don't know if ancient faith still has it, but, yes, I do have a book."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4117.1,"end":4118.22,"speaker":"Fr Andrew Stephen Damick","text":"Buy them now, everyone."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4119.32,"end":4120.64,"speaker":"Fr Stephen De Young","text":"Sorry, sorry."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4120.64,"end":4121.44,"speaker":"Fr Andrew Stephen Damick","text":"Go ahead, Christopher."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4121.44,"end":4187.42,"speaker":"Fr Stephen De Young","text":"I'm sorry. Well, I have a question about the angels that got assigned to govern the nations and cities, and I wonder how all of them became corrupt and demons, because I know they're talked about in Tolkien and Lewis until we have faces. And they have a mixed influence there, good and bad. Right. So how did all of them become corrupt? The guy just choose the wrong ones or. Well, well, it depends on what you mean by how did. Well, so it's not all of them because they're St. Michael. Right. Number one. Right. So there's one at least. But also, also, I. I think. I think one reason why people under misunderstand this point is that I haven't effectively communicated what I'm hopefully about to effectively communicate. You'll have to tell me. But. So it's not just a question of, well, okay, There are these 70 individual angelic beings, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4187.42,"end":4187.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4187.78,"end":4196.74,"speaker":"Fr Stephen De Young","text":"Plus St. Michael, and those particular beings are assigned to these nations, and each of those beings individually goes bad. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4197.03,"end":4197.35,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4199.67,"end":4227.73,"speaker":"Fr Stephen De Young","text":"So in some cases, that's what happens, that that individual being goes bad. Right. But you also have cases like Ninurda that we were just talking about, where the people of a given city begin worshiping a demonic entity. And by doing that, that demonic entity, by them becoming demonized in their worship of him, that demonic entity becomes the power that's controlling that city."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4228.05,"end":4233.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're sort of dark patron. Say that again, Christopher."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4234.29,"end":4239.73,"speaker":"Fr Stephen De Young","text":"It's the people that are causing it by making it an idol."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4240.29,"end":4278.08,"speaker":"Fr Andrew Stephen Damick","text":"Well, so what he's saying is that in some cases, you've got essentially a good patron who goes bad by virtue of accepting worship that's being offered to him by the human beings under his care. But in the case, for instance, of Babylon, it's being depicted as. You've got probably a giant spirit. So we're talking about a demonized human soul who interacts with the locals, and they begin worshiping him and taking him as their patron. So he was already bad before they started doing idolatry with him. Okay. So that's how you get bad patrons in one way or the other."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4278.96,"end":4290.8,"speaker":"Fr Stephen De Young","text":"Right. And so obviously, there are now more than 70 nations. Right. Different places in the world. Right, Right. And so a lot. But. But what the scriptures do tell us is that all the gods of the nations are demons."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4291.36,"end":4291.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4291.88,"end":4296.24,"speaker":"Fr Stephen De Young","text":"Right. And what the pagans offered sacrifice, they offer to demons. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4296.4,"end":4300.32,"speaker":"Fr Andrew Stephen Damick","text":"So there's. There's no indication that any of them are still worshiping Yahweh."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4300.96,"end":4309.56,"speaker":"Fr Stephen De Young","text":"Right. That's the key. They're not worshiping Yahweh. So if their angel. I'm sorry, go ahead."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4309.96,"end":4310.52,"speaker":"Announcer","text":"So by."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4310.68,"end":4333.49,"speaker":"Fr Stephen De Young","text":"By St. Paul's time, when he writes in First Corinthians, when he says all the. All the gods of all the city states, those are all demons that all just. They'd fallen by that time. Well. Or they're worshiping another spirit. Right. So none. None of. None of the. None of the nations of the world go on to worship unfallen angels."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4335.41,"end":4335.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4337.81,"end":4370.62,"speaker":"Fr Stephen De Young","text":"Right. They stop worshiping Yahweh, the true God, and they start worshiping other things. So in some cases, that's the angel who was assigned to them who has now fallen and is participating in that worship. In other cases, it's some other demonic spirit that they started worshiping. Okay, that distinction helps. Yeah. Yeah. But the point is that it's now the demon who's in control, Right. Through sin, the power of sin, and through death, who has now enslaved those people."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4373.02,"end":4374.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay, does that make sense?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4374.3,"end":4375.5,"speaker":"Fr Stephen De Young","text":"It does make sense. Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4375.82,"end":4376.34,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4376.34,"end":4377.66,"speaker":"Fr Stephen De Young","text":"I got to the end of the book and."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4379.9,"end":4388.38,"speaker":"Fr Andrew Stephen Damick","text":"There'S always going to be more. Always going to be more questions. So. Yeah. All right, well, thank you very much for calling, Christopher. Good to talk to you."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4388.62,"end":4389.26,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4389.9,"end":4401.74,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we were talking about the tabernacle, and we were just about to discuss how it gets consecrated. So how do you consecrate a tabernacle?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4403.58,"end":4405.66,"speaker":"Fr Stephen De Young","text":"Not that I recommend going and doing this."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4405.82,"end":4407.5,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Don't. For the practice at home."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4407.5,"end":4410.46,"speaker":"Fr Stephen De Young","text":"This is not how to. Is it like, hey, guy. Hey, kids."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4410.87,"end":4411.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4411.51,"end":4412.23,"speaker":"Fr Stephen De Young","text":"Have fun."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4412.47,"end":4415.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Especially once you're about to hear how it's. How it's done."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4415.59,"end":4416.07,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4417.03,"end":4417.91,"speaker":"Fr Andrew Stephen Damick","text":"So there are."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4418.63,"end":4445.39,"speaker":"Fr Stephen De Young","text":"There are sort of two principal things that are done, and then something happens. Right. So all of the elements. So when we talk about elements here, I'm talking about the physical objects that make up the tabernacle. So physical objects like the altar of incense, the altar of burnt offering, the tent posts, the tent pegs, the goat hair curtains. Right. All. All the things."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4445.47,"end":4445.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4446.19,"end":4461.55,"speaker":"Fr Stephen De Young","text":"That are going to be put. To get physically put together to make the tabernacle, and the tabernacle that is going to designate the space where it is. Right. As sacred. All of those things are first purified with sacrificial blood."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4463.56,"end":4463.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4465.08,"end":4492.11,"speaker":"Fr Stephen De Young","text":"Purified from what? Right. Well, they're taken out of the world. Right. We've talked about this before, previous episodes are taken out of the world where they have the taint and stain of the sin and wickedness in the world on them. Right. And it's not just a question of them being pure enough to come into the camp. This is going to be God's presence. So it has to be completely pure. And so the sacrificial blood, like in. In the day of atonement, cleanses these physical objects. Then they're anointed with oil."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4493.95,"end":4494.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4494.83,"end":4505.15,"speaker":"Fr Stephen De Young","text":"And then after that has been completed, then the Theophanic glory cloud. A certain group of people just got excited."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4505.47,"end":4509.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's going to be the name of my next band, Theophanic Glory Cloud."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4510.03,"end":4513.31,"speaker":"Fr Stephen De Young","text":"The. You're inclined to do that, are you?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4513.55,"end":4513.95,"speaker":"Announcer","text":"The."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4516.31,"end":4518.31,"speaker":"Fr Andrew Stephen Damick","text":"I got. I caught that reference."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4518.47,"end":4537.43,"speaker":"Fr Stephen De Young","text":"Yeah. So the. The. The fiery cloud, which is the presence of God, which is the Holy Spirit, really. Right. The presence of God in the world. The one who. Who couldn't bear with man before the flood. Right. And had to leave, now comes to fill the tabernacle."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4537.91,"end":4538.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4538.71,"end":4540.31,"speaker":"Fr Stephen De Young","text":"Comes and fills the tabernacle."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4540.71,"end":4546.78,"speaker":"Fr Andrew Stephen Damick","text":"So now the question of where is God? Is answerable because he's in the tabernacle now."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4547.02,"end":4547.34,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4547.34,"end":4547.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4547.66,"end":4565.1,"speaker":"Fr Stephen De Young","text":"This is, this is, this is where he's going to be located. As the Israelites for 40 years are on their way to the land of Canaan. And so then in Leviticus 10, right after this happens, the story of Nadab and Abihu unfolds, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4565.1,"end":4586.4,"speaker":"Fr Andrew Stephen Damick","text":"Which I feel like should be the. A scriptural passage that is covered in the first day of liturgics in seminary. Like, I think it's just a good idea just to scare everyone. Yeah. Printed it, you know, right. Now, like the Liturgicon has the commandments of St. Basil the priest, which are excellent. There should be also a page where you just simply include this passage."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4587.36,"end":4596.11,"speaker":"Fr Stephen De Young","text":"Right? Yeah. So the Nadab and Abihu are two of the sons of Aaron."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4596.18,"end":4597.54,"speaker":"Fr Andrew Stephen Damick","text":"Aaron, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4598.34,"end":4599.46,"speaker":"Fr Stephen De Young","text":"The high priest."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4599.7,"end":4606.34,"speaker":"Fr Andrew Stephen Damick","text":"So they're. They're in their Levites, right? They're. They're part of the priestly bunch, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4607.46,"end":4612.78,"speaker":"Fr Stephen De Young","text":"And. Well, the Levites. Well, anyway, we won't go to that. Okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4612.78,"end":4613.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4613.18,"end":4646.03,"speaker":"Fr Stephen De Young","text":"So yeah, they're in the priestly family. They're in the high priestly family. Exactly, exactly. And so people argue about what exactly the problem was and you get different hints in different parts of the text. I go for an all in approach of they did everything wrong. Right. So we know from the text that they were drunk, right. We know from the text that they went in to offer incense at the wrong time, Right. Maybe because they were drunk."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4646.67,"end":4647.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4647.23,"end":4672.5,"speaker":"Fr Stephen De Young","text":"And we also know because it's called strange fire, that they offered the wrong kind of incense. Right. Because there's the whole incense recipe and how they were supposed to offer it. Right. So they're drunk and they do everything wrong in terms of what they were supposed to do in their duties to go into the tabernacle as priests and they fall over dead. Fire comes out from the presence of the Lord and consumes them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4672.9,"end":4675.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Death by holiness."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4676.5,"end":4689.03,"speaker":"Fr Stephen De Young","text":"Right. And so this is not only. Right. We see this theme again, but this is an object lesson now to all the people in the camp. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4689.03,"end":4690.71,"speaker":"Fr Andrew Stephen Damick","text":"See, this is what I'm saying. We need to put it on the."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4690.71,"end":4699.23,"speaker":"Fr Stephen De Young","text":"Church that the fact that God is now dwelling in their midst is not just. Oh, lovely. Right, yeah. Isn't that nice?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4700.11,"end":4702.67,"speaker":"Fr Andrew Stephen Damick","text":"Right. I really feel like God is here tonight."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4704.03,"end":4733.87,"speaker":"Fr Stephen De Young","text":"This is. That should scare you. Yeah, right. When someone says that, I know this is a serious thing. Right? A serious thing. And so they need to conduct themselves accordingly. And so when the Day of Atonement ritual that we've already gone through in detail in a previous episode is given in Leviticus 16 when it's given, it's given expressly. Right. At the beginning of the chapter, it's given because of what happened to Nadab and Abihu."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4734.26,"end":4744.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's verse one of chapter 16. The Lord spoke to Moses after the death of the two sons of Aaron, when they drew near before the Lord and died and the Lord said to Moses, etc."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4744.66,"end":4748.02,"speaker":"Fr Stephen De Young","text":"And this was, this was a good five chapters previous."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4748.66,"end":4749.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4749.22,"end":4841.91,"speaker":"Fr Stephen De Young","text":"Right. So it's brought up again here to remind, this is why. Right. And so this process is put in place for the cleansing with blood and reconsecration once a year of the tabernacle, the purification and reconsecration every year of the tabernacle so that the priests will be able to go in safely, come in safely into the presence of God. Right. The purification that's necessary for them and expanding out from that. This is what the vast majority of the Torah is, right. The law Torah, not like the first five books, Torah like the law. Right. The way we think about it, this is what the commandments are aimed at. The commandments are aimed at. And this includes both what we'd call quote unquote, moral commandments and what we quote unquote call purity laws. And all of it. Right. That distinction, by the way, was first made by a 2nd century Gnostic, had to throw that in. And anyway, what the whole thing is aimed at is God is now living in our midst. We're now in the presence of God. This is how we need to conduct ourselves to do for that to be safe. Because if we don't. One of two things that we've already seen in Scripture, in Genesis, one of two things is going to have to happen. Either God is going to. The language that's used in the Torah is God is going to bring break out in the camp and people are going to die."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4842.95,"end":4843.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4843.59,"end":4894.2,"speaker":"Fr Stephen De Young","text":"If he stays and we are impure and wicked, or out of his love for us, he's going to have to leave and then he's not going to be with us anymore. We don't want either of those things to happen. And so the Torah was laying out what had to happen for that to to be possible. And then you get. Because of that, this is, and I know we've talked about this before, at least briefly, you have those concentric circles and those concentric circles. The closer you go in, the more purity is required of you. Right. So the Torah sets this standard for purity for the Israelites who are living in the camp, who are living near to the presence of God. They have to have a higher standard of holiness than the rest of the world."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4895,"end":4895.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4895.32,"end":4900.52,"speaker":"Fr Stephen De Young","text":"This is why God never tells them, you need to go and make the Syrians stop eating pork."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4901.16,"end":4902.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it's."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4902.8,"end":4915.08,"speaker":"Fr Stephen De Young","text":"Yeah, right. Because it's not law. It's not actually law. It's not some kind of eternal legal moral standard that's. It's not that it never function is that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4915.49,"end":4917.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's liturgical preparation, basically."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4917.61,"end":4938.21,"speaker":"Fr Stephen De Young","text":"Right. And so they didn't have to enforce that anybody else, because they're not living anywhere near God. They're not drawing near to the presence of God, so they don't need that holiness. Now, if they want to. If they want to come and eat the Passover, well, then they have to be circumcised and then they have to start. Start following the commandments. Right. So that they would safely draw close to God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4938.37,"end":4986.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, has an obvious pastoral application in our time, which is, frankly, that, you know, the only people. I mean, however you want to slice it, the only people who are actually going to be effective in terms of convincing them to follow the commandments of God are those who are trying to draw near to him. You know, the people who are not have no reason to do that. You know, I mean, you could try to convince them of its benefits or whatever, but really they don't have any good reason to do that. And, you know, if you look at the command that Christ gives the apostles, he doesn't tell them, go into all the world and tell them to do my commandments, it's going to all the world, baptize them, make them disciples, and teach them to do all that I have. Like, it's. The whole point is that it's entry into the church that involves all of that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4986.59,"end":4987.87,"speaker":"Fr Stephen De Young","text":"Right. It's the other way."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":4988.35,"end":5003.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. It's not, you know, it's. It's not. Yeah, exactly. I mean, the call to repentance is a call to draw near to God because the kingdom of heaven is at hand. That's what's going on. It's precisely this exact same, exact same dynamic."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5003.97,"end":5012.13,"speaker":"Fr Stephen De Young","text":"Right. But. So, yes, on one hand, we live in a society, so I'd rather not have to worry about my heathen neighbors murdering me. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5012.13,"end":5015.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. There's a certain amount of restraining that needs to go on."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5015.85,"end":5038.23,"speaker":"Fr Stephen De Young","text":"Right, Right. But on the other hand, on the other hand, me trying to go and get people who don't know Christ to live a moral life has no value any. It has no more value to them to have lived a moral life. Rejecting Christ than it would for a. A worshiper of Ninurta to not eat pork."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5039.03,"end":5040.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5040.31,"end":5078.34,"speaker":"Fr Stephen De Young","text":"Like it. It means nothing. It does nothing. Right, Right. So this is all about drawing closer. So the Israelites have this higher standard than the surrounding world. The priests within Israel, who are the ones who are living and working in and around the temple, have a yet higher standard. Right. The regular people in Israel did not have to maintain the level of purity that the Levites and the priests did. And then the high priest most of all. Right. Because the high priest had to do all the preparation for the day of atonement, for that one day when he went into the. The holy of holies."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5078.5,"end":5078.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5079.46,"end":5095.18,"speaker":"Fr Stephen De Young","text":"And so when we get to Solomon's temple, the first temple, all of this that we see in the tabernacle, which is mobile, gets concretized, right. In terms of a fixed building in."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5095.18,"end":5128.48,"speaker":"Fr Andrew Stephen Damick","text":"A fixed place, stationary. Right. And it's important to note that this was not God's idea. Right? He didn't. Because, I mean, how many times does he say in scripture, God does not dwell in temples made by hands. Right. God. It's not God's idea for them to build a temple, but he agrees to it, just as it wasn't his idea for them to have, you know, a human king. He. He agrees to it, you know. Yeah, yeah, Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5128.48,"end":5146.4,"speaker":"Fr Stephen De Young","text":"And. And there's this great disparity, right, that you notice very quickly when you actually read the text. Right. You go to ex. The whole last half of Exodus is all of the minutia of the instructions for every element of the tabernacle being given in detail twice."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5146.88,"end":5147.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5147.84,"end":5148.24,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5148.48,"end":5151.12,"speaker":"Fr Andrew Stephen Damick","text":"It's God's blueprints, literally."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5151.64,"end":5163.48,"speaker":"Fr Stephen De Young","text":"Yes. And they're all laid out, and then it describes them doing it in the same level of detail. So you get it all twice. You. You don't get that with the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5163.88,"end":5166.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's literally man design, man."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5166.52,"end":5212.35,"speaker":"Fr Stephen De Young","text":"Yeah. And the way that the temple is described is actually almost identical to a Syro Phoenician temple built at the same time, meaning a pagan temple built at the same time. Right. Now, when I've said that publicly before, I've had people come to me and say, well, hey, there's this. There's this one verse in First Chronicles that if you read kind of sideways and squint at it, kind of sounds like God gave David the plans for the temple. Okay. And my response to that is, let's say that's what that verse really means. Do you still think that one verse with a passing mention in first Chronicles is, is comparable to the whole second half of the book of Exodus in the Torah. You don't see any difference there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5213.71,"end":5218.99,"speaker":"Fr Andrew Stephen Damick","text":"I just kind of love the fact that someone is reading the Bible so closely that they come to you with that though. So that's great."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5219.39,"end":5222.35,"speaker":"Fr Stephen De Young","text":"Yeah. Assuming they weren't Google searching to try and."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5222.51,"end":5223.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes, there's that as well."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5223.95,"end":5254.64,"speaker":"Fr Stephen De Young","text":"Yes, the Google school of theology. But you see this very clearly when you see the dedication, right. We're talking, we talked about the dedication of the tabernacle. When you look at the dedication of the temple, you see this very clearly in terms of Solomon's Prayer and then God's response, because Solomon's prayer is very much, I mean it's, it's virtually Tower of Babel kind of stuff. It's moving in that direction, right. It's Lord, whatever, anybody prays toward this temple, give it to them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5255.68,"end":5256.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5256.64,"end":5272.25,"speaker":"Fr Stephen De Young","text":"It's, you know, God, do all this stuff related to this temple as object. Right. It's very close to like, we want you to come live in this object and then we're going to use that fact to get what we want from you. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5272.25,"end":5273.01,"speaker":"Fr Andrew Stephen Damick","text":"Good stuff."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5273.73,"end":5302.97,"speaker":"Fr Stephen De Young","text":"And so then the flip of that, God responds and goes into great detail about how he did not ask for a temple and he does not live in buildings made with human hands. And he's not going to automatically do that. And if they keep the commandments, he will bless them and if not, they're in trouble. Right. He lays all that out and then at the end basically says, but because I know you are human and weak and hard hearted, I will condescend and I will come to dwell in this building."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5303.53,"end":5314.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. So then, then again they do the purification with blood, the anointing with oil, and then you get once again the name of my next band, the Theophanic glory cloud."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5314.73,"end":5318.09,"speaker":"Fr Stephen De Young","text":"Right. Comes and fills, fills the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5318.33,"end":5318.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5318.97,"end":5348.53,"speaker":"Fr Stephen De Young","text":"And so then this is the place where God is Israel is destroyed by the Assyrians, the Northern kingdom, Judah, right. God departs from the temple and they go into exile. And you see the two fates there, right. You see death with the northern kingdom, you see exile, right. God having to remove himself with Judah with the southern kingdom and he does that again. So they won't be destroyed like the Northern kingdom."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5349.01,"end":5351.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because they fell into evil, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5351.97,"end":5359.49,"speaker":"Fr Stephen De Young","text":"They go into exile just like Adam and Eve were exiled from the garden so that they can repent and eventually. And eventually return."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5360.21,"end":5365.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So then after, I don't know, how long is it in the Babylonian exile?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5365.33,"end":5366.13,"speaker":"Fr Stephen De Young","text":"Seventy years."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5366.73,"end":5395.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. They come back and they rebuild the temple under Ezra. So you got the second Temple. Thus, this is our term, Second Temple Judaism. Right. And they do the consecration service, the blood, the oil, but there's no theophanic glory cloud. That's a big difference, right? Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5395.78,"end":5396.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5396.34,"end":5400.74,"speaker":"Fr Andrew Stephen Damick","text":"Does that mean it doesn't work, that the temp. That they're not actually worshiping there? I mean."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5401.94,"end":5403.94,"speaker":"Fr Stephen De Young","text":"No, they're offering the sacrifices there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5404.26,"end":5409.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But it's sort of from a distance, like a Bette Midler song."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5409.06,"end":5442.13,"speaker":"Fr Stephen De Young","text":"But there is no. There is no direct experience of God happening there. And then Antiochus IV Epiphanies, the Seleucid monarch, comes and desecrates that temple, and it falls into ruins. And the Maccabee brothers get torqued off and go and. And stage their successful war to reclaim the temple and to regain their independence. And they go and they rededicate the temple and start the celebration of Hanukkah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5442.29,"end":5446.76,"speaker":"Fr Andrew Stephen Damick","text":"But no theophanic glory cloud even after that rededication."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5447.32,"end":5456.84,"speaker":"Fr Stephen De Young","text":"Right, Even after all that. And so this is something that in the second Temple period, they were keenly aware of."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5457.64,"end":5460.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God did not come back."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5461.8,"end":5462.16,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5462.16,"end":5472.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even then, I can't remember. The timeline is not clear in my head, but when the Roman general Pompey actually. When was that in relation to the Maccabees?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5474.2,"end":5477.72,"speaker":"Fr Stephen De Young","text":"That was 110 years later. The Maccabees were under the Greeks."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5477.72,"end":5509.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right. Yeah. So then the Romans come in, and the Roman general Pompey decides to go walk into the temple and go all the way into the Holy of Holies, in which, like, if this had been 500 years before or whatever, would have meant he would have been struck dead before he even got in. But he goes back there and he just doesn't see anything, and. And he's like, oh, they must worship their God with their minds. You know, like, he's so impressed by that. But literally. But God's not back there. Yeah, he's not there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5509.51,"end":5516.03,"speaker":"Fr Stephen De Young","text":"The Ark of the Covenant isn't even back there. All that's back there is literally an empty cherubic throne."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5516.51,"end":5516.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5517.39,"end":5592.13,"speaker":"Fr Stephen De Young","text":"An empty throne. And so they were aware of this, and this is part of why they understood themselves to still be in exile. Right. It wasn't just that they were still being dominated by the Persians and then the Greeks and then the Romans, because there was that brief period with the Maccabees, with the Hasmoneans, when they were independent. Very brief. They made a treaty with Rome, and it was a bad idea. That's how they got annexed. But they were aware of this fact. Right. God hasn't come back. We're still under foreign domination. This isn't it. Right. And so we see this language in the New Testament of restoring the kingdom to Israel. We see this language and these various groups, various Judaisms of this period relate themselves to the Temple of Jerusalem in different ways. You tend to think that they all accepted it, but they didn't. So the Qumran community that produced the Dead Sea Scrolls, their whole basis was of going out in the desert and doing sort of reconstructed temple rituals out there was because they rejected the validity of that temple. Right. They're like, God's not there. This temple's bogus. There were the Jewish community in Elephantine in Egypt who built their own temple there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5593.41,"end":5594.69,"speaker":"Fr Andrew Stephen Damick","text":"I did not know that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5595.09,"end":5595.57,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5595.89,"end":5598.29,"speaker":"Fr Andrew Stephen Damick","text":"Is there anything left to that? Is that around at all?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5598.29,"end":5603.97,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. You could see where the well of souls was and stuff. You could see basically like the floor plan of the foundation."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5604.21,"end":5606.49,"speaker":"Fr Andrew Stephen Damick","text":"Suddenly I'm having Indiana Jones flashbacks here."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5606.49,"end":5610,"speaker":"Fr Stephen De Young","text":"But yeah, so, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5610,"end":5610.36,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5610.36,"end":5638.05,"speaker":"Fr Stephen De Young","text":"So they were aware of this, that this hadn't happened, and that, that they're looking toward deliverance, especially associated with the Messiah. And, and this is part of what that deliverance is going to bring is not just, you know, we're. We're so used to history being written in the 19th century German mode that, you know, we think, oh, they were all looking for a political messiah like that. Like politics was separated from everything else at that time."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5638.05,"end":5641.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, they wanted, they wanted God back in their worship center."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5641.65,"end":5647.41,"speaker":"Fr Stephen De Young","text":"Right. They wanted the Romans out and they also wanted God back. And those two things were related."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5648.85,"end":5651.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5652.29,"end":5684.23,"speaker":"Fr Stephen De Young","text":"So as we end this half right. I wanted to break down for a minute because I don't think we have this in our heads fully when we talk about the tabernacle or the temple being in the midst of the people of Israel and this kind of thing. I think somewhere in our heads, most of us have this idea that it's like, well, that's where they went to church. Right. Because we're. We're kind of reading our own experience back into. Right, right. Their experience."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5684.9,"end":5714.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. And often Orthodox Christians will not entirely incorrectly say, well, you know, our worship is like temple worship. Right. Which is not totally wrong, but it's wrong in certain key ways. Right, right, right. Yeah, yeah. So, yeah. So let's imagine what it would be like if a modern Orthodox church actually functioned like the temple or the tabernacle. Like, what would that actually look like?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5714.23,"end":5777.53,"speaker":"Fr Stephen De Young","text":"Right, right. So we're going to say your local Orthodox parish is the tabernacle or the temple. You're an ancient Israelite pilgrim going there for one of the feasts. Right. Because it was, we talked about before, obviously without fast travel, people weren't going there every week. Right, Right. So this is a lot more like Eden. Right. Which was still closed. And the cherub with the sword is still there. Right. You're, you're near, you're able to draw near to God but not go into his presence. So if you're the average person, you would come to the narthex. Right, right. Of your local Orthodox parish. You would lead your animals to the narthex or you would bring money because there would be people in the narthex and in, in parts of the parking lot selling sacrificial animals for people who couldn't, came from a long way away and couldn't bring animals with them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5777.77,"end":5778.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5778.57,"end":5820.11,"speaker":"Fr Stephen De Young","text":"And you would get your house, you would then give those animals to the priest. The, the priest would go take off with the animal, take it to the place called the prothesis. He'd kill the animal, he'd butcher the animal, he skin the animals, separate the meat the way he was supposed to. Right. Under the law, he would take the portions that were going to God. He'd take them out into the parking lot and burn them on a big barbecue pit out in the, out in the parking lot. He would then hand you your wrapped up pieces of meat to take with you to eat with your family. And that would be it for you, right? That would be your visit."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5820.43,"end":5822.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You wouldn't go into the equivalent of the nave."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5823.39,"end":5823.79,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5824.83,"end":5826.67,"speaker":"Fr Andrew Stephen Damick","text":"And only the priests would go there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5827.07,"end":5827.55,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5828.51,"end":5840.99,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, the holy of holies, which in modern Orthodox Church is, you know, the sanctuary, the area where the altar is. No one would go there except, what, once a year the high priest would go there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5841.64,"end":5845.32,"speaker":"Fr Stephen De Young","text":"Right. And the women and children would stay in the parking lot."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5845.88,"end":5846.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5846.52,"end":5891.89,"speaker":"Fr Stephen De Young","text":"The male head of the family would go in the narthex and deal with the priest and actually make the exchange. Right. And the priests would go for matins and vespers. They would go into the nave and only the nave and offer incense and prayers twice a day. And then one day a year, the high priest equivalent of the bishop would go back behind the iconostas, only on that day with a big cloud of incense and, and purify the place and then come out. That was worship. Right. This is, this is our pre Christian worship, if we put it into those terms."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5892.84,"end":5893.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5893.88,"end":5907.32,"speaker":"Fr Stephen De Young","text":"So I think we need to realize just how shut out from the presence of God people still were in order to understand the reality of what we have now going on in church."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5908.76,"end":5913.88,"speaker":"Fr Andrew Stephen Damick","text":"And with that, we're going to go ahead and take our second break. We'll be right back."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5914.68,"end":5930.97,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5936.33,"end":5968.89,"speaker":"Fr Stephen De Young","text":"No end of books these days offer us techniques for self improvement. But in the newest release from the ancient faith store, Gratitude in Life's Trenches, Robin Phillips takes a different tack. He shows us that God meets us where we are in the pain and heartache of the present moment. Instead of looking for a way to escape from hardship, we can cultivate an attitude of gratitude, peace and self acceptance that will transform our experience of suffering. Drawing on his own experiences and his work as a consultant in the behavioral."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5968.89,"end":5970.82,"speaker":"Announcer","text":"Health industry as well, well as stories."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5970.82,"end":5991.34,"speaker":"Fr Stephen De Young","text":"Of saints and sufferers, teachings of the fathers and recent discoveries in neuroscience, Phillips shows us that the journey to personal well being is one we can all travel, regardless of the hardships we may face. To find this book and others like it, you can go to store.ancientfaith.com Again."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":5991.58,"end":6011.83,"speaker":"Announcer","text":"That is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6014.15,"end":6065.08,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back and thank you for that voice of Steve. We would, we would love to hear from you. So do give us a ring. Okay. So we just talked about how the actual experience of a worshiper in ancient Israel was and compared it against our experience now as Christians actually coming to church, coming into the nave, men, women and children and actually having and seeing the veil opened to the holy of holies, you know, very different from ancient Israel. And so there has to be some kind of transition between these states. So let's talk now about what happens in the New Testament. There is a transition and it starts with a young, young girl. What was she about? What do they say she was 2 or 3 years old, I think."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6066.04,"end":6072.76,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. When she was old enough to be brought to the temple, the Theotokos. So this is a little bit pre New Testament."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6073.24,"end":6074.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yes. Yes. All right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6074.4,"end":6208.34,"speaker":"Fr Stephen De Young","text":"Well, slightly pre due Testament. And so we have, we have for for folks who are listening, who aren't Orthodox, we have a feast right. Of the entrance of the Theotokos into the temple. Because as has been handed down to us by Christians since this happened, who I don't think are liars, the Theotokos. When she was born to her parents, they were at an advanced age. And so to give thanks to God for giving them their child, St. Mary, they brought her to the temple to serve as one of the virgins there. This was an institution that already existed. It goes actually back to the tabernacle. One of the rarely discussed offices of the Old Covenant was that there were women who lived at the entryway to the tabernacle. So they couldn't go into the courts of the tabernacle, but they lived just outside the gates. And they were dedicated to assisting the priests and the Levites in terms of sewing cloth, preparing things, repairing things, feeding people, taking care of all of these sort of duties. And so when the temple came about, and we know for sure because this is recorded, people talk about it with the second temple, but when the temple came about, obviously you have it now in one fixed place. You had these women who were dedicated to. And. And they're referred to as virgins because they didn't get married. Right. So rather than having. Having children, having responsibilities to a husband and children, they dedicated their lives to taking care of these things. And because of that, they had to maintain a higher level of purity because they're closer. Right. Than the rest of. Than the rest of the people. And so the Theotokos was brought to be one of these women when she was a young, young girl."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6208.58,"end":6219.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which, I mean, and just as a sidebar, I mean, what a. What a contrast that is to what the nations were doing. Right. They also had women that were. That were hung around their temples."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6220.02,"end":6220.74,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6220.74,"end":6228.18,"speaker":"Fr Andrew Stephen Damick","text":"And shrines. And they were the opposite of. Of, you know, virginal, pure. Like it was. It was. Yeah, exactly."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6228.26,"end":6232.66,"speaker":"Fr Stephen De Young","text":"Now, we could. We could be fair and throw the Romans the vestal virgins, but that's a whole other discussion."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6232.98,"end":6234.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. But."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6235.16,"end":6251.32,"speaker":"Fr Stephen De Young","text":"But. And this is also important, and I won't delve into this right now, but sometimes we get questions from our Protestant friends about the importance of the Theotokos as ever virgin, that she was always a virgin through her whole life. This is a big part of that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6251.72,"end":6253.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because she's been set aside for this."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6254.28,"end":6373.15,"speaker":"Fr Stephen De Young","text":"Right. It's part of her dedication of her whole life and self to God. That's the focus of that, not anatomy. Right, right. That's not Primarily what it's about. So, so this happened, and then what. What our forefathers of the faith have handed down to us is that then when she. She came of age, because of those same purity laws, she could no longer remain in those temple precincts. Right? And so that's when she was betrothed to St. Joseph, right? As her protector, as. As her protector who was an older widowed man who was to care for her. Right. And then presumably at some point in the future, she would have. Right, if, if she had, you know, given birth to our Lord, she would have come back to the normal process. She would have come back to the temple to continue serving in that capacity. This is also the role that the prophetess Anna has when Christ is brought to the temple to be dedicated. And there's this widowed woman there who's been living there for years, since her husband died. She is also one of these women. But so in the feast, we celebrate her being brought to the temple. And the story that's been brought down to us is that she, in sort of a contrasting parallel to the General Pompey, went back into the temple itself and went back even into the Holy of Holies. And this is, this event is. We have in iconography, we have it in the, the feast, the festival celebration every year and in. In the hymns related to it. But the key element of this, that's being brought across to us and that is relevant for what we're talking about tonight is that this is the beginning of that transition."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6373.71,"end":6422.92,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And she's welcomed back there by Zachariah, the, the. The priest who, of course, you know, he, he knows, you know, he, He's. He, he's. He. Well, it happens later. But I mean, he's the Father, the Forerunner. Like, he's got this prophetic place, you know, And I think a lot of the hymns talk about him. You know, the Holy Spirit comes upon him and he welcomes her, you know, to, to do that, which is. I mean, that's the appropriate thing for a priest to do. A priest is there to serve as the one who connects people to God. Right, but in this case, she's coming to be. She's essentially in some ways coming, not quite to take his place, but she's there to fulfill that role. She's there to be. To be the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6423.24,"end":6423.64,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6423.8,"end":6426.2,"speaker":"Fr Andrew Stephen Damick","text":"Because that's where God is going to dwell."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6426.44,"end":6433.84,"speaker":"Fr Stephen De Young","text":"Right. Even though this is the second temple, so technically that's only kind of the place where God is sort of symbolically."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6433.84,"end":6436.2,"speaker":"Fr Andrew Stephen Damick","text":"The place where God is really a Temple. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6437,"end":6478.34,"speaker":"Fr Stephen De Young","text":"Her womb is going to become the place where God will be whiz for nine months, Right. While. While Christ is within it. And so this sort of handoff, right, sort of takes place at this feast and at this and at this point. And so she is being set apart to be God's dwelling place. And so in, in our, our tradition that we've received, the understanding is that the Theotokos, like the tabernacle and like the temple, was purified by the Holy Spirit for this role."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6479.06,"end":6529.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And there's a couple different. There's a couple different views amongst the Church fathers as to exactly when that happened. Some of them, like St. John Chrysostom and some others say that it happens at the Annunciation. So she's purified when the Archangel Gabriel comes to her, and then the Lord is conceived within her womb. But then others say that she gets purified in her mother's womb, but notably after her conception. So after she's conceived in the usual way by her parents, God purifies her in the womb of St. Anna so that she is then prepared throughout her life. So there's variation on this point between some of the Church fathers. That's okay. It's okay. It's all right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6529.92,"end":6533.28,"speaker":"Fr Stephen De Young","text":"Right. They all agree that she was purified."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6533.68,"end":6534.16,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6534.24,"end":6535.84,"speaker":"Fr Stephen De Young","text":"And then it happened where God was going to dwell."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6535.84,"end":6546.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And they all agree that it happens before the conception of the Lord. And, you know, it's just a question of exactly when before that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6546.56,"end":6572.55,"speaker":"Fr Stephen De Young","text":"Right. And someone might ask, why would she need to be purified in. In the womb? Right. Obviously she hadn't committed any sins. Right. In the womb. Right, right. But the response to that, of course, is that, yeah, the goat hair flap of the tabernacle that Moses purified with blood and anointed with oil, hadn't committed any sins either. Right, right, right. That's not what it's about. It's not guilt."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6572.55,"end":6582.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Go go back and listen to our atonement episode for full treatment of that. It's about dealing with the residue of sin in the world."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6582.05,"end":6598.37,"speaker":"Fr Stephen De Young","text":"Right. Existing in the world. Yeah, right. And her being set apart for the special purpose of being. Being purified for this purpose. And, and this isn't just this, this crazy Mary thing that us Orthodox folks came up with, right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6600.53,"end":6604.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There are other, there are other saints that experience this too."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6604.81,"end":6651.68,"speaker":"Fr Stephen De Young","text":"Right, right. So in our, our traditional understanding, right, Saint, Saint John the forerunner, was purified and received the Holy Spirit in his mother's womb. That's why he was able in the Womb to give testimony to who Christ was. When the Theotokos came to visit Saint Elizabeth, the prophet Jeremiah says God set him apart from his mother's womb. Right to be. Right to be the prophet. So this is something we see repeatedly in scripture and in the history of the church, that there are particular individuals who God sets aside and calls to a particular purpose. And when he does that, he comes and he purifies them. And sometimes it's later in their life, like St. Paul on the road to Damascus, and sometimes it's all the way back in their mother's womb."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6651.92,"end":6697.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And you know, like, you know, sometimes you see something like that and you might think to yourself, like, well, well, how come I wasn't purified in my mother's womb and I have to struggle against sin and whatever, whatever, whatever. But number one, that is simply not the way that the world works. But number two, anyone who had this, they usually went through a whole lot of suffering as they fulfilled God's purpose for them, almost all of them. So, you know, it's not necessarily, it's not something you should ask for. You know, if it's something that God gives, then, then you're responsible to that. But it's not something that God gives to very many. There's certain people that he has a particular purpose for them. And so this is what happens."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6698.01,"end":6703.41,"speaker":"Fr Stephen De Young","text":"Right. And you don't necessarily really want to drink the cup. The cup that they drank. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6703.41,"end":6723.49,"speaker":"Fr Andrew Stephen Damick","text":"And aren't there certain cases even where, like, if I remember correctly, we were just reading the readings last night for the feast of the Nativity of the Forerunner. And one of the readings is about Samson. And it doesn't say that he's, you know, from his mother's womb. And yet that didn't turn out well. Ultimately, you know what?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6723.49,"end":6725.01,"speaker":"Fr Stephen De Young","text":"Samson didn't turn out well."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6725.17,"end":6725.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6725.89,"end":6727.09,"speaker":"Fr Stephen De Young","text":"I've never heard this before."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6727.33,"end":6732.77,"speaker":"Fr Andrew Stephen Damick","text":"Big sinner, big time sinner, big time breaker of promises to God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6732.77,"end":6734.93,"speaker":"Fr Stephen De Young","text":"If you see massive Father Andrew Damick."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6735.09,"end":6739.62,"speaker":"Fr Andrew Stephen Damick","text":"Murder slash suicide at the end. Yes, yeah, yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6739.7,"end":6813.19,"speaker":"Fr Stephen De Young","text":"So, right. And so, so this is the. Like we said, this is the beginning of the change. Right. And of course, right, with, with the Theotokos. Right. The Theotokos, the. The great gift she was given by God is that she got to participate in the salvation that comes through her son most fully and completely and directly and personally. Right, right. And so when Christ comes, we have all of this language particularly concentrated in St. John's Gospel regarding Christ being the new temple, not the new temple to replace the second temple, the new temple, like the one Ezekiel prophesied about during the exile. Right, right. That it wasn't that second temple, that it's actually, it's actually Christ when he's born. And so you see that at holy theophany, at Christ's baptism in John 1:32, 34, the Holy Spirit comes and descends upon him and then rests within him, comes to abide in him, the presence of God, comes and stays almost like."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6813.19,"end":6815.79,"speaker":"Fr Andrew Stephen Damick","text":"A Theophanic glory cloud. Yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6819.37,"end":6851.66,"speaker":"Fr Stephen De Young","text":"And then John 1, verse 14, as part of St. John's prologue, he says, literally in the Greek, the word became flesh and tabernacled among us, and we saw his glory and that he was full of grace and truth. Right. So that's the imagery of Christ's flesh being like the, the, the curtains of the tabernacle. Right. And God's presence. God is dwelling among us. Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6851.66,"end":6851.98,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6851.98,"end":6861.06,"speaker":"Fr Stephen De Young","text":"In the flesh of Christ. And he is full of glory. Right. Like the glory, the aphanic glory cloud that came and filled the tabernacle in the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6861.3,"end":6902.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, and, and you know, to double down on his identification as the dwelling place of God as being the temple, In John, chapter 2, verses 19 through 21, this very famous passage where, you know, Jesus says, Jesus answered them, destroy this temple, and in three days I will raise it up. And the Jews then said, it's taken 46 years to build this temple, and will you raise up in three days? And then this amazing editorial comment from St. John, but he was speaking about the temple of his body, you know, that his body is the temple of God in their midst. It's not that building, it's him now."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6903.1,"end":6919.66,"speaker":"Fr Stephen De Young","text":"Right. And Christ isn't just the new temple, but he's the final and eternal temple. Right. One that Ezekiel talked about. And so that's why, also written by St. John in the Book of Revelation, chapter 21, in the New heavens and the new earth, there's no temple because the Lamb is there."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6921.16,"end":6931.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. And if you want to read that Ezekiel reference, by the way, it is literally the last nine chapters of Ezekiel, chapters 40 through 48. And it's, it's, it's stunning stuff."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6932.36,"end":6932.84,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6932.92,"end":6934.04,"speaker":"Fr Andrew Stephen Damick","text":"Really, really, really beautiful."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6934.04,"end":6941,"speaker":"Fr Stephen De Young","text":"And it's talking about Christ. Dispensationalist friends. I, I don't want to pick on our dispensationalist friends too much tonight, but."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6941.8,"end":6944.36,"speaker":"Fr Andrew Stephen Damick","text":"Well, we're talking about temples, and stuff has to happen."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6944.36,"end":6970.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, bound to happen. So now. Oh, and so the other place where this language of a temple is used, of course, related to the holy spirit is St. Paul. Right, right. And he talks about this at a couple points in First Corinthians and First Corinthians 3:16 and 17 and 6:19, where he says that our body is the temple of the Holy Spirit. Right. So wait, wait, yeah."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6970.85,"end":6977.72,"speaker":"Fr Andrew Stephen Damick","text":"That's not just about like you eat, right. And don't smoke or drink. Your body is a temple. Oh, okay."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6977.72,"end":6983.32,"speaker":"Fr Stephen De Young","text":"No, I'm. I'm more on the side of the meme that my body is a temple. It's broken down, abandoned and decrepit."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6989.32,"end":6995.64,"speaker":"Fr Andrew Stephen Damick","text":"Not one stone shall remain upon another. So. But."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6996.2,"end":6996.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6996.84,"end":6997.96,"speaker":"Fr Andrew Stephen Damick","text":"Yalls, Yalls."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":6997.96,"end":7011.68,"speaker":"Fr Stephen De Young","text":"Body is a temple of the Holy Spirit. Spirit. Right. Yeah. And this isn't this sort of separate, independent thing. Right. Where. Where there's now a whole bunch of temples. Right. Not just Christ."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7012.24,"end":7012.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7012.6,"end":7013.12,"speaker":"Fr Stephen De Young","text":"It's."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7013.36,"end":7014.4,"speaker":"Fr Andrew Stephen Damick","text":"It is just Christ."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7014.56,"end":7029.2,"speaker":"Fr Stephen De Young","text":"Right. As St. Paul says in Galatians 3, verse 27, if we've been baptized into Christ, we've put on Christ. That's why St. Paul says in Christ after just about everything. Right. He just adds it on to almost every sentence."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7029.2,"end":7029.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7030,"end":7037.72,"speaker":"Fr Stephen De Young","text":"That we, our bodies have the Holy Spirit in Christ. So Christ shares his templeness or templitude. Right. With us."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7037.72,"end":7038.48,"speaker":"Fr Andrew Stephen Damick","text":"Templosity."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7038.64,"end":7049.56,"speaker":"Fr Stephen De Young","text":"Yeah. With us. Right. If we are in Christ, then we are functioning as part of. As a member of his body. Right?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7049.56,"end":7054.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because the temple where his nexus of potentialities."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7054.92,"end":7062.28,"speaker":"Fr Stephen De Young","text":"Right, right. And so now in our Pentecost episode, we're going to talk about Pentecost."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7062.52,"end":7063,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7063.56,"end":7065.8,"speaker":"Fr Stephen De Young","text":"But there's a little bit of build up to that."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7066.92,"end":7081.49,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. Yes, yes. We prepare to prepare to prepare. See, our podcast really works like the orthodox liturgical year. You know, it's just, it's a year. Every episode or a major. Yeah, yeah. Major liturgical season."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7081.73,"end":7103.81,"speaker":"Fr Stephen De Young","text":"Yeah. There's a reason for this, and only a few people out there will know what I'm talking about. But I had too much Yale school preaching in my background, so that's how you end up structuring things like this. But so, yeah, me saying now we're going to talk about Pentecost was actually sort of like, let us complete our prayer unto the Lord. Like, we still got a little ways to go."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7104.29,"end":7208.95,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. Okay. Luke chapter 24, one of my favorite chapters. Because it's about eastern Pennsylvania. No, it's about the. This, this passage. So Luke 24. Towards the end, Christ meets with two disciples as they're walking along the road. Saints Luke and Cleopas. We talked about this a couple of weeks ago. A few weeks ago with the Post, post resurrection appearances of Christ. This is Christ on the road to Emmaus. And why is this important? It's on the road to Emmaus, Emmaus in particular. Right, right, exactly. So we talked earlier about the Maccabean revolt, so that is successful at a battle that took place at Emmaus. So Emmaus is like a, a famous battlefield in, in this time and place. So like the example that, you know, from our time again, to bring it back to Pennsylvania, if someone would say, you know, they were on the road to Gettysburg, you're like, oh, Gettysburg, yes, yes, I remember what happened there. And that's exactly the same thing. Like Emmaus is this famous place because of the battle that happened there. And so everyone would, would see when they, when you would read that. Right. In Luke's Gospel, what you're getting then is this reference to this battle that was fought and won there that led to then the temple being rededicated after it had been desecrated. So that's all part and parcel of on the road to Emmaus."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7209.83,"end":7225.36,"speaker":"Fr Stephen De Young","text":"Right. And so people, people miss this a lot because they say they think this is the only place Emmaus is mentioned in the Bible. But if you go and get your 1611 King James and turn to first Maccabees. Right, which is in the 1611 King James."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7225.36,"end":7229.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I have a replica of, I have, I have a replica of it here in my studio."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7229.6,"end":7248.92,"speaker":"Fr Stephen De Young","text":"Right. The battle of a. This is the climactic battle where the, the Selucans are defeated and, and, and driven out. And so, yeah, so this is what's being conjured up here is not just the battle, but the aftermath of the battle and the idea of the rededication of the Temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7249.48,"end":7249.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7249.84,"end":7257.08,"speaker":"Fr Stephen De Young","text":"And the proof that St. Luke has the rededication of the Temple in mind is how he ends his Gospel."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7258.52,"end":7258.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7259,"end":7264.52,"speaker":"Fr Stephen De Young","text":"The last two verses of St. Luke's gospel, Luke 24, 52 and 53."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7265.03,"end":7273.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they worshiped him and returned to Jerusalem with great joy and were continually in the temple blessing God."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7274.47,"end":7284.71,"speaker":"Fr Stephen De Young","text":"Right. And so you may notice that, you know, this is volume one, when you go to volume two in the book of the Acts of the Apostles, they're not hanging out in the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7286.23,"end":7286.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7286.95,"end":7316.41,"speaker":"Fr Stephen De Young","text":"When St. Luke narrates the Ascension, again, he doesn't describe them going back to the Temple. Right. So he's not that, you know, he's making things up one time or the other. It's just what he's choosing to focus on. So why does he choose to focus on the Temple here at the end of The Gospel of Luke, it's to bring out this dynamic. Right. Christ has just won this victory. Right. That's what the Gospel is. It's the report of a victory book from Father Andrew coming soon. Yes, thank you."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7316.57,"end":7320.71,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Look, I have been selling your book."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7320.71,"end":7322.79,"speaker":"Fr Stephen De Young","text":"A lot, so I expect a little."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7322.79,"end":7323.99,"speaker":"Fr Andrew Stephen Damick","text":"Bit in return here."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7325.03,"end":7328.39,"speaker":"Fr Stephen De Young","text":"I haven't said anything negative about it. No, no, it's good, it's good."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7328.39,"end":7330.31,"speaker":"Fr Andrew Stephen Damick","text":"I feel like I've been doing a pretty good job, actually."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7330.63,"end":7336.51,"speaker":"Fr Stephen De Young","text":"Yeah, I think my name's in the front, so it's just my narcissism that's causing me to push it a little bit."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7336.51,"end":7341.83,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Right. A report of a victory. Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7341.83,"end":7343.91,"speaker":"Fr Stephen De Young","text":"Right. So this victory has happened."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7344.07,"end":7344.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7345.55,"end":7363.23,"speaker":"Fr Stephen De Young","text":"And so the victory is being compared to the victory in Emmaus. And then what happens? The temple is rededicated. So what we should be expecting as we conclude, close the back cover on volume one and open the front cover on volume two is, oh, now I'm going to read about the rededication of the temple."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7363.71,"end":7364.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7364.75,"end":7384.07,"speaker":"Fr Stephen De Young","text":"And that frames then what we have at the beginning of the Book of Acts. And if you remember the atonement episode, we talked about how Christ's atonement purifies not just an itty bitty physical space, but the whole world."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7384.31,"end":7422.64,"speaker":"Fr Andrew Stephen Damick","text":"The whole world, Right. Which is, which is illustrated then, for instance, by the fact that you've got Cornelius, this, this gentile centurion who receives the Holy Spirit even before he's baptized. And then also the, you know, the incident where Peter is told to eat these animals that previously been unclean. And the. What God says to him is, don't call anything unclean that God has made clean. God has made it clean. And how did it become clean? By the atonement that Christ accomplished in his passion, death and resurrection."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7423.19,"end":7478.35,"speaker":"Fr Stephen De Young","text":"Right. And so Christ's blood has now purified the whole cosmos. Right. And so now when individual humans receive the laying on of hands and, or anointing the Holy Spirit, the Theophanic glory cloud, the presence of God comes and fills them, right? As a. A temple of God. And this starts with the apostles on the day of Pentecost, right. When. When you notice how the wind and the fire come into the room in which they're sitting. Right. So St. Luke even brings in that spatial idea to where the apostles are. Right. But the Spirit comes and fills not that room, making that room the new temple, but fills them. Yeah, Right. Kills them."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7478.99,"end":7670.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And yeah, I think this might be the. This, this might be peak, Lord of Spirits episode structure here because literally we're now finally getting to what, what Pentecost is, Right? Right. This may be the worst offensive offense. Offense of all of that, that pattern. But I, I think it's to get there, we had to, we had to look at all of that, right. So the Holy Spirit descends into them and. But there's like, there's aftermath now, right? So just as with the presence of God in the tabernacle in the temple, you had to do the purification, you had to do, you know, everything the right way in order to prepare to be in the presence of God or else you could die again. Death by holiness. Now there are things that happen connected to the fact that the apostles and the church are now effectively the holy of holies. Right? So you know, the classic example, and this was one that always kind of puzzled me when I was a kid, I was never quite sure what to make of it. You've got, you know, they're still in Jerusalem and all the disciples, you know, all the Christians are pooling their stuff so that no one has to be in want, right? Common. Yes, yes, yeah. But it's voluntary. But they, you know, so people are selling property and they're putting, pooling their money so that everyone could be, no one has to go hungry. And you've got this one couple, Ananias and Sapphira, who decide to sell their property and instead of giving all of it over to the apostles for the help of the poor, they give only part of it. But then they lie about giving only part. Right? So first Ananias lies directly to St. Peter and then he dies and then he's taken away. And then his wife comes in, not knowing that he's dead. And St. Peter asks her the same question, you know, did you give it all? And she says, oh yeah, this is all of it. Which is as a sidebar is an interesting note that she is, as a Christian, she, as a Christian woman, she is answering for herself. She's not simply being lumped in with whatever her husband happens to say. Like she's actually responsible for herself, which is a very different role for women in the ancient world, you know, and, and she lies also and, and then also dies. And you know, when I was a kid, I read that, I'm like, that seems a little extreme, Lord, you know, like, like, I mean, not that I have any business second second guessing, you know, God's judgments, but, but understanding it in terms of this question of death by holiness. They are literally bringing an offering to God, but doing it in a bad way and lying. That's why they die."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7671.07,"end":7697.96,"speaker":"Fr Stephen De Young","text":"And St. Peter says, you have not lied to men, but to the Holy Spirit, but to the Holy Spirit. The Holy Spirit cannot long contend with human wickedness. And so Ananias and Sapphira are the Nadab and Abihu of the New Covenant. It follows that St. Luke follows the same pattern here at the beginning of Acts as the dedication of the tabernacle. And so then what comes in terms of the Christian life? Right. They serve as this kind of warning."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7698.84,"end":7699.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7699.24,"end":7740.93,"speaker":"Fr Stephen De Young","text":"And so if we are members of Christ's body, and therefore our body is the temple of the Holy Spirit and the Holy Spirit is in our midst, and Christ is in our midst when we gather in which worship, then rather than the commandments and the way that the Torah works in our life being like the Old Covenant where it was about purifying this physical space, this external physical space and maintaining its purity in these concentric circles, now it's gone interior. Right, right. And so that's why the Christian life becomes about repentance. It comes about cleansing and purifying and rededicating ourselves. Yeah. Not a space."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":7742.13,"end":8066.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah, It's. I mean, it's. I don't know the right word to use. It's. But it's really powerful to look at what's going on in the Old Testament there with the tabernacle and the temple and realize that actually now applies to us as persons because we are. We fulfill that role now in as much as we are in Christ. Yeah, yeah. All right, well, let's give some final comments. There's. The first place I want to start is with that final point. Right. Which. That when we undertake the fasting, the prayer, the repentance, the asceticism, all of these things that are part of orthodox Christian life. You know, when we undertake these things, it's, it's, it's. I think often we can receive that stuff as like, there's one way which is people like, oh, it's this burden I have to have because I'm orthodox. Or sometimes people take it as being like a, you know, sort of like a hyper macho thing, like, oh, look at us, we're like the Marines of Christianity. We fast, we pray, we long services, like. Right. You know, those ways of looking at it. But fundamentally, those are kind of almost materialist ways of understanding these spiritual practices. Right. They are disciplines. But a discipline has a purpose. It's not merely just to be disciplined. Right. The discipline has a purpose, and the purpose is to Prepare us to be in the presence of God. And when we don't do that, then we degrade because it's not good for us to be in the presence of God. And sometimes that degradation can get so extreme and our sin becomes so extreme that we have to be removed from communion until such time as we are prepared to return again. Right. So it's, it's, it's, it's purification so that we can worship God, so that we can be in his presence, you know, so that we can be within, within the, the, the, the within the temple. Right. We talked earlier about what would orthodox church life look like if it actually functioned like the tabernacle and temple and how separated we, we would be from God. Now we have the opportunity to be right there in the place where the, where the sacrifice is offered. We have to prepare ourselves to do that. That's what this life is for. It's not just sort of like self discipline or it's not self help or becoming better person. It can do those things, but that's not what it's for. And the other side I wanted to mention in my final remarks is that with the descent of the Holy Spirit into the church and we being in Christ and being his body, being now the temple of the living God, then what that means is the task that Adam and Eve were given back, way back in paradise where we started, has now been restored to us and we've been given the ability to actually take it further than they could have when they were first created because of their immaturity. And that means that our task as Christians is not simply to become better, but rather to take paradise into the world, to expand the temple, to bring. Because when someone becomes a Christian, when they are baptized into Christ, then they are then also part of the temple of the living God. They become know, pillars of the temple of the living God. Right. So our task is to churchify the world. And we do that not only by the, the act of evangelism, although that is absolutely critical. Right. Evangelism is a message. It's the, it's the announcement of Christ's victory, but it's also to, to take on this role of, you know, be fruitful, multiply cultivate the earth. And that doesn't just mean make sure you have a well mowed backyard. It means bringing God's love and justice and compassion to the people around you. Right. This is what the task is. This is how we bring the presence of God and his making things right and putting things them in order. That's how we participate in that. So this is God's act. It's God. God is the one who expands Eden. But it's our task to be the instruments by which that happens. So there is both an internal side to it in terms of our own attention to our purification to meet God, to worship God, to commune with God. And then there's also this external outward initiative, taking outgoing side to it as well, where we are to serve those around us, to sacrifice ourselves for those around us so that they too can participate in this same life. That's. That's its purpose. All right, what you got for the end, Father Stephen?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8066.85,"end":8071.73,"speaker":"Fr Stephen De Young","text":"Okay, so humans are like tardises."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8073.01,"end":8073.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8074.13,"end":8116.31,"speaker":"Fr Stephen De Young","text":"They're bigger on the inside. And I want to focus a little on. We already brushed on this a little bit. But the Holy Spirit comes and writes the law, writes the Torah in our hearts. And this is how the New Testament expresses. And the Old Testament, prophesying that it would happen, talks about that internalization of the law that we were talking about right at the end. And despite the fact that we've probably all heard or read that a thousand."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8116.31,"end":8116.71,"speaker":"Fr Andrew Stephen Damick","text":"Times."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8118.47,"end":8214.37,"speaker":"Fr Stephen De Young","text":"I don't know how much it has sunk in for us, because we still have this focus on the outside and on the external and on our interactions out there with the world. When we think about commandments, whether we're thinking about the ten Commandments of the Old Testament, we're thinking. Thinking about the commandments of Christ, we're thinking outside. But what this internalization means. And you see it reflected everywhere in Christ's teaching in the Gospels, right? Yes. If you have yeast in your house and you don't contain it and treat it properly, it will infect things and infest things and can poison your kids and bad things will happen. But if you allow a little leaven into your heart and your soul and your mind. Mind, it will spread and it will infect everything and it will destroy you. The internalizing of that commandment is far more important than the externalizing of it. And what Christ communicates to us in the Gospels. We read a Gospel on Sunday for Pentecost where Christ says, talking about the coming of the Holy Spirit, that rivers of water will flow from your belly, Right? Which is a weird promise to receive. Most of us try to keep that from happening. But what he's talking about are the rivers in paradise, the rivers in Eden that flowed out of Eden to water the whole earth."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8215.25,"end":8215.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8216.93,"end":8356.46,"speaker":"Fr Stephen De Young","text":"All that external stuff, what we do in the world in terms of the Commandments, how we relate to people how we relate to the world around us, how we see the world and interact with it, all of that flows out of what's going on inside. And so if we don't keep what's inside of us clean and pure and dedicated to Christ and to his service, then everything that flows out of us is going to be tainted by whatever is wrong inside. You can't get good fruit from a bad tree, rotten tree. And so I think what we need to be reminded of maybe is that keeping the commandments of Christ, living the Christian life, always begins by going back into the paradise that's inside of us, that the Holy Spirit is put there when we received him within ourselves and maintaining that space with all the zeal that the Levites and the priests of the old covenant had, purifying ourselves of sin, rooting it out, finding it, driving it out, repenting of it, repairing what's wrong, confessing, receiving forgiveness and cleansing and purification. And once we maintain that, all of these other things will flow out naturally. The love, the joy, the peace, the patience, the kindness, the goodness, the faithfulness, the gentleness, the self control, all the fruits of the spirit will blossom forth when we've done the hard work of getting into the mass and the brokenness and the dirt and the grime and the ugliness that's still lingering around in different places inside of us. So we talk a lot, and Father Andrew just talked about, and rightfully so, our need to go out into the world. But we also need to not forget to go inside of ourselves and take care of the temple, care for the temple, purify and rededicate the temple that lies within us. And so now I have a question for Father Andrew."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8356.62,"end":8357.34,"speaker":"Fr Andrew Stephen Damick","text":"Oh, boy."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8358.14,"end":8366.7,"speaker":"Fr Stephen De Young","text":"If I sing Spring up, oh, well, will you yell the splish splash in the background?"}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8368.46,"end":8375.17,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that is a very dim, dim memory in a very shriveled part of my brain."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8376.45,"end":8377.57,"speaker":"Fr Stephen De Young","text":"Glad to bring it back."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8377.81,"end":8404.57,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right, well, on that note, that is our show for tonight. Thank you very much, everyone, for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you either via email at Lord of spirits ancient faith.com or you can message us at our Lord of Spirits podcast Facebook page. We we do read everything, but we can't respond to everything, but we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8405.37,"end":8412.09,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8412.57,"end":8423.61,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, like our page join our discussion group, leave reviews and ratings everywhere, but most importantly share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8423.94,"end":8434.98,"speaker":"Fr Stephen De Young","text":"Or even if you just think they'll love it, go ahead and share it. And finally be sure to go to ancient faith.com support and help make sure we and a lot of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8435.38,"end":8438.1,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you always."}
{"episode_id":"LOS - #022 - 2021-06-24 - An Immaculate Dwelling Place","start":8452.27,"end":8489.31,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
