{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":3.04,"end":59.02,"speaker":"Fr Andrew Stephen Damick","text":"He will be a staff for the righteous, with which for them to stand and not to fall and he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5 the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":62.14,"end":75.82,"speaker":"Fr Stephen De Young","text":"What if Christians don't need to put brackets around certain supernatural beliefs such as God, miracles or even the Incarnation itself, and otherwise believe and behave as though what we see and hear is all there is?"}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":76.06,"end":84.38,"speaker":"Fr Andrew Stephen Damick","text":"What if materialism, the belief that only the 3D world of the senses exists, is incapable of accounting for all the actual evidence and knowledge that we have?"}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":84.38,"end":93.88,"speaker":"Fr Stephen De Young","text":"What if God's presence and the presence of angels and saints is is in fact integral to the very character and functioning of creation itself and not an exception?"}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":93.96,"end":109.88,"speaker":"Fr Andrew Stephen Damick","text":"Yahweh, our true God worthy of worship, is called the Lord of Spirits. In the Anakic literature that informs the New Testament and is deeply linked to the Old, this title is a direct parallel to the Old Testament title of Lord of Hosts, also rendered Lord of Sabaoth and sometimes translated Lord of Armies."}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":109.96,"end":122.5,"speaker":"Fr Stephen De Young","text":"These hosts are the angelic spirits, but also the human beings who have joined the heavenly hosts, the saints. This world is in fact suffused with their presence, appointed to many tasks by God Himself."}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":122.58,"end":130.02,"speaker":"Fr Andrew Stephen Damick","text":"This program will explore this biblical patristic liturgical understanding of the Christian faith. Our 21st century modern world has great need of it."}
{"episode_id":"LOS - #001 - 2020-09-10 - Trailer","start":130.02,"end":138.34,"speaker":"Fr Stephen De Young","text":"We encourage you to listen every second and fourth Thursday of the month to call in with your questions and insights and to share this message of hope with others."}
