{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":0.32,"end":64.95,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":68.31,"end":200.15,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. It is good to be with you tonight everyone. I am Father Andrew Stephen Damick and I am in Emmaus, Pennsylvania. And with me is my co host father Stephen DeYoung who is broadcasting from the middle of Cajun country in Lafayette, Louisiana. And if you are listening to us live, you can call in at 855 AF radio. That's 855-237-2346 and we're going to get to your calls in the second part of today's show. So tonight we're going to be talking about Mary the Theotokos, the mother of Jesus Christ. Most Christians love and venerate her, or while some prefer to marginalize her as much as possible, and some just don't know what to do with her, assuming they see her as important at all. Most who love her point to a natural affection and affinity for her based on love for her son Jesus Christ and how she directs us to him. And they may also add something about the Church's long experience of her intercessions and care, often miraculously over the centuries. And while all of that is true and beautiful, it does not root very deeply what the Church teaches about the Theotokos and how the Church interacts with her. So those who are unconvinced remain unconvinced, and those who are convinced may not have very deep roots when it comes to their knowledge of her. What many don't seem to realize, though, is that it turns out that the role and veneration of the Virgin Mary, the Theotokos, is not established by hints in the New Testament or experiences from subsequent church history, but rather finds foundations in the very heart of the Old Testament experience of God, that her place is intimately connected with the lordship of her son, Jesus Christ. I'm getting ahead of myself, though. We can't jump right to that. Instead, we have to go all the way back to Genesis, to the creation of man and his placement in the paradise of Eden. So, Father Stephen, take us to Eden."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":201.19,"end":213.67,"speaker":"Fr Stephen De Young","text":"Yeah, let's begin at the beginning, because it's a very good place to start indeed. And I feel like at some point we should record the voice of Steve saying, last time on Lord of Spirits podcast."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":213.67,"end":217.19,"speaker":"Fr Andrew Stephen Damick","text":"There we go. So, Steve, if you're listening, take notes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":217.35,"end":278.47,"speaker":"Fr Stephen De Young","text":"And play clips, you know, from the last couple shows. But in the last couple of shows, two shows ago, we kind of mentioned, when we were talking about sort of the saints in glory, we mentioned the idea of them imaging God. We talked a little bit more in our last episode about giants, about how the Nephilim were sort of imagers and imaging, and that's how they were sons to the demonic powers bringing their works to fruition in the world. And so what we're going to do tonight is really take a deep dive into what that means and how that works for. For believers and for saints and for Christians. And we're going to be using the Theotokos as Exhibit A. But we have to start if we're going to talk about the image of God, as you said, we have to talk about man being created in the image of God in the first place."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":278.79,"end":279.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":279.51,"end":286.71,"speaker":"Fr Stephen De Young","text":"And. And what that means, because there's a lot of theorizing about that."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":288.15,"end":289.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":289.03,"end":311.28,"speaker":"Fr Stephen De Young","text":"Popular books and even scholarly books, and even going back into church history, where man's reason is what makes him in the image of. To be in the image of God or language or these things. And then you get into these protracted discussions because we find out, hey, guess what? There's a bunch of species of animal that have language or."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":311.36,"end":327.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Are they in the image of God? Yeah. Or, you know, then. Then maybe we should eventually do a show on. On this. You know, sometimes people speculate, well, if there's, you know, if there's alien life out there and. And they're sentient, does that mean they're in the image of God? You know?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":328.31,"end":342.59,"speaker":"Fr Stephen De Young","text":"Yeah. What, what level of sentience would they have to have? Right. Like if you find a dog on another planet. Well, maybe not, but where does it cross the line into being human level? Right. If that's your. If that's your view of it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":342.59,"end":344.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Attributes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":344.95,"end":372.84,"speaker":"Fr Stephen De Young","text":"And. And that's. I mean, that that view is problematic for a whole bunch of reasons, because as soon as you start assigning it to qualities, that opens up, historically, that has opened up the ability for sinful humanity to then marginalize certain people, people's types of people who may not possess those faculties as fully as others."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":373.32,"end":374.52,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":374.76,"end":392.42,"speaker":"Fr Stephen De Young","text":"So an unborn child doesn't have reason or language. Right. The disabled sometimes don't have whatever those things are. And historically, people have used that to try and argue against the humanity of. Of other humans."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":392.66,"end":487.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it betrays this kind of biological understanding of what human beings are. You know, not that biology has nothing to do with what we are, but. But it's sort of. It's reductionist, you know, and it's missing a lot of what's going on in Genesis, especially in paradise, you know, that, like, I remember, you know, I know I often say on this show, when I was a kid, I thought, whatever, whatever, whatever. And. But it turns out that a lot of the things that I thought when I was a kid are in fact the sort of generic version of what a lot of people believe about things. So, like, what do people say? What was the Garden of Eden like? Right. Well, sort of this tropical paradise. Although there was one. There is actually. There's a. The Greek Orthodox Cathedral in Worcester, Massachusetts, has paradise up in its dome. But a lot of it, you know, it does look very tropical. But then there's parts, if I remember correctly, that actually has, like, pine trees and stuff. So there's, you know, what. What is. What is paradise? And a lot of people think of paradise as being, you know, sort of tropical resort. Right. And, you know, Adam and Eve are kind of walking around in this beautiful tropical. And we use that word, paradise, don't we, to. And. And just, you know, it's just beautiful and there's all kinds of food available and you don't have to work and it's like this extended vacation. Right. But that's not actually the image that Genesis gives."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":487.14,"end":493.54,"speaker":"Fr Stephen De Young","text":"Right? Yeah. And it wasn't paved over, nor did they put in a parking lot. But. Yeah, so."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":495.78,"end":498.42,"speaker":"Fr Andrew Stephen Damick","text":"See, that's a pop culture reference I did get. Okay."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":501.22,"end":507.86,"speaker":"Fr Stephen De Young","text":"When you mentioned pine trees, I was going to throw in C is for conifer, but no one would get that one. So. But."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":509.9,"end":510.18,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":510.18,"end":556.42,"speaker":"Fr Stephen De Young","text":"So the difference between a human and a chimpanzee is not a handful of genes. Yeah, that's not. That's not how Genesis presents it. And so this is where we have to go back to the creation of man and why. The big. The big thing is why humanity was created. And so, yeah, when we go back, the creation of humanity, of course, is the culmination of the creation account in Genesis 1. Technically, it bleeds over into the first couple verses of Genesis 2, but everybody shorthands it as Genesis 1. And so we get this picture in Genesis 1, and we're going to talk about it in a couple different ways because there's a lot going on there."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":556.9,"end":557.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":558.74,"end":562.96,"speaker":"Fr Stephen De Young","text":"To say the least. And we're not going to talk about how long ago it was. So. Sorry."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":562.96,"end":566.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sorry, everybody. This is not that show."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":567.04,"end":590.08,"speaker":"Fr Stephen De Young","text":"Yeah. But so one of the sort of trajectories through it is that much of the. The language that's used over the course of Genesis 1 regarding the creation of the world is language that you also find in ancient Near Eastern accounts of the building of temples."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":590.63,"end":601.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. This is cool stuff. Listen to this, everybody. This is really cool. This is. You're gonna. Again, you're never gonna read the beginning of Genesis the same way after we. With the. I love this part."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":602.23,"end":611.27,"speaker":"Fr Stephen De Young","text":"So. Sorry. That's okay. So the construct. The ancient near east, these accounts of the constructions of temples. I'm not talking about, like the contractor's diary."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":611.51,"end":611.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":611.91,"end":667.74,"speaker":"Fr Stephen De Young","text":"Like day three, we put up the studs, you know, Know. But there. There are these texts about the constructions of temples where the constructions of these, especially the ancient temples, were seen as sort of these mythic events that the God whose temple it was took part in with the people building it there. So there are these accounts. Sometimes the temples almost build themselves. Right. So there's. Yeah, this is. That's the kind of text I'm talking about, though, to give you an idea. So these are. These. Are these important myths in the sense of stories that people participated in. These temples would be dedicated and rededicated ritually with celebrations that participated in these stories and reenacted these stories."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":668.3,"end":668.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":669.26,"end":687.62,"speaker":"Fr Stephen De Young","text":"But so once the temple was built. Right. In terms of the actual construction. Right. And these temples took the form. Gods were believed in the ancient near east to live on mountains and in."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":687.62,"end":692.7,"speaker":"Fr Andrew Stephen Damick","text":"Gardens or sometimes gardens on mountains."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":692.86,"end":694.14,"speaker":"Fr Stephen De Young","text":"Right. That's what I mean. Yeah, Both."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":694.14,"end":694.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":694.94,"end":698.39,"speaker":"Fr Stephen De Young","text":"There's a garden at the top of the mountain, and that's where. That's where the God lives."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":698.39,"end":717.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which. Which in many ways explains why it is that you can find temples and churches, I mean, which are just temples to the. To Yahweh. Right. Often. As often as possible, built up on hills or in the highest place of, you know, a city."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":717.83,"end":719.03,"speaker":"Fr Stephen De Young","text":"Right, The Acropolis."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":719.03,"end":803.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right, exactly, exactly. You know, that. And I've sometimes heard it explained like, well, that's just so they're, you know, they're visible from everywhere. It's like. Well, not exactly. It's actually because of this ancient belief about sacred geography that gods live on high places. I mean, you think in Greek religion the gods live on Mount Olympus. Right. And so there's this participation with human made temples in this sense that the divine resides up on top of mountains or in gardens. And even within, like, even within an Orthodox church, usually the altar area is physically higher. So even if it's not built on, even if the church isn't built on a mountain, there's kind of a mini mountain of sorts within the church. Right. That the altar itself at least is sort of is elevated above everything else, if at all possible. Which is why, you know, when I've gone to, you know, not usually Orthodox churches, although I've been in one or two Orthodox churches where this was the case, but some other kinds of churches that are actually shaped more like theaters where you get a raked house, so to speak, you know, where all the pews are and then the lowest point in the place is where the worship is being centered. That's just, that's kind of messed up."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":804.76,"end":818,"speaker":"Fr Stephen De Young","text":"Yeah, well, and I know people love when we do this, the relationship between, for example, Greek tragedy taking place at a low place and its connection to ritual is a discussion for another time."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":818.24,"end":822.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, we're gonna, yeah, we will, we will get to that in the future."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":823.36,"end":831.04,"speaker":"Fr Stephen De Young","text":"But, but so this is why you have ziggurat and pyramid structures all over the place. Because it's a, it's a man made mountain of God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":831.52,"end":832.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":833.6,"end":855.02,"speaker":"Fr Stephen De Young","text":"And then, so mountains are places that are inaccessible and gardens, I mean, if you know anything about the Middle East. Right. Lush gardens are, are not common, especially not naturally occurring ones."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":855.42,"end":855.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":856.3,"end":868.62,"speaker":"Fr Stephen De Young","text":"But so, so this would be the place where, where the gods, the gods enjoy their life. And so this imagery is taken up obviously in Genesis with the whole idea of the Garden of Eden."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":869.53,"end":869.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":870.49,"end":917.74,"speaker":"Fr Stephen De Young","text":"And it continues throughout, throughout the scriptures. Additionally, in the ancient near east, gods typically lived in tents on top of those mountains. And so the Tet. We again, we'll discuss this at some point. The tabernacle and Moses entering the tabernacle on top of Mount Sinai and Saint Peter talking about the tabernacles at the transfiguration on Mount Tabor. But that'll be in the future. But so this temple imagery carries on. And so when Solomon builds the temple, there's all of this garden imagery around it. So in Genesis 1, we have this construction of the temple. And in these temple construction accounts, sort of the last step is that the. The image of the deity, what we would call the idol, which was."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":917.74,"end":918.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":918.46,"end":922.14,"speaker":"Fr Stephen De Young","text":"Seemed to be a body that was created for the God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":923.23,"end":923.63,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":923.87,"end":946.39,"speaker":"Fr Stephen De Young","text":"Would be brought in and installed at the center. And then they had a ceremony called the opening of the nostrils of the. The image, the idol in which they believe the spirit of the God would come in to inhabit it and be sort of trapped there. Yeah, so."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":946.39,"end":952.38,"speaker":"Fr Andrew Stephen Damick","text":"So what. I mean, what would that ceremony look like? Like, what would they do to make that happen?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":952.62,"end":963.02,"speaker":"Fr Stephen De Young","text":"Well, there were. There were a whole series of things beyond just the physical installation of. Would be dressed in certain ways."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":964.86,"end":965.18,"speaker":"Steve","text":"Not."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":965.18,"end":970.58,"speaker":"Fr Stephen De Young","text":"All that unlike the vestments of the high priest later in Exodus. But again, that's a topic."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":970.58,"end":971.66,"speaker":"Fr Andrew Stephen Damick","text":"Interesting time. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":971.66,"end":999.52,"speaker":"Fr Stephen De Young","text":"But it would be dressed. They would bring food for it. Because the trade off was once you had the God sort of trapped there in the. In the image, you then would come and take care of the God by feeding it, changing the clothing, caring for it. Right. And then in return, you would. You would then expect it. Through doing the rituals, you would expect that spirit to do certain things for you."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":999.76,"end":1000.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1001.76,"end":1006.88,"speaker":"Fr Stephen De Young","text":"To account for that. And so the ritual of the opening of the nostrils was sort of the beginning of that."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1007.41,"end":1007.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1007.61,"end":1025.17,"speaker":"Fr Stephen De Young","text":"So the first dressing, the purification of the space, usually with incense and a lot of blood and purification of it, and then that would then allow. Allow the spirit to enter in."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1025.49,"end":1074.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. Right. And. And then the relationship of that to what's happening in Eden is exactly sort of reversed. Right, right. That instead of mankind building a temple or a garden and putting his idol in it and breathe and, you know, opening the nostrils to trap the God inside the idol. Inside the idol, you get. God builds paradise on a mountain. You know, the. You know, Yahweh, the Father, son, holy spirit builds this, puts his own image into it, which is man, and then breathes the breath of life into him and establishes him there to. To image him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1075.34,"end":1075.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1075.82,"end":1171.62,"speaker":"Fr Andrew Stephen Damick","text":"So it's. So it's. It's. Yeah, exactly. So. So, you know, idolatry rather than. So, you know, Genesis is not imitating idolatry. Rather, what's happening is, is that idolatry is actually reversing what happened in. In. In Genesis, you know, that. That. It's a kind of inversion, you know, that idolatry is inversion of of God's creation of man, you know, and so instead of God creating man for himself as his own image, you get man creating an image to trap a God for his benefit. You know, the, the other way, it's, it's very selfish, very man centered. And. And I remember when I first learned about this, again, it blew me away, and I thought, wow, I never saw that happening there. But it's interesting, the kinds of details that are there when you actually then look at it. The idea of God shaping man out of the dust of the earth and breathing into him. All of these details make way more sense within this context of how ancient peoples understood the way that a temple was set up and what you did in it when you were there. You know, and of course, again, like another detail that instead of mankind having to dress an idol and take care of it and feed it, you have God taking care of his image, feeding him, you know, providing for him. It's exactly the opposite of idolatry. Idolatry is the mockery of the creation of man in Genesis. So really cool. Really, really cool."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1171.62,"end":1201.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That it's. Yeah, it's completely inverted and, and turned on its head. Yeah. The idea of pagan religion, the idea is here are the rituals you do and the things you do to make get the spirits to do what you want them to do or need them to do. Right, right, right. As opposed to God creating an image for himself within his creation to do certain things for him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1202.03,"end":1202.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1204.27,"end":1266.77,"speaker":"Fr Stephen De Young","text":"And so, yeah, that's a, that is a, that is a complete switch. And this is, this is what's behind this understanding of idolatry is what's behind most of the critiques of idolatry. While all of them in the Old Testament and most of them outside the Old Testament, that come from a Jewish perspective. Right. What's being critiqued is it's like, okay, so you went and you cut down a tree and you took some pieces of that tree and you built a fire and cooked food, and you took some other pieces and use them to patch up your roof. And then you took another piece and you carved a God out of it. And then you took it and you brought it to this temple and put it there, and you had to, you know, put nails and fasteners to make sure it wouldn't tip over. And you have to go in there and dress it and. And you have to go in there and feed it, and you have to go in there and take care of it, because it can't do any of those things for itself. Right. This spirit that you're worshiping, but now you want that spirit to control the weather for you, right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1267.25,"end":1291.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting how kind of blatantly, kind of in your face, that is. Right. Like, look, pagans, your God is just such a wimp. I mean, that's really what it comes down to. And it's. You know, that theme then is repeated throughout Scripture, that this is that Yahweh is the God who can control, you know, that everything just simply obeys him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1292.12,"end":1292.48,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1292.48,"end":1337.96,"speaker":"Fr Andrew Stephen Damick","text":"You know, that's why the disciples marvel when Jesus rebukes the wind and the waves on Galilee. Like, who is this that the wind and the waves just obey him? You know, like, no spirit can do that, you know, except the one true God. He's the only one who simply commands and things happen. There's no struggle. There's nothing like that. And then the apologetic is like, look, pagans, look how pathetic your God is. I mean, what you say about what your God can do and about what you need to do in order to interact with your God is so much smaller than the way that the one true God who created the heavens and the earth, revealed himself and said, this is how we interact with him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1338.27,"end":1339.79,"speaker":"Fr Stephen De Young","text":"Yeah. And nonsensical."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1340.75,"end":1341.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1341.31,"end":1347.55,"speaker":"Fr Stephen De Young","text":"Can't clean. Can't clean himself or prop himself back up if he tips over, but can help your wife get pregnant."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1348.03,"end":1349.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1350.51,"end":1396.75,"speaker":"Fr Stephen De Young","text":"It makes no sense. Right. But so, as mentioned, God creates an image in his creation in order to get certain things done. And so this is sort of the other trajectory through Genesis 1 that I mentioned before, where God, in this work of creation, at the beginning of it, the beginning of Genesis 1, after God creates the heavens and the earth. There are these two problems in Hebrew. It's funny because it rhymes. The world is Tohu Wahua, which the King James version translates as formless and without. Formless."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1396.75,"end":1398.23,"speaker":"Fr Andrew Stephen Damick","text":"Formless and void. Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1399.11,"end":1407.11,"speaker":"Fr Stephen De Young","text":"And formless means sort of chaotic disorder. Right. Out of order. And void is empty."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1407.75,"end":1408.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1408.15,"end":1452.57,"speaker":"Fr Stephen De Young","text":"So those are the two problems. It's this chaotic mess, and it's empty. And so on the first three days of creation, God puts things in order. Right. He separates the light and the darkness. He separates the sky from the sea. He separates the dry land from the sea and puts those things in order. And then in the second set of three days, which correspond. Right. So on the first day, he separated light and darkness. On the fourth day, he fills the heavens with the sun, moon and stars. Right. And a lot of the fathers, by the way, have this as the point at which the angels are created."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1452.81,"end":1453.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1455.53,"end":1485.75,"speaker":"Fr Stephen De Young","text":"And then on the. On the fifth day. Right. He had. On the second day, he had separated the sky and the sea. On the fifth day, he fills the skies and the seas with life. And then on the third day, he had separated the dry land from the water. On the sixth day, he fills the dry land with life, culminating in. In human beings. So three days taking care of the formless. Three days taking care of the empty. But then once. Once man is created."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1485.83,"end":1488.55,"speaker":"Fr Andrew Stephen Damick","text":"I never saw that pattern before, actually, so that's. That's pretty cool."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1488.63,"end":1503.01,"speaker":"Fr Stephen De Young","text":"Okay. Yeah, I'm, I'm. I. I give credit to my old professor, Meredith Klein, that's who. Who pointed me to that. But you find it in Thomas Aquinas and even some of the Fathers."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1505.01,"end":1505.69,"speaker":"Fr Andrew Stephen Damick","text":"That pattern."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1505.69,"end":1516.93,"speaker":"Fr Stephen De Young","text":"But so then when Adam is created, when man is created, he's given this command to fill the earth and subdue it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1517.33,"end":1518.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1518.93,"end":1525.66,"speaker":"Fr Stephen De Young","text":"And those two things conform to the two problems still."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1526.38,"end":1526.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1527.26,"end":1537.74,"speaker":"Fr Stephen De Young","text":"Right. So Eden, this may blow some people's minds too, but Eden isn't the whole Earth. Right. We're given a location of it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1538.22,"end":1540.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We get geographic details."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1540.54,"end":1567.35,"speaker":"Fr Stephen De Young","text":"It's a garden in a particular place. It's not the whole earth. And so Adam is told to fill the earth and subdue it. Right. So filling is filling. Subdue, the word there. That's translated subdue actually means to conquer. Like to take a city to conquer and take something, take control of it, put it in order. And so Adam is charged to continue that work."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1568.31,"end":1570.15,"speaker":"Fr Andrew Stephen Damick","text":"So expand Eden."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1570.55,"end":1587.79,"speaker":"Fr Stephen De Young","text":"Yes, basically, yes. To go out of Eden and take Eden with him and continue to continue that act of creation, of subduing the world, putting it in order and filling it with life."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1588.35,"end":1605.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. And hopefully not getting too much ahead of ourselves. That's exactly what we're called to do at the end of the Divine Liturgy is to take the church, which is Eden, and to bring that into the world and expand the church to churchify the whole creation."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1605.92,"end":1610.16,"speaker":"Fr Stephen De Young","text":"The dismissal is arguably the most important part of the Divine Liturgy."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1610.4,"end":1611.52,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1612.56,"end":1613.52,"speaker":"Fr Stephen De Young","text":"So stay for it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1613.6,"end":1650.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Stay for it. Yes. Stay for it, everybody. And don't. If I may make a controversial statement here, don't send people off to Sunday school or to coffee hour or wherever until that final amen. Because we're being sent out in that dismissal to expand Eden. That's what's going on. We've. We've participated in Eden and now we're. We're taking Eden on the road and laying claim to new territory for it. So, yeah, that is pretty mind blowing. Pretty cool. Pretty cool."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1650.76,"end":1658.57,"speaker":"Fr Stephen De Young","text":"And. And right off the bat, we see Adam get to work on the subduing part. That's what the whole naming the animals thing is about."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1658.89,"end":1659.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1660.17,"end":1666.17,"speaker":"Fr Stephen De Young","text":"It's not about, you know, what should I call that stripy horse? I'll call him a zebra. Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1667.77,"end":1672.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like God saying, look, I can't think of anything to call these things. So maybe, Adam, you can come up with something."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1672.97,"end":1686.74,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So what we find, this is especially common in the Hittite archaeology. The Hittites were in what's now Central Turkey, sort of South. South Central."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1686.74,"end":1691.86,"speaker":"Fr Andrew Stephen Damick","text":"Right. And we're a. An Indo European language group. Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1691.86,"end":1692.34,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1692.66,"end":1697.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Which is, you know, super rare in that area in that time. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1697.62,"end":1715.67,"speaker":"Fr Stephen De Young","text":"And what we find is we find a lot of these sort of bas relief sculptures that depict a new king sitting and holding a reed and naming a bunch of wild animals."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1716.07,"end":1716.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1718.71,"end":1733.54,"speaker":"Fr Stephen De Young","text":"So this was an image that was symbolic of sort of kingly authority related to this idea of subduing. Right. Because the wild animals are sort of. The wild beasts are the image of that chaos and out of control element of creation."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1733.69,"end":1734.97,"speaker":"Fr Andrew Stephen Damick","text":"Creation, yes. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1736.09,"end":1754.09,"speaker":"Fr Stephen De Young","text":"And so him sitting. And if you look at especially very early iconography, orthodox iconography of Adam naming the animals, you'll see he's a lot of times sitting on a rock and holding a reed. He's got the reed and he's naming the animals."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1754.09,"end":1758.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the reed is kind of a scepter. Right? Is that what's. What's going on there?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1758.65,"end":1759.33,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1759.33,"end":1775.13,"speaker":"Fr Andrew Stephen Damick","text":"And of course, then. Then when Christ is in his passion, he is given a reed to hold in his hand by. Yeah. Which they, you know, the Roman soldiers don't know what they're doing, but they're basically declaring him the new Adam when they do that."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1775.53,"end":1801.62,"speaker":"Fr Stephen De Young","text":"This is also what's behind that weird verse in St. Mark's Gospel where in his account of Christ going out into the wilderness before his temptation, it says that he's out in the wilderness with the wild, then he's with the wild animals. So St. Mark is setting up this image of Christ being out there with the animals, and then, lo and behold, the devil shows up to tempt him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1801.94,"end":1802.74,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1803.94,"end":1838.5,"speaker":"Fr Stephen De Young","text":"Just like we see in Genesis 2 and 3. But so this dominion part is, is Adam gets a start on that, but then after he's done with that, God says, well, it's not good for him to remain alone upon the earth. Meaning we've got this one human. He can't fill the earth with life as one Human. Right, Right. And so this is, this is the problem that, that results in the creation of woman in Genesis 2."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1839.18,"end":1866.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not that Adam is bummed out that he has anybody to talk to because God is there and presumably angelic beings are there. Yeah, yeah. It's not like he's lacking for conversation and it's not like he knew about women. So he was bummed he didn't have one available because there was literally no one had ever conceived of a, you know, no pun intended, conceit of a woman."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1867.66,"end":1868.06,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1868.06,"end":1897.45,"speaker":"Fr Andrew Stephen Damick","text":"It's about filling the earth, you know, about, about the two of them being sub creative with God's grace and, you know, perpetuating, not just perpetuating, but expanding, you know, and having more people then to be involved in God's sub creative, you know, and to be involved sub creatively in God's creative acts of bringing order to the world and so forth. So. Yeah, yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1897.45,"end":1911.57,"speaker":"Fr Stephen De Young","text":"Right. And so in the same way. Well, in a more full way. Right. Because what we talked about last time with the nephilim, with the giants is a demonic parody of this. Right. Them trying to have their own images, you know."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1911.57,"end":1911.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1911.85,"end":1915.45,"speaker":"Fr Stephen De Young","text":"People in their image and likeness to bring their work to fruition."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1915.93,"end":1916.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1916.81,"end":1934.9,"speaker":"Fr Stephen De Young","text":"Part of the purpose and the gift given to humanity by God is this participation in God's work in the world, that the work God is doing in the world to bring it to completion and maturity and perfection is work that he shares with us."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1935.46,"end":1936.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1936.26,"end":1937.54,"speaker":"Fr Stephen De Young","text":"In. In this world."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1938.18,"end":1963.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So. Well, you know, I think that that's a good stopping point. So why don't we go ahead and let's go ahead and take our first break. And when we get back, we're going to start taking some of your calls and we're also going to discuss what all of this means in terms of as the story begins to roll down through the Old Testament. So let's go ahead and take a break."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1964.96,"end":1981.19,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":1987.11,"end":2041.01,"speaker":"Dr. Jeanne Constantinou","text":"So here's a question for you. What does it mean to think orthodox? What are the unspoken and unexplored premises and presumptions underlying what Christians believe? Orthodox Christianity is based on preserving the mind of the early church. Its first Phronima. Dr. Jeanne Constantinou brings her more than 40 years experience as a professor, Bible teacher and speaker to bear in explaining what the orthodox phronema is, how it can be acquired, and how that phronema is expressed in true Orthodox theology as practiced by those who are properly qualified by both training and a deep relationship with Christ. Thinking Orthodox. Now available@store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2043.09,"end":2059.21,"speaker":"Steve","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2061.61,"end":2129.65,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second part of our show, and we'd like to take your calls. You can call us just as you heard the voice of Steve saying 855-AF-RADIO, 855-237-2346. And we'd love to hear your voices and talk to you a little bit. So we were just talking about subduing the earth as part of the original charge given to Adam and how that means essentially kind of expanding Eden and bringing God's creative works and his order and his beauty into all the world. And so that's what we're going to continue to talk about now. And, you know, it expands outward. So even though Adam fails, God continues to work in the same way. You know, God is God. So we see his, his character in the way that he interacts with mankind. And part of it is to continue to try to get mankind to engage in this commission of bringing his rule and order and beauty to the whole of creation. So let's continue the conversation. Father."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2130.37,"end":2147.43,"speaker":"Fr Stephen De Young","text":"Right. So yeah, obviously things go wrong and Adam and Eve do leave paradise. But, but they don't bring it with them. But that doesn't then say, well, God has to scratch his head and say, well, plan A didn't work."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2147.91,"end":2148.79,"speaker":"Fr Andrew Stephen Damick","text":"What do I do now?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2148.87,"end":2169.66,"speaker":"Fr Stephen De Young","text":"What can I come up with? Right. But rather, this continues to be what humanity is for and is called to do. And in terms of the aim of our particular discussion, obviously there's a lot more that could be said here, but we're eventually going to get to the Theotokos here. So, yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2169.66,"end":2171.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. People are like, I thought this episode."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2171.34,"end":2183.78,"speaker":"Fr Stephen De Young","text":"Was about the Theotokos. We particularly want to focus on this as we talked about how the image of Adam naming the animals and the subduing is this kingly image."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2184.26,"end":2184.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2184.98,"end":2192.89,"speaker":"Fr Stephen De Young","text":"And so we want to talk a little bit about how that then develops as we go deeper into the, into the Old Testament."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2192.97,"end":2193.37,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2193.37,"end":2238.73,"speaker":"Fr Stephen De Young","text":"And so first, you know, with, with sort of nascent Israel, we have, you know, the first leader is, is Moses. And then after this episode with where his father in law, Jethro gives him some advice, it says, look, Moses, you're one guy. You're wasting your time listening to people argue about who stole whose goat. You need some help here to judge the people and to govern this mass of people that you've led out of Egypt. And so that's when the elders of Israel are sort of officially appointed the Greek presbyters of Israel. The elders of Israel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2239.85,"end":2242.65,"speaker":"Fr Andrew Stephen Damick","text":"And there's. And there are 70 of them."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2242.97,"end":2245.05,"speaker":"Fr Stephen De Young","text":"Yes, of course, 72."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2245.43,"end":2269.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. A very, very important number all throughout the Bible. And we're not like doing, you know, numerology, magic, sorcery here. It's just like when you see the same number appear over and over again and it links up over and over again, you have to ask yourself why that's happening. So just taking Note, there's either 70 or 72 elders who help govern Israel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2270.15,"end":2346.86,"speaker":"Fr Stephen De Young","text":"Right. And, and the reason that's significant, we've already talked about this some in some previous episodes, right, that there were 70 or 72 sons of God in the divine council when we first talked about that idea. And they were assigned, as we talked about in Deuteronomy 32, 8. And as it connects to Genesis 11 in the story of Tower of Babel, they were assigned to shepherd the 70 nations which are listed in Genesis 10. And it's also going to be not coincidental in Christ's ministry that he appoints 12 disciples who he says are going to sit on 12 thrones and judge the 12 tribes of Israel. And then he appoints 70 apostles. Exactly right. For the 70 nations. And he even has, within the 12, he has three pillars, as St. Paul calls them saints. Peter, James, and John. And that pillar language goes back to Abraham, Isaac and Jacob as the pillars of Israel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2347.34,"end":2353.98,"speaker":"Fr Andrew Stephen Damick","text":"I don't know why I didn't ever make that connection before, but there it is, everybody. We're all learning something tonight."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2354.06,"end":2425.4,"speaker":"Fr Stephen De Young","text":"Right, but, but so these structures of leadership, I don't want to go too far down this route, but these structures of leadership in terms of the government of Israel are carried over into the government that Christ puts over his. His nascent church. Exactly in terms of the leadership. So it doesn't just go away, but so what we see now is we have Moses and then we have these 70 or 72 elders. Probably 72 since there were 12 tribes. And that gives you six from each tribe. Yeah, but. Right, with these, these 70 elders and so this is an image then already of the Divine Council. This is an icon of the divine Council where you have the one authority, but then also this. This council surrounding them in leadership. And this is also going to be picked up by the early church in the idea of having a single episcopos, bishop or overseer, however you want to translate that, surrounded by presbyters."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2425.64,"end":2445.38,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which then is, as we mentioned in our second episode, we were talking about the Divine Council, and we talked about that architectural feature, the Synthronon, which looks like a sort of a little mini stadium behind the altar, thrown in the middle, lots of seats next to him on the right and left. The throne in the middle is for the bishop. The other seats are for the presbyters."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2447.14,"end":2467.34,"speaker":"Fr Stephen De Young","text":"And so this, then once Israel's in the land, this is going to come into the idea of the monarchy in Israel and then later the divided monarchy in Israel and Judah, where you have a king and then that king's court, that king's council."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2468.06,"end":2523.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay, so here's a little wrinkle. You know, everyone who's read 1st Samuel, chapter 8 knows that in that chapter, the people of Israel come to the prophet Samuel and say, we want a king like the other nations. And Samuel goes to God and says, they've rejected me. And God says, they've not rejected you. They're rejecting me because they don't want me to rule over them, but give them a king anyway. And, oh, by the way, it's going to be bad. Right. And so you. You come away from that. Like, I remember, you know, when I. When I read that, my impression was like, okay, well, monarchy is okay, but certainly definitely not really endorsed by God here. He kind of, you know, sort of says, well, okay, here's your king. But, yeah, but that's not really what's happening there, is it? Or at least it's not looking at the details closely enough."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2523.63,"end":2529.87,"speaker":"Fr Stephen De Young","text":"Right, right, right. And that's. And I know that's how people have been taught to read that passage."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2530.27,"end":2532.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, that's how I was taught to read the passage."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2532.75,"end":2546.83,"speaker":"Fr Stephen De Young","text":"Because American Christianity is Puritan Christianity. Yeah, right. First Great Awakening. It comes from Puritanism. If there's one thing Puritans don't like, it's the institutional church. But if there's two things they don't like, it's the institutional church and monarchy."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2546.99,"end":2554.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. And so. And that gets written then into the American Constitution where there's this idea that no church should be established."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2555.47,"end":2555.87,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2556.19,"end":2558.11,"speaker":"Fr Andrew Stephen Damick","text":"Right there in the First Amendment. Yep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2558.11,"end":2560.59,"speaker":"Fr Stephen De Young","text":"Right. And we're not gonna have any kings around these parts."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2561.79,"end":2565.39,"speaker":"Fr Andrew Stephen Damick","text":"So no title, no big titles, you know, landed nobles."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2565.95,"end":2677.41,"speaker":"Fr Stephen De Young","text":"And so that was sort of a go to passage for them to say, hey, look, there it is. Yeah, monarchy no good. You know, we need to get rid of it and, and have sort of a straight theocracy, which is how they pictured Israel before that. Now, I would point them to the Book of Judges and ask them how well that went. But. Yeah, but the, the point being that we have to take this text in 1st Samuel in the context of previous and succeeding passages that talk about kingship. So the first place we have to go is to Deuteronomy 17, 14 through 20, which is Deuteronomy, the end of the Torah, but in the Torah, So preceding this. And Deuteronomy is not disconnected from the books that follow the books that follow Deuteronomy. The historical books, including First Samuel, are called by scholars the Deuteronomistic history. Because what you find when you read them is that the theological principles in Deuteronomy that are described there in the Torah sort of play out in the historical narrative. It's not just giving what we would call modern day objective history. Right. This happened then, this happened and this happened, but it's written from a perspective, from the perspective of this is God's teaching, his Torah, this is what should be happening. And, oh, look, it's not happening. Right? Yeah. Or here, here and there, maybe it is happening a little bit. But so Deuteronomy, it gives commandments for when you have a king. Right. It says when you come into the land and you want a king, don't have a foreign king, has to be an Israelite, he's not to multiply wives to himself."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2678.23,"end":2695.31,"speaker":"Fr Andrew Stephen Damick","text":"Interesting. Yeah. So there's, there's stuff before it saying, look, when you're gonna get a king, this is what you should do. And that's the context, the rejection, you know, of, of what the people are asking for. Yeah, but in sense, some sense, then giving them what they ask for the."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2695.31,"end":2722.47,"speaker":"Fr Stephen De Young","text":"K. And the king is to. The main commandment for the king there is that he is to make a copy for himself of the Torah, to copy and to study it and to learn it. But so all these commands have already been given centuries before we get to them asking for a king to Samuel. And also it says in Deuteronomy that they should wait for the king who God is going to send them."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2722.79,"end":2724.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2725.19,"end":2731.59,"speaker":"Fr Stephen De Young","text":"And this is the other problem. They're not waiting for the king. God is Going to send them. They're demanding one right now."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2732.19,"end":2745.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is essentially kind of a repeat of the problem in Eden. Right. Where Adam and Eve eat of the tree of the knowledge of good and evil. But they. But it's not that they were never going to have access to it, it's that they weren't ready for it yet."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2746.03,"end":2775.1,"speaker":"Fr Stephen De Young","text":"Right. And like we talked about with. In the context of the Nephilim. Right. Knowledge that they were ready for technology, etc. Yeah. And. And it's the same kind of grasping and. And what they asked for. When we read this text in Samuel in detail, or in First Kingdoms, if you're reading the orthodox study Bible in detail, they say, we want a king like the other nations. So that's strike one. Right. Because not coincidentally, remember, the other nations had like God kings."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2775.42,"end":2779.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they were kind of like warlord slash high priests."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2779.66,"end":2780.94,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2781.34,"end":2781.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2782.62,"end":2792.6,"speaker":"Fr Stephen De Young","text":"So that's a strike one. Strike two is they say that they want one of these kings like the other nations, so that he will lead us out and lead us back in."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2793.32,"end":2795.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You say. Well, military. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2795.84,"end":2799.4,"speaker":"Fr Stephen De Young","text":"What you might say. What does that mean in English? But that's a military reference."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2799.88,"end":2800.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2800.32,"end":2816.67,"speaker":"Fr Stephen De Young","text":"Right. That's going out to battle. Right. And then coming back victorious. And why do they ask for that? Well, all through Joshua, all through the period of the Judges, into Samuel as the last judge, it's God who leads them into battle."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2817.55,"end":2819.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. In many cases, literally."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2819.79,"end":2820.27,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2820.43,"end":2824.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like he's appearing there and fighting in the battle with them."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2824.51,"end":2869.88,"speaker":"Fr Stephen De Young","text":"Yes. He's. Yeah, he's leading them into battle. And they're going to be victorious when they're following his lead. Right. Is the idea. When they're following his will, they'll be victorious because he will fight for them. Well, they're not so happy with that. Remember what we said about idolatry, trying to get God to do what you want. So they decided in. In the chapters immediately preceding this demand for a king, they decided, hey, we want to go out to war. You know what? Let's take the Ark of the Covenant with us and we'll put it in front. Yeah, we'll put it. We'll put it in front. And when we march out with that in front of God will have to. Yahweh will have to come and fight for us, and we'll use the Ark to get him to do what we want."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2870.28,"end":2871.56,"speaker":"Fr Andrew Stephen Damick","text":"Literally idolatry."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2871.8,"end":2889.68,"speaker":"Fr Stephen De Young","text":"Yeah. And so God says no. And not only are they badly defeated, but the Ark gets captured and taken by the Philistines and then there's this whole series of stories where the Philistines try to put it in one of their idols. Temples, and all the idols fall over and bow down to it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2889.68,"end":2890.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2890.2,"end":2890.6,"speaker":"Ben Bauman","text":"And."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2891.32,"end":2893.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not that God abandons the ark."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2893.52,"end":2893.96,"speaker":"Ben Bauman","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2894.22,"end":2908.14,"speaker":"Fr Stephen De Young","text":"And then they get a bunch of. Then everybody starts getting boils and plague. And so the Philistines get the picture and say, hey, you know what? We need to get rid of this thing. And so they put it on an ox cart with no driver."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2908.54,"end":2909.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2909.18,"end":2920.7,"speaker":"Fr Stephen De Young","text":"And the oxen dutifully take the ark back to Israel. But so rather than learning from this, hey, you know what? God doesn't even need us to carry the ark back. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2921.26,"end":2921.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2921.62,"end":2933.72,"speaker":"Fr Stephen De Young","text":"He doesn't need us to do anything for it. We need to get on his side. And on his page, they take the opposite lesson of, like, well, we clearly can't trust him to lead us into battle, so we're gonna need a king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2935.72,"end":2940.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, guys? Yeah, Sorry."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2940.52,"end":2944.36,"speaker":"Fr Stephen De Young","text":"Like, worst possible. Yeah. Worst possible conclusion."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2944.76,"end":2945.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2945.16,"end":2948.28,"speaker":"Fr Stephen De Young","text":"So that's why they're asking for a king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2948.44,"end":2963.63,"speaker":"Fr Andrew Stephen Damick","text":"It's the wrong kind of king. The wrong time, the wrong way with a king. Yeah, yeah. Because, like, if God is just simply rejecting the idea of a king, then why would he present himself as king of kings, you know?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2963.63,"end":2963.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2963.83,"end":2966.47,"speaker":"Fr Andrew Stephen Damick","text":"Like, that would not be the. That would not be the term."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2966.71,"end":2970.87,"speaker":"Fr Stephen De Young","text":"Right. He presents us as a monarch surrounded by a council, sitting on a throne."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2971.27,"end":2971.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2972.55,"end":2989.67,"speaker":"Fr Stephen De Young","text":"So, yeah, there's not a problem with that in and of itself. And so they get Saul first, and Saul is kind of a judgment on them. We won't go through the whole story of Saul, but ultimately we come to David."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2990.55,"end":2991.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":2991.11,"end":3008.93,"speaker":"Fr Stephen De Young","text":"And David is, from the perspective of the Old Testament, as close as you can get to the ideal human king. Right, right. Clearly, the. The scriptures are very honest about the fact that he was not ideal or perfect or. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3009.41,"end":3011.73,"speaker":"Fr Andrew Stephen Damick","text":"But he. He fulfills the law by repenting."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3012.05,"end":3041.8,"speaker":"Fr Stephen De Young","text":"Right. And he is. He is as close as a human get. And so in that way. Right. What we're saying when we say that is we're saying that he most fully of everybody who's a king in the Old Testament is serving as this image of this icon of God. Right, right. And the king is called to do that in a particular way. And that's in continuity with what we were talking about before of this idea of doing and doing right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3041.8,"end":3084.06,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. Establishing the justice of God, which is not who committed what crimes and what punishments do they get, but rather about putting everything in order. Again, it's the exact same. Right. As you're saying, it's the exact same thing we see with Adam, who's been charged with expanding Eden. You know, the king, God's king, is charged with making his place, paradise, setting it in order, you know, making sure that it's just, you know, all of that stuff. And David is the one who does that more than, you know, more and better than anyone else. He's not perfect."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3084.22,"end":3101.33,"speaker":"Fr Stephen De Young","text":"But the ancient. The ancient concept of justice, which is like ma in Egyptian. The Egyptian concept, or mishpod in Hebrew, is the idea that everything is in its proper place, functioning properly, fulfilling its purpose. And so you have peace. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3101.33,"end":3101.73,"speaker":"Cody","text":"And."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3102.21,"end":3135.93,"speaker":"Fr Stephen De Young","text":"And everything is good and at rest. And so this is. This is the job of the king, is to participate in what God is doing, bringing about justice, which means countering injustice. And so this is what he's called to do. And so because of this, because he is serving as an icon, in this way, he becomes the icon of that king who God promised back in Deuteronomy. The king who he would send. David isn't the king who he would send."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3136.41,"end":3136.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3137.21,"end":3139.68,"speaker":"Fr Stephen De Young","text":"But he is the image of that king who he would send."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3140.55,"end":3153.59,"speaker":"Fr Andrew Stephen Damick","text":"And that's, again, imaging is fulfilling the. The character of your father, you know, of the one whom you are imaging, participating in his works, doing the things that he does."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3153.99,"end":3154.43,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3154.43,"end":3157.03,"speaker":"Fr Andrew Stephen Damick","text":"It's not just a matter of sort of looking like him or whatever."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3157.35,"end":3157.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3157.75,"end":3178.08,"speaker":"Fr Andrew Stephen Damick","text":"And which. Which, you know, that's. This episode isn't about this. But if you think about then imaging how that relates to iconography, I mean, it just. Wow, that opens things up pretty significantly in terms of how we understand iconography, that it's participation in. And continuation, you know, of. Of. Of the thing, the person that's being imaged. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3178.32,"end":3178.88,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3178.96,"end":3180.08,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3180.16,"end":3206.25,"speaker":"Fr Stephen De Young","text":"And so because of this, this is what. What's sometimes called the covenant with David, this announcement that Nathan the prophet comes and makes to David, this is the context of that, of connecting David to this king who is going to come, and that this king who is going to come, who's going to become known as the Messiah, the anointed one, which is one of the terms for a king, because that's how you became king. You were anointed."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3206.25,"end":3207.17,"speaker":"Fr Andrew Stephen Damick","text":"Anointed, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3210.69,"end":3224.93,"speaker":"Fr Stephen De Young","text":"We read about this in two different places. It's not just the Gospels where we have multiple versions of the same story. This is also true in the Old Testament because we have first and Second Samuel, first and Second Kings, or first through Fourth kingdoms, and then we have first and Second Chronicles."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3226.13,"end":3237.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And These, I'm guessing these represent various, various ways that the same stories have been written down. And then they're compiled together to be what we now understand as the Old Testament scripture."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3237.97,"end":3283.89,"speaker":"Fr Stephen De Young","text":"Right, right. And they have different perspectives. First through Fourth Kingdoms is really talking about the justness of God's judgment in destroying Israel and sending Judah into exile, showing the descent into sin and madness that resulted in that. Whereas first and Second Chronicles were written later in the exile. And they're more about this messianic hope that the line of David is going to produce this. This Messiah. But in the two different versions of that promise from Nathan to David, one of which is in 2nd Samuel or 2nd Kingdom 7, 16, the other one of which is in 1st Chronicles 17, verse 14, and the surrounding verses, there's this subtle change in language."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3284.45,"end":3284.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3285.17,"end":3285.53,"speaker":"Fr Stephen De Young","text":"Where."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3285.53,"end":3286.93,"speaker":"Fr Andrew Stephen Damick","text":"Which is cool. This is cool."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3287.73,"end":3301.33,"speaker":"Fr Stephen De Young","text":"In. In the Second Samuel, Second Kingdom's version, the promise is that Nathan says to David, your meaning David's house and kingdom and throne will be established forever."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3302.07,"end":3306.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then the second one is in his descendants."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3306.55,"end":3321.91,"speaker":"Fr Stephen De Young","text":"And then in first Chronicles 17, 14, the language is almost the same, except it says that. That his descendant will be established in my meaning, Yahweh's house and kingdom and throne forever."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3321.91,"end":3324.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3324.43,"end":3341.2,"speaker":"Fr Stephen De Young","text":"And so when you take those together, you have a son of David who is going to be a king, a Messiah, and who is going to sit on both David's throne and Yahweh's throne."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3342,"end":3347.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's not David because David does not sit on the throne of God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3348.32,"end":3348.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3349.52,"end":3349.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3349.92,"end":3384.46,"speaker":"Fr Stephen De Young","text":"Right. And so this is, this is both a critical point for the development of the whole idea of the Messiah, who Jesus is going to be spoilers. Right. But it's also, as we mentioned, one of the basic building blocks when we talk about, you know, we use our theological term Chalcedonian Christology, the idea that comes out of the later church councils that Christ is both God and man."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3384.86,"end":3385.34,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3385.42,"end":3389.82,"speaker":"Fr Stephen De Young","text":"Fully and completely. Right. Again, this isn't some idea that evolves over time."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3390.3,"end":3393.18,"speaker":"Fr Andrew Stephen Damick","text":"We're in the Old Testament, it's in the Old Testament."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3393.26,"end":3418.73,"speaker":"Fr Stephen De Young","text":"It's part and parcel of this, this Old. This Old Testament promise. And Christ himself tries to point the. The Pharisees to it. Right. When he. When he quotes the psalm and says the Lord said to my Lord, sit at my right hand till I make your enemies your footstool at your feet. He says, how if the Messiah is David's son, how does he call him Lord?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3419.29,"end":3424.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because normally no son would ever be called Lord by His own father."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3425.13,"end":3425.53,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3426.57,"end":3435.34,"speaker":"Fr Andrew Stephen Damick","text":"It never goes that way. But because Christ is God, he is the Lord of David as well as being his son."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3435.5,"end":3441.1,"speaker":"Fr Stephen De Young","text":"His son because he's human. So this is. This is embedded right there in that very basic promise."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3441.5,"end":3463.15,"speaker":"Fr Andrew Stephen Damick","text":"And so, yeah, so Christ moves, moves the Davidic kingship, which is this sort of icon of God in his divine council, into full reality, where you've got he is God and his divine council, because he is Yahweh, he is the Son of God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3463.55,"end":3477.31,"speaker":"Fr Stephen De Young","text":"So, yeah, rather than being David surrounded by his council, being this icon, now that is combined and is the divine council. David's throne and God's throne are the same throne that Christ sits upon."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3477.71,"end":3494.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So we've got a call actually that's coming in from Cody, who is in Texas, and he has a question specifically about what we were just now talking about. So, Cody, are you there?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3495.44,"end":3495.8,"speaker":"Ben Bauman","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3495.8,"end":3496.88,"speaker":"Cody","text":"Howdy from Texas."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3497.36,"end":3501.52,"speaker":"Fr Andrew Stephen Damick","text":"All right, nice to hear your voice, Cody. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3503.44,"end":3547.02,"speaker":"Cody","text":"So my question relates to. Is the typology between the Davidic kingdom and the Queen Mother role that we see. What other positions are there within the kingdom, specifically relating to Isaiah 22:22. I hear that a lot as a proof text, specifically in Roman Catholicism, when they're talking about, you know, the prime minister and Jesus quoting that in Matthew 16:18, but not as an apologetic specifically. But how does the role of the prime minister of the Davidic kingdom, is it fulfilled in the New covenant?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3548.06,"end":3551.74,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. I don't know the answer to that, but maybe Father Stephen does."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3552.46,"end":3611.74,"speaker":"Fr Stephen De Young","text":"Yeah. So the issue with the. And I'll go in a little more. The issue with the Roman Catholic interpretation of that is not really their interpretation, it's how they restrict it to St. Peter. So there is a connection in imagery there with the keys. Right. With the steward. Right. The chief Steward of David having the keys to lock and unlock. That image is picked up. But the keys aren't only given in the Gospels to St. Peter. They're also given to all of the apostles. And so the orthodox understanding of that is not that that connection doesn't exist, it's that that connection exists, but that it's the binding and loosing is a function of the. Of the church rather than of a single bishop within the Church."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3612.06,"end":3612.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3613.74,"end":3625.67,"speaker":"Fr Stephen De Young","text":"So, yeah, that. That is that steward role is there. There are other roles. For example, we see going forward in the narrative of David's life that Nathan the Prophet is part of his council."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3626.39,"end":3626.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3626.95,"end":3646.32,"speaker":"Fr Stephen De Young","text":"And we see that as part of the role that St. John the forerunner. And I'm sure we'll do an episode on St. John the Forerunner at some point, but that he takes on in the Divine council. So, yeah, there are these other roles and we're gonna. I think the rest of the show now is going to be about that Queen Mother role that you mentioned."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3646.87,"end":3649.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So does that, does that answer your question, Cody?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3649.91,"end":3669.19,"speaker":"Cody","text":"Yeah, I think so. And I think that things don't fit, you know, between the. The Old Testament and the New Testament fulfillment. It's not a one to one match, I guess, because we have one queen mother, the Theotokos. So. But I guess it's a type of. And not a, you know, all analogy fade, I guess."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3670.71,"end":3672.74,"speaker":"Fr Stephen De Young","text":"Right, right, right, right, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3673.22,"end":3789.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, thank you very much, Cody, for that call. Good to hear from you. Yeah. So. All right. Well, you know, the one thing that I wanted to add about what we were just talking about, about Christ fulfilling the Davidic kingship and being, you know, sitting on both the throne of David and of Yahweh, is that, you know, we talked about David as an icon of God. And one of the things that was pointed out to me years and years ago actually when I was still in my undergraduate studies, I recall one of my professors actually talking about this question of how words function. Of course, words are essentially, in a way, icons of the things that they talk about. And he made the point. He said, but there's only one word that means himself that doesn't point to some other thing, and that's the word of God himself, Jesus Christ, the son of God. He unites both, to use modern linguistic terminology, both refer and referent. He is the word who means himself. Whereas all other words mean something other than themselves. Like words don't mean the sounds that are making. They refer to a thing. If I say book, I'm referring to the object, not to those sounds. So I always loved that. And it was one of the ways that I began to understand what it means for Christ to be the word of God. So. Yeah, Cool, Cool stuff. Okay. Well, we actually received a recorded message from Ben, who had a question very much related to about what we're just about to talk about. So. So our engineer this evening is Matryzka Trudy. So, Matryska, could you please play that recorded message for us from Ben?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3791.14,"end":3830.17,"speaker":"Ben Bauman","text":"Hi, fathers, this is Ben Bauman calling from Grand Rapids, Michigan. My question is in regards to the phrase, the queen stood at thy right hand, kind of in general, how would an ancient Jewish person have understood this? Would they have seen this as a correlation to something within their culture. What I'm getting at is the idea that as far as I can remember, there aren't any queens of Israel mentioned in the Old Testament. So how would they have really seen this? The queen stood at thy right hand. What would that have been in reference to in their minds? Thank you, Fathers, and love the show."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3831.05,"end":3840.89,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that is an excellent question and we are going to discuss that as soon as we get back from our second break. So let's go ahead and go to break."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3841.79,"end":3857.87,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3863.47,"end":3916.53,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life has become normal for many, even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, Prayer, Fasting and Almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3921.42,"end":3937.42,"speaker":"Steve","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":3939.74,"end":4027.47,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of Lord of Spirits. And we do want to hear from you. So call us at 855 AF radio. And this episode turns out to be a very similar pattern to a lot of our previous ones where we say we're going to be talking about this and then we spend the first hour talking about things that don't seem to be about that, but actually, as we're about to discover, lead right up to it. So first we had to establish what it means for man to be in the image of God and his role in paradise. Then we had to establish exactly what it means that Israel is governed by a king. How that continues, man's Role in paradise, that exact same role. And now that we've established this idea of the kingdom of Israel as especially the court of David in particular, and we're going to talk about why David in particular, not just because he's the best example of this, but there's something about his kingship, his line, that's really important here. And now we're getting to the point where we actually are going to be speaking explicitly now about the mother of Jesus Christ. So. All right, well, we got that question from Ben. What would an ancient Israelite, ancient Jewish person have thought about if we talked about that phrase from the Psalms, the queen stood at the right hand? Which, of course, is the title of this particular episode. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4027.47,"end":4029.63,"speaker":"Fr Stephen De Young","text":"So now in the third half, we get to our topic."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4029.71,"end":4030.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4030.35,"end":4032.55,"speaker":"Fr Stephen De Young","text":"And. But you'll see."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4032.55,"end":4038.67,"speaker":"Fr Andrew Stephen Damick","text":"You'll see how this is necessary. We can't just jump in. We have to set it up, because otherwise it doesn't make any sense."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4039.31,"end":4059.85,"speaker":"Fr Stephen De Young","text":"So what we see in, again, this close reading of the Old Testament scriptures, what we see in terms of queens, I do have to say to Ben, when he said he didn't know of any queens of Israel mentioned in the Bible, I do have to say, bro, do you even Jezebel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4060.09,"end":4060.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4061.21,"end":4064.73,"speaker":"Fr Stephen De Young","text":"But although hopefully, maybe not a good example."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4064.73,"end":4065.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4065.09,"end":4065.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4065.29,"end":4068.37,"speaker":"Fr Andrew Stephen Damick","text":"I mean, when you're reading Psalm 45, you're like, oh, yes, that's about Jezebel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4068.37,"end":4079.61,"speaker":"Fr Stephen De Young","text":"That's not about Jezebel. Not about. No. But so we do see that. That there's this pattern, and it's unique to Judah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4080.44,"end":4080.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4080.76,"end":4083.16,"speaker":"Fr Stephen De Young","text":"It's unique to the southern kingdom of."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4083.56,"end":4102.28,"speaker":"Fr Andrew Stephen Damick","text":"Judah because we have to remember that Israel gets divided into the southern kingdom of Judah, and then there's the northern kingdom that is often just called Israel. And that's where you get, for instance, the, you know, the Ahab and Jezebel stuff. Right. There's. It's two different places now. It gets split up. So there's two different kingships happening."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4102.68,"end":4117.3,"speaker":"Fr Stephen De Young","text":"Right. And it's important to give a little historical context to this, because we don't think about it this way. Okay. The amount of time that Israel was united as one political entity is about a century."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4118.42,"end":4118.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4119.78,"end":4121.14,"speaker":"Fr Stephen De Young","text":"It's about a hundred years."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4121.62,"end":4121.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4121.98,"end":4124.18,"speaker":"Fr Stephen De Young","text":"It's before that, you just have tribes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4124.66,"end":4125.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4125.7,"end":4154.48,"speaker":"Fr Stephen De Young","text":"And then Saul sort of manages to get most of the tribes into a loose coalition. David really starts the monarchy, and then everything spins out of control with his son Solomon. And that's 80 years between the two of them. And then. And then things divide again. The northern kingdom of Israel only existed for another about 200 years, a little."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4154.48,"end":4157.32,"speaker":"Fr Andrew Stephen Damick","text":"Less, and then boom."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4157.72,"end":4164.68,"speaker":"Fr Stephen De Young","text":"Yeah. So there was all over. There was a political entity called Israel for a grand total of maybe 300 years."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4165.16,"end":4166.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4166.76,"end":4181.72,"speaker":"Fr Stephen De Young","text":"In the Old Testament, Judah lasts a little longer than that. It lasts another 140 years, a little less 135, and then it is taken into exile. So just to give that perspective."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4181.72,"end":4182.04,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4182.04,"end":4225.66,"speaker":"Fr Stephen De Young","text":"So. And David was actually made king of Judah before he became king of all of Israel. He had to settle a rival claim from one of Saul's sons. So Judah and the rest of Israel were never welded together that strongly. It's sort of like the American north and south between the founding of the country and the civil war. That's. Technically, they were one country, but it wasn't good. So uniquely in Judah, we see, beginning with Solomon, that the person who is considered to be the queen is not the favored wife of the king because."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4226.46,"end":4229.5,"speaker":"Fr Andrew Stephen Damick","text":"The king has more than one wife."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4230.06,"end":4235.98,"speaker":"Fr Stephen De Young","text":"Well, also. Except. Except they also had more than one wife in the northern kingdom."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4236.3,"end":4236.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4236.62,"end":4238.62,"speaker":"Fr Stephen De Young","text":"And in all of Judah's neighbors."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4238.94,"end":4242.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Polygamy is the norm, especially amongst the powerful."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4242.78,"end":4257.19,"speaker":"Fr Stephen De Young","text":"Right. And so that while that's an easy explanation, sometimes you'll hear that for folks who don't want to go down the trail we're about to go down that. Well, it's just because of polygamy. Right. You only have one mother. You have lots of wives, but there's."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4257.19,"end":4261.11,"speaker":"Fr Andrew Stephen Damick","text":"Often a favored wife. I'm gonna. This one who's Jezebel, for instance, you know."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4261.11,"end":4264.75,"speaker":"Fr Stephen De Young","text":"Right, right. The wife of the heir or the mother of the heir. Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4264.75,"end":4265.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4266.87,"end":4275.35,"speaker":"Fr Stephen De Young","text":"And so. Yeah. So they dealt with polygamy and still having a queen who was the bride of the king quite well in every other nation in the world except Judah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4275.35,"end":4276.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4276.47,"end":4288.07,"speaker":"Fr Stephen De Young","text":"So. But. So there's this unique institution in Judah where the queen is reckoned as the queen mother. And this starts with. I don't know if you want to read it from First Kings or Third Kingdoms. It starts with Solomon."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4288.31,"end":4349.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay. So this is First Kings or Third Kingdoms, chapter 2, verse 19. You may remember, everybody, that Solomon is, of course, the son of David, the immediate son of David, and his mother is Bathsheba, who had been the wife of Uriah, whom David arranged to have killed so that he could cover up his sin of adultery with Bathsheba. So this is 1st Kings 2. 19. Bathsheba, therefore, went unto King Solomon to speak unto him for Adonijah. And the king rose up to meet her and bowed himself unto her and sat down on his throne and caused a seat to be set for the king's mother. And she sat on his right hand. So it's another throne that he's sitting directly on his right hand, which is. Remember that. I mean, that's the place of honor after the king. That's number two, basically, in the kingdom."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4349.89,"end":4351.01,"speaker":"Fr Stephen De Young","text":"That's the highest position."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4351.25,"end":4361.31,"speaker":"Fr Andrew Stephen Damick","text":"The highest position without being king at the right hand. Yeah, yeah, I'm sure I mispronounced one of those names there. Adonijah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4361.31,"end":4367.87,"speaker":"Fr Stephen De Young","text":"I don't know Adonijah is the usual English. It's actually Adoni Yah. Adoni Yah, my lord is Yahweh. It's what it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4367.87,"end":4369.19,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, There you go. Yeah, sure."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4370.79,"end":4379.11,"speaker":"Fr Stephen De Young","text":"But. So this isn't just a thing that Solomon does because he loves his mom. Right? This isn't just. Solomon's a mama's boy."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4381.51,"end":4385.33,"speaker":"Fr Andrew Stephen Damick","text":"Within a monarchy, within a traditional monarchy, the king's court is the king's garment government."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4385.97,"end":4386.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4386.33,"end":4410.21,"speaker":"Fr Andrew Stephen Damick","text":"You know, the, the, the. Like, we don't think of this now because, like, if the, you know, say the president, United States is. Is sitting and meeting somebody in the Oval Office, he doesn't have a throne, and the person at his right hand is not the vice president necessarily. You know, it doesn't. Just doesn't work that way. But in a king's court, the people in the court are the ones who are running the place again. Right. So just, you know, that's what the divine council is in."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4410.94,"end":4432.42,"speaker":"Fr Stephen De Young","text":"And those. God's court, those positions at the right and left hand are particularly important. Right. Because when the king is sitting on the throne in judgment and he's making decisions, the people who have access to him. Right. In order to influence his decisions. Right. Or for him to seek advice. Yeah, right. Are the ones sitting at his right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4432.42,"end":4435.06,"speaker":"Fr Andrew Stephen Damick","text":"Hand and at his left hand immediately next to. Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4435.06,"end":4443.81,"speaker":"Fr Stephen De Young","text":"So these are. This, this is where. Why that comes up later with Saints James and, And John and their mother. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4444.45,"end":4449.33,"speaker":"Fr Andrew Stephen Damick","text":"They ask like, hey, can we sit at the right hand and the left? And it's like in your kingdom. Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4449.33,"end":4451.41,"speaker":"Fr Stephen De Young","text":"We want the top spots. Yeah, yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4451.41,"end":4457.21,"speaker":"Fr Andrew Stephen Damick","text":"That's reserved. Those are reserved and actually have been for centuries upon centuries."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4457.21,"end":4465.82,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. But so this is. This is the position that's given. And it doesn't stop with Solomon."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4466.53,"end":4466.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4467.33,"end":4482.53,"speaker":"Fr Stephen De Young","text":"The. As you go through. And I'm gonna, I'm gonna rattle the verses off. No one's gonna have time to look these up as I rattle them off. But I'm gonna do my best Jack Van Impe. Because no one could read verse references faster than him. The late. The late, great Jack Van Impe."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4483.41,"end":4483.81,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4485.65,"end":4544.12,"speaker":"Fr Stephen De Young","text":"As you go through. As you go through all of. I'm not going to give all the Chronicles references. This is just first and second Kings. They're paralleled in Chronicles, every single one of them. But for first and second Kings are third or fourth kingdoms. What we're going to see is that every time a new king of Judah is coronated, there's this pattern. There's this stereotypical phrase that's used, right, where they're named. They become the big king of Judah in a certain year. And then it says, and his mother was so and so and so. And Those occur in 1st Kings, 14, 21, 15, 2, 15, 10, 22, 42, 2nd Kings, 8, 26, 12, 1, 14, 2, 15, 2, 15, 13, 15, 30, 15, 33, 18, 2, 21, 1, 21, 19, 22, 1, 23, 31, 23, 36, 248 and 24 18."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4544.68,"end":4545.24,"speaker":"Ben Bauman","text":"Boom."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4545.64,"end":4545.96,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4545.96,"end":4619.39,"speaker":"Fr Andrew Stephen Damick","text":"If you look, if you look that stuff up, people, and I did, you will see. And this so and so became king and his mother was. And so and so became king and his mother was. This is one of those details that unless you're looking for to understand what it means, you'll probably just roll right by it. But again, like father said, this is only the king of Judah. It is only the kings of David's line, not the northern kingdom of Israel. You don't get this pattern there. It's only here they always mention who his mother is. And it's because the king's mother, the queen mother, is the one who is at his right hand. I recall when looking into this, by the way, if I could just interrupt. I recall when looking into this that this is so sort of institutionalized. It's so much an office that you can actually get deposed from it. Right. It's not sort of automatic like it happens one time when one of king's grandmothers is occupying the position and she falls into idolatry. And so he deposes her from it. You know, that, that it's. It's so much of an office that you can actually get kicked out of it."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4619.63,"end":4649.36,"speaker":"Fr Stephen De Young","text":"Yeah. And it's an office with power that you can use for evil, because there is an evil one. At one point, Athaliah, who is one of the daughters of Ahab, who gets married off to the. The king of Judah and then decides to try to eradicate the line of David, have them all killed off. So that she could put Ahab, install Ahab's line in the southern kingdom also."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4649.84,"end":4650.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4650.96,"end":4662.97,"speaker":"Fr Stephen De Young","text":"But because she was in this queen mother position, she had the power to try to control who was going to be the next king and to have people assassinated. And so this was a governmental role."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4663.37,"end":4711.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And so. And the. And the position then consists of. It's not just someone who gives advice, you know, or influences the king, but also someone like, if you know that someone is close to someone of power, then you will go to that person and say, hey, would you mind talking to the king and asking for this? I know he'll listen to you. Right. And so within, especially the human context, that makes total sense that, you know, that his mom should go to him and say, hey, I think we should do this. Right. So there's this role of the queen mother receiving petitions and passing them on, a totally normal thing for the person standing at the right hand of any king to be doing."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4712.1,"end":4725.64,"speaker":"Fr Stephen De Young","text":"Right. And it also goes the other way, where this is a place where it is kind of analogous to our president and vice president, where the president can say to the vice president, I'm going to put you in charge of getting this through Congress."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4726.04,"end":4728.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or there's delegation happening you."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4728.84,"end":4744.01,"speaker":"Fr Stephen De Young","text":"Right. And so it's not. It's not delegate. It's not delegation in the sense of, like, I'm going to take some of my authority and divest myself of it and give it to you. Like we've already talked about with the saints. It's. I'm going to administer XYZ through you."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4744.09,"end":4745.05,"speaker":"Fr Andrew Stephen Damick","text":"Through you. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4745.05,"end":4746.73,"speaker":"Fr Stephen De Young","text":"You're going to be my representative."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4747.13,"end":4749.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You let them know this comes from me."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4750.01,"end":4751.13,"speaker":"Fr Stephen De Young","text":"Yeah, exactly."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4751.21,"end":4757.21,"speaker":"Fr Andrew Stephen Damick","text":"And being like, when I. One of my kids, like when I send one of my kids to go fetch another one, you tell them I sent."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4761.61,"end":4785.51,"speaker":"Fr Stephen De Young","text":"So, yeah, so that. That goes. That goes both ways with this office. And as. As you mentioned, you know, you can read all those verses I rattled off. If later, when this is, you know, a recorded podcast, you could go back and pause and. But if you go and look in between, in between, it talks about the succession of kings in Israel is mixed right in there. The Northern kingdom never mentions their mothers."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4785.91,"end":4786.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4786.95,"end":4845.49,"speaker":"Fr Stephen De Young","text":"So it's not the same book. Yeah, the same book. So this is. This is this unique institution with the Davidic king in the Davidic line. And so because the king, the Davidic king in particular as the anointed one. Right. Has this particular iconic imaging relationship with Yahweh, the God of Israel, we get These Psalms, Psalm 45 from which the title of this episode came is not the only one, but it's one of the major ones. You get these psalms that are sort of odes to the beauty and the glory of the King of Israel. Right. And this has something important to teach us about veneration, too. Going back to a topic we talked about a couple podcasts ago, that there didn't seem to be a problem with a psalm praising God's king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4847.25,"end":4847.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4848.61,"end":4864.38,"speaker":"Fr Stephen De Young","text":"That. That was not seen to be taking away somehow. No. You're only. We shouldn't be singing psalms to the king. We should only be singing psalms directly and about Yahweh and that's it. Right. Why? Because the king is the icon of God and of his rule."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4864.7,"end":4869.42,"speaker":"Fr Andrew Stephen Damick","text":"So honor given to the king passes to the one whom the king is the icon of."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4869.66,"end":4896.19,"speaker":"Fr Stephen De Young","text":"Right. Is honoring God, because that's his king, who he established. But so when we get into Psalm 45 and into the details of this praise, it includes not only the king, but also the. In Hebrew, it's Gebirah, this queen mother role. And I don't know if you want to read that section."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4896.19,"end":4927.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is Psalm 45, beginning with verse 9 through 11 and then skipping to 13. The queen stands at your right hand in gold from Ophir. Listen, daughter, and consider and incline your ear, and forget your own people in the house of your father, because the king will greatly desire your beauty, because he is your Lord. Worship him. All glorious is the daughter of the king within the palace. Her clothing is woven with gold. Praising the queen. Yeah, praising the queen."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4928.46,"end":4929.5,"speaker":"Fr Stephen De Young","text":"And notice."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4930.03,"end":4932.83,"speaker":"Fr Andrew Stephen Damick","text":"And talking to her directly, but also just."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4933.55,"end":4952.27,"speaker":"Fr Stephen De Young","text":"Just like. Just like we were talking about with Psalm 110 and the Messiah being both David's son and his Lord. Notice that the queen we're talking about here is both the queen mother and the daughter."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4953.07,"end":4960.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Which. That only works if the king is God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4961.41,"end":4961.81,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4962.05,"end":4971.89,"speaker":"Fr Andrew Stephen Damick","text":"So the psalm does double duty, just as David with the Lord said to my lord in Psalm 110."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":4972.37,"end":5018.72,"speaker":"Fr Stephen De Young","text":"Cool. Right. And so with Christ and his mother, what we would expect, if Jesus is the Messiah, if Jesus is the Christ, then the announcement that Jesus is the Messiah, Jesus is the king, Jesus is the Davidic king, would be immediately followed by Mary is his mother. And she is both his mother and therefore the queen mother to his king and Messiah and his daughter, because he's her creator and Savior at the same time. And so that psalm can only really be fulfilled in Christ and his mother."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5019.2,"end":5085.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. She therefore is the mother of God and the daughter of God. At the same time, she's his mother by virtue of his humanity, and his daughter by virtue of his godhood. Cool. Cool stuff. I don't know. I mean, I just, you know, when you get to the point where we've led up to now, all I can kind of do is marvel. Right. It's just so astonishingly beautiful. And, you know, it's this. It's like a great poem that just sort of stretches over thousands of years. Right. And, you know, a poem that God is composing and everything comes into place and we see then, you know, we're leading up to. We're just a few weeks away right now from the Nativity of Christ. And so this is a perfect episode to have before our nativity episode. You know, that there she is holding God in her arms as a child, and she is both his mother and his daughter at the same time. Cool."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5086.34,"end":5105.03,"speaker":"Fr Stephen De Young","text":"Yeah. And so to be right to the point, indeed, I am saying here that when the apostles went out and preached the gospel, the gospel is. And we'll get more into this, I'm sure, in the future. The gospel is the report of Christ's victory that has led to him being enthroned as king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5105.51,"end":5106.07,"speaker":"Ben Bauman","text":"Yep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5106.63,"end":5129.13,"speaker":"Fr Stephen De Young","text":"And so when they're announcing that Jesus is the Messiah, he has won this victory over the powers and over death, over and over the powers of Hades, they are also announcing who his mother is. I'm saying the apostles did that. You may say, well, how can you prove that? And I say, I can prove that."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5129.61,"end":5134.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh, prove it for me, Father Stephen. You can't just leave me hanging there."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5136.01,"end":5143.44,"speaker":"Fr Stephen De Young","text":"And the way I can prove that is from one of the earliest anti Christian writings that we have."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5143.84,"end":5153.28,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, so we're. You, you listen to this show for the deep cuts, everybody. This. This is it. This is so pretty deep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5153.84,"end":5160.4,"speaker":"Fr Stephen De Young","text":"So around 150 AD, middle of the second century. 150, 160."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5160.96,"end":5161.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5161.76,"end":5166.06,"speaker":"Fr Stephen De Young","text":"There's a fellow named Celsus, or Celsus, depending on who taught you Latin."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5168.77,"end":5169.01,"speaker":"Fr Andrew Stephen Damick","text":"Who."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5170.77,"end":5188.69,"speaker":"Fr Stephen De Young","text":"Who was a pagan and who wrote what was considered by the church fathers to be the most scathing and pointed, point by point, pagan attack on Christianity and the Christian gospel."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5189.09,"end":5191.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he was doing a takedown. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5191.61,"end":5196.46,"speaker":"Fr Stephen De Young","text":"So this was his. You know, if this was on YouTube today, it would be Kelsis destroys Christians."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5197.02,"end":5204.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. So, yeah, Kelsis would totally have been a YouTuber."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5204.54,"end":5209.9,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah, it would have been. Yeah. Except he wasn't an atheist, so."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5210.3,"end":5210.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5211.74,"end":5213.46,"speaker":"Fr Stephen De Young","text":"But he's irascible. Irascible."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5213.46,"end":5215.74,"speaker":"Fr Andrew Stephen Damick","text":"Like a lot of those. Those YouTube apologists."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5215.9,"end":5225.18,"speaker":"Fr Stephen De Young","text":"Yeah. And so we have to remember kelsis now in 151 60, he's never been to a Christian worship service."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5225.74,"end":5226.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5226.14,"end":5244.42,"speaker":"Fr Stephen De Young","text":"Because they didn't allow outsiders in. And he's a pagan and an opponent. So he's only heard rumors about that stuff. The stuff that he knows about the Christian gospel that he's attacking is just the stuff that's in the public proclamation, the stuff that Christians were preaching as they evangelized. Right. And went out."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5244.42,"end":5248.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so that's on the. The stuff that's on the website to put it in."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5248.18,"end":5248.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5249.06,"end":5250.42,"speaker":"Fr Andrew Stephen Damick","text":"Modern terms. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5250.42,"end":5271.49,"speaker":"Fr Stephen De Young","text":"So all the stuff he's attacking is the stuff that's publicly known. This is what the Christians believe. This is what they teach. In this case, he's specifically attacking the gospel. He's attacking the idea that Jesus is God and that Jesus is the Messiah, he's the king. Yeah, right. Those are the two particular points he's attacking because those of course, are the central points of the gospel itself."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5271.81,"end":5272.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5273.41,"end":5303.97,"speaker":"Fr Stephen De Young","text":"And so we have a number of responses to Celsus written by different, different fathers and different early Christian writers. The most famous one is the one written by Origen contra Celsus or contra Kelsem, appropriately enough. And we don't have the whole text, Kelsus's original whole text, but we could reconstruct a lot of it from, from the church fathers and early Christian writers who quote him to respond to him."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5304.29,"end":5304.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5304.77,"end":5349.89,"speaker":"Fr Stephen De Young","text":"So you got to put back together from the quotes. Right. Here's what he said. And if you're interested in early interactions with paganism, a lot of this anti Celsus literature goes really in depth into some of the ancient pagan beliefs. Right. Like Origen starts talking about the Pythians and like some of these, like, I mean, deep cuts of, of Greco Roman paganism. But, but anyway, one of the things that Kelsis goes after is Mary and we find out pretty quickly that he knows a bunch of stuff about Mary. Yeah, right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5350.21,"end":5351.4,"speaker":"Fr Andrew Stephen Damick","text":"Where did that from?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5351.95,"end":5355.87,"speaker":"Fr Stephen De Young","text":"Where did he get that from? Right. Where would he have gotten that from?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5356.35,"end":5363.71,"speaker":"Fr Andrew Stephen Damick","text":"Because she, I mean, we should remember she was not an important person as far as the world was concerned."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5364.03,"end":5365.07,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5365.07,"end":5370.19,"speaker":"Fr Andrew Stephen Damick","text":"No one was writing biographies of Mary who was like a Jewish court official or Roman."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5371.31,"end":5371.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5371.67,"end":5374.67,"speaker":"Fr Andrew Stephen Damick","text":"The only people talking about her are Christians."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5374.99,"end":5403.06,"speaker":"Fr Stephen De Young","text":"Right. And so he's hearing these things that he knows about her in the public, public proclamation of the gospel by Christians. So she's a part of that proclamation. Right. And he thinks that attacking her is a way to undermine the whole thing. So it's not just that, like, it's some detail that he heard them talking about. He thinks this is part, an important part of the proclamation. And so I'm going to. I'll read this quote."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5403.61,"end":5404.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5405.29,"end":5459.31,"speaker":"Fr Stephen De Young","text":"This is what, this is some of the things he says a lot of things, some of them very nasty. But this is, this is some of the things that he says about Mary. He says that Christ was born in a certain Jewish village of a poor woman of the country who gained her subsistence by spinning. It was improbable that the God would entertain a passion for her because she was neither rich nor of royal rank, seeing no one, even of her neighbors knew her. So how is Celsus attacking the Christian gospel by saying this Mary person is a nobody, She's a peasant, nobody ever heard of her. Her own neighbors, the other people of the village, probably didn't even know who she was. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5460.19,"end":5460.59,"speaker":"Fr Andrew Stephen Damick","text":"Why?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5460.67,"end":5467.95,"speaker":"Fr Stephen De Young","text":"How could she be the mother of his pagan perspective? How could she be the mother of a king, let alone the mother of a God?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5468.51,"end":5498.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, because. Because recall in the ancient world, this idea of the rags to riches story, or, you know, local boy makes good, you know, the underdog wins. That stuff is all nonsense to an ancient pagan. You know, if you're on top of things, if you're, you know, that's. Because that's the way it's supposed to be. The gods set that up. No one makes it big, you know, coming from nothing or if there, if."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5498.8,"end":5506.38,"speaker":"Fr Stephen De Young","text":"There was somebody who came from humble beginnings, they tell all these stories about how as a child, they were already exceptional in doing amazing things."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5506.93,"end":5520.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, right. And so, so Kelsis thinks that if I just point out that this, this God that they worship, his mom is some nobody, then that just shows how ridiculous this Christianity thing really is."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5520.69,"end":5525.17,"speaker":"Fr Stephen De Young","text":"Right. She can't possibly have been the mother of a king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5525.89,"end":5526.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5526.69,"end":5539.63,"speaker":"Fr Stephen De Young","text":"That's how he attacks the Christian gospel, which means the Christians were going out there as part of the gospel and preaching. She's the mother of the king and the mother of God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5540.43,"end":5553.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which would have been important and meaningful for Israelites, but not important or meaningful to a pagan in the same way."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5553.79,"end":5554.19,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5554.67,"end":5555.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5555.67,"end":5565.55,"speaker":"Fr Stephen De Young","text":"So this is so 150, 160 AD we're talking less than 50 years after the apostle John died. Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5565.55,"end":5571.31,"speaker":"Fr Andrew Stephen Damick","text":"And long and long before the canon of the New Testament is clearly recognizable all over the world."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5571.71,"end":5582.99,"speaker":"Fr Stephen De Young","text":"Right. That her identity is the queen mother and the mother of God is a central enough part of the Christian Gospel proclamation that Kelsis thinks refuting it undermines the whole thing."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5583.31,"end":5583.87,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5584.75,"end":5626.32,"speaker":"Fr Stephen De Young","text":"And I could add. Add on. I could add on, on top of that, that 20 years later, St. Irenaeus, who's a spiritual grandson of St. John, is writing about how the Theotokos is the second Eve. All of. All of these other things, basically about his grandmother. Yeah, right. The theological significance of his grandmother in God's purposes of redemption. So this is. This is not something that develops later, that comes into Christianity from paganism in the 5th century or. Right. This is not. This is the opposite."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5626.72,"end":5627.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5627.08,"end":5636.64,"speaker":"Fr Stephen De Young","text":"This is thoroughly Jewish. This comes out of the Old Testament. It's part of the gospel in that it's part of Christ's identity as king."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5636.96,"end":5637.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5637.6,"end":5645.28,"speaker":"Fr Stephen De Young","text":"And affirming her as the mother of God is part of his identity as God. And those things are tied together in the idea of the Messiah by David's throne."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5645.52,"end":5772.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so therefore, we get hymns like we sing all the time in the Orthodox Church, more honorable than the cherubim, more glorious beyond compare than the seraphim. That's not just a way of saying she's really, really glorious. It's talking about her position in the divine council. Because, you know, think back to our first couple of episodes, everybody. Remember, we talked about the throne guardians. That line of hymnography specifically is talking about the. The throne guardians who are at God's throne. He's, you know, he's enthroned upon the cherubim. He's surrounded by the seraphim, and they are the ranks of angels that are the closest to him. Right. They are at the very sort of top of the divine council in that sense. And we're saying in this hymn that she's above them. Why? She stands at his right hand. She stands at his right hand. She's the queen mother. He's the son of David, therefore she's the queen mother in this line of Davidic kings. And she's his mother, but she's also his daughter because he's God. The thrones of David and of Yahweh are united in Christ. And so because of who she is, we cannot help but proclaim her as his mother as we proclaim the gospel. It can't be left off because otherwise we're proclaiming a gospel that doesn't. That has nothing to do with God's kingship and his throne and being the son of David and the Messiah, et cetera, et cetera, et cetera, et cetera. If that doesn't blow your mind, I don't know, I mean, this is the podcast where, you know, I'm blowing my mind, you know, But I mean, if that doesn't blow your mind, I mean, you know, it's just, it's really astonishing. Like, she's not this add on, you know, and it's certainly not like an attempt to import paganism into Christianity. And it's none of that. It's deep, deep all the way goes back to Genesis, as we were just saying. Amazing."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5773.13,"end":5796.41,"speaker":"Fr Stephen De Young","text":"Yeah. And. And so you may notice in most Orthodox churches, behind, you know, in a high place, a. Above the altar, there is iconography of Christ enthroned. And he is enthroned twice in that iconography as, as man, he is sitting on his mother's lap."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5797.53,"end":5797.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5797.93,"end":5802.89,"speaker":"Fr Stephen De Young","text":"But then if you look at what's surrounding them as God, he is enthroned upon the cherubim."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5803.61,"end":5838.75,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. And then on the, on almost every Orthodox iconostasis, you see Christ his icon right next to the holy doors to his right, to his right, his mother to his left, the prophet of God, the Forerunner, whom we're going to talk about. We will, I promise you. Yeah, we are definitely going to have a whole episode about John the Forerunner. We're looking at the Divine council right there in the Akanastas as well."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5839.07,"end":5942.25,"speaker":"Fr Stephen De Young","text":"And so in this role, she has that same sort of twofold ministry as part of the Divine council where she intercedes, meaning she prays, right. And passes on prayers from us from those in the church. And the other direction, right, where God her Son, works through her in his administration of the world in the same way we've talked about him working through angels and saints in a general sense, but in a special way through her. And so when you look at the prayers and hypnography surrounding the Theotokos, you see these two things. You see on the one hand, that idea of seeking her intercessions and her prayers for us. And you see this idea often of protection and those kind of things where it's talking about Christ working miracles through her and through her prayers. And so that, that takes place in both directions. What we're saying about her is what we're saying about all the saints, but her in this special, unique sense as sort of the, the highest of the saints and the closest. The closest of the saints being in that, that right hand position in the same way that we talked about ranks of angels, right. In terms of their closeness to, to the throne of God."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5942.25,"end":5944.09,"speaker":"Fr Andrew Stephen Damick","text":"She's not a different species from us."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5945.25,"end":5945.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5945.73,"end":5950.13,"speaker":"Fr Andrew Stephen Damick","text":"But the place that she Holds is different. Yeah."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5950.69,"end":5951.17,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5951.57,"end":5952.05,"speaker":"Ben Bauman","text":"Wow."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":5952.85,"end":6179.55,"speaker":"Fr Andrew Stephen Damick","text":"Well, all right. Well, given everything we just said, then, let's offer some final thoughts to wrap up this evening's episode about Our lady of the Theotokos. You know, I just want to speak from a personal point of view. I recall when I first encountered the Orthodox Church now 23 years ago, more than 23 years ago, I had been raised Evangelical Protestant. And of course, as an Evangelical Protestant, we did not venerate the Virgin Mary. Now, I wasn't in a kind of anti Mary part of Protestantism, but it was just, you know, sort of not there. You know, we sort of liked her and kind of rolled her out a little bit more around Christmas, but not really important. And I remember though, when I encountered the Orthodox Church, I had Orthodox people who asked me, like, is Mary a problem for you? Right. Because there's a lot of people, a lot of Protestants who, when they encounter Orthodoxy, that they just can't get over that. It's just kind of too much. But I remember at the time when they asked me that question, I thought to myself, and I said, you know, she's not, she's not. It just sort of her place just sort of made sense to me. Now, I didn't understand everything we'd just been talking about, probably almost maybe 1% of it at the time, you know, but I remember that it just made sense to me. And I think the reason that it made sense to me is because of this sense of what orthodox worship is, right? That it is entering into the presence of God, into his throne room and offering sacrifices to him. And so within that image of what worship is, within that reality, I shouldn't just say image, but when that, you know, that experience of what worship is, if there's a king there, then it makes sense that. That those who surround him would have this very elevated place, you know, not to be elevated above mankind, to be some different kind of thing. You know, she is still human, just as I'm human, just as you're human, but nonetheless it made sense to me. And then over time, as I began to learn how to sort of get to know her and so forth, it became just more and more natural to ask her for her help, right? Because she's close to the king and it makes sense to be able to ask her for that help. But when I got to the point where I understood what we were just now talking about and how utterly deep the roots of her position go into the Old Testament, then for me there was this experience of, I don't Know, it was an experience of beauty, right? Like, it was like hearing a. A big symphony. And then there's that final last note, you know, where everything resolves and it's. And all the melodies come together and it's just glorious. And then, you know, if you're at a concert, you stand up and you're, you know, clapping and just feel this elation, right? That's how I felt when I encountered this understanding of the Queen Mother as shown so many places in the Old Testament and then fulfilled in the New Testament and then preached, as we noted, by the apostles. And my hope is that whoever you are listening this evening or whenever you're listening, that you might have some of that same experience. So that's my thoughts."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6179.55,"end":6534.59,"speaker":"Fr Stephen De Young","text":"Father Yeah, I think sometimes the things we've just been talking about, about the Theotokos and about her, about the Virgin Mary in general, are treated as kind of ancillary, right? This is sort of a thing, an issue, an issue to itself. And, you know, it's not central to theology. We have our theology, we have our orthodox theology and our orthodox worship, and then there's this sort of merry piece, and a lot of people kind of have trouble with it, as Father Andrew was just saying. But I want to point out that really what we've been talking about tonight and what she exemplifies is really the core, the gospel and the Christian proclamation. And it's a core that's gutted a lot of American Christianity of the materialist variety. We have in that kind of American materialist Christianity, a very anemic skeletal form of Christianity where there's sort of this partition between. Between God and the world, between God and humanity, where, you know, we, we. Christ ascended into heaven and now he's sort of gone and people die and now they're sort of gone or they're separated from us by this partition. There's not really a way through it. What's on the other side of it is kind of hazy. But so I do what I need to do to get saved, and then I try to be a good person for the rest of my life here in the world and try to have confidence that when I die and I go to the other side of that partition, I'll end up in the good place that's not the vital Christianity that's alive and that is made of fire that you find in the Scriptures and that you find the apostles preaching. St. Paul not only over and over again says that all of those partitions and dividing walls have been broken down. But Begins when he writes a letter to a church, writes a letter to a church where they're experiencing some pretty horrific problems with sexual immorality, with heresy, with false teaching and a false gospel and all of these things. He starts by talking to them about the fact that they are sons of God, that they're seated in the heavenly places, that they're like the angels, that they're part of God's divine council, that they're in communion with God and with his saints, that they're part of God's plan and his work in the whole creation. That's where he begins. And then works from there to get down to the details of hey, here's how you should treat your wife and your kids. Hey, here's ways that you can and can't act in the world. And so what we see with the Theotokos is exhibit A of that. We see a human who has fully come into what God created her to be and who he created her to be, who has reached the kind of maturity and completion as a person formed into the image of God that the Scriptures are constantly talking about is the goal of our Christian life. And she's done that. She's crossed that non existent partition and is still connected to us and we can see her there in the heavenly places awaiting us at the end of the journey. And the fact that the person who has most fully done that in the Christian religion is a woman is not to be underestimated. Because the Christian proclamation, including who Christ's mother is, did more to change the role and the understanding and the value and the freedom and the appreciation of women in this world than any human ideology ever has and ever could. The transformation from the way the ancient world looked at women is 180 degrees. 180 degrees. And that despite all kinds of quote unquote goddess worship. Because a goddess isn't like me or like a human woman. A goddess is some other type of being. But the Theotokos is like me. She's a woman like my wife and like my mother and like my sisters. She's one of us who has achieved and received what we're all striving for and therefore is an example to all of us, a beacon to all of us, an intercessor for all of us. And that's not just some ancillary thing, that's not just some obstacle I have to climb over if I'm not orthodox and want to join the church. That's central to what we understand salvation to be and who we are in Christ. And the value of every Christian, but especially Christian women. So those are my thoughts."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6535.15,"end":6535.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh man."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6536.03,"end":6536.67,"speaker":"Fr Stephen De Young","text":"At the end."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6536.75,"end":6572.34,"speaker":"Fr Andrew Stephen Damick","text":"Well, before we finish this evening, I just want to note that of course we will be back in two weeks being the fourth Thursday of the month. However, on the new calendar that both Father Stephen and I are on, that is Christmas Eve. So we're not going to be live that night. We're going to have a pre recorded show. So if you want to submit questions or comments for that one, make sure you send them to us by email or also by our Speak Pipe connection that you can find on the Ancient Faith Radio Live webpage. So just please Note that the Dec. 24 episode will be a pre recorded."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6572.34,"end":6576.18,"speaker":"Fr Stephen De Young","text":"Episode and we're going to be talking about astrology."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6576.66,"end":6578.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh yeah, there you go."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6579.22,"end":6581.38,"speaker":"Fr Stephen De Young","text":"And not that it's just bad."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6584.02,"end":6615.63,"speaker":"Fr Andrew Stephen Damick","text":"All right, well that is our show for today. Thank you very much for listening. If you didn't get a chance to call in during this live broadcast, we'd love to hear from you either via email at Lordofs spirits@ancient faith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but we can't respond to everything. I'm sorry, I wish we could. We get so much email. We do. Save what you send for possible future use in in later episodes and join."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6615.63,"end":6629.99,"speaker":"Fr Stephen De Young","text":"Us for our live broadcast except for next time on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And don't forget to like our local Lord of Spirits Podcast Facebook page. While you're at it, join our Facebook discussion group, leave a recommendation and then invite your friends."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6630.47,"end":6639.51,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts, then that raises the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6640.23,"end":6647.43,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6647.99,"end":6653.08,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you through the path prayers of his mother and of all of his saints."}
{"episode_id":"LOS - #009 - 2020-12-11 - The Queen Stood at Thy Right Hand","start":6659.8,"end":6697.11,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung. A listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing Revelation, chapter 5, verses 11 through 12."}
