{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":0.24,"end":9.36,"speaker":"Fr Andrew Stephen Damick","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9.36,"end":11.04,"speaker":"Fr Stephen De Young","text":"All who dwell on the earth will."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":11.04,"end":17.76,"speaker":"Fr Andrew Stephen Damick","text":"Fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":21.44,"end":29.04,"speaker":"Fr Stephen De Young","text":"The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":29.12,"end":31.12,"speaker":"Fr Andrew Stephen Damick","text":"In our time, many yearn to break."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":31.12,"end":33.9,"speaker":"Fr Stephen De Young","text":"Free of the of a flat secular."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":33.9,"end":36.86,"speaker":"Fr Andrew Stephen Damick","text":"Materialism, to see and to know reality."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":37.02,"end":38.54,"speaker":"Fr Stephen De Young","text":"As it truly is."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":38.86,"end":40.94,"speaker":"Fr Andrew Stephen Damick","text":"What is this spiritual reality like?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":41.02,"end":50.66,"speaker":"Fr Stephen De Young","text":"How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":50.66,"end":56.5,"speaker":"Fr Andrew Stephen Damick","text":"Stephen DeYoung host this live call in show focused on enchantment in creation, the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":56.5,"end":58.78,"speaker":"Fr Stephen De Young","text":"Union of the seen and unseen as."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":58.78,"end":94.67,"speaker":"Fr Andrew Stephen Damick","text":"Made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits. Good evening giant killers, dragon slayers, Anakim Angers, ruffians roughhousing with Raphaim and those who oppose the waterlogging of hogs and bogs for og. You are listening to the Lord of Spirits podcast. My co Host Father Steven DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. This episode is pre recorded because it's American Thanksgiving. So happy Thanksgiving everyone. I am thankful for you. I don't know how Father Stephen feels, especially since he said openly that he doesn't have feelings."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":95.15,"end":100.35,"speaker":"Fr Stephen De Young","text":"I mean this whole thing is prerecorded because you've got all these feels and want to like be with your family."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":100.51,"end":138.38,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Also, I know that many of you out there are still having feelings because you can't find our UFO episode. I acknowledge but do not validate your feelings. So just a couple quick plugs. If you are listening to this live on Thanksgiving or within the day or two afterwards, Ancient Faith Ministries has a Giving Tuesday campaign going on and we've been offered a $50,000 matching grant. So if you'd like to participate in that and have your money doubled. And by that I don't mean you get double your money back. This is a donation, not a, you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":138.38,"end":140.26,"speaker":"Fr Stephen De Young","text":"Know, not the prosperity gossip."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":140.26,"end":192.97,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. You know, go to ancientfaith.com and you'll see a banner there and so you can participate in the Giving Tuesday campaign. And the other thing I wanted to mention in case you've been living under a rock again, one of my favorite expressions, I have a new book out called the Lord of An Orthodox Christian Framework for the Unseen World and Spiritual Warfare. And it is in many ways a distillation of this podcast, but also has some material in there, a lot of material, actually, that you won't have heard in this podcast. So it's related, but not identical. And I hope you'll give it a, you know, check it out. That's at store ancient faith.com and if you do read it, please write a review, if you don't mind, and leave reviews there at the Ancient Faith website. And also if you wouldn't mind Amazon or, you know, wherever else. Although do we really need to give more money to the Bezos? I mean, does he have enough yet?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":195.86,"end":202.82,"speaker":"Fr Stephen De Young","text":"Well, but on the other hand, right, Amazon rankings. I will not defend the Bezos."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":202.82,"end":203.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes, okay, okay."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":205.22,"end":208.82,"speaker":"Fr Stephen De Young","text":"But moving a book up the Amazon rankings does get it recommended to more people."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":208.98,"end":255.69,"speaker":"Fr Andrew Stephen Damick","text":"That is true. That is true. And that's why we suggest giving, you know, leaving reviews there. And. And particularly for those of you who live outside of the United States, which I know is a number of you. In fact, one of the. Actually, two of the questions we're going to be addressing in this episode are from abroad. One from one of your distant cousins in the Netherlands and another one from the Great Down Under. So if you do live outside the United States, Amazon might be the best way for you to get a copy and not have to pay $10,000 or whatever in shipping costs to get it from the US So I totally understand if that's what you need to do. Yes, yes. Sometimes you just have to feed the Bezos whether you intend to or not."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":256.65,"end":265.41,"speaker":"Fr Stephen De Young","text":"So, you know that phrase a number of you? Does it really make sense? Because of course it's a number. Like one is a number."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":265.41,"end":270.17,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Several of you, some of you more than one of you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":270.89,"end":273.13,"speaker":"Fr Stephen De Young","text":"Five is a number. 10,053."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":273.37,"end":284.73,"speaker":"Fr Andrew Stephen Damick","text":"It is interesting the way we use that when we say a number of something. What we mean by that is is definitely more than one and probably more than several. Like a number of you. A significant number."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":284.73,"end":288.01,"speaker":"Fr Stephen De Young","text":"Yeah. You know, any number is a number."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":288.17,"end":298.89,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. I don't like to say any number of you. I don't know what that would even mean. Any number of you. That kind of just doubles down on the fact that it is a meaningless phrase to put in there."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":298.89,"end":299.45,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":302.09,"end":345.01,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, this is an asynchronous Q and A episode, meaning that we are going to be responding to questions that we've received on our. Our voicemail. So this is through the Speak pipe connection. And these are accumulated over the last several months. So you might hear some references to. I just heard the latest episode, and you'd be like, that was months ago. That's because this person recorded it months ago. But we do save a lot of these for future use, so. All right, we got a bunch to get through. So the first one is actually one question about something that was said in a previous episode. But I'm going to replay a few different recordings. Two from Christy and then one from Johannes in the Netherlands, and then we can address it. So here's the first one from Christy."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":347.97,"end":525.21,"speaker":"Audience Member","text":"Hi, Fathers, this is Christy. I'm calling from Massachusetts. I just finished your latest podcast, and I just am so baffled. So I want to just throw out some questions, hoping at some point maybe you can clarify the end of Father Steven's message where what it sounded like kind of the ultimate calling of Christians is, you know, blind obedience toward your priest or bishop. And I am. I'm a very recent convert just a few months ago from Protestantism. This is after, you know, years of wrestling and reading and praying and talking with all sorts of people and choosing to leave my Protestant church where the rest of my family goes to go alone to the Orthodox church. And so I'm. I'm leaving the podcast. Like, well, was I supposed to just stay? Because I. I had spiritual authorities at. At that church, you know, the Jehovah's Witnesses that just came to my door today, Are they doing what they're supposed to be doing? They're obviously submitting to their authorities by going door to door in unfriendly Massachusetts. Right. So I'm very confused at where does our responsibility lie to wrestle? Why would I even listen to biblical teaching? Why would I seek knowledge if I'm not supposed to actually make decisions based on my opinions? Hi, this is Christy from Massachusetts. Again. I was thinking some more, and I remembered an old podcast where you were talking about people who go to their priests and expect them to sort of make all the decisions for them about, like, all the minutia of their life. You said that that was not what we were supposed to do and that that was a monastic sort of attitude to take towards your spiritual leadership, that if the monastic went into the monastery and his head monk person told him to go stick a stick in the ground and water it every day, and that he had to do that, like, no questions asked. You just do whatever they say. And you said that that was very specifically monastic and not the attitude that, you know, I, Orthodox layperson, should take. And then specifically in our congregation Our priest from told the congregation not to worry about fasting anymore. Like, said that it was not necessary, don't worry about fasting. You know, like, fasting is a state of mind. You know, you don't have to worry about actually physically fasting. And the congregation got in touch. A lot of people from the congregation got in touch with the bishop who came and corrected that. Were they not supposed to do that? Was everybody just supposed to be like, you know, hooray. Great passage to contenders. We don't have to fast anymore."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":529.07,"end":691.94,"speaker":"Fr Andrew Stephen Damick","text":"Good morning, Fathers. This is Johannes from the Netherlands. I recently finished your November 10th episode, where @ the end, Father Stephen quotes St. Silouan as saying that you should always obey your spiritual father, even if he tells you to sin. And I feel like I'm missing something there since we're also told that we should never lead our brother to stumble. And as you said, our spiritual father will be held accountable for everything that we do, in a sense, everything that we do in obedience to him. And, well, if I obey him in any sins or heresies that he tells me to commit, and I know that those are sins or heresies, am I not leading him to stumble? So, yeah, how should I deal with that in that context? Thank you for everything you do and God bless. All right, so there you go. There's a number of things all kind of stacked up there. But I think. I mean, before we get into discussing this, I think it's important to remember the context in which we were talking about obedience last time. Right? Which is that, like, it's. It's funny, like. Like, I don't think our culture. I don't think. I know our culture does not default to obedience. We're not like an obedient culture. Right. You know, just. I'll do whatever you say. We're kind of the opposite. We're much more like, I will take this on my own terms. I'm going to decide what I think. I'm going to decide whether I want to do that or not. And the context was discussing how often orthodox people, one can see this on, particularly on the Internet. I mean, I don't think this is necessarily as common in 3D life, but it still is a thing, you know, that things that their bishops do or say, their priests do or say. It's all subject to review, right? It all needs to be taken apart. Do I agree with this or do I not agree with it and so forth. Which, you know, frankly, is exactly. I remember how Protestantism works. You know, I mean, I don't know about you, Father, but I attended a number of churches growing up, Protestant churches, where people would say things like, well, I don't agree with everything the pastor preaches, you know, and so I just kind of take some things and leave others. And, you know, that was the norm. The idea that everyone's not really on the same page dogmatically was considered the norm. I don't know. What do you think?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":692.5,"end":702.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, yeah, in Protestantism, there tends to be things you're allowed to disagree about, and what those are will vary from church to church."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":702.58,"end":705.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, there's some where they actually do kick people out for things."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":707.22,"end":746.79,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. You can. You know, you'll eventually find something, but even on that something. Right. So I know a person who is a Unitarian. They don't believe in the Trinity. Right. But is very Protestant otherwise. Right. And has had problems in various churches. Right. And even though the Protestant church is in question, have people with radically different understandings of the Trinity in them, it's sort of like, okay, as long as you believe in something called the Trinity, but if you say you don't believe in the Trinity, then you're out."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":746.95,"end":747.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":748.07,"end":755.71,"speaker":"Fr Stephen De Young","text":"You could mean something totally weird and wacky by Trinity, but as long as you just affirm the word somehow, like, it's okay."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":755.71,"end":795.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And I. So I think, you know, the malady that we're generally dealing with is not a malady of obsequiousness, of, like, slavish obedience. You know, it's funny, whenever I've noticed this, whenever you talk about obedience within the orthodox context in the English speaking world, almost always someone will use the phrase blind obedience in response to it. Like, there is no obedience that's not blind. Almost as sort of the impression that you get, you know, that somehow obedience is this very suspect virtue, you know, which."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":795.45,"end":803.25,"speaker":"Fr Stephen De Young","text":"Yeah, well, and to be fair, I mean, a lot of people come out. I mean, you look at a lot of independent fundamentalist, Baptist contexts."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":803.25,"end":804.65,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes. And yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":805.29,"end":809.45,"speaker":"Fr Stephen De Young","text":"You've got pastors that demand blind, slavish obedience and not asking questions."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":809.45,"end":816.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, that's a piece of my. Not directly, but a piece of my family's history is some of that IFB stuff."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":817.4,"end":827.72,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so you understand. But we have to take this to brass tacks. Right. Cause a lot of times people go off into hypotheticals. Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":828.12,"end":829.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":829.88,"end":851.11,"speaker":"Fr Stephen De Young","text":"You know, so to set this aside really quickly, so the whole issue with priest says something that sounds crazy, you contact bishop about it. Right. That is perfectly acceptable because. And priests hate to hear this. Okay. But priests have no authority."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":851.43,"end":854.79,"speaker":"Fr Andrew Stephen Damick","text":"That's right. A priest is just an extension of the bishop."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":855.27,"end":859.51,"speaker":"Fr Stephen De Young","text":"Right. All of a priest's authority is delegated from the bishop in the Orthodox Church."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":859.51,"end":861.91,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Yeah. And if there's a priest, so if."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":861.91,"end":874.42,"speaker":"Fr Stephen De Young","text":"He'S teaching something, it is perfectly acceptable to ask the bishop, hey, is this really what the church teaches? If the bishop says yes, then the answer is yes. Right, Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":874.42,"end":889.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, if, if, if a priest finds himself, like if the bishop says, I expect you to do this, let's say it's something really bad, then the priest's job is not to say, well, I'm going to resist you. The priest's job is to say, please, either release me or laicize me."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":890.38,"end":896.78,"speaker":"Fr Stephen De Young","text":"Right. That's it. The priest's choice is I could either do what the bishop says or I could stop being a priest."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":896.94,"end":897.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":898.3,"end":931.21,"speaker":"Fr Stephen De Young","text":"Because I can't in good conscience. Or I could ask to be released to another bishop who I can obey in good conscience. And this is important because this is the same decision that lay people have with their spiritual fathers. Because see, what happens here is the danger is, and in a lot of the pushback we've been getting about that episode, the argument, if you boil it down, people don't express it this way, but if you boil it down is there are bad spiritual fathers."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":931.29,"end":932.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":932.33,"end":934.53,"speaker":"Fr Stephen De Young","text":"True. This is a true statement. Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":934.53,"end":934.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":934.93,"end":948.65,"speaker":"Fr Stephen De Young","text":"There are bad spiritual fathers, therefore mine could be bad, therefore I can't trust mine, therefore I won't have one."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":949.94,"end":950.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":950.82,"end":966.9,"speaker":"Fr Stephen De Young","text":"And that last part, you may say, well, no, it's not that you won't have one. You won't have one. Right. If everything your priest tells you, you go and think about for yourself. Right. And then make your own decision. You don't have a spiritual father. You have a priest who you ask for advice once in a while."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":966.9,"end":968.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have a consultant."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":968.1,"end":968.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":968.5,"end":968.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":968.86,"end":970.34,"speaker":"Fr Stephen De Young","text":"But that's not having a spiritual father."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":970.34,"end":970.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":970.58,"end":1002.48,"speaker":"Fr Stephen De Young","text":"And so you didn't. And what I was saying there at the end of that episode is by doing that, you deny yourself the benefit of having a spiritual father. But the key is to find a spiritual father who is someone who you trust, who you trust, so that even if what they tell you doesn't seem right to you because you trust them, you say, well, you know what? He's a wiser person than me, so I'm going to go with his advice instead of what seems right to me."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1003.03,"end":1003.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1003.31,"end":1006.79,"speaker":"Fr Stephen De Young","text":"Right. But you have to develop that. You have to have that trust First."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1007.03,"end":1081.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's important to remember also that like this model comes from the model of family. Right. I mean, most people, there are some exceptions, but I think most people would say that it's proper for parents to have authority over their children and that their children should obey them. And that's normal. That's how it should be every day. And I mean, as a father myself, I can tell you that there are many times that my children have argued with me and literally they just do not know what they are talking about. They're just clueless because they're however old they are because they're kids. They just don't know. It's not that I'm some super genius or parenting expert or whatever. I just happened to be in my late 40s and been around the block a couple of times, you know, so. And that's the normal model. Does that mean that there's not going to be parents who are abusive? Of course we know that there are parents who are abusive. And if there are parents who are abusive, then something needs to be done. But that's not normal. Most are not abusive. Most really love their kids and are looking out for them."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1082.31,"end":1100.15,"speaker":"Fr Stephen De Young","text":"Yeah. You know, but if, if someone does have an abusive father or an absentee father or what have you, it's very important then that that person does what, that they find some kind of mentor. Yeah, right. They find some kind of father figure."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1100.39,"end":1102.47,"speaker":"Fr Andrew Stephen Damick","text":"And ask God to provide that person."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1102.79,"end":1116.21,"speaker":"Fr Stephen De Young","text":"To sort of fill that gap. And so that's the same thing. So maybe you're in some remote place where there's only one Orthodox church anywhere near you and the priest is alone. Okay, let's say that's true. Okay. Could happen."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1116.21,"end":1118.53,"speaker":"Fr Andrew Stephen Damick","text":"Plausible. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1119.17,"end":1131.49,"speaker":"Fr Stephen De Young","text":"Then what's important in terms of your spiritual life and having the benefit of the spiritual father, of a spiritual father is that you find a spiritual father who's not alone, who you can trust."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1131.73,"end":1132.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1132.53,"end":1136.93,"speaker":"Fr Stephen De Young","text":"And you enter into that relationship with them. But then once you enter into that relationship with them."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1138.22,"end":1138.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1139.1,"end":1148.3,"speaker":"Fr Stephen De Young","text":"You can't continue to sort of second guess everything because if you do what you're denying yourself the benefit of having a spiritual father."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1148.3,"end":1148.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1148.5,"end":1157.82,"speaker":"Fr Stephen De Young","text":"And it's which benefit is. Right. The scriptures are very clear on this. There's a way that seems right to a man and its end is destruction."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1157.9,"end":1160.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1160.46,"end":1167.47,"speaker":"Fr Stephen De Young","text":"There's a way that seems right and its end is destruction. I need the wisdom of someone right beyond myself."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1167.71,"end":1168.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1168.07,"end":1231.01,"speaker":"Fr Stephen De Young","text":"So like in the question of conversion. Right. Hopefully. And presumably you didn't just one day out of the blue decide to become Orthodox, because that seemed right to you. Right. I think that's relatively rare that that happens. But what happened is you're exposed to teaching, to the church fathers, to the way of life that's preserved in the church, to the liturgical life of the church. All of these things which are external to you. Right. That described a way of life better than the one you would have without it, chosen for yourself. So you are, in a way, submitting to the authority of the Church about how to worship. Right. Nobody sits in their house and, like, reconstructs the Divine Liturgy from scratch. Rather, you go and experience a Divine Liturgy. Right. And the Divine Liturgy shapes you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1231.25,"end":1232.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1232.81,"end":1240.69,"speaker":"Fr Stephen De Young","text":"So the relationship with someone wiser than you, who is a spiritual father, is to help shape you. And there are spiritual mothers too, by the way."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1240.69,"end":1242.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, of course. Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1242.61,"end":1265.54,"speaker":"Fr Stephen De Young","text":"There. There are. There are female monastics who hear women's confessions. They can't give absolution. A priest will then give absolution. But they're blessed to hear confessions because sometimes there's issues where women need guidance, where a woman who is older, more advanced, more wise can help better."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1265.54,"end":1303.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I was going to say, I think it's notable that one of the places that the scripture directly addresses this question, Hebrews 13:17. St. Paul says, Obey your leaders and submit to them, for they are keeping watch over your souls, as those will have to give an account. And then this. Let them do this with joy and not with groaning, for that would be of no advantage to you. It's interesting. It's not, you know, let them do this with joy and not groaning because you're giving them a hard time, which is true. But. But it's no advantage to you. Like, you cut off the advantages of having church leadership if you give them a hard time."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1304.36,"end":1326.44,"speaker":"Fr Stephen De Young","text":"Right, right. And in terms of the comparison that Christy made between two things, he said, yeah, we're not saying you come with every decision you ever have to make. Right. To your spirit, should I eat Wheaties or cornflakes? Right. But that when you go and you're in this relationship, especially in confession."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1328.29,"end":1328.53,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1329.33,"end":1337.81,"speaker":"Fr Stephen De Young","text":"And he's not going to tell you to go murder somebody. Okay. He's not going to tell you to go commit adultery. This isn't going to happen."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1339.89,"end":1356.66,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry for kind of chuckling about this a little bit, but we actually had someone post in the group say, what if my spiritual father tells me to go kill somebody? I'm like, is there a spiritual father out there who's using his spiritual Children as hitmen. I mean, I. I don't know. Maybe that happened, but, like, that's."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1356.66,"end":1377.22,"speaker":"Fr Stephen De Young","text":"That's not what we're talking about. Yeah, right. What we're talking about is he says to you after your confession, you really need to go and see this person and, and apologize to them and try and rebuild this relationship. And to you that seems hard. And to you it seems like, well, they haven't asked for forgiveness."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1377.38,"end":1377.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1377.78,"end":1383.18,"speaker":"Fr Stephen De Young","text":"For themselves. And. And you come up with all the reasons why you're not going to do it and you don't do it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1383.26,"end":1384.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1384.46,"end":1390.62,"speaker":"Fr Stephen De Young","text":"That's a real life situation we're talking about. We're saying, you know what? Follow the guidance of your spiritual father."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1390.7,"end":1392.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1392.1,"end":1394.86,"speaker":"Fr Stephen De Young","text":"Right. Even when he tells you to do something hard like that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1395.66,"end":1397.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1397.26,"end":1401.74,"speaker":"Fr Stephen De Young","text":"Right. That's what we're saying. That's real life, what we're talking about."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1402.3,"end":1402.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1403.9,"end":1444.43,"speaker":"Fr Stephen De Young","text":"And that may be, to use the fasting example. Right. Your spiritual father may know, for example, like, I've had plenty of people, this is a common pattern, especially people who newly come into the church. They try to keep, like, they get to their first Lent and they try to keep it super strictly. Right. And they come and confess to me that, like, on a given day, they ate something that unknowingly until they looked at the wrapper or had whey in it or something, you know, And I can tell that there's something pathological going on."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1445.47,"end":1445.87,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1446.43,"end":1475.14,"speaker":"Fr Stephen De Young","text":"Where they're. Rather than, rather than the fast being a way of building spiritual discipline in them. Right. That, that they're spending, you know, three or four times as much time on food. They're reading all of these labels in detail. Right. Like to make sure that, you know, it follows all the rules. Right. And. And this is becoming something not helpful for them where I will tell them, hey, you know what? We're gonna relax the fast for you a little bit."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1475.22,"end":1475.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1477.38,"end":1504.05,"speaker":"Fr Stephen De Young","text":"Right. You're gonna steer clear of like, clear meat and dairy and that's it. For example, not talking about whey protein. I'm not talking about. I'm talking about, like, you don't eat any meat, you don't eat any cheese, you don't drink any milk. That's it. Right? Now, some of those people, knowing them as I do, walked away and said, live garbage. Right. No, I gotta keep the, you know, and didn't listen."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1504.05,"end":1504.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1504.37,"end":1506.77,"speaker":"Fr Stephen De Young","text":"And that's fine. Yeah, that's fine."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1506.77,"end":1507.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1507.01,"end":1508.33,"speaker":"Fr Stephen De Young","text":"You could do that. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1508.49,"end":1509.77,"speaker":"Fr Andrew Stephen Damick","text":"But we're not gonna."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1509.85,"end":1567.43,"speaker":"Fr Stephen De Young","text":"I gave them that advice because I think that will Be to spiritual, their spiritual benefit if they relax about it and stop doing this nonsense. Right, but see, so you can see how very quickly. Right. Who's, who's deciding how I'm going to fast? Is it me or is it my spiritual father who's deciding, you know, what I'm going to do in terms of prayer discipline? Am I listening to my spiritual father about that or am I not? Because there's a thousand shipwrecks of people out there who ended up, by trying to be super diligent and super orthodox, end up not praying and not fasting. Yeah, because they shipwreck and they can't do it at all. And they're unwilling to follow someone else's advice. And so you're only hurting yourself if you want to hurt yourself. If you want to not have a spiritual father. No one's going to force you at gunpoint to have a spiritual father."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1567.43,"end":1570.95,"speaker":"Fr Andrew Stephen Damick","text":"No, but, but being self willed is not the orthodox tradition."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1571.35,"end":1573.19,"speaker":"Fr Stephen De Young","text":"Right. And it's not good for you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1573.51,"end":1573.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1574.55,"end":1599.67,"speaker":"Fr Stephen De Young","text":"I don't advise it. Right. You're free to not listen to me, but obedience in the Orthodox Church is always freely offered. You find someone who you decide, I am going to trust this person and I am going to follow their guidance. And then all we're saying is once you do that, you need to follow through on it and you will reap the benefit."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1600.07,"end":1665.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, let's move on to the next question. I hope that helped out a lot of those people who are really wondering about that. So this next one comes from Jared. Hello, Fathers. My name is Jared from California. I am A one. I'm one of your Protestant friends. Many Protestant friends. Unfortunately, I think I'll always be a Baptist. One of the great things about being a Baptist is being right about everything. It's hard to give up. But I very much admire your program and I have found so much value in it. So thank you. My question is in regard to objects, and they're being imbued with spiritual power, I guess you could say. There is a mirror that was gifted to me that the person who gifted it to me and my wife seem to think has some bad juju. This is not the first time I've run into this sort of thing. There was some kind of African tribal totem that was on display at a."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1665.81,"end":1667.29,"speaker":"Fr Stephen De Young","text":"Church that I grew up in."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1668.25,"end":1700.17,"speaker":"Fr Andrew Stephen Damick","text":"And people seem to think it had a strange vibe. And I know that, you know, with saints, relics and that sort of thing, and even with the Eucharist, objects are sometimes more. I don't even know what the word is. But hopefully you can understand the gist of my question. Can demonic influences stay with an item? And do they need to be cleansed? Thank you, Fathers. All right, There you go. Seems pretty straightforward. What do you think, Father?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1702.49,"end":1702.97,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1704.73,"end":1711.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think the question then for me would be like, well, how would a Baptist go about doing that?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1712.64,"end":1713.44,"speaker":"Fr Stephen De Young","text":"That, I don't know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1713.44,"end":1714.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't know. But I don't know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1714.88,"end":1716.4,"speaker":"Fr Stephen De Young","text":"We would bless the thing."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1716.48,"end":1718.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. With holy water and prayer."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1718.4,"end":1724.4,"speaker":"Fr Stephen De Young","text":"Yeah, Yeah. I mean, depending on what the thing was. I mean, if it's literally an idol, you kind of destroy that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1724.4,"end":1724.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1724.8,"end":1733.08,"speaker":"Fr Stephen De Young","text":"Like. But if we're talking about, like, a chair or a mirror, we would bless it, I guess."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1733.08,"end":1749.58,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. It would depend on. Is the mirror. Does it have idolatrous imagery on it? I don't know. There must be something about that mirror. But I will say this, Jared, you know, as a former Baptist myself, being right all the time is not the best thing. Just putting it out there."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1749.9,"end":1751.74,"speaker":"Fr Stephen De Young","text":"The Pharisees were right all the time."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1751.82,"end":1755.42,"speaker":"Fr Andrew Stephen Damick","text":"There you go. I know you're kidding me."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1755.42,"end":1756.06,"speaker":"Fr Stephen De Young","text":"Jesus says so?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1756.14,"end":1757.26,"speaker":"Fr Andrew Stephen Damick","text":"I know you're kidding."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1757.74,"end":1764.14,"speaker":"Fr Stephen De Young","text":"Yeah, Jesus says so. Jesus says, do whatever the Pharisees tell you to do, but don't do what they do because they're hypocrites."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1764.29,"end":1764.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1764.61,"end":1766.77,"speaker":"Fr Stephen De Young","text":"But that means they were right in terms of what they said."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1766.77,"end":1771.57,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. All right, this next one comes from Bethany."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1773.49,"end":1851.72,"speaker":"Audience Member","text":"Hi, Fathers, this is Bethany from Montana, and I have two questions that are related to the fact that I am, you could say, deconstructing a really fun combination of misogynistic fundamentalist evangelicalism and postmodern secular feminism. I've given these questions to my spiritual fathers. I kind of have two, and they've both given me good answers. However, my satisfaction with them depends on the day. So I'd like to hear what you think as well. Mount Athos. Women aren't allowed there. Why are women compared to the most holy Theotokos? Gross. How is this different from the way modesty is often taught to teenage girls in certain forms of evangelicalism, where girls are taught to. To dress modestly, not because their dignity, but because their bodies will cause boys to sin. And then the idea that Mary didn't feel pain in childbirth like us, in all things except sin, applies to her as well. And as I did say, I'm coming from a more postmodern feminist background. This, to me, kind of sounds like something that was cooked up by celibate men. Who thought the female body was gross. Can you please help with this? Thank you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":1852.12,"end":2076.31,"speaker":"Fr Andrew Stephen Damick","text":"All right. Yeah. So, number one, why aren't women allowed on Athos? And why is it important that we say that the Virgin Mary did not experience pain in childbirth? You know, I've been to Mount Athos. That does not make me an expert on Mount Othos, by the way. But I think that one of the. I know, I know. It's so weird, right? I think one of the things that often when we talk about this question, like, why are women not allowed on Mount Athos or whatever, I think one of the problems is that people tend to think of the place as being like an institution, which, I mean, is not entirely wrong. There's even a government and so forth there. But fundamentally, it's actually a bunch of homes, right? And so then the question, if we understand that, then the question is really, why aren't these people allowed to go into this home? You know, so then it's a matter of, like, the house rules, so to speak. I mean, men's monasteries where women are not permitted to visit and women's monasteries where men are not permitted to visit have always been normal throughout the history of Christian monasticism. Like, this has always been a thing, right? And it's not just women at men's monasteries, it's also men at women's monasteries. But not all. Not all. It's some of them. And the way that the monasteries of Mount Athos have determined that for themselves is that in that particular place, it's the whole place, right? So this is their house rules. And I think we have to understand that to understand the proper context. It's not about women being gross or anything like that. It's a matter of. This is the kind of asceticism that has been adopted by this community. Okay? And again, there are women's monasteries that men are not allowed at. So why is that part of the asceticism? Right? Well, it's not because, like, oh, if I look at, you know, if a woman even appears in front of me, it's her fault if I'm overcome with lust, whatever. No, it's not. You know, now both men and women are responsible for how they present themselves. Yes. But everyone who responds to them is responsible for how they respond, you know, so for a community to decide our asceticism is going to include that we are one sex only, period. That is. That is normal. And it is about avoiding temptation. Right now, the temptation is not being given by the, you know, the potential visitor, unless that visitor is deliberately trying to do that, which probably not right. The temptation is given by the evil one. So the idea is, you know, I'm not going to have the other sex put in front of me, in front of my eyes, because that is going to help me to fight against the temptation of lust. That's really what it comes down to. It's not about, you know, who's worthy or anything like that. And fundamentally, like, someone could say, well, you know, Father Stephen is a public figure. Everyone should be allowed to visit his house. He'd be like, no, I'm only going to let these people into my house. And maybe it's going to be nobody, you know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2076.47,"end":2077.71,"speaker":"Fr Stephen De Young","text":"Yeah. With me. Nobody."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2077.71,"end":2179.97,"speaker":"Fr Andrew Stephen Damick","text":"Nobody. Right, exactly. You know, but it would be awesome. We should all have an opportunity to talk to him around his dining room table. No, you know, it's his house. It's fundamentally about house rules. That's what's going on. It's house rules. And there's some where the rule is not that extreme. It might be like, men can visit but not spend the night, or women can visit but not spend the night, or only on certain days are members of the opposite sex allowed to come visit. Like, these are all things that one sees in orthodox monasticism. So now Mount Athos, of course, is the most famous of orthodox monastic, you know, collections. So that's why it gets the attention. But there are plenty of other monasteries where it's one sex only, and that's the way that it is. So in fact, you know, most of them, it's one sex only living there. And some of them, they extend it, as I said, to visitors as well, you know, so. So for us to question the idea of visitors of the opposite sex not being allowed, we should, we have to question the idea of single sex monasticism to begin with, because that's the reason why it exists, is it's about this kind of asceticism. And I think that most of us accept that single sex monasticism is the norm and, you know, should not be monkeyed with like it's. It's got a pretty good track record, you know, as accomplishing what it's supposed to accomplish. So that's what I'll say about that. I don't know if you had anything to add to that, Father. I certainly know you would have stuff to say about the second question about the Virgin Mary."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2179.97,"end":2185.49,"speaker":"Fr Stephen De Young","text":"Well, I'll also say you have to always remember asceticism is giving up something good, not giving up something evil."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2185.57,"end":2186.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2189.81,"end":2228.15,"speaker":"Fr Stephen De Young","text":"Everyone is supposed to always give up evil. That's not a special calling, to not do evil. So celibacy is a form of asceticism because it is giving up something good. Right. This is a major difference that develops in the ethos of east and West. In Christianity, it just is. Right. You can't deny it. For St. Augustine and those who follow him in the west, sex is something evil."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2228.39,"end":2231.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or sort of a necessary evil or."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2231.43,"end":2232.07,"speaker":"Audience Member","text":"But right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2232.07,"end":2234.47,"speaker":"Fr Stephen De Young","text":"It's a necessary evil. It's a conditioned evil."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2234.83,"end":2235.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2235.07,"end":2262.25,"speaker":"Fr Stephen De Young","text":"It's an evil that is justifiable under certain very strict circumstances. Right. Whereas in the east, marriage, sexuality, producing children, these are good things. Good things. Right. There is nothing wrong with them at all. And so celibacy is giving up that good thing."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2263.21,"end":2263.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2263.69,"end":2308.84,"speaker":"Fr Stephen De Young","text":"Fasting is giving up a good thing, this food that God has put into the world for us to enjoy. Right. But we give it up for a time as a good thing, and monastics give it up sort of permanently. It's a permanent kind of asceticism. That's the first thing I'll say. The second thing I'll say. And this is. This is. I know this is one of my spicy takes from an Orthodox perspective, but I'm really with St. Jerome on the whole pilgrimage thing. Right. Well, I don't care. A lot of this visiting Mount Athos thing, to me is just spiritual tourism."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2309.4,"end":2311.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There are people who literally, just to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2311.4,"end":2336.99,"speaker":"Fr Stephen De Young","text":"Go hiking, there are people who go there for very sincere reasons. Right. I'm not saying everyone. I'm saying a lot of it. Right. Is this kind of spiritual tourism. And another piece of it is this idea, which is a false idea. And I don't care how angry this makes certain people, it is a false idea that there is some spiritual benefit you can derive from visiting Mount Athos that you can't get in any other way."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2337.63,"end":2339.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2339.95,"end":2341.15,"speaker":"Fr Stephen De Young","text":"That is a false idea."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2341.15,"end":2343.07,"speaker":"Fr Andrew Stephen Damick","text":"And I say someone having been there."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2343.38,"end":2372.77,"speaker":"Fr Stephen De Young","text":"Yeah. It's close to heresy. It's close to heresy because it's very close to denying the fact that Christ is present in your parish every. Every time you gather for worship. Because if Christ is in your home parish every time you gather for worship, there's nothing beyond Christ for you to benefit from spiritually. There isn't."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2372.77,"end":2374.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2374.53,"end":2385.57,"speaker":"Fr Stephen De Young","text":"And so I think this sort of false impression that there is some spiritual blessing or benefit from going to Mount Athos in particular, that can't be gotten in any other way or anywhere else."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2386.45,"end":2386.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2387.65,"end":2402.8,"speaker":"Fr Stephen De Young","text":"That idea causes a lot of this problem because if you have that idea, then you're saying, well, you're cutting off women from this spiritual benefit that they can't get anywhere else."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2402.8,"end":2403.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2404.32,"end":2411.6,"speaker":"Fr Stephen De Young","text":"And that's just false. For most of human history, almost no one could go to Mount Athos if they wanted to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2411.68,"end":2412.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2414.48,"end":2452.48,"speaker":"Fr Stephen De Young","text":"Yeah, right. If they had even heard of it, it was literally just physically impossible for them to get from where they were to there. And monastics at Mar Saba Monastery who spend their whole lives there are not somehow deprived spiritually because they didn't become monastics on Mount Athos. Okay, again, Platonism, the fact that Mount Athos is a very blessed godly place, the fact that it's the mountain of God, does not mean that everywhere else is somehow worse."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2454,"end":2454.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2455.2,"end":2460.4,"speaker":"Fr Stephen De Young","text":"In comparison. Is somehow bad in comparison. This is Plato brain again."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2460.56,"end":2460.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2463.92,"end":2504.81,"speaker":"Fr Stephen De Young","text":"So there's nothing that women are being shut out of by not being able to go to Mount Athos other than physically standing in a particular place. But any spiritual benefit that could be derived from a pilgrimage to Mount Athos, women have access to in other ways in other places, including just going to their home parish and finding Christ there. Right. So that's what I'd add to that. In terms of the Theotokos and pain in childbirth, this is directly related to Genesis 3."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2504.81,"end":2507.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That's what I was hoping we were going to say."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2507.53,"end":2588.45,"speaker":"Fr Stephen De Young","text":"Right? Yes. We talked about the curse. We've talked about this several times. But man and woman in the Garden of Eden, they both are given this task to put the world in order and to fill it with life. And each of them takes the lead in one of those, with the other one participating. Man takes the lead in terms of putting things in order, but woman participates in that. Woman takes the lead in filling the earth with life and bringing new life into the world. Man participates in that. And so when the curse comes in Genesis 3, the curse that affects each of them is you still have this role, you still have this task. But now it's going to be difficult. So Adam is told, you're still going to bring food out of the ground, but it's going to be hard. There's going to be thorns and thistles. You're going to do it by the sweat of your brow. And woman is told, you are still going to be the one who brings new life into the world, new human life into the world specifically. But. But life in the world in general. But now it's going to be painful and difficult for you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2589.81,"end":2590.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2590.53,"end":2600.21,"speaker":"Fr Stephen De Young","text":"And so what we're saying, when we say that Theotokos did not experience pain in childbirth is that Christ's birth was not under the curse."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2600.85,"end":2601.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2602.85,"end":2604.85,"speaker":"Fr Stephen De Young","text":"Christ was not born under the curse."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2605.33,"end":2605.89,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2607.17,"end":2618.19,"speaker":"Fr Stephen De Young","text":"And why is it important to say that? It's critically important to say that because when we get to the cross, but really throughout his life, but especially when we get to the cross."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2618.83,"end":2619.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2619.63,"end":2621.95,"speaker":"Fr Stephen De Young","text":"Christ is going to choose voluntarily."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2623.87,"end":2624.19,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2624.19,"end":2625.67,"speaker":"Fr Stephen De Young","text":"Take the effects of the curse upon."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2625.67,"end":2628.27,"speaker":"Fr Andrew Stephen Damick","text":"Himself, including subject to necessity."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2628.99,"end":2634.35,"speaker":"Fr Stephen De Young","text":"Right. He's not subject to it. He's going to choose to take it on up to and including voluntarily dying."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2634.99,"end":2635.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2636.75,"end":2665.81,"speaker":"Fr Stephen De Young","text":"So it's important to say that all of the suffering that Christ endures in his life is voluntary, not the result of him being under the curse. And that starts with his birth not being under the curse. Right. And his mother in childbirth not experiencing the effects of the curse is sort of the badge of that. Right. That from birth, Christ is not under the curse."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2666.21,"end":2803.9,"speaker":"Fr Andrew Stephen Damick","text":"There we go. All right, I hope that helps. Bethany, next question comes from Eric. Hello, Fathers. Thank you for everything that you both do. Forgive me if you answered this already, but my question is about the language surrounding the cross. What does it mean when our liturgical service is mentioned? We worship that resurrection or we worship thy cross. Is it okay to worship Christ's resurrection or the cross because they are in some sense a part of Christ or an extension of Christ? Is the cross in some sense almost like a relic of Christ because he was intimately on it and his blood was shed on it? I understand the typological significance of the wooden cross, but why don't we treat other objects or animals that Jesus touched in a similar, but perhaps less intense way? Why is the cross personified, for example, in hymns and evening prayers? I might be getting tripped up on the word worship, but it seems like there are certain things like the cross and the resurrection that have special treatment because of the role they played in Jesus life? Thank you in advance. All right. Yeah. So I wanted to take the initial shot at this, and since I haven't played this little jingle in a long time, I'm going to go ahead and play the etymology jingle. Father Andrews, etymology coordinate. Hey. All right. Yes. Why do we, as we say in our liturgical texts, worship the cross and the resurrection of Christ? I mean, if you. So if you look at the underlying Greek word for almost in almost all those hymns, it's usually some version of proskinevo or I'm sure I'm mispronouncing it in some way, but usually it's, you know, proskinismen or proskinumen. You know, we worship and I Mean, this is the same word that also gets translated as venerate. And so there's some ambiguity about exactly how you should translate it in English. And the word worship in English, it does simply come from the word worth in English. So worth ship, you know, that this thing, person, event, whatever, is worthy."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2804.94,"end":2805.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2805.26,"end":2989.78,"speaker":"Fr Andrew Stephen Damick","text":"And so that's why, for instance, in. I think this is still the case in British courtrooms, you call the judge your worship. When a couple is getting married in an Anglican church service, they say to each other, with my body, I the worship. They literally saying, I'm worshiping you with my body. Right. Which would make no sense if this is intended as idolatry. Right. That's not how it's intended, but rather it's the sense of veneration is what's going on there. And I think when the hymns get translated into English, sometimes there's word choices made which give the impression that Eric has gotten that, oh, wait, we're talking about worshiping the cross, but maybe venerating the saints or whatever. And I've noticed this pattern in the way that a lot of these translations happen is worship does tend to get used for these things that are closely associated with Jesus. And I mean, I think that there is. It's not that there's nothing to that. Right. The pattern you're seeing, Eric, where, like, the cross is personified and this kind of stuff, there is a sort of higher level of veneration being given. But we don't mean. When we say that we worship the cross, we do not mean that we're setting up the cross and offering sacrifices in front of it. Right. To the cross as to a God. Right. That's what worship in the sense that we use it now, what that really kind of means. And so the difficulty is that in English we have this word worship, which for most of its history has meant venerate, but now has this narrower sense of treating something as though it were a God. But I don't have a problem with that translation because I know about that. And frankly, sometimes worship having two syllables is the thing that the hypnographer needs versus venerate, which has three syllables. It fits with the melody better or whatever, but that's really what's going on there. It's not that worship in the sense of sacrifice is being offered to the cross or to the resurrection. It really is. In Greek, it's the same word as venerate. Right. It's literally the same word. It's centuries into the Christian history where proskinesis and Latria are kind of made technical terms that refer to the first one to veneration, the second one to worship, but in their basic sense, they mean bowing towards and serving. Right. That's what those words mean in their basic sense. So sometimes you can see, like proskinesis used in scripture to refer to worshiping God, but you can also see it used to refer to people just saying hello to each other, frankly. So I don't know. Father, do you have anything you wanted to add to that or."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2989.86,"end":2996.64,"speaker":"Fr Stephen De Young","text":"Actually, yeah, well, yeah, I'll say that in a way, etymology doesn't help us."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2996.72,"end":2998,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":2998.08,"end":3000.88,"speaker":"Fr Stephen De Young","text":"Not saying that what you just said, is it helpful? Yeah, that's not what I mean."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3000.88,"end":3001.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3002.08,"end":3034.36,"speaker":"Fr Stephen De Young","text":"But so, yeah, at a very basic level. So like as we described in the episode we did, the idolatry and then iconography episodes. Right. The reality is that what we now call worship and veneration in the common parlance. Right. What we're really talking about, there are these two existential phenomena. Right. There is something that people are doing and then there's another thing that people are doing."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3034.36,"end":3034.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3034.76,"end":3043.2,"speaker":"Fr Stephen De Young","text":"Actual different actions do, different experiences that people have. Right. And we're putting labels on those."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3043.93,"end":3044.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3044.81,"end":3060.65,"speaker":"Fr Stephen De Young","text":"Right. So that within a discussion, we can distinguish between those two existential realities easily. We put labels on them. Right. But when I say etymology isn't really helpful, I mean, the labels themselves are not really helpful."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3060.97,"end":3062.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. And part of the problem."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3062.17,"end":3063.09,"speaker":"Fr Stephen De Young","text":"And they break down."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3063.09,"end":3072.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And part of the problem with English is like, the word worship is kind of in flux right now, frankly. You know what it means at our point in history. That's just the way that it is."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3074.12,"end":3086.76,"speaker":"Fr Stephen De Young","text":"Yeah. And so the best example of this is comparing the Greek and the Latin already early on. So the word proskinemo literally means to bend the knee."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3087.56,"end":3088.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3088.6,"end":3107.93,"speaker":"Fr Stephen De Young","text":"Right. That's what it very literally means, to bend the knee. That's the word we use for veneration. Right. Bend the knee. Adoremus. In Latin, the word that's used for worship as opposed to veneration. You know what it literally means to bend the knee."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3109.29,"end":3110.01,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3112.97,"end":3120.81,"speaker":"Fr Stephen De Young","text":"Right. But that doesn't. You will get some people saying, oh, see, there's confusion. Those words don't really mean different things. Da, da, da, da da. They don't."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3122.57,"end":3123.21,"speaker":"Fr Andrew Stephen Damick","text":"They don't."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3123.45,"end":3141.55,"speaker":"Fr Stephen De Young","text":"In and of themselves, words don't mean anything. Words derive meaning from usage. Right. They're just two labels that we use in order to talk about these two realities. And obviously they're going to be different words in different Languages."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3141.71,"end":3142.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3142.03,"end":3152.43,"speaker":"Fr Stephen De Young","text":"There could be different words. Right. So the question isn't when we're dealing with something like this, like worship."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3153.2,"end":3153.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3154.08,"end":3166.4,"speaker":"Fr Stephen De Young","text":"It isn't. Oh, oh, see, that word means X and you're applying it here. And therefore there's a problem. Right. The question is always how is that word being used in this instance?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3166.64,"end":3170.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What is the actual action being referenced? Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3170.24,"end":3184.16,"speaker":"Fr Stephen De Young","text":"What is the reality that that word is attempting to communicate in this instance? And so then the second piece of that is that. And I think your example of the resurrection makes this very clear. We also say at one point that we worship Christ's pass."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3184.71,"end":3186.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah, Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3186.55,"end":3188.47,"speaker":"Fr Stephen De Young","text":"Christ's resurrection is not an object."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3189.43,"end":3189.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3190.55,"end":3193.27,"speaker":"Fr Stephen De Young","text":"Right. Cross, you could take it a bunch of different ways, right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3193.27,"end":3193.67,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3195.19,"end":3198.47,"speaker":"Fr Stephen De Young","text":"But resurrection, that's not it. There's no way to say that's an object."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3198.47,"end":3203.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a thing. You could put sacrifices on an altar to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3203.19,"end":3213.84,"speaker":"Fr Stephen De Young","text":"You could think of a way to do that. Like you could refer to Christ's tomb, his empty tomb. Right. Which could be an object or could be referencing his resurrection."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3213.92,"end":3214.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3216.16,"end":3234.72,"speaker":"Fr Stephen De Young","text":"And I think that example shows us part of what's going on with Christ's cross. Right. Christ's cross can refer to the physical object. Right. The true cross, or it can refer to his suffering and death on that cross."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3236.33,"end":3236.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3236.53,"end":3338.27,"speaker":"Fr Stephen De Young","text":"Just like the empty tomb can refer to the physical tomb that you can go visit the Church of the Holy Sepulcher. Right. Or it could refer to his resurrection. And part of this is that we don't have, as modern folks, even in the Orthodox Church, a good enough understanding of what energy means energia, that it doesn't just mean an activity or an event. It is the agent of the activity, performing the activity. This is why we talk about the divine energies. We say the divine energies are God himself. Right. Doing something. So the divine energy of love is not just love in an abstract sense or the activity of loving, even in an abstract sense. It is God loving a person, his creation. Right. It is God in the act of loving. And so in the same way, when we talk about Christ's resurrection, we're talking about not just rising from the dead. Right. But the person of Christ rising from the dead. When we talk about the cross, we're not just talking about suffering or crucifixion or death. We're talking about Christ suffering, Christ, crucified Christ, death. Right. And so worshiping the resurrection of Christ and worshiping Christ are not two different things."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3340.2,"end":3340.44,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3340.68,"end":3355.72,"speaker":"Fr Stephen De Young","text":"Right. When we say we worship Christ's resurrection, that means we worship the resurrected Christ because energies aren't separable from person. They include the person doing it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3356.36,"end":3465.73,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we have a couple more before we're going to take a break. And this next one comes from Jesse. Good evening, fathers. I had a question on how to approach solving problems in our own lives. Fortune is said to favor the bold, and more specifically, God helps those that help themselves. Prayer is meant to be a constant. This is understood. But I have been pondering how to envision what our physical efforts are to look like when working in the world. Take supporting our families, charitable endeavors, even building a business as arbitrary examples, something with improvement or growth as the goal. Fatalism doesn't feel to seem right for exactly what I'm trying to describe here. So much that we pray and things just happen because they were pre decided by God and prayer opened us up to the understand what was expected of us or was more or less predestined to occur. Many biblical examples you've covered in the show are related to prophecies requiring action to fulfill. They don't just happen or fall into our laps. God expects us to climb the mountain, to reach the top, as it were. But how are we to interpret effort or hard work towards something that would not occur without them or with God working alongside us? Short version, how much does God help us? Or how much does God help those that help themselves? The podcast has been a real blessing, by the way. I've been looking into Orthodox churches locally. So do you have any recommendations for Atlanta churches? There's one big Greek one and a bunch of small ones strewn all over the place. So any idea if you had any references on it? Thanks. All right, well, to that second question, I'll just briefly say go to orthodoxintro.org that's part of why the site exists, to help people find local parishes they can connect to. And also you can ask whatever questions you like about Orthodox Christianity and the priests there will help you out. So how much does God help those who help themselves? Is it 90%, 75%?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3467.33,"end":3471.25,"speaker":"Fr Stephen De Young","text":"I endorse neither Cicero nor Ben Franklin."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3471.33,"end":3596.69,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah. I think this, I think the paradigm. Right. I understand why Jesse is asking this question. It makes sense to me. Right. But I think that this is the kind of thinking that leads into, you know, that whole world, particularly where Calvinism rules, which says, like, you contribute nothing to your salvation except the sin or stuff like that. Right. You know, and all your righteousness is filthy rags because, like, there's this idea that salvation is this kind of quantity, you know, if you get so much. Maybe then there's a salvation, you know, that it adds up to or something like that. But, but really the, the thing that's being achieved by God is salvation and God is the one who achieves salvation. But whatever effort God asks us to do is not because like, okay, look guys, I've got 98.5%, but you're going to have to give the other 1.5% because 98.5 is all I've got. Okay? Like, that's not, that's not what he's saying at all. It's really that the whatever effort we put in the good works that we do is the means through which we receive the salvation of God. You know, it's we by grace are you saved, right? Like, it's not like we disagree on that with the Reformation, but by grace you're saved through faithfulness and that not of yourselves, it is a gift of God, meaning not that God makes you into a faithful person whether you like it or not, but that God gave you the way of faithfulness and so you have to embark upon it. And when you do, then you receive, you receive salvation, that grace of salvation through that. So it's not that there's a, you know, everyone putting in his part kind of thing, like, and then everything adds up to 100% and that's salvation. So I mean, that's what I would would say to that. I don't know. Father, you have anything else to add?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3597.97,"end":3661.02,"speaker":"Fr Stephen De Young","text":"Yeah, I mean it's, yeah, you got to get past the whole God for ordaining things because that kind of falls apart when you realize that God doesn't exist in time. So God isn't here in the present like thinking about what's going to happen tomorrow, let alone deciding what's going to happen tomorrow because. Right. That's making God a big human. Yeah, like a more powerful human. Right. But so yeah, as you were saying, our actions, right, our energia, our energies, our ability to act in the world, us acting in the world is the means by which we participate in what God is doing in the world. So God doesn't need us to do anything to bring about what he's going to bring about through his action. The question is, will you be part of it or not?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3662.57,"end":3662.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3663.21,"end":3714.18,"speaker":"Fr Stephen De Young","text":"Right. So God is transfiguring and transforming and saving the whole creation. We get to choose to be a part of that or not. And that's not a one time choice you make to become a Christian. Right? That's a choice we make continuously Right. God loves the person who you see on the side of the road asking for help. God loves them. Do you want to participate in that or not? Alms giving is you participating in that. You concretely going and helping that person through your own efforts is you participating in God's love for that person. And you participating in God's love for that person is going to transform you, and that is where you are going to experience God's love."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3716.61,"end":3716.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3718.45,"end":3756.34,"speaker":"Fr Stephen De Young","text":"So this is. And this is ultimately like when we did the episode talking about the Last Judgment and eternal condemnation. Eternal condemnation comes to those who have just decided to opt out. And that's exactly what the parable of the sheep and the goats says to them. Yeah, I was hungry and you did not feed me, I was thirsty. You had all these opportunities to participate in my love, in my salvation of the world, in my bringing justice. Right. Establishing justice in the world. You had all these opportunities to participate and you opted out."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3756.66,"end":3766.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting to note there in Matthew 25, it's not you did this evil thing, and you did this evil thing and you did this evil thing. It's you didn't do this good."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3767.86,"end":3777.15,"speaker":"Fr Stephen De Young","text":"Yeah. You just said, no, thanks. God is doing one thing in the world. I don't want to be a part of that. And so then Christ says to them at the Last Judgment. So you're not a part of that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3777.87,"end":3778.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3779.63,"end":3781.63,"speaker":"Fr Stephen De Young","text":"You're not a part of it. You didn't want to be."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3782.11,"end":3782.67,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3784.43,"end":3801.32,"speaker":"Fr Stephen De Young","text":"So that's what we're talking about. Right. So, yeah, it's a question of being a part of what God is doing. And we call that doing good because definitionally, what God is doing is good."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3801.48,"end":3805.24,"speaker":"Fr Andrew Stephen Damick","text":"And all that is good, that is being done is of God."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3806.04,"end":3806.44,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3806.76,"end":3873.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. All right, we've got one more question to tackle before we take our first break. And this comes from Carl. Hey, Father Steve. And Father Andrew Damick. My name is Carl and I'm from Austin, Texas. My question is, it seems that comparatively speaking, the catechumen process today is remarkably short compared to the early church. And I believe this because a lot of times we teach an intellectual understanding of the faith as opposed to like a more noetic, experiential version of the faith vis a vis. Like, instead of teaching how to repent, we teach theology. If I am right, what is the antidote to this type of faith? I do fear that, like other faiths and cultures that have been represented in America, once Orthodox and Orthodoxy is new, once Orthodox culture becomes like, in a sense, placed in a Neat box. It'll then be placed on the shelf and it'll be forgotten. And sorry to be blunt, but to what extent does Lord of Spirits kind of teach this version of the faith? That's my question. Thank you very much."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3874.29,"end":3874.61,"speaker":"Fr Stephen De Young","text":"All right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3874.61,"end":3884.29,"speaker":"Fr Andrew Stephen Damick","text":"We've been called out. I mean, it's true. I mean, in the ancient church, I think falsely. Okay, yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3885.25,"end":3890.05,"speaker":"Fr Stephen De Young","text":"Because I basically agree with him, and I'm totally against that kind of catechism. Reversed."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3890.05,"end":3895.65,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yeah, yeah. I mean, in the ancient church, catechesis is three years long."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3896.61,"end":3897.97,"speaker":"Fr Stephen De Young","text":"Well, it's one to three years."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3898.21,"end":3899.01,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3899.01,"end":3900.17,"speaker":"Fr Stephen De Young","text":"So it wasn't always three years."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3900.17,"end":3901.46,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's true."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3901.54,"end":3905.78,"speaker":"Fr Stephen De Young","text":"It was one to three years, depending on the way of life the person was coming from."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3906.42,"end":3963.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because it's about way of life. And I mean, we both agree with you, Carl, like, that catechesis should be. I always. This is how I. This is how I talk about when I talk to other clergy. And I'll be honest. Like, so I was. I was a pastor for 11 years, and I kind of did the orthodoxy 101 thing for catechesis for the majority of that time. And then I started realizing, like, wait a minute. Is this actually accomplishing the thing that I want it to accomplish? And I started to shift it away from that. So I didn't get to work on this for too long. But I've noticed some other clergy also doing this. But here's the way that I describe it to clergy. I say, look, you know, what, to you, is the ideal parishioner? What do they do? What does their life look like? Why aren't we teaching that in catechism? Because we're largely not, you know, we're giving people an elementary introduction to the seven ecumenical Councils effectively. And maybe some other stuff."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3963.1,"end":3964.02,"speaker":"Fr Stephen De Young","text":"Memorize the dates."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":3964.1,"end":4111.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is, you know, it's fine. Like, that's good information. But I've always said, like, you know, almost everything that's being taught in this sort of orthodoxy 101 stuff, just hand them Timothy Ware's the Orthodox Church. And 95% of that is in there. Frankly, they could just read that one book and get most of that. But really, like, okay, here's how you pray at home. Here's how you keep meditative silence. Here's how you give an appropriate amount from your income. Here's how you keep the fasts and the feasts. Here's how the how is really, I think, should be the main emphasis. And if you look at a lot of the Catechetical material from the ancient church. A lot of it is about developing virtue, being better at living the Christian life. So, I mean, we're super on board. And the thing I'll say about, you know, I mean, I appreciate, I appreciate what you say, Carl. Like, are we engaging in that by offering something that is a sort of hyper intellectualized thing? We've been super explicit from day one, I think. And, you know, if this dead horse has not been pulverized into a bloody pulp by now, we'll just beat it again. Which is like, if you're listening to all this and just kind of going, oh, that's neat, and not implementing it, then you're missing the whole point of, of, of the podcast. Like, we're. What we want people to do is to become more faithful using the, the knowledge that we might happen to be passing on to them. That's the whole point. Right. And so now understanding the scripture, understanding ancient history, understanding the early church fathers better is part of the picture to becoming more faithful. But this, of course, cannot replace the training that you receive at your parish. It should, God willing, be enhancing it and making it deeper and making people want that training. That's our whole deal. I mean, I know there's people who listen, go, wow, that's weird, cool, crazy giant stuff or whatever. Um, but that's not, that's not our goal with the podcast. This is not just nerd fest. You know, that's. I mean, as much as I enjoy a good nerd fest, don't get me wrong, I do. But that's not, that's not our goal at all. But thank you for giving us the opportunity to say that again."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4113.68,"end":4130.4,"speaker":"Fr Stephen De Young","text":"Yeah. And well, and yes, like, I am 100%. Let's be honest here. Okay. So Christian education is not an orthodox strong suit in the Anglophone world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4130.56,"end":4131.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4132,"end":4152.7,"speaker":"Fr Stephen De Young","text":"And we're basically using. Adopted from our seminaries being accredited by Protestant accreditation agencies, meaning that's the model we're forced to use in order to get that accreditation to catechesis being great value, RCIA to whatever. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4152.78,"end":4155.18,"speaker":"Fr Andrew Stephen Damick","text":"Like, you sent me into a coughing fit with that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4157.26,"end":4436.68,"speaker":"Fr Stephen De Young","text":"We're right. Like, and a lot, a lot. Maybe everything I do or close to it is trying to create an alternative to that. Just speaking for myself in terms of how catechesis works in my parish and has since I've been in this parish, meaning I'm the one who gets to make all those decisions. Pretty much. I don't teach classes. There are no classes. The reason it's a minimum of A year is so that you can come to a full cycle of services. And if it ends up being longer than a year for you here, it's because you didn't attend church services enough. And what I do do then is during Lent and Advent, during those fasts on Sundays, I have a period of time where I answer questions. I just sit and I answer questions. And the people in the catechumenate have first dibs on asking questions. And I answer the questions they have from being part of the community. And what's great about it is I very rarely get questions about the dates of ecumenical councils. What I get questions about are figuring out a prayer rule. What does this mean when we do it? Why do we do this? Right. They're actual legitimate questions about the orthodox Christian way of life. They're not asking me questions that my cradle Orthodox parishioners wouldn't know the answer to. Right. So that's how I do it practically. But you look at the books I have, I've written like whole Council of God was written to be part of a catechism series originally. I won't go into all the history of that, but that's what it was originally written for. And then it got expanded a little. Right? But that's because unlike the early church, adult people coming into the Orthodox church have been taught their whole lives a certain way to read and understand what the Bible is. Right. And it's not an orthodox way of understanding what the Bible is and approaching reading it and that kind of thing. You could probably say the same thing about religion of the apostles that I know some people use for in catechesis. Right. It's presenting another way of reading the Scriptures that is not the way most non Orthodox people were taught to read the scriptures or absorbed from the culture about how to see and read the Scriptures. Because a big part, not to infringe on Dr. Jeannie's territory here, but a big part of the transformation that needs to happen through catechesis is coming to a new way of both living in the world, as Father Andrew just emphasized, and also on the passive side, receiving and understanding and interpreting the world and interpreting your experiences and interpreting the Bible and understanding the relationship between worship and my day to day life. And that shift has to, has to happen. And for that shift to happen, we have to take people from where they show up at the door. And most of my stuff, including podcast stuff, has been aimed at primarily people coming out of a Protestant background and approaching Orthodoxy, trying to help take them from there to where the Orthodox Church is. But that is stuff that has to be addressed. We can't just take that for granted. That's not intellectualizing things. Right. There are things that people believe. The average Protestant person who walks in an orthodox church for the first Time believes that St. Paul teaches XYZ and XYZ are false and not what St. Paul teaches. Right. And if I don't address that at some point biblically. Right. Then there's going to be this dissonance for them because they're going to hear the liturgy of the church, they're going to read the church, hear the teachings of the church. There's going to be this dissonance between that and what they think the Bible says."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4438.76,"end":4439.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4440.45,"end":4445.49,"speaker":"Fr Stephen De Young","text":"So at some point we have to address. Well, no, what you've been taught the Bible says. That's not actually what it says."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4445.97,"end":4446.53,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4447.73,"end":4458.37,"speaker":"Fr Stephen De Young","text":"That's not intellectualizing. That's meeting. Meeting people where. Where they're at. Right. But again, if we only do that and we do that in a classroom format, that's not catechesis."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4458.61,"end":4459.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4460.05,"end":4475.16,"speaker":"Fr Stephen De Young","text":"Catechesis, really proper is the other, but it has to include dealing with the people who we have. Right. So in the early church. Right. They had to do some different things because they have people showing up who were pagans."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4475.72,"end":4476.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4476.2,"end":4489.48,"speaker":"Fr Stephen De Young","text":"Like real legit pagans, not modern Protestant pagans, like legit full on ancient world pagans. They had people showing up who had practiced pederasty their whole life. And this was an accepted cultural institution."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4490.69,"end":4491.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4491.41,"end":4525.31,"speaker":"Fr Stephen De Young","text":"Right. You want to talk about a challenge in catechesis. You want to talk about something that takes three full years, if not more. There it is. Right. Most of the people who walk in my door, that's not where they've been at their whole lives. Every once in a while you have someone who's been through some stuff and. Right. And then you have to adapt catechesis to that. Right. But that's not the average person now. Right. The average person who I end up doing catechesis within my church, frankly, was some kind of Christian in the past."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4525.55,"end":4526.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4527.87,"end":4548.6,"speaker":"Fr Stephen De Young","text":"Of some sort. Even if it's just like. Yeah. When I was a little kid, my mom took me to X church. Right. There is some kind of Christian thing there. Right. And a lot of them have not been, you know, deeply involved in the kind of sexual immorality that marked out the Roman world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4548.6,"end":4549,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4549.08,"end":4549.48,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4550.28,"end":4551.12,"speaker":"Fr Andrew Stephen Damick","text":"No. Thank God."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4551.12,"end":4558.6,"speaker":"Fr Stephen De Young","text":"There are other issues. There are other issues of sin and other things, but it requires a different approach. You have to meet the person where they're at and get them."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4559.64,"end":4560.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4560.36,"end":4561.8,"speaker":"Fr Stephen De Young","text":"Right to where they need to be."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4562.04,"end":4573.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, we're going to go ahead and take our first break and we'll be right back with the second half of this pre recorded episode of the Lord of Spirits, Father Andrew Stephen Damick and father Stephen DeYoung."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4573.86,"end":4575.1,"speaker":"Fr Stephen De Young","text":"We'll be back in a moment to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4575.1,"end":4579.06,"speaker":"Fr Andrew Stephen Damick","text":"Take your calls on the second half of the Lord of Spirits."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4579.62,"end":4584.9,"speaker":"Fr Stephen De Young","text":"Give them a call at 855-237-2346."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4585.46,"end":4588.66,"speaker":"Fr Andrew Stephen Damick","text":"That's 855-AF-ADIO."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4589.14,"end":4596.78,"speaker":"Fr Stephen De Young","text":"Ancient Faith Radio is brought to you by our listeners with help from Faith Tree Resources. Have you ever felt distracted or disengaged."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4596.78,"end":4599.69,"speaker":"Fr Andrew Stephen Damick","text":"In church but weren't quite sure what to do about it?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4600.16,"end":4603.56,"speaker":"Fr Stephen De Young","text":"Divine the Greatest invitation is the newest."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4603.56,"end":4605.88,"speaker":"Fr Andrew Stephen Damick","text":"Video course brought to you from faithtree."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4605.88,"end":4617.04,"speaker":"Fr Stephen De Young","text":"Resources and will help you better understand and experience the peace God offers to us in the Divine Liturgy. This four part series, taught by some of the church's most respected leaders, will."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4617.04,"end":4619.32,"speaker":"Fr Andrew Stephen Damick","text":"Equip you with resources and tools to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4619.32,"end":4635.26,"speaker":"Fr Stephen De Young","text":"Help you more deeply encounter the one true God. Whether you're a parent hungry to teach your children, a pastor looking for to equip your faithful, or someone who wants to learn how to actively be present in the Divine Liturgy, this course is for you. Go to faithtree.org to get your copy today."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4635.34,"end":4647.66,"speaker":"Fr Andrew Stephen Damick","text":"That's faithtree.org we're back now with the Lord of Spirits with Father Andrew Stephen Damick and father Stephen DeYoung."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4647.9,"end":4658.16,"speaker":"Fr Stephen De Young","text":"If you have a question, call now at 855-852-372346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4661.52,"end":4677.36,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. This is the second half of the Lord of Spirits. I hope everybody's enjoying a good American Thanksgiving. Or if you're in some other place, it's okay to give thanks today too. Actually, in everything give thanks. So isn't every day Thanksgiving?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4679.14,"end":4682.34,"speaker":"Fr Stephen De Young","text":"I guess every day we celebrate the Eucharist."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4683.14,"end":4716.36,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So. Exactly. So see our Thanksgiving episode from last year, right? Yeah. So this is an asynchronous Q and A episode. And so this is pre recorded. So we're not taking any live calls this time around. But we got a bunch of calls that you guys have left on our voicemail for the last several months. And so we're just kind of rolling through a number of them. And this first one for this half comes from Jonathan. Hello, Fathers. My name is Jonathan from Maryland. For the last 22 years of my life, I've attended a Southern Baptist church."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4716.52,"end":4719.4,"speaker":"Fr Stephen De Young","text":"And recently, between sessions of burning Harry."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4719.4,"end":4721.24,"speaker":"Fr Andrew Stephen Damick","text":"Potter books and standing Very still while."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4721.24,"end":4727.4,"speaker":"Fr Stephen De Young","text":"Contemporary music plays I felt the Holy Spirit guiding me away from Protestantism and tentatively towards Orthodoxy."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4728.44,"end":4737.11,"speaker":"Fr Andrew Stephen Damick","text":"This past Sunday, my church had a very special service celebrating Independence Day. As the children waved their American flags, the confetti cannon shot red, white and."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4737.11,"end":4738.19,"speaker":"Fr Stephen De Young","text":"Blue paper into the air."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4738.35,"end":4744.55,"speaker":"Fr Andrew Stephen Damick","text":"And I couldn't help but think it mildly inappropriate for a worship service. Keeping in mind how blessed we all."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4744.55,"end":4747.55,"speaker":"Fr Stephen De Young","text":"Are to live in an age allowing the freedom of religion, I began to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4747.55,"end":4758.72,"speaker":"Fr Andrew Stephen Damick","text":"Wonder what role, if any, fervent patriotism should play in the Christian faith, considering the atrocities committed every single day against our unborn. In essence, my question is, as an."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4758.72,"end":4764.04,"speaker":"Fr Stephen De Young","text":"American Christian, where should love of country fit into my life? Should it be a separate entity from my faith?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4764.6,"end":4767.96,"speaker":"Fr Andrew Stephen Damick","text":"I hope this question makes some sense, and if it doesn't, I apologize and."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4767.96,"end":4769.4,"speaker":"Fr Stephen De Young","text":"Remind you that I am a Baptist."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4769.64,"end":4843.84,"speaker":"Fr Andrew Stephen Damick","text":"God bless you both. That's our second Baptist for the episode. I'll say, by the way, again, as a former Baptist myself, occasionally having attended Southern Baptist churches, what Jonathan said about his actual experience in church, from the burning of Harry Potter books to standing stock still during special music, to confetti cannons being used for Fourth of July services, that is all potentially real in those contexts. I mean, it's also like if you were trying to come up with a sort of caricature of the way that some of these churches function, those are things you might put in there, but it's all completely plausible, actually. So, Jonathan, I don't know if you're exaggerating at all, but I'm here to believe you. Yeah, I mean, this is actually kind of a bad question to ask me personally because I'm a third culture kid, so I don't feel a particular, like, patriotic attachment to any country. It was sort of tweaked out of me from a young age, but I would, you know, my thought about this is you can love your country, you can love your society."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4844.88,"end":4845.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4845.68,"end":4937.19,"speaker":"Fr Andrew Stephen Damick","text":"Without putting it first in your life. You know, that, that you love the place you're in, you give yourself for it. Right. Not. But not in a way that puts God second or is used as a weapon against other places and cultures and whatever that. That your love for your country should be in some ways, like your love for your family. Although I would put it at an even lower level in that, you know, it's. It's within your love for God and it's within your. The general love you should have for other human beings. And there's nothing wrong with loving the place that you're from. Like one of the things I wish I had was a hometown so I could love the place that I'm from. I'm not from anywhere now. My kids, thank God, are. They're from this place that I live in now, and we've decided to raise them here. This is where they're from. When someone says, what's your hometown? They can say, emmaus, Pennsylvania. I don't have one. But at the same time, you can love the place you're in. And I think that, you know, confetti cannons on Sunday morning for Fourth of July. Yeah, I think that's. I think that's nuts. And I. And honestly, I know. I mean, I know plenty of Baptists that I'm related to who also think it's nuts. Right. Who think that that's crazy. So it's not like they're all doing that or everyone's saying that this is the way that it should be. So, yeah, that's. That's my 2 cents on patriotism as a Christian. Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4937.19,"end":4945.11,"speaker":"Fr Stephen De Young","text":"Part of the. So part of the thing with this, too, is that patriotism means something fundamentally different in the United States than it means in any other country in the world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4945.11,"end":4945.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh, indeed."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":4948.08,"end":5006.08,"speaker":"Fr Stephen De Young","text":"And this is one of the problems when you try to have a conversation about this in Orthodox circles, just to clue you in, because you'll. This is funny now, but oftentimes, for example, they'll quote various Russian statements about patriotism. Not that Russian patriotism could ever go anywhere bad, but even in those cases, they'll talk about. And, you know, they'll. They'll talk. You'll see Orthodox statements from other countries talking about the love of homeland, and they'll say, oh, see, so American patriotism. Good. I don't know if you know this. This is absolutely true and amazed me. So there's a. If you go to a German public school, like in Germany, right. There's a textbook that's used to describe government propaganda. So German students can learn about government propaganda, and it's all about the United States."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5006.88,"end":5007.44,"speaker":"Fr Andrew Stephen Damick","text":"Yay."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5007.92,"end":5026.32,"speaker":"Fr Stephen De Young","text":"Big American flag on the COVID Right. So, like, American patriotism is. You're. You're supposed to think the United States is the greatest country in the world, if not in the history of the world. Right. Like, most other countries don't actually think that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5027.38,"end":5029.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5029.22,"end":5037.38,"speaker":"Fr Stephen De Young","text":"Right. And it's not because, well, they know the US Is actually the greatest country in the world. It's that they don't think that way."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5037.54,"end":5038.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that. That's a thing."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5039.54,"end":5064.49,"speaker":"Fr Stephen De Young","text":"Right. Essentially. That hasn't always been true. Right. If you Go back to the 19th century. Right. Everyone in Europe thought that way. We've Talked about our 19th century German friends who thought that German culture, German religion, was the pinnacle of the history of human civilization."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5064.89,"end":5079.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And especially when you've got, like, an empire or the makings of one or the remnants of one that you're living in, you're more likely to think that your country is the apotheosis of. Of human society."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5080.54,"end":5152.85,"speaker":"Fr Stephen De Young","text":"Yes. It is not very hard, if you really do some deep reading, this is even later, this is 20th century, to find things in, say, the writings of Winston Churchill from the early 20th century about the British Empire that if you swapped out the British Empire for Germany, sound like Hitler. It's not hard at all. Right. So the British thought that way about the British Empire. The French thought that way. The Germans thought that way. Right. They all thought that way. But then World War I happened and was a result of that nationalism. Right. That secular nationalism that grew over the 19th century, where what had been religious fervor before the disaster of the Thirty Years War was transferred over into nationalist fervor. And all of this religious iconography was transferred over to the iconography of the state. World War I, World War II. That broke Europe of those kind of ideas. Right. And the world is basically made up of European countries and countries that are former European colonies. That includes the United States."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5155.65,"end":5156.43,"speaker":"Fr Andrew Stephen Damick","text":"Mostly. True."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5157.54,"end":5169.18,"speaker":"Fr Stephen De Young","text":"And. And most of the colonies. Right. Did not. Right. Have any of that going for them because they had been subjugated by one of those European countries that thought they were the greatest thing in the world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5169.18,"end":5169.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5172.02,"end":5218.37,"speaker":"Fr Stephen De Young","text":"But so the United States has gone through this process late. Right. This process of secularization and the things of religion being transferred to the state has mostly happened in the United States since World War II. World War II is sort of the last nail in the coffin of it in Europe. It's where it begins in the US you can trace the decline of religion over the course of that period and the transference of that to the state. And so American patronism is sort of this different animal that has this. These religious overtones to it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5219.25,"end":5219.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5219.65,"end":5221.49,"speaker":"Fr Stephen De Young","text":"That it doesn't have in most other countries."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5221.57,"end":5222.77,"speaker":"Fr Andrew Stephen Damick","text":"City set on a hill."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5223.49,"end":5267.06,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Manifest destiny, all of these things. Right. Like. And you still have Western Civilization courses taught in the United States where the unit. You know, it starts in Sumeria, it starts in ancient Sumer. Right. Diverts through Israel, then goes into ancient Greece, and then ultimately you end up talking about the United States after World War II, and that is presenting the United States the same way the 19th century Germans presented Germany. This is now the pinnacle of Western civilization, the pinnacle of all of human history. Right. We've now arrived in the United States."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5268.1,"end":5268.82,"speaker":"Fr Andrew Stephen Damick","text":"Huzzah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5269.78,"end":5317.36,"speaker":"Fr Stephen De Young","text":"So that obviously, to be blunt, that part of it has no place in Christian life. 0 It is at best heretical Christianity and at worst just a false non Christian religion. Karl Barth actually prophesied this, by the way. Karl Barth, the German theologian, said that the three great threats to the church from when he wrote this in the 1930s. Right. Would be fascism, though that was kind of obvious being a German in the 1930s, followed by communism, followed by Americanism."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5318.24,"end":5318.72,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5323.92,"end":5330.48,"speaker":"Fr Stephen De Young","text":"So. Yeah. Now that's not. What I just said is not counter to what Father Andrew said."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5331.28,"end":5333.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't think we're disagreeing at all."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5333.28,"end":5358.45,"speaker":"Fr Stephen De Young","text":"If by patriotism you mean you love the people of your country or even, you know, your culture, like the cultural elements, your heritage. Yeah, right. That. We're not saying that's wrong. Right. Loving your own hair. Unless it takes the form of denigrating other people's heritage and denigrating other people. Right, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5358.45,"end":5362.53,"speaker":"Fr Andrew Stephen Damick","text":"Like between distinction and sort of sectarianism."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5363.33,"end":5364.37,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5365.65,"end":5366.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5366.86,"end":5370.5,"speaker":"Fr Stephen De Young","text":"Okay. And this is hard for me to say as a member of the Dutch."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5370.5,"end":5370.94,"speaker":"Fr Andrew Stephen Damick","text":"Race."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5372.78,"end":5377.74,"speaker":"Fr Stephen De Young","text":"To admit that maybe other people who aren't Dutch are equally human, but."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5377.74,"end":5378.94,"speaker":"Fr Andrew Stephen Damick","text":"Could be just as much."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5379.66,"end":5382.54,"speaker":"Fr Stephen De Young","text":"But if I can bring myself to do it, so can you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5384.62,"end":5390.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, with that said, now we've got one from Murray."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5392.87,"end":5393.51,"speaker":"Audience Member","text":"Hi, Fathers."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5393.51,"end":5398.03,"speaker":"Fr Andrew Stephen Damick","text":"My question is about the wills of angels. You mentioned in a very early episode."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5398.03,"end":5406.63,"speaker":"Audience Member","text":"That the fallen angels have had five different falls. And I'm wondering if the wills of fallen angels and of good angels are now fixed."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5406.87,"end":5471.87,"speaker":"Fr Andrew Stephen Damick","text":"If they are fixed, when exactly did the angels wills become so? And if they aren't fixed, why couldn't we see good angels fall in the future? Thank you. All right. Well, number one, I'm just going to recommend look again at those sections we've recommended many times in Saint John of Damascus's exact exhibitions of orthodox faith, where he talks about angels and demons. I mean, as I recall, he says that there's not going to be. Number one, as we know, the angels cannot repent, so demons are not going to revert. But also he says that there's not going to be any more falls because God is preventing that from happening. He just puts it that way. He doesn't come up with some sort of mechanism for it or rationale or anything like that. Just simply that God is preventing any further falls from angels. I Mean, when exactly did that happen? I mean, that's another bat question. Right? Angels in time."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5475.35,"end":5491.59,"speaker":"Fr Stephen De Young","text":"Yeah, the. So, yeah, as we've said before, we don't know what it's like to be an angel. We don't know how angels experience time, but we know since they don't have material bodies like ours, that it's different from the way we experience time."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5491.83,"end":5492.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5492.87,"end":5560.99,"speaker":"Fr Stephen De Young","text":"So this is part of the wibbly wobbly timey wimey thing, right, that when we talk about, like the 5ish falls of the angels, right, we're talking about points in human history, in the human experience of time, where the fallen state of those angelic beings is revealed or becomes experiential reality for humans. Right. This is hard, but we need to lay this groundwork anyway because there's a future question coming up. It's going to be related to this. Right. So that is to say, right, you can't put a date on when this or that quote, unquote, group of angels fell from their perspective because that would require their understanding of time."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5561.31,"end":5561.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5562.43,"end":5592.81,"speaker":"Fr Stephen De Young","text":"What we can talk about is when that entered into the world of human experience. So the devil's fall intersects with human history in Genesis 3. That's where it intersects with human history. That doesn't mean that's the day it happened from the devil's perspective, which we can't know or understand, let alone God's perspective. Right. But that's where it intersects with human history."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5594.57,"end":5594.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5594.93,"end":5630,"speaker":"Fr Stephen De Young","text":"And then if you want to talk about the angels who left their former estate for the flood after the flood, Right. The angels put over the nations at the Tower of Babel. Right. There are points at which this enters into our human experience, the world of human experience into human history, where it intersects with it. Right. That is where we pinpoint it to. But that's not reflective of the angels experience, God's experience, et cetera, et cetera, et cetera."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5630,"end":5630.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5632.85,"end":5638.29,"speaker":"Fr Stephen De Young","text":"And yeah, we'll come back to this, as I said, under another question, but very, very soon here."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5638.37,"end":5646.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay. So this is one from Maria, who I'm pretty sure we've taken questions from her before. I definitely recognize her voice. So here she is."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5648.13,"end":5734.38,"speaker":"Audience Member","text":"Hi, Podfathers. I've asked something on the podcast before, but I got so excited when you answered my question about giants that I decided to ask another question, this time more of an application question. So I've always acutely felt the suppression of the materialistic framework of understanding that I've inherited. And so when I started listening to this podcast, it was like Discovering a continuum of understanding where the cosmos and my faith as an Orthodox Christian finally made sense, were filled to overflowing. But I go to a Presbyterian classical school and a very Calvinist school, unfortunately. And when I get into the flow of the school year and I'm in Bible class or discussing the faith or even just classics and what morality is and things like that, I feel like I've been cut off from that continuum of understanding that I've found. Like I've been shoved back into the suppressing grid of materialistic Christianity. And I'm not able to reconcile what I'm learning and experiencing with that other framework. My question is, how can I keep the way that I view the world when I'm not listening to this podcast and encountering people with different frameworks of understanding? How do I keep it without being shoved back into that? And further, how do I discuss my fulfilled understanding of the faith with inquirers or even other Orthodox Christians who still have a materialistic framework? Thank you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5734.54,"end":5736.54,"speaker":"Fr Andrew Stephen Damick","text":"There we go, man."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5736.7,"end":5738.14,"speaker":"Fr Stephen De Young","text":"Wear headphones in class."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5741.2,"end":5743.44,"speaker":"Fr Andrew Stephen Damick","text":"They could just listen to the podcast 24 hours a day."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5743.84,"end":5744.32,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":5746.88,"end":6055.75,"speaker":"Fr Andrew Stephen Damick","text":"Man. I have to say, I don't envy her teachers, who she might be having conversations with about doctrine and so forth. God bless them. Yeah. I mean, in a larger sense, right. This question is essentially, how do you keep being Christian in every context? You know, how do you keep. Because there are experiences you're going to have that make you feel like you're in another mode. Right. Or will jolt you out of what you thought you believed. For instance. You know, that kind of thing can happen sometimes when people go through traumatic stuff that can alter the way that they participate in their faith or end it, you know, sometimes, right. I'm not, I don't think that Maria was talking about that necessarily. But I mean, the, the basic dynamic is there, right? I mean, my, my thought about this is like, look, when any of us, especially if you live in a non Orthodox culture, but even if you live in an Orthodox culture, like, there's a lot of Orthodox cultures out there who have all of these other elements that are antithetical to the Orthodox faith in present. Right? So when you encounter this kind of stuff, it's going to be normal to feel a certain tension like that's going to happen. And of course, you know, you're going to a Presbyterian classical school encountering Calvinism five days a week, so that can't be easy. But I would, I would. Here's how I would. I would do this, right. If that's where you're going to be at school, I would essentially just, you know, dissociate yourself from it on a certain level. Just like, okay, this is what these people are teaching, and it's useful for me to understand what their point of view on this is. So I need to go ahead and study it and get it right so I can really understand this, you know, and when appropriate, I can interact with it. And if I'm invited to give comment on it, then I can do that. Right. That's not always going to be the case, and I'm sure there's going to be some scenarios in which that wouldn't be needed. Like if you're doing organic chemistry, there's not a lot of opportunities to do theology in organic chemistry, as far as I know anyway, you know, so. So, you know, your mileage may vary, right? But I mean, we all study things that we don't believe in or aren't interested in in many cases, probably. Or as my children sometimes will tell me, I'm never going to use that. I'm like, well, you never know. But nonetheless, it's actually useful experience to, to learn it one, because it can, it can strengthen your own intellectual capability, your own emotional capability to be in the face of something you don't believe in, and yet to try to understand it as best as you can. But also because the world is affected by these points of view, like Calvinism is kind of in the American soup. So we should have some understanding of it if we're going to live in America as orthodox Christians, have some understanding of what Calvinism is about, you know, even though we don't believe in it. Right. And so then the second part of Maria's question about how do I talk to friends and family? I mean, it depends a great deal on the friends and family. What is your relationship to them? Are they open to this kind of conversation? Is it the right time? What were you talking about? You know, were you discussing organic chemistry and just said, but have you thought about what it means to be a deified in Christ? You know, are they going to be receptive to. To that at that moment? So it just varies a lot. But generally my approach is to try to find things that the other person already believes or holds especially dear to them and show them how, if possible, how it really finds its, its true blossoming, blossoming and fulfillment in the orthodox faith in, in Christ. You know, that everything that they love, there's way more of that available, you know, than they even thought possible in many cases. Head to Head confrontation can sometimes be useful, but usually doesn't really yield a lot of good. I mean, sometimes it can be useful. I'm not saying it never is, but. But usually if you're. What you really want is to share Christ with people, then just, you know, slamming them with, like, you know, your heretics and sinners probably is not going to open the door for any further conversation. You know, I like to think about St. Paul in the Areopagus, where he comes and says, I want to proclaim to you this unknown God whom you worship. And then he proceeds to proclaim to them a God probably very, very, very different from the one that they thought they were worshiping. Right. But he starts with something they knew, starts with a place that they can meet with him on. And I think that's the best way to do that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6058.32,"end":6068.88,"speaker":"Fr Stephen De Young","text":"Yeah. In terms of the first question, I mean, if you've got a good goal, sometimes you just have to play the game."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6069.36,"end":6072.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6072.8,"end":6074.16,"speaker":"Fr Stephen De Young","text":"That's the reality of the world we."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6074.16,"end":6075.64,"speaker":"Fr Andrew Stephen Damick","text":"Live in, especially the academic world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6075.64,"end":6143.39,"speaker":"Fr Stephen De Young","text":"Somebody who's done way more graduate school than any human ever should. You're going to have people who you completely disagree with, and it's not just because you're around Presbyterians. You go to an orthodox seminary in this country, you're going to have some professors who you think are out to lunch. Okay, that's going to happen. Right. But you have to look at what the goal is. Right. When you're working out a PhD. If your goal is to get the PhD so that you have a credential, so that you're a scholar in an area, so you can do meaningful research, so you can publish things as a PhD and people will take your opinion seriously to get there. There are going to be certain times where you have to bite your lip, where you have to just write what you know the professor wants you to write, even if you don't agree with it. Right. And this is. This is in little ways. Right. Most graduate school papers I've written, I've used CE and bce, even though I think it's silly. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6143.71,"end":6144.27,"speaker":"Fr Andrew Stephen Damick","text":"Oh, my."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6144.35,"end":6154.35,"speaker":"Fr Stephen De Young","text":"I've had to. My most recent master's thesis, I had to continually use the phrase biologically female organisms. Okay. Like, wow."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6155.23,"end":6155.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6156.19,"end":6168.99,"speaker":"Fr Stephen De Young","text":"You have to play the game sometimes. Right. Like, in order to get where you want to be. Because where you're trying to get to is going to be a good place that's going to allow you the freedom to do things that are good and necessary."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6169.33,"end":6169.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6170.21,"end":6290.14,"speaker":"Fr Stephen De Young","text":"And that's just the academic thing. The same thing as any job you have. There will be times where you have to play the game, right. With your boss or your supervisor or whatever. Right? Because you're. By doing that in some areas, you're able to do good in others. Right? And that's just a life thing. Right? So I'm sure there are a lot of good things you're learning in your classes, in different classes and stuff. And there are others where you're just going to have to play the game. Right? And it's okay to do that. You're not denying Christ or denying anything by doing that. Right. You're just doing what's necessary. In terms of the other part, I think talking about this stuff directly is less useful in our modern world, especially with all the millennials and zoomers running around. I think the best approach for this stuff is. And this is what I tell. This is what I tell people newly come into the church who have families and stuff, who aren't orthodox and maybe are even hostile to it for whatever reason is I say, you know, you need to just live this. Just do your thing and live this. Right? Because they'll evaluate it. Right? And if they see your life change and they see you doing well and they see you being well adjusted and they see you dealing with things well, they will notice that. Right? And then you'll get opportunities to share with them the way you see things and experiences you've had. And again, that's why I mentioned the millennials and the zoomers. That carries a lot more freight with them than a well structured doctrinal argument. Unless they're Presbyterians."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6292.7,"end":6294.46,"speaker":"Fr Andrew Stephen Damick","text":"Good luck with the Presbyterians, Maria."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6294.62,"end":6328.43,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, they want the arguments, but you can also call them sinners and stuff. Like, they don't mind. They'll go get beers with you afterwards. You call each other heretics all day long. Yeah, but. So that's mostly what people want now, right? Is they want you to share experiences. Right. And they're going to be open to hearing your experiences based on what they see going on in your life. If your life's a train wreck, they're not going to be interested your experiences."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6328.51,"end":6333.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. Well, this next one comes from. From Nathan."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6335.9,"end":6421.39,"speaker":"Fr Stephen De Young","text":"Greetings, Podfathers. My question and comment have to do with the two natures in one personhood of Christ. I remembered that I thought I heard you say on a previous Lord of Spirits episode that Christ's incarnation was not the point where Christ became human, but rather where he took on flesh and mortality. I have recently been meditating on the Notion that since we see Christ enter into time as the different Christophany accounts in the Old Testament show, namely the angel of the Lord, the word of the Lord and the Son of Man, that in reality, outside of time, Christ eternally exists as the glorified hypostatic union of full divinity and full humanity. This explains us being made in the image of Yahweh, that image being the Logos, as Paul says, I would say prior to his incarnation, but then that would indicate a time frame. And as you have pointed out, you can't use time terminology when discussing God outside of time. The paradox being that while Christ exists eternally, as mentioned, the union takes place in time at the Incarnation account given to us in the Gospels. The Christophanies mentioned are the encounters of the Old Testament patriarchs with the eternally existent, glorified, divine, human, hypostatic Logos. So my question is, am I completely off base and bordering on Apollinarianism, or am I tracking correctly? Thanks for all you do."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6422.27,"end":6479.69,"speaker":"Fr Andrew Stephen Damick","text":"All right. You can always tell the ones where people write it out beforehand because you get this wonderfully complex sentence structure and so forth, you know? Yeah, yeah. I mean, yeah, I. So the part that I. It makes sense to me, but I'm not sure that I got this right. So I wanted to ask this also, like, is he right when he says that the incarnation. You know that what happens in the Gospels, right. Is not Jesus becoming human, but rather him taking on flesh, that is to say mortality. I don't think that's quite right. I think it's okay to say this is God becoming man, as long as we understand it as being like, well, this is the point at which becomes manifest in human history, even though we clearly see there's a trans. Temporal reality that we're encountering here in the Old Testament particularly."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6480.57,"end":6495.85,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah. And so this is why he brings up Apollinarianism. Because, I mean, I don't want to go too far into the weeds on this, but there's this idea in Apollinaris, the original Apollinaris, not William Lane Craig."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6496.81,"end":6506.05,"speaker":"Fr Andrew Stephen Damick","text":"We actually did, by the way, get a William Lane Craig question, which I just deleted anyway, sorry."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6506.05,"end":6510.45,"speaker":"Fr Stephen De Young","text":"Well, it's easier to just list the things that William Lane Craig doesn't get wrong."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6510.53,"end":6510.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6510.89,"end":6515.17,"speaker":"Fr Stephen De Young","text":"Than to list the ones he gets wrong. So I'll list here. Here's all the things William Lane Craig doesn't get wrong."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6515.17,"end":6516.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the question literally."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6516.61,"end":6518.01,"speaker":"Fr Stephen De Young","text":"Okay, back to the question at hand."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6518.01,"end":6526.05,"speaker":"Fr Andrew Stephen Damick","text":"Why is he. Why? Why is he wrong? I'm like, no, we can't no. Anyway. Yes, yes. Incarnation."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6526.05,"end":6567.89,"speaker":"Fr Stephen De Young","text":"Yeah. So I've listed now everything he's right about and we'll go back to the question. But yeah, so Apollinaris had this idea of the Kyriakos Anthropos, the lordly man. The lordly man, right. And this is when you get in the depths of his. This is actually more depth than William Lane Craig has in his Christology. Like his is the great value of pollinarianism to boot. So everybody's been told, shorthand, that Apollinaris taught, that it was sort of God in a human suit. Right. Like that's sort of the shorthand way."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6567.89,"end":6568.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6568.93,"end":6660.98,"speaker":"Fr Stephen De Young","text":"That it was just a human body, but he actually had this idea of divine humanity, Right. So that he was just taking flesh, it was just the actual flesh that he took on at that point, but that there was an eternal kind of divine humanity. So the reason why I don't go to it, St. Mark the Ascetic, sometimes called St. Mark the Monk, whose some of his writings are in the philokalia, also uses that term Kyriakos Anthropos, but uses it in another sense, which is to talk about what we've been talking about. Right? So the only reason I went down this kind of semi rabbit trail is that's why the caller mentioned Apollinarianism, right? Because we need to distinguish what we're saying from Apollinarian, actual Apollinarianism. It's already distinguished from Neo Apollinarianism. So. Yes. So it's not that Christ just takes on human flesh at that point. That is the point in human history and human experience where the Logos is made flesh, meaning when Christ is made man, to go to the Nicene Creed, right? The point in human history, because his humanity, humanity has a beginning in a womb."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6661.86,"end":6662.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6663.62,"end":6680.43,"speaker":"Fr Stephen De Young","text":"Right. So his humanity is part of human history. We read about that in the Gospels, right? But that does not mean from the eternal perspective outside of time, that there was a change."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6684.99,"end":6685.39,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6685.71,"end":6711.5,"speaker":"Fr Stephen De Young","text":"So there are various points where, for example, God enters into human history, right? We see. And we. We went through them, we did a whole series on them, right? The angel of the Lord, right. Etc. Etc. Etc. The Word of God, right? Where the Logos, where this person, the second Person of the Holy Trinity, right. Enters into human history."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6714.46,"end":6714.86,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6714.86,"end":6730.79,"speaker":"Fr Stephen De Young","text":"In, in and in human form, right. He comes and he sits and he eats with Abraham in Genesis. But he is entering into human history at all of those points."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6732.55,"end":6732.95,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6733.19,"end":6740.63,"speaker":"Fr Stephen De Young","text":"From outside of human history. And it is the same person who enters human history at all of those points."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6742.47,"end":6742.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6744.87,"end":6774.3,"speaker":"Fr Stephen De Young","text":"And there is one of those points where he enters. Where he enters in a unique way, entering into the womb of the Theotokos, where he takes upon himself humanity. But it is that Christ who was born circa 3 B.C. right. And is crucified circa A.D. 30."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6776.07,"end":6776.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6776.39,"end":6780.07,"speaker":"Fr Stephen De Young","text":"Is that Christ who sits and eats with Abraham."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6783.91,"end":6785.27,"speaker":"Fr Andrew Stephen Damick","text":"And walked in Eden."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6785.91,"end":6787.11,"speaker":"Fr Stephen De Young","text":"And walked in Eden."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6787.43,"end":6788.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6789.03,"end":6818.47,"speaker":"Fr Stephen De Young","text":"And who appears to St. Paul and St. John and who will return to judge the living and the dead. So yeah, this is. Again, this requires us to. And we can't understand it. Right. We can't understand what it's like to exist without reference to time any more than we can understand what would it mean to be omnipresent. To exist without reference to space."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6820.55,"end":6821.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6821.51,"end":6826.87,"speaker":"Fr Stephen De Young","text":"Because when we talk about God being omnipresent, we don't mean he's just really big and spread out all through creation."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6826.87,"end":6828.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6828.55,"end":6834.23,"speaker":"Fr Stephen De Young","text":"We mean that two categories of space don't apply to him and categories of time don't apply to it. We don't know what that means."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6835.43,"end":6880.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think the fact that the Lord appears bodily in the Old Testament, so bodily, as you mentioned, that he eats, that's the thing that makes us have to accept that the incarnation has a trans temporal character. Because if, you know, if he sort of doesn't have a human body until circa 3 B.C. then that means that either that's an illusion. Right. Which there's no indication in the text it's some kind of illusion, you know, when he's eating with Abraham or that he has. That he's been incarnate more than once, that he's got some other body at that point."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6880.24,"end":6883.24,"speaker":"Fr Stephen De Young","text":"Right, right. Which is also. Yes, wrong."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6883.24,"end":6885.08,"speaker":"Fr Andrew Stephen Damick","text":"Just an explosive Christology."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6886.04,"end":6893.56,"speaker":"Fr Stephen De Young","text":"The place where that rubber meets the road is the post resurrection appearances of Christ. Where he eats."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6894.2,"end":6895,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6897.16,"end":6907,"speaker":"Fr Stephen De Young","text":"Where he eats to demonstrate that he is bodily risen from the dead, but he also eats in the Old Testament."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6908.61,"end":6914.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it's not some kind of illusion."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6915.57,"end":6996.1,"speaker":"Fr Stephen De Young","text":"Yes, yes. And this, there's. I'll go ahead and refer to it now because there's a couple of questions coming up where I'm going to have to refer to it again. This understanding of bodily resurrection and of the way in which a temporal human life enters into eternity is deeply ingrained in the original Jewish sources, the Pharisaic sources, teaching about the bodily resurrection. And this is something that we've mostly lost in favor of a folk conception of eternal life. And I'm not really ready to Explain what I mean by that yet. All right, this is going to depress everyone, future episodes, but I. I'm not one to plug my own things, but the place where I'm going to kind of unveil this, hopefully, Lord willing, if I've got it worked out sufficiently, is going to be at Peugeot Fest at the end of February. So until then, I'm still kind of working on it. All right, but. Yeah, okay, but. But basically what I mean by that is there's a way in which this, that we're talking about with Christ is a paradigm for how we understand our own resurrection and eternal life that I don't think has been recently explored."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":6997.62,"end":7000.9,"speaker":"Fr Andrew Stephen Damick","text":"All right, okay, well, this next one comes from Noah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7002.82,"end":7005.94,"speaker":"Audience Member","text":"Hello, Fathers, A blessed feast to you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7006.66,"end":7100.96,"speaker":"Fr Andrew Stephen Damick","text":"My question regards something which it seems likely you've spoken on before, which is the English translation of. Of the Lord's Prayer. Of particular interest is the translation of the word EPI usion, which we've inherited as daily, but which Catholics at times have rendered super substantial or super essential. What do you think of those translations? And most importantly, how would you render this prayer in the English most meaningfully? I am no expert on languages, but I have attempted my own translation, and all I will say about that is, put me not on trial, but save me from anyone cunning. Thank you. And namariye. All right. It's funny, the. The. The translation that he offers is not of the part that includes this word. You know, he translates the part that at the end of the Lord's Prayer is normally, lead us not into temptation, but deliver us from the evil one. Yeah. You know, I actually one time went to a parish where they just completely punted on this. And literally the way that the priest had them reciting this was, give us this day our Epiusion bread. Like, literally just imports the word and just has them all say the Greek word. I. Yeah, yeah, I know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7100.96,"end":7102.4,"speaker":"Fr Stephen De Young","text":"I know why. I know why."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7103.6,"end":7115.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But go ahead. I. This is something I. I'm aware as an issue, but. But I do not have the expertise to discuss it honestly, so I want to hear what you say about this. Okay? Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7115.88,"end":7127.05,"speaker":"Fr Stephen De Young","text":"Okay. So, yeah, so part of what we have here is the etymological fallacy."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7127.05,"end":7129.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes. EPI usion."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7130.25,"end":7133.13,"speaker":"Fr Stephen De Young","text":"You know, EPI means being EPI is above."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7133.53,"end":7134.17,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7134.73,"end":7137.93,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. But then I ask you, what is a butterfly?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7137.93,"end":7144.23,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. I mean, super essential is literally just a calc of epision."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7144.55,"end":7145.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7146.39,"end":7146.79,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7149.59,"end":7171.84,"speaker":"Fr Stephen De Young","text":"Aside from the Lord's Prayer in St. Matthew's Gospel and St. Luke's Gospel, a Form of this word occurs in one other place in the New Testament. In Greek, it's in Acts 7, it's epiuse instead of epiusion. But epi say there very clearly means the next day."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7172.8,"end":7173.36,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7175.6,"end":7182.4,"speaker":"Fr Stephen De Young","text":"No one disputes that translation. It's obviously what it means. Nobody thinks it means super. Essentially."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7184.08,"end":7184.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7186.88,"end":7204.88,"speaker":"Fr Stephen De Young","text":"That'S. We have. It's a really weird word. Right. The only other place it shows up that we found like extra biblically is, believe it or not, in a 5th century shopping list from Egypt."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7205.76,"end":7210,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Going out and getting some super essential. I don't know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7210.08,"end":7219.04,"speaker":"Fr Stephen De Young","text":"Right. No, except it's an adjective. It's an adjective and it's used to mean a day's worth in that shopping list."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7219.36,"end":7222,"speaker":"Fr Andrew Stephen Damick","text":"So in other words, daily might not be so bad actually."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7222.48,"end":7229.47,"speaker":"Fr Stephen De Young","text":"Right. So daily is actually the correct translation. Daily is the correct translation."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7229.47,"end":7235.07,"speaker":"Fr Andrew Stephen Damick","text":"Because all the other places, although not a lot that it gets used, that's pretty clearly the context."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7235.07,"end":7257.08,"speaker":"Fr Stephen De Young","text":"That's clearly what it means. Right? Yeah. So that's what the word means. But here's why there's confusion. Here's the actual reason why there's confusion. There are a number of church fathers, right, who in their commentaries on the Lord's Prayer, when they come to this, point out the word epiusion. Right. And then talk about the Eucharist."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7258.12,"end":7258.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7260.44,"end":7420.9,"speaker":"Fr Stephen De Young","text":"Right. And then talk about the Eucharist, seeming to use some shade at least of that other idea of super essential. Baby. Right. Although again, they're writing in Greek, so how you translate their use of the word, right. You end up with sort of circular logic. Right, but. And so we have to reiterate what we talked about in the last episode. When the church fathers do that, they are not saying the Lord's. This line in the Lord's Prayer has one meaning, and that one meaning is that it's referring to the Eucharist because it really means super essential. That's not what the church fathers are saying. Church fathers are taking the one level of literal meaning. Daily, our bread each day, the bread we need each day. This has certain resonances, like the manna in the Old Testament. How much did they get? One day's worth, except on Friday. Then they got two days worth because they didn't go gather on the Sabbath. Right. God literally gave his people bread to eat every day. That's where this line comes from. That's the literal level. It's a reference back to the bread from heaven. Manna. Right. Give us this day our daily bread. But as we talked about, then the church fathers go to literal plus. Right. They go to deeper meaning. They follow what Christ says in John chapter six, where he starts out talking about the manna in the wilderness, the bread from heaven, and transitions to talking about eating his flesh and drinking his blood. That, yes, we pray that God would provide us with our material sustenance every day, but God also provides us with our spiritual sustenance, which is Christ himself in the Eucharist. So that's added. They're not saying, no, no, no, no. This isn't talking about material food. This is talking about the Eucharist. This is literal. Yes, plus deeper meaning. And people who don't understand that then want to say, no, no. Church father says it means this, and try to read that back into the Greek word. That's a mistake, right? That's a mistake."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7424.34,"end":7432.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. The next one is from Christy, whom we heard from earlier, but this is a different question that she had."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7434.9,"end":7522.72,"speaker":"Audience Member","text":"Hi, my name is Christy. I have a question about idolatry. Being raised in the Protestant tradition, I was definitely given to understand that, you know, you had the men of the long ago times that worshiped idols that were made of, you know, wood and stone, and modern man worships money and power and self and tons of other things like that. And that's pretty much it was the same thing. And in fact, the world is just getting worse and worse and worse as far as its idolatry goes. Listening to you guys, I'm definitely getting a new perspective that when Christ entered the world and died, that he overthrew the power of demons and that they are now not ruling the nations that is being. They are being replaced by saints, and idolatry is no more. So my question is, am I to understand that the world around me is way, way better than it was before Christ entered into it? And if so, the things that we seemingly give our lives to when we reject giving our lives to Christ, are those things not considered idols anymore? And are they better than worshiping actual idols from long ago? Thank you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7523.12,"end":7633.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is it better to worship an idol now than it was to worship an idol? I'm going to say no on that one. Yeah, we've talked about this a number of times. The sort of the change that happens in the world when Christ comes and rises from the dead, it doesn't mean that you can't do idolatry now. Right? You could still do idolatry now. Like, you could still do all the things that an idolater does. And the likelihood that a demon will show up and want to do that stuff with you is pretty high because he knows that it will destroy you. But nonetheless, there's a fundamental shift that happened in the world when Jesus was incarnate and suffers and dies and rises from the dead and knocks down the mighty from their thrones. Like they no longer have the grip over humanity that they used to. And I mean, it's evident, right? Like, not only the nations generally not ruled by idolatry, but even it's hard to find a country in which there isn't at least some kind of official adherence to some model of Christian ethics. Like the idea that there's something called human rights, for instance, which is a universal human value in the modern age, is not something that you find in the ancient world. Human rights is simply not a thing, or that women are humans or that children are humans. So there is this radical shift that has occurred as a result of that. But, I mean, I would definitely not say that modern sinful idolatry, even in the metaphorical sense, is somehow better. I mean, it's still involvement with demons and no involvement with demons is good, right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7635.9,"end":7643.98,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. This is, again, better in various ways. Doesn't mean perfect."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7644.14,"end":7644.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7649.94,"end":7674.02,"speaker":"Fr Stephen De Young","text":"Yeah. So I have a Jewish friend, and one of his greatest hits in terms of standard arguments that Jesus isn't the Messiah is to look at someone and say, oh, really? Do you really think the knowledge of God covers the earth as the waters cover the sea? And I say, yes, things are way different. Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7675.2,"end":7675.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7675.52,"end":7685.52,"speaker":"Fr Stephen De Young","text":"Like, think about it, okay, first century B.C. where are there people worshiping the true God?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7686.08,"end":7687.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, one tiny little pocket in the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7687.92,"end":7712.49,"speaker":"Fr Stephen De Young","text":"Middle East, a fraction of the people in Judea, because we know a lot of them were worshiping other gods and stuff, Right. Like there's some subset, big or small, depending on the time, right. And some. Some in Egypt, right. In Alexandria and, you know, few in Mesopotamia. That's it. That is it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7713.13,"end":7713.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7715.53,"end":7760.19,"speaker":"Fr Stephen De Young","text":"As opposed to today, okay, Today, where pretty much everyone, right? You look at billions and billions of people, at least, are at least claiming, claiming, trying or claiming to worship the God of Abraham, Isaac and Jacob, right? Now, we would say a lot of them are doing it quite wrongly. Right. A lot of them don't really know who that God is, but they're at least claiming it. Yeah, right. At least claiming it. Atheists now, who tell you they don't believe in God when they describe the God they don't believe in. It's not Zeus, right? It's not Thor."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7761.55,"end":7763.47,"speaker":"Fr Andrew Stephen Damick","text":"It's some version of the Christian God."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7763.47,"end":7793.04,"speaker":"Fr Stephen De Young","text":"Some malformed version of the true God. Right. Who they reject. Right. And I'd wager to say even if you go to an East Asian country and you use God in the singular and ask about it, it would be the same kind of similar thing. Right? So, yeah, yeah. The knowledge of the true God now covers the earth as water covers the sea."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7794.88,"end":7795.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7796.96,"end":7813.7,"speaker":"Fr Stephen De Young","text":"That's a big change. Right. Things that were social institutions then are not acceptable now. Right. Nowadays, when an army goes and massacres women and children and civilians, they have to at least lie about it or make excuses or try to make an argument."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7813.7,"end":7813.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7813.9,"end":7819.58,"speaker":"Fr Stephen De Young","text":"They don't brag about it now and use propaganda. They don't brag about it. Right. The ancient world, they bragged about it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7819.58,"end":7821.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah, totally."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7822.06,"end":7840.89,"speaker":"Fr Stephen De Young","text":"Right. Like, there has been this massive change. It's not. And even if you go deep into post Christian Jewish texts, they acknowledge it. A lot of rabbinic Jewish writers try to find some pocket, some place to put Christianity into."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7842.97,"end":7843.37,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7843.53,"end":7851.21,"speaker":"Fr Stephen De Young","text":"Well, you know, there's kind of some good stuff. They are, you know, like lots of Gentiles know about the Torah now. You know, like, they have to acknowledge that. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7851.21,"end":7852.33,"speaker":"Fr Andrew Stephen Damick","text":"Like, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7853.13,"end":7858.97,"speaker":"Fr Stephen De Young","text":"You know, even though we disagree and we think it's wrong and we think it's heretical, like it's doing some good things in the world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7859.38,"end":7860.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7861.46,"end":7869.3,"speaker":"Fr Stephen De Young","text":"So, yeah, that's. That's just. But that doesn't mean the world is perfect. That doesn't mean the world isn't full of wickedness. That doesn't. Doesn't mean any of that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7869.38,"end":7869.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7871.3,"end":7873.74,"speaker":"Fr Stephen De Young","text":"To say. To acknowledge that that change happened."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7873.74,"end":7959.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, we're going to take one more question, then go to our second and final break. This is from Steve. Hello, fathers. This is Steve from Pennsylvania, actually not far from Emmaus. My question is about last episode, his glorious return, and some of what Father Stephen said in the summation about glorification during. Not just after the end of days, but during our present life. And one of the things I've been thinking about is, you know, if the world to come is not us, like an orb floating in contemplation or playing harps on a cloud, or even just our friends and family and maybe famous people in some sort of like, feasting hall, but it actually is going to contain multitudes, hopefully millions and billions of others, that this helps put a context around things like love your enemy, the Beatitudes, like you're likely to meet your enemy in the afterlife. And we have got to put all of this behind us and have peace with one another. And I just wonder if this way of thinking about it is correct and I would love to get your reaction to it. Thank you, fathers. All right, so the way that I summarize this is essentially is the afterlife crowded."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7961.58,"end":7963,"speaker":"Fr Stephen De Young","text":"Through the after afterlife?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":7963.31,"end":8041.52,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Life after life after death. Yeah. It's funny, I think that because, because, because there is this sort of infection of. Even people who believe in the resurrection, they still don't have much of a sense that what's after that is actually embodied. You know, like that's not the way we tend to think about it. You know, as, as Steve said, like there's a sense of like glowing orbs contemplating, you know, this sort of thing like when we think of, of that it's, it, it's this weird kind of sci fi imagery, like sort of the Star Trek version of what it means to ascend to a higher plane. Right. Just beings of pure light. And yet that's not what the scriptures depict. That's not what the tradition of the church depicts. It's an embodied life, although bodies that are quite different from the bodies that we have in this life. Yeah, I mean, I think it's, it makes perfect sense to think of the life of the age to come as being very communal because that's how human beings are supposed. That's how we were created, is to be communal. You know, it's not this individual contemplation of God, you know, or something like that. Yeah, flesh that out for us."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8042.16,"end":8065.18,"speaker":"Fr Stephen De Young","text":"Well, well, this is another place where I'm going to say, yes, right. This is what I'm working on currently. But I think we need to. The core of it is coming to a better understanding of the way in which the life of the world to come relates to this life in this."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8065.18,"end":8065.5,"speaker":"Fr Andrew Stephen Damick","text":"World."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8068.3,"end":8188.33,"speaker":"Fr Stephen De Young","text":"As transfigured and made eternal. And suffice it to say, what I'm comfortable saying for now at least as I'm still working on this, is that the life of the world to come is not going to be less communal than this life. Yeah, right, right, right. The language that's used especially in St. John's gospel about eternal life, first of all, has eternal life starting now. Eternal life isn't something that happens after this life ends, as St. John describes it. And that's why you get the language like from Christ. The person who lives and believes in me will never die. So there's that. And that's related to as he began his question. Right. Glorification beginning in this life. But so it's not going to be less communal. The people, you know, and encounter now are not going to be strangers to you in the life to come. This relates to what we've said about marriage too, where sometimes people understand, oh well, people aren't going to be married and given in marriage. That doesn't mean your spouse is going to be a stranger to you. Right. Like, and everything you shared, like you're going to have amnesia. Right. So, yeah, there is no reason to believe that we are going to be in any way isolated or there's going to be some paucity of human interaction or a lack of a communal nature to the life of the world to come. Quite the opposite. That minimally it will be as communal as this life is, but with those bonds much deeper and strengthened and transformed by Christ into their fullness."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8191.85,"end":8202.69,"speaker":"Fr Andrew Stephen Damick","text":"All right. With that, we're going to go ahead and take our second and final break and we'll be right back on this all Q and A episode of the Lord of Spirits. Father Andrew, Stephen Damick and father Stephen."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8202.69,"end":8204.25,"speaker":"Fr Stephen De Young","text":"DeYoung will be back in a moment."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8204.25,"end":8208.37,"speaker":"Fr Andrew Stephen Damick","text":"To take your hand calls on the next part of the Lord of Spirits."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8208.77,"end":8236.62,"speaker":"Fr Stephen De Young","text":"Give them a call at 855-237-2346. That's 855-AF-RADIO. What are we to make of the unseen world and spiritual warfare? The Lord of Spirits book version is now available@store.ancientfaith.com written by Father Andrew Stephen Damick."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8237.5,"end":8272.95,"speaker":"Fr Andrew Stephen Damick","text":"To the modern mind, dragons and demons are just the inner demons of psychology and angels are often reducible to the better angels of our nature, that is to our better human impulses and virtues. Talk of spirits is really about psychology, but to the ancient mind of millennia ago, even up to the premodern mind of just centuries ago, these are real beings with personal presence who inhabit our world and affect us. Father Andrew provides a distillation and explanation."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8272.95,"end":8275.71,"speaker":"Fr Stephen De Young","text":"Of the material in the popular podcast."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8275.71,"end":8279.99,"speaker":"Fr Andrew Stephen Damick","text":"The Lord of Spirits, which he co hosts with Fr. Stephen DeYoung."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8280.31,"end":8288.88,"speaker":"Fr Stephen De Young","text":"Get this brand new book today at store.ancient faith.com that's store.ancient faith.com we're back."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8288.88,"end":8291.04,"speaker":"Fr Andrew Stephen Damick","text":"Now with the Lord of Spirits with."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8291.04,"end":8304.16,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 855-AF-RA."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8307.69,"end":8321.25,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the third half of this special Thanksgiving episode pre recorded of the Lord of Spirits podcast. So we're not actually taking any live calls right now, but we're listening to your pre recorded messages that you love."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8321.25,"end":8322.25,"speaker":"Fr Stephen De Young","text":"Just talking turkey."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8322.25,"end":8336.47,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Just Talking turkey on the day of Turkey talk. Yeah. So we're going to do six more questions and then we'll wrap it up for this one and we'll see you back in December."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8336.95,"end":8343.19,"speaker":"Fr Stephen De Young","text":"So have you ever heard Sarah McLaughlin's Lilith Fair Thanksgiving anthem?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8344.23,"end":8346.79,"speaker":"Fr Andrew Stephen Damick","text":"No, and I feel that I should have."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8346.79,"end":8348.23,"speaker":"Fr Stephen De Young","text":"She's. She's a vegan."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8348.79,"end":8350.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God bless."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8350.15,"end":8352.07,"speaker":"Fr Stephen De Young","text":"The song is entitled Basted in Blood."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8352.07,"end":8355.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I have heard it. Yes, I have heard that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8355.51,"end":8356.55,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8357.59,"end":8397.65,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's. It's somewhat tongue in cheek a little bit. Yes, yes, yes. Fun fact about me, I was actually as a stagehand, I worked at one of the stops of the first year of the year of Lilith Fair, when it is 1997. Yes, that seems right. 1997. Long, long ago in the before times. Just months before I discovered the Orthodox church. So. All right, well, this first one comes from our friend Adam, who came to the Lord of Spirits conference and was the tallest man in the room by."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8398.05,"end":8399.81,"speaker":"Fr Stephen De Young","text":"A lot, which is saying something."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8399.97,"end":8410.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes, there are a number of quite tall people there, including your humble self. But Adam, as I recall, was 6 foot 8. So, yeah, good job to your genes, Adam."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8411.58,"end":8413.7,"speaker":"Fr Stephen De Young","text":"So well played. Human growth hormone."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8413.7,"end":8415.82,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. All right, so here we go."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8418.38,"end":8420.94,"speaker":"Fr Stephen De Young","text":"Father's blessed. This is Adam from St. Louis."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8421.26,"end":8426.74,"speaker":"Fr Andrew Stephen Damick","text":"I have a question regarding technology. Since technology, like the apple in the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8426.74,"end":8438.67,"speaker":"Fr Stephen De Young","text":"Garden, is something that was given by the giants out of time to man. And so it was not necessarily something bad in and of itself, but something that was given before man was ready."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8438.67,"end":8442.43,"speaker":"Fr Andrew Stephen Damick","text":"For it, is it something that we can imagine in the age to come."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8442.83,"end":8450.03,"speaker":"Fr Stephen De Young","text":"That will be given fully and properly to man, just like the knowledge of good and evil. Thank you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8450.75,"end":8462.19,"speaker":"Fr Andrew Stephen Damick","text":"All right, so is there going to be more technology given? Like there will be more. More revelations from divine beings, you know, in the life of the age to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8462.19,"end":8464.33,"speaker":"Fr Stephen De Young","text":"Come, will you finally get your flying car?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8464.57,"end":8475.29,"speaker":"Fr Andrew Stephen Damick","text":"I know, right? Where, why, why, why? Sorry, Just sent me down on Avery Brooks Road there."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8475.29,"end":8475.77,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8476.25,"end":8503.33,"speaker":"Fr Andrew Stephen Damick","text":"I was just watching a Deep Space Nine documentary the other night. So this is very topical for me. Yeah. Will there be flying cars in the life of the age to come? Will the Jetsons become real? I have no idea. I mean, is there going to be. I don't remember reading anything like that. That there'll be this sense of more things being revealed like that? I don't know. Will we be the revealers?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8503.33,"end":8508.33,"speaker":"Fr Stephen De Young","text":"Well, so this is another area where I'm still working on this."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8508.41,"end":8508.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8510.01,"end":8512.13,"speaker":"Fr Stephen De Young","text":"What I'm comfortable saying now is this."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8512.13,"end":8515.09,"speaker":"Fr Andrew Stephen Damick","text":"Book six, Book seven, maybe there will not."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8515.09,"end":8518.71,"speaker":"Fr Stephen De Young","text":"No, this is Just this talk I'm giving. This is this particular topic."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8518.79,"end":8519.27,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8520.47,"end":8521.63,"speaker":"Fr Stephen De Young","text":"Because it's what I'm working on right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8521.63,"end":8523.83,"speaker":"Fr Andrew Stephen Damick","text":"Now at Peugeot Fest, as we're calling it now."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8524.23,"end":8526.79,"speaker":"Fr Stephen De Young","text":"At Peugeot Fest. Yes. Which is the official name."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8529.59,"end":8534.55,"speaker":"Fr Andrew Stephen Damick","text":"Someone's starting a website right now. That's Peugeot Fest.com and we're selling fake tickets."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8537.59,"end":8544.79,"speaker":"Fr Stephen De Young","text":"Don't sell fake tickets, sell real tickets. There will not be less technology."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8547.07,"end":8547.23,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8547.23,"end":8598.82,"speaker":"Fr Stephen De Young","text":"The life of the world to come that there is now. Technology will be transfigured and fulfilled. Right. In its sort of fullness and properness. And I think, yeah. To more directly address the question, because I can't. I'm not ready, like I said, to fully go. I'm not committed enough to publicly go into where my thought is on that right now. The assumption that there won't be technology in the age to come comes from this weird sort of anarcho primitivist thing people have in their heads for some reason where, like, you know, we need to get back to nature. I want to make leather clothes that I can wear for my whole life."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8598.82,"end":8600.72,"speaker":"Fr Andrew Stephen Damick","text":"Or maybe the whole glowing orbs thing again."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8601.44,"end":8602.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8602.28,"end":8603.52,"speaker":"Fr Andrew Stephen Damick","text":"Beings of pure light."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8604,"end":8613.44,"speaker":"Fr Stephen De Young","text":"Yeah. Right. Well, and. But I think part of the primitivist thing impulse is like, oh, going back to the Garden of Eden where they're just naked and living in nature."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8613.44,"end":8613.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8614,"end":8614.4,"speaker":"Fr Stephen De Young","text":"Like."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8614.56,"end":8615.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. But that's not."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8615.68,"end":8668.44,"speaker":"Fr Stephen De Young","text":"But again, that wasn't the goal, that was the start, Right. And as Adam said in his question, right. God, there was going to be more as humanity came to maturity, Right. There would be more to address it with. So there's. There's no reason to believe that, like, technology would go away in the world to come, that there would be no technology. Now, obviously there would be places where that would take different shapes. Right. Like a lot of our medical technology that's aimed at, you know, life savings when you're dealing with immortality. Right. You know, that's. And we don't need to take this so crass as, like, yes, in the life to the age to come, you'll be able to microwave a hot pocket in three seconds."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8668.52,"end":8673.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. A transfigured hot pocket. Father Stephen."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8673.04,"end":8676.2,"speaker":"Fr Stephen De Young","text":"Right, there's the point of. Yeah. And it'll actually be nutritious now."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8676.84,"end":8680.09,"speaker":"Fr Andrew Stephen Damick","text":"It actually will be food. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8680.41,"end":8721.3,"speaker":"Fr Stephen De Young","text":"Like, we don't have to take it in weird, you know, silly directions on the other side either. Right. But we are. Would be talking about the expansion of human knowledge, not the retraction of it, including knowledge of the material world, which is what technology for the most Part is the fruit of. Right. Of new technology is the fruit of an increase in knowledge about the material world, the material creation and how it functions. And there is a material element to the world to come. Right?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8722.9,"end":8738.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. All right, next. It's interesting how a number of these are about the life of the world to come. This seems to be on people's minds. Maybe they're all going to Pajeau Fest and they're just anticipating your thing."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8739.3,"end":8743.86,"speaker":"Fr Stephen De Young","text":"Yeah, maybe. I'm just reading the Zeitgeist in terms of what I'm working on and thinking about right now."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8743.86,"end":8746.9,"speaker":"Fr Andrew Stephen Damick","text":"Could be. Could be all those zeitz. Lots of geist."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8748.18,"end":8748.7,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8748.7,"end":8754.26,"speaker":"Fr Andrew Stephen Damick","text":"This one comes from Patrick. Greetings, fathers."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8754.74,"end":8756.62,"speaker":"Fr Stephen De Young","text":"My question has to do with Moses."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8756.62,"end":8777.83,"speaker":"Fr Andrew Stephen Damick","text":"And Elijah appearing on Mount Tabor during the transfiguration of Christ. What's the significance of this? And Peter, James and John desiring to tabernacle with him. Does it have something to do with the invocation of the saints? Thank you in advance for your response. All right, short and sweet. Does it have something to do with invocation of the saints? Yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8778.87,"end":8780.07,"speaker":"Fr Stephen De Young","text":"Yeah, Moving on."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8784.63,"end":8816.63,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it shows, right? Like, it's funny, I think sometimes when people like. Like if we, like within the orthodox context, that makes total sense that we say, oh, yeah, of course that's related to that, you know, but. But if you take it outside that context and present it to someone that doesn't believe in the invocation of saints that thinks it's wrong and say, well, this is an example that shows that it's right, they'd be like, there's no commandment given there that you should call upon saints. And you don't see them calling upon, like, again, it's like it's turned into this technicality. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8816.63,"end":8826.83,"speaker":"Fr Stephen De Young","text":"Oh, I've seen recently someone. I've actually seen someone recently say that Moses and Elijah only talked to Jesus. They didn't talk to the apostles."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8826.99,"end":8898.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. Well, is Jesus, you know? Right. Like, well, Jesus can do that. And it's so funny. Like, we want to. There's all these sort of assumed barriers. Right. And frankly, the barriers are anti Catholic Reformation ideas. Yeah, that's what they are. Like, when you assume those, then, yes, of course, you need to figure out some way for this not to be about interacting with the departed saints, you know, But. But it is. I mean, and especially once you realize which. This is a whole other conversation, but that angels are the original saints. And you see in the Psalms that David directly talks to the angels, you know, that's literally the invocation of Saints in the Old Testament context, then it makes. It's all just of a piece, you know, it's all very coherent, and it makes a lot of sense to bring it all together like that. But if you have this kind of dogma that you. That those are dead people and you cannot talk to them and that's necromancy and whatever, then. Then yeah, of course, you know, you can't say that this is about the invocation of saints in any way. Certainly it's not the only thing that it's about."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8899.47,"end":8906.35,"speaker":"Fr Stephen De Young","text":"But no, that is a secondary element. I mean, the core of what it is, is that Mount Tabor becomes the mountain of God."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8906.35,"end":8907.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8907.87,"end":8953.92,"speaker":"Fr Stephen De Young","text":"Right. And Christ is there with the divine council. Yeah, Right. And so saints Peter, James and John are having the experience that Moses had on Mount Sinai, that Jeremiah had it as calling, that Isaiah had it as calling, that Ezekiel had it, his calling. Right. That's the core of it. Right. Of what's happening. But the key difference is between those. Even though they're sharing the same experience, the difference in the portrayal is here we have humans, Moses and Elijah in the divine council."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8957.2,"end":8958,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8958,"end":8964.88,"speaker":"Fr Stephen De Young","text":"We have humans in the divine council. This is where the whole concept of sainthood revolves around."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8965.04,"end":8965.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8966.32,"end":8991.32,"speaker":"Fr Stephen De Young","text":"And so then the idea is when we enter into worship, we are entering into that heavenly worship in the same sense, even if we don't have the vision directly. Right. We are entering into heavenly worship. We. Which means Christ is there, the saints are there, the angels are there. What are they doing? They are praying. They are interceding as we are praying and interceding for ourselves, for each other, for the life of the world."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8993.16,"end":8993.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8993.56,"end":8998.44,"speaker":"Fr Stephen De Young","text":"So that follows on from what this experience is that they're having."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":8998.68,"end":9032.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I think that once you grasp at least the concept of the divine council, and then you. And you see what the divine council does. What do the angels do? Do people talk to them? How do they interact with them? And then you realize that humans can get included in that. Then everything that we have with regards to the saints is simply that that's really all it is. Like, it's nothing new. You know, it's not anything new. It's just humans now being included in the same set of functions and the same experience and divine life as. As the angels."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9032.53,"end":9050.1,"speaker":"Fr Stephen De Young","text":"It's. I mean, honestly, once you have this understanding of the vision of God and once you have this understanding of God enthroned in the midst of his holy ones. Right. Trying to not understand the intercession of the saints is just cognitive Dissonance at that point."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9050.1,"end":9050.74,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9051.14,"end":9055.94,"speaker":"Fr Stephen De Young","text":"That could be caused by all kinds of things, but sure, yeah, it's cognitive dissonance."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9056.26,"end":9059.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay, so this next one comes from Sabine."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9062.73,"end":9124.53,"speaker":"Audience Member","text":"Thank you for your show, fathers. My question comes all the way from down under in the land of kangaroos, otherwise known as Australia. It is regarding demon osis, a word which, like you, I would love for it to become a real thing. I want to know whether you think that the process of demonosis works in a similar way to theosis, that is, through the indwelling of a spiritual demon. So in the same way that the Holy Spirit works within us to produce Christlikeness, does Satan and his demons work within us to make us more like them? Pseudomachrus puts it bluntly that we're either temples of Satan or demons or temples of Christ and that even baptized Christians can function as temples of the demons if they choose to obey them. Would you agree with him that baptized Christians are housing demons if they cooperate with them to perform their sinful deeds? Or is it more of an external thing when Christians who are baptized and filled with the Holy Spirit perform the sinful deeds of the demons?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9125.49,"end":9132.01,"speaker":"Fr Andrew Stephen Damick","text":"All right, this is an interesting question. Is this our first one from Australia? I'm not sure. I think so."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9132.01,"end":9141.57,"speaker":"Fr Stephen De Young","text":"I don't know. But I will. I will say take care of yourself down there. I saw this series of documentaries about life in Australia called Mad Max, and it seems pretty rough down there."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9143.41,"end":9198.31,"speaker":"Fr Andrew Stephen Damick","text":"If you see Mel Gibson, find shelter immediately. Yeah, yeah. I mean, so here's my hot take on this. I'm okay with being quenched. Is that. Yes, right. Like that. In some sense, the whole spiritual life is an internal thing, and human beings are permeable to spiritual presence all the time. But I would say that the way in which demons function within the human person is not the same as the way in which the Holy Spirit functions within the human person. And so I wouldn't use the word indwelling, maybe because it's so associated with the Holy Spirit, but maybe that's just my experience of reading all of this stuff in English. I don't know. What do you think, Father?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9200.07,"end":9204.07,"speaker":"Fr Stephen De Young","text":"Well, I mean, with its demons, it's called possession."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9205.91,"end":9206.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9208.47,"end":9252.17,"speaker":"Fr Stephen De Young","text":"And we've talked about the phenomenon of Holy Spirit possession and how uncomfortable that language is in the Old Testament. Right, right, right. The same way that dwelling seems kind of, right, incompatible with the idea of demons, but that's because. Right. Demons wish you harm as opposed to the Holy Spirit. So I don't think St. Macarius is saying that a Christian who is filled with the Holy Spirit can be possessed by demons. Right. I think we can't take for granted that someone who identifies as a Christian or even someone who is baptized at some point is filled with the Holy Spirit."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9253.68,"end":9254.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9254.72,"end":9256.8,"speaker":"Fr Stephen De Young","text":"At a later point in their life."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9256.96,"end":9259.44,"speaker":"Fr Andrew Stephen Damick","text":"You can, as it says, you can quench the Spirit."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9259.84,"end":9264.64,"speaker":"Fr Stephen De Young","text":"You can quench the Spirit. You can grieve the Holy spirit. Right. Psalm 50."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9264.72,"end":9269.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Take not thy Holy Spirit from me. Which means he could be taken from you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9270.08,"end":9338.45,"speaker":"Fr Stephen De Young","text":"Yes. So, yeah. So I think if someone who at some point was baptized as a Christian and received the Holy Spirit is at some later point demon possessed, it would be because of that. Right. Because as we all unfortunately know, there are people who are baptized and even people who seem very devoted and dedicated Christians who later on may become very wicked people. Right. That do very wicked things and turn their backs on Christ and reject Christ. That doesn't mean, oh, they were faking it all along. And it's important that that's not what it means because otherwise you can never have any sense of assurance or security in your faith because you could find out it was all fake one day. That doesn't happen. But you can, as Hebrew says repeatedly. Right. As the scriptures say repeatedly, you can choose to reject God if you want."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9338.45,"end":9338.77,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9340.53,"end":9373.18,"speaker":"Fr Stephen De Young","text":"And to have nothing to do with him. So those would be the people who would then later become demonically possessed. Right. Because, I mean, that's. You know, the gerosene demoniac had lots and lots of demons living inside of him. They were not connecting him to God. They were not God himself like the Holy Spirit is, but they were dwelling there and they were bringing about and seeking his destruction and tearing away his humanity. So I would say it's not the same, but it's parallel."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9374.62,"end":9388.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. All right, so this next one comes from a different Jonathan than we heard from before. Greetings, podfathers. My name is Jonathan. For context, I have an inquirer who is coming from a background as a."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9388.15,"end":9391.11,"speaker":"Audience Member","text":"Lutheran since been attending Calvinist Baptist churches."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9391.67,"end":9394.35,"speaker":"Fr Andrew Stephen Damick","text":"I don't understand how righteousness by faithfulness."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9394.35,"end":9396.87,"speaker":"Audience Member","text":"Fits with balancing the scales of Mishpah justice."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9397.43,"end":9402.99,"speaker":"Fr Andrew Stephen Damick","text":"So Abraham was faithful to God in moving to the promised land and in offering Isaac and in rescuing Lot while."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9402.99,"end":9404.63,"speaker":"Audience Member","text":"Not communing with the giant plants."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9404.79,"end":9413.36,"speaker":"Fr Andrew Stephen Damick","text":"Definitely a sheep was threatened to him as righteousness. Yet he also gave his wife to harems twice and abandoned Hagar and Ishmael to the desert."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9413.6,"end":9415.92,"speaker":"Audience Member","text":"The scales still don't seem balanced."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9416.08,"end":9427.36,"speaker":"Fr Andrew Stephen Damick","text":"How do those two realities interact? Luther brain tells him that righteousness covers up the offense from justice, which sounds bad. Is it that because Abraham is a sheep, balancing the scales is now solely."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9427.36,"end":9430.08,"speaker":"Audience Member","text":"About lifting the victims up without any bringing him down?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9430.4,"end":9455.93,"speaker":"Fr Andrew Stephen Damick","text":"Thanks. Okay, so Abraham, not so, you know, based on all the things he does, he's saying he doesn't think he's that faithful on balance. And is there a problem with sort of balancing the scales, using that concept of justice to talk about his life? And is he really faithful then, you know, with that lens? So he mentioned mishpat. Right. Which is. Isn't that just the general Hebrew word for justice?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9457.29,"end":9463.12,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And we explain how the concept is sort of things being in the correct place and in the correct order."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9463.2,"end":9477.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, I mean, Abraham does not do those things with his wife as time goes by. So we couldn't. We say he repented. Right. You know."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9477.52,"end":9481.52,"speaker":"Fr Stephen De Young","text":"Right. And. And that's. That's the core of the answer to the question."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9481.6,"end":9482.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay, there we go."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9482.88,"end":9506.07,"speaker":"Fr Stephen De Young","text":"Right. So the presupposition behind the question is that what justice means is you pile up all the good things you did on the one side and all the bad things you did on the other side and see which one's heavier. Right. That's sort of the presupposition. And he's looking at Abraham and saying, I don't know that that balances out in the direction of righteousness. Right. Or faithfulness."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9507.03,"end":9507.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9508.71,"end":9576.2,"speaker":"Fr Stephen De Young","text":"But that's not. We're talking about how justice works. Right. We're talking about. What St. Paul is talking about, for that matter, is that Abraham is justified through his faithfulness. Meaning what's out of order and broken in him is put back in order and healed by means of his faithfulness. And his faithfulness plays out over the course of his life. Right. So when you read Abraham's story in the scripture, it has an arc. He starts in one place, he finishes in another place. The end of Abraham's story is him being willing to sacrifice Isaac. That's the ultimate moment of his life as it's written about in the book of Genesis. And so that's the Abraham who emerges as the result of his life. And that's where St. James says, we can look at Abraham and see him fully justified by what he did."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9576.44,"end":9577.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9578.04,"end":9614.63,"speaker":"Fr Stephen De Young","text":"Not that what he did justified him. Right. But that what he did there displayed the fact that over the course of his life, through his faithfulness, which includes repentance. Right. Which includes struggling with sin or course of his life, that he had been put back in order. And that this had happened. Right. So, yeah, it's not where you start, it's where you end up. Right. And you can say the same about any number of biblical saints."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9615.11,"end":9615.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9615.99,"end":9635.68,"speaker":"Fr Stephen De Young","text":"I mean, St. Peter denies Christ three times, but then he's restored, and then he goes on to go and preach Christ boldly. Right. And Right. There's this arc of his life. And so the goal of the Christian life is to have the same arc."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9637.36,"end":9637.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9637.92,"end":9686.44,"speaker":"Fr Stephen De Young","text":"It's not that all the bad things I did. Right. Like, I spent most of my early life doing bad things. I'm speaking personally here. Therefore I need to spend the rest of my life doing good things and hope I live long enough to outnumber them. Right. The goal of the Christian life is to have that arc. The goal of the Christian life is to press on in the race. All the analogies St. Paul uses are pressing on in the race, continuing the struggle, pushing forward, not stopping, struggling to remain faithful. Right. Throughout our life. And it's then where you end up. Right. David starts one place, arguably in the middle, ends up in a worse place than where he started, but then ultimately ends up in an even better place than where he started."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9688.28,"end":9688.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9688.92,"end":9701,"speaker":"Fr Stephen De Young","text":"Right. And that's the arc of humanity as a whole, as the scripture presents it, by the way. Humanity starts in a good place, goes to a bad place, but ultimately ends up in an even better place."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9703.93,"end":9710.33,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're going to take a couple more. This next one, I'm hoping, is a pretty easy one. This is from Miriam."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9712.65,"end":9747.62,"speaker":"Audience Member","text":"Hi, Fathers, I'm Miriam. Firstly, thank you so much for the show. It's amazing. And I have a kind of general Old Testament question. It says somewhere, unfortunately, I'm not exactly sure where, citation needed, but that the Lord delivered Abraham from Ur of the Chaldeans. And in the book of Daniel, it says sorcerers, enchanters and Chaldeans. So my question is, who are the Chaldeans? Thank you."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9748.5,"end":9761.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, short answer, Babylonians. Right. But longer answer. Right. There is no Babylon in Abraham's time, if I'm remembering correctly."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9762.42,"end":9762.82,"speaker":"Fr Stephen De Young","text":"Well."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9765.54,"end":9767.06,"speaker":"Fr Andrew Stephen Damick","text":"Sorta, yeah. Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9768.58,"end":9769.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9769.02,"end":9772.66,"speaker":"Fr Andrew Stephen Damick","text":"Sorcerers, enchanters and Neo Babylonians."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9773.7,"end":9805.74,"speaker":"Fr Stephen De Young","text":"Yes. Strictly speaking, the word Chaldean. Right. The word Chaldean means, was a reference because of Chaldea to the Neo Babylonian empire. Yeah. So Nabopolasser, Nebuchadnezzar. Right. We're talking late 7th 6th century B.C. right. So this is one of the places, one of the many places where parts of the Torah have been updated at later stages."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9806.43,"end":9806.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9807.79,"end":9852.31,"speaker":"Fr Stephen De Young","text":"Right. Because Ur at the time Abraham lived, as we've talked about, was the ur3 period. This is the Sumerian Renaissance. It was the greatest city in the world, most powerful city in the world. Ur was not an important city by the time you get to, like, the 6th century B.C. right. It was just not a major, significant city. And so this is clearly a place where we got a little update, right, to say Ur of the Chaldeans. Ur, right over there in Babylon. Right. To make clear where we were talking about to a later generation of people that weren't as familiar with Ur, especially since Ur just means city."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9852.87,"end":9854.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9854.95,"end":9859.27,"speaker":"Fr Stephen De Young","text":"In Sumerian and the Hebrew. IR is the Hebrew word for city."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9861.73,"end":9869.81,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. All right, so we're going to take one more, and this will be it for this Thanksgiving episode."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9870.29,"end":9874.77,"speaker":"Fr Stephen De Young","text":"Unless somebody calls into the studio right now by sensing the vibes we're sending out."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9874.93,"end":9885.17,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. It's true, actually. There's no phone in here that'll ring. That's so blissful. Okay, here we go. This last one's from Andy."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9885.75,"end":9888.87,"speaker":"Fr Stephen De Young","text":"Thank you for taking my question. This is Andy from Alabama."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9889.11,"end":9898.47,"speaker":"Fr Andrew Stephen Damick","text":"I'm a Protestant friend of the show who's never been offended by anything you guys have said because I don't neatly fall into one of the Protestant buckets. My family and I are part of the pca."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9898.63,"end":9904.19,"speaker":"Fr Stephen De Young","text":"The irony there is I'm unconvinced about Reformed theology and have even been told I'm the worst Presbyterian ever, which is."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9904.19,"end":9905.27,"speaker":"Fr Andrew Stephen Damick","text":"My badge of honor."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9905.51,"end":9907.71,"speaker":"Fr Stephen De Young","text":"But, hey, Sundays are orderly, liturgical, it's."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9907.71,"end":9915.71,"speaker":"Fr Andrew Stephen Damick","text":"Confessional, and it's a great place to be. I consider myself a Christian mutt, where I esteem the Nicene Creed as being sort of dogmatic and then, thanks to."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9915.71,"end":9918.97,"speaker":"Fr Stephen De Young","text":"The Reformation, but not lean toward various."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9918.97,"end":9920.77,"speaker":"Fr Andrew Stephen Damick","text":"Doctrines from many church traditions."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9921.33,"end":9923.17,"speaker":"Fr Stephen De Young","text":"So, for example, I agree with the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9923.17,"end":9927.49,"speaker":"Fr Andrew Stephen Damick","text":"PCA about baptism in that it does initiate the baptized into the covenant, but."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9927.89,"end":9929.93,"speaker":"Fr Stephen De Young","text":"Where they end, I keep going because."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9929.93,"end":9933.17,"speaker":"Fr Andrew Stephen Damick","text":"Baptism does more than that. Just see your baptism episode."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9933.25,"end":9934.33,"speaker":"Fr Stephen De Young","text":"And the same could be said about."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9934.33,"end":9935.69,"speaker":"Audience Member","text":"The Eucharist, and the same can be."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9935.69,"end":9939.89,"speaker":"Fr Andrew Stephen Damick","text":"Said about a lot of other things. Father Stephen DeYoung has used the brackets."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9939.89,"end":9948.29,"speaker":"Fr Stephen De Young","text":"Analogy on this show before, and I see myself as having much wider brackets of reality than most Protestants do. But I still exist in a truncated."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9948.29,"end":9950.21,"speaker":"Fr Andrew Stephen Damick","text":"Version of reality because of my church experience."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9951.17,"end":9953.13,"speaker":"Fr Stephen De Young","text":"So what do I do when what."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9953.13,"end":9954.89,"speaker":"Fr Andrew Stephen Damick","text":"I believe, seek, and know to be."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9954.89,"end":9957.05,"speaker":"Fr Stephen De Young","text":"True is more like Thanksgiving dinner, but."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9957.05,"end":9958.53,"speaker":"Fr Andrew Stephen Damick","text":"Our church is a turkey sandwich?"}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9958.93,"end":9968.65,"speaker":"Fr Stephen De Young","text":"Is that okay? The easy answer might be just become an Orthodox Christian, but the reality is it's just not that easy, especially with a family who doesn't all hold the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9968.65,"end":9969.89,"speaker":"Fr Andrew Stephen Damick","text":"Same level of convictions."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9970.45,"end":9971.25,"speaker":"Fr Stephen De Young","text":"Thanks, guys."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9972.14,"end":9975.82,"speaker":"Fr Andrew Stephen Damick","text":"Here you go. The worst Presbyterian ever. I'm glad we got him to call."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9977.1,"end":9980.62,"speaker":"Fr Stephen De Young","text":"Yeah, congratulations on the title. You're right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":9983.9,"end":10292.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, on some level, right. I think he's right. Just become Orthodox. But of course it's not that easy. But I will say this, like, and I know that this is some. You know, there are a number of people who listen to this show who maybe don't have experience of orthodox worship and only have experience of some other kind, probably Protestant mostly. And they find a lot of what we talk about on the show really fascinating and interesting and they believe it. But when they look at their own actual church life, they don't see it reflected there. And in many cases, if they were to try to do something about that within their local congregation, it probably would cause a bit of a stir. You know, like if you believe in the communion of saints and want to begin invoking saints within your Protestant context, probably in most places you go, that's not going to be accepted at all. You know, maybe some Anglicans, although Anglicans, a lot of them would say we're not Protestants, like, okay, whatever you want to call yourself is fine. Although I will point out that at least the Episcopal Church usa, that its full title, or maybe at least its original full title was the Protestant Episcopal Church in the usa. But in any event, I mean, this honestly is part of what led me to become Orthodox. Now, I didn't have a Lord of Spirits podcast to listen to. I didn't actually, I didn't even. There wasn't anything. I know, for instance, a number of our friends who are familiar with the work of Dr. Michael Heiser, they became exposed to some of the same stuff we talk about here through his work. And once again, like, where's the church that functions according to the stuff that he talks about? Like, there isn't one that I'm aware of. Maybe there is something out there that's really doing it. According to all the stuff that he talks about and the way he talks about it. I'm not aware of it, but in my experience of becoming Orthodox now, 25 plus years ago, is I desired and believed in the possibility for human beings worshiping God in truly experiencing heaven on earth and not in just an emotionalist way. Right. That divine presence could be experienced in the material world. I believed that, but I had never experienced it in any self conscious way before. And the only way for me to actually get hold of that was to become orthodox. When I discovered The Orthodox Church. It was very apparent to me, like, here it is. Like, this is all true. And here you can have it. You can do it right now. My situation at the time, I was young man, college age, early 20s. Certainly my family did not come along with me, meaning my parents and my siblings. I mean, I was not married at the time. I had no children. But, you know, so as a result, the family tension created over doing it was not a lot, frankly. You know, I mean, my family were generally pretty accepting of what I was doing, but no one was depending on me. Right. So I wasn't going to affect anybody else's life by doing it, you know, except for the lives that eventually would intersect with mine and so forth. But. So I understand, you know, Andy, what you're talking about, even though that's not been exactly my experience in. In every way. And, you know, I mean, since you introduced this idea, let me ask you this. Like. Like, it's funny and fun to be the worst Presbyterian ever, but is that what you want to be? Like, do you want to be a. A Presbyterian who's the worst one ever? Or could you be something that's completely consistent? So, I mean, that's my challenge to you. I know you know that. I don't know if you can do anything about that or maybe even want to do anything about that, but, I mean, I've met plenty of people that, within their religious contexts, will say, I'm the weirdest one here. Or I'm different from the rest of these people. People and are sort of happy about that, and that's cool. But at the same time, what if you could live a life that's completely consistent with what you believe? What if you could worship in a way that actually manifests what you believe about the world as it truly is? What if. And from an orthodox point of view, you can. You really can. It's actually there and available, so I don't know, Father, I'll give you the last word on all this stuff."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10293.51,"end":10299.67,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, it's hard to know what he means by family."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10300.15,"end":10302.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. He didn't say wife and kids, so."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10302.63,"end":10309.11,"speaker":"Fr Stephen De Young","text":"Yeah, so. So I'm gonna. I'm gonna add a proviso, assuming it did mean wife and kids."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10309.11,"end":10310.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10313.2,"end":10319.04,"speaker":"Fr Stephen De Young","text":"Yeah. It's hard to be happy with the turkey sandwich when you smell Thanksgiving dinner next door."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10321.36,"end":10321.76,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10323.92,"end":10414.75,"speaker":"Fr Stephen De Young","text":"It'S very important. And this is gonna tick some people off, too, probably. But again, I don't care if, for example, you saying, okay, that's it. I'm going to go I'm going to start the process of joining the Orthodox Church tomorrow. And my wife can keep taking the kids to the Presbyterian Church on Sunday morning, but I'm going over to this Orthodox Church. One of the very real things that can happen in that kind of situation is, for example, your kids really resent the Orthodox Church for having messed with their family life and that's not good. Right. Or your wife sort of resents the Orthodox Church for taking you away from her and leaving her with all the kids on Sunday morning and so becomes less open to any kind of religious discussions, not more so. Right. It sounds like to me, like Father Andrew just said that you probably know somewhere in your heart and your soul, in your mind, that you want and need to kind of move in the direction of Orthodoxy. But it's not wrong to count the cost and be discerning in terms of how you do that and how long you take to do that."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10416.12,"end":10416.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10416.44,"end":10487.24,"speaker":"Fr Stephen De Young","text":"And how that process goes. Right. I mean, as we said earlier in this episode, three year catechesis used to be normal. Right. So there's no shame in taking time. There's no shame in waiting for other immediate family members to be more ready. Right. And being considerate in how you do it. Right. And I can't count the number of people where I've had one spouse come to me at one point and say, you know, I'm going to do this, but my wife, fiance, husband, whoever, has no interest and is never going to show up here. And within a certain amount of time, the whole family's Orthodox. Right. It does happen, right. Sometimes it's a very long time that that takes to happen. Right. And stuff. But be considerate about it, be wise. Right about it. But yeah, I think you know what you need to do ultimately."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10488.36,"end":10521.46,"speaker":"Fr Andrew Stephen Damick","text":"God bless you and your family, Andy. All right, well, that's our show for today. Thank you very much for listening, everyone. If we didn't address your question this time, you can still email us@lordofspiritsand ancientfaith.com or you can message us through our Facebook page or you can leave us a voicemail@speakpipe.com LordOfSpirits. We actually tend to favor those when we're doing Q and A episodes that are pre recorded. If you have basic questions about Orthodox Christianity or need help finding a parish, head on over to Orthodox in and."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10521.46,"end":10526.66,"speaker":"Fr Stephen De Young","text":"Join us for a live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10527.06,"end":10538.58,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can follow our page. You can join our discussion group, leave reviews and ratings in the appropriate and tasteful places, but most importantly, share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10539.3,"end":10552.43,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. Best possible argument for the old calendar the McRib comes back every year during New Calendar Nativity Fest."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10552.43,"end":10562.67,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, that's you got me there, man. Anyway, buy my new book everybody, and thank you. Good night."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10562.83,"end":10564.99,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10564.99,"end":10568.07,"speaker":"Fr Andrew Stephen Damick","text":"Spirits with Orthodox Christian priests, Father Andrew."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10568.07,"end":10570.11,"speaker":"Fr Stephen De Young","text":"Stephen Damick and Father Stephen DeYoung."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10570.11,"end":10573.48,"speaker":"Fr Andrew Stephen Damick","text":"Alyssa supported presentation of Ancient Faith Radio."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10574.12,"end":10576,"speaker":"Fr Stephen De Young","text":"And I beheld and I heard the."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10576,"end":10580.44,"speaker":"Fr Andrew Stephen Damick","text":"Voice of many angels round about the throne and the beasts and the elders."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10580.44,"end":10582.28,"speaker":"Fr Stephen De Young","text":"And the number of them was 10,000."}
{"episode_id":"LOS - #081 - 2023-11-23 - Pantheon and Pandemonium IX - Asynchronous Q&A Nov 2023","start":10582.44,"end":10600.05,"speaker":"Fr Andrew Stephen Damick","text":"Times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
