{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":0.8,"end":65.41,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":67.89,"end":121.42,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, everyone. Welcome to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855 AF radio. That's 855-237-2346. And Montes Gucca Trudy will be taking your calls tonight, but we're going to get to your calls in the second part of today's show. So Lord of Spirits is brought to you by our listeners. That's you with help from St. Athanasius Academy of orthodox theology. Saint Athanasius is an online academy for K through 12 offering live classrooms in core subjects, foreign languages, various electives, and orthodox studies. To learn more about St. Anthony's Academy, please visit at www.saaot.edu."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":122.22,"end":125.42,"speaker":"Fr Stephen De Young","text":"And I talked to Deacon Adam again."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":125.74,"end":126.46,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":126.7,"end":144.71,"speaker":"Fr Stephen De Young","text":"And I wanted to just address the elephant in the room. Some people may look at the St. Athanasius Academy tuition rates and they may be concerned, but he assured me that no matter how many courses you take at those low, low prices, you will not add a penny to the national debt."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":148.31,"end":151.99,"speaker":"Fr Andrew Stephen Damick","text":"Well, that was my biggest concern. So I'm feeling a lot. I could tell."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":151.99,"end":154.31,"speaker":"Fr Stephen De Young","text":"I could tell you're a deficit hawk. I know."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":154.71,"end":221.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, big time. Yeah. So, you know, one of the more difficult practices to become accustomed to for those who look into the orthodox Christian faith and even for some lifelong members, is the keeping and the veneration of relics. Relics can present a jarring conundrum. On the one hand, you're being confronted with the body parts of dead people. But on the other, there are miracles associated with them. We can think of the bones of the prophet Elisha bringing a dead man back to life in Second Kings 13:21. Or we can think of relics like the hand of St. Mary Magdalene, which I myself venerated in 2018 at Simonau Petro Monastery in Mount Athos and can confirm is actually warm, just as the living hand of a human being is warm. Do we as Orthodox Christians just point to the miracles in the history and tell people, just tough it out and accept it? Or is there actually a biblical theological reason for this? So, Father Stephen, is there? Yes. Good night, everybody."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":221.52,"end":222.08,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":224.56,"end":241.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so there is. So to get there though, we need to kind of loop back and head back to some of our most mind bending episodes where we talked about what a body is. So let's do a little recap. Last time on Lord of spirits."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":241.13,"end":245.45,"speaker":"Fr Stephen De Young","text":"No, what? 15th from last time on Lord of Spirits."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":245.53,"end":246.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":246.73,"end":260.9,"speaker":"Fr Stephen De Young","text":"We have to just do previously, previously, previously, Lord of Spirits and then. And then clips. Right, but, but yeah, so we have to start all the way back with what a body is."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":261.38,"end":261.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":261.94,"end":269.06,"speaker":"Fr Stephen De Young","text":"Because if we're going to talk about body parts, we have to start with what the body is of which they were part."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":269.62,"end":270.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":270.98,"end":281.3,"speaker":"Fr Stephen De Young","text":"And so we had defined that as being a body, as being, in the ancient understanding, a nexus of powers and."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":281.38,"end":291.1,"speaker":"Fr Andrew Stephen Damick","text":"Or potentialities, which I understand is now a T shirt. There's actually a T shirt out there, you can get there that says that defines a body that way. So. Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":291.1,"end":294.74,"speaker":"Fr Stephen De Young","text":"And you could use it to cover your nexus of powers and potentiality."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":297.62,"end":297.94,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":297.94,"end":303.54,"speaker":"Fr Stephen De Young","text":"That will let you go into circle K if you're wearing a shirt, as you should."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":305.02,"end":305.5,"speaker":"Fr Andrew Stephen Damick","text":"No shoes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":305.82,"end":307.74,"speaker":"Fr Stephen De Young","text":"Shoes also. I learned that the hard way."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":309.26,"end":312.86,"speaker":"Fr Andrew Stephen Damick","text":"So strange things are afoot at the Circle K."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":314.62,"end":333.38,"speaker":"Fr Stephen De Young","text":"So. And we talked about how. Right. We tend to think purely when we hear the word body. We think in terms of physical body, in terms of meat. But we talked about how the ancient understanding God has a body, that he has powers. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":333.54,"end":334.58,"speaker":"Fr Andrew Stephen Damick","text":"And Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":334.58,"end":367.36,"speaker":"Fr Stephen De Young","text":"The angelic beings that do not have material physical bodies still have bodies because they have powers and, and abilities. And so the, the potentiality part. And we're going to delve into that a little more as we go on comes in when we start talking about material bodies. But we also talked about. And we want to sort of rehearse here and maybe even clarify a little bit bit because we got some, I'll call them questions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":367.84,"end":368.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":368.48,"end":371.92,"speaker":"Fr Stephen De Young","text":"Rather than objections or arguments, but questions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":372.32,"end":375.84,"speaker":"Fr Andrew Stephen Damick","text":"Concerns, requests for clarification."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":376,"end":392.39,"speaker":"Fr Stephen De Young","text":"Yes. As to how that bodies term relates to the terms that. That most folks who read some stuff about Orthodox theology were. Would be more familiar with, like nature and will and energy and those things."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":392.55,"end":396.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The stuff that you see from the, like the Ecumenical councils, for instance."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":397.03,"end":416.62,"speaker":"Fr Stephen De Young","text":"Right. And we, we had previously said that we're talking about a translation thing. Right. That the body language was primarily language that was used in the ancient period, sort of pre. Pre Greek, philosophical even."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":416.7,"end":417.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":418.14,"end":443.59,"speaker":"Fr Stephen De Young","text":"And that. That's a way of describing that very early, especially the ancient Israelite and their pagan neighbors way of. Of viewing this and understanding a body. And then that gets translated into other terms. And we mentioned at the time that they're. They're probably better terms. And that's part of what we want to talk about now is how these terms sort of clarify."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":443.91,"end":444.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":444.31,"end":472.16,"speaker":"Fr Stephen De Young","text":"In a way that just saying body doesn't. Even though there are times where you'll see in the Fathers, for example. Well, that. Where they'll talk about Christ's humanity and just refer to it as his human body. And when they do that, they're not saying that Christ's humanity was just a physical body because that same church father will expressly deny that in other places. But they're just using that older language still."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":472.56,"end":565.67,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you know, the older language, we see it number one in the Bible. Right. Referring to, you know, well, we're going to talk about this more. But for instance, the body of Christ, again, we shouldn't assume that these things are just metaphors. You know, also we see it in pagan usage where idols are referred to as the body of the God. They don't think that, you know, that the spirits that they're worshiping, like they're not. That's not a metaphor. Right. And it's also not. It should not be taken in an utterly material sense in the sense that they think that the spirit is kind of confined to that piece of stone or whatever, you know, so this usage does exist, but as you said, it's kind of imprecise. And what happens with use of Greek philosophical language is kind of makes the distinctions a lot clearer. So that a lot of. When the word body is used in scripture, in patristic usage, for instance, they would then use the word nature even though they don't exactly perfectly map. Right. Because nature, like nature can often have a more universal sense, like human nature. Like you and I share human nature. Right. Whereas body can be something that belongs to a particular being and through which that being is working. So it doesn't exactly map one to one, but it sort of clarifies things in the patristic, the Greek philosophical usage, Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":565.91,"end":645.21,"speaker":"Fr Stephen De Young","text":"Those are similar. And yeah, there's a. What happens is as the ancient understanding of the Christian understanding of, for example, the Incarnation or of the Holy Trinity is challenged, right. They. They need this greater precision, Right. Because you can take body in a lot of different ways. Right? So when Apollinarius shows up and says, well, Christ just took a human material body, right. It was just sort of anime animating it, right. Then the fathers have to say, well, whoa, timeout, right? No, and they have to use more specific terminology, right. To explain why that's a misunderstanding and will lead you in the wrong direction. So to kind of run through that quickly, right? Nature, as, as you're saying, is probably the closest, the most overlap. The Venn diagram has the most overlap with the ancient sense of body. And so nature is sort of a set of powers and potentialities. And that's over against the way we often think about nature, which is as a set of qualities or properties."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":645.85,"end":646.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":646.53,"end":647.69,"speaker":"Fr Stephen De Young","text":"That an object has."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":648.17,"end":663.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. So if you have, if you have human nature, then you have all the abilities that a human has, Right. You can do the things, you know, and that's going to include the material body, but it's also going to include things like your soul, which is not material."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":664.91,"end":675.79,"speaker":"Fr Stephen De Young","text":"Right, right. And nature is this dynamic concept, not a static concept, Right. You don't arrive at the nature of something by just describing it in ever more minute detail."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":676.43,"end":676.83,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":676.99,"end":764.72,"speaker":"Fr Stephen De Young","text":"Right, right. Nature is a function of what it is doing. Right. And so this is. This understanding is super important. When you get to Christology, we're going to end up talking a lot about Christology tonight and the Incarnation tonight. Because if you understand. Well, this is basically where people run into trouble in understanding the Incarnation. Because if you understand nature as this set of qualities or properties, then you understand Christ's divine nature as this one set of properties of God. Properties, right. Omniscient, omnipresent. Right. And all of. All of these properties. And then you understand human nature as another list of qualities or properties, like finitude, weakness. Right? And then you look at those two subsets and you find qualities or properties that conflict with each other. And so now that you have this problem, right? And this is when you look at Jewish and Islamic arguments against the Incarnation, that's how they're all framed, is just coming up with a list of divine qualities and human qualities and showing that they contradict each other, that's their Whole argument. But then all kinds of bad Christology comes from trying to resolve this unnecessary problem."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":765.28,"end":765.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":766,"end":793.75,"speaker":"Fr Stephen De Young","text":"Whereas if you understand nature in this dynamic sense as powers, Christ possesses full and complete divine powers, and he takes upon himself in addition, our human nature, meaning he takes human powers and potentialities as well in the Incarnation. Because powers and potentialities cannot conflict with each other."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":796.15,"end":797.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":797.15,"end":809.28,"speaker":"Fr Stephen De Young","text":"Being able to go left and being able to go right does not contradict. Right. Being tall and being short, two qualities of properties do contradict each other."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":809.84,"end":811.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":812.24,"end":823.28,"speaker":"Fr Stephen De Young","text":"So. So that's. That's nature. And then. And then the idea of the will in the ancient concept then proceeds out of that."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":823.92,"end":841.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So will is not the way that we tend to think of it. Like. Like what will I have for dinner? I will have the lasagna. I will have ice cream. Yeah. It's not. That's not what will is. That's right. Yeah. Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":841.11,"end":843.63,"speaker":"Fr Stephen De Young","text":"In fact, choosing to go left or right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":843.63,"end":866.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which. Which I think, if I'm correct on this, doesn't seem. Maximus, the confessors say that doing that actually is kind of the result of the fall. You know, that's not. Yeah, yeah. And Christ doesn't sit around going, man, I don't know what to do. Let me think about this for a while. I've got some ideas here. You know, it's not the way he functions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":866.6,"end":879.52,"speaker":"Fr Stephen De Young","text":"Right, right. And he definitely doesn't have two different capacities that are both doing that at the same time. Right. A human one and a divine one. Right, right, right. So when Saint Maximus talks about that."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":879.52,"end":879.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":879.8,"end":920.13,"speaker":"Fr Stephen De Young","text":"He calls that the gnomic will. But if you look at his language close up, he describes that as a second movement of the will in addition to the natural movement of the will. And so if we understand will as a movement. Right. So if nature is then this set of powers and potentialities, then will is a movement in a particular direction, specifically towards sort of the perfection of that nature. So if you have an acorn, that acorn already has the nature of the oak tree."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":920.53,"end":921.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":922.21,"end":930.77,"speaker":"Fr Stephen De Young","text":"And that nature is expressed in the acorn almost entirely as potentiality. It has the potential to become an oak tree unless it's dead."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":930.85,"end":931.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":932.69,"end":944.61,"speaker":"Fr Stephen De Young","text":"And so then its will. And Aristotle and other early philosophers do not hesitate to use the term will for even inanimate objects in this regard. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":944.61,"end":944.97,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":944.97,"end":1015.4,"speaker":"Fr Stephen De Young","text":"That will, then, is the. The movement, sort of the internal movement that causes it to grow toward that perfection, to grow into the oak tree. And so when the church says that Christ has two wills, they're not saying he had two separate decision making faculties that were both making choices, even that they always agreed. They were saying that Christ possesses the perfect divine will. Right. Which is not a movement toward perfections. That's why there's powers and not potentiality when we talk about the divine nature. Right. Because he already perfectly possesses it, but also then a human will which is moving toward human perfection. Right, Right. Which of course he also achieved. And so when we talk about free will with this understanding of the natural will, we don't mean what Western theology means."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1015.88,"end":1016.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1016.24,"end":1029.64,"speaker":"Fr Stephen De Young","text":"Or Western philosophy means make a decision. You're Right. You're able to choose between contrary opposites. Right. You're able to go left or to go right. You're able to steal the candy bar or pay for the candy bar."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1029.8,"end":1036.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's. It's freedom. It's freedom to be what it is you're supposed to be. Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1037.08,"end":1040.12,"speaker":"Fr Stephen De Young","text":"Right. Your will is not obstructed by anything."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1041.11,"end":1041.35,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1041.43,"end":1048.71,"speaker":"Fr Stephen De Young","text":"Right. So the acorn is free to grow into the oak tree. It is not obstructed by a lack of nutrients in the soil, kind of."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1048.71,"end":1054.47,"speaker":"Fr Andrew Stephen Damick","text":"Arrested development, you know? Yeah, yeah, right. Or lack of lack of arrested development."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1055.03,"end":1070.36,"speaker":"Fr Stephen De Young","text":"Right. And so this, this understanding of freedom is important. Right. So from, from the perspective of orthodox Christianity, the reason once we're in the age to come, we will not be able to fall into sin again is that we will have perfect free will."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1072.03,"end":1073.71,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1073.79,"end":1120.46,"speaker":"Fr Stephen De Young","text":"We will be free from sin. And so we will be free to eternally develop and draw closer to God for all eternity because there will be nothing obstructing us from achieving that human, that purpose of human nature as it was created by God anymore. And so then finally the term energy, which, you know, we hear energy as, as modern people who have studied science and we think, you know, or ray guns or gamma rays or something, but this is just working in the world. So this is just the will actualizing itself, meaning producing action in the world."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1121.18,"end":1121.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1123.91,"end":1127.59,"speaker":"Fr Stephen De Young","text":"The externalizing of the internal will."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1127.75,"end":1130.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The will expressing itself."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1130.95,"end":1140.39,"speaker":"Fr Stephen De Young","text":"Right. And all of that is kind. It is to a greater or lesser extent, contained within that older understanding of body."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1141.51,"end":1145.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is just kind of breaking it down in very precise terms."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1146.07,"end":1160.85,"speaker":"Fr Stephen De Young","text":"Right. It gets disambiguated because it needs to be to explain the problems with bad theology that starts arising in the early church and to really clarify who Christ is and how this all works."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1161.25,"end":1211.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the classic example of this kind of narrative playing out is like in scripture, it says, the Lord your God, the Lord is one Right. But then Nicaea says that the Son of God is, is homoousios of one essence with the Father, which at the time was an innovative word in theological terms and a lot of people opposed it precisely because it wasn't in the Bible. And yet the Fathers determined that this was the word that was needed in order to lay out precisely how it is that God is one, the oneness between the Father and the Son in order to counter Arianism. So this is just another example of that kind of thing. Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1211.16,"end":1222.68,"speaker":"Fr Stephen De Young","text":"Yeah. And so, you know, as we, as Christianity moves into different languages and faces different kinds of opposition, we sort of re. Articulate things."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1223,"end":1223.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1223.32,"end":1236.7,"speaker":"Fr Stephen De Young","text":"That's not a change, that's just a clarification or re. Articulation, re explanation, reappropriation. Because every, every culture and people needs to appropriate the change truths of Christianity for itself."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1236.86,"end":1270.5,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And I suddenly different forms and you've, you've used the word translation. I, I think that's a great word for this because anyone who's done any translating knows that translation is not just a matter of finding the word that matches with the word into one language that matches in the original language. It doesn't, it doesn't ever quite exactly perfectly fit. So you have to come up with other ways of expressing things that are not simply word for word literal translations, because you can never completely achieve that from one language to the next."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1271.38,"end":1284.18,"speaker":"Fr Stephen De Young","text":"Right. You have to, you have to move from the source language to the, to an encounter with the object being described by the source language and then describe that same object in the target language."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1284.42,"end":1285.38,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1285.7,"end":1297.87,"speaker":"Fr Stephen De Young","text":"You can't just go from source language to target language. Yeah. And I won't rabbit trail here, but this is where all kinds of bad biblical interpretation comes from."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1298.11,"end":1299.31,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure, sure."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1299.39,"end":1303.79,"speaker":"Fr Stephen De Young","text":"Going from Greek to English without, you know, do not pass go, do not collect $200."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1304.99,"end":1329.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you know, and even just in this particular topic, the word body has not always meant the same thing just in the history of English, to say nothing about the history of Greek. You know, like we're tracking it across the Hebrew and the Greek in the Bible, then on towards the Greek using being used by the early church fathers. Right. So it's, it's none of these words ever exactly map with each other."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1331.23,"end":1344.43,"speaker":"Fr Stephen De Young","text":"Right, yeah. And then you have Heidegger, for example, saying you could only do philosophy in Greek and German, so all of the languages unsuitable."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1344.67,"end":1399.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. And, and I, and, and you know, some might raise the request for clarification. Again, we're not going to call it an Objection. That, you know, why not just understand this language, for instance, in the Bible as being a metaphor. Right. But here's why. Because the Bible itself does not treat it as metaphor. It doesn't say, for instance, when it talks about God's eyes, it doesn't say as if God had eyes. You know, it doesn't say, it doesn't put it in metaphorical language. It just simply means this is God's power of sight. So if we understand it in terms of powers, then we don't have to treat it like it's a metaphor and it actually makes way more sense, it's way more consistent, you know, and, and, and actually then has a real depth and richness of meaning within it. As we're going to see, for instance, when we talk about the phrase the body of Christ a little bit later. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1399.01,"end":1406.02,"speaker":"Fr Stephen De Young","text":"There's, there's an analogical sense. Right. There's a sense in which, which it's an analogy. Right. Because God doesn't see things the way I see things."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1406.34,"end":1406.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1406.82,"end":1423.54,"speaker":"Fr Stephen De Young","text":"Or even the way a mantis shrimp sees things. Right. There's a, there's a qualitative difference in addition to a quantitative difference, but it is also a true statement. And this is the problem with saying it's just a metaphor is if it's just a metaphor that it's not really a true statement."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1424.1,"end":1428.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's just something that, just something that stands for something else."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1428.5,"end":1440.98,"speaker":"Fr Stephen De Young","text":"Right. It's, it's, you're just equivocating. Right. And, and so we can have, particularly through Christ, actual knowledge of God."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1441.14,"end":1441.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1441.62,"end":1463.69,"speaker":"Fr Stephen De Young","text":"And so you don't want to say, well, this is just, this is just analogy. But so yes, when it talks about the eyes of God, you know, the eyes of God roam the earth looking for. Right. That there is a metaphorical element there. Right, right. In that it's not talking about God with physical eyes actually looking around, trying to find something. Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1463.69,"end":1464.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1464.05,"end":1476.49,"speaker":"Fr Stephen De Young","text":"So there is a metaphorical element, but there is also a non metaphorical element that God does indeed possess the power of sight. There is nothing that God is not aware of that God does not see. Right. In that sense."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1476.49,"end":1505.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. Exactly. Yeah. So, okay, so these are kind of recaps and clarifications from some of the things we talked about in our, our episodes on bodies. So let's head to the Mountain of God and Boat of Theseus episode where we started talking about sacred geography. And we're going to talk now again. Recap. What does it mean for a thing to be a thing and what does that have to do with the material world? Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1505.36,"end":1514.6,"speaker":"Fr Stephen De Young","text":"And I was, of course, being meta by changing ship to boat and changing one element and asking if it was the same thought experiment. Yeah, but."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1515,"end":1521.72,"speaker":"Fr Andrew Stephen Damick","text":"And all. And all the homeschooled children out there who recognize that reference are all pumping their fists and their parents are smiling broadly."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1524.28,"end":1544.61,"speaker":"Fr Stephen De Young","text":"But. Yeah. So the whole idea of the ship of Theseus, remember, is that, you know, this thought experiment that Greek philosophers were always using, you know, Theseus's boat is on display. Over time, the wood rots and they replace each board as it rots away. Eventually they've replaced everything as it sticks still. Theseus's boat."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1545.01,"end":1545.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1545.81,"end":1587.55,"speaker":"Fr Stephen De Young","text":"Or is it now? No longer. And if you took all. And then secondarily, if you went and took all the parts, all the rotted wood that had brought off that and reassembled it into a boat, would that be the real one? Right. And so all of that was getting at the idea that as much as it seems common sense to us and to Parmenides, that matter is not what identity is about. Right. So it seems common sense to us that. Right. None of us wakes up in the morning and walks out into our house and thinks, what if someone broke into my house last night and replaced everything with exact duplicates?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1589.39,"end":1590.51,"speaker":"Fr Andrew Stephen Damick","text":"Something's not right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1593.15,"end":1599.98,"speaker":"Fr Stephen De Young","text":"We don't think that. Right. David Hume said, you have no good reason to not think that. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1599.98,"end":1606.3,"speaker":"Fr Andrew Stephen Damick","text":"But it seems like a lot of work on someone's part to do that. That would be my good reason."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1606.38,"end":1608.3,"speaker":"Fr Stephen De Young","text":"Yeah. To imagine that that's a possibility."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1608.46,"end":1613.98,"speaker":"Fr Andrew Stephen Damick","text":"But the argument from laziness, if they're going to break into my house, that's not the thing they're going to do."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1614.54,"end":1651.12,"speaker":"Fr Stephen De Young","text":"But, you know, I'm drinking coffee out of my mug even though I took my eyes off of it several times today. I assume it's the same mug. And if you asked me why is it the same mug, I'd say, well, it's. It's the same physical object that I was drinking coffee out of earlier or yesterday or a week ago. And. But the truth is that we now know scientifically, Right. Science has sort of thrown this wrinkle into the. The ship of Theseus, and that's that we know, for example, the human body, all of the matter that makes it up changes out about every seven years."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1652.4,"end":1652.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1654.88,"end":1662.8,"speaker":"Fr Stephen De Young","text":"None of the matter that currently composes my body was part of my body 12 years ago @ all."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1662.8,"end":1663.92,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1664.32,"end":1677.16,"speaker":"Fr Stephen De Young","text":"But everyone would say I'm still the same person. Right. That wouldn't be a Valid defense in court. If I got caught for a crime I committed 12 years ago to say I'm not the person I was then, literally."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1677.16,"end":1689.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Or if you were the vi. Or if you were the victim of a crime and there's not a statute of limit, you know, statute of limitations does not run out after all the matter trades out like, well, your honor, the victim doesn't exist anymore."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1690.54,"end":1694.94,"speaker":"Fr Stephen De Young","text":"Right. Yeah. I did not hit any of that matter with my car."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1695.9,"end":1696.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1696.26,"end":1698.06,"speaker":"Fr Stephen De Young","text":"And it was not the same car."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1699.18,"end":1708.71,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it gets even more complex when we like. Okay, so seven years ago I looked. Yeah. Basically the same as I do now."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1709.91,"end":1711.83,"speaker":"Fr Stephen De Young","text":"You know, but you're flattering yourself."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1711.99,"end":1713.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, thank you very much."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1713.03,"end":1714.07,"speaker":"Fr Stephen De Young","text":"Just a little. Just."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1714.15,"end":1785.69,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I think there's a little bit more of me now than there was then, but basically the same. Basically the same. But, you know, 30 years ago I looked radically different than I do now. And yet we would still absolutely consider that to be the same person. Right? Still the same person. And. And you know, we. We even recognize that the, the people in our families are still the same people. Like, it's interesting, there is this kind of metaphysical sensibility baked into the way that we interact with matter. Right. We don't tend to think day to day, oh, there goes another molecule. Oh, there goes another one. That man. This, oh, this process is going to take seven years now. I feel totally new. You know, we, like, we don't function that way. We just. We function as though this is truly me, that's truly you. This is truly the table I'm sitting in front of. You know, all these things are indeed the things that they are, and it would be madness to function as though that were not true. Like, it just simply. It's. No one could live that way. It's. It's impossible. And we have good reason not to live that way, you know?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1786.57,"end":1789.93,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Every three and a half years, you're half the man you used to be."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1791.77,"end":1798.97,"speaker":"Fr Andrew Stephen Damick","text":"Technically, I thought it was. I thought, I was told this happened. Suddenly I'm not half the man I used to be. But no, it's once every three and a half years."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1801.61,"end":1842.29,"speaker":"Fr Stephen De Young","text":"Right. And so that means we have to look for the identity of a thing in another place. As we talked about, what makes a thing what it is has to be something other than just the matter that composes it. And so at any given time, there is a certain quantity of matter that is being a certain thing. Right. So right now there is. And I don't really know how kilograms work, so I Don't know exactly how much mass of matter, but it's a lot that's making up my body."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1844.17,"end":1844.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1844.81,"end":1857.97,"speaker":"Fr Stephen De Young","text":"But. And as we said, it's not the same matter that. That was doing it, you know, seven years ago. But that is right now is being my body, my physical body, my material."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1857.97,"end":1863.37,"speaker":"Fr Andrew Stephen Damick","text":"I prefer to measure myself with stone because there's a lot fewer of them by comparison."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1863.77,"end":1865.41,"speaker":"Fr Stephen De Young","text":"But that's weight, not mass."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1865.41,"end":1867.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's true. That's true. That's right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1867.13,"end":1872.9,"speaker":"Fr Stephen De Young","text":"So need to be precise here. We don't want. We don't want physicists actualing us after."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1873.94,"end":1876.06,"speaker":"Fr Andrew Stephen Damick","text":"Do we have a lot of physicists in the audience? Write in."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1876.06,"end":1884.06,"speaker":"Fr Stephen De Young","text":"Everybody want to hear from you if you're a physicist. Actually, us at Lord of Spirits, Ancient faith."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1884.06,"end":1885.06,"speaker":"Fr Andrew Stephen Damick","text":"Dot com. Here we go."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1886.9,"end":1887.3,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1887.38,"end":1888.22,"speaker":"Fr Andrew Stephen Damick","text":"So. But."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1888.22,"end":1903.99,"speaker":"Fr Stephen De Young","text":"And that's true for me and for my heathen dogs and for the windowpane and the lamp post and. Right. And everything else. Right. There's matter that's being those things, and it's not the same matter all the time."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1904.47,"end":1905.11,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1905.59,"end":1917.99,"speaker":"Fr Stephen De Young","text":"It's shifting around. And so we talked about, in the previous episode, we talked about how is. Or being is actually an active verb that it's. It's doing something. It's actively being."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1917.99,"end":1923.44,"speaker":"Fr Andrew Stephen Damick","text":"That thing can be being. Right. Matter is being a thing. Right. Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1924,"end":1969.34,"speaker":"Fr Stephen De Young","text":"And so. And here's. This is a. We're gonna have some great T shirt phrases coming up tonight. Here's one of them. So some matter is being a body of a noetic being right now. And in this case, me or you or any of our listeners. Right. Because as we talked about the last couple episodes, angels and humans are noetic beings. Angels are noetic beings that do not have material bodies. So noetic beings with material bodies are humans. And so some of that matter is being the body of a noetic being."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1970.46,"end":1998.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. And you know, occasionally people request clarification and say, aren't the angels the bodiless hosts? But when we call them bodiless, what we mean by that is that they don't have material bodies. We're not saying that they don't have powers and potentialities, because they clearly do. And they are circumscribed, meaning that there's a space where they are and then there's a space where they're not, because they're not omnipresent, only God."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":1999.86,"end":2000.98,"speaker":"Fr Stephen De Young","text":"Vast cosmic."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2000.98,"end":2001.86,"speaker":"Fr Andrew Stephen Damick","text":"Cosmic influence."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2001.86,"end":2002.34,"speaker":"Fr Stephen De Young","text":"That's right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2002.73,"end":2005.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Vast cover a lot of acreage."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2006.73,"end":2008.09,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2008.57,"end":2011.29,"speaker":"Fr Andrew Stephen Damick","text":"And parsecs, as it were."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2012.25,"end":2017.69,"speaker":"Fr Stephen De Young","text":"And so what. What this Kelly Cams Yeah. So this."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2020.89,"end":2022.81,"speaker":"Fr Andrew Stephen Damick","text":"How many calciums? The Kessel run."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2023.21,"end":2023.69,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2024.25,"end":2025.77,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2025.77,"end":2027.45,"speaker":"Fr Stephen De Young","text":"You have transgressed, sir."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2027.53,"end":2029.7,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. So."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2032.18,"end":2051.78,"speaker":"Fr Stephen De Young","text":"In the case of the human material body, to sort of boil this down and lead in a little into what we're going to talk about next, the, the, the human material body is basically a material pile, a pile of matter being used as an instrument of consciousness within time and space."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2054.35,"end":2055.71,"speaker":"Fr Andrew Stephen Damick","text":"Very, very sci fi."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2057.23,"end":2071.63,"speaker":"Fr Stephen De Young","text":"So our noose, our conscious, that point of attention we were talking about the last two episodes is making use of this pile of matter that's currently making up my body as an instrument to interact within time and space, within the material creation."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2072.11,"end":2072.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2072.75,"end":2076.91,"speaker":"Fr Stephen De Young","text":"And it interacts both ways. Incoming through the senses and outgoing."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2077.55,"end":2093.18,"speaker":"Fr Andrew Stephen Damick","text":"I think one of the places probably people might get tripped up is like when you use the word instrument, you know, sometimes you might think of those mech suits, right, from Voltron and what was the."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2093.34,"end":2094.14,"speaker":"Fr Stephen De Young","text":"Robotech."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2094.22,"end":2126.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Robotech. Robotech, that's right. We are children of the 80s Macross saga, man. Yes, exactly, exactly. You know, people might think about it in those terms like, oh, there's, you know, I'm inside, you know, go full Cartesian, right? I'm inside this, I'm making use of this, the suit or whatever. But, but that's. So it's not quite that your body is you, right? It is you. It's not, it's not a suit. Right. Oh, I think we're getting the Mexican."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2126.29,"end":2129.09,"speaker":"Fr Stephen De Young","text":"Mexican radio. Hey, this is a good sign."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2129.09,"end":2135.01,"speaker":"Fr Andrew Stephen Damick","text":"I always take, I always take this as a blessing. There it is. Yes. It's been a while since we had Mexican radio on."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2137.47,"end":2141.59,"speaker":"Fr Stephen De Young","text":"Wall Ahoy. That's great, right? Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2141.59,"end":2141.95,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2142.03,"end":2152.11,"speaker":"Fr Stephen De Young","text":"So what a human is. Right. In the ancient, especially the ancient Israelite conception, the biblical Old Testament conception, a human is an animated body, an insouled body."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2152.43,"end":2154.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. A body with life in it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2154.59,"end":2161.15,"speaker":"Fr Stephen De Young","text":"Right. If you don't have a noose, it's not a human. If you don't have a material body, it's not a human."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2161.71,"end":2162.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2162.11,"end":2165.95,"speaker":"Fr Stephen De Young","text":"This is why we say physical death is unnatural, Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2165.95,"end":2167.47,"speaker":"Fr Andrew Stephen Damick","text":"Because it splits those things apart."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2167.63,"end":2174.91,"speaker":"Fr Stephen De Young","text":"Right. Because it rips those things apart and that's why the body then crumbles to dust, right? Normally."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2176.19,"end":2178.03,"speaker":"Fr Andrew Stephen Damick","text":"Normally, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2179.95,"end":2184.03,"speaker":"Fr Stephen De Young","text":"Right. So that's an unnatural thing that has to be repaired and restored."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2184.59,"end":2209.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. And really important for setting things up. We're going to go to break in just a second here. Is that that body is your body, like it truly is yours. Even, even at the point of. And after the point of physical death, it doesn't stop being your body. It's still your body. It's this Cartesian."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2209.26,"end":2210.62,"speaker":"Fr Stephen De Young","text":"It doesn't stop being you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2211.02,"end":2211.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2211.78,"end":2218.14,"speaker":"Fr Stephen De Young","text":"Your body makes it sound like a possession, a thing you have that belongs to you. It's you. It doesn't stop being you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2218.48,"end":2230.96,"speaker":"Fr Andrew Stephen Damick","text":"It's not. Yeah, it is being you. Right. Right. That's a key, key concept for everything they're about to discuss. Okay. Well, we're going to come back just after a break and we'll start taking your calls. So we'll be right back."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2231.52,"end":2247.77,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2253.13,"end":2311.96,"speaker":"Announcer","text":"No end of books these days offer us techniques for self improvement. But in the newest release from the Ancient Faith store Gratitude in Life's Trenches, Robin Phillips takes a different tack. He shows us that God meets us where we are in the pain and heartache of the present moment. Instead of looking for a way to escape from hardship, we can cultivate an attitude of gratitude, peace and self acceptance that will transform our experience of suffering. Drawing on his own experiences and his work as a consultant in the behavioral health industry, as well as stories of saints and sufferers, teachings of the fathers, and recent discoveries in neuroscience, Phillips shows us that the journey to personal well being is one we can all travel, regardless of the hardships we may face. To find this book and others like it, you can go to store.ancientfaith.com again, that is store.ancientfaith.com."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2312.52,"end":2328.64,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23723. That's 855 AF radio."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2330.32,"end":2343.28,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. Voice of Steve. We're back now for the second half. Before we get to what we're about to talk about, we do have a caller. Michael is calling. He's right here in Pennsylvania. So Michael, are you there?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2344.32,"end":2346.24,"speaker":"Michael","text":"Yes, I am. How you doing, Fathers?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2346.32,"end":2348.64,"speaker":"Fr Andrew Stephen Damick","text":"Good. How are you, Michael? Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2349.68,"end":2350.64,"speaker":"Michael","text":"Thank you. Thank you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2351.28,"end":2353.36,"speaker":"Fr Andrew Stephen Damick","text":"So what is your question for us this evening?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2354.72,"end":2387.7,"speaker":"Michael","text":"Okay, so my question is regarding relics. So just how we believe that as orthodox Christians that grace can be in our bodies, in us, it's not just an abstract thing and we also believe it can be contained in objects. Does this also mean that an evil Essence or evil energy can also be contained in an object. And if that is the case, can that evil be expelled from that object or should it just be burned?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2389.94,"end":2467.9,"speaker":"Fr Andrew Stephen Damick","text":"It's a good question. And you know, the first thing that occurs to me is to think about a house blessing. So, you know, when we do a house bussing, the whole point is to, is to clean out the residue of sin. Right. And of course, you know, I'm sure you listened to our atonement, our Day of Atonement episode in which there's atonement made for the altar, for the tabernacle. Right. The whole space where the people of God are, you know, that sin actually leaves a mark, so to speak. It leaves a stain that needs to be cleaned out. Right. I mean, I wouldn't think of it in terms of like a talisman, but then I wouldn't think in terms of. I wouldn't think of that in terms of, you know, relics and crosses and so forth that way either. Right. Like, it's not like it's a kind of, you know, like, like a, an RPG magical item, you know, that's not how I would understand it at all. But, but yeah, I mean, my, my answer that was is that yes, absolutely. The physical, you know, the material world, even apart from human bodies, can be affected by sin and can, can have an evil stain within it. But I want to see what Father Stephen has to say about this."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2468.7,"end":2473.82,"speaker":"Fr Stephen De Young","text":"Yeah, I have a chalice plus one of smiting. I don't know if you're aware of it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2476.3,"end":2478.74,"speaker":"Fr Andrew Stephen Damick","text":"Well, my sensor has plus six fire damage, so."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2478.74,"end":2540.9,"speaker":"Fr Stephen De Young","text":"Yeah, mostly to carpets, I imagine. Yes, my experience says anything, but. Yeah, I would, I would also. Yeah, there's a tendency to start thinking of grace's stuff and we need to, to push back against that. That it's, it's, it's. The Latin and English languages tend to reify everything. They try to turn everything into a thing. And some things aren't a thing. They're not even a thing. And so we're going to talk more about that as we go on about, about the understanding of grace as the divine energies and this dynamic capacity. We're going to get into that later on tonight. But yeah, as Father Andrew was saying, there's a taint that's usually referred to in the Old Testament as curse that is on and in and taints sort of material created reality that's been used for sinful, wicked purposes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2541.54,"end":2541.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2542.58,"end":2574.84,"speaker":"Fr Stephen De Young","text":"And that curse is removed through blessings. Right. So not just house blessings, but blessing objects. When we bless water we're not making it magic vampire killing water. Although I understand it does kill vampires. More on vampires this October. Yes, but we're not making magic vampire killing water. It's. It's that we're. We're purifying the curse. It's a. Restoring the water to what water was created to be for, which is healing, replenishing, purifying, cleansing."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2575.12,"end":2575.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2576.4,"end":2590.16,"speaker":"Fr Stephen De Young","text":"And the same thing when we bless people and when we baptize people. So, so yeah, there is that kind of ontological taint. And, and as for the grace part, we'll be getting into that the rest of tonight's episode."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2590.4,"end":2590.88,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2591.04,"end":2592.08,"speaker":"Fr Stephen De Young","text":"So stay tuned."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2593.28,"end":2594.96,"speaker":"Fr Andrew Stephen Damick","text":"Does that answer your question, Michael?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2596,"end":2599.2,"speaker":"Michael","text":"Yes, it does. And I'm looking forward to that episode on vampires."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2599.68,"end":2602.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, you have to wait until October, though."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2602.49,"end":2603.61,"speaker":"Fr Stephen De Young","text":"Also werewolves."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2604.01,"end":2618.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yep, yep. Monsters. So totally, I think. Totally. All right, well, thank you very much, Michael. And we do have another call coming in and it's Sarah, who I think is somewhere near Chicago. So Sarah, are you there?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2621.61,"end":2623.37,"speaker":"Sarah","text":"Is that me? Sarah from Michigan?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2623.69,"end":2629.53,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, well, your phone number apparently says you're somewhere near Chicago, but you're the only Sarah we've got on the call board."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2630.15,"end":2632.11,"speaker":"Sarah","text":"Yeah, I grew up in the suburbs, so that's."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2632.11,"end":2632.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, my."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2632.71,"end":2633.75,"speaker":"Sarah","text":"Anyway, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2633.75,"end":2635.43,"speaker":"Fr Andrew Stephen Damick","text":"Your cell phone is from Chicago."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2635.99,"end":2642.71,"speaker":"Sarah","text":"Yes, my cell phone is. I have an unrelated question to tonight's topic, but something that was brought up a few episodes ago."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2643.27,"end":2643.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2645.83,"end":2685.24,"speaker":"Sarah","text":"So we were kind of talking a few weeks ago about women who are menstruating or men who have admissions not being part of like Holy Communion. And I was. That kind of got my brain percolating on why are young girls not allowed to serve as an alter girl? Like, if the Theotoko served in this way, why can't, you know, my orthodox daughter who is not menstruating yet? And then kind of a related field of, you know, in the conversation is why do young boys process around the holy table at their 40 day blessing, but girls are not taken past the iconic status at the 40 day blessing?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2685.56,"end":2686.6,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2687.08,"end":2689.56,"speaker":"Fr Stephen De Young","text":"So non controversial questions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2689.56,"end":2971.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Thanks, Sarah. So, okay, so I want, I want to take the second one because this is actually something I've researched. Yeah, it's shocking. So, so here's the thing. There is a variety of practices between different orthodox traditions on that point. Indeed, yes. Yes. A lot of people are not aware of that because, you know, most of us tend to go to one parish most of the time. And that's not something, when you do visit another parish, it may not be something you see happening at that other parish, Right. So most of us tend to be exposed to only one way of doing that. But the reality is that there are, I'm aware of at least three different versions of that. So there's one version in which at the 40 day prayers that no one is brought behind through, you know, into the economy, into the holy place, you know, neither boys nor girls. I'm also aware of the practice which you described, which is that boys only are brought back there and then brought around and then handed back to the mother. Right. But there is also a practice where both boys and girls are brought through the deacon's door, brought round behind the altar and then brought out the other deacon's door and brought back to the mother. And I guess that might surprise you that that is the case in some churches. If you were to look at, for instance, the most recent official service book from the Antiochian Orthodox Christian Archdiocese of North America that covers that, that is the practice that is indicated in that book. And there's a whole bunch of notes in the back about how that's not something that the people who put that book together made up. It is in fact a well attested historical practice, actually. And that it seems like the limitation of to only boys seems to be a somewhat later development. Now, all that being said, I am in no way laying down any kind of judgment or criticism on any particular version of that. Every priest, you, you should do what your bishop tells you to do. And if they're not doing what their bishop tells them to do, well, that's between them and their bishop and not my business. But so the question then is like, what's the point of bringing a person back there at that moment, right? Because a lot of times people have this sense of, okay, only boys are allowed to go back and some have this sense all males are allowed to go back there and no females may ever. Right? But clearly this historical practice of bringing baby girls and boys back there would seem to violate that kind of general idea, right? The point of bringing babies back there is that they are being offered to God. That's what's going on there. Some will say only boys can go back there because, well, someday they might be priests. And I, I understand the idea behind that argument, but the truth is that the vast majority of them will not. The vast majority of them will not. It does not make much sense to me and maybe once someone disagrees with me on that point, but it does not make much sense to me say, well, we'll bring them all back there in the hopes that one out of 10,000, whatever, will actually get ordained. And nothing in the prayers that are said, whatever version. Because again, there's multiple sets of prayers between different traditions. None of them say anything about the possibility of that person being ordained. It's all about offering this child to God, just as was done with the Lord Jesus on his 40th day. So that's, you know, that's my response to that. You know, I do the practice that my bishop gave me to do, and that is in the book that is officially promulgated by him, and that's what everyone should be doing. But there is some variety in that practice. I do not encourage you to go to your priest and say, I expect you to do this now, because I found out there's another way. You know, please don't do that. No one listening to this. Please don't do that. Don't do that. You know, I'm in favor of liturgical variety. I think it's okay. So, yeah, that's. Like I said, I looked this up. I actually wrote an article about it that is on my blog. It's a really interesting thing. And to me, what's really beautiful about it is whatever practice is being done, the point is to offer this child to God however it's being expressed. Right. And again, it's. It's an imitation of our Lord's being offered on his 40th day. So if that makes sense to you, then I'm going to kick the more controversial thing over to Father Stephen and let him cover that question."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2972.64,"end":2974.96,"speaker":"Fr Stephen De Young","text":"Yeah. So I can Grumpy old man all over it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2975.12,"end":2976.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":2977.76,"end":3011.29,"speaker":"Fr Stephen De Young","text":"So it's worth noting that the Theotokos went into the Holy of Holies, but she didn't go back there on the Day of Atonement and assist the High Priest. She wasn't sort of serving as a liturgical assistant. But, but. So, yeah. So first of all, the thing we need to break is this idea that an insane number of Orthodox people have that is that men are allowed behind the iconostasis and women aren't. Because that's not true."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3011.61,"end":3012.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3013.48,"end":3031.32,"speaker":"Fr Stephen De Young","text":"At all. Like, in any form. There's no element of that that is true. The. The actual rule is that no one is allowed behind the iconostasis unless they're there for a purpose for which they've been blessed by the Bishop."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3032.44,"end":3032.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3032.8,"end":3035.16,"speaker":"Sarah","text":"So I'm."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3035.16,"end":3059.36,"speaker":"Fr Stephen De Young","text":"I'm a priest. So as a priest, I am blessed by the bishop to go back there to celebrate services. I don't go back there and hang out and like, watch YouTube videos on my phone. Right. Like in the sanctuary. Right. It's not like a privilege that I have to go back there. I'm only to go back there when I'm preparing for or celebrating or cleaning up after one of the services."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3059.76,"end":3060.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3060.16,"end":3081.46,"speaker":"Fr Stephen De Young","text":"Of that I have been blessed to. To celebrate. If you go to a convention. Most convents, when they have a priest or a bishop come to do services, there are certain nuns, usually elderly, well established nuns, who are designated who will assist the priest behind the iconostasis."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3081.7,"end":3096.06,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. The other example, I would say the other example I like to give is that during the Byzantine imperial period, at least sometimes I know the empress would actually, as far I. I don't know if she went through the holy doors in the middle."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3096.06,"end":3096.38,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3096.38,"end":3107.2,"speaker":"Fr Andrew Stephen Damick","text":"But she certainly. Yes, she went right through the holy doors to go rece communion at the altar. At the altar. Just like the clergy. Well, maybe not just like, but pretty similar. Pretty similar."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3108.16,"end":3115.04,"speaker":"Fr Stephen De Young","text":"Right. So. So that's not the rule. The reason why we have altar boys in regular parish practice."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3115.2,"end":3115.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3115.84,"end":3198.55,"speaker":"Fr Stephen De Young","text":"As opposed to like in a. In a convent, there aren't other men around to assist or do clean or to do those things. So particular women are designated for that task by the bishop. Right. The reason we have altar boys in parish practice is that contrary to our. This is where I go. Grumpy old man. Our current modern practice is. Doesn't he look cute in his little Stakarian? Let's get a picture of him. Oh, look, he's carrying the big fan. Oh, so cute. Right. That's not why. Right. That's not why. And it's not even really just because the priest needs help. It's because for most of the history of the church, they didn't have seminaries and they didn't have diaconal courses by mail and late vocations programs. Right. They didn't have any of that. So the way people learned to become sub deacons and deacons and priests was by celebrating the services. And so the idea was that you're training the next generation of deacons and priests and sub deacons. Right. To serve at the altar. So I, being a grumpy old man, have been known to tell people that if you're one of those folks who by no means wants your child to be clergy, do not send them back to serve at altar."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3198.71,"end":3199.35,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3199.99,"end":3201.03,"speaker":"Fr Stephen De Young","text":"That's what it's for."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3202.95,"end":3207.27,"speaker":"Sarah","text":"Okay. That is really helpful."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3207.94,"end":3209.94,"speaker":"Fr Andrew Stephen Damick","text":"Yay. I love it when people make that sound."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3211.62,"end":3212.26,"speaker":"Fr Stephen De Young","text":"That's good."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3212.26,"end":3213.66,"speaker":"Sarah","text":"I have lots to think on now."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3213.66,"end":3214.14,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3214.14,"end":3217.94,"speaker":"Sarah","text":"So much for taking my very off topic question. I very much appreciate it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3218.9,"end":3224.5,"speaker":"Fr Andrew Stephen Damick","text":"Well, when I saw it, you know, when I saw it on the call board, I was like, okay, this is not on topic, but, you know, it's something I know something about."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3224.66,"end":3230.34,"speaker":"Fr Stephen De Young","text":"So here we go. And you're calling from what my people have long considered the promised land."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3230.74,"end":3231.38,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3231.7,"end":3234.3,"speaker":"Fr Stephen De Young","text":"So that being the state of Michigan."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3234.3,"end":3235.14,"speaker":"Sarah","text":"It'S a great place."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3235.3,"end":3236.18,"speaker":"Fr Stephen De Young","text":"And me being Dutch."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3240.22,"end":3244.22,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you, thank you. Thank you very much for calling in. Sarah, good to hear from you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3244.78,"end":3245.66,"speaker":"Sarah","text":"Yep, bye."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3246.06,"end":3250.46,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay, well, welcome to Act 2."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3251.1,"end":3251.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3251.58,"end":3252.66,"speaker":"Fr Andrew Stephen Damick","text":"And this."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3252.66,"end":3261.5,"speaker":"Fr Stephen De Young","text":"This being our relics episode later on, we will be discovering Montgomery Scott trapped in the transport buffer of a Dyson sphere."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3261.82,"end":3278.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I loved that episode with the. The. The green alcoholic beverage. They weren't sure what it was. Wow. Anyway, that takes me right back. So. Okay, so, all right. Another."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3278.76,"end":3295.91,"speaker":"Fr Stephen De Young","text":"Another little bit of. Isn't it sad? Just as an aside, isn't it sad that our generation, you know, previous generations, experienced nostalgia for rural life or for good times they had in high school with friends? We experience nostalgia for media content."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3296.31,"end":3300.55,"speaker":"Fr Andrew Stephen Damick","text":"I know, it's true. It's just the way it is. Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3300.79,"end":3305.59,"speaker":"Fr Stephen De Young","text":"Wither, Wither. Our generation and all subsequent."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3306.23,"end":3311.75,"speaker":"Fr Andrew Stephen Damick","text":"Hey, well, we built the Internet, so I mean, that's. I feel like that's a decent. A decent accomplishment."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3312.39,"end":3314.87,"speaker":"Fr Stephen De Young","text":"Yeah. Like the Tower of Babel. Exactly."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3314.87,"end":3345.33,"speaker":"Fr Andrew Stephen Damick","text":"Just like that. Yeah. Right. So, okay, so since this is the first part of this episode has been. Recap, recap, recap. We're going to do another little bit of recap and where we can talk now about the noose again. And you're gonna, you know, you're all gonna see how this all fits together very, very soon. Right, so the noose, it's the imaging capacity. Right. Sort of the retina of the soul. Can I say that? I. I guess maybe."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3345.33,"end":3348.93,"speaker":"Fr Stephen De Young","text":"Okay, yeah, I'll have to ponder on that one."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3349.01,"end":3352.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay. All right. I mean, that is a metaphor. I think that is a metaphor."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3353.01,"end":3354.93,"speaker":"Fr Stephen De Young","text":"You've transgressed and now you must atone."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3355.17,"end":3356.45,"speaker":"Fr Andrew Stephen Damick","text":"This time we've come too far."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3357.01,"end":3394.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But. So, yeah, the new. We talked about how the noose is not only sort of a sensory organ, but also is. Reflects this imaging capacity, this capacity to image God. And so as we were saying, you know, at the end of the last act, humanity is the noetic material being, both a noetic being and a material being. And therefore humanity bridges and potentially unites the entirety of the created order."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3395.13,"end":3396.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3396.13,"end":3411.78,"speaker":"Fr Stephen De Young","text":"Both the visible and invisible creations, or both the spiritual and physical creation and material creations, however you want to look at that or parcel that out. And so angelic beings are noetic, but they're not material."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3412.5,"end":3412.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3412.9,"end":3430.13,"speaker":"Fr Stephen De Young","text":"And animals are material, but they're not noetic beings. And we talked about those other intellectual capacities and other forms of reasoning that heathen dogs like mine have, for example, but they don't have a noose. They don't have that. That imaging capacity."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3431.08,"end":3432.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3433.32,"end":3433.72,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3434.36,"end":3442.44,"speaker":"Fr Andrew Stephen Damick","text":"That humans, they have retinas, but not the retina of the soul, as it were. I'm just gonna try. Try that idea on a few times."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3442.44,"end":3449.4,"speaker":"Fr Stephen De Young","text":"To see if it's just gonna. Yeah, you're just gonna keep selling it. No matter how hard you try. I don't think you're gonna make it a thing."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3449.56,"end":3451.24,"speaker":"Fr Andrew Stephen Damick","text":"No, it's like streets ahead."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3451.24,"end":3452.36,"speaker":"Fr Stephen De Young","text":"It's not gonna be a thing."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3452.36,"end":3458.67,"speaker":"Fr Andrew Stephen Damick","text":"It's not gonna be a. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3458.67,"end":3472.15,"speaker":"Fr Stephen De Young","text":"So what this means. What this imaging capacity means is that the human person as a whole can function as a material body for another spiritual being."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3473.83,"end":3476.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, another spiritual being."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3476.07,"end":3520.38,"speaker":"Fr Stephen De Young","text":"Right. Meaning. Meaning, or to try to help draw this out a little bit, we were just talking about how our physical material body is the material body for our noose. Right. That it is the way in which our noose interacts with material reality in time and space. Right, right. And so the human person as a whole can function in that way for another spiritual being because of the news. So, for example, the most obvious example of this that we've talked about a lot on the show is theosis."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3521.1,"end":3521.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. This."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3521.9,"end":3539.01,"speaker":"Fr Stephen De Young","text":"This imaging. Right. When we are imaging God in the creation, in the created order, we are serving as a body. Right. We're serving as this, as an image in the world for God."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3540.53,"end":3541.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3541.89,"end":3545.13,"speaker":"Fr Stephen De Young","text":"We talked about that when we talked about creation. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3545.13,"end":3565.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if a body is, again, the powers and. Or potentialities, then that means that when God's works are being done, the person, if it's a human being doing God's works, they are being the body of God, the body of Christ."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3565.58,"end":3569.18,"speaker":"Fr Stephen De Young","text":"Right. They're serving as an instrument in that way."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3569.34,"end":3574.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When you do the works of another spiritual being, you function as the body of that being."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3574.94,"end":3596.5,"speaker":"Fr Stephen De Young","text":"Right. And so the same is true on the flip side. And this is the, you know, the focus of the epic Giants episode. Right. On the other side, what we've called demonosis, which I tried to make a thing that. Yeah, it's not a thing yet. To me it sounds too much like halitosis."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3596.5,"end":3596.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3596.9,"end":3598.74,"speaker":"Fr Stephen De Young","text":"Maybe some Listerine could clear it up."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3600.02,"end":3602.66,"speaker":"Fr Andrew Stephen Damick","text":"But some Holy water or."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3602.66,"end":3609.3,"speaker":"Fr Stephen De Young","text":"Or demonization, which, as you pointed out to me, we usually used to refer to what we do to our political opponents."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3609.62,"end":3609.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3609.98,"end":3612.18,"speaker":"Fr Stephen De Young","text":"Calling them names and acting like they're Satan."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3613.39,"end":3628.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But, you know, there's this, you know, what's the opposite of a saint? Well, a giant is the opposite of a saint. But, you know, however you want to conceive of that, you can do the works of the devil. I mean, the scripture says this, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3630.75,"end":3655.4,"speaker":"Fr Stephen De Young","text":"We got to the end of that in our Giants episode, right. That what we're talking about, where we're talking about a nephilim or a giant is we're talking about a person who has completely gone down that path and become demonic themselves. And that's why there was this understanding, uniform understanding in the ancient Jewish world that after they died, their spirits were the demons that were going around possessing things."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3655.96,"end":3700.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And. And, you know, we. We've said that in the past, and we get occasional requests for clarification about that. And sometimes people like, that's. I. Church fathers don't say that, but we actually have a lovely quote from St. John Chrysostom and St. John Chrysostom in one of his discourses on the parable of the rich man and Lazarus. So this is discourse number two, because there's four of them. He comments on a kind of urban legend, right, that some people think that someone who dies a violent death becomes a demon, after which people."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3700.49,"end":3707.93,"speaker":"Fr Stephen De Young","text":"Which people still think today, right, there's, you know, oh, this person was murdered. So their ghost now haunts the place where they were killed."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3708.01,"end":3782.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. There's this. Yeah, yeah, yeah, exactly. So this is. This is what he said. So this is. This is the actual direct quote, quote. For it is a fact that many of the less instructed think that the souls of those who die a violent death become wandering spirits, that is to say, demons. But this is not so. I repeat, it is not so. For not the souls of those who die a violent death become demons, but rather the souls of those who live in sin. Not that their nature is changed, but that in their desires they imitate the evil nature of demons. Showing this very thing to the Jews, Christ said, ye are the children of the devil. That's John 7:44. He said that they were the children of the devil, not because they were changed into a nature like his, but because they performed actions like his. Wherefore also he had for the lusts of your father, ye will do. End quote. So that's Saint John. No less than Saint John Chrysostom. Explicitly saying, look, you don't become a demon after you die by experiencing a violent death. You become a demon after you die by acting like a demon. That's what he says."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3782.47,"end":3789.99,"speaker":"Fr Stephen De Young","text":"And just like theosis. It's not that. Just like in theosis, our human nature is not changed into the divine nature."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3790.23,"end":3790.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3790.59,"end":3800.24,"speaker":"Fr Stephen De Young","text":"You don't become, remain human. The Holy Trinity, they don't become fallen angels. Their human nature is not changed into the angelic nature, but it becomes like it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3800.88,"end":3802.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3802.8,"end":3804.4,"speaker":"Fr Stephen De Young","text":"And functions like it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3805.04,"end":3809.12,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep. Yeah. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3809.12,"end":3828.06,"speaker":"Fr Stephen De Young","text":"And so what this means is, is that from the perspective of the Scriptures, the works that we do, that the, the erga produced by our energia, the works produced by our energies, which are related words, Greek."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3828.22,"end":3828.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3828.54,"end":3858.93,"speaker":"Fr Stephen De Young","text":"The things we do are the actualization of spiritual energies. Right. So when, when we are, are doing quote unquote good works, we're. We're doing the works of God. When someone does evil works, they're not just choosing themselves to take a sinful action or making a mistake stake. Right. But they are actualizing the sin of the demonic powers."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3859.89,"end":3862.97,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep, yep."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3862.97,"end":3871.49,"speaker":"Fr Stephen De Young","text":"And so this is why there is not a separation between the idea of morality and the idea of spiritual warfare."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":3872.85,"end":4009.1,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's, it's, it's completely relevant to the way that you live your life. And I think that this is a really important pastoral point. We maybe have made it before, but let's make it again, that often when people are struggling to live as Christians and they find themselves falling into sin, they may conceive of that as simply being, well, I'm just a failure, there's something wrong with me. Or they may trivialize it, well, does God really care if I do that? You know, like, how big of a deal is that, really? Right. But if we understand correctly that when you do what is good, you are functioning as the body of Christ, and when you do what is evil, you are functioning as the body of the demonic powers, then that changes the whole game. It completely changes our understanding of what's going on. And that's why you see so many, for instance, of the ascetic fathers just trying to purge every kind of even minor sin from themselves. They don't make excuses for it. If they commit sins, they repent of them. Right. Because when you sin, then you're engaging in demonosis and certainly greater sins do that more than lesser ones, for sure. But you don't say, well, I'm just going to do all these little things. And that's not that big. Give it to you. Because the truth is, is that it does accumulate. And once you permit yourself a small vice, then you're likely to. To permit yourself an even bigger one. Because it was easy. You know, it wasn't that bad last time, and now it's gonna be a little bit easier to make it worse this time. Right? You know, it's. You're. You're literally, spiritually speaking, hanging around with the wrong crowd and you become like them. You become like them. So this is, this is a really, really critical concept. You're going to see how this connects with relics very soon, but we promise. Yeah. Well, you guys know that this is our deal, so. Right, right. Yeah. Human beings, human works as the actualization, as they say, of spiritual energies."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4009.5,"end":4113.45,"speaker":"Fr Stephen De Young","text":"And so. And we see this kind of approach all over the place in scripture, right? One that we've come back to several times and we'll probably end up doing an episode about, you see this with, with Adam and Cain, right? Where, you know, St. Paul says in Romans 5 that, you know, sin enters the world through Adam. But notice that language, right? Sin, Sin, not sins, not Adam. Sinned as a verb, as an action. But sin, this noun, enters the world through Adam. And that's commensurate with the way sin is talked about in Genesis 4, where God comes to Cain and says, sin is crouching at your door and wants to master you. It's sort of this power in the world that is unleashed, right? And it ends up mastering Cain and it gets Cain to do his, to do its works, right? And this gets, gets brought out other places. This is our first Enoch quote for this evening. 1st Enoch 108 says, the whole earth has been corrupted through the works that were taught by Azazel to him. Ascribe all sin, right? And this is reflecting that same idea, right? That it's, it's the works of Azazel that are being done by these people and they're corrupting the created order. Right? And that's what's going to now necessitate, now necessitate the flood, that he's the one motivating it, even though the people are doing it. And this is related to the understanding of atonement that we talked about in that episode, that the, the goat for Azazel, the sins are sent back to him because he's where they came from."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4113.85,"end":4165.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And, and the same kind of idea is in scripture too. Like we're not just, we're not just quote unquote getting this from Enoch, right? So first John, there's multiple places. So first John 5:19. We know that we are from God, and the whole world lies in the power of the evil one. There's that sense of that demonic influence everywhere. First John 3. 8. Whoever makes a practice of sinning is of the devil, for the devil has been sinning from the beginning. The reason the son of God appeared was to destroy the works of the devil. So there you go again. You do the works of the devil and you're becoming like him. You're a sinner. First John 3:12. We should not be like Cain, who was of the evil one and murdered his brother. And why did he murder him? Because his own deeds were evil and his brother's righteous."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4167.78,"end":4173.7,"speaker":"Fr Stephen De Young","text":"Right. And so you see, Cain's deeds are evil is a function of him being of the evil one."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4174.29,"end":4174.61,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4174.77,"end":4177.73,"speaker":"Fr Stephen De Young","text":"And Abel's were a function of him being of God."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4178.05,"end":4207.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Adam releases sin into the world. And we sometimes get this request for clarification. You know, did Adam sin? Yes, Adam did sin. But the word sin is not used to describe what Adam did. It's a transgression. The word sin is used to talk about Cain being overpowered. You know, what Adam releases into the world then leaps on his son, basically, and. And overpowers him. And because Cain doesn't master himself, he's mastered by sin."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4208.72,"end":4279.86,"speaker":"Fr Stephen De Young","text":"Right. And so this is, this is another thing that sort of cuts to most of the debates in the Western theological world which want to talk about and argue about and split the church and kill a third of the population of Europe in the 30 years war over whether human works, human deeds are meritorious. And that whole meritorious concept is kind of irrelevant. That whole merit concept is kind of irrelevant. Right. Because if we understand human works to be participating in cooperating with actualizing these spiritual energies, then anything that can be called a good work that a human does is really them participating in and being the instrument of grace, of the divine energies of God working in the world. Right. They're the hammer he uses to drive the nail. The hammer can't ascribe merit to itself. Right. Like the carpenter doesn't reward his hammer for having done a good job."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4280.61,"end":4296.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. And some, you know, and some of our. Some of our reformed friends would say things like, you know, a human person cannot add anything to his salvation. Right. They'll say that kind of thing. It's like, well, any good thing that a human person does is God doing it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4297.41,"end":4303.81,"speaker":"Fr Stephen De Young","text":"Right. You know, and that assumes your salvation is like a pile of stuff. That's what you can't."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4305.09,"end":4305.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4306.12,"end":4314.84,"speaker":"Fr Stephen De Young","text":"This is that that's not what salvation is. Right. So the reason God can look at a work and call it good is because it's his work."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4315.16,"end":4315.96,"speaker":"Fr Andrew Stephen Damick","text":"It's his work."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4316.2,"end":4321.16,"speaker":"Fr Stephen De Young","text":"Just like at the end of each day of creation in Genesis 1, he looks at it and he says, it is good."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4322.68,"end":4328.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Every good comes from God. Every good comes from. There is no independent good. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4329.24,"end":4336.64,"speaker":"Fr Stephen De Young","text":"And so the alternative for humans is, rather than participating in the divine energies, is to participate in the passions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4337.04,"end":4337.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4337.76,"end":4346.08,"speaker":"Fr Stephen De Young","text":"To bring to fruition the works of the evil one, the works of the demons. So quote our friend Bob Dylan, you got to serve somebody."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4346.24,"end":4348.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4348.24,"end":4354.96,"speaker":"Fr Stephen De Young","text":"You're going to have a master. It's not just that, as Christ said, no man can serve two masters, but every man serves at least one."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4355.52,"end":4356.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4356.88,"end":4364.75,"speaker":"Fr Stephen De Young","text":"And, and so you can choose. You have to choose this day whom you will serve. You don't get to be an independent contractor."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4364.75,"end":4439.1,"speaker":"Fr Andrew Stephen Damick","text":"And, and, and whoever's works you engage in, you become like that one, you know, so you are, or you are becoming what you do. The things you do are who you, you know, make you what you are. Right. You know, I mean, think, just think. Just think from your own experience, people, right? When you, you know, for instance, when you. In one of the fasts and you go to church a lot more often, you're praying a lot more often, you become much more engaged in the life of prayer. Right. It alters your sensibility. You see things differently, you function differently. But then, like, say, you pick up a habitual sin, it starts to drag you down, and you have this clear sense that you're a different kind of person. And repentance is. You pull yourself up out of that and then go back and do the works of God. It changes who you are. It's not separate from who you are, but it's also not isolated. The things that you do. You are participating in God or you are participating in the works of the devil. There's no neutral ground. There's no neutral ground."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4439.66,"end":4451.36,"speaker":"Fr Stephen De Young","text":"And this undercuts the whole pathology of Western Christian culture, which includes people who aren't Christians, who were brought up in the culture. And that is guilt."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4452.16,"end":4452.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4452.88,"end":4459.28,"speaker":"Fr Stephen De Young","text":"The entire obsession with the concept of guilt, is this a sin or not?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4459.92,"end":4460.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4460.4,"end":4489.04,"speaker":"Fr Stephen De Young","text":"Am I guilty of something or not? Who's to blame? Who's responsible? This happens even in our Orthodox churches. There's a problem. And people will spend hours and hours and hours arguing about whose fault it is, is. And it's definitely not mine. It's definitely this other person's. Right. It's their fault and argue about whose fault it is and who's to blame for what and spend approximately zero hours working on fixing it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4491.12,"end":4491.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4491.48,"end":4509.63,"speaker":"Fr Stephen De Young","text":"And so repentance is not deciding who's guilty of what and how that guilt can be absolved. Repentance is fixing the damage, fixing the problem, healing the wounds, repairing the situation. That's what repentance is."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4509.87,"end":4510.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4510.67,"end":4516.91,"speaker":"Fr Stephen De Young","text":"Because if you. It's not a question. There is no question as to whether something was a sin for you."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4517.47,"end":4517.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4517.79,"end":4521.07,"speaker":"Fr Stephen De Young","text":"It either drew you closer to God or it drew you farther away."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4522.11,"end":4522.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4522.43,"end":4535.29,"speaker":"Fr Stephen De Young","text":"It either made you more like Christ or less like Christ. And so it doesn't matter if it's on some list of sins or if you can find a Bible verse to quote saying it's bad or okay, none of that matters."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4535.85,"end":4536.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4536.17,"end":4539.77,"speaker":"Fr Stephen De Young","text":"And this is what St. Paul is always trying to get at when he talks about the conscience."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4539.93,"end":4540.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4540.41,"end":4553.61,"speaker":"Fr Stephen De Young","text":"Something can be a sin for one person and not for another person. Right. Based on what it does. And if it does that, if it pulls you away from Christ even a little, that has to be fixed."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4554.17,"end":4554.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4554.57,"end":4559.73,"speaker":"Fr Stephen De Young","text":"You have to return to Christ and draw close to him again. And continue to draw closer to him."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4560.36,"end":4654.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, you know, to. To connect this with some of our other themes. You know, the, the idea that another spiritual being can make use of a human person as their body. I'm sure when, when we said that initially, people like, oh, is that what demon possession is? And the answer is, yes, that is what demon possession is. But it's also a literal sense. Yes, yes, yeah, yeah, exactly. But it's also what idolatry is. Right? Now, idolatry works with a kind of, you know, two factor authentication, as it were, where the demon is making use of the image, the stone or metal or wood, you know, idol. And through that, through that, the interaction of human beings with that thing, then they do the works of that demon. Right. But nonetheless, it still is functioning as a body for the demon. And then those people become further extensions of that body. Right. The idol becomes a kind of conduit to get people to do the works of that demon. But yeah, I mean, you know, demon possession is a thing both in the sense of a demon getting control of a human person in a sort of very direct and horrifying way. But also, you know, when people do the works of a demon, they are, in a sense, demon possessed. They're at the very least, they're kind of embodying the demon, you know, with this understanding of what a body is. Right. And the good news is it works the opposite way too, that we can. We can be the body of Christ also."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4655.19,"end":4728.78,"speaker":"Fr Stephen De Young","text":"Right. And the reason for this, again, remember, the goal of the demonic powers is to destroy humanity. And humanity has. We have material bodies, we have materiality, which they lack. Right, right. And that materiality means that we can be shaped, we can change. We don't just have powers. We also have potentialities that can come to fruition or fail to come to fruition that could be stunted or that can blossom. Right. And so this is why. One of the most common questions we get, why can humans repent and angels can't? This is why. Right. This is why. Saint John of Damascus says that it's our materiality that allows to us. Us to repent because we have this malleability, right. This ability to bring these things into the created order in a way that. That the demonic powers do not. And so even in those rare cases, right, you can find here and there these sort of stories. And as we've said before, you never base theology on sort of one anecdotal story from the Desert Fathers and say, okay, therefore we have to rewrite our whole theology because of this one story."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4728.94,"end":4741.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's these stories of angels somehow repenting, like that's. It shows up once in a while, but. But it always happens with some kind of human agency."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4742.22,"end":4749.5,"speaker":"Fr Stephen De Young","text":"Right. There's a human person involved with whom or through whom that angelic repentance takes place."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4750.95,"end":4751.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4751.19,"end":4783.75,"speaker":"Fr Stephen De Young","text":"And so even in these sort of minority reports where there is some demon that repents, it is by way of a human. And you see the same thing with. When you hear stories about the departed who are in Hades finding salvation, it's through some living human with a material body praying for them and repenting for it. And with them, that materiality is the vehicle through which that. That malleability and transformation is possible."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4784.15,"end":4809.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And that's why when you're the material element of what you are, of who you are, what you are, whatever is separated from the immaterial at death, you can't repent after that because you don't have that potentiality anymore, you know? Yeah, right. Yep, yep. So. Yeah, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4809.05,"end":4812.17,"speaker":"Fr Stephen De Young","text":"And so all this has been at sort of the individual level."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4812.97,"end":4813.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4813.37,"end":4826.41,"speaker":"Fr Stephen De Young","text":"Of individual imaging. But of course, the other big way this whole construct and idea is. Is used in scripture is corporately. Right. Pun intended."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4829.46,"end":4829.7,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4830.18,"end":4843.34,"speaker":"Fr Stephen De Young","text":"To refer to the body of Christ as in the church, as in the community. Right. At the community level, the entire church community serving as the body of Christ. And this in multiple senses, right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4843.34,"end":4844.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah, yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4844.98,"end":4933.95,"speaker":"Fr Stephen De Young","text":"So the, the, the. The persons who make up the community. Right. When St. Paul gets into that relationship, he talks about members of the body of Christ. Christ. And we think of members either as jackets with weird snap tabs on the shoulders or we think of like being the member of a club or both. Porque no los dos. But this is members as in parts, as in body parts. And he further defines that St. Paul talks about eyes and hands and ears. Right. And so members, meaning each of us is a part of the body, and they all function together to serve as this instrument. And so there are two primary ways that St. Paul uses that argument and other New Testament writers. One is that as the body of Christ, we are the way in which Christ comes to the world. The church is. Right. So salvation comes into the world through the church. Christ works through the church. The, the. When people experience, when people outside the church experience Christ's love, it should be. Not that Christ can't do it directly when we're messing up, but it should be an actual Christian loving them."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4936.05,"end":4936.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4936.53,"end":4952.77,"speaker":"Fr Stephen De Young","text":"It should be the hands of a Christian giving them things to help them with their needs. Right. And again, there's that instrumentality. It's not you doing a good deed by giving a warm coat to a homeless person."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4953.57,"end":4953.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4953.97,"end":4966.7,"speaker":"Fr Stephen De Young","text":"It is Christ clothing this person through you as instrument, through you as his body in the world. And you've got some references related."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":4966.86,"end":5052.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Yeah, we've got some good Bible verses. So, okay, so 1st John 4:17, by this is love perfected with us so that we may have confidence for the day of judgment. Because as he is, so also are we in this world. Right. Similar idea is in Ephesians chapter 1, verses 22 and 23. And he put all things under his feet and gave him as head over all things to the church, which is his body. The fullness of him who fills all in all the church is the fullness of Christ. And then I love this really cool expression from St. Augustine who describes the church as the whole Christian head and body. And that's from his on the Epistle of John. Yeah. This close identification of Christ and the Church is made very clear in Scripture and certainly the church fathers. And it's in terms of that the Church does the works of Christ, that we are the presence of Christ in this world. And of course, I mean, someone might object to that and say, well, what about bad clergy or bad Christians? Again, if you're doing bad things, you're not being the body of Christ, you're being the body of another spirit. Right, Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5052.76,"end":5065.53,"speaker":"Fr Stephen De Young","text":"And so then the other major sense in which we talk about the church as the body of Christ is that the church as a community is animated by Christ's spirit."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5066.64,"end":5066.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5066.96,"end":5078.24,"speaker":"Fr Stephen De Young","text":"Because a human body. Right. A human right. And human body in the sense we've been talking about body, the fuller sense is a material body that's animated by a spirit."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5079.44,"end":5080.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5080.04,"end":5090.8,"speaker":"Fr Stephen De Young","text":"And so in the same way, because again, corporately, I'm gonna keep punning it up, we're animated by the Holy Spirit, by Christ's Spirit."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5090.8,"end":5091.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5091.16,"end":5151.86,"speaker":"Fr Stephen De Young","text":"That makes us the body of Christ. And so from an orthodox perspective, when we talk about holy tradition, we're not talking about a bunch of secrets whispered via telephone game from the apostles to their successors of some additional stuff that's not written down in the Bible, some Gnostic secrets we possess that. That no one else does. We're talking about the internal life of the church, which is the Holy Spirit. Just as we. Right. Have an internal life, not just an external life. So also the church is. The body of Christ, has an internal life, the life of the Holy Spirit within the church. And that internal life through time and space. Right. You could look at it diachronically or synchronically. You could look at it through history, or you could look at it across the. The church at any given point in time. That is what holy tradition is from an orthodox perspective."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5152.18,"end":5152.66,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5153.94,"end":5160.98,"speaker":"Fr Stephen De Young","text":"And that's what we protect and preserve and cherish the same way we project and preserve and cherish our own inner lives as people."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5161.78,"end":5212.48,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. To me, that's a profound. A profound observation that the notion of the church as being the body of Christ and the notion that holy tradition being the life of the Holy Spirit in the church, that these are really essentially two different ways of saying the same thing. Right. Just two different angles of looking at it. It's always beautiful and astonishing to me when concepts that seem like, okay, I have a list of concepts that I need to make sure I understand things. These things when they merge and show that it's really the same one thing. It's beautiful. It's beautiful. All right. Well, with that said, we're going to take another break and we'll be back in just a minute for the third half of our show."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5213.28,"end":5230.73,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 885-5237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5231.61,"end":5274.18,"speaker":"Announcer","text":"St. Ignatius, first century bishop of Antioch, called the God bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God. Fr. Andrew Damoch recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he martyrdom, salvation in Christ, the bishop, the unity of the church and the Eucharist."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5274.73,"end":5287.65,"speaker":"Michael","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense, which that can be challenging for us because, number one, he doesn't seem to have any reticence at all about going to martyrdom. Like, there's no sense of, well, this."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5287.65,"end":5290.25,"speaker":"Fr Stephen De Young","text":"Is what I have to do, you know, I wish I didn't have to."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5290.25,"end":5294.65,"speaker":"Michael","text":"But this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5294.89,"end":5306.11,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5306.11,"end":5321.11,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5323.27,"end":5355.17,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. It's the third half of the show. I just want to say I know we've been seeing some reports out there that some people are having some difficulty with streaming. There have been some technical issues. If you're hearing me, say this, please, if you missed part of the show at all, make sure you tune in tomorrow morning for the recording. We do have a podcast. This is a podcast. You can listen to it recorded and it is all being recorded, thank God. And you'll be able to hear it all tomorrow. So our apologies for any, any technical difficulties that we've been having."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5356.13,"end":5358.85,"speaker":"Fr Stephen De Young","text":"I hope you guys will be Mexican radio."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5359.09,"end":5360.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say I hope."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5360.17,"end":5361.41,"speaker":"Fr Stephen De Young","text":"Every, I hope everybody."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5361.57,"end":5372.05,"speaker":"Fr Andrew Stephen Damick","text":"I hope everybody. Yeah, I hope everybody caught the Mexican radio. If not, it will be on the recording. So. All right. Well, it's the third half of the show and here we are going to talk about relics. Now."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5374.45,"end":5378.67,"speaker":"Fr Stephen De Young","text":"It really, it wouldn't be Lord of Spirits without at least a few technical, technical difficulties here."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5378.83,"end":5395.39,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. I mean, we were concerned earlier. I mean, you were talking to me yesterday, like last night your power was out because there were storms going on because it's storm Season in Louisiana. But thank God. It seems like nothing's really super problematic on your end, but."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5396.35,"end":5399.55,"speaker":"Fr Stephen De Young","text":"Oh, well, now that you've jinxed it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5399.71,"end":5400.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5400.35,"end":5401.15,"speaker":"Fr Stephen De Young","text":"Yeah. Boom."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5402.27,"end":5412.98,"speaker":"Fr Andrew Stephen Damick","text":"Suddenly my lights went. Now I'm just. But it's okay. It's okay. Yeah. So, okay, so the bodies of saints now. The bodies of saints. Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5414.1,"end":5420.74,"speaker":"Fr Stephen De Young","text":"And so the bodies of saints then remain the bodies of saints."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5421.7,"end":5428.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's their. It is still. It's not just their body. It's. It is them, Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5428.9,"end":5429.85,"speaker":"Fr Stephen De Young","text":"It is still them."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5430.4,"end":5449.44,"speaker":"Fr Andrew Stephen Damick","text":"It is still them. It is still them. And it's still, therefore, the body of Christ because the works that the saints do are God's works. So that body is being the body of Christ because it's doing his works."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5449.92,"end":5460.25,"speaker":"Fr Stephen De Young","text":"And that's even though. Even though it is a different pile of matter now than it was when that saint was alive."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5460.97,"end":5461.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5461.77,"end":5465.69,"speaker":"Fr Stephen De Young","text":"It's not identical molecules and atoms."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5466.01,"end":5466.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5467.77,"end":5475.85,"speaker":"Fr Stephen De Young","text":"That doesn't affect that any more than it affects it with. With us as a living human person here in this world."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5476.49,"end":5476.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5477.21,"end":5479.05,"speaker":"Fr Stephen De Young","text":"As the. The matter changes out."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5479.45,"end":5524.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this also applies. This also applies to pieces of the true cross and to holy objects in general. Once again, even though it's different matter, I mean, pieces of wood, the molecules definitely still change out. Right. Certainly can be changed out a lot of times over the course of 2,000 years. And that's part of why it doesn't even matter if it's quote unquote authentic. Right. Because it is being the cross when it is being prayed in front of, when it is being used to bless someone, when it is being venerated. It is the cross, Right? Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5524.8,"end":5535.05,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And so the idea of trying to scientifically authenticate everything is misguided."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5535.77,"end":5551.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, how could you, like, detect like, okay, let's detect whether this is being the true cross. Let's detect whether this is the cross for the church. Well, I can detect it because, look, I saw someone venerate. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5551.29,"end":5554.25,"speaker":"Fr Stephen De Young","text":"Yeah. And identity is not a question of the material."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5555.21,"end":5557.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not for me or you either."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5557.61,"end":5558.57,"speaker":"Fr Stephen De Young","text":"What it is doing."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5559.06,"end":5559.3,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5559.54,"end":5592.76,"speaker":"Fr Stephen De Young","text":"Yeah. What it is doing, what it is being at that time. And so this also extends to icons, Right. Which are related, not the exact same thing. Right. Because, you know, an icon of Christ, most likely it's not impossible, but most likely none of the matter in the icon of Christ you have on the wall was part of Christ's physical body. Like I said, it is possible, but most likely not."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5594.04,"end":5594.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5595.96,"end":5603.8,"speaker":"Fr Stephen De Young","text":"When he walked this earth. So. But still, it functions in a Similar way."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5605,"end":5605.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5607.8,"end":5611.8,"speaker":"Fr Stephen De Young","text":"That the. The icon is being. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5612.4,"end":5612.6,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5612.6,"end":5629.44,"speaker":"Fr Stephen De Young","text":"The presence of the. The person or event depicted. And that's. This is why the, The. Oh, we're gonna get hate mail about this. This is why the windows to heaven language isn't quite right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5630.48,"end":5670.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because, like, it. And, and from what I understand, I'm not one of the people who studied this, but from what I understand, people who have actually studied. Studied this, this windows to heaven language is relatively recent. Quite recent, actually. And, and the problem with a window is it's a space that opens and lets you sort of see through. But what an icon actually is being. Is the presence of the saint or the event being presented to you. You know, it's not a. It's not a telescope that lets you see back in time or, you know, into the other world or whatever. Right. It is being the works of that person or event or of God himself."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5671.66,"end":5713.51,"speaker":"Fr Stephen De Young","text":"Right, Right. And so, yeah, it represents this. A material object that has a sort certain capacity as a medium. Right. And when you, when you get into St. John of Damascus, who I. Who. See, I said we were going to get back to him later. When you get to his defense of the. The holy icons. Right. When, when he's arguing against iconoclasm, he doesn't focus on the type of stuff you brought up in your introduction. He does talk about it."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5713.59,"end":5727.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't. He doesn't just say, look at these precedents. I mean, which. I mean, fine. I mean, there's nothing wrong with bringing that up. Right. Like. Like there's icons in the temple and tabernacle, and like he, you know, that's."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5727.39,"end":5734.35,"speaker":"Fr Stephen De Young","text":"Fine, but he doesn't do 12 proof texts and then say, checkmate iconoclasts. Right? That's."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5737.23,"end":5737.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5737.79,"end":5762.83,"speaker":"Fr Stephen De Young","text":"And when you look at the core and structure of his argument in all of his treatises of the holy icons, the core structure of the argument he's talking about matter. For him, the core of the argument is the relationship of matter, of the material creation to God and specifically to the divine energies, to grace, to God's work."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5763.71,"end":5816.76,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, there's this. So there's this classic quote, which I think if anybody knows any quote from St. John of Damascus that isn't one of his hymns, this is the one that they've heard of. He says this. I do not worship matter. I worship the God of matter, who became matter for my sake and deigned to inhabit matter, who worked out my salvation through matter. I will not cease from honoring that matter which works for my salvation. I Venerate it, though not as God. So he's talking about matter being used by God, being inhabited by God, that the matter works his salvation. Again, it's not an independent good or independent agent, it's God doing it. God is making use of matter as an instrument."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5817.16,"end":5833.87,"speaker":"Fr Stephen De Young","text":"And that inhabiting matter, just to clarify, is not some kind of panentheism where God is just in all the matter. He's in the tree, he's in the wind. Right. It's specifically talking about the Incarnation as Saint John of Damascus clarifies."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5833.95,"end":5899.95,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right, yeah. Okay, so we've got another quote here again from the same work from his defense of the holy icons. And he says this. The nature of God remains the same as before. The flesh created in time is quickened by a logical and revelation reasoning soul. I honor all matter besides and venerate it through it, filled as it were with a divine power and grace. My salvation has come to me. Was not the thrice happy and thrice blessed wood of the cross matter? Was not the sacred and holy mountain of Calvary matter? What of the life giving rock, the holy sepulcher, the source of our resurrection, was it not? Matter is not the most holy book of the Gospels matter is not the blessed table matter which gives us the bread of life, are not the golden silver matter out of which crosses and altar plate and chalices are made. And before all these things is not the body and blood of our Lord matter? It's a powerful argument."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5900.75,"end":5911.82,"speaker":"Fr Stephen De Young","text":"Right. And so he's saying everything in regard to our salvation, all of the grace of God that we receive is mediated to us through the material creation."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5912.22,"end":5924.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not this sort of projecting of something from on high that we bathe in, you know, or whatever. It's matter, it's matter, it's matter, it's matter. Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5924.46,"end":5962.03,"speaker":"Fr Stephen De Young","text":"It's not over against the material. Right. Because St. John of Damascus, essentially what he comes to most often with the iconoclast is basically accusing them of being manichees, accusing them of treating matter as evil or somehow unworthy of God and thinking that God and matter have to be somehow kept separate. Right. That that to him is the opposite view. Right. Which the iconoclast view tends to. But so. Right. The knowledge of God that we have is more mediated through matter, most especially in the incarnation."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5962.59,"end":5963.07,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5963.23,"end":5975.07,"speaker":"Fr Stephen De Young","text":"Right. But the people who see God in the Old Testament see him with their material senses. Right. And interact with him and he, you know, touches them physically."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5975.31,"end":5975.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5976.75,"end":5993.89,"speaker":"Fr Stephen De Young","text":"They experience it. They are, they are material, noetic Beings. And the gospel. Right. The gospel being what Christ did. What Christ accomplished. Right. He did that, as St. John points out, materially."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5994.53,"end":5995.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":5995.09,"end":6001.97,"speaker":"Fr Stephen De Young","text":"He died on a cross made of wood. Right. In a place in space and time. Materially."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6001.97,"end":6007.09,"speaker":"Fr Andrew Stephen Damick","text":"He accomplished that with a material body of his own. Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6007.17,"end":6031.97,"speaker":"Fr Stephen De Young","text":"Right. And so all of material reality has the. This sacramental nature. Right. Has this sacramental nature where it is capable of being permeated by the divine energies, by the work of God. God is able to work through all of it. And that's what the age to come represents for us."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6031.97,"end":6117.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, I think sometimes when people talk about the energies of God, you know, which is. I mean, this is a classic term from orthodox patristic theology, and it's in the Bible actually, that, you know, living in the modern age as we do, I think sometimes people might think of the energies of God as being like a form of radiation, you know, but it's really God working. It's God's works in this world. And it is, as you said, it's in matter. It's through matter. He's making use of matter. And frankly, some of that is us. We are the matter. We are some of the matter that he's using to do his work in the world. And that means that we. Therefore, it goes the other direction, that when we respond to him, we do it materially. It's not just a internal mental thing where I just think about God or feel really hard about God. But there are material actions of worship, of offering sacrifices, the beautiful icons and everything in the church, all of church buildings, incense, holy water. I mean, it goes on and on. These are all things that human beings are using to respond to God and to participate in it, his works. It goes in both directions."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6118.63,"end":6176.22,"speaker":"Fr Stephen De Young","text":"Right. Because the matter that God works through is transfigured. It's not dissolved. It's not done away with. Right. And replaced with spirit or something else, whatever we want to call it, that's better. Right. But it is transfigured and transformed and then becomes a suitable vehicle for us then to respond through it. So the medium of our salvation in both directions, the medium through which we interact with God is the material creation as a whole. And so that is the medium. And Christ is the one mediator between God and man, because he is both God and man, both God and a material noetic being that. That man is."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6177.26,"end":6192.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And that. And that's why then there is a bodily resurrection of Christ, of humanity. It's the ultimate transfiguration, transformation of all matter. To be the instrument of God."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6193.91,"end":6197.51,"speaker":"Fr Stephen De Young","text":"Right. The whole resurrection of the cosmos is resurrected."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6199.67,"end":6266.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that's what relics are, everybody. It's, you know, it's, it's, you know, I wanted to relay a little anecdote actually kind of connected to all that. So I mentioned the beginning about venerating the hand of St. Mary Magdalene. And occasionally people ask me like, well, are you sure, you know, that it was warm or whatever? Well, number one, I was kissing a whole series of relics. Right. And there was a clear temperature difference when we came to kissing her hand. It is, it's warm. Just as the hand of any human woman is warm and the skin is flexible. I mean skin still on. It's an incorruptible. I mean it's 2000 year old relic, but it's incorrupt. Skin is flexible, the hand is warm. So on Mount Athos, many of the monasteries there have the custom. I don't know if it's all of them, I haven't been to all of them, but I saw it at a bunch of them. Many of the monasteries there have the custom that after dinner, so usually you have vespers and then dinner, and then they serve compline or complin, as someone wrote in to tell me I should be saying instead."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6268.53,"end":6272.69,"speaker":"Fr Stephen De Young","text":"I'm Dutch. So when I hear compline, I think that's where you cue up to get free stuff."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6273.65,"end":6523.2,"speaker":"Fr Andrew Stephen Damick","text":"The computer line. Yes, Nice. Right. So when that service is being served in the narthex, which is where it's traditionally served, then often in the nave of the church there at the monastery, they'll put some tables in the middle of the nave and then they'll take the major relics that they have at the monastery and put them out there for the veneration of pilgrims. And they'll do this like almost every night. And you know, on Mount Athos, the relics that they have there, most of them are not like the relics that we have here in America, where most relics you encounter here in America are like a tiny little speck, you know, they're really, really small. Or they might be something maybe the size of like a pea. You know, at biggest. Right. In some places there's, there's bigger one. You know, like for instance, if you were to go to Joy of All, Hussaro Cathedral in San Francisco, you can see the full relics of Saint John the Wonder Worker there. The same thing with St. Mardadia at the monastery in Liberty of Illinois. But generally speaking, most of the relics you encounter here in America are tiny Little specks. Well, on Mount Athos they have many major relics, like whole parts, you know, whole skulls, hands, legs, feet, arms. You know, that's pretty common there. And so when we were at Simonopetra Monastery, which has the hand of St. Mary Magdalene Magdalen, a higher monk, Father Jacobus actually, who's an American actually, so he was there putting the relics out. And then he explained to us in both English and also in Greek for the Greek speaking pilgrims, what the relics were, who they belonged to. This is the hand of St. Mary Magdalene. This is, I think they have a leg from St. John Chrysostom and some other relics there. I don't remember them now, it's been a few, few years and one of our pilgrims was a little weirded out by this experience because again, they weren't little specks. I mean, you look and these are bones right in front of you, you know, or in one case a hand. And, and, and he, and he just, I just kind of heard him quietly say, I don't know that I can do this. Like he felt like he just couldn't do bring himself to go and kiss these bones. And I think a lot of Americans have this sensibility when, when, when seeing like relics that, that it's, it's, it's hard, you know, because like, I'm not used to encountering dead body parts and whereas, you know, a lot of our ancestors would have been much, much more used to that kind of thing. And then, so Father Theodore, who was leading our pilgrimage, he said, and to this day, I, I, I wish I could remember exactly what he said, but he said something to the effect of a relic is the presence of Christ in the saint to us, you know, and that there's a sense in which this is a foretaste of the resurrection as well. And then, then the pilgrim, with the hesitation, he immediately just stepped forward and venerated the relics. And he too experienced the fact that her hand is still warm. And you know, a lot of relics have miracles associated with them. Most don't, frankly. Most do not. But I mean, there's some where they're incorrupt, the skin is still on them. There's some where they're warm. I read recently that the body of St. Spyridon is warm and that his skin is flexible, that his hair and nails grow. I mean, he's been dead for a long, long time. You know, there are some that stream myrrh, there are some that have a beautiful odor, but again, most don't have any of those kinds of miracles associated with them. But if we understand that the body of a saint is being that saint's body is being that saint and is therefore the body of Christ, all of this makes sense. All of it makes sense. So, so, you know, I, I hope that this kind of recap, I mean, we did a lot of recapping, but it, you can see it all kind of flows, flows into that. I have some final thoughts on another related, you know, related topic, whatever, but I don't know. Father, did you want to give any kind of concluding remarks about how this specifically relates to relics before we do each our final thoughts?"}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6524.48,"end":6556.7,"speaker":"Fr Stephen De Young","text":"Well, I mean, just touching on, you know, what you mentioned about our ancestors being more familiar with this in a lot of old countries still today. In Palestine in the first century, though this was only for a brief period. In Palestine, admittedly, for example, it was very common when someone's loved one was deceased, they would be buried, but they'd only be buried or put in a tomb for a period of a year or two."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6557.26,"end":6557.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6558.14,"end":6579.51,"speaker":"Fr Stephen De Young","text":"And then the family would return to the grave site and to remove the, the remains and wash the bones and put them in an ossuary. And there are other similar rituals. And, and if you're talking about an orthodox old country, like, I know they still do this in a lot of parts of Greece."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6579.75,"end":6580.31,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6580.39,"end":6617.53,"speaker":"Fr Stephen De Young","text":"There are prayers associated with that. And this has been throughout human history, you know, people have cared for their departed loved ones, meaning their bodies, you know, long, you know, after, after their departure. We talked about back in the Neolithic period, the first human settlements, people buried their departed loved ones in the floors of their homes. They were, they were still there with them."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6617.89,"end":6618.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6618.05,"end":6667.15,"speaker":"Fr Stephen De Young","text":"They kept, they kept them there with them. And so, yeah, that, that our modern, especially American sort of squeamishness and, you know, get the body away from me as fast as possible and make it look like a wax dummy if I have to see it at all and then get it into the ground and I'll just have my memories of that person. And that's the weird aberration in terms of humanity not, you know, kissing the body of a loved one who has died. That's not weird. That's normal for humans. The other is what's weird and kind of unnatural."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6667.71,"end":6668.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6669.32,"end":6676.76,"speaker":"Fr Stephen De Young","text":"So, yeah, just a more global perspective, historical perspective on that, I think helps a lot."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":6677.4,"end":7093.74,"speaker":"Fr Andrew Stephen Damick","text":"Right. And that our psychological feelings, sometimes we can't just trust that they're the best thing to go by. You know, I remember the late Father Peter Gilquist, now he was talking about worship. But he said, whatever someone's used to, that's what's normal for them. And it's really true. That's the thing that they're going to call normal. And what everyone else does is weird. Right? Yeah. Okay. So that really nicely segues into what I wanted to say for my final comments then before you make yours, Father. So we had several people that contacted us and were asked, and there was a conversation within our Facebook group, actually, about the practice of cremation. Right. Now, if you've been listening to this whole episode, then your mind is going to start to work on this question, right, about cremation. And traditionally speaking, Christians do not cremate their departed. They don't. Cremation has been something that was much more associated with paganism, although even then, most pagans throughout history did not cremate. And, you know, one thing, of course, is that a lot of people don't really understand actually what's involved in most cremation, especially here in the United States. You know, it's not simply burning the body, because not everything in a human material body burns up. There's still bones left over. And the cremation process also includes grinding the bones up, smashing and grinding the bones. It's a really kind of a violent thing. Now, not everywhere does cremation the same, but that's the way that it's done here in America. And of course, if someone has any kind of prosthetic implants, you know, like a new hip or a joint or something like that that's tossed in a big bin to be recycled afterwards, I mean, you can go down to your local funeral home and ask them about this. They'll tell you. But Christians traditionally do not cremate. And of course, Orthodox Christians, you know, there are exceptions, right? But generally speaking, the rule is that someone who's cremated cannot receive an orthodox Christian funeral. And if you've wondered why. Well, I mean, listen to this episode. Because that body is. If it's a Christian, it's part of Christ's body. You know, Christ was not cremated. That body was still him while it was in the grave. Right. He didn't go somewhere else. And that that body was no longer his. It was still him. It still was him even when he was in the grave. You know, we don't talk about him being gone. We say that he was in the grave because his body was in the grave. Right. Christ was not cremated, and that that body rose from the dead. And the bodies of Christians rise from the dead. Actually, the body of Everybody is going to rise from the dead, but Christians, with the hope of the resurrection, to then act upon that body in a way that utterly dissolves it, sort of erases it, especially this practice of sprinkling ashes. That's even more. Even more. This kind of thing of kind of totally erasing the human body that you can see now how this is not. This is not appropriate for Christians, right? And now, again, it's not about the specific molecules, Right. It's about the person. And that body is still that person. Right. The same understanding is going to extend outward to all human bodies, living or dead, to all material creation. What do we use it for? What are human bodies for? They are for the works of God. And dissolving them through cremation or whatever other process someone might use is an act of counteracting that, right? Now, if you. If someone, you know, has been cremated, not saying that that means that they're damned or that the people who did that are damned. Most people are cremating out of. Out of ignorance, actually. Right. Because they just maybe they think it's the cheapest option. Sidebar. It's not necessarily the cheapest option. Again, talk to. If you use a funeral home, talk to the people who run may not be actually the cheapest option. And, you know, there's a lot of considerations that have to go into that. But if we understand that the bodies of Christians are them and are the body of Christ, then we're going to lovingly lay it to rest. And, you know, as Father Stephen mentioned, there's in many cases, after a period of time, the bones are removed and lovingly taken care of, put into an ossuary. You know, like especially a lot of monastic ossuaries, bones stacked upon bones. And it's interesting, you know, there's certain ones that you'll see might be a kind of like a honey golden color or sometimes a sort of scarlet color. Some will drip myrrh, some will have a beautiful odor because this is the sanctity of Christ in that person, right? And you know, cremation acts against that. Cremation destroys that possibility for that person, right? So, you know, this whole episode was not an argument against cremation, but kind of as a byproduct of talking about relics. You know, we understand the term relics largely to refer to the bodies of saints, but the truth is that every human, every Christian, their body is relics. Their body is being the body of Christ for us. And we should treat it that way. That's how we should treat it. So I'M not just talking about cremation here, but about the way that we attend to other human persons, not just after their material death, but even as they are living amongst us, that that body is relics, that body is for us the presence of Christ in our midst. He is working in them. They are doing his works because God works in matter. God uses matter for our salvation, just like St. John of Damascus said Father Stephen."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7096.22,"end":7196.07,"speaker":"Fr Stephen De Young","text":"Yeah. So Fun fact number 327, about me is that my favorite novel is Albert Camus the Stranger. And at another point after World War II, Albert Camus gave a talk to a group of Dominican monks in France, and he was asked to speak on the topic of what the world wants or expects from Christians in the wake of everything that had happened in World War II. And Albert Camus having been part of the resistance in France and etc. And in it he gives, albeit in a somewhat hopeful way, what has been for a long time in the modern world, the primary criticism of Christians and Christianity from people outside of it, which is essentially that Christians only care about spiritual things and not about this world, and that they do that because of their religion. They're just worried about going to heaven when they die, and they don't care about anything else. So they don't care if the water in the air get polluted. They don't care if people starve to death. They don't care about any of this stuff in this world because they just, you know, they believe the right thing, so they're gonna go to heaven when they die, and they just care about the next world and not about this world."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7196.79,"end":7197.19,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7199.91,"end":7410.35,"speaker":"Fr Stephen De Young","text":"Camus kind of lays that at the feet that idea basically at the feet of the. The Dominican monks, who he's kind of blaming for their silence in the lead up to World War II and even during World War II, when they had kind of cloistered themselves. But he concludes it by saying essentially, you know, we may never get to live in a world where children aren't killed, but we can work together to live in a world where fewer children are killed. And I think it's easy when we hear that response, especially when it's put in a patronizing or not very insightful way by an atheist on the Internet. It's very easy to rattle off a bunch of responses like, you know, hey, Christians built the first hospitals and the first orphanages and, you know, feed people and all the charity Christians have done historically. And that's all true, right? And it's not that that's invalid, but the People who make that criticism aren't getting it from nowhere. They're not just making it up. It wouldn't sting and we wouldn't get defensive if they were just making it up out of whole clothes. You know, even some of our very popular American hymns, I love I'll Fly Away, it's super catchy, but it's horrible theology, Right. One bright morning when this life is over I'll fly away Goodbye body, goodbye world I'm going to heaven, I'm going somewhere better. And that is foreign to Christianity. That idea isn't Christianity as it has historically existed. It may be some form of Gnosticism, it may be something else, but that's not Christianity. For Christians, this world, this material world, the matter that makes up the world to come, is not going to be a whole new set of matter. It's going to be this matter rearranged and transfigured and reordered and recreated in that sense. And so for us as Christians, as we, as St. Paul says, work out our salvation with fear and trembling because God is working within us to will and to do according to his pleasure. As we're doing that, we're doing that in this arena, through this medium that is material. And so we need to not be inspired by our reaction to accusations from atheists, but in response to the example set for us by our forebears in the faith who came to new peoples and created written languages and taught people groups literacy so they could read the Scriptures and read and understand the prayers of the church and come to know Christ and sometimes taught them farming methods while they were at it. Because if someone's starving to death, it makes it very difficult for them to learn about who Christ is and to focus on anything else. They did these things not in addition to, and definitely not instead of preaching the Gospel, but these are part and parcel."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7410.35,"end":7410.48,"speaker":"Fr Andrew Stephen Damick","text":"These."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7410.63,"end":7461.97,"speaker":"Fr Stephen De Young","text":"These things go together, right? Christ says not only blessed are those who teach little ones the commandments, but also blessed are those who give to the little ones a cup of cold water in his name. Those go together. And so we need to care deeply about this world, this created material world, and the people in it, and doing good here and finding repentance here and bringing other people to the knowledge of God here. Because it's through this medium of this life in this world, in all of its materiality, that we're going to find our salvation and our entrance into the next world, which is really just this world fully transformed and made perfect, reaching its goal, for which it was created in the first place."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7463.34,"end":7487.7,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well everybody, that is our show for tonight. Thank you so much for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritscientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but can't respond to everything. And we do save what you send for possible use in future episodes and."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7487.7,"end":7494.23,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7494.63,"end":7504.51,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7504.51,"end":7516.16,"speaker":"Fr Stephen De Young","text":"Love it or if they're going to hate it. We like hate listeners. They're cool too. And finally, be sure to go to ancient faith.com stroke support and help make sure we, as lots of other AFR podcasters, stay on the air."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7516.48,"end":7518.96,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you all."}
{"episode_id":"LOS - #025 - 2021-08-12 - Can These Bones Live -","start":7535.76,"end":7572.93,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Church Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom, wisdom and strength, and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
