{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":0.8,"end":65.45,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":66.89,"end":132.71,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers and dragon slayers. You are listening to the Lord of Spirits podcast and my co Host Father Stephen DeYoung is with me from Lafayette, Louisiana. And I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in. This is actually the first episode in a while that we've taken calls live. You can call in at 855-AF-RADIO. That's again, that's 855-237-2346. Montesqua Trudy is taking your calls tonight which we will get to beginning in the second part of our show. But first I just wanted to mention that Lord of Spirits is brought to you by our listeners with help from the Theoria School of Filmmaking. Theoria School of Filmmaking is the first orthodox film school. The first, the primary instructor is Jonathan Jackson, a faithful orthodox Christian speaker, writer and five time Emmy award winner. To learn more about theoria, please visit theoriafilm.org and that's spelled T H E O R I a film.org so on."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":132.71,"end":135.43,"speaker":"Fr Stephen De Young","text":"This podcast and I endorse this product or service."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":136.79,"end":179.94,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Yes. Yeah, we have sponsors. Isn't that great? So on this podcast we've talked many, many times about the three elements of the fall of death, sin and domination by demonic powers. But we've never actually dedicated whole episodes to this. So today we're going to be beginning a three part series on this and our first episode is of course on death because that's where it starts. That's where mankind's problems really begin. So naturally we're headed all the way back to Genesis. So Father Stephen, is this going to be the episode where we finally talk about how the Earth is almost exactly 6,000 years old?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":181.06,"end":184.82,"speaker":"Fr Stephen De Young","text":"No, because that's not a thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":186.9,"end":188.66,"speaker":"Fr Andrew Stephen Damick","text":"But that's very disappointing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":189.7,"end":194.9,"speaker":"Fr Stephen De Young","text":"Before we start, we have another proverbial elephant in the proverbial room."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":195.32,"end":196.12,"speaker":"Fr Andrew Stephen Damick","text":"Oh, here we go."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":197.4,"end":225.59,"speaker":"Fr Stephen De Young","text":"And, you know, I. I try to mind my own business, right? Keep to myself. Do you? I'm not on social media, right? But I hear things. You know, things get back to me lately. I hear some guy, Richard Rollins, I guess, goes on some YouTuber's show, starts talking a bunch of mess about how I'm a chicken."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":225.75,"end":226.79,"speaker":"Fr Andrew Stephen Damick","text":"I heard about this."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":228.07,"end":285.93,"speaker":"Fr Stephen De Young","text":"Listen up, pal. You can hear me now, and believe me, later, nobody calls me chicken. I know all about all these stories about Melchizedek. I've read Slavonic Enoch, so I know about Melchizedek being born from the dead body of his virgin mother as the third Anakic priest and being hid in Eden during the flood. I know all about this. I may have even written about it in a forthcoming book. So, Richard Rohan, if that is your real name, here's what I want to know. You go around acting like you know all about Ethiopia, but I haven't heard a word from you about 4th Baruch. I don't think you even know it exists. So what now?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":286.49,"end":303.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, we're officially having an Internet feud, everybody. So join in, please. Welcome. All right, the gauntlet has been thrown down. I'm told that Richard actually doesn't even listen to this live, so he doesn't even know what a hundred people now know about him."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":303.48,"end":309.96,"speaker":"Fr Stephen De Young","text":"So, yeah, Yeah, I have no doubt he's going to need a lot of time to figure out how to even."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":309.96,"end":314.2,"speaker":"Fr Andrew Stephen Damick","text":"Respond exactly if he does. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":314.2,"end":324.64,"speaker":"Fr Stephen De Young","text":"But so, on to our topic for tonight, with apologies to our listeners that they had to sit through that kind of nonsense, but sometimes you have to respond to something."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":324.64,"end":330.78,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry you guys had to hear that. But, you know, they're saying stuff, so things have to be said. Return."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":331.02,"end":369.01,"speaker":"Fr Stephen De Young","text":"Yeah, you can't just let some of these things slide, no matter how obscure a person it is. Who says that? And we're going to begin this evening as we begin so many evenings by doing a little recap, because we're going back to the Garden of Eden. We're talking about the expulsion from paradise. We're talking tonight about death coming upon the human race. And so, as with several of our episodes recently, these aren't things that we've never talked about before, but we're kind of coming at it from a different trajectory tonight."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":369.33,"end":369.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":371.09,"end":436.5,"speaker":"Fr Stephen De Young","text":"And so just to remind people, because even if you have recently listened to all of the previous episodes straight through because you've been lost at sea or something with an iPhone, I don't know, it's been probably about 100 hours since the last time we talked about this minimum. So we need to go over a couple of themes from Genesis 1 and Genesis 2, respectively. So, as we've talked about a couple of times in a couple of different episodes in the past, in Genesis 1, part of the structure of the description of the six days of creation followed by the seventh day is that this follows the general pattern of temple construction. And we'll probably end up wrapping around and doing another temple episode and going into this in even more detail again."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":437.21,"end":439.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but that'd be a good idea."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":439.61,"end":460.97,"speaker":"Fr Stephen De Young","text":"Temple construction narratives, stories of God's temples being built or them building and then coming to inhabit their temples, that's a major genre of ancient Near Eastern literature. And so Genesis 1 has sort of has those features."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":461.45,"end":461.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":463.38,"end":495.7,"speaker":"Fr Stephen De Young","text":"And as I said, at some point, we'll probably go more depth than that. There's also. There are continuities and discontinuities with the other ancient Near Eastern examples. So. But the key element for tonight is that at the end of sort of creation being constructed as the temple of Yahweh, the God of Israel, the Sabbath day, when he comes to rest, it's not that he needs a break or. Or he's tired, it's that he is seated, he is enthroned."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":496.26,"end":503.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which we covered a lot in our ascension episode from last year. We talked about this."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":503.3,"end":554.18,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that is an important element to kind of have back in your mind for what we're gonna talk about tonight. And the second kind of element, and this is something we've mentioned, I know, repeatedly, so this is maybe a little fresher, is the pattern in Genesis 1. And two of you see this in the creation days. The first three days are things being put in order. The second three are then being filled with life. And then the garden itself. A garden is sort of the perfect combination of the two. Right. Order without life is sort of just barren. And life without order is the bayou next door to where I'm speaking to you from right now."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":554.34,"end":558.66,"speaker":"Fr Andrew Stephen Damick","text":"Can you go fishing there? There must be some kind of something. Something good in there."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":559.14,"end":561.22,"speaker":"Fr Stephen De Young","text":"Yeah. An alligator might catch you. But."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":563.86,"end":566.98,"speaker":"Fr Andrew Stephen Damick","text":"Hey, no guts, no glory, right? Yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":569.13,"end":605.94,"speaker":"Fr Stephen De Young","text":"I have a parishioner now who did some alligator farming, so. And then that. That pattern of creation Creation being, putting things in order and filling them with life is then what is handed down to humanity to continue that work by filling the earth and subduing it. Right. Filling it with life and subduing it, putting it order. And we've talked before about how one of those tends to the masculine, the other to the feminine, and that men and women participate together to accomplish both."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":606.02,"end":606.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":609.06,"end":617.86,"speaker":"Fr Stephen De Young","text":"So that's the quick recap. So if we have those kind of things in the back of our head, that will help as we now go forward."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":618.18,"end":618.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":618.74,"end":669.92,"speaker":"Fr Stephen De Young","text":"So this is. So this is the beginning of, as you mentioned, sort of a three part series. Yeah. And these are going to be patterns somewhat the same way. So in our first half of the three tonight, we're going to be talking about the way in which angelic or divine beings get involved in this first fall of man. Because each of the three, obviously we already did our 5ish falls of the Angels episode way back in the long ago time. Now we're focusing on the human side. But there are, in each of these three, there are angelic beings who get involved."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":670.4,"end":670.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":671.52,"end":755.79,"speaker":"Fr Stephen De Young","text":"And since this is the first one and this is the one that immediately follows the creation of the world, those stories, we need to start by talking a little bit about the invisible creation. Right. Because we understand, and it's even referenced in the Nicene Creed, that creation has these components, visible and invisible. And the whole premise of the show is about reuniting those. Right. But when we talk about the creation of the world and the way a lot of folks, especially in our modern era, sort of the modernist approach to these things, focuses almost entirely on the material element of that, which is why some folks spend their time plumbing the depths of the age of the earth and where dinosaurs fit into Genesis and these sort of things, because they're primarily concerned with the scientific material elements, but the elements of the invisible creation are important here. The other thing that tends to happen, and I'd probably feel worse about bashing John Milton if he weren't a Puritan."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":757.87,"end":762.31,"speaker":"Fr Andrew Stephen Damick","text":"Well, he's dead. He's. I mean, he's not gonna be bugged by this, though."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":762.31,"end":763.31,"speaker":"Fr Stephen De Young","text":"He's a dead purit."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":763.72,"end":791.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. There's some very nice poetry, though. I know. Yeah. Hey, I spent a lot of time, as I say, I'll spend a lot of time with especially 16th and 17th century English poetry as an undergrad. And so I have a very soft spot in my heart for that stuff. Yeah. Milton's mighty line, you know. Right. Milton's mighty line. Mighty line. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":792.84,"end":830.72,"speaker":"Fr Stephen De Young","text":"I prefer the continent still. So. But from. I mean, you have to give him credit, right. That his writing was sort of so powerful that everyone now has this sense that there was some kind of primordial, not only creation of angelic beings before the creation of the world, never discussed in the Bible, but that there was this war in heaven before the creation of the world, that. That has just become so commonplace as a belief. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":830.72,"end":849.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, he took stuff that is either in or implied in scripture and kind of projects it backwards to before Genesis 1:1. Right. This stuff all happens kind of off camera and then you get paradise lost. Right, Right. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":849.56,"end":859.48,"speaker":"Fr Stephen De Young","text":"Right. But we need to take seriously that Genesis 1 and 2 are giving us the story of creation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":861.56,"end":864.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And angels are created not of the."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":864.56,"end":870.84,"speaker":"Fr Stephen De Young","text":"Creation of matter, not of the creation of the visible world, but of creation, the whole thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":870.84,"end":872.25,"speaker":"Fr Andrew Stephen Damick","text":"The whole creation. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":873.05,"end":928.7,"speaker":"Fr Stephen De Young","text":"And that the visible and the invisible creation are not sort of these in two separate compartments. Again, the whole theme of this show, these things are not in these two separate compartments and don't interact. Like there's some kind of invisible dimensional wall between us and heaven. And the angels are up there doing stuff, and we're here. So the question becomes, if we accept that. So if we accept, okay, what we have in Genesis 1 in particular and the beginning of Genesis 2 is the creation of all of creation, visible and invisible, then where, within the narrative Genesis, where does the invisible creation fit in?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":929.5,"end":936.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it doesn't seem to be explicit anywhere in there. You know, and on the nth day, God created the angelic beings."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":937.18,"end":937.58,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":937.58,"end":938.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":938.46,"end":939.98,"speaker":"Fr Stephen De Young","text":"It's not that explicit, at least."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":939.98,"end":941.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":941.58,"end":959.74,"speaker":"Fr Stephen De Young","text":"And so what you tend to get is. And if you read Second Temple Jewish sources, if you read the church fathers on this, they will generally peg it to one of the creation days."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":960.62,"end":961.26,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":961.34,"end":966.7,"speaker":"Fr Stephen De Young","text":"So they don't see it as this separate event outside of the narration of Genesis 1."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":967.02,"end":968.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not Day Zero."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":969.02,"end":977.99,"speaker":"Fr Stephen De Young","text":"Right. But they also don't. There's no gap theory. Right. Yeah. So Tales for the Crypt Demon Knight is not accurate."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":979.27,"end":979.83,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":981.27,"end":982.79,"speaker":"Fr Stephen De Young","text":"I know that's where you were getting."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":985.59,"end":986.55,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you know, me."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":988.31,"end":989.03,"speaker":"Fr Stephen De Young","text":"Was from."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":989.67,"end":997.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that stuff. I ne. You know, when I was a kid, I saw that that stuff existed, but it always ooged me out on a very, very deep level."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":997.99,"end":999.51,"speaker":"Fr Stephen De Young","text":"Tales from the Crypt Demon Knight."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":999.75,"end":1006.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I didn't even know that there was. I just knew Tales from the Crypt existed. I didn't know that there was even Demon Knight."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1006.45,"end":1016.29,"speaker":"Fr Stephen De Young","text":"No. It is the first. And you should watch what you say about it because Jada Pinkett Smith is in it, and if anybody hears you say anything bad about that movie, you could get smacked."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1016.45,"end":1018.69,"speaker":"Fr Andrew Stephen Damick","text":"I have nothing to say about the movie. I've never seen it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1019.73,"end":1024.13,"speaker":"Fr Stephen De Young","text":"I'm just saying don't even want to mention her name."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1026.53,"end":1030.53,"speaker":"Fr Andrew Stephen Damick","text":"It's not like Tolkien fans who have everything to say about shows that haven't even come out yet."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1031.02,"end":1045.9,"speaker":"Fr Stephen De Young","text":"Yes, and it stars Billy Zane before he went bald, but ironically, he shaved his head in it anyway, so. But it's inaccurate. That's the right here."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1045.98,"end":1046.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1046.54,"end":1055.9,"speaker":"Fr Stephen De Young","text":"So not a bad movie, but inaccurate. Much better than the sequel, which starred Dennis Miller. That Dennis Miller?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1055.9,"end":1058,"speaker":"Fr Andrew Stephen Damick","text":"Really? Yes. Okay."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1058,"end":1060.64,"speaker":"Fr Stephen De Young","text":"Tales from the Grip two Bordello of Blood."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1060.8,"end":1063.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm still not gonna watch it, but. Oh, gosh, no."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1063.6,"end":1071,"speaker":"Fr Stephen De Young","text":"Where he. Where he. The. The spoilers. He ends up shooting a bunch of vampires with holy water in Super Soakers."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1071,"end":1073.28,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, all right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1073.6,"end":1080.48,"speaker":"Fr Stephen De Young","text":"As one does so moving is also inaccurate, as you know from our Halloween episode this year."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1080.48,"end":1083.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. That is not how vampirism works or any of that stuff."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1083.55,"end":1093.99,"speaker":"Fr Stephen De Young","text":"Yeah, so. Right, so the. The Second Temple literature and the fathers see this somewhere in the framework of the creation days."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1094.15,"end":1094.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1094.71,"end":1102.95,"speaker":"Fr Stephen De Young","text":"So usually. Not always, but usually it's either the first day or the third day."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1103.35,"end":1104.67,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so why would they pick the."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1104.67,"end":1106.23,"speaker":"Fr Stephen De Young","text":"Or the fourth day. I'm sorry, the fourth day."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1106.47,"end":1108.07,"speaker":"Fr Andrew Stephen Damick","text":"So why would they pick those days?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1108.31,"end":1116.17,"speaker":"Fr Stephen De Young","text":"Well, first day light is created. The fourth day is the sun, moon and stars, which, as we talked about, are connected biblically to the angels."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1116.41,"end":1121.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. You wouldn't want to create those things and just let them float out there without an angel to take care of them."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1121.61,"end":1149.36,"speaker":"Fr Stephen De Young","text":"Right, yeah. So it's usually one of those two days. The minority report is there's some second day, and I think the second day folks are looking at the separation of the waters above from the waters below, and they're looking at that as the creation of heaven or the heavens. Right. Okay, so that's sort of the minority."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1149.36,"end":1151.6,"speaker":"Fr Andrew Stephen Damick","text":"Report, but that's the heavenly hosts."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1152,"end":1188.32,"speaker":"Fr Stephen De Young","text":"Yeah. Right. So those are the end. And this is true even for fathers, for example, like St. Augustine, who don't hold to like 24 hour days in sequence. Right. So St. Augustine famously believed that, you know, time doesn't apply to God. So this sort of all happened at once. And the days there are just sort of a structure to explain it to us."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1189.52,"end":1193.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, a literary structure rather than a chronological structure."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1193.2,"end":1208.6,"speaker":"Fr Stephen De Young","text":"Right. And so there. There are certain other fathers who have similar. Not St. Augustine's exact view, but who talk about Genesis 1 as being a structure for explaining it to us rather than being a literal blow by blow account."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1209.08,"end":1219.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it doesn't, if I recall correctly, doesn't. St. Basil, is it in the Hexameron who kind of says, look, we don't know. Exactly. And it's not super important that we know these kinds of things."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1219.8,"end":1240.03,"speaker":"Fr Stephen De Young","text":"Right. That beyond what's in the, that what is told to us in the text, we don't have a capacity to know. Right, yeah, it's, you know, that, that, that's left to God. But. And so we need to be attentive to what he did tell us and what he's teaching us by it. And he was using that, I think, to sort of cut off speculation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1240.35,"end":1240.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1240.99,"end":1269.05,"speaker":"Fr Stephen De Young","text":"Which can run all over the place. Right, yeah, yeah. And that kind of approach generally makes sense because if we take, also take seriously the idea that we, we find in most of the fathers, I'm not going to give a percentage, but most of the fathers who talk about it, that the prophet Moses received this in a vision. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1269.05,"end":1269.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1269.93,"end":1302.65,"speaker":"Fr Stephen De Young","text":"It seems to me if he received it in a vision and you're going to be a stickler for literal 24 hour days, then he must have been standing there on Mount Sinai for six or seven straight days watching, playing it all out. You probably can't pause it, it being a visionary experience. There's going to be symbolism, there's going to be structures to it to communicate things that aren't necessarily literally. Now, it's not literal."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1303.05,"end":1319.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And why would they say that Moses received this in a vision? Well, because Adam and Eve were not taking notes. And of course they also weren't present for most of what's in the, you know, so this would have to have been revealed by God to Moses who writes Genesis."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1319.76,"end":1320.56,"speaker":"Fr Stephen De Young","text":"Right? Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1320.56,"end":1321.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1321.16,"end":1335.52,"speaker":"Fr Stephen De Young","text":"So that's the idea there. And again, we're not saying it's not literal, we're just saying it's perfectly reasonable to take a symbolic reading. Right. Of what's going on there. Especially when we're talking about Genesis 1."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1336.09,"end":1339.21,"speaker":"Fr Andrew Stephen Damick","text":"Is it a symbolic world? I don't know."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1340.33,"end":1365.53,"speaker":"Fr Stephen De Young","text":"That sounds vaguely familiar. So there is the key though here. The key thing that we can say that is taught because we've said there's these differences and distinctions and nuances. Right. But the key thing that's taught here is that the visible and invisible creations are a product of the same creative act."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1366.55,"end":1366.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1366.79,"end":1368.47,"speaker":"Fr Stephen De Young","text":"Because Holy Trinity. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1368.63,"end":1379.91,"speaker":"Fr Andrew Stephen Damick","text":"The idea that they are kind of two utterly separate creations is simply not A thing in scripture. And as you said, it's mentioned in the Creed, you know, that he created all things visible and invisible."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1380.23,"end":1380.67,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1380.67,"end":1383.43,"speaker":"Fr Andrew Stephen Damick","text":"You know, it's just creation. Yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1383.43,"end":1404.99,"speaker":"Fr Stephen De Young","text":"Right. So this. And again, we obviously we talked about this again in the before time in our episode about the 5ish falls of the angels. But that then of course raises the question of the falls of angels and specifically the devil."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1405.87,"end":1406.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1407.15,"end":1430.78,"speaker":"Fr Stephen De Young","text":"So what you find when you start looking this up is that often there's either. It's either spoken of as if no real amount of time passed between the creation of angelic beings and them at least beginning to fall."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1431.58,"end":1442.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If I recall correctly, isn't it Saint Maximus maybe who says that they fell, or maybe he's talking about Adam. But the idea. So they fall as they come into being."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1442.86,"end":1447.74,"speaker":"Fr Stephen De Young","text":"Right. Well, that's what I was about to say is that you find Father saying the same thing about humanity."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1448.31,"end":1450.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1450.79,"end":1464.95,"speaker":"Fr Stephen De Young","text":"Because there, there is no. Again within the story in Genesis, there is no time lapse. Right. Like we don't have, you know, five years later, Eve was standing next to the tree of the knowledge of good. Right. Like."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1464.95,"end":1474.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. There's no indication of how much. Yeah. Of when things. I mean, there's an order, a sequence. Right. But there's no indication of how long it takes for. From one thing to the next."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1475.36,"end":1493.04,"speaker":"Fr Stephen De Young","text":"Right, right. And I think we need to understand that as we've talked about so many times, you don't know what it's like to be a bat. You don't know what it's like to be a vast cosmic intelligence. You don't even know what it's like to be a newly created human in the presence of God in paradise."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1493.44,"end":1495.68,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I can even remember being born. So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1495.84,"end":1523.11,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And so we don't know in the same way that we don't know how we will experience time in the life of the world to come. Right. We tend to think about it as if time, we're going to experience time the same way we do now. It's just going to be like forever. It's going to be like an endless succession of moments. But there's no logical reason to believe that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1523.51,"end":1525.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1525.19,"end":1531.26,"speaker":"Fr Stephen De Young","text":"That's how we're going to experience time. And the same thing is true before the expulsion from paradise."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1532.14,"end":1548.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so I think one of the things that's really important to highlight here when we talk about the fall of the devil. Right. And we're talking about the fall of human beings too. Right. So this is, you Know, kind of."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1549.34,"end":1551.58,"speaker":"Fr Stephen De Young","text":"Just using the word fall in this context."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1551.9,"end":1636.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Often fall within a certain theological framework is used to mean flipped the switch from good to evil. Right. At this point, you know, this is unfallen, he was perfect, sinless, whatever. And then the switch gets flipped and it's evil, depraved, damned. Right. You know, but that is not really the way that the scripture and traditional Christian theology use this term. It's actually a little bit more literal in some level, or should maybe say a little bit more analogical. It's more about being thrown out, cast down. Right. So for instance, when Christ says that he sees Satan fall from heaven, that's this analogical sense of being thrown out and falling down. Not. It doesn't mean turning to evil because presumably there's already evil present within the serpent before he's cast out from paradise. Right. And we certainly, we know that Adam and Eve have already transgressed against the Lord before they're cast out from paradise. So it's not the same thing as turning to evil, kind of flipping a switch and no longer being good. It's really about being thrown out is this sense of fall."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1637.39,"end":1648.75,"speaker":"Fr Stephen De Young","text":"Right, right. So there are actions taken. Those actions have consequences. One of those is a falling, of being cast out in expulsion."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1649.23,"end":1649.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1652.75,"end":1656.43,"speaker":"Fr Stephen De Young","text":"A removal, and then that in turn has consequences."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1657.15,"end":1659.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1661.96,"end":1686.05,"speaker":"Fr Stephen De Young","text":"Yeah, we've got the heavy weight of St. Augustine in Western culture weighing on us with this. Right. Where he kind of condensed the three falls. We're going to be talking about these three episodes to just the one we're talking about in this episode. And where this is humanity becoming evil or depraved."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1686.69,"end":1688.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1688.53,"end":1728.61,"speaker":"Fr Stephen De Young","text":"And as we're going to see tonight, that's not what this story is about. And as we go through the next couple of episodes, we'll see how other elements of that come into play in the. In the biblical narrative. But, yeah, so, and, and we're also, especially as modern Western folks, very much in the sort of good guy, bad guy mode of interpreting reality."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1728.85,"end":1753.4,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, yeah. And we should also say, even though we are dividing this into three discrete episodes on death, sin and demonic domination, there's kind of a lot of overlap that happens between these things. So we can talk about them as separate events, we can talk about them as separate concepts, but they. They're really intimately connected, as I think will become apparent as we move through this progression."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1753.4,"end":1764.56,"speaker":"Fr Stephen De Young","text":"Right, right. And yeah, we have this. We have this good guy, bad guy thing. So it's, you know, Adam and Eve are good people. Then they become bad people."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1764.64,"end":1766.35,"speaker":"Fr Andrew Stephen Damick","text":"Then they're bad. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1766.35,"end":1769.71,"speaker":"Fr Stephen De Young","text":"And then Kane, who we'll talk more about next time, he's a bad person."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1770.75,"end":1771.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1771.11,"end":1778.03,"speaker":"Fr Stephen De Young","text":"There's good angels and bad angels. Right. And there's the cowboy with the white hat and the cowboy with the black hat."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1779.07,"end":1779.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1779.39,"end":1781.47,"speaker":"Fr Stephen De Young","text":"And then Johnny Cash shows up and you get all confused."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1781.63,"end":1781.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1781.95,"end":1795.07,"speaker":"Fr Stephen De Young","text":"And good guys wear black, so. And. Yeah. And. And there aren't, like, good people and bad people. There aren't good guys and bad guys. There's just a bunch of guys."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1796.19,"end":1797.31,"speaker":"Fr Andrew Stephen Damick","text":"It's all just dudes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1797.39,"end":1801.87,"speaker":"Fr Stephen De Young","text":"They do good things and they do bad things. But more on that in our third half."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1802.11,"end":1803.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, indeed."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1804.19,"end":1817.39,"speaker":"Fr Stephen De Young","text":"So. Yeah. So accepting that. Right. So the creation of the angelic beings happens somewhere in Genesis 1."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1818.03,"end":1818.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1820.16,"end":1822,"speaker":"Fr Stephen De Young","text":"Don't really feel a need to plant a flag."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1822.48,"end":1822.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1823.2,"end":1841.36,"speaker":"Fr Stephen De Young","text":"But somewhere in there. And it's been commented on frequently. Right. We have sort of. Well, if you. If you're a modern biblical scholar, you say we have two conflicting stories of creation in Genesis 1 and 2."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1841.6,"end":1842.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1843.84,"end":1844.24,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1844.86,"end":1849.34,"speaker":"Fr Andrew Stephen Damick","text":"Or maybe the people who put these things together thought they went together."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1849.98,"end":1881.38,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I mean, maybe it's been circulating in the way it currently is for, like, thousands of years now, and nobody's had massive problems with it. But anyway, so the usual way in which interpreters who are attentive to such things deal with this is that they talk about how. Right. We're told at the end of Genesis 1 that humanity is created. God creates the male and female. Right. And that's sort of it. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1881.38,"end":1882.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1882.34,"end":1894.42,"speaker":"Fr Stephen De Young","text":"And then in Genesis 2, it's like we zoom in. Now, note to our zoomer listeners, when I say zoom in, I do not mean connect a zoom call."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1895.54,"end":1897.66,"speaker":"Fr Andrew Stephen Damick","text":"No. This is like blood lenses."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1897.9,"end":1918.7,"speaker":"Fr Stephen De Young","text":"Yes. Back in the day when we had cameras that were not part of our phones, there was a lens on that camera that you would have to focus and which you could. Some of them were zoom lenses that would allow you to make things look larger that were far in the distance. And I'm using zoom in in that sense."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1919.5,"end":1920.3,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, dad."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1920.3,"end":1933.24,"speaker":"Fr Stephen De Young","text":"Antiquated technology. So Genesis 2 is sort of zooming in on the creation of humanity and telling that story in more detail."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1933.96,"end":1934.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1935.96,"end":1955.16,"speaker":"Fr Stephen De Young","text":"So as we're about to say that the fall of the devil, the devil being cast down, happens in Genesis 3. We are not disagreeing with those fathers who don't have a separate span of time."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1956.04,"end":1959.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. These are just different angles for trying to understand what's going on."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1959.8,"end":1994.37,"speaker":"Fr Stephen De Young","text":"Right. We're saying that just like Genesis 2, zooms in on the creation of man. Genesis 3 is zooming in on. On this first fall of humanity and on the fall of the devil, which may very well have happened back during Genesis 1, the same way the creation of humanity is described in Genesis 1 originally. So we're not disagreeing there. It's not that. Well, the Fathers say they fell originally, and those priests on Lord of Spirits are saying it happened four days later. That's not a thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1995.41,"end":1995.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":1997.41,"end":2024.11,"speaker":"Fr Stephen De Young","text":"But so this is. And that again. Right. I know we belabored this back in the day, contrabilton, that the devil falls here not sometime before creation, but as we mentioned at that time, St. Andrew of Caesarea sort of lays this out in his commentary on Revelation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2024.59,"end":2028.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which talks about the casting out of the devil."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2029.07,"end":2043.56,"speaker":"Fr Stephen De Young","text":"Right. Because he gets to Revelation 12 and we're going to talk about Revelation 12 more here in a few minutes. But he gets to Revelation 12 that talks about the dragon and a third of the stars and Saint Michael casting him down."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2043.88,"end":2045.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2045.2,"end":2094.93,"speaker":"Fr Stephen De Young","text":"And we're going to talk about the other issue he deals with, but he talks about when the fall of the devil happened. And we're going to quote from. We talked before. I've already pushed it at people who have pointed out to me that it's very expensive, but what can you do? Ancient Faith's own Dr. Jeanne Constantino, her dissertation was on St. Andrew Caesarea's commentary and on the reception history of the Book of Revelation in the Eastern churches in general. And it's sort of magisterial on that topic. And in the process, she also made her own translation of St. Andrew's Commentary on Revelation that's included in the Fathers of the Church series from. I think Catholic University of America publishes that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2094.93,"end":2097.61,"speaker":"Fr Andrew Stephen Damick","text":"But that sounds. Right. One of those blue books."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2098.17,"end":2100.97,"speaker":"Fr Stephen De Young","text":"So. Yeah. So just to keep it in the ancient faith family."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2101.21,"end":2129.34,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Oh, yeah. So here's what St. Andrew of Caesarea says about this quote. One must know that as it has been given to the Fathers after the creation of the perceptible world, this one had been cast down on account of his pride and envy. He to whom had first been entrusted the aerial authority, just as the apostle said, end quote. So that's St. Andrew of Caesarea saying it happens."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2130.14,"end":2138.86,"speaker":"Fr Stephen De Young","text":"Last bit about being entrusted the aerial authority, as the apostle said, is talking about St. Paul referring to him as the prince and power of the air."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2139.38,"end":2152.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right. So I mean, there's. And then, of course, then you have. There's a few other scriptural references to the devil being Cast out or falling. Right, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2152.14,"end":2154.02,"speaker":"Fr Stephen De Young","text":"Aside from Genesis 3 and."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2154.18,"end":2197.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So you've got. In Isaiah 14, this is. And we've referenced this before, this is the. The biblical account of what's often called the succession myth in studies of mythology. Verses 13 through 15, you know, the prophet or God, I think, speaking to the devil. Right. Saying you said in your heart, I will ascend to heaven above the stars of God. I will set my throne on high. I will sit on the mount of assembly in the far reaches of the north. I will ascend above the heights of the clouds. I will make myself like the most High. But you are brought down to Sheol, to the far reaches of the pit. So it's ambition fall. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2198.05,"end":2209.41,"speaker":"Fr Stephen De Young","text":"And. And pegging the mount of assembly. Right. The mountain where the divine council meets as being in the far reaches of the north is hammering home that this is speaking about baal."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2209.81,"end":2212.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Identifying BAAL as the devil, in."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2212.09,"end":2215.49,"speaker":"Fr Stephen De Young","text":"Particular on Mount Zaphone, which literally means the mountain of the north."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2217.49,"end":2282.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So another one then is in Ezekiel, chapter 28. This is verses 13 through 17. And this one speaks about the devil specifically as a. A throne guardian in paradise. Right. So Starting with verse 13, you were in Eden, the garden of God. Every precious stone was your coverings. Sardius, topaz and diamond, beryl, onyx and Jasper, sapphire, emerald and carbuncle. And crafted in gold were your settings and your engravings on the day that you were created. They were prepared. You were an anointed guardian cherub. I placed you. You were on the holy mountain of God, in the midst of the stones of fire, you walked. You were blameless in your ways from the day you were created till unrighteousness was found in you in the abundance of your trade. You were filled with violence in your midst, and you sinned. So I cast you as a profane thing from the mountain of God, and I destroyed you, O guardian Cherub, from the midst of the stones of fire. Your heart was proud because of your beauty. You corrupted your wisdom for the sake of your splendor. I cast you to the ground. I exposed you before kings to feast their eyes on you. So you've got God throwing him out from Eden, from the mountain of God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2283.59,"end":2298.71,"speaker":"Fr Stephen De Young","text":"Right, Right. And, yeah. And so if he's still walking on high in Eden. Right. This is again pointing us to Genesis 3 is the place where this happens, Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2299.35,"end":2299.83,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2299.83,"end":2329.04,"speaker":"Fr Stephen De Young","text":"And so that brings us sort of back to Revelation 12 and St. Andrew of Caesarea's commentary on it, because what he's trying to deal with. In Revelation 12. Particularly in Revelation 12, verses 7 and 8, it describes St. Michael throwing the dragon out of heaven with his angels. But it describes that right after it describes the birth of Christ."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2330.48,"end":2331.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2331.76,"end":2354.92,"speaker":"Fr Stephen De Young","text":"Which. And so that's why he says, you know. Well, we know that he was cast down after the creation of the world. Right. In Genesis 3, we've received that from the Fathers, they received it from the apostles and from Christ. So we know that's true. So what's going on here? Right. How is this happening after."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2355.4,"end":2385.21,"speaker":"Fr Andrew Stephen Damick","text":"After the birth of Christ? Right. Yeah, yeah. I mean, so you've got two options. You've either got the devil, who is one being, falling two times, which, again, strongly shows that position, would strongly show that this isn't about turning to evil, it's about being thrown out. Right. Or there's the possibility that these are two different beings entirely. One is cast out in Genesis 3, and then another one is cast out after the birth of Christ."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2385.53,"end":2395.76,"speaker":"Fr Stephen De Young","text":"Right. Because St. Andrew connects this after the birth of Christ to Luke 10:18, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2395.76,"end":2398.32,"speaker":"Fr Andrew Stephen Damick","text":"Where Christ says, I saw Satan fall like lightning."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2398.4,"end":2446.15,"speaker":"Fr Stephen De Young","text":"I saw Satan fall like lightning. That's during his ministry. Right. He's describing what's going on during his ministry. He says, that's the other one. So you can also read. And this is part of why St. Andrew describes these two options. It talks about the dragon. The literal wording in Greek is the dragon who is the devil, and Satan. Well, there's. There's two ways to read that. And. Right. You could say the dragon who is the devil and Satan. Right. As in all three of those are names for the same critter. Right. Or you can read that as the dragon who is the devil, and Satan. This other guy."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2446.95,"end":2447.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2448.23,"end":2484.57,"speaker":"Fr Stephen De Young","text":"And so because Luke 10 specifically mentions Satan. Right. It's possible to read it as, okay, the devil falls in Genesis 3, and then Satan is cast out of heaven. The Satan who's still sort of hanging around in God's throne room in the book of Job, is cast down during Christ's ministry. You can read it that way. That's not how St. Andrew reads it. St. Andrew reads it as they're the same being and he falls in two different senses. Yeah, that's how St. Andrew understands it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2484.65,"end":2485.77,"speaker":"Fr Andrew Stephen Damick","text":"Right. Thrown out."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2486.49,"end":2506.4,"speaker":"Fr Stephen De Young","text":"This is one of those things. We've kind of talked about this a little, that there are sort of a number of devils, figures in Second Temple literature and who are referenced in. In the canonical scriptures. And, you know, you can let, you know, the devil, Satan."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2508.8,"end":2509.56,"speaker":"Fr Andrew Stephen Damick","text":"Azazel."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2509.56,"end":2557.4,"speaker":"Fr Stephen De Young","text":"Azazel. Belial, Mastema, Mastima, and then there's other forms of names like Satana L and stuff, but Samael. So you have these sort of different figures, but nobody says none of those sources say that there are six different beings. Yeah, they always have one or two beings, like two at most. And then they position those names around those beings in different ways. Right. So there are some things that have a zazel being the serpent in the Garden of Eden and the being we're going to talk about next time in terms of the daughter of man, but then maybe have Satan as a different being."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2558.44,"end":2558.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2559.48,"end":2569.48,"speaker":"Fr Stephen De Young","text":"So there's. There's all these different. So and as we've talked about before, the demonic by nature are beings of sort of chaos and destruction and lies."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2569.64,"end":2574.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The fact that it's not easy to kind of lay it all out should not be surprising in any way."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2575.47,"end":2615.08,"speaker":"Fr Stephen De Young","text":"Right, right. So now that we've talked about those other places, sort of back to Genesis 3, and we've talked about this in the 5ish falls of the angels way back when. But the devil comes and he tempts humanity to join him sort of in his rebellion. And we're going to expand what rebellion means in this context here in a minute. And then in response, he's thrown down. Now, a lot of people read this as if it were a Rudyard Kipling just so story. Right. Here's how the devil. Here's how the snake lost his legs. Like snakes used to have legs. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2615.16,"end":2631.81,"speaker":"Fr Andrew Stephen Damick","text":"I think I've seen like children's books, illustrated children's books. I don't. I'm reaching way deep down into the depths of my half subconscious. But I really feel like that's. I feel like that's true that I saw kids books with snakes with legs. And then at the end you see no legs on them."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2632.69,"end":2690.79,"speaker":"Fr Stephen De Young","text":"Yeah, this is how brontosaurus has turned into snakes. No, that's not what it's talking about. So we talked before about the cherubim connection in Ezekiel that we just heard. The throne guardian, seraph being the Egyptian word for serpent, the seraphim being sort of the same role but in an Egyptian context, as opposed to a Mesopotamian context and all of that kind of thing. But the word when he's thrown down to crawl on the ground. Right. The word there aretz we've talked about before. That word is used relatively frequently, not just in the Old Testament, but in the cognate word in other Semitic languages to refer to the underworld. Right. So this is him being cast down to the underworld. And we've also talked about how. And this is something that always needs to be reiterated. Ancient people weren't stupid."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2692.23,"end":2692.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2693.19,"end":2698.71,"speaker":"Fr Stephen De Young","text":"I think because we have all our technology and stuff, that people of the ancient world were just dumb."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2699.11,"end":2703.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And computers and science and rockets."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2704.38,"end":2729.18,"speaker":"Fr Stephen De Young","text":"Yeah. So this is not the case. And unless you're a person who could build their own iPhone from scratch, you don't have anything to brag about over exit people in terms of technology. But the point being in this case, that they didn't think that snakes ate dirt."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2730.13,"end":2744.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's a symbolic way of describing him. Like, you know, we see that Adam is made out of dust and we see now he's cursed to return to dust. And if the snake is eating dust."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2744.85,"end":2745.97,"speaker":"Fr Stephen De Young","text":"It'S the same word."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2746.29,"end":2778.06,"speaker":"Fr Andrew Stephen Damick","text":"Right? Exactly. It's essentially versus apart. Right, right, right. It's now the hellmouth. Now it's the underworld that swallows up the dead. Right. Which is, you know, depicted in a lot of iconography, this massive reptilian mouth. That is the place where the dead go. And of course, you know, in the resurrection crisis, pulling up out of there. But yeah. And of course, then you've got Hebrews 2:14, which explicitly says that the devil is the one who holds the power of death."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2778.14,"end":2778.94,"speaker":"Fr Stephen De Young","text":"Or was."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2779.34,"end":2780.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, was. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2780.26,"end":2799,"speaker":"Fr Stephen De Young","text":"Right. By that point. But yes. Yeah. And so that's. That's. He's hurled down. He gets sort of, you know, you get to dwell among the dead. Right. You're going to Sheol, as we've talked about with Sheol. Not a happy place. Not a fun place to be."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2799,"end":2799.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2799.88,"end":2838.26,"speaker":"Fr Stephen De Young","text":"They don't have good parties there. And it's not sort of pleasant. Again, this is. Gotta get that Milton right out of your head, right? This idea that it's some kind of kingdom that the devil rules or something, that he'd rather rule in hell than serve in heaven. And da, da, da, da, da, da, da. If you're a Puritan, you really don't like kings and people with the ambition to be kings. But the reality is that the devil is hurled there. The devil is imprisoned there just as much as everybody else."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2839.22,"end":2840.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2842.03,"end":2857.31,"speaker":"Fr Stephen De Young","text":"Which is part of why the devil is depicted the way he is. In, for example, the icon of the harrowing of Hades. Right. You notice he doesn't have, like a crown or a weapon."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2857.63,"end":2858.91,"speaker":"Fr Andrew Stephen Damick","text":"He's not sitting on a throne."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2859.31,"end":2866.43,"speaker":"Fr Stephen De Young","text":"Not sitting on a throne. It's not like he had a fight with Christ and lost. Right. He's like an old naked man."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2867.13,"end":2886.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just get sort of flattened. Yeah. It's very different than the image that you tend to have from pagan literature where you, you know, like there's the idea that Hades is the God who rules and is in charge of, you know, and has people, you know, of the underworld. It's, it's, it's pretty pathetic by comparison."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2886.89,"end":2904.98,"speaker":"Fr Stephen De Young","text":"And if you compare him, if you look at an icon of the herring of Hades, compare the way he's depicted in Hades to the way the Old Testament saints are depicted in Hades, and you'll notice something unlike him. They all have nice clothes. Something to think about."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2905.3,"end":2907.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2907.78,"end":2914.34,"speaker":"Fr Stephen De Young","text":"But he's actually worse off than them, than the humans in Hades, right? Yeah, he's not in charge."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2915.22,"end":2915.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":2917.62,"end":3023.67,"speaker":"Fr Stephen De Young","text":"So the last thing then that we want to talk about here in the first half is, as I mentioned, sort of what is the nature of the devil's rebellion? Because again, our friend Milton, right, we have this idea that, well, and not that this I can't totally blame on Milton because this, of course, ultimately comes from the succession myth, right? From the pro devil propaganda of the neighboring nations, right, which uniformly says that no, this guy, this storm God, whether it's BAAL or Zeus or whoever else, no, he successfully went and killed, slash, defeated, displaced the most high God and set himself up as the most high God, right? They present him as staging this successful revolution, right? To make himself king of the gods. Right? And so I'll be fair to Milton because I've been picking on him, right? I'm thinking this is where he got his understanding of what the devil's rebellion is, right? But we don't need to buy into his propaganda because the reality is, if you think about it for very long, and I've said this to people when talking about it in person, I've just looked at it first and said, okay, like the devil, you are a creature. You are going to make God not be God anymore and make yourself God and get his, I guess, God powers or whatever. However you're looking at this, how do you do that? What is step one of your plan?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3024.31,"end":3079.99,"speaker":"Fr Andrew Stephen Damick","text":"Right? And, and it, you know, I think that that, that comes. The reason why the pagan story works as a story is because their most high God is inherently way less, right, Than, than Yahweh, the God of Israel, Father, Son and Holy Spirit, right? Like their image of what the most high God is is that he's sort of the biggest and baddest of them, right? Rather than the one who is outside of all things and the creator of all things, the Lord of heaven and Earth, which Is why you get this polemic throughout the scriptures about our God being all those things. He's in heaven and earth. He's above all gods. No one's like him at all. But the most high God in pagan mythology, almost. Pick whichever one you like, as big and bad as he is, he's. They don't even claim that he's like the Father, Son and Holy Spirit."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3080.47,"end":3090.71,"speaker":"Fr Stephen De Young","text":"Yeah. And usually maybe. Yeah, usually. The current most high God, not only did he overthrow the last guy, but he's usually at least the third."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3091.27,"end":3092.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3092.59,"end":3103.99,"speaker":"Fr Stephen De Young","text":"Most high God. Going back, there's usually been several successions and these gods come into being at some point and then can die and be replaced and succeeded by others."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3105.07,"end":3105.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3105.39,"end":3125.39,"speaker":"Fr Stephen De Young","text":"Yes. And so these are not. These are not remotely the true God. Because if we're talking about actual God, the Holy Trinity, that dog don't hunt. It's not possible. There's not a way to do it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3125.55,"end":3128.35,"speaker":"Fr Andrew Stephen Damick","text":"Kick God off. It's like saying, I'm gonna knock this guy out."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3128.67,"end":3135.23,"speaker":"Fr Stephen De Young","text":"Yeah. You can't be like Dr. Doom on Battleworld and build your harness and suck Galactus powers."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3136.82,"end":3140.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. Galactus the eater of worlds. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3140.18,"end":3140.74,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3141.46,"end":3142.26,"speaker":"Fr Andrew Stephen Damick","text":"Who's the silver?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3142.26,"end":3144.22,"speaker":"Fr Stephen De Young","text":"Still got owned by beyond her anyway, So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3144.22,"end":3150.18,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's true. I remember that. I remember. What was that? That. Oh, secret war."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3150.34,"end":3151.9,"speaker":"Fr Stephen De Young","text":"It was supposed to be a secret, so I'm."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3151.9,"end":3162.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Secret wars. Yeah. Back in. I think that was in the late 80s, early 90s maybe, wasn't it? Yeah. Boy. Boy. Wow. That's a long time ago. Deep old cuts here, everybody."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3162.66,"end":3185.03,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So you can. You can. If your step one, when I asked that question was build a power. Cosmic siphon. Not gonna work for you. Right. So this isn't a possible thing. Right, Right. And it's not like. Well, maybe the devil thought it was a possible thing. Like, for how many fractions of a second would he have thought that?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3185.27,"end":3185.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3185.99,"end":3187.67,"speaker":"Fr Stephen De Young","text":"I mean, cosmic intelligence, remember?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3187.91,"end":3200.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You get. I mean, you get this language in scripture where it says, you know, you said in your heart, I will sit on the mount of assembly and I will be above the stars of God. I will set my throne on high. But."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3203.21,"end":3204.89,"speaker":"Fr Stephen De Young","text":"You notice that's not talking about God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3205.29,"end":3205.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3205.89,"end":3208.49,"speaker":"Fr Stephen De Young","text":"It's talking about the other angels, the other creatures."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3208.81,"end":3257.9,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. I'll make myself like the Most High. So he doesn't even say, I'm going to really knock the Most High off his throne. It's just sort of I will be like him, you know? But no, no. Right. Yeah. Right. You can't you can't actually do that. I mean, you get, I mean we, we talked about this. I don't remember. I think it is way, way early on. We talked about St. Gregory the Great talking about how it is that the, the demons, you know, dethrone God and he says that they dethrone him in their minds, essentially meaning that they decide they're not going to obey him anymore. That they're putting themselves on the throne of their own minds is the idea. I mean, it doesn't remove God from his throne. It's just sort of a choice about the way you're going to exist."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3258.7,"end":3261.58,"speaker":"Fr Stephen De Young","text":"And this is why we did part of that recap that we did."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3262.22,"end":3262.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3265.5,"end":3306.41,"speaker":"Fr Stephen De Young","text":"Because remember, Eden is a temple, right. Paradise is a temple in this sense. Adam is a priest in this temple. So what is the devil trying to do when he talks to Eve? He's trying to get humanity to be faithful to him and to serve him and essentially to worship him, even consisting of food. Right? Worship him in the temple of God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3306.81,"end":3312.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's trying to set up idolatry and usurp that temple in the world."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3313.29,"end":3319.13,"speaker":"Fr Stephen De Young","text":"Which you can do because humans can do the wrong thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3319.53,"end":3321.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3322.1,"end":3348.32,"speaker":"Fr Stephen De Young","text":"And so what he's trying to do, he can't destroy God. Yeah, right. That's not a thing you can do. But he can try to destroy God's other creations. And he chooses humans for a particular reason. Because this word keeps coming up, right? We heard it in St. Andrew, we heard it in some of the Old Testament passages, this word envy."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3348.96,"end":3351.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That the devil fell out of envy."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3352.56,"end":3396.27,"speaker":"Fr Stephen De Young","text":"That his pride is connected particularly to envy. Right. It's not just pride in a general sense, but connected particularly to envy. So envy of who and about what? Well, this is envy of humanity because humanity already had. And this is what we're going to be talking about for most of the rest of tonight already had destiny for which he was created by God. That is a destiny that the angelic beings, even the high ranking ones, did not share. Right. And so the devil, as glorious a creature as he was, was going to end up less glorious than humanity."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3398.35,"end":3401.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so he, he wants that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3401.88,"end":3410.6,"speaker":"Fr Stephen De Young","text":"And out of envy and jealousy and pride, because he has no way to do anything to God and he has no way to change it so that he will have that destiny."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3410.68,"end":3411.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3411.96,"end":3416.76,"speaker":"Fr Stephen De Young","text":"He chooses to try to destroy the human creatures who do."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3417.24,"end":3423.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that they don't get there and that they follow him into his misery."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3423.88,"end":3456.62,"speaker":"Fr Stephen De Young","text":"Right. Because it loves company. So you should start a company and make Misery. Anyway, and so this, when we talk about this destiny we're talking about. So when you read, for example, Saint Dionysus, the Areopagites, celestial hierarchies, Right. We've talked about this before on the show. The angels don't sort of have species, Right. You're talking about seraphim, cherubim and stuff, because they don't reproduce. Right? They don't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3456.86,"end":3457.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3459.02,"end":3574.65,"speaker":"Fr Stephen De Young","text":"So in a certain sense, every angelic being is unique, but in another sense, they have these ranks, right. These orders of angelic beings. And those orders are particular roles they play. Right. Particular jobs they do in terms of God's rule and administration of the cosmos. He doesn't need them to do it any more than he needs humans, but he created them and us out of love. Right. To share his divine life with and to share his rule with. And so what you find in Saint Dionysius is that depending on that role, where they stand in that hierarchy, what role they have, what order they are in, they participate in the grace of God, in God's actions in humanity. And that's what separates sort of the ranks or orders from each other. They participate to a greater or lesser degree in his energies, in his grace and his power. And so they participate in God's grace in a way that's not totally dissimilar from what we talk about when we're talking about theosis in humans. When we talk about humans experiencing salvation, experiencing theosis, we talk about them drawing closer to God, participating in God's grace, participating in his energies, which are his work in the world, what he is doing in the world. Humans participate in it. But there's a major difference in that. The angels, the angelic beings, participate in God's grace and his power in a static way based on their role."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3576.81,"end":3587.7,"speaker":"Fr Andrew Stephen Damick","text":"They're made for this, they participate in God for this, and they're not going to get promoted or move up the. Like. Yeah, you know. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3587.7,"end":3595.94,"speaker":"Fr Stephen De Young","text":"You don't start out as an angel and then, you know, you go and help George Bailey and get your wings and then, you know, you sort of rank up."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3598.02,"end":3598.5,"speaker":"Fr Andrew Stephen Damick","text":"Someday."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3598.5,"end":3598.9,"speaker":"Fr Stephen De Young","text":"I can be."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3598.9,"end":3601.54,"speaker":"Fr Andrew Stephen Damick","text":"I want to be a dominion. Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3601.78,"end":3616.01,"speaker":"Fr Stephen De Young","text":"You did a great job, you know, as a cherubim. So we're making you a seraphim. Right. That's not. That's not how it works. Right. So there's this. It's static. Right. And so the same was true of the devil before his fall."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3616.57,"end":3616.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3616.97,"end":3627.57,"speaker":"Fr Stephen De Young","text":"This is what prompts this envy and this jealousy. As glorious as he was Right. There was no kind of upward mobility. Whereas I say."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3627.57,"end":3630.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He could see humanity was going to surpass him."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3630.57,"end":3640.73,"speaker":"Fr Stephen De Young","text":"Yes. Yes. Whereas in humanity. And again, this is what we're going to be talking about in our next two halves. Right. But humans do progress."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3641.21,"end":3647.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, here's the big reason why, because the Son of God became man."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3648.81,"end":3649.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3649.93,"end":3651.77,"speaker":"Fr Andrew Stephen Damick","text":"It's all aiming at the Incarnation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3652.41,"end":3662.34,"speaker":"Fr Stephen De Young","text":"The divine second person of the Holy Trinity took upon himself our human nature. He did not take upon himself a any angelic nature."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3662.9,"end":3663.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3664.26,"end":3673.06,"speaker":"Fr Stephen De Young","text":"And so. Yes. And so as I've now said a few times, that's where we're going now with the rest of the episode."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3673.3,"end":3677.46,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we're going to take our first break and we'll be right back in a moment."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3678.18,"end":3694.43,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3699.63,"end":3743.44,"speaker":"Fr Stephen De Young","text":"We talk about prayer, fasting and almsgiving as the three spiritual pillars of the Orthodox faith. But the sad truth is that while we spend a lot of time in the church talking about prayer and fasting, we devote relatively little time to talking about almsgiving. Money. What does that have to do with the gospel? The Orthodox Christian Leadership Initiative is pleased to announce the sixth annual Orthodox Advanced Leadership Conference, and this year's theme is money. The Gospel changes everything. Parish leaders and emerging leaders among the clergy and laity who serve the local parish, diocese or Orthodox nonprofits are encouraged."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3743.44,"end":3746.28,"speaker":"Fr Andrew Stephen Damick","text":"To attend either in person or online."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3747.16,"end":3749.32,"speaker":"Announcer","text":"You can learn more information about this."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3749.32,"end":3762.12,"speaker":"Fr Stephen De Young","text":"September 16 to 18 conference by going to orthodoxservantleaders.com that's orthodoxservantleaders.com we have to."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3762.12,"end":3768.57,"speaker":"Fr Andrew Stephen Damick","text":"Choose to recover the basic foundational understanding of the place of money and salvation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3769.05,"end":3773.05,"speaker":"Fr Stephen De Young","text":"This has been a public service announcement of Ancient Faith Radio."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3779.45,"end":3795.58,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-855-AF radio."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3796.7,"end":3875.17,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. This is the second half of the show, and it's where we begin to take your call. So please give us a ring at 855-AF-RADIO. Again, that's 855-237-2346. But before we get back to death and all that cheerful stuff, you might have heard that Ancient Faith Ministries is in the process of looking for its next CEO. Also known as my boss at Ancient Faith, John Maddox is retiring in a year, and AFM is accepting applications through Friday, July 15th for his successor as CEO. Could you be the next CEO of Ancient Faith Ministries or do you know someone who could be? No media experience is required. It is an executive leadership role. You can see the job description@ancientfaith.com CEO search. Again, that's ancientfaith.com CEO search. You can apply by sending your resume and a cover letter describing your interest and your goals and three references to apply@ancientfaith.com the deadline is Friday, July 15th. So snap to it. You could be my boss. You could order me around. It could be amazing. It's true. I wasn't talking to you, Father Stephen, so just."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3875.17,"end":3878.93,"speaker":"Fr Stephen De Young","text":"I know also you're married, and no man can serve two masters."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3879.09,"end":3900.07,"speaker":"Fr Andrew Stephen Damick","text":"That's very true. It's true. So, all right, well, Death. Yeah, here we are. Second half, Right. I mean, this is a very cheery episode. I know. How many episodes do we have about demons and death and the underworld and hell and all this kind of stuff?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3901.27,"end":3913.84,"speaker":"Fr Stephen De Young","text":"We're either morbid or, like super metal. One of the two, probably more morbid. We're probably like an old tones on tail cassette tape. That's probably the level we're at."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3914.08,"end":3922.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's okay. I'm okay with that. So, all right, well, Death. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3924.16,"end":3929.68,"speaker":"Fr Stephen De Young","text":"Right. So before we get to death, I mean, death is coming, right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3930.32,"end":3932.16,"speaker":"Fr Andrew Stephen Damick","text":"It will take us all. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3934.56,"end":3935.52,"speaker":"Fr Stephen De Young","text":"When the man comes around."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3936.96,"end":3939.44,"speaker":"Fr Andrew Stephen Damick","text":"Second Johnny Cash reference for the night. That's good."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":3942.64,"end":4005.53,"speaker":"Fr Stephen De Young","text":"But, you know, first, we're talking about the expulsion from paradise, right? So paradise, as we've talked about in previous episodes, is a place where God is. It is this sort of walled garden is how it's depicted. And humanity is, in Genesis 3, expelled from it. So we talked about the devil being sort of cast into the underworld. Humanity is expelled out into this present world as the liturgy of Saint Basil the Great describes it. And so the first question is, why? Right? So there's sort of, I'll just say, nonsense readings of this, right? That are. Well, you know, God made this one rule and they broke the rule, and so he got mad and so he threw him out of his house."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4006.25,"end":4008.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4011.21,"end":4044.15,"speaker":"Fr Stephen De Young","text":"There's just sort of a punishment, right? Just sort of like, you know, you're gonna have to go make it on your own now, kid. Right. Not under my roof. And, you know, not only is any approach like that sort of anthropomorphizing God in the worst kind of way. But it fails to see how this story becomes sort of paradigmatic as a pattern for the rest of the Old Testament."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4044.71,"end":4045.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4045.19,"end":4105.7,"speaker":"Fr Stephen De Young","text":"And so we've talked about before in terms of talking about the presence of God in the tabernacle, in the temple. Right. And this, of course, as we've been saying, applies equally to paradise, that God is a consuming fire. And what Hebrews means by that is that God's holiness, his presence, his holiness consumes that which is sinful, that which is corrupt, that which is wicked. It burns it away and consumes it and destroys it. And so to come into the presence of God, to be in the presence of God, means that either you will be destroyed or whatever is impure, whatever is wicked, whatever is unworthy in you, will get burned away."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4106.5,"end":4106.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4107.54,"end":4146.12,"speaker":"Fr Stephen De Young","text":"And so obviously, the second of those is the better option. But after partaking of the tree of knowledge of good and evil, Adam and Eve, of course, had already known good. They now come to know evil. So they've now entered into a different sort of mode of life. And that mode of life means that if they remain in paradise, they will be destroyed. Right. They will suffer the same fate as the devil."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4147.16,"end":4150,"speaker":"Fr Andrew Stephen Damick","text":"Right. In terms thrown out the."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4150,"end":4155.08,"speaker":"Fr Stephen De Young","text":"The underworld. Right. They will be like the demons if they're immortal and wicked."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4155.56,"end":4155.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4156.04,"end":4176.21,"speaker":"Fr Stephen De Young","text":"That's what. That's what a demon is. Right. And so this is the whole dialogue that God has in Genesis 3, where he says, it is not good that man should remain this way forever. Right? We need to cut him off from the tree of life so that he will not live forever. That's why he's expelled from paradise, which."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4176.21,"end":4195.25,"speaker":"Fr Andrew Stephen Damick","text":"Some people take as being, okay, well, you've had enough, so you can't have any more now because you were bad. But really, it's about a change in man's mode of living so that he does not live forever, as you said, he has to be removed from the tree of life so he doesn't persist in evil forever and be demonic."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4195.84,"end":4203.6,"speaker":"Fr Stephen De Young","text":"Right. In that state. So this is. This is part of the remedy. Right? So rather than death, there is exile."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4204.24,"end":4204.64,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4205.28,"end":4258.92,"speaker":"Fr Stephen De Young","text":"That's the other option, right, is that humanity is removed from the presence of God, which has now become dangerous to him. Right. And this. We're gonna see this play out in two weeks when we talk about the flood. We're gonna see this play out two weeks after that when. When we talk about the Tower of Babel. This plays out in terms of the entire Torah being all of the conditions and all of the Means of purification to allow humanity to draw close at least a tiny part of humanity to draw close again to the presence of God. This is going to be what goes on with the destruction of the northern kingdom of Israel, the exile of the southern kingdom of Judah. This is going to play out through the whole Old Testament, right? Before. This is one of the problems that is going to be solved by Christ in the New Testament."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4258.92,"end":4259.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4260.36,"end":4279.33,"speaker":"Fr Stephen De Young","text":"But so this is, this is intimately connected. This is not just, again, a one off story. Right. And not communicating how people became bad, but how they became mortal. Right. Without being able to partake of the tree of life, humanity will not live forever."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4279.73,"end":4280.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4280.09,"end":4281.65,"speaker":"Fr Stephen De Young","text":"And that's a good thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4281.73,"end":4296.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. So, you know, in this case, man's fall, and we're going to talk about meaning, several things, but in this case, man's fall means mortality. He's cast out from immortality, he's cast out from the tree of life, right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4296.73,"end":4429.9,"speaker":"Fr Stephen De Young","text":"And into this present world, which is characterized by corruption and death. And we've mentioned before this distinction that Saint John of Damascus makes between physical death and spiritual death. And we want to revisit that here in the second half in a little more detail and show how the parts of what he's saying relate and why it's important. Because sometimes, well, not just sometimes, there's a way of reading Saint John of Damascus, right. The way Thomas Aquinas read him, basically. And certain elements of, like the, the first part of Saint John of Damascus's fount of wisdom is essentially his commentary on Aristotle's categories. So there, there are elements of the way he writes that invite this reading. I don't think ultimately it's a correct reading, but you could see why people would read him this way, especially someone like Thomas Aquinas would read him this way. And that's to read St. John as essentially making a series of logical distinctions about theological terms. And this is sort of the negative tendency that's all too prevalent in our age, even among a lot of orthodox scholars and folks where there's this danger of theology getting reduced to this kind of weird symbolic logic where it's all about getting the right terms with the right definitions and plugging them in in the right order, right. To construct the correct statements. That's what makes you orthodox or correct theology is that you have the right. And so it's easy to go into St. John and say, okay, well, he distinguishes physical death and spiritual death. So this is the definition of physical death, this is the definition of spiritual death. And not really enter into what he's getting at and what it means and the actual theological import of it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4430.06,"end":4449.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And on the other hand, of course, you also have, I think, another modernist tendency, which is to treat physical death as being the real death and spiritual death as being a kind of metaphor, like for, you know, a metaphor for becoming bad, maybe, you know."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4449.25,"end":4466.4,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Or worse. Right. Again, if we want to go really, really modernist. Right. They look at this story and it's like, oh, well, God told them in the day they ate of that fruit, they would surely die. And they didn't. So there's a problem in the text. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4466.4,"end":4466.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4467.28,"end":4477.68,"speaker":"Fr Stephen De Young","text":"And so then they'll say, oh, well, you came up with this metaphorical spiritual death to try to solve this glaring problem in the text, neither of which is true. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4478.08,"end":4478.48,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4480.24,"end":4494.68,"speaker":"Fr Stephen De Young","text":"What St. John says. Right. And we're going to start at the level of the logical distinction he makes, but we're going to go beyond that. So the logical distinction he makes is that physical death is the separation of the soul from the body."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4495.8,"end":4496.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4497,"end":4501.4,"speaker":"Fr Stephen De Young","text":"And spiritual death is the separation of the soul from God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4502.68,"end":4503.32,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4504.68,"end":4508.92,"speaker":"Fr Stephen De Young","text":"So that's nicely parallel. You can see how those would both be different types of death."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4509.08,"end":4509.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4510.2,"end":4525.33,"speaker":"Fr Stephen De Young","text":"You can see how somebody would just treat those as propositions to plug into a syllogism somewhere. Right. But we have to dig a little deeper because first of all, we have to talk about what we mean by separation."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4526.37,"end":4538.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, where exactly is God that my soul can be separated from him? So it's now in a place where he's not. Right. That's, you know. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4538.69,"end":4552.91,"speaker":"Fr Stephen De Young","text":"And in physical death, as we've talked about, Right. When you say to someone, well, physical death is the separation of the soul from the body, you don't get a lot of, well, what does that mean? But that's because there's these presuppositions, one of which is that the soul is sort of a thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4553.63,"end":4558.03,"speaker":"Fr Andrew Stephen Damick","text":"You mean it's not like on Ghost with Patrick Swayze?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4558.43,"end":4589.32,"speaker":"Fr Stephen De Young","text":"No, it's a sphere. It's a floating orb. Right. That the soul is. Yeah. That it's like a force ghost or it's a. It's a ball of light or whatever. Right. That sort of comes out of someone's body and floats up into the sky or wherever it floats or, you know, gets eaten by a movie monster to power him up or whatever happens to it. Right. Shang Tsung grabs it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4589.56,"end":4600.82,"speaker":"Fr Andrew Stephen Damick","text":"So wasn't that an episode of Next Generation when they're eating souls? Yeah, right, right. Time traveling Data There we go. Yeah, yeah. I can't remember the title of that episode now, but it was a two part."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4600.98,"end":4602.42,"speaker":"Fr Stephen De Young","text":"It was actually a two parter."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4602.66,"end":4604.86,"speaker":"Fr Andrew Stephen Damick","text":"It was a season cliffhanger and then."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4604.86,"end":4610.14,"speaker":"Fr Stephen De Young","text":"The beginning of next where they went back and met Guinan and who was on earth in the 19th century. And mark Twain."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4610.14,"end":4616.82,"speaker":"Fr Andrew Stephen Damick","text":"And Mark Twain. And Mark Twain. Yeah. And the head of data. The severed head of data and."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4616.82,"end":4621.7,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And they were. I want it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4621.7,"end":4622.74,"speaker":"Fr Andrew Stephen Damick","text":"There's an ophidian."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4623.54,"end":4625.3,"speaker":"Fr Stephen De Young","text":"Well, there's the ophidian cane."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4625.88,"end":4630.52,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right. Oh, someone just said the episode is called Time's Arrow."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4630.68,"end":4632.68,"speaker":"Fr Stephen De Young","text":"Yeah, Part one and two. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4632.76,"end":4634.88,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Nate. Thank you, Nate."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4634.88,"end":4641.48,"speaker":"Fr Stephen De Young","text":"Triolic waves being generated by the. The creatures. That's how they track them, even though they're invisible."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4641.88,"end":4646.04,"speaker":"Fr Andrew Stephen Damick","text":"So, anyways, the point being, that's not how it works. That's not how any of this works."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4646.2,"end":4652.13,"speaker":"Fr Stephen De Young","text":"Yes, yes. Tales from the Crypt, Demonite and Time Zero, both in accurate resolved tonight."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4653.49,"end":4654.53,"speaker":"Fr Andrew Stephen Damick","text":"Good night, everybody."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4657.57,"end":4676.93,"speaker":"Fr Stephen De Young","text":"But, so, as we've talked about, the soul is not a thing. Right. It's not an object. It's not a reified thing. It is the. It is the life of the body. Right. And so when you see a body that is dead, what has changed is that there's no longer life in it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4677.69,"end":4678.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4679.85,"end":4686.05,"speaker":"Fr Stephen De Young","text":"And as a result of not having life in it, it begins to decompose, etc. Pretty much instantly."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4686.05,"end":4686.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4687.69,"end":4700.09,"speaker":"Fr Stephen De Young","text":"But so the life is what we're talking about when we're talking about a soul. And so it is no less problematic to understand. Well, like, what. What is life? Where. Where did the life go? How."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4700.57,"end":4700.97,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4700.97,"end":4776.16,"speaker":"Fr Stephen De Young","text":"Right. That's just as cryptic in terms of what separation means as separating the soul from God is. Neither of those is as clear cut as we might immediately think. So we have to go back. We don't have to go back that far because we're just in Genesis 3, but we can go back a few pages and see that where does the soul come from? When man is created, God fashions him from the dust of the earth, his body from the dust of the earth, and then breathes the breath of life. Right. The breath, the spirit, the life into him. And so the connection between the soul and God is being established there. That the breath of life, the soul, this is portrayed here as the breath of God. So there's a connection between God and life. God is the living God, and that is establishing the connection between that life and the body which it comes to enliven."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4776.88,"end":4805.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I recall, I can't Remember which one now? So forgive me, but I think at least one of the Holy Fathers says in his model for what man is composed of, he says that man is body, soul and holy Spirit. You know, that man as he is made, that God's action within him is part of what it is that he's supposed to be, essentially. That's my understanding of it, anyway. Yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4806.12,"end":4817.25,"speaker":"Fr Stephen De Young","text":"And so there's this connection, right, where God is the life of the soul and the soul is the life of the body."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4818.05,"end":4819.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4820.29,"end":4834.89,"speaker":"Fr Stephen De Young","text":"And so one metaphor that I've come up with, which is a little grotesque, but deal with it. It's a metaphor for sin and death. So, I mean, we're. Are you going to go?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4834.89,"end":4836.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4837.41,"end":4858.05,"speaker":"Fr Stephen De Young","text":"But if you think about. In terms of understanding what the separation would then be, we've established that connection. God is the life of the soul, the soul is the life of the body. That's the connection. So then what does the separation mean? If you take one of your fingers or toes. I'm not advising this, by the way."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4858.21,"end":4859.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Don't do this, kids."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4859.29,"end":4863.1,"speaker":"Fr Stephen De Young","text":"Do not conduct this as an experiment, children. You will regret it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4864.46,"end":4866.22,"speaker":"Fr Andrew Stephen Damick","text":"Some of us might have done it when we were younger."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4866.46,"end":4874.22,"speaker":"Fr Stephen De Young","text":"And if anyone does do this, their parents should direct their angry cards and letters to Father Andrew Danik, courtesy of ancient faith ministry."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4875.66,"end":4877.14,"speaker":"Fr Andrew Stephen Damick","text":"But we told you not to do it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4877.14,"end":4885.42,"speaker":"Fr Stephen De Young","text":"So if you tie a tourniquet around one of your fingers or toes, right, and you cut off the blood flow."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4887.27,"end":4887.51,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4887.51,"end":4907.67,"speaker":"Fr Stephen De Young","text":"And just like. Because just like Leviticus says, the blood is the life of the thing, right? The blood is bringing the oxygen, it's bringing the nursery, it's bringing the life to. To that member of your body. Right. If you tie a tourniquet around it, what will happen once it's cut off from the source of life? It will die."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4908.47,"end":4909.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4909.59,"end":4917.49,"speaker":"Fr Stephen De Young","text":"The cells that make it up will start to die. Eventually it will completely die. It will begin to decompose, it will become corrupt. Eventually it will literally fall off."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4919,"end":4919.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4919.2,"end":4929.88,"speaker":"Fr Stephen De Young","text":"And just be gone. Right. In the process, you will probably get a nasty case of gangrene. And that gangrene, that rot, may spread to other healthy tissue."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4931.32,"end":4937.4,"speaker":"Fr Andrew Stephen Damick","text":"And that's gross. That is gross and painful and really bad for you. You could die."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4937.88,"end":4941.24,"speaker":"Fr Stephen De Young","text":"Yes, yes. But this is what makes it a good metaphor."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4941.4,"end":4941.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":4941.84,"end":5011.47,"speaker":"Fr Stephen De Young","text":"Right, Right. Because what's being depicted here, the expulsion from paradise, is that immediately the spiritual death happens immediately. That spiritual death means that the souls of Adam and Eve are cut off from the source of their life. And so they begin to die physically, the physical death is the result. The bodily corruption is the result. And it corrupts not only them, but it corrupts the creation around them until the creation around them becomes full of death. And then eventually they physically die as a result of the spiritual death. Eventually they are cut off. So what that means is that the Hebrew has what's called an infinitive absolute construction. It's usually translated in English. You will surely die. But if you translated it really literally from the Hebrew, it would be dying. You will die on that day. Dying. You will die."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5012.27,"end":5019.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you've got both this progressive and kind of future sense going on at the same time. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5019.31,"end":5023.71,"speaker":"Fr Stephen De Young","text":"And so the idea here is that the spiritual death is the real death."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5025.35,"end":5025.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5025.75,"end":5044.23,"speaker":"Fr Stephen De Young","text":"Tying that tourniquet between you and God, being cut off from God as the source of life, that's what begins. That's the real death, because that begins the dying process. And the physical death is a consequence, an image of the real death that's already happened."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5044.47,"end":5097.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is what begins at this point for Adam and Eve. And this is also referred to. Someone left us a message that I'm going to play for us in just a second here. But this leads to, you know, this notion of the garments of skin. Right. But, you know, they put on fig leaves for a second, too. And so this is what leads to this question from our friend, frequent caller Kyle from Ireland. So here's from Kyle. This is what he had to say. Hi, Fathers. I have a question. On the garments of skin, in contrast to the fig leaves, growing up, I was taught that the fig leaves were Adam and Eve's way of trying to cover for their sins through works, as if it's some kind of parallel to."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5097.55,"end":5100.03,"speaker":"Fr Stephen De Young","text":"The whole of the Old Testament and the law."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5101.15,"end":5107.99,"speaker":"Fr Andrew Stephen Damick","text":"Whereas the garments that God made were some kind of appeasing of his anger."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5108.15,"end":5112.63,"speaker":"Fr Stephen De Young","text":"And a sense of justice, in that an animal had to be killed and blood had to be shed in order."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5112.63,"end":5118.07,"speaker":"Fr Andrew Stephen Damick","text":"For salvation to truly take effect, if you like."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5118.79,"end":5120.07,"speaker":"Fr Stephen De Young","text":"I've listened to enough of the whole."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5120.07,"end":5121.67,"speaker":"Fr Andrew Stephen Damick","text":"Council of God to know that this."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5121.67,"end":5124.59,"speaker":"Fr Stephen De Young","text":"Kind of shorthand idea of appeasing God's."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5124.59,"end":5133.34,"speaker":"Fr Andrew Stephen Damick","text":"Wrath is certainly, we'll say, not giving the full picture. So, in short, what are the fig."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5133.34,"end":5134.7,"speaker":"Fr Stephen De Young","text":"Leaves, what's going on with the fig."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5134.7,"end":5161.34,"speaker":"Fr Andrew Stephen Damick","text":"Leaves versus the garments of skin? Thank you very much. All right, so I mean, the first thing that I would say to that is, if it really is the case that God killing the animals is for appeasing his wrath, then why is it that after that happens, Adam and Eve are not just welcomed back into paradise because. Right. Shouldn't have taken care of it, but apparently not."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5162.22,"end":5179.66,"speaker":"Fr Stephen De Young","text":"Right. Someone could say, well, I guess in that understanding, he described that. Well, yeah, that's because the Old Testament sacrifices are ineffectual. But why would God feel the need to do an ineffectual sacrifice?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5179.9,"end":5190.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. But I mean, there's no indication in the text that God's wrath is appeased or something by this act. Like, that's just not said."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5190.68,"end":5192.76,"speaker":"Fr Stephen De Young","text":"No, there's not even indication of wrath."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5193.48,"end":5200.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It doesn't say. It doesn't even say. And God became angry and said unto them, there's nothing like."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5200.28,"end":5205.48,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, this is right after. It is not good that man should stay forever in this state."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5206.6,"end":5208.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is a compassionate God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5208.92,"end":5212.51,"speaker":"Fr Stephen De Young","text":"Right. This is. They're being expelled for compassionate reasons."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5213.3,"end":5213.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5214.1,"end":5268.2,"speaker":"Fr Stephen De Young","text":"And so this is, again, to hone in on this. Right. That what we've just said about death and how physical death works and spiritual death works is not compatible with the idea of God administering the death penalty to people by killing them when they die. Right. That cannot be repeated enough. Because even people who get that about Genesis do not get that in real life, when someone dies who they care about, who I care about, who any of us care about. Right. Especially if they die younger or at a time or in a way that we don't think they should have. Right. It's God killed them."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5271.72,"end":5272.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5272.84,"end":5279.72,"speaker":"Fr Stephen De Young","text":"That's not how it works. That's not what death is for. Right. That's not what life in this world and death is for."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5283.64,"end":5284.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5286.52,"end":5297.7,"speaker":"Fr Stephen De Young","text":"So, yeah. So this is. This is not a death penalty. Right. And so because there's no death penalty in view, applying a death penalty to an animal is not in view."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5297.94,"end":5298.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5298.34,"end":5300.26,"speaker":"Fr Stephen De Young","text":"It would be irrelevant. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5300.26,"end":5318.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, we're going to go on about this a little bit, but the idea, the garments of skin is not God killing some animals and making some leather that, you know, for them to wear, although it gets depicted that way iconographically, because how else would you depict this? Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5319.54,"end":5322.74,"speaker":"Fr Stephen De Young","text":"This is literary imagery. So it gets turned into visual imagery."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5322.74,"end":5341.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly. No, it's that mankind's mode of existence now alters to become like the animals. We're going to talk about that a little bit more. But his mode of existence now becomes mortal. It becomes deathly. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5342.5,"end":5348.91,"speaker":"Fr Stephen De Young","text":"Let me throw in another thing. Iconography. Hold on to your chair."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5349.55,"end":5351.15,"speaker":"Fr Andrew Stephen Damick","text":"Iconography, I'm holding on."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5351.55,"end":5357.47,"speaker":"Fr Stephen De Young","text":"Is not meant to be a literal photographic recording of material reality."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5359.71,"end":5364.11,"speaker":"Fr Andrew Stephen Damick","text":"But what about the community of the apostles icon that has two Jesuses in it. I mean, isn't that. No."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5364.27,"end":5366.03,"speaker":"Fr Stephen De Young","text":"Or the nativity icon."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5366.19,"end":5366.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5366.55,"end":5371.92,"speaker":"Fr Stephen De Young","text":"It has like 83 different things happening all at the same time. Right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5371.92,"end":5393.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. No, yeah. That's not how any of his work. Right. So, I mean, so Kyle asked about the fig leaves in contrast to the garments of skin. What is all that about? I mean, if you had to pick a leaf, though, you know, I have a fig tree in my yard actually, so those are nice big leaves. So there is that to be said about it. There you go. You can. Yeah, they're big."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5393.96,"end":5395.96,"speaker":"Fr Stephen De Young","text":"We're not ready to leave this topic deep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5399.58,"end":5399.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5400.22,"end":5411.74,"speaker":"Fr Stephen De Young","text":"So this is. The importance of the fig leaves is connected to what they're. The situation they're attempting to resolve."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5412.86,"end":5414.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5414.46,"end":5448.71,"speaker":"Fr Stephen De Young","text":"So again, if you want to tie them to works or works of the law or something, then you have to somehow say that Adam and Eve went through this thought process of we did the thing we weren't supposed to do, and so we need to now do good stuff to impress God so he won't be mad at us anymore. And the good stuff they chose to do was cover themselves with fig leaves. Right. See how that doesn't track?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5450.18,"end":5453.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. It's not good work."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5454.18,"end":5459.46,"speaker":"Fr Stephen De Young","text":"That doesn't. That. That doesn't track at all. So the situation they're trying to resolve with is not guilt."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5460.5,"end":5462.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5464.42,"end":5485,"speaker":"Fr Stephen De Young","text":"Guilt. Well, I don't want to go too far down that rabbit trail, but there's nothing particularly Christian about the concept of guilt, we'll put it that way. But so this, this isn't a problem of they feel guilty. This isn't a problem of them thinking now the death penalty is going to come upon them."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5485.8,"end":5486.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5487.16,"end":5497.32,"speaker":"Fr Stephen De Young","text":"This is the problem, according to the text, is that they realize that they're naked. They were always naked. They didn't realize they're naked."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5498.36,"end":5506.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, what does that mean? It's not like they suddenly looked down for the first time and said, wait, we're not wearing clothes. Hold on, hold on."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5506.57,"end":5507.61,"speaker":"Fr Stephen De Young","text":"What are clothes?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5508.25,"end":5511.69,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah, exactly. Like, where would they have seen that before?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5511.77,"end":5551.33,"speaker":"Fr Stephen De Young","text":"Clothes haven't been invented yet. All these other animals are much furrier than us. This is embarrassing. So, no, this is an image, Right. This is an image of innocence and innocence lost. Right? So little kids, right. Little babies and little toddlers will run around naked, half naked, Right. They don't care. They don't think anything of it. Most of the time their parents don't think anything of it. Right. They get to A certain age and that's no longer appropriate."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5551.89,"end":5552.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5552.69,"end":5563.95,"speaker":"Fr Stephen De Young","text":"Right. They reach a certain level of maturity and now there's embarrassment and shame and other issues because of sin in the world. Right. If there was no sin in the world, everybody could walk around naked."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5565.71,"end":5566.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5566.11,"end":5571.63,"speaker":"Fr Stephen De Young","text":"The only reason I'm pointing that out is that today is International Nude Day. You didn't know that?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5571.63,"end":5573.15,"speaker":"Fr Andrew Stephen Damick","text":"I didn't even know that was a thing."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5573.55,"end":5576.91,"speaker":"Fr Stephen De Young","text":"But it is. But anyway, I'm not promoting nudism for the record."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5576.91,"end":5577.31,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5577.71,"end":5596.38,"speaker":"Fr Stephen De Young","text":"If you think I am. Send your angry letters to Father Andrew Damek. Take care of ancient faith ministries. But the point being, there's no sense of shame or inappropriate or anything. Right. Until they have the knowledge of good and evil."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5597.74,"end":5598.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5599.1,"end":5631.88,"speaker":"Fr Stephen De Young","text":"Now that they have the knowledge of evil, now that evil has come into them. And in our third half, we're going to talk more about what that means. Now there are issues. Right. And so they go and they cover themselves to deal with the problem of being naked and exposed and the humiliation and the embarrassment that they now experience. Right. The passions that they now experience. Right. And that's why when God comes and confronts them about it, he says, who told you you were naked?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5632.2,"end":5639.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then I love. In some translations, did you eat of the tree which I told you not to eat? Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5642.7,"end":5644.62,"speaker":"Fr Stephen De Young","text":"Was it me? It was this woman you put here with me."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5644.86,"end":5647.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Very predictable."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5649.26,"end":5666.38,"speaker":"Fr Stephen De Young","text":"But. So this is another important distinction. I'm trying not to pick on St. Augustine too much tonight, but there's another important distinction that gets kind of lost a lot of times in Western theology where Adam and Eve are viewed as perfect."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5667.66,"end":5669.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What does perfect mean exactly?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5669.66,"end":5675.82,"speaker":"Fr Stephen De Young","text":"And so paradise is lost and then paradise is regained."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5676.3,"end":5676.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5676.62,"end":5680.46,"speaker":"Fr Stephen De Young","text":"The idea of salvation is going back to the state Adam and Eve were in."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5681.5,"end":5682.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5682.7,"end":5712.07,"speaker":"Fr Stephen De Young","text":"But that's not what's portrayed here. And this nakedness idea is key to understanding that. Right. Adam and Eve are children. Not physically, perhaps we don't know what they look like physically at this point, but they're children. They're innocent until they're not. And that's why the phrase, the knowledge of good and evil, every other place where it's used in the Old Testament, it's used to refer to a child coming to maturity."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5714.15,"end":5714.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5715.43,"end":5752.97,"speaker":"Fr Stephen De Young","text":"So they jump the gun and receive this knowledge that they're not ready for, that they're not mature enough for. This is why all the fathers say that there would have been a point at which Adam and Eve would have been allowed to eat of that tree when they had properly matured. Right. This is why the Book of Enoch still has that tree in paradise. So that's the issue here. So as we talked about in the first half, man has this destiny. Adam and Eve were at the beginning of their journey toward that destiny. They had not arrived. They had not even gotten started."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5753.61,"end":5754.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5754.49,"end":5801.54,"speaker":"Fr Stephen De Young","text":"Really. Right. And then this happens. Right. And so that loss of innocence, that loss of their innocence is what causes the shame and humiliation of nakedness to become a reality. Because again, clothes haven't been invented yet. Clothes get invented because of this. And so they have to go and cover themselves. So the garments of skin. Right. This is then talking about something different. So why does God kill an animal to show them what death is?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5802.86,"end":5804.46,"speaker":"Fr Andrew Stephen Damick","text":"Because they haven't seen that before."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5804.94,"end":5806.82,"speaker":"Fr Stephen De Young","text":"Right. This is a corpse."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5806.82,"end":5807.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5807.1,"end":5828.22,"speaker":"Fr Stephen De Young","text":"And as we just said, physical death is the image of spiritual death. Right. And so God gives this image to them. When I said, dust you are, to dust you will return. Right. Adam didn't remember being dust, so."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5830.03,"end":5830.27,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5830.83,"end":5834.19,"speaker":"Fr Stephen De Young","text":"So to make that meaningful, it has to be shown to him."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5834.59,"end":5835.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5836.19,"end":5866.25,"speaker":"Fr Stephen De Young","text":"And then the garments of skin here then is talking about the change to their bodies. Now, again, we're not necessarily talking about a change of physicality because we've talked about what body means more about this in the third half. It's a collection of powers. Right. It's a collection of potentialities. Right. That gets changed and becomes more like an animal."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5867.37,"end":5887.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We don't know what the. If there's a physiological, like from our point of view, a biological physiological alteration. We don't know that. Right. We just know that there is this change in the way that humans. Humans, physical bodies, that our whole being works, because it's not like we don't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5887.97,"end":5889.33,"speaker":"Fr Stephen De Young","text":"It's the way of being in the world changes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5889.33,"end":5908.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We should emphasize that before this happens. Human beings do have material bodies. Yes, Right. We're created that way. This is not the moment that we went from being disembodied souls to being embodied souls. Yeah. We've got bodies, but we're now more like animals."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5908.69,"end":5913.01,"speaker":"Fr Stephen De Young","text":"As a result of that, Christ after the resurrection still has a physical body."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5913.41,"end":5914.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5914.69,"end":5923.57,"speaker":"Fr Stephen De Young","text":"Right. He still does. Obviously, there are differences. Right. If you ask me to define them on a scientific basis, I'm going to tell you to go away and leave me alone."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5923.73,"end":5933.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's not what we have in scripture. It doesn't say, and Adam became 2 inches shorter and, you know, his blood turned from green to red, you know."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5936.36,"end":5945.4,"speaker":"Fr Stephen De Young","text":"Right. But so. And by way of sort of segue toward our third half the animal soul."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5945.88,"end":5946.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5946.24,"end":5953.64,"speaker":"Fr Stephen De Young","text":"The animal part of the soul is what is characterized by epithymia in Greek, by passions, by desires."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5953.96,"end":5955.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5955.32,"end":5967.23,"speaker":"Fr Stephen De Young","text":"And so this is now something that's going to come to the fore. And as for the rest of what has been said about the garments of skin, is this not recorded in the annals of the symbolic world?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5969.47,"end":5987.23,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true. So we're about to take a break, but before we do, we actually have a live call from another Kyle. So, Kyle, are you there? Yes, I am. Welcome, Kyle, to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5987.86,"end":5991.62,"speaker":"Fr Stephen De Young","text":"Where are you from, Kyle? We have Kyle from Ireland. You have to be Kyle from somewhere."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":5992.9,"end":6004.22,"speaker":"Fr Andrew Stephen Damick","text":"I am actually from Southern California, near, actually Redlands, actually. Oh, that's your place, Father Stephen."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6004.22,"end":6008.18,"speaker":"Fr Stephen De Young","text":"Yeah, Kyle of the Inland Empire."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6008.9,"end":6043.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Wow. He's an actual Imperial. That's great. So, Kyle, what is on your mind this evening? I'm afraid you guys may have already answered it. It was really about the distinguishing atom being made of the Earth, and that part of human nature, as well as what could have been changed when we were. When we had the garments of skin."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6043.47,"end":6047.71,"speaker":"Fr Stephen De Young","text":"Put on that maybe there was the."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6047.71,"end":6143.6,"speaker":"Fr Andrew Stephen Damick","text":"Inc. We were given the incorporeal nature of human beings being of the Earth, and then the garments of skin was. I think you guys were as discussing maybe a. Like a symbol of death, perhaps, or that how death may have entered the world. If you could elaborate a little bit more on that. Yeah. So, I mean, I. Well, first, I would not say that man was incorporeal before death was given to him. Although, I mean, you could. You could make. Because of the way that incorporeal is used now in English, but I mean, you could make that point sort of etymologically. Right. That man did not have the capability of being a corpse. Right. But. But usually incorporeal means without material body. So he does have a material body before all this goes down. Right. He is made. He is made of Earth. And of course he's going to return to Earth as. As God says. But there's, you know, as we said, there's a different kind of way that man's body functions now. He has the ability of mortality, which he didn't have before. And we're going to talk about what that does for us in the next half. But, yeah, I mean, we are still made of Earth, but now that Earth kind of functions in another way that it did not before. So I don't know. Father, did you want to add anything or correct anything? In that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6144.72,"end":6197.43,"speaker":"Fr Stephen De Young","text":"Yeah. Well, it's interesting, Kyle, of my hometown, that when Adam is created, the language, if you look at it in specific, it's that God creates him from the dust of the earth. Right. And then places him in the garden, which means it was earth from outside the garden. Right. And since that's actually recorded, it's probably significant. Right. And I think it's, it's, I think based on that, we should not overestimate the physical quality of the difference."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6197.91,"end":6198.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6198.27,"end":6264.13,"speaker":"Fr Stephen De Young","text":"Because hypothetically, Adam and Eve were going to go out into this world, bringing Eden with them. Adam has this intimate connection to it already. He's not only going to be transforming himself. We aren't saved out of the world. The creation is saved through our salvation and we're saved through Christ. I think, and we're obviously, this is where we're going in the third half is that we're going to be talking about the body specifically as this collection of powers and potentialities and specifically about the passions and being subject to them and the relationship of that to the weakening of our body and our nature and our powers, which are quasi, not quite synonymous. So I think we partially answered it. I think in the third half we're gonna finish answering it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6264.93,"end":6265.53,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6265.53,"end":6274.69,"speaker":"Fr Stephen De Young","text":"Well, Kyle, but yeah, on the whole, the expulsion from paradise would be like if you had to leave Redlands and move to San Bernardino or worse, Fontana."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6275.97,"end":6276.93,"speaker":"Fr Andrew Stephen Damick","text":"Very dangerous."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6279.25,"end":6283.65,"speaker":"Fr Stephen De Young","text":"Montana is the land of nod, I guess, in this east of Eden."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6284.45,"end":6301.65,"speaker":"Fr Andrew Stephen Damick","text":"Wow. All right. Well, Kyle, did that, did that help? Yes. And may I sneak in a quick confirmation of at least my thought process? When we were put on the garments of skin, that changed human nature."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6305.66,"end":6321.5,"speaker":"Fr Stephen De Young","text":"It reflects a change in human nature. Nature understood as being the dynames, the powers of a human being. Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6322.06,"end":6330.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right. Well, thanks for calling, Kyle, and I hope you'll stick around for the third half. And we are going to go ahead and take our second break. We'll be right back."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6331.38,"end":6347.54,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6352.66,"end":6402.84,"speaker":"Fr Stephen De Young","text":"New from Ancient Faith Publishing, Secret Turning, a collection of short stories by Stephen Signari. Behind Raskova was an icon of the descent into hell. The little girl said to Raskova, and he was holding their hands like when we cross a big street. She pointed and said, like them. Raskova looked over her shoulder at the icon Adam and Eve and him taking them by the hand and and said ah and nodded. They were all happy. The little girl told Raskova. She looked at Naom and twirled her napkin into a blessing wand. Like all of us, she said, and waved her little girl blessing over the coffee hour hall. Father Noam wanted to say, and then what?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6403.24,"end":6404.2,"speaker":"Fr Andrew Stephen Damick","text":"But he didn't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6404.28,"end":6432.98,"speaker":"Fr Stephen De Young","text":"Dushanka, the little soul said, then they forgot. No one wanted to ask her why. Instead, he took some coffee. She said, because they got big. Naom looked at Raskova and then at the little girl. He said to the little soul, well, that answers that. She just smiled and told Nahum, you're silly. Now available in paperback, ebook and audiobook@store.ancientfaith.com."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6433.62,"end":6449.76,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6450.64,"end":6486.33,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back. It's the third half of the Lord of Spirits podcast. Because as I've as I've said in the past, this is a show and a half. So, right, we we're talking about death, the first of the three elements of the flesh fall of humanity. And we just finished talking finished up talking about the garments of skin. So why don't we recap about exactly what a human body is? It's been a long time since we did the body episodes. Was that I think that was like an early of early last year. Am I remember correctly? I can't recall now off the top of my head, but I know the."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6486.33,"end":6487.37,"speaker":"Fr Stephen De Young","text":"Concept of time or space."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6487.69,"end":6488.65,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's good."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6489.21,"end":6491.13,"speaker":"Fr Stephen De Young","text":"So I'm somewhere somewhen."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6491.61,"end":6493.77,"speaker":"Fr Andrew Stephen Damick","text":"That's probably helpful when it comes to doctor visits."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6495.53,"end":6497.61,"speaker":"Fr Stephen De Young","text":"Like I go to a doctor. Anyway."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6502.09,"end":6508.17,"speaker":"Fr Andrew Stephen Damick","text":"Bodies. Yeah. Deathly bodies. Dead bodies. Bodies."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6509.53,"end":6526.42,"speaker":"Fr Stephen De Young","text":"Let them hit the floor. No. So yeah, yeah. From one perspective, if you think about it, right, like let the bodies hit the floor and it's raining Men could be the same song or songs about the same event, right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6526.42,"end":6536.66,"speaker":"Fr Andrew Stephen Damick","text":"That's depending. And I mean, given that time and space aren't a thing, right. When Whitney Houston said I'm every woman, it's all in me."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6537.86,"end":6538.34,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6538.66,"end":6545.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. I'm just, you know, or you know, Walt Mittman, I contain multitudes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6546.55,"end":6546.83,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6546.83,"end":6555.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. Walt Whitney Houston. I'm every woman. I contain multitudes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6555.51,"end":6574.39,"speaker":"Fr Stephen De Young","text":"I believe it's pronounced Walt Whitman. But anyway, so yeah, so we've talked about, and I know we say this and it's a cool phrase, but I Don't want it to just be like a nebulous, mysterious phrase."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6574.66,"end":6574.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6575.22,"end":6602.73,"speaker":"Fr Stephen De Young","text":"When we say that a body is a collection of powers or potentialities. And we went into it, I think when we really went into it, we were talking primarily about God's body in that context and how most of what's in Scripture is not anthropomorphism, it's that man is in the image of God. And so man and is theomorphic, not the other way around."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6602.97,"end":6603.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6604.41,"end":6648.18,"speaker":"Fr Stephen De Young","text":"But so here for our purposes, we're talking about primarily human bodies, which is a version of a created body. Right. And so we're talking about this collection of powers. And there's, as we just mentioned, talking to Kyle of the Homeland, that there is this sort of overlap. The Venn diagram is not a circle, but there's a lot of overlap between the way body is understood, say in the ancient near east and even in the archaic period in Greece, and the way nature comes to be understood later. The term theseis the term nature."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6650.74,"end":6651.14,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6653.46,"end":6677.98,"speaker":"Fr Stephen De Young","text":"Another rabbit trail I'm not going to go down right now is the way in which the word physis or nature is used in scripture because that's actually way more complicated than people think because it gets used in Second Maccabees and in some places pre New Testament places in a certain way that pretty clearly doesn't correspond to how it gets used in a lot of the New Testament cases."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6677.98,"end":6678.31,"speaker":"Fr Andrew Stephen Damick","text":"It's."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6678.54,"end":6693.58,"speaker":"Fr Stephen De Young","text":"So anyway, that's a whole thing. If anybody's looking for a dissertation topic, there you go, we're full of them. You can have it for free. They have to be written, so might as well do something helpful with it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6693.58,"end":6697.26,"speaker":"Fr Andrew Stephen Damick","text":"Papers have to be published. Yeah, right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6698.7,"end":6710.21,"speaker":"Fr Stephen De Young","text":"But, yeah, so there's a lot of overlap because of course, nature especially is the way Aristotle defines it is it's a collection of powers. Right. Dynamic power."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6710.21,"end":6710.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6710.45,"end":6764.11,"speaker":"Fr Stephen De Young","text":"It's a collection of powers that you have and different hypostasis, different individual beings, different persons for humans actualize different ones of those, and that's what makes them separate, independent beings. But, and so you can see how that overlaps with the idea of the body as a, as a collection of powers. But those powers that are internal to a given created nature are aimed at something because the being of any particular being is sort of aimed at something. And so that's the other part of nature is that sort of aiming towards something. So to use a non human example, right. An acorn has the same nature as an oak tree."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6764.91,"end":6766.11,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6766.11,"end":6772.43,"speaker":"Fr Stephen De Young","text":"And the acorn is sort of aimed at becoming an oak tree. Every acorn doesn't become an oak tree."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6772.75,"end":6773.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6773.71,"end":6785.39,"speaker":"Fr Stephen De Young","text":"But that's what it's aimed at. Right. That's sort of the full maturity of the acorn's nature is the tall, sturdy, mature, full grown oak tree."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6785.65,"end":6785.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6787.81,"end":6863.02,"speaker":"Fr Stephen De Young","text":"And so then that consists of these various powers that are needed to get it from the acorn you can hold in your hand to the giant oak tree that falls on your house in the hurricane. I live in Louisiana. So the same is true then, Right. When we talk about the human body or human nature. Right. Is that human, our human constitution. Right. The powers that we are invested with as human that make us human are aimed at something. Right. And it's not just a full grown, physically adult human. Right. That a baby becomes. Right. This is what, as we were talking about in the first half, makes humans different from angels and really all other beings, is that humans have a unique destiny. As we said, humans have a unique aim and unique telos and toward which we are directed. And to put a fine point on it, that is God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6864.14,"end":6867.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God is the purpose of human beings."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6868.12,"end":6868.44,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6868.84,"end":6995.04,"speaker":"Fr Andrew Stephen Damick","text":"And it's interesting, there's a line from St. Gregory the Theologian's funeral oration for St. Basil, which is just a fancy patrology kind of way of saying, this is the eulogy that he gave at St. Basil's funeral where he talks about an incident where a ruler, a prefect or somebody came up to St. Basil and enjoined him to engage in pagan worship. And Basil of course, says, are you kidding me? Effectively. But Gregory relates this as a dialogue. And one of the things that Basil says in his dialogue with this prefect is he says, the prefect says, why will you not worship our gods? Everybody else is. Has yielded. Whatever. And he says, because this is not the will of my real sovereign, nor can I, who am the creature of God and bidden myself to be God, submit to worship any creature. So Basil here puts forward this idea. This is in chapter 48, by the way, if anyone wants to look this up in his funeral oration for St. Basil, that basil is a creature and he's bidden to be God. And he's talking about this, that God is his telos, his purpose, his aim, his target. Right? And because that's the case, then he can't worship any creature. He can only worship God if he's being true to who he truly is. Right? So it's a cool. It's kind of a side remark, you know, but it's very memorable that he says, this is the translation Forbidden myself to be God, or I think some translations say, commanded to become God. Right. So this is St. Gregory quoting St. Basil in this funeral oration. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":6995.04,"end":7003.36,"speaker":"Fr Stephen De Young","text":"Of course, this has obvious resonances with Saint Athanasius famous God became man so that man might become God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7003.68,"end":7005.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, exactly."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7006.2,"end":7010.68,"speaker":"Fr Stephen De Young","text":"And so that sounds really cool, but what does that mean?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7010.92,"end":7012.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7012.84,"end":7080.97,"speaker":"Fr Stephen De Young","text":"So what does it mean? So, right, what we're saying is, right, you look at the acorn, the end of that is a full grown oak tree. You look at a baby that was just born. Right. Or a sonogram of a baby that was just conceived. Right. Well, fairly recently, or you wouldn't have much of a sonogram. But anyway, you get my point. You look at that embryo, right? And that is if we're comparing that to the acorn, the oak tree for that new human life is not an adult human. The oak tree for that new human life is God. Yeah, yeah, that's what we're saying. Just to put a fine point on it now again, that sounds cool. What does that mean? Right, so now we're going to start using crazy terms and then go back on ourselves. So bear with us."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7081.13,"end":7084.81,"speaker":"Fr Andrew Stephen Damick","text":"This is the part where Father Stephen confuses even me. So here we go."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7084.81,"end":7120.34,"speaker":"Fr Stephen De Young","text":"Yeah. So this is where I put a crowbar inside your brain. Twisting. Yeah. No. Okay, so I'm here for it. God is the being who. Right. And I'm going to qualify all this. I know there's somebody out there. It's like you just said, God is a being. I'm going, wait for it. Okay. God is the being whose existence and essence are co. Extensive. What does that mean? Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7120.58,"end":7121.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7121.7,"end":7126.1,"speaker":"Fr Stephen De Young","text":"Okay, So a simple way of saying that is that God is who he is."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7127.3,"end":7134.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He hasn't arrived there. He's not on his way there. He is who he is."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7134.42,"end":7134.78,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7134.78,"end":7136.18,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I am who I am."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7136.5,"end":7140.58,"speaker":"Fr Stephen De Young","text":"There is no for God. There is no acorn stage."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7141.46,"end":7144.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not becoming. Not becoming anything."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7144.29,"end":7147.65,"speaker":"Fr Stephen De Young","text":"Right. He's not in process."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7148.69,"end":7149.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7149.25,"end":7196.69,"speaker":"Fr Stephen De Young","text":"Okay. And when I say, even when I say that his existence and essence are coextensive, I'm not saying that when we use the word existence to describe God or the word essence to describe the divine essence, God's essence, that we mean the same thing as when we talk about the existence or essence of me or a table or one of my heathen dogs. Right? We don't mean the same thing. We don't even mean something analogical. Sorry, Thomas Aquinas. It's not even an analogy. Right. We can make analogies between me and the heathen dog and the table. Right. But those analogies never connect up to God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7198.68,"end":7199.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7199.48,"end":7240.41,"speaker":"Fr Stephen De Young","text":"So as Saint Maximus the Confessor said, if God exists, I do not. Right. If I exist, God does not. So we as orthodox Christians could say that we don't believe God exists. Because what we mean by that is that what we usually mean when we use the phrase exist, like has material reality. Like, if someone says unicorns don't exist, they don't mean that the concept of a unicorn doesn't exist. They don't mean that unicorns don't exist in fiction. They mean unicorns don't have material reality, scientific reality in the present world. Well, God doesn't have material scientific reality in the present world."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7240.57,"end":7242.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can't put him in a measurable."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7242.45,"end":7244.81,"speaker":"Fr Stephen De Young","text":"And quantifiable beaker or weigh him."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7244.81,"end":7245.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7245.53,"end":7247.61,"speaker":"Fr Stephen De Young","text":"So he does not exist in that sense."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7248.25,"end":7248.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7249.97,"end":7273.41,"speaker":"Fr Stephen De Young","text":"So what I'm actually doing when I say that God's existence and essence are coextensive is actually what we call in the Orthodox Church an apophatic move or a negative theological move. I'm saying that this is a way in which God is different from us. We don't know what it means to have your existence in essence be co. Extensive."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7273.89,"end":7274.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7274.65,"end":7276.17,"speaker":"Fr Stephen De Young","text":"I just know that mine aren't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7276.97,"end":7279.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, Yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7279.33,"end":7306.39,"speaker":"Fr Stephen De Young","text":"Right. That I am on my way somewhere. I am constantly in flux. Not goalless flux, but flux. Right. And God is not. So I'm saying, essentially, what I'm saying by that statement is God is not like me or the table or my heathen dog. So. Or any other created thing. Right. Including angels and demons."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7306.95,"end":7325.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is a point that the fathers make a lot, that he's utterly unlike any created thing, that the uncreated one is not. There's no, you know, we have language to describe him. Right. We have language from Scripture. And that's the safest place to go."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7325.03,"end":7325.27,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7325.27,"end":7330.16,"speaker":"Fr Andrew Stephen Damick","text":"Is to quote Scripture. But it does not encapsulate him or define him."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7331.2,"end":7331.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7331.68,"end":7332.24,"speaker":"Fr Andrew Stephen Damick","text":"You know?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7333.2,"end":7344.64,"speaker":"Fr Stephen De Young","text":"Right. And so that was in prep to try not to break anyone's brain with what I'm about to do. But I think it kind of broke Father Andrew's brain earlier. So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7344.96,"end":7345.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7345.68,"end":7347.28,"speaker":"Fr Stephen De Young","text":"No promises. Okay."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7347.84,"end":7354.11,"speaker":"Fr Andrew Stephen Damick","text":"So I think I might get it now. I'm working on it, though. I'm working on it. I'm learning, I'm becoming."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7356.11,"end":7417.26,"speaker":"Fr Stephen De Young","text":"Yes, See, there we go. This is coming closer to. Yeah. So existence in essence. Here we're using existence to refer to sort of the present state of our day to day flux and growth and change and generation and corruption and all of those fluxes that we're in, right? And essence then has to do with identity, with who and what we are. So a way to talk about this that is obviously very applicable to Genesis 1:3, the language of Genesis 1:3 that's related to this is about the image of God and in the way we've talked about it on this show before, right? So on one hand, humanity is created in the image of God, right? And that set is a statement. That's a statement of essence."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7419.1,"end":7419.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7419.46,"end":7422.54,"speaker":"Fr Stephen De Young","text":"That is an essential statement about humanity, right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7423.02,"end":7428.86,"speaker":"Fr Andrew Stephen Damick","text":"What humanity is totally apart from what happens in the garden, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7428.86,"end":7432.3,"speaker":"Fr Stephen De Young","text":"Totally apart from the existence of any given human."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7433.14,"end":7434.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is the plan."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7434.9,"end":7466.03,"speaker":"Fr Stephen De Young","text":"And that's why it's broadly. That's why it's broadly applied, right? So after the flood, he who spills man's blood, his blood shall be spilled by man. For in the image of God, God made man, right? From every human. No matter how miserable a cuss they are, no matter how wonderful they are, no matter how ravaged by sin they are, they're still in the image of God in this sense. They are essentially human still. Right? So there's image of God in that sense."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7466.75,"end":7467.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7468.27,"end":7485.08,"speaker":"Fr Stephen De Young","text":"Then there is our existence. And we've talked about in the show how imaging God has this verbal sense in which imaging God is something we do. Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7485.08,"end":7485.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7485.88,"end":7562.73,"speaker":"Fr Stephen De Young","text":"Able to do. Right. This is, and this is related to theosis, participation, God's grace, participation, divine energies that we actively do the things that God does. Right? Energies are working in the world, working in creation. God is working in creation. We cooperate and participate in his work in creation. And so we image him within the creation. So that's like our existence and the eventual product of that continued imaging, right? Where that imaging is aimed, its goal would be what the fathers call the likeness of God. Right. And people will quickly point out to you, if they've studied the Old Testament and they've studied Hebrew, they will try to offer this as a critique of the church fathers and say, oh, they didn't know Hebrew because if they knew Hebrew, they know that image and likeness as they're used in Genesis here are synonyms, right? They knew that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7563.21,"end":7564.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7564.33,"end":7570.57,"speaker":"Fr Stephen De Young","text":"The point, the image in which we're created is also the goal."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7572.73,"end":7578.17,"speaker":"Fr Andrew Stephen Damick","text":"Right? Because we are becoming, because we're not just being."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7578.73,"end":7580.01,"speaker":"Fr Stephen De Young","text":"Because they're both God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7580.81,"end":7582.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7582.81,"end":7584.65,"speaker":"Fr Stephen De Young","text":"The image of God and the likeness of God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7584.81,"end":7601.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so like the human identity as we were made to be is something that is always in the future. Because we, being finite, will never arrive at being God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7601.67,"end":7607.75,"speaker":"Fr Stephen De Young","text":"Right. Our identity is always in the future. My existence is who I am today."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7608.47,"end":7608.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7609.59,"end":7624.33,"speaker":"Fr Stephen De Young","text":"And between who I am today and that identity in the future, there is this lack or this gap or this expanse or this nothingness. If you really like Jean Paul's art."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7625.29,"end":7632.49,"speaker":"Fr Andrew Stephen Damick","text":"I don't. Almost never. It was one of the worst experiences I had in high school was reading."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7632.89,"end":7634.17,"speaker":"Fr Stephen De Young","text":"What did you read? Nausea?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7634.41,"end":7641.85,"speaker":"Fr Andrew Stephen Damick","text":"No, we read Oui clo. You know, no Exit in French because it was French class. And I was like, why are we reading this?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7642,"end":7646.64,"speaker":"Fr Stephen De Young","text":"Let me submit to you. If you had to live your whole life in France, you would probably also think hell is other people."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7646.64,"end":7647.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no, come on."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7647.92,"end":7653.36,"speaker":"Fr Stephen De Young","text":"Okay, so I kid the French."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7653.6,"end":7655.6,"speaker":"Fr Andrew Stephen Damick","text":"I would like to visit France someday."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7655.92,"end":7662.48,"speaker":"Fr Stephen De Young","text":"I live among many of them. They're all exiles, but I live. Right, right, right. So."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7662.96,"end":7677.69,"speaker":"Fr Andrew Stephen Damick","text":"And I'm a little bit French Canadian, by the way. A little bit. My great grandmother, her. Her maiden name was Tebow. So there you go. Yeah, yeah. I might be related to that guy who talks about symbolic stuff. I can't remember his name though."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7681.69,"end":7703.31,"speaker":"Fr Stephen De Young","text":"Right. So there's this gap, there's this lack. Right. Between me and it. And that will never collapse. Because as we were just saying, the distance, again, we're using spatial terms metaphorically, between who I am and who God is, is infinite."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7704.67,"end":7705.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7705.47,"end":7725.55,"speaker":"Fr Stephen De Young","text":"It remains infinite. Even as I continue to change and move toward it, it remains infinite. Which means that even when here's another place we have to break our Plato brain, even when we're in the life of the world to come, we're not going to be in a static state."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7727.71,"end":7796.67,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which also implies that if our progress is always this point in the future, future for us, which is the fullness of the stature of Christ, to use St. Paul's language, then that means that this modern thing that we see now, identitarianism, where people take these labels and apply them to themselves and then that becomes the end all, be all of how they conceive of themselves, looking for their identity either in something in the past or something at this moment. And I'm not saying we shouldn't respect the past, understand tradition. That's not what I'm talking about. I'm not talking about history. I'm talking about identitarianism. It's really an anti Christian philosophy. And it's fundamentally kind of an unhopeful philosophy because it means I've arrived, I am this thing, and this is who I and what I am. Period. Right. You know, the becoming is not on the plate, on the table. You know, it's a distortion, really."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7796.67,"end":7828.61,"speaker":"Fr Stephen De Young","text":"Right. And one way, one devastatingly destructive way in which we are faithful to something other than Christ. Right. Is when we're faithful to some version of ourselves. We have this idea that we're not allowed to break character, that whoever I was yesterday, I have to be someone consistent with that today. Even if who I was yesterday was wretched and miserable."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7830.61,"end":7833.17,"speaker":"Fr Andrew Stephen Damick","text":"This is just who I am. No, you can be better."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7833.25,"end":7851.89,"speaker":"Fr Stephen De Young","text":"Right. I can't make a break. And that is. This is something I say to people over and over and over again in confession, right? Is that the devil doesn't spend his time trying to get us to sin. We do that on our own. Right. The devil spends his time when we fall telling us not to get up."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7852.93,"end":7853.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7853.25,"end":7867.57,"speaker":"Fr Stephen De Young","text":"Telling us that this is where we belong, this is who we are. Don't bother trying to do better, to be better, to make any progress. Why? Because the thing he's hated about humanity since the very beginning is that we're capable of making that progress."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7870.69,"end":7871.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7871.77,"end":7875.41,"speaker":"Fr Stephen De Young","text":"And he hasn't changed because he can't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7875.65,"end":7878.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. As we have said in the past."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7879.71,"end":7908.2,"speaker":"Fr Stephen De Young","text":"So he continues to come with this same thing. Right. But the fact is we have. The church gives us countless opportunities to make these breaks when we're baptized, when we're received into the church, every time we come to confession, Right. We have a chance to make a new start. Right. And continue to make this progress that will potentially go on forever, that even the angels have not been blessed with the possibility of."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7909,"end":7911.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7912.04,"end":7931.8,"speaker":"Fr Stephen De Young","text":"And so this, everything we just said, right, about this progress, right. About becoming like Christ. Because of course, Christ is the person, right. In whom humanity is fully and completely united to God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7932.2,"end":7935.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's the real man. He's the total man."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7937.8,"end":7949,"speaker":"Fr Stephen De Young","text":"So everything we've just said was true of Adam and Eve before they ate from the tree in the same way it's true of us now."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7949.48,"end":7951.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":7951.12,"end":8018.25,"speaker":"Fr Stephen De Young","text":"They were at the beginning of this same journey of theosis that we are on. But because of the expulsion from paradise and because of death, because of what happens there, there's now this second complicating factor, and that stems from what we were discussing at the end of the second half regarding the garments of skin and is going to lead us into the nature of repentance. Because what you'll find, especially when you see the Fathers responding to certain things in St. Augustine or just the Fathers speaking in general about the expulsion from paradise and how human nature chained, changed. Right again. Nature being like body being this, this collection of powers. What they're going to talk about is they're going to talk about our nature being weakened."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8019.29,"end":8029.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We can be acted upon. We're passible. Passible. P, A, S S I B L, E. Right, yeah. And."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8031.85,"end":8054.59,"speaker":"Fr Stephen De Young","text":"That I know there's a legion of Calvinists out there who are going to say you don't really believe in sin. Oh, that's wishy washy. Right, we're going to talk about sin next time. But. Yes, but the key here is, the key here is that becoming passable makes us subject to the passions."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8055.47,"end":8074.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And there's what we call blameless and blameworthy passions. And blameless passions are the things that we, the weaknesses that we suffer from simply by virtue of being human. So getting tired by virtue of being."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8074.44,"end":8075.6,"speaker":"Fr Stephen De Young","text":"Humans in mortal bodies."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8075.68,"end":8079.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes, excuse me, Correct. Right. Let's be very precise here."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8079.2,"end":8084.96,"speaker":"Fr Stephen De Young","text":"By virtue of the type of body, the type of nature we have now in this present world outside the garden."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8085.04,"end":8088.72,"speaker":"Fr Andrew Stephen Damick","text":"The kind of thing when we say I'm only human, I'm only human in a mortal body."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8088.97,"end":8089.29,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8090.41,"end":8100.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. So we get tired, we get hungry, we get thirsty, we have desires. Right. For things that are not sinful in and of themselves."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8100.25,"end":8103.33,"speaker":"Fr Stephen De Young","text":"We get cold, we get hot, we get dehydrated, we get."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8103.33,"end":8108.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which you probably get. All those things and being in Louisiana in the summer all at once."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8109.13,"end":8109.93,"speaker":"Fr Stephen De Young","text":"That's true."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8112.33,"end":8115.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How could I be so dehydrated when it's so humid?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8116.33,"end":8121.53,"speaker":"Fr Stephen De Young","text":"Some are more easily satisfied than others. Like there's plenty of good food around. Getting cool is a lot harder."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8122.33,"end":8174.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, but then, but then even these blameless passions, if we indulge them, can become blame worthy passions. Right. So getting tired, fatigue, that can turn into laziness. Right. If you, if you choose that as your way of being or like hunger can turn into gluttony, like you just, just can't have enough. Right. Or the normal natural desire between husbands and wives can turn into lust, all these kinds of things. And that's what's going on. And it of course intensifies with the blameworthy passions. It intensifies the passivity. Like it takes you over, you're acted upon, you're no longer really in control of yourself, yourself. You're out of control. We use this language and those are."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8174.05,"end":8188.81,"speaker":"Fr Stephen De Young","text":"Things like the blameworthy passions, kind of some obvious things like greed, like pride, like envy, like wrath and anger, desire for revenge. Right. Those aren't like excesses of good things."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8189.45,"end":8189.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8190.09,"end":8192.97,"speaker":"Fr Stephen De Young","text":"Or excesses of unavoidable things. Those are just bad things."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8193.13,"end":8225.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, right. They tend to multiply from these. Yeah, right. Exactly, exactly. And we should say, you know, we actually got a couple of questions. There were a couple of people who called. I wasn't sure exactly what they were calling about, to be honest, but then also some questions we got in one of the chats on YouTube about Christ and his mortal human body. Right. He voluntarily accepted the blameless passions, but he remained in control of them. So, like, he got hungry, but he was never gluttonous."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8227.46,"end":8240.02,"speaker":"Fr Stephen De Young","text":"And it's worth noting, we have to be a little careful here. Right? So Christ's human nature was not a fallen human nature."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8240.18,"end":8242.26,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Cannot underline that enough."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8242.42,"end":8275.31,"speaker":"Fr Stephen De Young","text":"Right. What does that mean? Right. Well, we've just talked about what that means. That means it was not weakened in that way. So when we talk about. That's why that word voluntary is so important, Christ voluntarily gets tired, he voluntarily sleeps. He voluntarily eats and drinks and can be killed. Well, no, he can't. He voluntarily dies."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8275.84,"end":8293.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, that's what I'm saying. He voluntarily. Yeah. Someone asked the question, like, how is this different from suicide? And I said, well, in the scripture it says that he lays down his own life. He says that. That no one takes it from him, but he lays down his life, which is not the same thing as I kill myself."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8293.92,"end":8296.52,"speaker":"Fr Stephen De Young","text":"Right. He has the power to lay down his life and to take it up."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8296.52,"end":8297.76,"speaker":"Fr Andrew Stephen Damick","text":"Again and to take it up again."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8299.92,"end":8308.57,"speaker":"Fr Stephen De Young","text":"And he has that because he is not passable, Right. Because he is not naturally subject to these things the way we are."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8309.13,"end":8309.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8310.09,"end":8322.57,"speaker":"Fr Stephen De Young","text":"He is able to voluntarily submit to them. Right, yeah. So we gotta be careful there. Although, if you still think I'm a heretic, address your letters to Father Andrew Damien."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8322.57,"end":8325.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go. To beat."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8325.01,"end":8450.82,"speaker":"Fr Stephen De Young","text":"To beat. So, but this mortality and the mutability that that brings, right, that passibility is also what allows for repentance. Right. For the process of healing and change and strengthening of those powers that. That takes place within this mortal life that we have in this world to which Adam and Eve are sent. They're sent into this world to live a mortal life that will end with death, right? And then from there, after the resurrection of Christ, to enter into the. The life of the world to come. Right? So our mortal life then. Part of the problem with sort of at least American and probably Western folk religion, which is sometimes only vaguely Christian, is that human life is presented as if this life on this earth is the whole ball game. And then once it's done, if you did the right things, however those are conceived, whether it's just being a good guy or believing certain principles or whatever it is, depending on who you're talking to, then you go to heaven and you're just happy and have a great time for eternity. And if you do the wrong things or fail to do the right things, then you go to hell and suffer and get tortured all eternity. Right. And so everything is focused on this life. But if we understand this the way the Scriptures teach and the way the Fathers teach, then this mortal life and the whole aspect of repentance and dealing with sin is sort of this parenthesis."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8452.5,"end":8452.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8453.46,"end":8458.1,"speaker":"Fr Stephen De Young","text":"It's this speed bump that enters in. On the road of theosis."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8458.82,"end":8459.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8459.54,"end":8463.54,"speaker":"Fr Stephen De Young","text":"On the road of the destiny of human persons. Right. It's a setback."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8464.9,"end":8465.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8465.38,"end":8520.23,"speaker":"Fr Stephen De Young","text":"Like Tempest Keep. It's only a setback. No, it's. It's a setback. I would dig it in the crates on that one where, you know, it. It pauses on our journey. Right. But so if we're living the Christian life the way it's set out for us by the Church, right. Then we're essentially progressing on two fronts during this mortal life. We are not only dealing with the parenthesis, we're not only dealing with, through repentance, the passions to which we've become subject and the damage that's been done, but we're also on the other side experiencing theosis. Right. And we're drawing closer toward that human destiny again within the Christian life. We're doing both of those at the same time."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8520.63,"end":8568.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that repentance is. We're going to talk about this a little bit more in just a second, I think. But the repentance is not just, I did something bad and it needs to be fixed, although that's an element. Right. If you did something bad, it needs to be made. Right. But it's also the. This pressing towards becoming more like Christ in, you know, progressing in faithfulness. Right. Which is not just a matter of stop doing bad things. It's, you know, doing more worship, more, you know, more love. Right. So, yeah, it's, as you said, it's not just dealing with the setback. It's also progress, getting back on the track, heading back in the direction of Christ."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8568.56,"end":8571.92,"speaker":"Fr Stephen De Young","text":"Right. And yeah, both of those are active."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8572.4,"end":8573.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8573.16,"end":8585.6,"speaker":"Fr Stephen De Young","text":"Neither of those is a passive thing, Right, Exactly. Theosis is not like I get my theology worked out better or I get the right ideas and I get rid of the bad ideas. I believe the right things I can't."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8585.6,"end":8587.12,"speaker":"Fr Andrew Stephen Damick","text":"Just sit at home and do theoses."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8587.52,"end":8589.44,"speaker":"Fr Stephen De Young","text":"I tweet the right hashtags."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8589.52,"end":8589.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8590.16,"end":8603.04,"speaker":"Fr Stephen De Young","text":"Like, right. Nor is. Right. As you were saying. Nor is repentance. A lot of times, repentance, we don't even think we have to fix it. Right. A lot of times with repentance, it's."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8603.04,"end":8604,"speaker":"Fr Andrew Stephen Damick","text":"I said I was sorry."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8604.24,"end":8614.24,"speaker":"Fr Stephen De Young","text":"Yeah. I did something bad and God's mad at me, or I did something bad and these other people are mad at me. And so I need to go apologize and get them to not be mad at me anymore. That's the problem."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8614.72,"end":8631.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. And being in the process of raising four children, I have occasionally seen, I'll just say the younger ones sometimes will, you know, especially when they're quite young, pummel one another and then immediately say sorry. You know, I said I was sorry."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8631.99,"end":8635.75,"speaker":"Fr Stephen De Young","text":"Yeah, but you hit him. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8636.07,"end":8637.67,"speaker":"Fr Andrew Stephen Damick","text":"You try not to laugh when they do that."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8637.67,"end":8641.75,"speaker":"Fr Stephen De Young","text":"But if that's what repentance was, then Adam and Eve could have just done it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8642.23,"end":8645.51,"speaker":"Fr Andrew Stephen Damick","text":"Right? Golden dudes. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8645.75,"end":8663.3,"speaker":"Fr Stephen De Young","text":"They could have just said, we're really sorry. That was dumb. You're right. You know, and you don't find. Even if you go and read like the various versions of the life of Adam and Eve that describes their repentance. The repentance is like Adam standing in the Jordan river for 40 days. Right?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8663.3,"end":8663.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8663.58,"end":8667.06,"speaker":"Fr Stephen De Young","text":"They seem to think there are things they have to do. There's some process here."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8667.62,"end":8670.74,"speaker":"Fr Andrew Stephen Damick","text":"Wait, are you saying that faithfulness without works is dead?"}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8672.82,"end":8676.18,"speaker":"Fr Stephen De Young","text":"Yes, I feel like I'm saying faithfulness includes works."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8676.26,"end":8676.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8677.53,"end":8681.37,"speaker":"Fr Stephen De Young","text":"But I'm saying believing things without works is dead. Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8681.37,"end":8683.17,"speaker":"Fr Andrew Stephen Damick","text":"Super dead. Yeah, yeah, yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8683.17,"end":8684.69,"speaker":"Fr Stephen De Young","text":"Because there's no life in it. Yes."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8684.69,"end":8685.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8685.77,"end":8717.38,"speaker":"Fr Stephen De Young","text":"As we've been using death tonight. Right. So what we have is not God getting mad and applying punishments. And then because of some internal standard of justice within God, he has to enacted an elaborate plan to allow himself to not be mad at people anymore so he can let them back into paradise. I know that's reductionist, but I'm sorry. A lot of folks believe that when you really boil it down."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8717.62,"end":8718.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8720.1,"end":8739.27,"speaker":"Fr Stephen De Young","text":"That's not what we see depicted here. What we see depicted here is a chain reaction of consequences from which from the very beginning, God is trying to rescue us. Us. Trying to save us from ourselves. Trying to save us from the death and destruction that's brought about by our own actions."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8740.39,"end":8740.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8741.51,"end":8751.67,"speaker":"Fr Stephen De Young","text":"So that once, once that's been dealt with and we've been restored, we can get back on track with what he created. Us for in the beginning, which is to share his life with him forever."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8754.79,"end":8756.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8758.19,"end":8766.75,"speaker":"Fr Stephen De Young","text":"And all of that involves action, Going out and doing good. Going out and doing what God is doing in the world."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8767.39,"end":8787.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the Lord says, I mean, how many times does this appear in scripture, if you love me, keep my commandments. I mean, I don't even remember how many times those things are. Two things are brought together like it's a bunch, but both Old and New Testament. If you love me, keep my commandments. If you love God, you will keep his commandments."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8787.56,"end":8807.2,"speaker":"Fr Stephen De Young","text":"Right. And what are the things God is doing in the world? Well, we just said a couple of them. One of them is right. He's trying to save us from the death and destruction. They're the consequences of our actions. So one thing we need to be doing in the world is trying to help others be rescued from the death and destruction that are the consequences of their actions and."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8807.27,"end":8807.91,"speaker":"Fr Andrew Stephen Damick","text":"And ours."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8808.47,"end":8815.59,"speaker":"Fr Stephen De Young","text":"Right. And this is why the whole Pharisaic angle of judgment doesn't work."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8816.47,"end":8819.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. It doesn't bring people to."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8819.67,"end":8831.03,"speaker":"Fr Stephen De Young","text":"Condemning someone and abandoning them to the consequences of their actions is the opposite of what God does, if you understand it correctly."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8831.99,"end":8833.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8833.12,"end":8846.8,"speaker":"Fr Stephen De Young","text":"But you can see how. If the way you understand what happens in the expulsion for paradise is that God punishes humans with death for disobeying one of his commandments. Right. Then you can see how someone could become a Pharisee."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8847.44,"end":8848,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8848.32,"end":8877.2,"speaker":"Fr Stephen De Young","text":"This person is miserable and deserves to rot and go to hell because of all the sins they've committed. Right. And then the. But as pernicious as that is, and as much as we like to deride those people. Right. And it's always other people, it's worse when we direct it at ourselves. When we turn around and say, I deserve to rot and go to hell because of all the things I've done."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8877.6,"end":8905.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I can't remember. Didn't one of the saints say something to the effect of the demons always whisper two lies. One is, you're doing great, and the other one is there's no hope for you. Yeah. Right. And I mean, those are the roots of. I don't know. I've heard confessions for well over a decade and a half now. I'm pretty sure those are the roots of basically most sins. Yeah. You know. Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8905.65,"end":8908.41,"speaker":"Fr Stephen De Young","text":"And that's what the devil's been saying right from the beginning."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8908.81,"end":8910.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because he's a big liar."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8911.93,"end":8928.71,"speaker":"Fr Stephen De Young","text":"So that's it. So we have to understand this question correctly. And then that allows us to act as God acts Right. And we can act like St. Paul says he did to the Ephesian elders, where he says he never stopped, night and day with tears, begging them to be reconciled to God."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8929.99,"end":8930.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8930.63,"end":8937.59,"speaker":"Fr Stephen De Young","text":"If we approached all of our enemies and all of the sinners in the world, including ourselves in that way, the world would be a very different place."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":8938.15,"end":9399.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, repentance, then it's not. It's about purification. Right. From the passions and all of their effects. It's not just about don't do bad things anymore, but actually being purified. Right. And so, I mean, sometimes people ask, well, what's the point of all the prayer and the fasting and stuff? It's like, well, to purify us, to prepare us for the banquet, to prepare us for that intimacy of receiving Holy Communion. Right. So we engage in these actions of purification and why it's dangerous then to go and to receive the sacraments without these acts of purification. It's not that you need to become worthy because no one's ever worthy. How many of our pre communion prayers say, I'm unworthy, but to become ready. Right. To be adequately prepared to receive, there's never a point at which you deserve. Right. But, but you can be purified so that you can enter in. You can do the things that God said to do so that you can enter in and, and become then more like Christ through that experience of communion, especially Holy Communion, the Eucharist itself. Yeah, yeah. I, you know, I'm reminded, of course, in where, where St. Paul says in, in Philippians, he says, you know, I press on toward the goal for the prize of the upward call of God in Christ Jesus. Of course, there's several different, you know, or the high calling, I think, is what the KJV has. Right. What a beautiful sort of summary that is. Right. Of where he's headed and what the point is. There's no point. Which he said, look, I'm a saint, I'm an apostle. I'm there, you guys. Right? Yeah. Yeah. So. All right, well, let's have some closing thoughts. You know, I think that the Orthodox Church's teaching about what death is, as we've gone through now, how it's shown in scripture, it can be surprising, Right. Because our cultural theology is suffused with this idea that death is a punishment from God. You messed up so bad, bam, you're going to die now. Right. But as we said, death is actually a gift. Death is a gift from God. Now. It comes with a lot of problems. We become mutable in all kinds of ways that are not particularly comfortable, like dying, getting sick, dying, aging, all these kinds of things. But if we understand that the mutability that comes with death, that is in a sense what death is, is actually a tool that's been added to our toolkit, then it's a profoundly hopeful realization. I think that, you know, St. Isaac the Syrian, for instance, said, you've been, you know, this life has been given to you for repentance. Don't waste it on. I can't remember the rest of the line, but like, frivolous pursuits or something to that effect. Yeah. And so what does that mean, right? This life is given to us for repentance. It's that we've been given this tool of mutability, of mortality, of changeability. And now, mind you, we don't know exactly how that works in a kind of a mechanistic way way. Like, why is it that mortality makes repentance possible? We don't know. But this is what the Holy Fathers say, and it is what we see demonstrated in Scripture, and it is essentially what God is giving Adam and Eve there at the end of chapter three of Genesis. Since that we have that, then we should use it. And one of the reasons, and you made this point earlier, Father, is it is a profoundly hopeful thing because it means that I am not stuck with. This is just who I am. I'm not stuck with that. I do not have to be tomorrow what I was today. I don't have to be today what I was yesterday. I can change now. I can change for the worse. I've done that many times in my life. Or I can also change to be more like Christ. I can change to become more like the angels. I can change to become a saint. This possibility exists for every human person. And the reason why we can change is because of this mortality that we have. Again, we don't know exactly how it works, but that is what it is, right? That is what mortality is. It's a gift from God. And so many of us in our lives are driven by all kinds of desires and ambitions and perspectives, pursuits, right? We have things we want to build. We have families, careers, our homes, our social networks, whatever. And many of these things are good, right? They're good. You know, not every ambition or desire is bad. But if we can take the investment that we put in that and reinvest it and place it in the life in Christ, all those other pursuits can be sanctified and can come along right on that. But if we aim at those created experiences and Achievements rather than putting our goal to be Christ, then we'll lose all of it. You know, C.S. lewis, not an orthodox writer, but nonetheless he said some good things. He made this comment in one of his books. He said, if you aim at heaven, you will get earth thrown in. If you aim at earth, you will get neither. And if we place all of that desire that we tend to put in, all these things that we spend so much time trying to build, and again, they may be good, if we put that in the goal that is Christ, if we put that in our salvation, then the whole world is lit up with this beautiful light as it stands out in relief, you know, from the darkness of this world. And all then becomes finally realized in Christ there is an unconquerable hope that we have. I mean, the Lord spoke about this, right? He said, you know, in this world you're going to have trouble, but be of good cheer, for I have overcome the world. And if we are aiming at Christ, if Christ is our goal, if we are, as St. Basil said, bidden to be God, and we make that who we are, then we will have that good cheer, that joy. Christ's joy will be given to us whatever is going on in the world, right? And this is the gift of God to us in mortality. But we only have it while we're in this life. Once your soul separates from your body, once the life of your body has gone out, you don't have it anymore. So this is the opportunity. Now, today is the day of salvation, Father."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9404.04,"end":9777.52,"speaker":"Fr Stephen De Young","text":"So I think sort of the last distinction we made in the third half is very important in a whole bunch of ways to understanding a whole bunch of things, but one of them at least, and I'm talking here about the distinction between sort of the destiny of man in theosis, the way in which every human person is bidden to become God, that God is the end, the telos of humanity, the sense of what our existence is aimed toward, that on the one hand, and then on the other hand, our ongoing battle with the passions, our ongoing efforts for sort of self mastery in the face of them, and of repentance and healing. That distinction, I think, helps us really understand why the various other religions, philosophies of the world seem sometimes to have some kind of purchase. If we only have the struggle with sin, the struggle with the passions, the goal of repentance and self mastery, if that's all we have in view in terms of salvation, then it can be very confusing when we look at the other philosophies and religions in the world, because it seems like will. Some of these seem kind of helpful and some of the people who are advanced in these philosophies or religions seem to be doing better with some of these things, like in terms of patience and self control and even kindness and gentleness, right? These things that we say are fruits of the spirit, they seem to be ahead of me, right? And they're not Christians. And it is true, right? Pursuing stoicism will help you gain a certain degree of self mastery, will help you resist temptations to anger. It will help you in various ways navigate this world. Sigmund Freud, complete atheist, could come and tell you there are these drives within humanity, you know, the death drive driving you toward death and destruction, these sexual drives, these drives that you have to, you know, contend with and help you uncover them and see how they're working in your life. And psychotherapy can lay these things out for you. All of these philosophies and religions can help you in various ways navigate this life in this world. But again, that's a parenthesis. They're able to do that because as humans we could observe this world and life in this world and ourselves and how they work and come to some level of understanding. But none of those things can move us an inch toward our destiny in Christ. None of those things can take us beyond what we now call human, which is this weakened, prone to sin, fallen humanity of this world. None of them can take us beyond that. None of that can align our will and our human powers and abilities with what God is doing in the world. They can't even reveal what God is doing in the world. They can only reveal what we are doing in and to ourselves. And so this really points us to the uniqueness of Christ. There is a certain utility to all manners of philosophy and thought and even human religions, even the ones that are worshiping demons, right? There will be people with valid insights into human behavior within this world and what brings success in this world. But again, none of them show us what it means for our humanity to be perfectly united to God. And none of us will give us the means of pursuing it. And none of them will reveal to us the love that God pours forth day to day upon his entire creation. None of them will reveal to us the way to make the peace, that is the peace of God. The peace where there's no such thing as an enemy come to be in the world. None of them will show us what true kindness, what true generosity, what a self control and self mastery looks like that is aimed toward becoming something better than what we now call human. So it's only in Christ that we can become fully human. It's only in Christ that the goal for which humanity was created can be seen, let alone achieved. And we need to set our sights beyond just making it through this day without yielding to all the manifold temptations that I've fallen to in the past, and to actually being faithful, to encountering and becoming more like Christ. We've set our sights too low for too long, and we've put way too much emphasis on what's in the parenthesis, what's in the footnote, rather than what's in the real story that's being told. Those are my final thoughts."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9778.08,"end":9797.59,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Thank you for listening everyone. If you didn't get through to us live, we'd still love to hear from you. You can email us at LordOfSpiritscientientFaith.com, you can message us at our Facebook page or leave us a voicemail@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9799.43,"end":9805.75,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9806.39,"end":9816.64,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere. But most importantly, please, please share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9817.52,"end":9828.72,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. And thank you to our periodic guest tonight, Mexican radio station."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9829.52,"end":9832.56,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you."}
{"episode_id":"LOS - #047 - 2022-07-14 - Fall of Man Part 1 - Garments of Skin","start":9850.41,"end":9887.46,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
