{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":0.32,"end":64.94,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":66.7,"end":100.28,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, my giant killers, my dragon slayers, my stompers on serpents and scorpions. You are listening to the Lord of Spirits podcast, also known as Father Stephen keeps Father Andrew up past his bedtime. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana, and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. If you're listening to us live, you can call in at 855- AF-RADIO. That's 855-237-2346. Just like the voice of Steve and Matushka, Trudy will take your call, which we're gonna get to it in the second part of our show."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":100.52,"end":102.76,"speaker":"Fr Stephen De Young","text":"Now, I know we're live."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":103.56,"end":104.12,"speaker":"Fr Andrew Stephen Damick","text":"We are."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":104.36,"end":106.36,"speaker":"Fr Stephen De Young","text":"But are we all the way live?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":108.04,"end":111.16,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. There are prerecorded bits, like the voice of Steve, for instance."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":111.56,"end":118.76,"speaker":"Fr Stephen De Young","text":"Right? Oh, so you're saying, but you and I, are we now all the way live?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":119.08,"end":121.48,"speaker":"Fr Andrew Stephen Damick","text":"Are you telegraphing our next episode or."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":121.72,"end":123.64,"speaker":"Fr Stephen De Young","text":"Do our live amps go to 11?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":126.44,"end":126.92,"speaker":"Fr Andrew Stephen Damick","text":"They do."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":127.32,"end":127.8,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":127.8,"end":208.82,"speaker":"Fr Andrew Stephen Damick","text":"Where a man's a man. Yes. So Lord of Spirits is brought to you by our listeners and also by Chrysostom Academy. Now, I know a lot of you listeners out there, you work from your homes, and if you're telecommuting, you can probably live just about anywhere you like. So if you're a parent of school age kids and you're like me, where you work from a remote or virtual office, then one of the big considerations for where you live is where your kids go to school. I personally love living in the Lehigh Valley of Pennsylvania. Been here for 14 years and part of why is because my kids go to Chrysostom Academy, which is a pan orthodox classical school with elementary through high school students. It's on a beautiful 55 acre campus, it has the highest academic standards, and it's focused not just on educating the mind, but forming the whole person in Christ. So if you don't live here yet, think about moving to the Lehigh Valley, sending your kids to Chrysostom Academy. And even if you don't telecommute, our local economy is growing, producing jobs. You can work at the Pepys factory. We've got eight Orthodox parishes in our metro area. And you can visit chrysostomacademy.org to see what I'm talking about. And my wife and I just went to parent teacher conferences at the Academy this afternoon and we were informed that all the girls are strong, all the boys are good looking, and all the parents are above average."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":210.51,"end":215.15,"speaker":"Fr Stephen De Young","text":"So I have a question related to your own personal expertise and lived experience."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":216.11,"end":216.67,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":217.15,"end":220.19,"speaker":"Fr Stephen De Young","text":"So you were a stagehand for many years."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":220.43,"end":221.83,"speaker":"Fr Andrew Stephen Damick","text":"That's correct. A decade."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":221.83,"end":224.11,"speaker":"Fr Stephen De Young","text":"And you now live in the Lehigh Valley."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":224.27,"end":224.75,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":225.95,"end":230.67,"speaker":"Fr Stephen De Young","text":"How many peeps must be consumed in a play before it is officially a peep show?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":233.87,"end":236.59,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I somehow did not see that one coming."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":239.08,"end":245.8,"speaker":"Fr Stephen De Young","text":"I'm just wondering at what it crosses that Rubicon tonight."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":247.56,"end":303.19,"speaker":"Fr Andrew Stephen Damick","text":"Can I continue? I don't know. Tonight we wrap up our now 10 part series on the sacraments of the Orthodox Church. Though of course we could do more. It doesn't have to be just 10, but we're going to wrap it up tonight. And we're also coming to you a week earlier than we normally would because next week for the Orthodox Church is Holy Week. And now our following episode is going to be on the 27th of April, God willing. So it's going to be a few weeks. This episode, though, is about the great blessing of the waters. Orthodox Christians usually experience this service at Theophany, which is the feast of Christ's baptism, but it also happens as part of the baptismal service. So what exactly does it do? It makes holy water. But what is holy water? Is it magic water? What is it for? And does the sacrament have a basis in the scriptures? So obviously though, that means we're going to start with blood, right? Blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":305.11,"end":319.12,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. And you know, you're trying to ruin one of my jokes because in the script you had blood actually. Blood, actually, which people may not realize is the title of the horror parody of love. Actually."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":320.96,"end":322.8,"speaker":"Fr Andrew Stephen Damick","text":"I actually did not know that."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":323.04,"end":346.25,"speaker":"Fr Stephen De Young","text":"The signs that Rick Grimes holds up are very different in that one than in love, actually. But as you mentioned, this is the conclusion of our sacrament series. Right. We could have sort of punted to the. Well, in the perception of the Orthodox Church, the whole cosmos is a sacrament."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":346.73,"end":347.49,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":347.49,"end":350.57,"speaker":"Fr Stephen De Young","text":"Right. So technically everything is right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":350.65,"end":354.29,"speaker":"Fr Andrew Stephen Damick","text":"I've seen lists like 7, 8, 9, 23. I mean."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":354.29,"end":393.3,"speaker":"Fr Stephen De Young","text":"Yeah. And potentially we could list everything, but we're not going to do that. Although tonight we're sort of going to do that. And that's why we're concluding where we are. But as you mentioned, we're starting by talking about blood. And if we're going to talk about blood in the Bible, then we got to start with not creation. We'll get there later on. But we have to start with Abel's blood, which is the first blood that we see. The first blood that leaves someone's body, at least as far as we know."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":394.3,"end":395.34,"speaker":"Fr Andrew Stephen Damick","text":"First Blood, Part one."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":397.1,"end":399.5,"speaker":"Fr Stephen De Young","text":"Yes, well, First Blood was just called First Blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":400.06,"end":401.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":401.1,"end":404.22,"speaker":"Fr Stephen De Young","text":"And then it was Rambo First Blood Part two."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":404.38,"end":404.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":405.02,"end":424.6,"speaker":"Fr Stephen De Young","text":"And then just Rambo three, which makes no sense. Right? Yeah, but really, are we. Are you looking for a Rambo movie to make? Actually, the first, the first one. See, now you got me on this thing. The first one is actually a very different movie from the rest of the series."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":426.28,"end":428.4,"speaker":"Fr Andrew Stephen Damick","text":"It's been so many years since I've seen anything."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":428.4,"end":432.76,"speaker":"Fr Stephen De Young","text":"The original First Blood is a story of a traumatized Vietnam veteran."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":432.84,"end":433.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":433.56,"end":450.76,"speaker":"Fr Stephen De Young","text":"Being hassled by the police in this town. Like, it's a very different kind of movie. It's very much a 70s cinema kind of film. And then once you get into two and three, it just turns into like classic Arnold Schwarzenegger, Sylvester Stallone, Jean Claude Van Damme action movie."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":451.4,"end":452.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":452.16,"end":490.58,"speaker":"Fr Stephen De Young","text":"And then the third one is. Was dedicated originally to the brave fighters of the Mujahideen. So there's that. Okay, back to our topic. Yeah. So it's. It's Abel's blood that first gets shed. And when the blood is mentioned, it's not. Right. Of course, the actual murder of Abel is not described in some kind of gory detail about what happens with the blood. Where the blood comes in is God speaking to Cain and talking about Abel's blood crying out from the ground."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":490.98,"end":500.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which there are actually icons of this. Of this little sort of red man. This little red man crying out from the ground to God."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":502.02,"end":503.62,"speaker":"Fr Stephen De Young","text":"Who is like blood cells or something."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":504.02,"end":509.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's, it's, it's, it's weird, but, but interesting. Yeah, definitely. Yeah, yeah, yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":509.85,"end":550.66,"speaker":"Fr Stephen De Young","text":"And so in this case. So in this first case, we're seeing sort of shed blood as symbolic in the larger sense of the word of guilt. Right. And the looming prospect of vengeance. Right. Of. Of consequences. And this gets further developed within Jewish literature, especially once you get into the Second Temple period where Abel becomes sort of the paradigmatic martyr."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":551.54,"end":552.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":552.14,"end":730.08,"speaker":"Fr Stephen De Young","text":"Right. So I know we've mentioned on a previous episode, I think it was when we did the sort of geography of the underworld that we talked about this, that in first Enoch, when Enoch is being taken by the archangels on his tour of the cosmos and they go into Hades, he sees these four caves in Hades, and the four caves are there to separate the righteous, the wicked, the ignorant and the martyrs. And then each of those has a separate sort of fate coming to them at the last judgment. So already in first Enoch, Hades is sort of this intermediate place, right. And the way he identifies in his vision the cave of the martyrs as the cave of the martyrs is that he sees one particular soul, it says, standing sort of outside the cave and sort of crying out toward the heavens. And he's told by the archangel that that is actually Abel, who is there crying out to God for justice. So he, of course, is not. Even if we're talking in pre Christian terms, he is not the last martyr, Right. There's the Maccabean martyrs. And in the various texts, mostly second and fourth Maccabees, that discuss the Maccabean martyrs, those texts are where, in the Second Temple period, sort of the Jewish understanding of martyrdom sort of becomes fully formed. But this allows, for example, Christ to say, the blood of all the martyrs, from Abel to Zechariah, the son of Neriah, who was slayed between the altar, the high place will come upon this generation. Right? And everyone knows what he's talking about, Right? Because there is this understanding, right, of blood that is shed in unrighteousness and injustice, right? This is an injustice where the correct order of things has been thrown off. And the blood itself, right? The victim, his existence as victim, his blood which was shed itself, cries out to God for the justice to be restored, which is going to be bad news for the person responsible. The next sort of important discussion of blood comes after the flood, right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":730.4,"end":733.76,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, this is a ways in the future, but."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":734.56,"end":736.84,"speaker":"Fr Stephen De Young","text":"Right, but not that far. The text, right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":736.84,"end":737.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":737.12,"end":760.12,"speaker":"Fr Stephen De Young","text":"No, Genesis 4 to Genesis 9, right? So we're jumping five chapters. And after the flood, this is when Noah and his family are given permission to start eating animals. But it is specified that while they are allowed to eat animals. They are not allowed to eat the blood of animals."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":761.24,"end":777.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is interesting partly because to me, anyways, even though this is not in the Genesis text, a lot of the other second temple Jewish literature that comments on Genesis mentions that the giants wiped out by the flood are cannibals."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":778.6,"end":778.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":778.88,"end":792.72,"speaker":"Fr Andrew Stephen Damick","text":"That they're eating each other and eating humans and all that kind of thing. So it's interesting that there's this kind of like, well, okay, it is okay to eat meat, but not blood. And although it's not said here, definitely like not people."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":793.84,"end":842.09,"speaker":"Fr Stephen De Young","text":"Yeah, right. Well, that. That's going to involve the other thing that is mentioned here, obviously, if you're eating a person. And that's because this is in the same context as the commandment, he who spills man's blood social, his blood be spilled by man. Because man is made in the. In the image of God. Right. And it even says here that God is going to demand an account for the blood of every human, even from animals who eat them. And this is a biblical pattern to notice, right. Is that when something is sort of being presented in extremists, in the scriptures, you get animals invoked."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":842.65,"end":847.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. This is verse five, like, from every beast I will require it and from man."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":847.85,"end":865.13,"speaker":"Fr Stephen De Young","text":"Yeah. So you get that here. You get that. Some other examples of that. Right. The very end of the book of Jonah. Right. In this city there are all these people who don't know their right hand from their left and many cattle and also much cattle. Yeah, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":866.1,"end":866.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":867.78,"end":939.55,"speaker":"Fr Stephen De Young","text":"So, right. So this is sort of the taking it, you know, the in extremists kind of, kind of position. Right. But both of these. Right. The blood is the life of the thing. Right. And we've mentioned before on the show that there's this pattern in the early chapters of Genesis where you go from in paradise eating fruit, which doesn't even kill a plant. Right. Does no harm even to the plant, really long term. Where the creation is sort of offering itself to humanity for food, to Adam after the expulsion from paradise, having to work the ground to bring forth food by the sweat of his brow, sort of having to work and cooperate with it to produce food. And so when we get to this point where man is being given permission within the context of eating to kill animals, there is still this barrier placed to it which is designed to prevent man from becoming completely predatory."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":940.43,"end":941.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":941.91,"end":982.07,"speaker":"Fr Stephen De Young","text":"Humans are not to live as predators on the earth, and requiring a person before they eat an animal to drain the blood, to properly prepare it to go through these other processes prevents that. And there were pagans who, obviously we've talked before about human sacrifice and related cannibalism, but there were also various pagan rites, the Dionysian mysteries being one example, where they practice homophagy, which is eating animals alive."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":983.51,"end":984.23,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":985.27,"end":991.11,"speaker":"Fr Stephen De Young","text":"Where they would capture animals and just bite into them while they were still alive, like. And kill them while eating them."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":992.07,"end":992.71,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":994.23,"end":1008.94,"speaker":"Fr Stephen De Young","text":"So that. And. And that in those rights. Right, like the Bacchic rights, the idea there is that humans are becoming more animalistic. Right. Giving reign to some kind of predatory impulse."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1009.26,"end":1019.1,"speaker":"Fr Andrew Stephen Damick","text":"You know, people talk about those Bacchic rights basically, as just being a bunch of people getting drunk and then doing embarrassing things. But apparently it also involves biting into live animals."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1019.42,"end":1024.4,"speaker":"Fr Stephen De Young","text":"Yes. It was a much darker thing. It wasn't just a frat party. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1024.4,"end":1029.04,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I'd like to say that this is a ruined Sunday school moment, but I'm like, that would be a weird Sunday school to begin with."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1029.44,"end":1048.08,"speaker":"Fr Stephen De Young","text":"Yeah. If that's what you're talking about. Yeah. Right. But so. So this is. This is an impediment. Right. But all of the impediment, everything else is all based around this idea that the blood is the life of the person, the animal."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1048.24,"end":1048.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1049.12,"end":1053.68,"speaker":"Fr Stephen De Young","text":"Right. And therefore has to be treated in a certain way."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1054.59,"end":1054.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1056.19,"end":1074.27,"speaker":"Fr Stephen De Young","text":"So what that concretely meant, for example, you're gonna be. And for a good chunk of human history, pretty much all the meat that was consumed by people was consumed in the context of animal sacrifice. People did not eat a lot of meat."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1074.43,"end":1079.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was not just go down to the local, you know, McDonald's or whatever and have a Big Mac."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1079.97,"end":1111.65,"speaker":"Fr Stephen De Young","text":"Right. And so if you were going to kill an animal for meat, you almost always sacrificed it to whatever God you worshiped before you did that. Right, Right. And the eating of it was in that. That ritual context. So essentially, the blood handling for an animal you were going to eat in the Torah is not fundamentally different practically from the blood handling for an animal sacrifice, because those were the same thing almost always."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1112.13,"end":1112.53,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1114.29,"end":1123.17,"speaker":"Fr Stephen De Young","text":"So what do you do with blood? Right. You go and you pour the blood out at the base of the altar. You pour it into the ground."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1123.97,"end":1139.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's what Leviticus says to do, which that all about, because pouring. Like there's a pagan practice, Right. Of pouring blood into the ground. And the whole point is to kind of feed the spirits. We've talked about this. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1139.32,"end":1140.6,"speaker":"Fr Stephen De Young","text":"Well. Into a grave."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1141.08,"end":1142.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Into a grave."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1142.2,"end":1143.08,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1144.28,"end":1147.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that's not what's going on here. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1148.6,"end":1262.5,"speaker":"Fr Stephen De Young","text":"Right. So in most, usually when that was done with the blood being poured into a grave. So for example, in Greek temples, ancient pagan Greek temples, they would typically have the central shrine to the God or goddess, and then attached to that would be another shrine which was the tomb of what they called a hero, which is where we get the word hero. Right. But it was sort of, as we've talked about before, a different kind of term in that this was often a founder figure of a city, a great leader from the city's past. Right. This kind of thing. Right. And the blood from the sacrifices offered to the God or goddess would be taken and poured into the grave of the hero. And the idea there was that, as you see dramatized, for example in the Odyssey, when Odysseus goes to speak to the shade of Achilles, this is sort of keeping the shade, the shadowy existence of the person in the netherworld around. Right. Keeping it from fading off into oblivion. In other pagan rites, the blood was just consumed by priests or participants. It was sometimes given as drink to the God or goddess or spirit. Right. That kind of thing. So a big part of pouring it into the ground, specifically at the base of the altar, is it's a way of disposing of it that prevents all those other potential uses."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1262.98,"end":1263.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1265.7,"end":1271.38,"speaker":"Fr Stephen De Young","text":"And we still do this in the Orthodox Church. Right. This is the way you dispose essentially of sacred liquids."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1272.73,"end":1273.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1273.49,"end":1274.57,"speaker":"Fr Stephen De Young","text":"Pouring them into the ground."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1274.73,"end":1280.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, into the ground. Not in any random place, but a set aside reverential place."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1280.57,"end":1316.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Where it's not going to be walked on. But this image of the blood, the life of a sacrifice being poured out at the base of the altar, that symbolism then gets picked up later in the Scriptures. A good example of this is in the book of Revelation. The martyr, their souls, their lives are beneath the altar in heaven that St. John sees. And they're there crying out for justice."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1316.93,"end":1320.69,"speaker":"Fr Andrew Stephen Damick","text":"Not coincidentally, it's the Abel. Yeah, it's the Abel thing all over again."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1320.85,"end":1342.46,"speaker":"Fr Stephen De Young","text":"Right. They're there crying out, how long, O Lord, will our blood go unavenged? Right. And so this is not the idea here, is not that by pouring out the blood of the base of the altar, you are feeding the souls of the martyrs. Because of course, this wasn't happening in Christian circles by the time the book of Revelation was written."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1344.46,"end":1344.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1344.78,"end":1348.54,"speaker":"Fr Stephen De Young","text":"They weren't like taking the blood of Christ in the Eucharist and pouring it into the ground."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1349.1,"end":1349.5,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1349.98,"end":1379.41,"speaker":"Fr Stephen De Young","text":"Right, right. So that was no longer part of this. So that's not in view there. Right. But it's picking up this martyr idea, but just their location is related to this because, of course, St. John is wanting to present the martyrs as people who have offered their deaths as sacrifices to God. Their death was a violent death."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1381.49,"end":1381.73,"speaker":"Fr Andrew Stephen Damick","text":"At."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1381.73,"end":1425.95,"speaker":"Fr Stephen De Young","text":"The heads of violent people. That's what makes them martyrs. But they are, through their prayers, wanting to transform it into a sacrifice. Right. On behalf of themselves and their people. And again, you can read 2nd and 4th Maccabees for more of this. Right. Theology of martyrdom as it grew up. So the other thing, or a couple other things are done with blood, though. So there are a few cases in the rituals of the Torah where the blood is not immediately poured out at the base of the altar, but is used for something else."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1426.19,"end":1430.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just disposed of, but utilized."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1430.75,"end":1481.62,"speaker":"Fr Stephen De Young","text":"Yeah. So one of these is when the tabernacle. And it's accoutrement. Right. The furnishings, the objects that we've talked about in a previous episode, they were all. When they were dedicated, they were set apart and purified by blood by being smeared with animal blood. And so a lot of what's happening here, I won't jump ahead. This seems counterintuitive to us. Right. Like, if I got animal blood all over myself, I would not be like, ah, finally, I am clean and purified. Right. No matter what animal it was, your."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1481.62,"end":1483.7,"speaker":"Fr Andrew Stephen Damick","text":"Mom would say, that's never going to come out."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1484.02,"end":1498.54,"speaker":"Fr Stephen De Young","text":"Yeah. Nor would if, when I was a kid, they had told me to. To clean up my room and I had covered everything. I had splattered animal blood everywhere. Would they be like, good job. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1500.78,"end":1507.74,"speaker":"Fr Andrew Stephen Damick","text":"Pretty much A very macabre episode. Yes. There will be blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1508.46,"end":1520.3,"speaker":"Fr Stephen De Young","text":"Yes, I drink your milkshake. So the. But something is going on here because this isn't just any blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1520.77,"end":1520.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1520.97,"end":1529.17,"speaker":"Fr Stephen De Young","text":"It's not just like, hey, drain me a bunch of animal blood because it makes good detergent. Right. This is sacrificial animal blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1529.73,"end":1530.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1530.93,"end":1551.96,"speaker":"Fr Stephen De Young","text":"That's being used for this and is seen to purify and consecrate and set apart these physical objects. There are a couple of other instances in which sacrificial blood that is collected rather than being disposed of at the base of the altar gets put on people."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1553.24,"end":1561.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, this is not all the time. This is some very specific circumstances. Like this is not part of the regular sacrificial pattern."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1561.64,"end":1638.86,"speaker":"Fr Stephen De Young","text":"Right. One of these only happens once total. The other one is. Well, so the other one is. And we talked about this in our episode on ordination was in the ordination of a priest in the Torah, where Sacrificial blood was smeared on the right ear lobe, right thumb and right toe. And we talked in that episode. You can go back and listen to more about that. But how that was. Sacrificial blood had been used to consecrate the altar. And so sacrificial blood was being used to create sort of a tether, a connection between that priest as a human who's been dedicated and the altar which has been dedicated. So that happened only when a priest was ordained and began his service. The other major instance was in the ratification of the covenant at Mount Sinai. After Moses had come down and read the commandments, the people all said, oh, yeah, we're going to do all those things."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1639.26,"end":1641.34,"speaker":"Fr Andrew Stephen Damick","text":"And then they proceeded not to."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1641.5,"end":1653.66,"speaker":"Fr Stephen De Young","text":"They proceeded not to do any of those things. But they said, yeah, sounds good to us. We're in. We're going to do all these things. And then Moses took sacrificial blood and sprinkled them with it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1655.24,"end":1658.68,"speaker":"Fr Andrew Stephen Damick","text":"So it's kind of a consecration of the nation, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1659.08,"end":1703.51,"speaker":"Fr Stephen De Young","text":"Of them being set apart and having this relationship with God right through his covenant issued at Mount Sinai. Now, as a note, since we're coming up on Holy Week and we have some very well educated folks in the Orthodox Church who haven't managed to puzzle this out. So we're going to help some folks. There is this now infamous line in St. Matthew's Gospel. We've talked before on the show about how misunderstood the whole passion narrative in St. Matthew's Gospel is by modern people. Bluntly, because they don't know the Torah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1704.63,"end":1710.11,"speaker":"Fr Andrew Stephen Damick","text":"Right, people? Yeah. St. Matthew knew the Old Testament. How about that?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1710.11,"end":1735.17,"speaker":"Fr Stephen De Young","text":"St. Matthew, highly familiar. Yeah. So. And we've talked before about the idea that St. Matthew is sort of presenting Christ as both goats in the day of atonement and some things related to that. But the very infamous line, right, is when the crowd shouts out his blood, be on us and on our children."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1735.81,"end":1749.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which a lot of people take that then to be this sort of anti Semitic thing, which is number one, kind of hilarious because like Matthew's Gospel is, I don't know, sort of the most Jewish of the gospels."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1749.53,"end":1752.09,"speaker":"Fr Stephen De Young","text":"Well, it's written by a Jewish guy."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1752.33,"end":1753.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1753.37,"end":1757.13,"speaker":"Fr Stephen De Young","text":"About Jesus, who was Jewish. Sorry, Greek."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1758.81,"end":1771.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, so the idea then, you know, that the way that people sometimes read this is like he's depicting it as we're all guilty and we'll be guilty forever. You know, we're the Jesus killers."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1772,"end":1783.52,"speaker":"Fr Stephen De Young","text":"To be fair. To be fair, in the medieval west and elsewhere, that text was weaponized in that way against Jewish people in Jewish communities."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1783.76,"end":1787.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So this has been read in this way for a long time."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1787.6,"end":1837.27,"speaker":"Fr Stephen De Young","text":"Right. So Jewish people who have those associations with it, I don't blame. Right. That it's hard to have distance on that. Right. Modern educated scholars and people who don't get this, I have less sympathy for. Right. Because it's pretty obvious again, if you know the Torah, what St. Matthew is doing. St. Matthew is just like with the. We talked about how he presents Christ being mocked and spat on and hit with the reed and how that's exactly how the driving of the goat out of the city was presented in the Epistle of Barnabas in the Day of Atonement ritual."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1837.43,"end":1837.99,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1838.23,"end":1860.93,"speaker":"Fr Stephen De Young","text":"And so the idea there, Right. Is that, well, these people are just hating Jesus. Right. And mocking him and hitting him and spitting on him. But St. Matthew is presenting this as despite what they intended, despite their evil intent. Right. That Christ was serving as the goat and taking away their sins."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1861.57,"end":1868.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. And what does the blood of Christ do? If it's on you, it purifies you. It cleanses you."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1868.37,"end":1875.89,"speaker":"Fr Stephen De Young","text":"Right. Yeah. So what St. Matthew is presenting here is that Christ's blood is the blood of the new covenant."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1876.62,"end":1878.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It consecrates this nation."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1878.78,"end":1927.11,"speaker":"Fr Stephen De Young","text":"And while when they shouted that thing, they shouted it out of hatred. Right. That Christ. Right. Christ is the ultimate fulfillment of that whole idea of a sacrificial death of a human in the preceding Jewish literature and in the Scriptures. Right. Christ turns that to good, to the good of the people who are doing evil. This is why if you're an orthodox Christian and you've been doing the readings you're supposed to be doing, or you went to pre sanctified liturgy last night. Right. You heard the story of Joseph, and Joseph saying, when you sold me into slavery in Egypt, you meant it for."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1927.11,"end":1927.55,"speaker":"Fr Andrew Stephen Damick","text":"Evil."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1929.44,"end":1940.72,"speaker":"Fr Stephen De Young","text":"But God meant it for good and used it to save the lives of his whole family. That's why we're reading that now. So that when we hear this stuff in St. Matthew's Gospel, we'll get it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1941.44,"end":1942,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1942.08,"end":1949.92,"speaker":"Fr Stephen De Young","text":"Right. And we won't just go online in Virtue Signal by calling it anti Semitic and saying, oh, tut tut. Right. I'm not referring to anyone in particular."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1951.04,"end":1955.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. No, I mean, I feel like I see this every year."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1957.97,"end":1965.73,"speaker":"Fr Stephen De Young","text":"Yes. And it's. Again, read your subtitles. We have a signed reading during Lent."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1966.61,"end":1967.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1967.89,"end":1988.91,"speaker":"Fr Stephen De Young","text":"It's Genesis, Proverbs, Isaiah, and then there's going into Holy Week, there's story of the Exodus, the Book of Job, there's a reason why the church gives us this assigned reading so that when we go to church and hear the hymns, we'll understand what's going on."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1989.39,"end":1991.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":1992.51,"end":2017.01,"speaker":"Fr Stephen De Young","text":"And so we have to take accountability for our own failure to understand because it's usually based on us not doing what we were supposed to be doing along the way. Right. We expect to be able to just walk into a service, hear things, and whatever it seems to be saying on the face, like, well, that's what it's saying. And I just react and I have opinions and let me voice them online."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2019.89,"end":2024.05,"speaker":"Fr Andrew Stephen Damick","text":"Or. Or. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2024.85,"end":2037.97,"speaker":"Fr Stephen De Young","text":"So anyway, we'll end that particular rant. This is becoming a theme of me going after not any particular person on the show."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2040.38,"end":2040.62,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2043.02,"end":2089.3,"speaker":"Fr Stephen De Young","text":"Another important use of blood, and there are several places where this occurs in the Hebrew Bible, but one of them that's important and recognizable to a lot of folks is the one that's in Psalm 51 or 50 in the Greek numbering, which is usually translated in English. Deliver me from blood guiltiness. If you look it up, the Hebrew is literally bloods. It's damim. And so it's literally deliver me from bloods. That's not because the author was a crip."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2090.66,"end":2092.66,"speaker":"Fr Andrew Stephen Damick","text":"Man, you got to that joke faster than I did."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2094.93,"end":2102.53,"speaker":"Fr Stephen De Young","text":"Sorry, let me get one, man. Anyway, so I'm the one who grew up in Southern California. I have rights."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2103.97,"end":2107.65,"speaker":"Fr Andrew Stephen Damick","text":"You know, I read about it out in the news. Yeah, yeah, yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2110.93,"end":2132.78,"speaker":"Fr Stephen De Young","text":"So, yeah, deliver me from bloods. And that is an idiomatic phrase. Right? Bloods. Blood in the plural, bloods refers to this idea of, like, Abel's blood, like the blood that implies guilt, the blood that's crying out for vengeance, being caught."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2132.78,"end":2134.06,"speaker":"Fr Andrew Stephen Damick","text":"Red handed, as it were."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2134.62,"end":2137.06,"speaker":"Fr Stephen De Young","text":"Yes, yes. You have blood on your hands."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2137.06,"end":2162.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, Right. I mean, and of course, you know, from the Scottish play where. Where Lady Macbeth says, out, out, damned spot. It's not, you know, it does not mean as I thought when I was younger, you know, get the dog out of here at a time like this. But turns out to be that she's cleaning blood off of her hands because she and her husband are murderers. Oh, spoiler alert. Hey, the play's been out for over 400 years."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2162.59,"end":2164.75,"speaker":"Fr Stephen De Young","text":"Some. Some salty language tonight on."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2164.75,"end":2169.07,"speaker":"Fr Andrew Stephen Damick","text":"That's true. I'm just quoting Shakespeare and not even one of the body bits."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2171.51,"end":2264.95,"speaker":"Fr Stephen De Young","text":"So. Yeah, so. And this, of course, is. Is not just, oh, I feel really guilty. Right. This is in the context of David's repentance. Right. So David had a murder victim, right, whose blood was potentially crying out to God, right. For vengeance. And he's praying and asking God to deliver him from that, to save him from that, because he. He knows he deserves that right, that justice should be established. Justice is a good thing. And justice being established between him and Uriah the Hittite does not look good for him. Right. And so he's asking in his repentance to be delivered from that. We also see that blood as a substance, right. Although we've seen how it's used to cleanse and purify and purge, it is also treated as unclean when it gets on things. And that's even true of sacrificial blood and even true of sacrificial blood that's being used to purify things. So if you are the high priest on the Day of Atonement, and we're going to touch on. We've talked a lot about the Day of Atonement, but, you know, blame my dissertation on the show, but we're going to touch on that in a minute. But if you're, if you're the high priest doing the Day of Atonement ritual, which none of us will ever be. Let me be clear here. Don't try it in your garage. Don't."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2265.59,"end":2266.31,"speaker":"Fr Andrew Stephen Damick","text":"Please don't."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2266.71,"end":2267.19,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2267.91,"end":2271.19,"speaker":"Fr Andrew Stephen Damick","text":"I've seen people dressed up to try to do this. Please don't do that."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2271.43,"end":2290.35,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So if you're doing that and you've got this blood and you're using this blood to purify the objects of the temple, to clean them with the blood, and some of that blood drips on your garment, your garment is now unclean and has to be burned."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2290.99,"end":2291.39,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2291.79,"end":2437.79,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, Right. Which is not dissimilar to what happens in the administration of the Eucharist. If the blood of Christ drips on something note. So that's. So blood, even blood that's being used to purify, is treated as unclean in any context outside of that direct ritual application, even contexts that are incidental to that ritual application. So then, of course, yes, the Day of Atonement, as we've talked about before, the Day of Atonement is in addition to the regular cycle of daily sin offerings. This is the annual Day of Atonement. It's aimed at purifying the physical sanctuary. And so those furnishings of the tabernacle and the later temple that were originally dedicated and set apart through blood are reconsecrated, rededicated, purified from sort of the residue of sin by sacrificial blood. And we have the two goats, right? The one goat Carries the sins away. And then you do the cleanup. Right. Of the residue, the curse left by sin, with the blood without going way down the rabbit hole as much as that is my want in terms of how exactly the blood works to purify the things. And when I say go down the rabbit hole. Right. You could find. If you go and read the literature on the day of atonement, you will find that there are all kinds of the. Right. That the. The. The blood absorbs the residue of the sin, the blood destroys the residue of the sin, the blood wipes away. Cast this out. Right. All different kind of metaphors for how exactly this work. But the core idea, as we've said before on the show, is that blood is life stuff. Sin leaves behind death stuff. Life stuff gets rid of death stuff. Those are the things."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2437.79,"end":2442.99,"speaker":"Fr Andrew Stephen Damick","text":"I feel like that could be an advertising campaign. Like, you were talking about a variety of different cleaners."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2445.45,"end":2447.13,"speaker":"Fr Stephen De Young","text":"Get rid of blood in a spray bottle."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2447.45,"end":2451.13,"speaker":"Fr Andrew Stephen Damick","text":"Life stuff. Exactly. In a spray bottle, yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2451.29,"end":2460.25,"speaker":"Fr Stephen De Young","text":"Yeah, I don't think that would sell well, a spray bottle full of, like, sheep blood. But, you know, who knows what the future holds?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2460.33,"end":2482.95,"speaker":"Fr Andrew Stephen Damick","text":"You wouldn't believe some of the. I mean, you would. I think some of the advertising slogans. Like, I was literally driving by a vacuum repair shop today, and their advertising line was something like, we're going to set you up for suck cess. Like, I'm not even kidding. That was the. That was here in Emmaus, Pennsylvania. So if you're driving on Chestnut street, everybody, you'll see what I'm talking about."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2483.91,"end":2531.84,"speaker":"Fr Stephen De Young","text":"Yeah. Well, if it's related to cleaning fluids, I have to tell the tale of when I was maybe, oh, I don't know, four or five years old. I think my older sister and I came up with a brilliant scheme to make money. We did a lot of that. But this brilliant scheme to make money was we need to invent the ultimate cleaning product. So how do you do that? Well, we got an old mayonnaise jar and we cleaned it out and we said, well, we want to make the ultimate cleaning product that you can use to clean anything, right? Like glass, wood, right. Cloth, fabric, everything. So we got all the cleaning products in my grandma's house and mixed them all together in the mayonnaise jar."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2532.4,"end":2533.92,"speaker":"Fr Andrew Stephen Damick","text":"Which one of you fainted first?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2534.56,"end":2543.92,"speaker":"Fr Stephen De Young","text":"We did not. Because as soon as we had mixed them all, we immediately sealed it with the lid. So there was this literally black liquid substance."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2544.16,"end":2544.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2545.28,"end":2552.49,"speaker":"Fr Stephen De Young","text":"Within this jar. And then we went door to door in our neighborhood trying to sell it to someone. That's glorious."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2553.69,"end":2556.73,"speaker":"Fr Andrew Stephen Damick","text":"You know, anyone open up the mayonnaise jar."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2556.89,"end":2559.37,"speaker":"Fr Stephen De Young","text":"Here's the thing. I lived in a Dutch neighborhood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2562.65,"end":2562.93,"speaker":"Announcer","text":"So."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2562.93,"end":2564.25,"speaker":"Fr Stephen De Young","text":"You could guess how far that went."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2564.33,"end":2565.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. No."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2567.69,"end":2584.76,"speaker":"Fr Stephen De Young","text":"We couldn't give it away. So. And I think if you tried to sell spray bottles of sheep's blood, that's about how far you'd get in most places. And if you did find somebody who wanted to buy it, they probably someone. You should not go into their house."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2585.24,"end":2585.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2587.72,"end":2615.85,"speaker":"Fr Stephen De Young","text":"So, but where. Where does this all end up then, in terms of blood? Right. In. In the Old Testament is that as we've seen going through these different examples, blood has kind of this ambivalent symbolism, this ambivalent reality to it. Right. In. In the real sense of being ambivalent. Right. Two valences there. On one hand, blood is this purifying stuff. It's life."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2617.05,"end":2617.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2619.37,"end":2690.52,"speaker":"Fr Stephen De Young","text":"And has those ritual uses. On the other hand, at the same time, blood is extracted from someone or something by killing. Yeah, right. It comes from death. So blood is the stuff of life that comes from death. And so when that comes together, what you find and lying behind and connecting all of these examples we've been working through is this idea that life purification and transformation emerge from death and that within these rituals, blood is the agent by which life, purification and transformation are brought out of death. And it's this concept, Right. Which underlies the Torah, which underlies the Hebrew scriptures that, for example, St. Paul is appealing to when he's talking about baptism and death and resurrection and how Those relate that St. John in First John, when he talks about the blood of Christ purifying us."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2690.6,"end":2691,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2691.96,"end":2703.56,"speaker":"Fr Stephen De Young","text":"These are all connections being made between Christ and this underlying reality of the Hebrew scriptures and the Torah that already was there in talking about blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2705.72,"end":2715.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. All right. Well, that wraps up the first part tonight, and we'll be back in just a second with First Blood Part 2."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2715.71,"end":2731.95,"speaker":"Announcer","text":"Father Andrew Stephen Damick and Father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2738.99,"end":2805.59,"speaker":"Fr Andrew Stephen Damick","text":"This is Father Stephen Freeman. I'm happy to announce Ancient Faith's publication of my latest book, Face to Face Knowing God Beyond Our Shame. Some modern therapists have described shame as the master emotion, one that colors and shapes our world in ways that we hardly imagine. The Christian tradition is no stranger to this and has a rich understanding of the ways this part of our inner life shapes our experience of the world. This book all offers something of a roadmap to that inner life. What is shame? Is it always bad? Does it have any useful purpose for us? Join me in an exploration of knowing God beyond our shame. Finding the true God whom the scriptures tell us did not turn his face from the spitting and the shame face to face is now available@store.ancient faith.com. that's store.ancient faith.com."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2806.47,"end":2822.63,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2824.15,"end":2828.45,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. Again, it's Lord of Spirits, First Blood Part 2."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2829.09,"end":2834.93,"speaker":"Fr Stephen De Young","text":"Actually, actually, we're talking about water in the second half. Not."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2835.01,"end":2841.17,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there's not a Rambo movie for that, though, is there? Like a Rambo Water Second Water."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2841.33,"end":2842.01,"speaker":"Fr Stephen De Young","text":"No, that's."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2842.01,"end":2844.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Water World, not Rambo."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2844.37,"end":2847.01,"speaker":"Fr Stephen De Young","text":"Yeah, Water World. Incredibly underrated movie."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2848.21,"end":2848.61,"speaker":"Fr Andrew Stephen Damick","text":"Really."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2849.33,"end":2858.72,"speaker":"Fr Stephen De Young","text":"Any movie where people drive jet skis powered by crude oil is a good movie as far as I'm concerned. Best Aquaman movie ever made."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2861.52,"end":2864.08,"speaker":"Fr Andrew Stephen Damick","text":"That went in a very different direction than I thought it was going to go."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2867.28,"end":2875.92,"speaker":"Fr Stephen De Young","text":"Also, in relation to the commercial we just heard, I have not yet read Father Steven's book. Should I be ashamed of that?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2877.76,"end":2887.05,"speaker":"Fr Andrew Stephen Damick","text":"I think he would say so, but maybe he'll call in and let us know. I don't know. Father Stephen Freeman, if you're listening right now, give us a ring. We'll talk to you."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2887.05,"end":2891.53,"speaker":"Fr Stephen De Young","text":"Yes. Shame me publicly for not having read your book yet."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2893.69,"end":2926.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, okay. Well, we've talked about blood and now we are going to indeed talk about water. So this is, as I said, this is the second part of the show. Feel free to give us a ring. 855-AFRADIO. Again, that's 855-237-2346. Just like the voice of Steve said. It's getting to be a lot of Stevens, you know, Steve, although Steve Cristoforo actually is not Stephen. I mean, I think legally his name is Stephen, but his baptismal name is Stillianos still. Yeah, no, it's true. It's still."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2926.78,"end":2927.98,"speaker":"Fr Stephen De Young","text":"He's a fake Steve."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2928.94,"end":2955.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's interesting. I mean, it's one of, one of the fun things about the Greek American community and Greek Americans. You guys know what I'm talking about, right? You meet some guy named Steve, you know, his name is probably actually Stylianos. Or occasionally if you meet a Stan, it's Stylianos. If you meet a Pete, his name is probably not Petros. It's probably Paniotes. You meet a Billy, it's, you know, Vasilios. Y' all know what I'm talking about. So this is totally a thing. I mean, it's fine."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2955.88,"end":2956.32,"speaker":"Fr Stephen De Young","text":"It's great."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2956.56,"end":2958.8,"speaker":"Fr Andrew Stephen Damick","text":"It's lovely, you know, but I don't."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2958.8,"end":2964.56,"speaker":"Fr Stephen De Young","text":"Know, it can be a little AKAs, a lot of aliases. A lot of AKAs there on the permanent record."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2965.04,"end":2965.84,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2965.84,"end":2966.48,"speaker":"Fr Stephen De Young","text":"Suspicious."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2966.64,"end":2967.2,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2969.04,"end":2975.04,"speaker":"Fr Stephen De Young","text":"So anyway, I used, like, three or four different aliases to join Columbia House Record and Tape Club, so who am I to talk?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2976.48,"end":2980.16,"speaker":"Fr Andrew Stephen Damick","text":"Man, that's another good throwback reference. Nice."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2980.24,"end":2982.96,"speaker":"Fr Stephen De Young","text":"Yeah. I can't ever go to Terre Haute. I've got warrants."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2985.6,"end":2991.92,"speaker":"Fr Andrew Stephen Damick","text":"So, yes, Indianans, check. Check on that for us. Call the Terre Haute Police Department and see if that's true."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":2992.66,"end":2998.9,"speaker":"Fr Stephen De Young","text":"See if they're still after me or Edward Van Sloan or James D. Stephen. Nice."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3000.5,"end":3007.38,"speaker":"Fr Andrew Stephen Damick","text":"So we are talking about water. I mean, we didn't start with Genesis, you know, with Genesis 1 for the last."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3007.86,"end":3010.22,"speaker":"Fr Stephen De Young","text":"We started with Genesis, but now we are four."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3010.22,"end":3017.94,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, now we're hitting Genesis one. So Genesis one, it turns out there's water right right there at the beginning. Genesis 1, chapter 1, verse 2."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3018.7,"end":3077.97,"speaker":"Fr Stephen De Young","text":"Yeah. So not at the very beginning. Right. We're in verse two. Right. But right. We have this image of the spirit of God hovering. It's usually translated over the waters. As we've mentioned before, the word there that's translated, hovering is actually more like brooding and not the way we normally use it. Right. Like, if you're going to say that Donnie Wahlberg was the brooding new kid on the block, this is brooding in the original sense of a mother bird brooding over its eggs. Right, right, right. And so this is part of the bird symbolism. Note symbolism connected to the Holy Spirit. The Holy Spirit is not a bird. You should not draw a bird and say it's the Holy Spirit. This is bad."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3078.29,"end":3080.73,"speaker":"Fr Andrew Stephen Damick","text":"I mean, iconographically, that sometimes is a."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3080.73,"end":3083.45,"speaker":"Fr Stephen De Young","text":"Thing, but it's not only a theophany."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3083.45,"end":3085.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Holy Spirit is not shaped like a dove."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3086.13,"end":3147.27,"speaker":"Fr Stephen De Young","text":"Yes. Is not a bird. Don't do it. Not even once. But what's being portrayed there by the waters. Right. And this is. This is not. I won't directly shout out certain folks, but certain folks who hear this will get it. This is not talking about H2O. Right. This is not saying there was water, like what comes out of my tap before God created anything. Right. That's that. Yeah. You're pushing the wrong liberal buttons. That's where your brain goes. Right, Sorry, Kidnapp. So this is this. The waters here are primordial chaos."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3148.31,"end":3154.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so, yeah, waters is kind of the best image that fits this notion."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3154.87,"end":3199.24,"speaker":"Fr Stephen De Young","text":"Right, right. So this is, you know, primordial chaos. Right. The Holy Spirit is brooding over it before God begins to create. We've talked before several times about how first three days of creation are putting things in order and then structure, filling them with life. Right. So. But something interesting becomes apparent when you compare this creation story with creation stories and other stories from ancient Near Eastern cultures adjacent to near. Around previous to Israel."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3200.04,"end":3204.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's some, as we like to say, continuities and discontinuities."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3204.61,"end":3251.27,"speaker":"Fr Stephen De Young","text":"Yes. From the Torah. So in the case, for example, of the BAAL cycle before Baal's escapades, all of which he totally wins, the original most high God and sort of divine son who presided in the divine council were King Yam and Prince Nahar. Right, Yam and Nahar. Yam being the word for sea. The sea S E A and Nahar being the word for river in the Babylonian creation story."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3251.75,"end":3252.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3252.07,"end":3258.21,"speaker":"Fr Stephen De Young","text":"You've got Tiamat, who's the great ocean, and a dragon and a goddess. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3258.21,"end":3261.89,"speaker":"Fr Andrew Stephen Damick","text":"And shows up in D and D. Yes. Early on."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3263.25,"end":3316.55,"speaker":"Fr Stephen De Young","text":"And then Marduk, not to be confused with Warduke, since you brought up D and D, Marduk slays her and humans are created from her blood, interestingly enough. But so what you see here is that you see waters representing primordial chaos. But these, the primordial chaos is here an antagonistic force that has to be overcome by the divine power of a second of a new tier of gods. Right. In the succession myth. Right. So you have to do battle. And this, our 19th century German friends, actually 18th and 19th century German friends, coined the term chaos Kampf, which is."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3317.03,"end":3324.71,"speaker":"Fr Andrew Stephen Damick","text":"What an interesting transmogrification of a word that is Greek there at the front and then German at the end."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3324.87,"end":3374.29,"speaker":"Fr Stephen De Young","text":"Yeah. And because it's, you know, German in German, you can just take a bunch of words and ram them all together into one big word like Hausgeschikta Schul German. So chaos Kampf. Right. The struggle against chaos. Right, the battle against chaos, the war against chaos. Right. And this is sort of the genre, the term that's coined for that genre, often creation stories, sometimes succession myth, not totally connected to creation per se. And so it's about this battle between the new divine and the old divine, which is the forces of chaos and destruction. When you look at Genesis, you see something Fundamentally different."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3375.65,"end":3376.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3376.29,"end":3383.69,"speaker":"Fr Stephen De Young","text":"Here the primordial chaos is being brooded over by the spirit of God as."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3383.69,"end":3386.05,"speaker":"Fr Andrew Stephen Damick","text":"If sort of battle."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3386.29,"end":3394.45,"speaker":"Fr Stephen De Young","text":"Yeah, yes. As if the spirit were a mother bird and this primordial chaos were an egg."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3395.88,"end":3396.28,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3397.88,"end":3427.69,"speaker":"Fr Stephen De Young","text":"And so while this is chaos, Right. It isn't anything. Right. We talked about this in a previous episode, right. That they didn't have the concept of being in nothingness. Right. They had being in chaos. Right. In the ancient world, including the Greeks. So this is. It's not anything. It's chaos. Right. But here it's seen as having the potential."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3430.33,"end":3430.73,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3431.29,"end":3443.45,"speaker":"Fr Stephen De Young","text":"It's. It's filled with potential to become anything through the power of God to which it submits when God speaks."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3443.61,"end":3462.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting because, like in. Even if you think like in Greek myth, chaos is sort of like the primordial divine being, you know, that. That out of which other stuff comes, like night and darkness and, you know."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3464.04,"end":3473.24,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And in even once you get into the Greek philosophers, right, Plato, you've got being and you've got becoming."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3474.37,"end":3474.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3474.73,"end":3485.01,"speaker":"Fr Stephen De Young","text":"With pure becoming, not being anything. But with Aristotle, you've got prime matter, which is hypothetical and isn't anything. Right. But can become anything. It's pure potency."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3485.17,"end":3485.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3489.01,"end":3530.68,"speaker":"Fr Stephen De Young","text":"So this is a recasting, right, of the relationship between God and chaos. This is a very different presentation and therefore a very different presentation of water already. Now, it should be noted, and I know we've noted this before, that there is chaos comp. Language attached to Yahweh in other parts of the Bible. The most well known, I mean, there's a couple of psalms, but the most well known one is probably toward the end of Job where it talks about Yahweh overcoming Leviathan and pulling him up."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3530.68,"end":3540.68,"speaker":"Fr Andrew Stephen Damick","text":"Straining the sea with a hook from his nose. And fun stuff like that, which then gets echoed in Norse myth, where you get Thor and the Midgard serpent."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3541.24,"end":3575.13,"speaker":"Fr Stephen De Young","text":"Right. Right. Now. But the original themes from Genesis also get carried forward in Second Temple literature. Just one example for folks who may have gone to Great Compline at some point during this Lent. We're kind of past that now. But if you went to Great Compline, you heard the prayer of Manasseh, Right. It's God's word and his name that hold back the sea. Right. That restrained the forces of chaos once again. So there's not a struggle, there's not an effort required."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3576.81,"end":3586.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, just like Jesus, who can just simply command the winds and the waves and it doesn't have to go up There and like, you know, and."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3586.19,"end":3587.91,"speaker":"Fr Stephen De Young","text":"Walk like water for that Saruman."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3587.91,"end":3592.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like Saruman standing up on his tower and having to make the weather happen."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3595.51,"end":3600.23,"speaker":"Fr Stephen De Young","text":"You had to. You had to get the. You know, you're just. You're just feeding these people, the all one podcast people."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3600.23,"end":3602.47,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. That was the image in my mind. What can I say?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3602.55,"end":3604.87,"speaker":"Fr Stephen De Young","text":"You're just kind of shoveling coal into the furnace."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3605.47,"end":3605.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3608.11,"end":3623.15,"speaker":"Fr Stephen De Young","text":"So next time we see water, right, we jumped from Genesis 4 to Genesis 9 in the first half here. In the second half, we're going to jump from Genesis 1 to Genesis 6 and 7."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3624.75,"end":3627.15,"speaker":"Fr Andrew Stephen Damick","text":"Don't mention Genesis 6 too much. People get really excited."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3627.87,"end":3629.47,"speaker":"Fr Stephen De Young","text":"Oh, yeah, no, not that part."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3629.71,"end":3632.27,"speaker":"Fr Andrew Stephen Damick","text":"Not that part, not that part. Everybody calm down."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3632.27,"end":3647.18,"speaker":"Fr Stephen De Young","text":"So here's the thing. Here's how we could tell on social media or wherever how much people actually listen to the show. If they think we only ever talk about giants in the book of Enoch, we know they don't actually listen to the show."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3647.42,"end":3648.14,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3648.3,"end":3753.05,"speaker":"Fr Stephen De Young","text":"We do talk about those things, but we talk about a lot of other things. So the latter parts of Genesis 6 and into Genesis 7, that's obviously the flood, right? And so the way the flood is presented in Genesis, right? Again, you get these. This will trigger some people. You get these debates, you know, is this a local flood or a global flood? Right? Like, is this. Is this. You know, and those are people thinking in a very scientific, materialist way. Because the way the text actually presents what's happening in the flood is that God uncreates the world, which goes way farther than either of those. Right, right, right. What happens in the text of Genesis is God uncreates the world. So what happens, Remember on day two of creation, right. God separated the waters above from the waters below. What happens at the beginning of the flood account in Genesis, he opens the gateways of the heaven and all the water that was up there comes down. So that separation gets removed. Right? And then what did he do on day three? He separated the dry land from the waters. What then immediately happens in the. In the flood story? The fountains of the deep are open and the water comes up and covers the land. And so in undoing days two and three, God sort of de facto undoes days five and six, right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3753.05,"end":3757.97,"speaker":"Fr Andrew Stephen Damick","text":"Which is, you know, the creation of animals and filling the world with life."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3757.97,"end":3803.04,"speaker":"Fr Stephen De Young","text":"None of that stuff that used to live in the spaces he created on days two and three can now live because those spaces are now gone, right? So the life disappears from those spaces and we're presented with the ark as a literal microcosm, a microcosmos. Right. The creation is preserved within the ark, and that's it. Right. Through this return to just waters. And then at the end of the flood story, as the waters recede, you see the reverse God then recreates the earth."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3803.36,"end":3819.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, which makes sense because right after the wickedness of the giants is described, it says that God regrets that he had made man. So there's this sense of, like, this didn't turn out the right way, so let's undo it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3821.77,"end":3832.01,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So if you're understanding both the creation story and the flood story in sort of scientific, materialist terms, you're missing the whole point."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3832.73,"end":3833.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3833.93,"end":3835.29,"speaker":"Fr Stephen De Young","text":"That's not to say it didn't happen."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3836.49,"end":3840.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not the story that's being told in the scriptures."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3840.65,"end":3843.29,"speaker":"Fr Stephen De Young","text":"Right. You're approaching it entirely the wrong way."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3843.94,"end":3869.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. It'd be like saying. I mean, it'd be like saying, you know, so how was that party you went to? And instead of saying the experience that you had and the people that you saw in your talks to and the way it turned out and how everybody was happy for the birthday boy or girl, instead, you said, well, here's a list of the presents, and this is what the cake was made out of. And, you know, like, yeah, yeah, yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3869.92,"end":3877.08,"speaker":"Fr Stephen De Young","text":"Or if the party was boring, you said that party seemed to go on forever. You were like, no, actually it went on for precisely this length of time."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3877.56,"end":3880.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3880.36,"end":3882.04,"speaker":"Fr Stephen De Young","text":"How long actually, was the party?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3882.44,"end":3884.6,"speaker":"Fr Andrew Stephen Damick","text":"It was longer than an episode of Lord of Spirits."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3886.68,"end":3894.04,"speaker":"Fr Stephen De Young","text":"That would get. Unless it was one of those crazy frat RPG parties that I hear they're."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3894.04,"end":3897.28,"speaker":"Fr Andrew Stephen Damick","text":"Always, yes, or a bacchanalia."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3898.32,"end":3905.04,"speaker":"Fr Stephen De Young","text":"So eventually you run out of live rats. That's a callback."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3905.2,"end":3908.48,"speaker":"Fr Andrew Stephen Damick","text":"So, but then another."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":3908.48,"end":4154.78,"speaker":"Fr Stephen De Young","text":"Another sort of place where this flood imagery intrudes into the scriptures that a lot of people either never knew about or forget about, aren't aware of is actually in the prophecies, for example, in the early parts of Isaiah about the destruction of Nineveh, the capital city of the Assyrians. Because there are all these prophecies that use this water language of water breaking out of destruction of. Right. And, you know, you could read them at the one symbolic level of this is saying God is going to remove his restraining hand. Right. Because Assyria has sort of become this force of chaos and destruction in the world. God is going to remove his restraining hand, and they're going to fall prey. Right. To chaos and destruction. Right. This is the justice of God that's going to come upon them. But in actuality, in 612 BC, when Nineveh was destroyed, part of the destruction of Nineveh and the conquest of Nineveh by the Neo Babylonian empire was destroying the retaining wall and letting the river flood the city. That's part of how they broke the siege. So since I was just talking about literalism, you can see that those prophecies regarding Nineveh were fulfilled both at a kind of literal level and also at the higher spiritual level of them falling prey to the chaos of destruction that they had unleashed in the world, now coming around and settling on them as another foreign empire comes and destroys them, the way they had destroyed so many cities and people. So there, in both these cases, the flood or the flooding of nano, the water here clearly is this chaos, and it's chaos that is destructive, that is there to destroy, to kill. That's the way we're talking about water at the same time. At the same time, of course, you have many episodes in the Hebrew Bible of purification taking place with water. Most obvious example of this are ritual baths that come to be known as mikvot, which is the plural of mikveh, which are the places where these are done. But there's the washings of the people when they're going to come close to the temple or tabernacle, of course, the washings of the priests before they begin their duties, washings, hand washings, et cetera, et cetera, et cetera. Right. All of these things are common washings. Once you've become unclean through any number of different ways, ritually unclean, and then also tied in with being seen as moral impurity that's been contracted. See our baptism episode for some more about that. Right. Clearly, the baths, though, in all of these examples, the washings in all of these examples, the water involved in all of these examples, the water here is not chaos and death and destruction. Right? Water here is purifying. The water here is removing uncleanness. And so this is a more positive sense and view of water. And then you have miraculous cures at times that involve waters. The most prominent one of these, perhaps in the Old Testament, is Naaman the leper, who goes and dips himself in the Jordan several times and is purified of his leprosy. In the New Testament, right, You've got the pool of Bethesda, where the waters get troubled and someone enters it and is healed. Right. So this is not just a question of uncleanness. This is also a question of healing."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4155.66,"end":4156.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4156.3,"end":4157.66,"speaker":"Fr Stephen De Young","text":"In addition to purification."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4158.14,"end":4179.94,"speaker":"Fr Andrew Stephen Damick","text":"And isn't. I mean, isn't the. We actually got this. A question someone sent to us about the pool of Bethesda. You know, it's called the sheep's pool. Right. Isn't that because it was used for washings related to sacrificial animals? Is that right? So not to send you off on a. On a big tangent."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4179.94,"end":4187.18,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It meant to be a big rabbit trail because there's. There. There are a lot of arguments archaeologically about exactly which pool it was."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4187.58,"end":4188.94,"speaker":"Fr Andrew Stephen Damick","text":"I see. Okay. Okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4189.98,"end":4196.54,"speaker":"Fr Stephen De Young","text":"Yeah. So the. The. The. It was probably the sheep's pool because it was by the sheep's gate."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4197.3,"end":4197.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4198.02,"end":4204.98,"speaker":"Fr Stephen De Young","text":"Into the city, which means that was called that because that's the one the shepherds used."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4205.94,"end":4206.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4208.1,"end":4219.38,"speaker":"Fr Stephen De Young","text":"So this could have been a mikvah for the shepherds when they came in out of the countryside before they went into the temple complex. This could have been. Right. There's a lot of."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4219.7,"end":4220.66,"speaker":"Fr Andrew Stephen Damick","text":"A lot of possibilities."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4220.82,"end":4221.86,"speaker":"Fr Stephen De Young","text":"Possibilities there."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4221.86,"end":4222.34,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4222.34,"end":4227.51,"speaker":"Fr Stephen De Young","text":"But it would not have been to what? You could not put a sheep into a pool to wash it because the sheep would drown."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4228.38,"end":4230.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, right. So."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4232.46,"end":4233.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4233.5,"end":4237.14,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. But."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4237.14,"end":4320.48,"speaker":"Fr Stephen De Young","text":"So that's a more positive view of water. And of course, if you're out in the desert. Right. Water. And finding water. Finding drinkable water is staying alive versus dying. Right. So finding a spring of water in the desert represents life, not death, chaos, or destruction. Right. The exact opposite. So an obvious example of this is the water that comes from the rock when Israel is wandering in the wilderness, maybe once, maybe twice, maybe the whole time, because the rock followed them, as St. Paul says, referring to a midrashic tradition that the rock followed Israel around in the desert. There are other incidents in the Old Testament of miraculous springs, and in particular, the idea of the desert becoming a fertile place, a place where water is more available, gets prophetically associated with the coming of the Messianic age by prophets like Isaiah. Right, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4320.56,"end":4368.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like so in. As an example, I mean, there's a few different references to this. But as an example, In Isaiah, chapter 43, verses 20 and 21, the prophet writes, and this is God speaking. Behold, I am doing a new thing. Now it springs forth. Do you not perceive it? I will make a way in the wilderness and rivers in the desert. The wild beasts will honor me, the jackals and the ostriches. For I give water in the wilderness, rivers in the desert, to give drink to my chosen people, the people whom I formed for myself, that they might declare my praise Ostriches. Yeah. I don't know. Is there some better translation? I don't know what these sorts of. I mean, as we've seen before, animals in the Old Testament can be all kinds of fun stuff."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4368.9,"end":4371.74,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. The ostrich worship service."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4373.74,"end":4374.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4374.06,"end":4456.08,"speaker":"Fr Stephen De Young","text":"But so this. Right. This is, again, this is not water. Flooding the desert is some kind of judgment or destruction. It is the opposite, the wilderness. The desert is the place of death and chaos where people don't live. Where the animals that do live, there are unclean animals, Right. Wild beasts like jackals and I guess ostriches. Right. That are out there. Right. And so water that. That place becoming watered right. By rivers and springs. This is the opposite. This is life coming to the place of death. Right. This is exactly in the other direction. And related to that, when the new covenant is discussed, there are several new covenant passages in Jeremiah and Ezekiel and Joel in the Old Testament that are pointing to sort of the new or renewed covenant that's going to come in the Messianic age. And those are often also associated with water. And there's one in Ezekiel that is sort of especially pertinent in terms of how he says that water is going to be used."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4457.76,"end":4463.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is a little long, but worth listening to, the whole thing."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4463.52,"end":4466.16,"speaker":"Fr Stephen De Young","text":"You don't have anything better to do? Come on, you're listening to the Lord of spirits."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4466.16,"end":4605.33,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Hey, so Ezekiel, chapter 26. This is verses 22 through 36. Therefore say to the house of Israel, thus says the Lord God. It is not for your sake, O house of Israel, that I am about to act, but for the sake of my holy name which you have profaned among the nations to which you came. And I will vindicate the holiness of my great name which has been profaned among the nations, and which you have profaned among them. And the nations will know that I am the Lord, declares the Lord God. When through you I vindicate my holiness before their eyes, I will take you from the nations and gather you from all the countries and bring you into your own land. I will sprinkle clean water on you, and you shall be clean from all your uncleanness and from all your idols. I will cleanse you, and I will give you a new heart and a new spirit I will put within you, and I will remove the heart of stone from your flesh and give you a heart of flesh. And I will put my spirit within you and cause you to walk in my statutes and to be careful to obey my rules. You shall dwell in the land that I gave to your fathers. And you shall be my people, and I will be your God. And I will deliver you from all your uncleannesses. And I will summon the grain and make it abundant and lay no famine upon you. And I will make the fruit of the tree and the increase of the field abundant, that you may never again suffer the disgrace of famine among the nations. Then you will remember your evil ways and your deeds that were not good, and you will loathe yourselves for your iniquities and your abominations. It is not for your sake that I will act, declares the Lord God. Let that be known to you. Be ashamed and confounded for your ways, O house of Israel. Thus says the Lord God, on the day that I cleanse you from all your iniquities, I will cause the cities to be inhabited and the waste places shall be rebuilt, and the land that was desolate shall be tilled instead of being the desolation that it was in the sight of all who passed by. And they will say, this land that was desolate has become like the Garden of Eden. And the waste and desolate and ruined cities are now fortified and inhabited. Then the nations that are left all around you shall know that I am the Lord. I have rebuilt the ruined places and replanted that which was desolate. I am the Lord. I have spoken, and I will do it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4607.57,"end":4632.09,"speaker":"Fr Stephen De Young","text":"So a key element of this is that when this new covenant is ratified. Right. Rather than being sprinkled with blood in verse 25, God says He will sprinkle clean water on them and that that will cleanse them from all their uncleannesses. Right. But this is a new or renewed covenant, Right. That still involves."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4633.45,"end":4633.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4634.65,"end":4640.97,"speaker":"Fr Stephen De Young","text":"Verse 27, I will put my spirit within you and cause you to walk in my statutes and be careful to obey my laws."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4642.31,"end":4643.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Repentance."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4644.79,"end":4677.46,"speaker":"Fr Stephen De Young","text":"So this still involves obedience to the covenant. The Holy Spirit is going to empower that right after they have been made part of the covenant by this. By water. Right. And then being, being filled with the Spirit. So water here again is both seen in this more positive, purifying, cleansing sense. And it's sort of directly paralleled with blood in the old covenant."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4677.78,"end":4698.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I thought this was cool here towards the end in verse 35, where there's this reference essentially to the renewal of Eden. This land that was desolate has become like the Garden of Eden. You know, that this new covenant is in a way, the re. Establishment of paradise. Bringing back to paradise."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4700.01,"end":4704.01,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Turning into the place where God dwells."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4704.41,"end":4704.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4704.97,"end":4713.69,"speaker":"Fr Stephen De Young","text":"And God dwelling there has all these other effects in the transformation of the world. So obviously."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4713.85,"end":4714.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4714.81,"end":4750.29,"speaker":"Fr Stephen De Young","text":"If we're going to talk about water, we got to talk about baptism. But we already did that earlier in this series, and we're not going to now insert the, what, three plus hours we did on baptism before whatever that was. We will refer you back to that episode. And now. And now, in a break with tradition, have we lost our minds here at Lord of Spirits? We are going to talk about the great blessing of the waters, the sacrament, the mystery of the great blessing of the waters in the second half."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4751.57,"end":4753.89,"speaker":"Fr Andrew Stephen Damick","text":"Does that mean there's no third half to this episode?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4753.89,"end":4755.01,"speaker":"Fr Stephen De Young","text":"There is a third half."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4755.17,"end":4755.97,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4757.08,"end":4768.4,"speaker":"Fr Stephen De Young","text":"But we're talking about it here nonetheless. So originally, I was going to refer you back to our theophany episode, but we haven't done a theophany episode."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4768.4,"end":4771.56,"speaker":"Fr Andrew Stephen Damick","text":"We have not done a theophany episode. It's kind of shocking, actually."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4772.28,"end":4781.72,"speaker":"Fr Stephen De Young","text":"I then thought, well, I could still refer back to the theophany episode. That would be in character. But I said, no, our listeners deserve better than that."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4783.96,"end":4787.36,"speaker":"Fr Andrew Stephen Damick","text":"They're still smarting from the last time we referred back to things that never happened."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4787.36,"end":4804.2,"speaker":"Fr Stephen De Young","text":"That never happened. Yeah, yeah. Every, every. Every so often, somebody pops up and is like, wait, what? Yeah, I know. So theophany, of course. January 6th, Feast of Christ's baptism."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4805.24,"end":4805.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4807.49,"end":4814.53,"speaker":"Fr Stephen De Young","text":"And this obviously relates to water. This is the primary place where we do the great blessing of the waters."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4814.77,"end":4815.33,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4817.49,"end":4829.01,"speaker":"Fr Stephen De Young","text":"In a couple of versions. Right. Usually one in the church. We also do. There's an outdoor version where we go bless a body of water, like a lake, river. In my case, a duck pond. Nice."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4829.57,"end":4830.77,"speaker":"Fr Andrew Stephen Damick","text":"You don't do the bayou?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4831.41,"end":4835.5,"speaker":"Fr Stephen De Young","text":"Well, I don't want an alligator to eat the cross. We'll put it that way."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4836.46,"end":4838.7,"speaker":"Fr Andrew Stephen Damick","text":"That's an important practical consideration."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4838.94,"end":4840.86,"speaker":"Fr Stephen De Young","text":"Yes. It's legit here."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4842.54,"end":4844.38,"speaker":"Fr Andrew Stephen Damick","text":"Or the young men who dive after it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4844.46,"end":4844.94,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4848.54,"end":4848.94,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4852.06,"end":4877.27,"speaker":"Fr Stephen De Young","text":"But theophany, Right. We're talking about Christ's baptism and detecting our baptism episode. All those things. Most of those things are things Christ didn't need. Right. Christ didn't need any sins remitted because Christ was without sin. Right. Christ did not need purification because he was pure and holy."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4877.27,"end":4889.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. Yeah. I mean, the whole deal is that when. When Jesus touches something unclean, namely the creation having been polluted by sin, that he cleans it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4891.06,"end":4913.76,"speaker":"Fr Stephen De Young","text":"Yes, yes. And this is an overarching theme. Right. So in the Torah, if you go and touch someone with leprosy, you are now Unclean. Why? Well, because you may have contracted leprosy, and so you have to be treated as unclean until. Right. It can be verified that you did not. When Christ touches someone with leprosy, they are cured of leprosy."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4914.16,"end":4914.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4917.28,"end":4963.8,"speaker":"Fr Stephen De Young","text":"So this is overarching. But of course, in the case of baptism, Christ purifies the waters by his descent into them. And remember why him purifying water is so important as opposed to purifying trees or purifying other things he touched. Right. Waters are so important because the waters are primordial chaos. Right. This death, chaos, destruction imagery. Right. That Christ purifies the waters from that. Right. And this is why in the theophany icon, if you look down in the corner, right, you'll see little Yam and Nahar hanging out there."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4965.16,"end":4976.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The little guys that are on. You know, sometimes it looks like one of them is riding on a fish. Sometimes there's some other kind of sea beast."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4977.65,"end":4980.93,"speaker":"Fr Stephen De Young","text":"Sometimes they look like the people in the family in the sea monkeys ad."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4982.53,"end":4985.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that's another great callback."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4985.49,"end":4985.97,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":4987.09,"end":5014.25,"speaker":"Fr Andrew Stephen Damick","text":"You know, my cousin got sea monkeys one time. I didn't actually. I never thought they were real, but she actually got them. Yeah. I mean, and then, like, often these. These figures, if you're looking at an icon that's in Greek, for instance, they'll be labeled. Sometimes the figures are labeled, sometimes they're not. But if they are labeled, often you'll see them labeled as Thalassa, which is, you know, the seas. The sea or the ocean. And then Yordani, the. The Jordan in particular, or. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5014.25,"end":5015.45,"speaker":"Fr Stephen De Young","text":"Potomos River."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5015.61,"end":5027.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. Yeah, yeah. But, yeah, it's basically the. The. Right. The sea and the rivers. But, you know, it's Yam and Nahar. They're down there, and Jesus is. He's stomping on them by virtue of being baptized."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5027.84,"end":5069.7,"speaker":"Fr Stephen De Young","text":"Yeah. And stomping on snakes. Right. And sometimes directly. Right. Crushing the heads of the dragons that lurked there, as it says in the prayers. And so this is the idea of Christ purifying creation. So originally, right. We now. And by now, I mean, you know, the last 16 centuries live in an era where we have separate feasts of Christ's nativity, his circumcision in the flesh, and theophany. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5069.7,"end":5070.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5070.14,"end":5073.98,"speaker":"Fr Stephen De Young","text":"Baptism, the 12 days of Christmas, inclusive."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5074.31,"end":5074.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5075.67,"end":5126.08,"speaker":"Fr Stephen De Young","text":"But before about the year 400 in the East. And we know that with some precision, because we actually have the homilies that St. John Chrysostom preached on, the first two celebrations of Nativity in Constantinople before that. And you can see this, for example, if you read St. Gregory the Theologian's oration number 38, the only feast of Christ, because the feast of St. Stephen was already being celebrated too, on the 27th. But the only feast of Christ that was celebrated in that winter period was theophany, was January 6th, was the baptism. And that was nonetheless treated as, as you can see from what St. Gregory says, the feast of the Incarnation."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5126.91,"end":5141.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of all that stuff together. I mean, in the Armenian Church, they still do that. It's still all on January 6, which is not related everybody to January 7, which is old calendar Christmas. It's not the same."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5141.91,"end":5149.39,"speaker":"Fr Stephen De Young","text":"No. All Orthodox Christians celebrate the Nativity of Christ on December 25th. We just disagree about when that is."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5149.63,"end":5153.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, 25ths, so."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5155.85,"end":5216.73,"speaker":"Fr Stephen De Young","text":"Right. But. So the reason, the way that works theologically is that this Christ blessing the waters by descending into them is also taken to be paradigmatic of the Incarnation. This becomes really apparent. You read that oration of St. Gregory I mentioned. You read St. Athanasius on the Incarnation, that Christ in the Incarnation, God, the second Person of the Holy Trinity. Right. The Divine Logos, by being incarnate, touches all of our humanity and thereby purifies it, our humanity, our human nature, and unites it to God. That is what the Incarnation does for the Fathers. And so his. His purification of the waters by descending into them is emblematic of his descent in the Incarnation."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5217.77,"end":5218.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5218.41,"end":5236.71,"speaker":"Fr Stephen De Young","text":"And that's what ties those two ideas together. And this is why from the 4th century onwards, the Church has said that, for example, Apollinarians who say that Christ did not have a human soul have been said by the Church to not be Christians."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5238.71,"end":5239.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5239.79,"end":5246.79,"speaker":"Fr Stephen De Young","text":"Because if Christ didn't have a human soul, he didn't purify our soul. Well, my soul needs purifying, so I'm in trouble."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5247.27,"end":5265.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, is it St. Gregory the Theologian who has that famous saying, you know, whatever is not assumed is not healed, meaning whatever. If there's some element of human nature that Jesus, that the Son of God does not assume into him his person, then it's not saved, it can't be healed."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5265.68,"end":5266.16,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5266.4,"end":5266.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5266.96,"end":5274.16,"speaker":"Fr Stephen De Young","text":"So I'm sorry, William Lane Craig, the entire Christian church of the 4th century would like to have words with you."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5274.96,"end":5280.48,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. But if you're listening, William Lane Craig, please give us a call. We would love to discuss this with you."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5280.48,"end":5294.49,"speaker":"Fr Stephen De Young","text":"Yes. We will discuss any point with you because you are fractally wrong. You are wrong on every point of doctrine. Every single one. And on each topic, you are just as wrong as your whole system is. So please call us and discuss anything."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5295.37,"end":5297.81,"speaker":"Fr Andrew Stephen Damick","text":"He's not even in the friend of the show category."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5297.81,"end":5309.93,"speaker":"Fr Stephen De Young","text":"This is. No, no, no. He's in the fractally wrong category. It's rare that I call someone out by name. Wow. But this is a guy who deserves it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5309.93,"end":5313.49,"speaker":"Fr Andrew Stephen Damick","text":"There's hope for you though, Dr. Craig. There is hope, yes."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5313.49,"end":5393.76,"speaker":"Fr Stephen De Young","text":"Repentance. So give us a ring. Becoming a Christian. Okay, that wasn't harsh, given the situation. So. Right. This is fundamental to how salvation works in Christianity. So another example of this that we from the Old Testament that we read and that we read at theophany, that we read in the context of the great blessing of the waters is of course the story of the waters of Marah Mara, meaning bitter. There's the bitter water. The wood is thrown into it by Moses and it becomes drinkable. Yeah, right. The purification of the waters. The wood there taken to be symbolic of the cross and therefore of Christ. But interestingly, or maybe less interesting, maybe you're already tipped off to this because of our discussion of yam and nahar and the theophany icon. But in the prayers that we pray at the great blessing of water, there is this peculiar mention of baal."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5394.24,"end":5463.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, how about that? And I mean, I should say everybody, like, if you have not been present at the great blessing of water, go. These are some of the most awesome prayers ever. I mean, really, really stunning stuff. So, yeah. Okay, so here's this one little excerpt from what is a quite fulsome set of prayers for the great blessing of water. We did not say it's the medium or small blessing of water. It's a great blessing of water. So, okay, so here's the bit for thou art our God who through water and the spirit hast renewed our nature grown old through sin. Thou art our God who with water didst drown sin in the days of Noah. Thou art our God who by the sea through Moses didst set free from slavery to Pharaoh the Hebrew race. Thou art our God who didst cleave the rock in the wilderness so that water gushed forth and streams overflowed and did satisfy thy thirsty people. Thou art our God who by water and fire through Elias didst bring Israel back from the deception of baal. That's cool. It's one of my favorite passages actually in those prayers."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5463.18,"end":5514.41,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so I know there are people who think that this stuff with The Prophet Elijah, St. Elias on Mount Carmel gets thrown in there just because they dumped water over the sacrifices before the lightning, sorry, folks, the lightning comes down and fries it and, you know, blasts through the water. That's not the only reason why. Right? And we already talked about this Yam and Nahar, right? That God, in defeating baal, right? Shows that it is he who deals with, specifically Christ, right? Who. Who deals with primordial chaos, death, destruction, the powers thereof. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5514.41,"end":5540.22,"speaker":"Fr Andrew Stephen Damick","text":"Well, and I mean, not baal, as we said up in Ezekiel, you know, from Ezekiel 26, there's this idea of sprinkling that clean water. And notice it says cleansing from idols. From your idols. So, like this, there's this connection of. Of again, you know? You know, we're brought back from the deception of BAAL right, in this prayer. You know that there's this cleansing with the water also cures idolatry."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5540.62,"end":5546.42,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. And that deception being that BAAL is the one who does this or can do this."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5546.42,"end":5549.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. That he thinks he's something, but it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5549.58,"end":5552.7,"speaker":"Fr Stephen De Young","text":"Turns out he's the lie he tells you. Yeah. Right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5553.02,"end":5556.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Gods of the nation are worthless."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5556.89,"end":5636.11,"speaker":"Fr Stephen De Young","text":"Yeah. So, right, this is the service of the great blessing of the waters, right? This is the sacrament, the mystery of the great Blessing of the Waters, right? This produces holy water, right? So you go home with your little bottle of holy water after the service. This is, as we've said before on the show, not magic water for killing vampires with. It is not a material component for your fifth and sixth level cleric spells, right? This is water that has itself been purified to be something which brings purification and life, and that is then used for blessing other people, places and things, right? And while holy water is used, right, We've got the. I've got a copy here, at least in my office, of the Great Book of Needs, right? Which is all the ways to bless all kinds of things, right? So you go through an alphabetical order, right? You need to bless an apiary. Here we go. Here's the prayers, right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5636.11,"end":5636.55,"speaker":"Fr Andrew Stephen Damick","text":"True."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5638.52,"end":5644.6,"speaker":"Fr Stephen De Young","text":"Like all these beekeepers. Yeah. Vehicles, Right. Flocks, herds, all kinds of things."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5644.68,"end":5645.4,"speaker":"Fr Andrew Stephen Damick","text":"Ambulances."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5646.52,"end":5692.06,"speaker":"Fr Stephen De Young","text":"The most common thing, right, that you see, right, in regular, sort of orthodox parish life is that after theophany, following theophany, and the great blessing of the waters, that water is taken by the priest who comes to bless the homes, Right. Of the faithful, right? And you come and priests will come. There are prayers and holy water is sprinkled throughout the house to sort of rededicate it, right? As I. I'm sure I've said before on the show, I tell folks that I only have to come do it every year, if you sin in the house during that year. So if you go a year without sinning, I don't have to come back. Not a lot of folks have pulled that off yet."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5692.14,"end":5699.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, people say, look, you don't have to come, Father. I'm like, fine. You know, I guess that means you're saying you have not or no one has sinned in your house in the last year."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5700.06,"end":5745.87,"speaker":"Fr Stephen De Young","text":"Yeah. But every once in a while, every so often, this usually happens when I have a person in our parish family who has a spouse or someone else in the household who is not an orthodox Christian, and they are some other sort of Christian, and you come into the house and you. You do the house blessing, and they kind of say, what's up with that? And usually. What's up with that? Ooh, what's up with that? Takes the form of. Where's that in the Bible? Yeah, well, believe it or not, that's in the Bible."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5746.51,"end":5760.71,"speaker":"Fr Andrew Stephen Damick","text":"It is. It's in that book that. I don't know. People don't. A lot of people are not super into Leviticus, but if there's one thing that we accomplish through the Lord of Spirits podcast is to get people to read Leviticus, I think it will have."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5760.71,"end":5763.31,"speaker":"Fr Stephen De Young","text":"All been worth it, turning people on to Leviticus."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5763.47,"end":5817.41,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true. So Leviticus, chapter 14, starting with verse 49 and going through 53. And for the cleansing of the house, he shall take two small birds with cedar wood and scarlet yarn and hyssop, and shall kill one of the birds in an earthenware vessel over fresh water, and shall take the cedar wood and the hyssop and the scarlet yarn along with the live bird, and dip them in the blood of the bird that was killed and in the fresh water and sprinkle the house seven times. Thus he shall cleanse the house with the blood of the bird and with the fresh water and with the live bird and with the cedar wood and hyssop and scarlet yarn, and he shall let the live bird go out of the city into the open country. So he shall make atonement for the house, and it shall be clean. Yeah. Bird blood. I mean."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5817.73,"end":5828.41,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So thankfully. Thankfully. And just for the record, in case, you know, you're a catechumen or something or an inquirer, and you've never had your house blessed, we no longer use the bird blood."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5828.73,"end":5829.29,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5829.29,"end":5829.85,"speaker":"Fr Stephen De Young","text":"Just the water."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5830.65,"end":5851,"speaker":"Fr Andrew Stephen Damick","text":"And. Yeah. If you look at the larger context of this. Right. This is one of the things Father Stephen loves to mention. Over and over again is that there's laws for how you deal with mildew in your house. This is part of the context. But the idea is that the house is impure. It's described as unclean by the text. And this is how you get it clean."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5851.56,"end":5871.56,"speaker":"Fr Stephen De Young","text":"Right. You know, and notice. Notice what? This is structured after this is the day of atonement, ritual and microcosm at a smaller level. Right. It's not for God's house, it's for your house. So we don't have two goats. Right. We have two birds."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5872.92,"end":5873.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5873.73,"end":5878.05,"speaker":"Fr Stephen De Young","text":"And if you read the rest of Leviticus, you'll see how that relates. Right. The offerings."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5878.77,"end":5879.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5880.45,"end":5942.93,"speaker":"Fr Stephen De Young","text":"Birds, as opposed to a lamb, as opposed to a ram, as opposed to a bull. Right. You have two birds. One bird is killed and its blood is mixed with the water that's used to purify the house. The other bird is let go. And where is it let go? Outside of the city, into the open country. And this is to make atonement for the house. So even though this comes in the context, as Father Andrew said, of cleansing from. And your. Your translations will differ. Mildew, leprosy. Right. And this is leprosy of a house. So the word that's translated leprosy. The Old Testament covers not only skin disorders, but all kinds of things. Disease. However we want to take it, Right. We have the word in verse 53, make atonement for the house."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5943.89,"end":5945.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is interesting."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5945.57,"end":5948.53,"speaker":"Fr Stephen De Young","text":"Which is the physical house. Again, you make atonement for objects."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5948.77,"end":5954.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even though the house. The house didn't sin, but it's been defiled."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":5954.21,"end":6021.49,"speaker":"Fr Stephen De Young","text":"Yes. So this is the same pattern. So this is dealing with. With it's incarnate. This is dealing with sin too. Right. Remember and we talked about in the unctuous episode, this connection between sin and sickness. And mildew is seen as a sickness of the house. And how exactly that connection works. So house blessings in Leviticus, right. Now we just cut out the animal blood and just use. Just use the water. So as we come now to the end of the second half, we find with water in the scriptures, sort of the same thing we found with blood. Right. That water is ambivalent. On one hand, water is the stuff of life. If you're in the desert, Right. You need to drink water to live. You need a source of fresh water. Water is also used for purification and cleansing. Right. But water also symbolizes the forces of chaos and death and destruction."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6021.89,"end":6022.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6022.77,"end":6043.44,"speaker":"Fr Stephen De Young","text":"And so what do you find? You find the same kind of paradigm as we saw with blood, with water, you have chaos, destruction, death transformed into life and purification by Christ with water, just as we saw with blood in parallel."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6044,"end":6052.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Cool. All right. Well, that is the end of the second half of this episode of the Lord of Spirits. And we'll be right back with the third part."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6052.88,"end":6069.13,"speaker":"Announcer","text":"Father Andrew Stephen Damick and Father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-852-372346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6073.85,"end":6129.68,"speaker":"Fr Stephen De Young","text":"Jesus last words to his disciples were go and make disciples of all the nations. Unfortunately, many parishes are struggling to follow this commandment. In Reclaiming the Great Commission, Fr. Evan Armitas offers a roadmap to help us get back on track. Relying on his 20 years of parish experience, holy scripture, and insights from research and his visits with churches across the U.S. he discusses how you and your community can implement changes that will transform, revitalize and renew your parish. You'll learn how to diagnose and remove the barriers you face, deal with resistance to change, define what a healthy parish looks like, lead with purpose, and create a parish health health plan. Written for clergy, council members, ministry leaders, small groups, and all committed parishioners, this book will help any church in its journey to reclaim the Great Commission. Purchase it today@store.ancientfaith.com."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6131.68,"end":6147.77,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6149.21,"end":6158.41,"speaker":"Fr Andrew Stephen Damick","text":"I was trying to come up with like a Rambo 3 joke, but it was just wasn't coming to me. And then I started going through Highlander jokes in my head and it got really ugly after that."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6158.41,"end":6168.95,"speaker":"Fr Stephen De Young","text":"Well, I mean, yeah, we definitely don't want to dedicate the third half to the brave fighters of the Mujahideen. New that would be a very bad thing to do. We're not doing that."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6169.75,"end":6178.55,"speaker":"Fr Andrew Stephen Damick","text":"That didn't go very well. Yeah, I wasn't planning for Rambo references. I don't know."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6178.79,"end":6191.92,"speaker":"Fr Stephen De Young","text":"Yeah, Well, I mean, the place to take this, I would think would be the parody of the opening scene of Rambo 3 in Hot Shots Part Deux. Oh, wow."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6192.8,"end":6194.56,"speaker":"Fr Andrew Stephen Damick","text":"Which I saw, but don't remember much."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6194.56,"end":6229.57,"speaker":"Fr Stephen De Young","text":"Where rather than dipping his his wrapped hands in broken glass as Rambo, Charlie Sheen dips them in a series of TCBY yogurt condiments. You know, gummy bears, M&Ms. At all. Yeah, yeah, those little crumbled up nuts. Strawberry sauce. Anyway, you brought up Rambo. This is all your Fine."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6229.57,"end":6232.01,"speaker":"Fr Andrew Stephen Damick","text":"It's fine, it's fine. I was, I was also trying."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6232.09,"end":6232.97,"speaker":"Fr Stephen De Young","text":"Everything's fine."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6233.05,"end":6237.21,"speaker":"Fr Andrew Stephen Damick","text":"Like I was trying to make a demolition man. See, that's, that's an underappreciated movie."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6237.21,"end":6244.33,"speaker":"Fr Stephen De Young","text":"Demolition man is prophetic. Yes, it absolutely foreseen by Demolition Man."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6244.49,"end":6249.01,"speaker":"Fr Andrew Stephen Damick","text":"I know. Where is our Dennis Leary to save us, I ask you?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6251.09,"end":6256.21,"speaker":"Fr Stephen De Young","text":"He's playing an Irish cop in every movie and TV show. Oh, that was rhetorical. Okay, nevermind."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6256.21,"end":6261.73,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah, yeah. Mellow greetings, Warden William Smithers."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6262.13,"end":6266.85,"speaker":"Fr Stephen De Young","text":"If you had wanted to go for a deep cut, you could have gone for the Rambo cartoon."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6267.33,"end":6269.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, I never saw that. But I do remember its existence."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6270.05,"end":6289.71,"speaker":"Fr Stephen De Young","text":"Oh, it was pure genius. Because I mean, what says children's cartoon in the late 80s more than a hard R action movie? Right, right. So you take John Rambo and like he can't have any guns or shoot anybody because it's a kid's cartoon in the late 80s."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6290.83,"end":6292.27,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes when you tell people about the."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6292.27,"end":6311.47,"speaker":"Fr Stephen De Young","text":"80S, they're like, no, that can't be right. No, no, I was there. So he's got like a survival knife, but of course he's not going to stab anybody. It's a children's cartoon in the late 80s. So much like he man's sword, he uses it like as a grappling hook and like a tool."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6314.19,"end":6321.15,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, the people that don't like our digressions are just really hating this third half so far. Well, it's okay."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6321.31,"end":6323.15,"speaker":"Fr Stephen De Young","text":"You pays your money and you take your chances."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6323.15,"end":6330.67,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. So yeah, first part was blood, second part water. And now creatively, Blood and water."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6330.99,"end":6332.03,"speaker":"Fr Stephen De Young","text":"Yes. See what you."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6332.03,"end":6332.75,"speaker":"Fr Andrew Stephen Damick","text":"Blood and water."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6336.03,"end":6378.83,"speaker":"Fr Stephen De Young","text":"So, yes, so, and where. Where we're taking this, you may already have an idea from where the last two halves each ended. But as we begin this third half, I want to kind of focus on one of the prayers that we, and by we I mean priests, have been saying in great Lent thus far. And this is related to. So I know we have listeners who aren't orthodox or who are inquirers or catechumens and maybe don't know the ins and outs of this. So I'll explain slightly what we're talking about."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6378.91,"end":6386.69,"speaker":"Fr Andrew Stephen Damick","text":"Right. And a lot of orthodox probably don't know about this either because it's done quietly and you don't really see see it unless you're in the Altar."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6386.93,"end":6406.37,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So one of the cannons of the Council of Nicaea says that on weekdays during Lent, you are not to consecrate the Eucharist. The west left off following this a long, long time ago."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6406.69,"end":6407.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6408.93,"end":6433.69,"speaker":"Fr Stephen De Young","text":"But not as long as some people might think, but a long time ago. So what that means, functionally is so you're allowed to have a regular liturgy where you celebrate the Eucharist on the Sabbath, Saturday and on the Lord's Day, Sunday during Lent, but not Monday through Friday."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6435.05,"end":6445.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because it's such a penitential period and the Divine Liturgy is regarded as festal, and so that's considered fundamentally incompatible."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6446.03,"end":6504.4,"speaker":"Fr Stephen De Young","text":"Yeah, right. Nevertheless, the people wanted to receive the Body and Blood of Christ to receive the Eucharist during the week, during great Lent. And so services were crafted. There were actually more than one. But the one that has stuck that Orthodox churches still use is the pre sanctified liturgy, which was composed by St. Gregory the Dialogist, aka St. Gregory the Great, the Bishop of Rome at the end of the sixth century. So, ironically, this is a service written by a pope that we use and Roman Catholics don't. So the pre sanctified liturgy is a service for giving the Eucharist to the people, but not actually celebrating it and consecrating it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6504.72,"end":6511.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's basically Vespers with the reception of Holy Communion at the end."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6511.76,"end":6570.82,"speaker":"Fr Stephen De Young","text":"Right. The main parts of the liturgy, all the prayers are sort of gutted out of it because you're not. Right, yeah. And so the portion of the bread that is given to the church that is used for the Eucharist is referred to as the Lamb. Right. That becomes the body of Christ. And so the way this works is if you're going to be doing pre sanctified liturgies during the week, you consecrate extra lambs on at the Lord's Day Sunday Divine Liturgy. So if you're going to be having two pre sanctified liturgies during the coming week, you would consecrate three lambs on Sunday morning. One would be given as communion, then the other two you would save in a box called a pyx, which means."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6570.82,"end":6575.88,"speaker":"Fr Andrew Stephen Damick","text":"Box or artiforion, which means the thing that holds bread."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6576.12,"end":6630.02,"speaker":"Fr Stephen De Young","text":"Yes. And you save that until the service during the week. And part of the service is removing it from its storage place and preparing it to be given to the people. And so those lambs which are going to be saved from the Sunday into the week to be distributed at the pre sanctified liturgies, there are a Couple of prayers that are said at the time that you are preparing them at the Sunday morning Divine liturgy. Right. Which involves some of the blood of Christ being taken from the chalice and administered to. Combined with the body, the extra lamb."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6630.1,"end":6648.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's a couple of different ways I've seen this done. I think the rubric that we have explicitly says to use the spoon and then to, to, you know, dip it in the chalice and then turn the lamb upside down and place it, you know, in sort of a cross shape on the bottom. If I remember correctly, I don't have the book in front of me."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6648.7,"end":6649.02,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6649.02,"end":6673.1,"speaker":"Fr Andrew Stephen Damick","text":"I've also seen some people just simply take whole lamb, some priests, I should say, take the whole lamb and just sort of dip it a little bit into the chalice. Either way, you know, the, the, the result is the same that there's now the blood of Christ is now combined with the body of Christ in this lamb and then it gets put into the box. Right. And set aside."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6673.5,"end":6676.3,"speaker":"Fr Stephen De Young","text":"And so all of this explanation was leading up to."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6676.62,"end":6677.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6677.1,"end":6691.01,"speaker":"Fr Stephen De Young","text":"Us, us reading you the first of the prayers that the priest says while he does this, while he combines the body and blood for the lamb that's being saved for during the week, the pre sanctified lamb."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6691.09,"end":6722.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is cool. Yeah, this is just the first of two and they're both pretty short because the whole thing only takes a moment to actually get done. But yeah, so here's the first one with the emptying of the divine blood from thine undefiled and life giving side, O master Christ, sacrifice to idols hath ceased and all the earth doth bring unto thee the sacrifice of praise. That's interesting because it's got a whole bunch of these themes we've just been talking about. All right there in that, in that short little prayer."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6722.35,"end":6739.11,"speaker":"Fr Stephen De Young","text":"Right, right. And there's a connection being made here between the blood and water that flow from Christ's side at the crucifixion and deliverance from sacrifice to idols."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6740.63,"end":6741.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6741.51,"end":6745.27,"speaker":"Fr Stephen De Young","text":"Which is not necessarily on its face into an intuitive connection."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6746.15,"end":6748.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6750.47,"end":6756.39,"speaker":"Fr Stephen De Young","text":"You've, if you've listened to the rest of this episode, you've already gotten some of the building blocks for how to understand this."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6756.87,"end":6757.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6757.19,"end":6873.29,"speaker":"Fr Stephen De Young","text":"But that's not immediately, that's not normally, you know, if we're going, working our way through St. John's gospel and his account of the crucifixion. Right. At that point, you usually don't get into a lot of discussion of sacrifices to idols. Right. So the things that are usually drawn out there. And if you read the church fathers on that passage, you have the opening of his side being compared to. And this is the passion narrative in St. John's Gospel is full of language. I know we've mentioned this on the show before from Genesis, but the opening of the side and the opening of Adam's side to produce his bride, Christ's bride being the church, the blood and water baptism and the Eucharist. Right. So that's kind of the connections that are usually drawn out there. So what's going on in this prayer with sacrifice to idols being what's delivered from. So we have to make sort of a distinction here in terms of. And we're picking up the threads that we left at the end of the first two halves, which talked about this ambivalent nature of both blood and water and a sort of transformation or redemption of blood and water. Right. How they go from chaos, death, destruction, to life, purification. Right. To really zoom in on that. Right. So blood and water as material things. Right. H2O and whatever the chemical composition of blood is."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6873.69,"end":6875.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. Be much longer."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6875.69,"end":6894.58,"speaker":"Fr Stephen De Young","text":"Not a biochemist. Right. But right. Them as material don't need to be redeemed, don't need to be saved. Right. Because contra Gnosticism, material things are not innately evil, bad, fallen, whatever. Right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6894.58,"end":6897.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, God created it, saw that it was good."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6898.02,"end":6929.84,"speaker":"Fr Stephen De Young","text":"Right. And you know, the other part of the symbolism, the other thing that's drawn together there, right, Chaos, death, destruction, those things can't be redeemed. What do I mean by that? Not that they can't be turned to good, but that. Right. In the new heavens and the new earth, there's not going to be like. It's not that now death is going to be good. It's that there's not going to be death. It's not that now chaos is going to be good. It's that there's not going to be chaos. It's not that now destruction is going to be good. It's going to be. There's not going to be destruction."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6930.72,"end":6935.84,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. It's like, you know, sickness. It's going to be the good kind, you know?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":6935.84,"end":7013.82,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. The good kind of. Yeah. Plague. So the other side of it can't be redeemed. Right. But that relationship between them is not just symbolic meaning, two things brought together. That's not that bringing together is not just something that happens in speech or thought or analysis or idiomatic language. Right. That's not the only connection. It's not an arbitrary connection of language that might be connected totally differently in terms of symbolism in a different culture. And it's not just something the Bible is doing. Right. This is the biblical symbolism of this. But this is a connection in reality that's being pointed to. But it's a connection in spiritual reality that there is a connection between the material things and the spiritual forces, the spiritual beings, the spiritual powers, the spirits of death, chaos and destruction. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7013.98,"end":7018.14,"speaker":"Fr Andrew Stephen Damick","text":"So there's essentially an exorcism that needs to happen."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7019.5,"end":7049.15,"speaker":"Fr Stephen De Young","text":"Right, right. And we can see this right there. So there are a couple of. Couple of texts in First John that make this really plain. Right. So First John 5, verse 19 says that the whole world lies under the power of the evil one. And that word lies there. Whole world lies under. Right. Is not just a statement of sort of geographical location."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7049.55,"end":7049.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7049.99,"end":7054.83,"speaker":"Fr Stephen De Young","text":"Right. Like power of the evil one is on top, it's below it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7055.19,"end":7057.27,"speaker":"Fr Andrew Stephen Damick","text":"It lies. Lies five miles to the west."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7057.59,"end":7057.95,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7057.95,"end":7058.79,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7059.19,"end":7073.83,"speaker":"Fr Stephen De Young","text":"That word that's translated lies really is like laying down, like prone, like supine. Right. That. This is. This is an image of helplessness."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7074.55,"end":7078.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like. Like the evil one has pinned the world."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7078.79,"end":7092.32,"speaker":"Fr Stephen De Young","text":"Yeah. Has pinned it to the mattress. More than a three count. Right, Right. And that. It's been sort of. It has this imagery of overpowering and oppression."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7094.16,"end":7094.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7095.52,"end":7164.76,"speaker":"Fr Stephen De Young","text":"And when it says the whole world here, if you read the preceding verses in First John. Right. This isn't the whole world like, oh, the cosmos, the creation in an abstract sense. This is very much St. John distinguishes the things in the world. He's talking about objects and animals and plants and people in the world now lie in this powerless state under the power of the evil one. Right. The second passage in First John is First John 3, verse 8, which says, as you might be reminded if Jamaican Jehovah's Witnesses show up at your door, that Christ came to destroy the works of the devil. Right. To destroy the works of the devil. That's not talking about people who are the works of the devil. No. That's not talking about things the devil created because the devil can't create anything."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7165.29,"end":7167.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's his works, which humans do."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7168.57,"end":7229.68,"speaker":"Fr Stephen De Young","text":"Right. By humans doing the works of the devil, they have subjected the creation through sin and the curse that sin brings. They have subjected themselves, the things in the world, to the power of the devil. And Christ has come to destroy the works of the devil to break that link, to break that connection forged by sin and curse between the devil and the material things of the world. And lest we forget what we said in our unctuous episode that confused some people. We're coming back to it our next episode, the week after bright week. We're going to talk about the soul, but lest we forget, you are your body. So you are a thing in the material world."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7231.04,"end":7236.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're not just a. You're not trapped in the material world."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7237.44,"end":7238.8,"speaker":"Fr Stephen De Young","text":"Even if you're a material girl."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7240.24,"end":7242.56,"speaker":"Fr Andrew Stephen Damick","text":"Nice. It is 80s night on Lord of Stars."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7242.96,"end":7257.48,"speaker":"Fr Stephen De Young","text":"So. So you are your body. Right. Again, contra Gnosticism. Right. It is not that your body is something in the material world which is evil and therefore your body is evil, but your soul is good and you have to escape."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7257.72,"end":7258.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7259.8,"end":7285.88,"speaker":"Fr Stephen De Young","text":"This is. You are your body. You are a thing in the world. Right. And each one of us, through our complicity in sin, through the devil, has brought ourselves under curse and has placed ourselves under slavery to sin. Right. And the powers of evil. So nothing in the world is innately evil."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7286.52,"end":7290.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, again, Genesis. Right. One and two."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7290.92,"end":7311.81,"speaker":"Fr Stephen De Young","text":"But it is under the curse. It has been subjected to the curse by humans, by human evil. But the fact that no thing in the world is innately evil includes humans. No human is innately evil. But humans are enslaved by sin."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7312.37,"end":7313.65,"speaker":"Fr Andrew Stephen Damick","text":"They're not totally depraved."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7314.61,"end":7351.84,"speaker":"Fr Stephen De Young","text":"No, sorry, Calvinists. Not only are all humans not innately evil, no human is innately evil. No human was created by God to be evil and to be damned. Second Council of Orange. Sorry again, Calvinists. Every human being, insofar as they exist and exist in the world, is a good thing created by God. But they have become enslaved to sin. They've come under the curse of the law."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7352.72,"end":7353.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7353.08,"end":7390.31,"speaker":"Fr Stephen De Young","text":"Deuteronomy 30. Through sin. They've come under the power of the powers of evil in the world through sin. And the fact that it's not just that all people are not right or that there's no group of people that is, but this no particular person is. So the worst person in the world. The worst person you can think of, the most horrible person you could think of, which should actually probably be yourself, but for most of us is not. We can usually come up with a few people more horrible than ourselves."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7390.31,"end":7392.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, Chief of Sinners."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7392.79,"end":7411.66,"speaker":"Fr Stephen De Young","text":"Yes. That person is not innately evil. That person is enslaved to sin and death and the devil through what they've done, the choices they've made in their life. Right. But that does not make them evil."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7412.46,"end":7413.66,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7413.82,"end":7424.78,"speaker":"Fr Stephen De Young","text":"Right. There's no such thing as an evil person, but there are people who are thoroughly in the thrall of evil powers."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7425.42,"end":7425.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7425.82,"end":7426.14,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7426.38,"end":7427.34,"speaker":"Fr Andrew Stephen Damick","text":"They're slaves."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7429.91,"end":7466.72,"speaker":"Fr Stephen De Young","text":"Such that they're doing the works of those evil powers continuously. Right. So what this means is a trigger warning for the word I'm about to use. But I don't care that evangelism is liberation. Clearly by that I mean I'm a communist. No, the. So we're getting ready to celebrate Holy Week next year or next year. Next week."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7467.6,"end":7468.16,"speaker":"Fr Andrew Stephen Damick","text":"And also."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7468.24,"end":7469.12,"speaker":"Fr Stephen De Young","text":"And next year too."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7469.36,"end":7470.32,"speaker":"Fr Andrew Stephen Damick","text":"God knowing."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7470.48,"end":7480.56,"speaker":"Fr Stephen De Young","text":"Yeah, but next week we're celebrating Holy Week. Holy Week is the lead up to, and culminates in Pascha, which is just the Greek word for Passover."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7481.13,"end":7482.97,"speaker":"Fr Andrew Stephen Damick","text":"That's right, Yep. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7482.97,"end":7486.09,"speaker":"Fr Stephen De Young","text":"So we're getting ready to celebrate Passover. What is Passover all about?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7487.69,"end":7488.09,"speaker":"Fr Andrew Stephen Damick","text":"Release."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7488.09,"end":7490.17,"speaker":"Fr Stephen De Young","text":"Read Exodus as you're supposed to next week."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7490.25,"end":7492.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Release from slavery to Egypt."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7493.13,"end":7505.21,"speaker":"Fr Stephen De Young","text":"Manumission. Right. The freeing of slaves from bondage to, in the case of the Passover, very explicitly in the book of Exodus, the gods of Egypt."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7506.01,"end":7507.94,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7510.34,"end":7553.16,"speaker":"Fr Stephen De Young","text":"And so the power of the Gospel, the power of the story of Christ's defeat, of death, of chaos, of destruction, of the powers of death, of the evil, powers of sin. Right. The power of that is to set you free from it. And anyone can be set free from it by that. Remember, as we mentioned in the episode on St. Constantine the Great, St. Paul's goal was to get to the Roman emperor and preach the gospel to him and bring him to salvation in Christ. And for a good chunk of his ministry, that emperor was Caligula."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7555.08,"end":7557.08,"speaker":"Fr Andrew Stephen Damick","text":"One of the worst ever. Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7557.4,"end":7611.14,"speaker":"Fr Stephen De Young","text":"St. Paul thought that Caligula could be saved. St. Paul thought Caligula could repent if he just heard the Gospel of Christ. He could. Right. Because why? Because Caligula as a human was not innately evil, but he was thoroughly in the thrall of the gods of Rome and the death and destruction they were, chaos they were wreaking through him. But he could be saved from that, right? He could be pried loose from that by the Gospel. So if we understand this, if we understand this as liberation, as freedom from slavery. Right. Then we need to understand, obviously you can't free someone from slavery by force or compulsion against their will."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7613.15,"end":7613.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7613.39,"end":7614.83,"speaker":"Fr Stephen De Young","text":"Why? Because they'll just go back."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7616.27,"end":7621.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Conversion. Conversion by the sword. Or, you know."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7621.23,"end":7627.39,"speaker":"Fr Stephen De Young","text":"Yes, sorry, Spanish Inquisition, which no one expected, but this."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7628.19,"end":7637.95,"speaker":"Fr Andrew Stephen Damick","text":"But the. The Livonian Inquisition. I don't know. Those are crusaders, but still crusaders, you know, trying to convert people with a sword. Not a good, not a good seed, not a good."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7638.95,"end":7656.87,"speaker":"Fr Stephen De Young","text":"And this is so much a reality that we even see before Christ. Heals the paralytic by the pool of Bethesda that we already mentioned. Do you want to be healed? And that sounds like an absurd question."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7657.35,"end":7700.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. But, I mean, you think about it, I, as a Christian, know all the things that I need to do to be healed. Right. Or even just as a. As a human being knowing things about, you know, my own health, my own material health. I know the things that I could be doing, but I don't do a lot. You know, I'm. I don't do them. So do I actually want to be healed? Do I want to be healthy? Do I want to be saved? You know, I. On some. I mean, God willing, on some level, the answer is yes. But also on a big level, the answer is no, I don't. I don't want to be healed. So it's actually not that weird of a question because we're all kind of doing it, and."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7701.21,"end":7704.33,"speaker":"Fr Stephen De Young","text":"And people can find a kind of happiness in slavery."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7704.97,"end":7706.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. It's just easier."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7707.21,"end":7717.53,"speaker":"Fr Stephen De Young","text":"It's just if you're a paralyzed man who makes his living by begging and you get healed, nobody's going to give alms to a formerly paralyzed man."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7719.19,"end":7719.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7719.99,"end":7750.21,"speaker":"Fr Stephen De Young","text":"Right. Your whole life's gonna have to change after that. Yeah. You're gonna be hail and healthy. You're gonna have to go find work. You're gonna have to go. Right. Everything has to change after that. And there are a whole lot of people who either don't want to or are scared to or just aren't ready to make the changes they know they would need to make if that freedom came. And so they don't want the freedom. They'll stay in their rut, at least for a while more."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7750.85,"end":7751.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7751.49,"end":7766.77,"speaker":"Fr Stephen De Young","text":"So that is a. A very valid question when people answer it honestly. Right. And that's because after the freedom, right, it's not like the end of the story. It's like, okay, you're free, happily ever after."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7768.61,"end":7768.93,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7768.93,"end":7793.24,"speaker":"Fr Stephen De Young","text":"Now there's a lot of cleanup that needs to happen. Now there's repentance. Now there's purification and healing of all the damage that's been done from sin and chaos and death and destruction in your life. And that takes work. We've talked about repentance. It's not just, oh, I'm sorry. Okay, not about my business. Right. That takes a lot of work."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7794.04,"end":7794.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7794.92,"end":7807.54,"speaker":"Fr Stephen De Young","text":"That takes a commitment. Right? And that repentance and that work and that healing happen through the blood of Christ and the purification with water."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":7812.02,"end":8406.51,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. So to wrap up, I wanted to talk. It's interesting. This is an episode about the great blessing of water. But I want to talk a little bit about the Eucharist, which we've already talked about a bit, but I want to talk about another angle to this. One thing a lot of people may not know about the Eucharist as celebrated in the Orthodox Church is that the blood of Christ in the Divine Liturgy is made not just by the use of wine, but also by water. So during the prothesis, or the proskomedi is actually the name of the service where the bread and the wine are prepared beforehand by the priest and the deacon, if there is one. One of the things that happens is that the priest will place the liturgical spear in the side of the lamb, the piece of bread that is going to become the Eucharist. And when he does that, he says one of the soldiers pierced his side with a spear, and at once there came out blood and water. And then he says, and he who saw it as born witness. And his witness is true. This is obviously a quote directly from the gospel of St. John. And so after he does that piercing, then the deacon will take up water and wine and pour them together into the chalice, right? So they come together, right? And so the. The connection between the language of blood and water, and then, of course, of wine and water going into the chalice together is pretty clearly, clearly made. You know, that these things are kind of coming together. And. And then also during the Divine Liturgy, right before Holy Communion, hot water further is added to the chalice. And so there's water going into the Eucharist as well, at two different points, once during the preparation and once after it's been consecrated. And then hot water is added to it right before the clergy commune. And then, of course, the people as well. Again, these are all things that happen up in the holy place, often out of sight of a lot of people. So they may not be aware that this is part of what's going on, but there it is. So this has always been done. I think the very earliest references to celebrating the Divine Liturgy include the adding of water along with this. And although this is not the great blessing of water in terms of that particular service, this is nonetheless water being used along with the wine, or as we can also simply say, water and the blood being used together. And it is for the same, ultimately the same purpose, although not in exactly the same way, but for the same purpose that the holy water blessed and the great blessing of water is used. And that's this cleansing, this purification, right? We already talked about the line used when you combine the blood and the body together for the pre sanctified Lamb. But also like for instance, in the traditional post communion prayers, one of the prayers that's prayed. Now, there's all kinds of different services for pre communion and post communion prayer. So there's a bunch of them. But one of the commonly prayed prayers is called the prayer of Saint Simeon the Translator, or Simeon Metaphrastis, which means translator. And I'm just going to read a part of it for you, but I think you're going to hear in this a lot of the same themes that we've talked about here with, with blood and water. O thou who willingly dost give thy flesh to me as food, Thou who art fire consuming the unworthy. Consume me not, O my Creator, but rather pass through all my body parts into all my joints, my reins, my heart. Burn thou the thorns of all my transgressions. Cleanse my soul and hallow thou my thoughts. Make firm my knees and my bones likewise. Enlighten as one my five senses. Establish me holy in thy fear. Ever shelter me and guard and keep me from every soul corrupting deed and word. Chasten me or purify me and control me. Adorn me, teach me and enlighten me. Show me to be a tabernacle of thy spirit only, and in no wise the dwelling place of sin, that from me thy habitation, through the entrance of thy communion, every evil deed and every passion may flee as from fire. And then it goes on a little bit after that, invoking the saints. I mean, you can hear in that exactly some of the same stuff we've talked about. Right? There's a sense of cleansing, hallowing, of purification from corruption and then guarding and strengthening and returning the human person back to the way that he's supposed to be. Right. And this is said, consume me not, O my Creator. God is invoked as the Creator. Right. And yet within this also you have this sense that I could be destroyed. There's corruption, there's possible consumption. God is a fire consuming the unworthy. So again, there's this ambivalent character in the Eucharist that it's fire and yet also it's healing at the same time that there's the possibility of being destroyed, but then there's the possibility of being recreated, of being renewed. Right. And we've been talking now for the past, what has it been, two and a half months now? No, no, it's been almost. I'm just trying to think if we're doing about two episodes yes. Been months now. We've been doing this episode of the sacraments, right? Like five months. Wow. The time just went by really fast. And, you know, we discussed so many of these different holy services and what they do. But I think one of the themes you probably have heard in all of them is this sense of purification, which involves, of course, exorcism, so driving out the darkness, but then also of renewal, of recreation, of making us to be as we were created to be. Right? Because the world has come under the domination of darkness, of the evil One and over all of his foul spirits. And I think that if we. If we begin to see and then to act on an understanding of the sacraments as experiences, that if we participate in them rightly, righteously, repentantly, will change us, will transform us. And not just as a kind of. I don't know. Sometimes people experience the sacraments as a kind of like, talisman, like, I need to go get my communion. I need to go get. You know, or sometimes even. And I know people mean this innocently, but sometimes they'll say, I need to take confession. I'm like, you're not. You're not taking confession. You're giving a confession. Actually, you're making confession. You're receiving absolution. If we enter into these things knowing that what we're going in to do is to be purified, to be renewed, to be exorcised, then I think that that will change our motivation from, frankly, sometimes we have a sense of entitlement with regards to the sacraments, or maybe sometimes we have a sense of obligation. So that's kind of the opposite of entitlement. Like, well, I have to be there, or just habit or even, frankly, sometimes we can get bored or be blase about them, but if you remember what it is that they actually do, what they're for, what their purpose is, what they actually accomplish, and not think of them as, you know, these holy objects that you get, or just something you have to sort of pass through, you know, so that this counts or that counts, right? If you experience it in this way, if you try to participate in this way, then it's going to be much more effective and we're going to become much more the holy people doing the works of God in this world and loving those around us as Christ loved us because he died for us, even while we were sinners. That it will be an experience of the sacraments that is an experience of power, of fire, of glory. It may not be something spectacular, right? Probably not going to see Sparkling lights or glowing. Whatever or, you know, whatever, or feel something. You may not feel anything, but nonetheless, nonetheless, even if you don't feel something, I mean, sometimes people do feel stuff, and that's fine. But even if you don't, that it will have a much more profound and transformative sense and actually will be for your repentance, actually will be for your transformation to become more like Christ. And so I'm glad that we finished with this one on the great blessing of water, because it really has this very expansive sense of purifying, cleansing, renewing, resetting, recreating us and the whole world all together. You know, glory to God for this. This great, great gift. Father Stephen."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8410.03,"end":8950.54,"speaker":"Fr Stephen De Young","text":"So when I preach here in the parish, I'm actually always talking to myself out loud in that I try to find out what I need to hear, what I need to be confronted with, what I need to be comforted by, what I need to be directed toward. And I just say that out loud to everybody. And at least a lot of the time, I find that there are enough people like me that it's meaningful for them, too. They needed to hear it, too. And so what I'm about to say is, in that spirit, right? As this year we're coming to the end of Lent tomorrow, technically, and entering into the beginning of Holy Week. And as I try to think about the things that I, and maybe some others who might be listening, need to repent of, there's one thing that, in relation to what we've been talking about in this episode, I think I need to focus on, and that has to do with what we were talking about in the third half, about no human person actually being evil in and of themselves there. I am a big fan of the whole locus of television programs. Breaking Bad, Better Call Saul, El Camino, et al. And there was an interesting phenomenon that happened while Breaking Bad was airing, which was that the main character, the central character of that was Walter White, who on all levels is really a despicable person. And just how despicable he is is sort of revealed over the course of the show. He's responsible for deaths and murders and drug dealing and. Right. Everything. Full of pride, full of resentment, full of anger, right? I mean, every. He's a slave to every passion in the book, right? And interestingly, the actress who played his wife, who, within the context of the story was not a flawless or perfect character, had had her own problems, but was largely the victim of her husband and his choices, nevertheless received an incredible amount of hatred from viewers. And this was Sort of strange, right on the face of it, of like, what's going on? But sort of what was arrived at from the showrunner who created the show and other people thinking about was, well, here's the issue. Walter White is despicable, as his choices and everything he does on this show are. And he's a fictional character. He doesn't exist. But as wicked and evil as these things are, he's the protagonist of the show. He's the main character. And so when another character, even if that other character might be objectively more virtuous, when that other character stymies, causes difficulties for, resists the main character, the audience is going to root for the main character against that character, regardless of their requisite virtue. Why am I bringing this up? I have a tendency, and I think maybe some other people too, to sort of live our lives this way. I am the protagonist of my life by virtue of just reality. I only see things from my own perspective. Naturally, I have to work to try to figure out anybody else's. So I fall into this protagonist slot. And I tend very quickly to judge other people in my life based on those same criteria. If I have things that I want, that I like, that I desire, that I want to achieve, that I want to acquire, and there's a person who stands in my way toward those things, I judge that this is a bad person. If there's a person who makes me feel good about myself and my choices and things, I say, this is a good person. There's a person who makes me feel bad or questions my choices, questions my genius questions, you know, my accomplishments. This is a bad person. This person made me feel bad. They are bad. And I judge everyone from my own, from my own perspective. We pray over and over again in Lent and into Holy Week, the prayer of St. Ephrem the Syrian, where we ask God to show me my own sins, help me to see my own sins, and not to judge my brother. This is what the idea of judgment is really all about. It's not saying that you can't call sin sin. It's not any of that. It's that I judge people based on their utility to me, how they play into my own life and my own ego. A person who's useful to me at a given point is valuable. A person who's of no real use to me at any given point in time is worthless as far as I judge from my throne. This is a far cry from what we see presented in the Scriptures. This is a far cry from how God looks At people. This is emblematic of the distance between me and God. Because the person I encounter who makes me so angry because he's so arrogant, first of all, the only reason he makes me so angry is that I'm incredibly arrogant and it's easier for me to hate him than to hate my own arrogance. But second of all is acting so arrogant because he's desperately insecure and afraid. And rather than me trying to get to know him, to understand that and to try and help him with that fear and that anxiety and that insecurity, I just judge him as bad. And I try to avoid him and I badmouth him, right? The person who gets angry and snaps at me, I say, well, that's a bad person. How dare they say that to me, right? I don't know what they've been through that day. I don't know what they're going through at home. Frankly, I don't care. I just care about what they said to me and how dare they. And I, and maybe some of you who are listening, need to reorient. First of all, we need to reorient the story we think we're in. If I'm the main character, I'm in the wrong story. I need to be a supporting player, a tiny supporting role in the story of Christ and his church. But secondly, secondly, what it means to honestly not judge your brother or sister means that regardless of the encounter you have with them, regardless of the feelings it triggers in you, regardless of whether it helps you or hinders you towards some goal or some personal desire, that your goal is to get to know and understand them and help them and love them. Not just to be reconciled with them when the relationship is broken, but to develop a real relationship with them and understanding of them. In the first place, this is a different way to live life. It's a much harder way to live life, but it's a much better and more beautiful and peaceful and loving and joyful way to live life. If we're willing to repent, if we're willing to be set free from our own egos and pride, and we're then willing to do the hard work of cleaning things up and moving in a better direction."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8952.85,"end":8971.49,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight, everyone. Thank you very much for listening. If you didn't happen to get through to us live, we'd still like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8971.49,"end":8979.74,"speaker":"Fr Stephen De Young","text":"Even if it's raining blood from a lacerated sky, you can join us for our live broadcast of the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8980.62,"end":8990.06,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can follow our page and you can join our discussion group. You can leave reviews and ratings everywhere. Also, please but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8990.46,"end":8998.86,"speaker":"Fr Stephen De Young","text":"And awaiting the hour of appraisal, your time slips away. So be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":8999.58,"end":9009.27,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. Good night. God bless you you this is a shout out to Freedom Aviation and we pray that all of you would have a beautiful Holy Week and a blessed Pasca."}
{"episode_id":"LOS - #065 - 2023-04-06 - Blood and Water","start":9023.99,"end":9061.22,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with or Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
