{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":0.4,"end":65.06,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5 the modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":68.9,"end":208.97,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the Lord of Spirits Podcast. I am Father Andrew Stephen Damick in Emmaus, Pennsylvania and with me is my co host father Stephen DeYoung in Lafayette, Louisiana. And if you are listening to us, listen live. You can call in at 855-AF-RADIO. That's 855-237-2346 and we're going to get to your calls in the second part of today's show, God willing. So every year Christians argue about Halloween. Is it participation in the occult, cavorting with demons that we should be running away from? Or is it harmless dressing up and candy? Some more traditionally minded say it's not about demons, it's about the Feast of All Saints. And some non Christians will say that their fall holiday of Samhain spelled S a M H I H a I n is greatly misunderstood at what's been maybe co opted by Christians or slandered by them or others. One thing is for sure, people have opinions about Halloween. Now we say that Halloween really is about demons. And for those who have been listening to this program since we premiered in September, that will not surprise you in the least. And it would surprise our longtime listeners even less to learn that we say we're okay with running right toward those demons. Now, we very likely have a whole lot of new listeners tuning in right now who have never heard one episode of the Lord of Spirits podcast before tonight. If that's you, and if our assertion that Halloween is about demons gets you mad, or if our willingness to be involved with demons gets you mad, before you tune out, at least listen to the first part of the show because this is almost certainly not going to be what you think. So to help get all of you new listeners a sense of what our deal here is on this show, I'm not going to tell you to go back and listen to our first four episodes before this one. Although if you're listening to this recorded, why don't you just pause and go back and listen to those first? You should definitely check them out either way. But I'm going to ask my co host, Father Stephen, to give you a very quick summary of what exactly this program is about. So, Father Stephen, let's give a quick orientation for all of our new listeners. Sure."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":209.29,"end":212.17,"speaker":"Fr Stephen De Young","text":"So what we're about here is."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":214.17,"end":214.85,"speaker":"Fr Stephen De Young","text":"Recovering."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":214.85,"end":407.19,"speaker":"Fr Stephen De Young","text":"A sense of the full orbed reality of the universe that we live in. The cosmos that we live in includes not only material reality, which we're very comfortable with, but spiritual reality, which we as contemporary modern people are not comfortable with, if we even believe it exists. And the truth is that when you look at ancient people, whether we're talking about ancient pagans, or we're talking about ancient Israelites, or we're talking about Second Temple Judaism or we're talking about early Christianity, they all, based on their own experience of spiritual reality, had a shared understanding of the contours of that reality, of the geography of that reality, of the inhabitants of that reality. And along the way, over the last five centuries or so, give or take, our culture, our Western culture, has sort of made a bargain. And that bargain was to trade away that ancient spiritual wisdom and to trade it for an ever deepening and ever more technologically applied understanding of the material world. We gave up our spiritual understanding to gain a greater scientific and technological and material understanding of that element of the world around us. And that's created while people are maybe aware of it, maybe starting in the 60s, they know about the Beatles or somebody going to yogis and people dabbling in Buddhism and the rise of New Age spirituality and various forms of reconstructed neo paganism. It goes back much farther than that. I mean, you can go to Emerson. We go well back into the 18th and 19th centuries where Western people, realizing this gap, have tried to reach out to other non Western traditions to try to recover that spiritual wisdom and that spiritual sense. And that's not just true in the world in general. It's true of Christianity. Along the way, Christianity decided to trade its inheritance for a mess of pottage, essentially, and sideline that spiritual inheritance in order to become modern people. And so what we're really about in this show is about taking the journey back into the ground of Christianity, back into the understanding of this spiritual reality that our fathers and forefathers had and that we gave up to try to recover it. Not giving up any of the technology or understanding of the material world we have now, but adding to it that spiritual wisdom that otherwise might have been lost that will allow us to navigate our modern, contemporary, material and technological world more successfully with that spiritual wisdom."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":408.54,"end":611.16,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, just to lay out a few ground rules of sorts for this particular episode, I just want to say our purpose tonight is not what probably a lot of people think that this show, this episode is about. It's not to say where Halloween really comes from so that we can kind of slap down a label of okay or forbidden on the thing. Why? Why are we not addressing that? Well, it's because there are a lot of things going by the name of Halloween. The name itself is Christian in origin, actually, and it's short for All Hallows Eve. That is the evening before All Saints Day, which is a holiday that's celebrated on November 1st in the Western Christian churches. But in the early summer by most Orthodox Christians like us, it moves around a little bit for us, and it's always on a Sunday. And there was actually at one point in history, even a May 13 date for all Saints. All Saints is a feast celebrated all over the Christian world in various ways. But Halloween is a name that for a lot of people just means dressing up in costumes and collecting candy from the neighbors with accompanying spooky parties and decorations and themes. For some people, it means getting together and using Ouija boards to divine information from spirits. Others might hold a seance trying to summon spirits directly. Others might celebrate a modern reconstruction of the ancient Celtic pagan Samhain, a celebration for which we have no manuals from pre Christian times, which means that modern reconstructions are reconstructions. So for as many people who celebrate Samhain, you can get that many variations on what it's really supposed to be and what it means. Identifying where all of those things come from is not the purpose of our program tonight. And what we are going to talk about tonight is what people actually do and what those things they do, rituals, what they actually accomplish. And of course, that's going to include some history. And of course, we'll also be speaking from an unabashedly Orthodox Christian point of view, because that's who we are. We're not going to make any apologies about that. But in order for any of that to make any sense, we first have to begin with the Spiritual landscape, as we've been talking about for the past four episodes of this show, there are indeed spiritual beings in the world, aside from the Holy Trinity. There are angels, there are demons. And the demons were angels who rebelled against God. And the primary way that they rebelled was by accepting worship that should be given to God alone. And they're still in rebellion. So that's the basic conflict. So let's go back to the earliest interactions of human beings with those rebels. How did ancient people understand these beings that they worshiped? So let's begin. And Father Stephen, I know you have in our notes here, we're going to begin actually talking about the way that pagans understood the gods whom they interacted with, which, again, from a Christian point of view, and we covered this in previous episodes, these gods the pagans worshipped are fallen angels, also known as demons. So let's talk about the way that pagans understood their gods. So why don't you go ahead and begin for us, Father?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":611.56,"end":611.96,"speaker":"Fr Stephen De Young","text":"Sure."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":612.36,"end":641.46,"speaker":"Fr Stephen De Young","text":"And this, the reason it's important to start here and to address this is because we're used to thinking about, if we ever think about Greek religion or Roman religion or Babylonian religion or Celtic religion, pick your. Your culture's original religious beliefs. We're used to thinking about that in terms of mythology, Right? So we've got. Here's our list of gods, right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":641.46,"end":642.98,"speaker":"Fr Stephen De Young","text":"And they're sort of like the Justice League."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":642.98,"end":658.34,"speaker":"Fr Stephen De Young","text":"There's like the guy who runs real fast and there's the guy who throws the lightning bolts, right? And we're approaching it in that way. And that, of course, is not how the people experienced and approached their religious life who actually lived this in the ancient world."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":658.58,"end":658.98,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":660.82,"end":708.13,"speaker":"Fr Stephen De Young","text":"They didn't view it as obviously, not as fictional characters or as characters at all. These were spirits who they experienced and interacted with. And so, Right. I've got a couple of quotes from Plato that I'm going to read to kind of summarize this. This is how Plato as an Athenian in the classical period, right. So this is sort of our peak of high Greek culture. We could say how he understood where the gods came from and their relationship to the people of particular cities and nations and their relationship to the earth and the ground in those places, the physical space and physical territory."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":708.37,"end":709.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. The geography."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":710.29,"end":858.95,"speaker":"Fr Stephen De Young","text":"Yeah. And so the first of these is from his dialogue, Critias. And if you want to look this up later, this is lines 109B and C, if you want to fully nerd out like I do. But otherwise, here's, here's What Plato says, in the days of old, the gods had the whole earth distributed among them by allotment. There was no quarrelling, for you cannot rightly suppose that the gods did not know what was proper for each of them to have. Or knowing this, that they would seek to procure for themselves by contention that which more properly belonged to others. They, all of them, by just appointment, obtained what they wanted and peopled their own districts. And when they had peopled them, they tended us, their nurselings and possessions, as shepherds tend their flocks, accepting only that they did not use blows or bodily force, as shepherds do, but governed us like pilots from the stem of the vessel, which is an easy way of guiding animals, holding our souls by the rudder of persuasion, according to their own pleasure. Thus did they guide all mortal creatures. Now different gods had their allotments in different places, which they set in order. Hephaestus and Athena, who were brother and sister and sprang from the same father, having a common nature, being united also in the love of philosophy and art, both obtained as their common portion this land, meaning Athens, which was naturally adapted for wisdom and virtue. And there they implanted brave children of the soil and put into their minds the order of government. Their names are preserved, but their actions have disappeared by reason and of the destruction of those who received the tradition and the lapse of ages. For when there were any survivors, as I've already said, they were men who dwelt in the mountains, and they were ignorant of the art of writing and had heard only the names of the chiefs of the land, but very little about their actions. The names they were willing enough to give to their children, but the virtues and the laws of their predecessors they knew only by obscure traditions. And as they themselves and their children lacked for many generations the necessities of life, they directed their attention to the supply of their wants. And of them they conversed to the neglect of events that had happened in times long past. For mythology and the inquiry into antiquity are first introduced into cities when they begin to have leisure, and when they see that the necessities of life have already been provided, but not before."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":859.67,"end":860.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":860.23,"end":866.56,"speaker":"Fr Stephen De Young","text":"So Plato is saying that all of the gods had assigned to them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":866.64,"end":866.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":866.96,"end":892.55,"speaker":"Fr Stephen De Young","text":"The gods and the council of the gods had assigned to them these different places in different territories. Hephaestus and Athene had Athens and its surrounding assigned to them, and they brought forth the people of Athens from the soil of Athens. So there was a connection for Plato and these other ancient peoples between themselves and the soil that they came out of. And themselves and their gods."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":893.19,"end":893.95,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":893.95,"end":895.75,"speaker":"Fr Stephen De Young","text":"Who they believed had been assigned to them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":896.79,"end":988.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it's kind of a long passage. Right. But I think it's a really interesting point to make that here is an ancient pagan describing exactly his understanding of what the pagan landscape looked like. Right. That these gods live in various territories. I mean, they're territorial and they interact frequently with the people that worship them and provide for them and so forth. You know, that essentially everybody just has their kind of their local deity. And of course, he paints. I mean, it's a pretty happy picture of what, you know, as he says, of course, he's saying this is just way at the beginning. He starts out by saying there was no quarreling. And you have to kind of say, well, you know, yet. Right, right. Because, you know, supposedly they were each territorial and they just sort of hung out in their. Their particular territory. And. And I think it's notable that this is contrary to the way that modern people tend to look at ancient paganism, that they basically say, well, you know, pagans just sort of. They saw things they couldn't explain, so they. They figured maybe there's some kind of divine being behind that. But here's an ancient pagan saying, no, this is what we. This is what's going on in our experience. You know, this is, this is what, what, what, you know, he understands pagan life to be like. Right. So. Okay, go ahead."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":989.21,"end":996.54,"speaker":"Fr Stephen De Young","text":"It's important to emphasize as. As you mentioned this, the second part of that quote that Plato sees that."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":997.02,"end":998.42,"speaker":"Fr Stephen De Young","text":"There was this period where they were."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":998.42,"end":1010.62,"speaker":"Fr Stephen De Young","text":"These gentle shepherds right after they were assigned. But something has changed, something has happened, something has been lost. And the bit about the mountains there, I mean, I didn't want to make the quote even longer, but Plato's really."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1010.62,"end":1011.42,"speaker":"Fr Stephen De Young","text":"Talking about the flood."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1011.42,"end":1027.69,"speaker":"Fr Stephen De Young","text":"He's talking about the sinking of Atlantis. And so the only people who survived were sort of these rustics who lived on high mountains. And so he attributes that to the place where sort of these things were lost because he understands that those same gods behave differently now."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1028.17,"end":1040.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, okay, well, do we want to. I mean, I see we've got more here kind of talking about. About this ancient pagan view."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1042.49,"end":1044.89,"speaker":"Fr Stephen De Young","text":"Well, let me. Let me summarize it instead of reading."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1044.89,"end":1047.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, let's summarize that. Yeah, so."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1047.69,"end":1048.89,"speaker":"Fr Stephen De Young","text":"And if someone does want to look."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1048.89,"end":1056.56,"speaker":"Fr Stephen De Young","text":"It up and read it again, if you want to fully nerd out, this is from Plato's on the laws, line 713C through E."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1058.4,"end":1077.84,"speaker":"Fr Stephen De Young","text":"Using the universal line numbers, because that way I don't have to worry about what translation you might pick up. So basically in this section, he repeats essentially a lot of what we just read. But the important additional part here is that he identifies Kronos, the father of."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1077.84,"end":1083.53,"speaker":"Fr Stephen De Young","text":"Zeus, and as the one who did the allotting. So there is a."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1084.09,"end":1102.61,"speaker":"Fr Stephen De Young","text":"For, for Plato here in that early age, there was this most high God was Kronos. His son Zeus presided in the council of the gods. And of course, in a previous episode, we talked about what's called the succession myth that Zeus, you know, later kills."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1102.61,"end":1103.69,"speaker":"Fr Stephen De Young","text":"Kronos and takes over."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1103.69,"end":1107.02,"speaker":"Fr Stephen De Young","text":"But the, the pattern here, this is."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1107.02,"end":1108.66,"speaker":"Fr Stephen De Young","text":"A pattern that I'm using this as."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1108.66,"end":1125.26,"speaker":"Fr Stephen De Young","text":"Representative of every, you can find this in every form of, of pagan religion on Earth, that there is this idea of a most high God who is above, you know, the Decapol gods and."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1125.26,"end":1127.66,"speaker":"Fr Stephen De Young","text":"Who did, who did this allotting and."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1127.66,"end":1134.91,"speaker":"Fr Stephen De Young","text":"The separation and gave places their assigned deities to govern them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1136.91,"end":1166.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So, all right, well, let's, let's then talk about the biblical version of this. And you know, we talked about this a bit in our previous episode, which was about the 5ish falls of angels, and that's the Tower of Babel. Okay, so I'm not going to read this to you. But you know, this is, this is in Deuteronomy 32 and also Deuteronomy is that 4, chapter 4, right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1166.18,"end":1173.26,"speaker":"Fr Stephen De Young","text":"Deuteronomy 32, 8 says that when the Most High divided the nations, he numbered them according to the sons of God."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1173.42,"end":1173.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1174.14,"end":1176.5,"speaker":"Fr Stephen De Young","text":"So it has Yahweh, the Most High."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1176.5,"end":1180.06,"speaker":"Fr Stephen De Young","text":"God being the one who assigns these."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1180.14,"end":1183.1,"speaker":"Fr Stephen De Young","text":"Angelic beings to govern the nations."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1183.34,"end":1393.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. So what happens at Babel is that mankind attempts to worship the one true God by means of idolatry. And God says, no, that's not going to be. And he withdraws himself, he scatters the nations for one thing, and he withdraws himself so that mankind's wickedness will not destroy him in the presence of God and allots the nations to these various angelic beings. And so this is where you get Plato talking about, well, early on the gods were. Everything was great. You know, there was no quarreling and so forth. Everything was great. But then something changed. And from the biblical Christian point of view, what changes is that the gods begin to accept worship for themselves, right? So that these, these angels fall by means of setting themselves up as gods to be worshiped. And so there is, there is this, this alteration in the way that human beings experience the gods. That is these angels who Become fallen angels, or as we would call them, demons. And by the way, just a word about that word, demon, okay? Now when we use the word demon, we have this idea of an evil, dark, horrible spirit. And, you know, we should. But in the ancient world, demon or daemon just meant kind of a spirit, right? Even Socrates claimed that a daemon spoke to him, and that's where he got his wisdom from. And obviously he wasn't saying that was a bad thing thing that he was in league with demons, as we might put it now, right? So when we talk about demons, this is the word actually in the ancient world, just simply means a spiritual being of some kind, you know. But eventually in the Christian context, it becomes very negative. But it's neutral in the ancient world, right? But these demons, these fallen angels, these gods begin to accept worship and they begin to oppress mankind. And it's in that act in particular that they are rebelling against Yahweh, the most high God who created all of them and who appointed them to govern the nations. And so this sets up a conflict right? Now, from the pagan point of view, the gods are all fighting with each other. From the Christian point of view, these fallen angels are rebelling against the one true God. And that's the origin of this conflict. So obviously there's two different takes on what's going on. As Christians, we're taking the Christian take. Like we're not going to, you know, apologize for accepting that as being the truth, right? So. But I know that, you know, Father Stephen, in some of your research here, you have a really interesting passage from actually an anthropologist who, if I remember correctly, this anthropologist is not even particularly any kind of religious person himself. He's just sort of analyzing the ancient world and its religion, right? And I thought this was an interesting. Another interesting angle on exactly the same narrative that we're talking about of early on. These divine beings governing mankind and doing so in a way that seems peaceful and good. And then there's this change that happens. So why don't you go ahead and tell us about this passage that you found in some of your research from an anthropologist, right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1393.14,"end":1398.58,"speaker":"Fr Stephen De Young","text":"So this is. This is from. And I'll give the reference again for people who want to nerd."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1399.46,"end":1402.18,"speaker":"Fr Stephen De Young","text":"It's Andrew Lang's book, the Making of Religion."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1402.18,"end":1407.34,"speaker":"Fr Stephen De Young","text":"So this is a religious anthropology text now."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1407.34,"end":1409.62,"speaker":"Fr Stephen De Young","text":"This is from pages 281 and 282."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1411.3,"end":1469.58,"speaker":"Fr Stephen De Young","text":"And he's. He's saying he's talking about the transition from the worship of a most high God to the worship of a whole Series of lesser gods and sort of the dying away of direct worship of that most high God in pretty much essentially all pagan cultures as a historical event that happens in their religious development. So it says, the moral creator, in no need of gifts and opposed to lust and mischief, will not help men with love spells or with malevolent sending of disease by witchcraft, will not favor one man above his neighbor or one tribe above its rivals as reward for sacrifice which he does not accept or is constrained by charms which do not touch his omnipotence. Ghosts and ghost gods, on the other hand, in need of food and blood, afraid of spells and binding charms."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1473.67,"end":1473.91,"speaker":"Fr Evan Armatas","text":"Are."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1475.43,"end":1490.39,"speaker":"Fr Stephen De Young","text":"A corrupt, but to man a useful constituency. Man being what he is, man was certain to go a whoring after practically useful ghouls, ghosts, ghost gods, and fetishes which he could keep in his wallet or medicine bag."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1491.03,"end":1492.75,"speaker":"Fr Stephen De Young","text":"For these, he was sure in the."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1492.75,"end":1520.73,"speaker":"Fr Stephen De Young","text":"Long run, first neglect his idea of creator. Next, perhaps to reckon him as only one, if the highest of the venal rabble of spirit or deities and to sacrifice to him as to them. This is exactly what happened, right? So the, the most high God, the reason he becomes sort of irrelevant to worshipers is that he doesn't need anything. He's not going to be swayed by any right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1520.73,"end":1523.07,"speaker":"Fr Andrew Stephen Damick","text":"So there's no deal they can make right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1523.07,"end":1542.75,"speaker":"Fr Stephen De Young","text":"Shall not the judge of all the earth do right? And God, as the Old Testament says, does not delight in the blood of bulls and goats. Well, if I want to get someone to fall in love with me, or if I want to curse my enemy, or if I want to get somebody on my side so that I can defeat my neighboring tribe in war."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1545.71,"end":1546.07,"speaker":"Fr Stephen De Young","text":"There'S."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1546.07,"end":1561.73,"speaker":"Fr Stephen De Young","text":"Nothing I could do with the most high God. But if we have our own God and they have theirs and, well, maybe I can bribe theirs into coming over to our side and letting us win, or maybe I can get this or that spirit of the woods to do what I want in terms of making."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1561.73,"end":1563.13,"speaker":"Fr Stephen De Young","text":"This person fall in love with me."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1563.13,"end":1573.93,"speaker":"Fr Stephen De Young","text":"Or cursing this person. And so it becomes sort of more pragmatically useful to shift one's devotion and attention to these gods with whom you."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1573.93,"end":1574.93,"speaker":"Fr Stephen De Young","text":"Think you might be able to set."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1574.93,"end":1577.19,"speaker":"Fr Stephen De Young","text":"Up a quo of some sort of."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1577.5,"end":1772.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And it's, it's, it's interesting. You know, I think often people think about religions as being basically equal, right? Well, everyone has different views and everyone worships in their own way, and they're all basically trying to accomplish the same thing. But like, what this anthropologist is basically saying is like, no, if your deity doesn't need anything from you, then that is a different kind of religion than one that needs you somehow, because one where you can make deals with him and get whatever it is you want from him precisely because you're doing particular things, then that creates a different kind of morality. It certainly creates a different kind of worship. Whereas a deity that's above everything and doesn't need anything and is outside of everything, he can command universal loyalty. Right. He can set universal moral principles that are good because they're good. Right. And because he himself is the definition of the good. Right. So one of the things that this points out, and it's going to become clear why we're setting things up this way when we're talking about Halloween. Okay? So just bear with us. You know, one of the things that this points out is that the one true God, the most high God, is a very different kind of being than these gods that are being worshipped by ancient pagan peoples. Right. That from the Christian point of view, start out as angels governing on behalf of God the nations, and then fall because they begin to receive worship and become wicked and rebellious and of course, you know, fighting with one another, you know, it's a very different kind of thing. So, you know, like sometimes the atheist will say to the Christian, well, the only difference between me and you is that I just believe in one fewer God than you do. You know, say, well, Christians just don't believe in other gods. They just believe in their one God. But from you know what we've. If you listen to this show, you'll know that we believe that there are multiple divine beings, but only one is worthy of worship. And not only is he the only one worthy of worship, he's quite different from the rest. Right. Who among the gods is like unto Thou, O Lord? Right. We see that kind of thing over and over again in scripture. So before we go to break, which we're going to go to in just a minute here, I wanted to read a passage here that is from Galatians, chapter four. Okay. And this is following on, we were just talking about where there is this slavery that happens between mankind and these various gods that they begin to worship and all of these vicious animal sacrifices, even human sacrifice. And there's this. The morality of the ancient world is about the strong dominating the weak. I mean, no one in those days when this came to be would have said that all people are valuable. Right? There is no sense that everybody is created equal."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1774.36,"end":1774.76,"speaker":"Fr Stephen De Young","text":"Clear."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1777.24,"end":1786.44,"speaker":"Fr Stephen De Young","text":"We're talking about paganism, the reality. Paganism, yeah. Can be an awful kind of experience."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1792.2,"end":1800.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. We're we're gonna go ahead and take a break. We're having some sound issues with with Father Stephen there, but we will be back in just a minute."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1800.9,"end":1818.5,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1823.7,"end":1865.76,"speaker":"Announcer","text":"Now available on Ancient Faith Publishing the Shield of Psalmic Prayer Reflections on Translating, Interpreting, and and Praying the Psalter in this posthumous collection of poet and teacher Donald Sheehan's reflections on Psalms and psalmic prayer, culled from his journals and teaching notes, you will find two quite different kinds of writing working in tandem, poetic and personal journaling by a man of faith, a scholar, a linguist, and in the deepest sense, a teacher. Alongside scholarly linguistic and poetic analysis by a man steeped in poetry, who thought like a poet. Here's what Father Stephen Freeman has to."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1865.76,"end":1905.61,"speaker":"Fr Stephen Freeman","text":"Say on the in the spiritual life, two things are essential what we do and how we do it. In this wonderful collection of the late Donald Sheehan's thoughts on the Psalms, we see both. He takes us into what the Psalms are in depth, that is the Word of God. But he also demonstrates time and again how those deaths shape his life in the world in which he lives. Thus we are given two things, the Word of God and a life in which the Word has given shape. It's a path we all should walk."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1906.33,"end":1920.31,"speaker":"Announcer","text":"You can find this book and others like it at store. Ancient faith Again, that is store.ancient faith.com Here is mother Alexandra of blessed memory."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1920.63,"end":1948.86,"speaker":"Linda","text":"It seemed to me that in this modern life of ours, where everything has become so frightfully materialistic, there is a very great need of transfiguration, of a change of our attitude, our way of thinking thinking, our way of behaving, our way of holding ourselves. Everything needs a new Christianization. We must become more aware of the Christ within us."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":1949.5,"end":2005.12,"speaker":"Announcer","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the Church as expressed in her theology, hymnography, and iconography. For those who long to become better acquainted with these holy servants of God and to understand their role in our lives. This book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com hi."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2005.12,"end":2057.71,"speaker":"Fr Evan Armatas","text":"This is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing. Titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting, and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in explaining exploring the three legged stool of Orthodox spiritual practice. Prayer, Fasting and Almsgiving Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God Bless."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2061.71,"end":2104.3,"speaker":"Announcer","text":"Now available on Ancient Faith Publishing the Shield of Psalmic Prayer Reflections on Translating, Interpreting and Praying the Psalter in this posthumous collection of poet and teacher Donald Sheehan's reflections on psalms and psalmic prayer, culled from his journals and teaching notes, you will find two quite different kinds of writing working in tandem, poetic and personal journaling by a man of faith, a scholar, a linguist, and in the deepest sense, a teacher. Alongside scholarly linguistic and poetic analysis by a man steeped in poetry who thought like a poet, here's what Father Stephen Freeman has to say on the book."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2105.34,"end":2143.59,"speaker":"Fr Stephen Freeman","text":"In the spiritual life, two things are essential what we do and how we do it. In this wonderful collection of the late Donald Sheehan's thoughts on the Psalms, we see both. He takes us into what the Psalms are in depth that is the Word of God. But he also demonstrates time and again how those deaths shape his life in the world in which he lives. Thus we are given two things, the Word of God and a life in which the Word has given shape. It's a path we all should walk."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2144.31,"end":2155.26,"speaker":"Announcer","text":"You can find this book and others like it at store. Ancient faith again, that is store.ancientfaith.com we're."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2155.26,"end":2170.98,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2173.94,"end":2185.46,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're back. We got Father Stephen switched over to another audio source there. Thank God. Although I hear your dog in the background there, Father Stephen. Is that one of your dogs?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2186.42,"end":2189.3,"speaker":"Fr Stephen De Young","text":"One of them probably was making his presence known."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2189.62,"end":2207.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we were just talking about morality, especially in the ancient world that resulted from the way that these fallen angels, these fallen gods, interacted with human beings. Did you want to add anything else to that before we talk about this little passage from Galatians, chapter four?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2208.48,"end":2235.76,"speaker":"Fr Stephen De Young","text":"Yeah, well, I'm not sure when exactly I got cut out, but I was just attempting to make the point that when you look at the nature of the gods who are being worshipped with whom these quid pro quos were being formed, and you have, for example, Zeus, when you believe that the God who presides over the council of the gods is essentially a serial rapist."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2236.45,"end":2236.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2238.05,"end":2246.05,"speaker":"Fr Stephen De Young","text":"And that's what he is. And, you know, if there's any for anybody who needed to be me too'd, it was Zeus."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2247.25,"end":2247.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2248.37,"end":2314.67,"speaker":"Fr Stephen De Young","text":"And you know what. What does that do to shape your view of manhood and masculinity in your culture? And when your view of womanhood is shaped around his wife, Hera, who is constantly being abused and aggrieved and then taking vengeance in her anger and jealousy, and the actual Gaia from Greek religion who, you know, had her children taken from her and so just brings forth monsters to take violent revenge, what view of womanhood does that give to your. To your culture? And so while we're talking about ancient paganism and not the modern stripe, the result of that is, as we saw historically, brutal caste systems, slavery. That's the cost of sort of this quid pro quo that was set up with these spirits to get them to do these vindictive and petty things that the worshipers wanted them to do."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2315.07,"end":2523.69,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Yeah. So, I mean, again, religions are not all the same. They don't have the same effect on. On people. You know, theology matters. What you're worshiping matters. You become like what you worship. Right. And because that. That deity becomes part of your community and you become part of its community. Right. So that leads us then to Galatians, chapter four, verses three. And then also we're gonna bracket it with verse nine, which reads like this. In the same way, we also, when we were children, were enslaved to the elementary principles of the world. Like, listen to that. We were enslaved to the elementary principles of the world. But now that you have come to know God, or rather to be known by God, how can you turn back again to the weak and worthless elementary principles of the world whose Slaves you want to be once more. So what St. Paul is saying there, if you've been listening to everything we've just been saying, is, look, back in the day, you were enslaved to these false gods. You know, they were associated with the. As he calls them, the elementary principles of the world. I mean, that's what he's talking about. He doesn't mean that you're enslaved to, you know, carbon and oxygen and, you know, that's not what the elementary principles of the world is. They don't think in those terms. He's talking about spiritual beings, and then he's saying, now that, you know, the one true God, why would you want to go back there? You know, why would you want to be subject to them again? Right. Again, we're talking about this conflict that comes about because of the fall of these angelic beings, you know, becoming demons, becoming the gods of paganism. Okay? So that's the basic setup for the spiritual landscape that we're talking about. And it's what's really important. When we're talking about Halloween, you're still. I mean, some of you, I'm sure, probably are on the edge of your seats. Like, when are they going to actually talk about Halloween? Isn't this the Halloween episode? But the truth is that we. We're so used to thinking about religion and about rituals and about customs and practices in ways that kind of assume that most of the world is not spiritual, or for some people, it's not at all. So we have to kind of reconstruct, at least within our minds, the way that the world really is, the way that the world is depicted by the Scriptures, the way the world is depicted in the tradition of the Orthodox Church. So. So just, again, bear with us. But because it takes, you know, I myself had to kind of go through some of this process and sort of unlearn the things that I had learned and, you know, you know, relearn to learn a new way of looking at the world, which actually is the old way in a lot of ways. So. Right. And, you know, the last thing I think we should say about this, and I'm going to let you say it, Father Stephen, is, you know, that there's a difference between. You kind of alluded to this a little bit earlier, but there's a difference between the way that ancient pagans described what their experience was with their gods and the way that modern people who describe themselves as pagans or neo pagans do. So what's the difference there between those things?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2524.89,"end":2526.33,"speaker":"Fr Stephen De Young","text":"Right. And this is important."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2526.65,"end":2527.05,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2528.89,"end":2540.88,"speaker":"Fr Stephen De Young","text":"Your Wiccan neighbor down the road is not doing any human sacrifices and does not believe in a brutally oppressive caste system."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2541.2,"end":2541.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2542.88,"end":2598.73,"speaker":"Fr Stephen De Young","text":"Does not believe that women are subhuman. None of those. None of those things is true of them. Right. So in a way. Right. In a way, you could almost describe modern neo paganism, these reconstructed paganisms, as sort of Protestant paganism. And I mean that in the sense that it's a reconstruction, not just trying to go back to that rather dark world of actual ancient paganism, but taking elements of it, but formed along the lines of a general sort of Northern European cultural sensibility and morality, which is this the same kind of cultural factors that have influenced a lot of Northern European and American Protestantism?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2598.73,"end":2599.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2600.69,"end":2608.21,"speaker":"Fr Stephen De Young","text":"And so, yeah, we're not accusing any of those people of any of these things that I just talked about happening in the ancient world."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2608.29,"end":2625.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. There's a big difference between that kind of religion and what it is that people are practicing now. Right. So before we move on, I'd like to take a call. And so we have Jacob calling from Chicago. Jacob, can you. Can you hear me?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2626.52,"end":2627.72,"speaker":"Jacob","text":"Yes, Father, I can."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2628.2,"end":2636.12,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, Jacob, welcome to the Lord of Spirits Halloween special episode. What's your question or comment, Jacob?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2636.68,"end":2709.56,"speaker":"Jacob","text":"Thanks so much. My question is, and I'll try to be as quick as possible and succinct as possible when you, as a believer or an Orthodox Christian, have an experience where you have felt like an evil presence surrounds you or oppresses you specifically, you know, when you're alone or in the evening time, like, for example, a dream and something like that happens, what does that mean? And what would you do in response? So, for example, I actually had a personal experience recently where I woke up in the middle of the night. I had a terrible dream. It was pretty evil. And I felt that presence around me still. So I went and I went to my, you know, my prayer corner and I read the vespers. But it wasn't even until I got to the creed where I started to feel better. And then it. It lifted. And I'm like, okay, I'm normal now. It's 1:45 in the morning. I can go back to sleep now. But it's just. It struck me, and I think there's meaning behind it. There's a reason, you know, God obviously allows these things to happen, and they're rare and distinct."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2709.56,"end":2710.2,"speaker":"Linda","text":"But I."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2710.44,"end":2726.12,"speaker":"Jacob","text":"The reason I'm asking is because, you know, my father has had similar experiences, and he's not an Orthodox Christian, but he's interested. So I'm just kind of curious as to what, you know, what this kind of. What your take on this would be."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2726.98,"end":2736.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you're having. Let me see if I can summarize what you're saying. There's a sense of an evil presence in dreams, right? Is that right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2736.82,"end":2739.3,"speaker":"Jacob","text":"Yeah, correct. And in waking, that character."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2740.18,"end":2768.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And how do you understand that? You know, part of the difficulty, of course, in responding to stuff like that is that it's hard to speak generally about specific experiences, right. So, like, I can't say, for instance, that there is definitely a demon affecting you or your. You said it was your father, is that right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2768.8,"end":2769.68,"speaker":"Jacob","text":"That's correct."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2769.84,"end":2900.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But certainly that is possible, right? I can say that generally speaking that it is possible that that is the case. So, you know, the, you know, the thing to do about that, of course, is that if, you know, as a Christian, you know, or as an Orthodox Christian, to make the sign of the cross and to pray for God's protection, you know, and, you know, as an Orthodox Christian, you can anoint yourself with holy water and, you know, any negative experience that we have should be an opportunity for repentance for us. And this kind of underlines actually beautifully the difference between the orthodox Christian understanding of repentance and maybe some other Christians understanding of repentance. That for the Orthodox Christian, repentance is not only I did something bad and therefore I need to make up for it, right. Or say I'm sorry or whatever, but rather it's moving towards Christ. It's becoming more like Christ, right. So, you know, I can repent even if I've not done anything particular bad. And why? Because I'm not perfect yet, right? I'm not completely like Christ yet. So repentance is to move towards him, to turn towards him again. So even if there's not some specific evil deed I've committed, right. And so, you know, even when a righteous person experiences suffering, whether it's directly from demonic affliction or something else, he uses that for repentance. In other words, he uses to become even more like Christ. Even though he's righteous, he can become more righteous, right? So, you know, for Orthodox Christians, we have a lot of tools for this. Other Christians may not have the same kind of understanding, but certainly they can use that disturbance as a way to draw near to God, even if they're. The only way that they're doing it is maybe to ask for his protection or for his love or for his healing. So I don't know. Father Stephen, did You want to add anything to that?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2902.11,"end":2931.98,"speaker":"Fr Stephen De Young","text":"Well, just in the general sense. And again, obviously, we can't go into this particular case, but it is said in our orthodox evening prayers that we ask for protection from the fantasies of Satan which come in the night. And that's talking about dreams. Right. So the key is that if. If you are in Christ, there's. There's not a demon out there that you need to be afraid of."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2932.38,"end":2932.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2933.42,"end":2969.57,"speaker":"Fr Stephen De Young","text":"And, well, being sort of beings of chaos and destruction is try. And so fear and confusion and this sort of thing. So being afraid is the exact opposite of what you should do. And those prayers, even if they don't take away whatever particular dream experience it is, will help you again to become more confident in not giving into that kind of fear and confusion that it's trying to sow."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2969.82,"end":2974.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, does that. Does that make sense to you there, Jacob?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2974.86,"end":2976.22,"speaker":"Jacob","text":"That makes perfect sense."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2976.7,"end":2977.42,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2977.42,"end":2984.3,"speaker":"Jacob","text":"I kind of felt like that was the way that, you know, that what we were going to. That was kind of the conclusion that we were going to get at."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2984.62,"end":2985.66,"speaker":"Anthony","text":"And, I mean, I think."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2987.5,"end":2990.62,"speaker":"Jacob","text":"I think that's really encouraging. And so thank you so much, Father."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":2991.02,"end":3037.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep, absolutely. Thank you for calling, Jacob. All right, well, let's continue on in what we're talking about. So we've set up this basic kind of conflict between the false gods, the fallen angels, and God and his righteous ones on the other side. And, you know, obviously this is a problem that needs to be solved, and the one to do that is Yahweh, the most high God. Right. So let's talk about that. Father Stephen, I see that you've got here something from one of our favorite Psalms, which is Psalm 82. I think you're going to hear about Psalm 82 maybe on every episode. I don't know every episode here, but yeah, let's talk Psalm 82. This is such an important psalm, people. So if you've got your Bible, open it up and take a look at Psalm 82."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3038.58,"end":3042.7,"speaker":"Fr Stephen De Young","text":"Yeah. Or Psalm 81, if you're using an orthodox study, by the way."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3042.7,"end":3043.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Yeah, sure."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3046.42,"end":3062.04,"speaker":"Fr Stephen De Young","text":"Yeah. So this, you know, building off of what we read in Galatians. Right. St. Paul's whole take on paganism when he's talking to pagans. You can go to Acts 17 in Athens in the Areopagus, which I know is a passage near and dear to Father Andrew's heart."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3062.04,"end":3063.32,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, absolutely."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3065.4,"end":3076.68,"speaker":"Fr Stephen De Young","text":"Paul's approach is that most high God, who you haven't known and who you haven't been known by, as he says, in Galatians, is now coming to take you back."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3077.13,"end":3077.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3077.77,"end":3112.66,"speaker":"Fr Stephen De Young","text":"Right. Not that he tossed you aside. Right. St. Paul is clear about that, too. He never tossed you aside. Right. He's always wanted you back, but now he is taking you back. And so that action of taking back the people of the nations, who are sometimes translated in English as Gentiles, is related to an event that's prophesied in the Old Testament. And that event, based on Psalm 82, or 81, if you're in an orthodox study Bible with the Greek numbering, is called the death of the gods. Death of gods, Somewhat."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3113.14,"end":3113.7,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3114.34,"end":3118.42,"speaker":"Fr Stephen De Young","text":"So I will just read the whole thing because Psalm 82 is not long."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3118.58,"end":3118.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3120.5,"end":3198.65,"speaker":"Fr Stephen De Young","text":"God has taken his place in the council of the gods. In the midst of the gods, he holds judgment. How long will you judge unjustly and show partiality to the wicked? Give justice to the weak and to the fatherless? Maintain the right of the afflicted and the destitute? Rescue the weak and the needy, Deliver them from the hand of the wicked? They have neither knowledge nor understanding. They walk about in darkness. All the foundations of the earth are shaken. I said you are gods, sons of the most high, all of you. Nevertheless, like men you shall die and fall like any prince. Arise, O God, judge the earth, for you shall inherit all the nations. So this is describing a scene in which Yahweh, the God of Israel, who presides in the council of the gods, the sons of God. Right. These divine or angelic beings, comes into their midst and he renders judgment because he assigned something to them. And that's the basis of this judgment. And what is that? To represent the cause of the orphan and the widow. Right. To care for the weak and the poor. Right to be that kind of gentle shepherd that Plato was describing."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3198.73,"end":3202.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. The gods as they were. Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3203.69,"end":3205.77,"speaker":"Fr Stephen De Young","text":"And that's not who they've been."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3206.33,"end":3206.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3206.65,"end":3233.61,"speaker":"Fr Stephen De Young","text":"As we were just talking about. That's not who they've been for all the nations to whom they were assigned. And so they're getting killed. That's the. The. The true God is. Is killing them. Is. Is driving them out. Right. And he is taking back as an inheritance to himself. He is taking back those nations and those peoples to whom he had assigned them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3233.77,"end":3234.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3234.41,"end":3236.33,"speaker":"Fr Stephen De Young","text":"After rendering judgment against them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3237.05,"end":3255.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. So, you know, it's. It's. This is. And hopefully this blows some people's minds here a little bit, because it blew my mind when I realized it. This is, in fact, what the whole Bible is about. Right. Would you agree with me on that."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3257.26,"end":3259.06,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3259.06,"end":3364.77,"speaker":"Fr Andrew Stephen Damick","text":"Overall, yeah. Yeah. Not every single verse, but it's what's going on in the Bible, and for Orthodox Christians, it's what's going on as Christians that God is taking back what belongs to him. And we belong to Him. We belong to Him. That's what it means for us to be saved. Saved from what? Saved from this malevolent, domineering, oppressing influence of these fallen angels who rebelled against him. And the last part of that psalm, arise, O God, judge the earth, for you shall inherit all the nations. As Orthodox Christians, we sing that on Holy Saturday, and Holy Saturday being the day before Pascha, or Easter, on which we believe we ritually connect with the resurrection of Christ. Arise, O God, and judge. So he's arising from death and laying down judgment on these fallen gods. Right. And this is why we are able to be saved from. That's what we're being saved from. We're not just being saved from kind of a personal moral failing. The personal moral failings come as a result of cooperation with these beings. You know, whether you know it or not, every time you sin, you're cooperating with them, just as every time you do something good and holy, you're cooperating with the one true God, with Yahweh. So, like I said, that blew my mind when I first realized, like, wait, there is a war on, and I'm caught in the crossfire here, Right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3365.49,"end":3413.59,"speaker":"Fr Stephen De Young","text":"And I don't want to go too far down the Greek nerd rabbit hole, but in case some people. We actually sing the whole psalm, because we do the other verses of the psalm as stickera, as verses in between that last verse that we sing as a chorus, Holy Saturday. But some people may think, well, okay, yeah, it says arise. Right? That's not about Jesus rising from the dead. Right. You'll get that. So just to briefly mention that the verb there, anasti, in Greek. In the Greek version of this psalm is a different verb. That's than what's used in the New Testament to talk about Christ rising from the dead."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3413.67,"end":3414.15,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3414.23,"end":3421.59,"speaker":"Fr Stephen De Young","text":"Which is usually eiro. Eiro is the word that's used to. When it says Christ rises from the dead."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3421.59,"end":3421.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3422.87,"end":3455.44,"speaker":"Fr Stephen De Young","text":"So this is literally to stand up again, like to take a stand. Right. To judge. Okay. So when you see an icon for Holy Saturday of the harrowing of hell, or when St. Paul refers to not to Christ rising, but to the resurrection, the anastasis, he's not just talking about Christ rising from the dead. He's saying that Christ rising From the dead is the anastasis. It is this judgment."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3455.52,"end":3456,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3456.47,"end":3457.59,"speaker":"Fr Stephen De Young","text":"It is this event."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3458.23,"end":3458.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3459.59,"end":3468.23,"speaker":"Fr Stephen De Young","text":"So this isn't just sort of an analogy or, hey, here's a word that's similar. This is a theological point that the New Testament makes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3468.23,"end":3658.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, It's Christ coming into his judgment, Christ standing up to judge the fallen gods. Right. And, you know, we got a couple more lines from the Old Testament, from Isaiah 24:21, which basically says the same thing. In that day, Yahweh will punish the host of heaven in the heavens and the kings of the earth on the earth. Obviously, that's not talking about the angels that are obedient. Why would he do that to them? This is talking the host of heaven. So it's clearly identifying that these are fallen angels, right? The kings of the earth on the earth, that these are the rulers over the earth, these spiritual rulers over the earth. It's not talking about presidents and politicians and princes and kings in that sense. This is. This is a spiritual war that's on. And then, you know, also then as we begin to sing, not just on Holy Saturday, but on Pascha itself, on easter itself. Psalm 68, one of my favorite hymns. Let God arise and let his enemies be scattered, and let them that hate him flee from before his face. It's such a stunning thing to say. And you know, like, who are the enemies that are being scattered? These are not like unbelievers. These are not members of other religions. These are, you know, that's not what it's talking about. It's talking about these. These. These rebellious angelic beings, you know, the demons, That's. Those are the enemies of God. That's such an important thing, important point to make. And I just want to pause in a second and. And really emphasize this because sometimes Christians, and even orthodox Christians too, we're no better about this. We act like the enemies of God are other people. They are not. They are not. Now, they may sometimes act in a. In a way to oppose themselves to God if they cooperate with the enemies of God. But they are not the enemies of God. The enemies of God are these angelic beings who from. Of old declared war on him by taking from him what belonged to him, namely worship and humanity, right? That they rebelled. They are the enemies of God. So let God arise and let his enemies be scattered. Let them that hate him flee from before his face. That's what happens when Jesus rises from the dead, right? There is this conflict. There is not peaceful coexistence, right? It is a war. It's not like, well, you know, we'll let. If Zeus wants to be worshipped over here, then we'll let him do that. God is absolutely not accepting that, you know, there is a war on. Absolutely, there's a war. Anyway, I just wanted to emphasize that because I think it's a really, really important point. And it kind of. I don't know, it loosens us up to not have to be hateful to other. To other people. Even if they are absolutely opposed to us, we don't have to. They're not the enemies of God. They might be enslaved to the enemies of God, but you don't treat your enemy's slave badly because of the way he's being enslaved, you know? Right. So I just wanted to kind of double down on that. I think it was a really, really important point."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3660.05,"end":3666.93,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah. And that's the attitude of God himself toward these people."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3667.01,"end":3668.05,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3668.53,"end":3676.23,"speaker":"Fr Stephen De Young","text":"God doesn't say, you filthy pagans, you can go to hell with the. The demons you worship. No, Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3676.23,"end":3677.51,"speaker":"Fr Andrew Stephen Damick","text":"No, the."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3677.59,"end":3691.27,"speaker":"Fr Stephen De Young","text":"The whole thing, I mean, Christ, you know, becomes man, suffers and dies and rises again in order to set those people free and bring them back to their creator because their Creator loves them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3691.43,"end":3693.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3693.83,"end":3697.83,"speaker":"Fr Stephen De Young","text":"So, yeah, God does not hate those people."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3698.79,"end":3699.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3701.64,"end":3725.64,"speaker":"Fr Stephen De Young","text":"He is trying to redeem them. And so it's also important that once again, these beings who God assigned to govern the nations who he assigned and created and assigned to govern the aspects of the physical and material creation, these angelic beings, it's not that God needed them. Like he couldn't handle it all on its own."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3725.88,"end":3729.41,"speaker":"Fr Andrew Stephen Damick","text":"No, it's his love. It's his love having them participate in it."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3730.36,"end":3748.84,"speaker":"Fr Stephen De Young","text":"Right. He loves them, and so he shares his rule and his authority and his creation with them. But so when Christ arises in victory, right. When the anastasis happens and these gods get killed, that leaves a bunch of job openings."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3748.92,"end":3764.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, there you go. All right, well, so on that note, then, let's go ahead and take another break, and when we come back, we will talk about those job openings. We'll get to Halloween. It's about Halloween, I promise. All right, let's go, Rick."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3764.15,"end":3766.67,"speaker":"Fr Stephen De Young","text":"And how you can apply for those job openings. There you go."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3767.71,"end":3785.48,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-23723. That's 855-AF-RADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3790.36,"end":3811.95,"speaker":"Announcer","text":"All these things. A new podcast from Ancient Faith Radio in which Hannah Vasquez offers encouragement and inspiration as well as practical tips to mothers as they navigate their responsibilities with all these things homemaking, child care, food preparation, etc. While trying to stay focused on seeking the kingdom."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3812.27,"end":3826.27,"speaker":"Fr Andrew Stephen Damick","text":"Being an Orthodox Christian in this world is hard and mothering is hard combined. It's a lot to navigate and discern. I want to help be a guide for you in your journey toward the Kingdom of God that is the heart behind this podcast."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3826.91,"end":3838.05,"speaker":"Announcer","text":"All these Things Seeking the Kingdom of God as an Orthodox Christian Mother, available now on ancientfaith.com podcasts."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3840.45,"end":3856.61,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3857.01,"end":3890.48,"speaker":"Fr Andrew Stephen Damick","text":"If you welcome back, everybody. So when we completed our last segment, Father Stephen put out a job. Advertisement well, we're just sort of like, we're like headhunters over here. You know, we're just letting people know that there are some positions available because the heavenly hosts are, you know, a bit depleted as a result of the rebellion of these fallen angels. So what do you mean by that? Father Stephen."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3892.48,"end":3911.04,"speaker":"Fr Stephen De Young","text":"Well, God's love hasn't changed, and his desire to share his creation and his rule and his authority and his eternal divine life with his creations hasn't changed. And so there is now this room. There's this space."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3912.12,"end":3912.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3912.36,"end":3973.46,"speaker":"Fr Stephen De Young","text":"For others to come in. And so what we find very quickly in the New Testament is that a lot of the terminology that's used to describe these angelic beings in what we call the Old Testament in the Hebrew Bible starts right off the bat, getting applied to humans who are in Christ. And so we talked about some of that language, the sons of God language that was used for these angelic leaders and authorities, but probably the even more common one is the word that's translated as saints, Right. Which literally means both in Hebrew and in Greek, holy ones."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":3973.62,"end":4010.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. So before we elaborate on that too much, I wanted to take a call from Myla. I'm not sure if it's Myla or Mila. It's spelled M Y L A. So, Myla, are you there? Can you hear me? Myla, are you on the other end of the line there? All right. Well, I'm not sure where Myla is, but my note says that Myla asked, is Myla, are you there? Yes. Are you there? Yeah. What's your question, Myla?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4010.11,"end":4010.59,"speaker":"Linda","text":"Yes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4018.04,"end":4018.4,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4018.4,"end":4018.76,"speaker":"Fr Stephen De Young","text":"Well."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4020.68,"end":4037.48,"speaker":"Fr Andrew Stephen Damick","text":"My understanding is that Myla is one of Our young people. Okay, okay. Well, Myla's question in my notes is she asked, is Satan an angel? Is Satan an angel? So the answer. Yeah, go ahead, Go ahead, Father."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4038.92,"end":4040.92,"speaker":"Fr Stephen De Young","text":"The answer to that is he was."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4040.92,"end":4048.23,"speaker":"Fr Andrew Stephen Damick","text":"He was exactly right. He rebelled. So he lost that job, right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4048.31,"end":4048.79,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4048.95,"end":4146.21,"speaker":"Fr Andrew Stephen Damick","text":"He didn't do what he was supposed to do, Myla. And so Satan was an angel and he rebelled against God, who gave him that task of being an angel, and now he serves himself. So he was. But he lost it because he was bad, and he permanently left it behind. So, Myla, I'm not sure if you can hear us, but I hope that answers your question. All right, well, I'm not sure we actually got her on the line, but I hope we answered a question there. All right, well, Father, you were talking about the saints, right? And we've talked about this a lot in previous episodes, okay. Especially the previous one, the immediately previous one, that the saints are the holy ones of God. And initially in the Old Testament, that term applies to the obedient angels, right? God's, you know, obedient servants. And we've talked about the various ranks of angels and so forth. So if you want to know about that, you have to go back and listen to those previous episodes. But. But obviously, you know, God, it's not, as you said, God is. It's not that God is incapable of fighting this war himself or of taking care of the universe himself. He's capable. But it's his love that wants. Wants other beings to participate in this. And so this is given initially to the heavenly hosts. Right? But then, as we heard, as we've heard several times on this show, that is opened then to human beings, that God is drawing in human beings to become part of the heavenly host as well. Does that mean that we become a different species? Father STEPHEN?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4148.37,"end":4201.72,"speaker":"Fr Stephen De Young","text":"No, no, no. Short answer as yes. Short answer is no. So it's, again, it's not about becoming. Even saying becoming angels is kind of technically incorrect because as we talked about before, angel is sort of a job description. Yeah, right. Angel is. You're a messenger. That's what you do. So in a sense, humans can become angels and that a human can serve as the messenger of God. Right? But in the sense of we don't cease to be a human person in God, this new job and this new role and these new gifts, the adoption as sons that we talked about last time, being made a holy one does not change the one, right? A holy man is still a man."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4202.04,"end":4213.89,"speaker":"Fr Andrew Stephen Damick","text":"He's just now holy because he's filled with the presence of God, who changes the way that he exists and gives him, frankly, abilities that he may not have otherwise had."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4215.25,"end":4277.51,"speaker":"Fr Stephen De Young","text":"Right. And so he shares in God's holiness. And I had in the note. I'm not going to read all this in the notes, but just one representative passage from the Old Testament where this term holy ones is used in the same kind of way we've been talking is in Psalm 89, 5, 7. Let the heavens praise your wonders, O Yahweh. Your faithfulness in the assembly of the holy ones. In the council of the holy ones. God is greatly feared. He is more awesome than all who surround him. And I didn't read the whole psalm, but it's very clear in the psalm he's talking about in the heavens. So this isn't talking about holy people on earth yet, because they're not up the sky. I'm not definitely not going to read all these, but if you talk about the word that we translate, saints. Right. Holy ones being applied to humans in the New Testament, I listed probably two dozen verse references just from St. Paul."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4277.51,"end":4408.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we can't list those off, but yeah, it's over and over again. Basically, this word, this phrase that's used. Well, it's a single word in Greek anyway. I don't know if it is in Hebrew as well, but yes. Yeah, that gets used in for humans, human beings. This word that's for angels, for God's holy ones, gets applied to human beings. So, yeah. And then, you know, one of the things that's fascinating to me, for instance, is that there are these other references in the New Testament, such as in Revelation chapter 20, where you've got these elders, these 24 elders, and there's references to a third of the stars falling from heaven. Right. And what does that have to do with anything? Well, you know, as we talked about before, the stars are associated closely with divine beings. And we know that a number of these divine beings rebel against God. And so that is appropriate then to describe them as falling from heaven. And there is this traditional number of 70 or 72 nations. Right. And so 72 elders. Right. 72 elders of Israel. And so if you eliminate a third of those, then the number you get is 24. And what do you know? There are 24 elders, human beings, redeemed human beings in the Book of Revelation that surround the throne of God and offer up prayer and worship to him and the prayers of the saints, as it says there in the Scripture. Right. So there is why the number 24? They're not saying that only 24 people get saved. That's not what that means. It's, it's a, it is a symbolic third. You know, in other words, the idea, the point is not that only a certain number of people can be redeemed, it's that the fallen angels leave this space open. Like you said, there's kind of a, there's a, you know, some openings, you know, position is being advertised. Human beings take the place of these fallen divine beings and do the service that they do. Right? So they replace, they absolutely replace these fallen beings."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4410.33,"end":4454.48,"speaker":"Fr Stephen De Young","text":"And you have, in Revelation 24, you have the souls of the martyrs, those who are slain for Christ, which come alive and rule and reign with Christ. He shares his rule and his reign and authority with them. We've referenced this before, but Matthew 19:28, where Christ says to his disciples, you'll sit on twelve thrones and judge the twelve tribes of Israel. Right. That's an ongoing thing. They're going to rule over the 12 tribes of Israel. And just as an aside, when he said that Judas was One of the 12 standing there, Judas did not get that throne. Sorry, Calvinists, it's a slot and a job."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4456.32,"end":4461.6,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, maybe we'll explain that joke sometime in the future. But yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4463.76,"end":4493.98,"speaker":"Fr Stephen De Young","text":"All right, so you see that sometimes I think we have weird views of the life of the world to come, of eternal life. Right. We think, well, some people think, oh, we're going to be up sitting on a cloud, playing a harp, hanging out with angels. Or they just think it's going to be like an earthly paradise and just everything's going to be wonderful."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4494.3,"end":4498.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Like a resort. A resort where everything sparkles."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4500.14,"end":4515.24,"speaker":"Fr Stephen De Young","text":"A never ending vacation. Right. And you're going to. But that's, that's not the picture. The picture is that we're going to be part of God's counsel and we're going to be administering and ruling and reigning over his creation."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4515.32,"end":4819.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. We have jobs to do, you know. So we had a caller in earlier and it looks like he came off the line, but we had a call from Gary and Gary asked quite outright, Gary from Texas, he asked outright, should we even celebrate Halloween? So I'm mentioning, I'm, I'm mentioning Gary's. Yeah, right, exactly. I'm mentioning Gary's call here. So I'm sorry, Gary, if you dropped off, I hope you're still listening. I'm mentioning Gary's call here because this is the point now where having set up all of that, I mean, I think it's really important, right Having set up all of that, now we're going to actually talk about this. Okay? So not only. Not only are human beings being invited into divine council to assist God in the. In blessing the earth, in. In serving as messengers and doing all these. These beautiful, positive things, but they are also being recruited, okay, recruited into an army. And I think. I mean, we should make a note of this. I think that we should do an episode just on the service of baptism. Right? We should just dedicate a whole episode to baptism. Yeah, yeah, yeah. If you look. But I'm just going to mention it here, close here briefly. Okay, so if you look at the service of baptism in the Orthodox Church, and I can't speak for other traditions, but if you look at the service of baptism in the Orthodox Church, as it's celebrated in the Byzantine rite, you know, it mentions demons and foul spirits and aerial phantoms over and over and dragons over and over again. And it's not only is there at the beginning an exorcism of these foul spirits from this person, an exorcism of these spirits from the water that they're about to be baptized in, but then there are also prayers specifically asking that they be assigned a guardian angel and specifically asking that they be equipped to fight against these spirits. Right. If you. If you ever go to an Orthodox baptismal service, you will hear what I'm talking about. This person is being recruited into an army and given his armor and weapons to fight against evil spirits to fight in this war that is going on. It's not a metaphor. Not a metaphor. And again, we're not talking about peaceful coexistence, but again, I should say we do peacefully coexist with our fellow human beings, but we do not peacefully coexist with demons. We give them everything we've got. And, you know, if you've been watching our Lord of Spirits podcast Facebook page over the last week, you'll have seen that we posted a couple of images of saints, you know, taking hammers. There's a famous one of Saint Marina or Margaret of Antioch hammering a demon in the head. And then there was another one of Saint Niketas the Goth also taking hold of a demon and giving him what. And that's because they're doing exactly what they were baptized to do. Right? This is our task as baptized Christians. Not only are demons exorcised from us, like, get out. This one belongs to Christ, but also you're being given weapons and armor to engage in this battle. It's not just a nice sort of initiation into church Membership. It's not just a nice thing that we do when, you know, with kids. Baptism is about recruitment into an army. Into an army. So this. This is what Halloween in the traditional Christian understanding is for. That's what it's for. Okay? Now, I know that there's a lot of things, and I said this at the beginning. There's a lot of things that people do that go by the name of Halloween. But from the orthodox Christian point of view, there is. And particularly this Feast of All Saints, There is a purpose for this feast, and it's not just to say all of these saints. Aren't they great? Isn't it so nice we have saints? You know, like, look at these really wonderfully moral people. No, no, no, no, no, no. This is a military parade, okay? That is what All Saints is. It's a military parade. And it's also, you know, lining up the troops to get them to go and do battle. All right, well, let's. Let's talk about this, Father Stephen. Now. Yeah, now we're, you know, and I hope you that all of you who followed us all the way to this, you'll understand why it took everything we just said in order to begin to say this. We can't just start out like, if someone tuned in saying, now are they going to tell me if I can go trick or treating? That's not the point of this at all. But welcome, now. Welcome to the Halloween episode. All right, take us further in Father Stephen."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4819.6,"end":4842.06,"speaker":"Fr Stephen De Young","text":"Yeah, well, what we've just been saying, we've just been talking about this battle that sort of happened with the death of the gods, that happened with the death and resurrection of Christ. But if you. If you've read any military history, and to all the dads out there, I know you have, you know that. That the decisive battle isn't the end of the war."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4842.46,"end":4842.86,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4843.18,"end":4890.19,"speaker":"Fr Stephen De Young","text":"Right. D Day was not the end of World War II. It was the beginning of the end of World War II. Right. And so in the same way, Christ's victory that he won, that is the decisive battle. There are still battles to be fought before this war fully comes to an end. And so the gospel, what the gospel is, what the word gospel frankly means, is the report of a military victory. And so what we proclaim when we go and we evangelize is where. Proclaiming the victory that Christ has won this decisive victory. And we're recruiting people for the final push."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4890.35,"end":4890.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4892.59,"end":4937.22,"speaker":"Fr Stephen De Young","text":"We're announcing to the people who have been liberated by Christ that they're now liberated and encouraging them to now take up arms against their former oppressors. And this is what happens. You were talking about baptism when you get to the very end of the Gospel of Matthew. This is the send off. At the end of the Gospel of Matthew, before Christ ascends into heaven is the Great Commission, where he says, all authority in heaven and on earth has been given to me. So Christ has taken it back from these spiritual powers who abused it. And he says, therefore, because that's true, go and make disciples of all nations. Now you can go out."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4937.7,"end":4938.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4938.02,"end":4939.86,"speaker":"Fr Stephen De Young","text":"To those. To those nations."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4939.86,"end":4960.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting thinking about that phrase, the Great Commission. I think we should think about that more in military terms. You're being commissioned as officers, as soldiers. That's what's happening. Yeah, yeah. Therefore, go out and baptize all nations. So, yeah. So, so related. Oh, go ahead, go ahead."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4961.06,"end":4965.24,"speaker":"Fr Stephen De Young","text":"Teach them all that I have commanded you. Give them their orders."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4965.4,"end":4988.28,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Train them. Yeah. So related to what you said about turning away from those false spirits and joining this army, we have Brett, who has been very patiently waiting on the line from Indiana, who called in almost at the beginning of the show, and he's been waiting the whole time. So, Brett, this is your opportunity. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4989.65,"end":4991.01,"speaker":"Anthony","text":"Hey, Fathers, how are you guys doing?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4991.57,"end":4994.93,"speaker":"Fr Andrew Stephen Damick","text":"Great. Great to hear from you. What's your question or your comment, Brett?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4995.65,"end":4998.13,"speaker":"Anthony","text":"So my question is, if somebody was."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":4998.13,"end":5002.01,"speaker":"Jacob","text":"A former neo pagan, participated in various."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5002.01,"end":5009.17,"speaker":"Anthony","text":"Pagan rituals, offered libations to pagan gods, how would they spiritually recover from that."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5009.17,"end":5012.53,"speaker":"Jacob","text":"And write themselves on a path of orthodox Christianity?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5013.65,"end":5037.8,"speaker":"Fr Andrew Stephen Damick","text":"That's a great question. Excellent question. Well, I would say, number one, be baptized. Number one, be baptized. Right. Because think about everything we just said that baptism is and does. Right. But there's more. I think that they can be done. So, Father Stephen, what would you add to that to repent and be baptized? What else?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5039.08,"end":5046.54,"speaker":"Fr Stephen De Young","text":"Right. Well, at the very beginning of the orthodox baptismal service, there's a change of allegiance."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5046.54,"end":5047.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5047.98,"end":5060.02,"speaker":"Fr Stephen De Young","text":"Right. Where you reject your former allegiance. And actually, at least symbolically, hopefully they don't do this literally if it's inside the church building, but spit on the."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5060.02,"end":5070.9,"speaker":"Fr Andrew Stephen Damick","text":"Devil or in my understanding, the more ancient ritual is simply an exhaling, a breathing out, which is an exorcistic act. Yeah, yeah, yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5074.1,"end":5156.41,"speaker":"Fr Stephen De Young","text":"From him, and then. And then pledging their allegiance to Christ. So you are. When a person who has been in this kind of slavery is then brought into Christ, they're set free from that to live a new and different life. And this is where St. Paul's metaphors are aimed that that person who was a slave before, that person who did whatever they did, that person is now dead. And a new person has come to life. Yeah, A new person who is characterized by all of these things we've been saying, who is a son of God, who is a holy one of God. All of these things are true of them and will become increasingly true of them as they follow Christ. So this is an absolute setting free. And I think someone who's been in that kind of background who then comes to Christ, I think they experience that very literally in the way that a lot of other people who may come into the church from some other kind of background or some other church background may not experience it quite so literally as liberation."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5156.65,"end":5233.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think one of the biggest things to understand is that there is the switching of loyalties and that Christian faith is Christian faithfulness. So if you're. It's really obvious if you're a pagan in the ancient world, you stop, stop going to the temple of Zeus or Athena or Ares and offering sacrifices and eating them. And now you go only to the temple of the one true God, where again, there is a sacrifice that is offered and you eat it. Right. But the same thing applies to a modern neo pagan. Stop worshiping. You stop worshiping those other gods. You stop doing that thing. Right. Now there might be feelings and all of that kind of thoughts and so forth that still have to be wrestled with. But the key thing to do is to the faithfulness to go and to worship Yahweh and to, you know, to do, to make prayers to him every day. You know, it is about this continually going back. Just like for instance, if you. If someone commits adultery, they have to turn away from that paramour and turn back to their spouse and only go towards the spouse. That's what's going on. And then doing that then gradually builds the love and the trust and the oneness. Right. Does that make sense, Brett?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5233.96,"end":5234.92,"speaker":"Anthony","text":"Yes, sir, it does."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5235.48,"end":5238.84,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. All right, well, let's go ahead."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5238.84,"end":5270.38,"speaker":"Fr Stephen De Young","text":"Father, one last little note, and this is particularly intense if you're talking to someone who's still in an environment where essentially ancient paganism still applies. If you're talking to someone from India or Southeast Asia or sub Saharan Africa, who's in that kind of situation and who is coming now to Christ, often they'll be afraid that the spirit they've been worshiping, the God they've been worshipping, is going to kill them if they do."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5270.78,"end":5271.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5271.5,"end":5291.22,"speaker":"Fr Stephen De Young","text":"This idea of a quid pro quo and Having made bargains and deals is very real experiential. And so that setting free from that, the deliverance from that and the salvation that comes in Christ and the protection that then comes from Christ against those powers is also very real for them."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5291.22,"end":5402.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. And maybe something to add is that, you know, while someone who is going from paganism or something like that into orthodox Christianity, that baptism is the obvious door for them to walk through. You know, it's possible we're talking sometimes maybe about Christians who fall into that and then come back from apostasy from Christ. And it depends kind of on what they did while they were away and where they were maybe before that. But still, there are ways to receive that person and exorcistic acts that can be done with them. Right, right. So I hope that helps. It's not an easy thing to do with thoughts. You know, you might still have thoughts that are connected to your former way of life, but the key is to fight against them and to be faithful to Christ. Right. Okay, so we're going to talk now about some of the specific ways that Christians saints do battle and what exactly that has to do with Halloween. But I have to say, Father Stephen, I was super intrigued by an example you gave that is in December rather than October, November. Because I thought this is a cool way of getting into this thing about Halloween in particular. And that's because. So, you know, in the Christian calendar, December 6th is the feast of St. Nicholas. You know, who's the beloved Santa Claus, you know, but actually an ancient Christian saint, a bishop in what is now Turkey, and one of the most popular saints in the world, probably the best known saint in the world, after the Virgin Mary, maybe. But there is this tradition amongst Germanic peoples in Northern Europe of something the night before. So what is that, Father Stephen?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5402.68,"end":5411.18,"speaker":"Fr Stephen De Young","text":"The eve of St. Nicholas? Well, I believe the way I broke it to you was I messaged you and said, hey, what do you know about Krampus Nacht?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5411.18,"end":5424.54,"speaker":"Fr Andrew Stephen Damick","text":"Right? Krampus Nacht. I know as soon as I saw that, I'm like, nothing, but the name is really bringing me in. Krempus Nacht, of course, is German for night or evening."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5424.78,"end":5462.72,"speaker":"Fr Stephen De Young","text":"Right, Right. So the night of Krampus, Krampus night. And this is the eve of St Nicholas Day, as it's celebrated in. Krampus is primarily Austria, Germany, the German lands. But there are sort of variations of this in the Netherlands, where my ancestors are from, and in other Germanic countries. But Krampus, who is now labeled as a demon, was a demon in the Other sense, before the coming of Christianity to the Germanic lands."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5462.72,"end":5466.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. He was a local God in a forest God, right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5466.99,"end":5487.79,"speaker":"Fr Stephen De Young","text":"Yes. He was a pagan forest spirit who was worshipped by the people there. And in current practice, KRAMPUS is at St. Nicholas Day that Eve. He is enslaved and overpowered by St Nicholas."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5487.95,"end":5491.47,"speaker":"Fr Andrew Stephen Damick","text":"Again, we're not talking peaceful coexistence here. Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5491.95,"end":5502.35,"speaker":"Fr Stephen De Young","text":"And St. Nicholas sort of overpowers him and enslaves him and takes control of him, but sort of allows him to afflict the wicked."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5502.91,"end":5503.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5503.27,"end":5512.71,"speaker":"Fr Stephen De Young","text":"The people who have been bad, especially the children who have been bad over the past year, are, in a lot of cases, it's being beaten with birch rods."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5512.71,"end":5514.43,"speaker":"Fr Andrew Stephen Damick","text":"I don't think birch rods are the."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5514.43,"end":5517.43,"speaker":"Fr Stephen De Young","text":"Worst things to be beaten with, but apparently they are in Germany."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5517.43,"end":5567.16,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, when we were talking about this. Of course, course. For fans of the Office, that comedy TV show from NBC, which takes place actually just north of where I live, not too far up in Scranton, there is a character on there named Dwight who introduces one Christmas, a figure named Bel. And if I'm not mistaken, Bel Schnickel is essentially a very similar kind of figure. Right. But there's. But what's interesting is that some of the, you know, we've got this naughty and nice idea with Santa Claus and Bel Schnickel has this kind of naughty and nice. Although the way that Dwight puts it is, have you been admirable or impish? Admirable or impish. But if you've been impish, he beats you with the. As you said, what is it? Birch rods."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5568.12,"end":5568.68,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5568.76,"end":5569.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5569.64,"end":5586.76,"speaker":"Fr Stephen De Young","text":"Well, the impish is actually very, very kind of tough because in all of these traditions, Krampus, or Black Peter, as he's called in the Netherlands, or Belchnigal, are assisted by these assistants who. Krampus. Assistants are imps."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5586.92,"end":5589.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5589.24,"end":5591.08,"speaker":"Fr Stephen De Young","text":"And sort of little Krampi."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5591.88,"end":5932.81,"speaker":"Fr Andrew Stephen Damick","text":"So what's happening with these customs? And sometimes people put on costumes and they dress up as Krampus and they get dragged along by a St Nicholas figure. Right. He's been enslaved. The point of this is it's ritual participation in the defeat of demonic beings, you know, so that we essentially can. Can do the same kind of thing connected with these Christian feast days. Right, right. And so. So having painted that picture, now we can understand where some of the customs surrounding Halloween come from. Now, again, people have a lot of opinions and you can find a gazillion websites out there telling you the truth about Halloween. But a lot of what's going on in Halloween is exactly this kind of mocking and defeat of death and of demonic beings. Right. That's part of what's happening. And even in the Orthodox Church, like, so the Orthodox Church, I sometimes will say Happy Halloween to that Saturday before All Saints, which is usually in June. And people kind of laugh nervously, like, why is Father Andrew saying Happy Halloween in June? But the reason is that. Right. You know, the Feast of All Saints in the Orthodox Church, for instance, it has this hymn. I'm just going to read a part of it. This is from Vespers of All Saints. So Vespers of All Saints would literally be Halloween in the Orthodox Church. It's the night before All Saints, the night before All Hallows. Okay? So it includes this hymn and it's talking, it's speaking to the saints in deeds ye have fulfilled the sayings of the Savior. For through you the gates of Hades open against the church have been closed and your shed blood dried up the libations of. Of idols. And having nourished the perfection of believers through your slaughter, ye dazzled the incorporeals, that's the angels standing before Christ wearing your crowns, wherefore intercede ye ceaselessly with him for our souls. In other words, it says that the saints ended the worship of idols, ended the worship of these gods, and that they obeyed the sayings of Christ and they even amazed the angels. Right? And they stand before Christ wearing their crowns and they intercede with Christ, just as the angels, the angelic beings do with us. So again, it's about this defeat by demonic powers, you know, the saints defeating the demonic powers. And we participate in that. Now we don't participate just by like dressing up and doing these things where you see St. Nicholas, you know, with. With Krampus being dragged after him in a chain. That's not the only thing. It's not only this sort of costumed act, Right. We also defeat the demons in a lot of other ways. We talked about, of course, baptism in January in the Orthodox Church. We have our homes, our churches and our homes and anywhere else that the priest is let in, blessed, the priest comes in with holy water and throws it around everywhere. This is an exorcistic act. It's an exorcistic act. And I just want to add here, I know I'm kind of on a roll here, but I just want to add that when we do these, these are all the same act. It's about driving out and defeating demons. Okay? When we do these things, it's because this is real. There is a war on. Now, if you understand that that's the case, then it would never be the case that as like, I was a pastor for 11 years and I would occasionally have people say, oh, you thank Father. You know, you know, let's just wait. Let's just do the house busting next year. You know, I just can't. It's just not. I can't get it clean or it's just not a convenient time or whatever, whatever, whatever. Like, so you're saying let's just go ahead and delay driving out the demons for a year. Like, are you really okay with that? Like, if you understand that that's what's happening, then you would never just make it a. Oh, well, let's, you know, let's. We could take care of that later. Right? But if you think about then also your prayers at home. No, today we're not going to just say, you know, well, tomorrow we will be, you know, we'll drive out demons from our home. You know, like, doesn't it just change the whole way you understand what the Christian life is about? I said, in one of our places online, I said, you know, every house is haunted. You know, change my mind. Well, you're not going to change my mind. Every house is haunted, every place is haunted. Because, you know, these evil forces are present in every place and it's our job as Christians to go and to drive them out. And that's why I was kind of so frustrated when we started talking about this episode when, like, there was one person even just the other day who was kind of demanding of me on Twitter, like, well, do you bless your parishioners to go trick or treating? Do you take your children out trick or treat? Like, that's what they wanted talk about. And I'm like, you know what? If that's what you think, that is really important, God bless you. But it's super not, you know, like, you know, really, Really. I mean, for the record, my kids don't go trick or treating, but that's not because I believe that. That collecting candy from your neighbors is participation in an occult ritual. It's because it's just kind of too gruesome out there on the streets on that night for me to want my kids out. I mean, I've small kids. That's. That's really what it comes down to for us. So I don't know. That's kind of a monologue, but yeah. Anyway."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5932.89,"end":5936.13,"speaker":"Fr Stephen De Young","text":"So. Well, to reorient us a little."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5936.13,"end":5936.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5937.69,"end":5939.49,"speaker":"Fr Stephen De Young","text":"Not that I disagree with anything you just said."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5939.49,"end":5940.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh, thank God."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5941.29,"end":5944.29,"speaker":"Fr Stephen De Young","text":"And being actually we're gonna go."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5944.29,"end":5947.61,"speaker":"Fr Andrew Stephen Damick","text":"We're gonna go to break here just a second. But, yeah, go ahead. Go ahead. Say what you got to say."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5948.81,"end":5968.18,"speaker":"Fr Stephen De Young","text":"So to reorient, in terms of how the early Christians saw what they were doing. Right, Right. Christ has accomplished D Day. Right. The victory has happened. Right. The war is effectively over, but that doesn't mean it's over."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5969.7,"end":5970.1,"speaker":"Fr Andrew Stephen Damick","text":"Now."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5970.1,"end":5987.05,"speaker":"Fr Stephen De Young","text":"He sends out his disciples, and they send out their disciples, and they send out their disciples into the world in order to route the enemy, to chase him down. Right. To push him out of every stronghold and every place that he has."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5987.29,"end":5987.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":5987.85,"end":6064.89,"speaker":"Fr Stephen De Young","text":"As that happens. As that happens, our fathers of the face of the faith come into Europe. They come into pagan Europe. And when they come to pagan Europe, they find these people who, just like the pagan Roman centuries before, are enslaved by these. These demonic spirits. And so they come and they proclaim the victory of Christ. They bring these people over. They free. And then the rap that you hear all over the place, the rap that you hear all over the place is that, well, the Christians were basically selling Amway. They're basically recruiting. It's not this spiritual war warfare, but they're just recruiting. And so they decided it would be easier for them to get pagan recruits if they let them keep. Right. And they'll even try to attribute this to the letter that St. Gregory the Theologist, St. Gregory the Great, the Bishop of Rome, sent to St. Augustine, the one in England, not the one in hippo. Like, oh, well, this will just make it easier for them. Yeah, that's a complete misread of what happened and of that letter."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6064.89,"end":6065.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6065.21,"end":6112.94,"speaker":"Fr Stephen De Young","text":"Here's what actually happened. That first generation of pagans experienced, just like we've been saying, being set free by Christ, having their lives transformed and being set free and the defeat of those demonic powers who had enslaved them. And so. And so the Church, in her wisdom, says future generations need to celebrate this liberation. They need to celebrate and ritually participate themselves in the defeat of those powers that enslaved them in their freedom from that bondage and that slavery. And it is, in a way, just like the Jewish Passover."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6113.1,"end":6113.66,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6114,"end":6168.72,"speaker":"Fr Stephen De Young","text":"In which Yahweh judges the gods of Egypt. That's what he says he's about to do. Judges the gods of Egypt, frees his people. That generation experienced it literally. Future generations experience, by ritual participation in eating, the Passover. And so these holidays, like Krampus Nacht, like All Hallows Eve, all of these are essentially little European passovers, where, if properly understood, Right. If you don't forget about the all saints part and just go trick or treating for Halloween if you don't forget who St Nicholas was and just have a really metal winter celebration in your Krampus outfit with the chains. Right. If you don't do that, you could experience that freedom that your ancestors experience."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6169.12,"end":6173.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And the saints came and as I."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6173.68,"end":6175.52,"speaker":"Fr Stephen De Young","text":"Say, to these spirits and set them free."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6175.6,"end":6195.23,"speaker":"Fr Andrew Stephen Damick","text":"And the mistake that some people make is they, they essentially go join the other side again. Like that's what like Ouija boards and seances and that kind of thing are about. They're, they're taking it, they're reversing it for themselves. They're going back to Egypt and being enslaved by those gods again."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6196.18,"end":6196.38,"speaker":"Linda","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6196.38,"end":6201.54,"speaker":"Fr Stephen De Young","text":"And that's exactly what St. Paul said as we read in Galatians. Why do you want to go back now into slavery?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6201.62,"end":6214.18,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Exactly. All right. Well, we are going to go now for our final break and then when we come back, we are going to take your questions and then we are going to wrap up. So we'll see you back in just a minute."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6214.5,"end":6232.27,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls. On the second half, the Lord of Spirits, give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6237.15,"end":6290.21,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday night call show, Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, prayer, fasting and almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6293.41,"end":6309.49,"speaker":"Announcer","text":"We're back now with the Lord of Spirits, the Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6311.89,"end":6372.91,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. Now for the final segment of our special Mega Mondo bonus Halloween episode. And this is fourth House. Yeah. The fourth half of this show Exactly. You know, the initial conception of this show, it was going to, you know, of this show where we first started, was that the idea was to be about an hour long. We've never gone just an hour, but that's okay. We know you love it. And I should also say, you know, I've heard sometimes people say, like, why do you guys laugh when you're talking about demons and stuff? It's not because we think they're a joke, like, that they don't exist or they don't matter. It's really. I mean, if I could just put it this way, it's kind of the joy of battle, honestly. Right. It really kind of is. So we are very serious about all of this. Okay, so. All right, well, we've got a call from Anthony, who is calling from West Virginia. So, Anthony, can you hear me? Anthony, are you there? All right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6374.67,"end":6375.55,"speaker":"Anthony","text":"Father, bless."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6376.03,"end":6380.51,"speaker":"Fr Andrew Stephen Damick","text":"God bless you. Welcome to Lord of Spirits. I'm glad you finally got through after waiting in line for over an hour."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6381.66,"end":6382.26,"speaker":"Anthony","text":"That's okay."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6382.26,"end":6382.7,"speaker":"Fr Stephen De Young","text":"It was."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6383.18,"end":6383.74,"speaker":"Linda","text":"It was."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6383.98,"end":6398.22,"speaker":"Anthony","text":"I was just listening to the podcast and so there wasn't any time wasted, thank God. So sorry. I'm a little out of breath. I had to take the dog out and I was hoping I wouldn't miss the call."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6399.74,"end":6400.54,"speaker":"Fr Andrew Stephen Damick","text":"You made it?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6401.5,"end":6406.38,"speaker":"Anthony","text":"I did, just barely. I, you know, I got back in just as you were saying my name, actually."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6406.99,"end":6409.87,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Okay, well, what's your question or comment there, Anthony?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6410.67,"end":6467.95,"speaker":"Anthony","text":"So my question, sorry, it's not very Halloween related, but in the Book of Tobit, toward the beginning there, you meet Sarah and she has this demon that. It's been a little while since I read the book, so I can't remember exactly this phrase, but I feel like it said something like, the demon is in love with her, but he's definitely attached himself to her in some way. And, you know, she's, like, tormented by this demon for quite a while until Tobias comes and, you know, does the whole incense thing that the Saint Raphael told him to do with the fish and everything. So the question is, you know, like, what is that relationship that the demon thinks? Like, what is he getting out of that relationship with being attached to Sarah? And how often does that sort of thing happen? Is that a common thing or."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6469.63,"end":6475.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, does that make sense? All right, well, Father Stephen, I'm going to let you take that one because I think you probably know this a lot better than I do."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6476.19,"end":6484.43,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. So, yeah. And in fact. In fact, that demon in the Book of Tobit is, like, murdering all of her suitors."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6485.47,"end":6485.87,"speaker":"Jacob","text":"Right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6486.75,"end":6502.55,"speaker":"Fr Stephen De Young","text":"In the book of Tobit. Yeah. So the reality is that this kind of paganism, this kind of demonology. Right. Demon worship is a relationship, not a religion, right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6503.91,"end":6504.47,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6504.71,"end":6557.33,"speaker":"Fr Stephen De Young","text":"In a lot of ways it's that quid pro, what we've been calling a quid pro quo, these agreements entered into. That's a real thing. The bondage and slavery we're talking about is a real personal thing. Right. It's not. Just sometimes, I think when we say that people are taking bondage metaphorically, like we're talking about bad ideas or something, you know, that are making you depressed or not achieve your full potential, that's not what we're talking about. We're talking about literal slavery and oppression. And so usually when you have that kind of demonic activity and it's not always spelled out in the Bible like we don't find out how Legion got into that man, what exactly he did. But it's not that people, you know, very pious people who are seeking to follow Christ are walking down the street one day and suddenly they get demon possessed."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6557.33,"end":6557.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6557.89,"end":6621.21,"speaker":"Fr Stephen De Young","text":"Right. This is something that takes place over time through a series of interactions and trade offs and relationships and then point people really slaved and bonded and attached to this kind of spirit. And it's not a pleasant thing. Right. It may seem that way at the beginning because otherwise no one would do it, but once you're down that road, it is oppressive and you are tormented, as she was in Tobit, and you long to be free of it. And this is the experience I was talking about with some people you'll find in India or in, in Southeast Asia, in Sub Saharan Africa, where they think that if they try to break this connection now, the demon will kill them, the spirit will kill them, or the God they've been worshipping will murder them or their family or something. And so this is power that a person has given to that spirit."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6621.37,"end":6622.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. Important point."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6622.85,"end":6649.45,"speaker":"Fr Stephen De Young","text":"Tacitly. Yeah. And then. And then the thrust, of course, of Tobit is that Tobias comes and Saint Raphael comes and set her free, set her free from it. And I won't go further than that in terms of connections to baptism and other things that take place there and the cleansing of incense. But I've got Bible studies on Tobit somewhere that you can listen to."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6649.45,"end":6652.49,"speaker":"Fr Andrew Stephen Damick","text":"There you go. So does that help, Anthony?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6653.88,"end":6669.08,"speaker":"Anthony","text":"It does, but if I can. So to clarify the story and Tobit, we kind of only are getting the last half of that story. There must have been something before there for her to invite that sort of thing. Is what you're saying."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6669.16,"end":6669.56,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6669.88,"end":6670.68,"speaker":"Anthony","text":"Am I correct?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6671.72,"end":6673,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6673.32,"end":6685.54,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. All right. Well, thank you very much for that, Anthony. We're going to take one more call. So, Linda, you are our final caller. So, Linda from Georgia, can you hear me?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6686.34,"end":6687.78,"speaker":"Linda","text":"Yes, I can hear you, Father."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6688.18,"end":6691.94,"speaker":"Fr Andrew Stephen Damick","text":"All right, Linda, what is your question or comment? Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6692.74,"end":6769.64,"speaker":"Linda","text":"Well, thank you for taking my call. I'm a history buff and have listened to you both before. I was looking at something the other night, a history magazine that I subscribe to on medieval history, and it actually mentioned, and it was the day of the feast day of Saint Demetrius, the great martyr, and it was actually talking about Demetrius and how he is celebrated, at least in some countries. It's with the change of the seasons around this time. And I guess in ancient times, it had to do with the wrapping up of the military campaigns for. For the summer and fall. Winter was coming. And then I started thinking about the name Demetrius and I thought, wait, Demeter, the Greek goddess, and the changing of seasons with her, the whole story about her daughter Persephone being abducted. Winter, spring coming. And so I started thinking about, you know, if you look at some of our saints, if you look, scratch just below the surface, there's a connection, dare I say, with paganism. I'm trying not to be. I mean."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6772.6,"end":6872.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think. I think I know what you're saying, Linda. And I would say, and I'm sure father will have a bunch of things to add to this, but I would say, I would say that, you know, just like Krampus knocked or Halloween or any of these other things, this is not a connection in the sense of like, well, pagans are doing this thing and we want to try to recruit them. And so let's give them. Instead of, instead of Demeter, we're going to give them Saint Demetrius. Yeah, we're going to invent a saint who, wow, has a name that's very similar and will kind of, you know, do some of the same kind of things, but they'll be Christian versions. That's not what's happening. Happening. There is a deliberate defeat of those spiritual beings by the saints. So Saint Demetrius now is clearly the person whom God has assigned to the city of Thessaloniki in Greece as its protector. And on his feast day, I mean, he's a real person. Like, he's not a story. They take out his actual relics, his actual body, which I visited and venerated actually a couple of years ago, they take out his body and they carry it in procession around Thessaloniki as an act of exorcism and protection. Right. So again, this is not just sort of adapting in something pagan. This is about stomping on something pagan. Right. It's very deliberate. And, you know, Demetrius is a real martyr who was put to death in the early years of the church and now is the spiritual protector of the city of Thessaloniki, which is why they love him there so much. So, I don't know. Father Stephen, do you want to add anything to that?"}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6873.07,"end":6885.15,"speaker":"Fr Stephen De Young","text":"Well, yeah, with names, we have to sort of always take into account the fact that a lot of these early Christian saints and martyrs were converts to Christianity. And so they would have been given pagan names by their parents."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6885.23,"end":6886.11,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6886.59,"end":6957.04,"speaker":"Fr Stephen De Young","text":"I mean, Saint Dionysius the Areopagite would be exhibit A. Who's named after the God Dionysus. Right. But we have saints with pretty much every pagan God name that there is almost. There's even a saint. There's even a saint Plato, who was named after the philosopher but then became a Christian and became a saint. So we carry too much into the names. Plus, I mean, if I want to really nerd out, the mysteries of Demeter were centered at Corinth rather than Thessaloniki. But Thessaloniki had a spirit that was worshipped under the name Aphrodite that dominated it. And through his victorious martyrdom, Saint Demetrius defeated her and booted her out and took her place as the person in Christ's administration who is sharing in his rule and reign over the city of Thessaloniki and became its patron. So, and this is a really good segue into what we're going to talk about on the next show in two weeks. So you're tracking with us. You're tracking with us there in Georgia."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6958.96,"end":6962.32,"speaker":"Fr Andrew Stephen Damick","text":"And it's not just a storm that tracked from Louisiana through Georgia."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6964.4,"end":6985.06,"speaker":"Linda","text":"Well, that was just a connection that I kind of saw and they talked about in that article, Demetrius even riding a horse, and that's riding into the other worldly, I guess, aspects of things. And then I thought about Demetrius Saturday with the commemoration of the dead and all of this stuff around this time at Halloween. So thank you."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":6985.7,"end":6998.74,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. You're welcome. Well, thank you very much, everyone for calling. We just want to take a minute to give some summary remarks and I'm going to ask my co host, Father Stephen, to go first."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7000.56,"end":7113.56,"speaker":"Fr Stephen De Young","text":"Yeah. I think the core of what we've wanted to get across and talk about tonight is that contrary to what sometimes our Protestant friends will say about the traditional Christian view of the saints, where they'll say, oh, well, this is a pastiche for paganism, they're just sort of replacing the pagan gods in popular worship. That it's just sort of this shift of ideas, you know, and that the veneration of the saints must just be worshipped the same way that the pagan gods were worshiped over. Against that, we're saying that the replacement of the pagan gods by the saints is not an intellectual flip or some kind of change of doctrine, but is a historical event that happened in history just as surely as any other historical event. The battles in World War II that I mentioned, it is just as real as those that Saint Demetrius replaced. The spirit that was worshipped as Aphrodite. And just as the angelic beings to whom God assigned governance over his creation as sort of vice regents were not to be worshipped, but they were to serve and to guide and to shepherd people to the true and living God, the Holy Trinity. In the same way, the saints now, those righteous men and women who have gone before us, who have been adopted as sons of God, who have become holy ones of God and part of God's divine council, are now governing the earth, and they are not worshiped, but they assist God in bringing us to him and to the true worship of the Most High God, the Holy Trinity."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7116.12,"end":7351.81,"speaker":"Fr Andrew Stephen Damick","text":"Well, for my closing comment, I wanted to, you know, expand a little bit earlier. Expand a little bit on something I said earlier. You know, I talked about having the priest come to your home to bless it in January, which we in the Orthodox Church do, connection with the Feast of Theophany, the baptism of Christ. You know, in Theophany, of course, you see in many Theophany icons, Christ stepping on dragons in the water, or sometimes water gods, or sometimes both. You know, this is his defeat of those spiritual beings, right? And we participate in that by being baptized, but by also taking that holy water and spreading it throughout the creation, including in our homes, everywhere that we can, outdoors, indoors, wherever. Because, you know, the thing that Father Stephen was just describing, the saints defeating these demonic powers, that's what we're supposed to be doing ourselves. That is our job. That is our commission, right? It's not this. Christianity is not a spectator sport, right? We are here to trample upon the false powers, you know, the demons, the fallen angels, right? And if you understand that that's what the Christian life is, right? When you say your prayers in the morning and at night, when you say prayers over the things that you eat, when you have the priest come to your home to bless it, when you are baptized and your children are baptized, when you come to church and receive the very body and blood of Christ into yourself when you turn away from the sins that are participation in the works of the evil one. When you do any of those things, you are driving out the influence of these foul spirits and they are as afraid of it as they are the mightiest of saints. Because you are not invoking your own power. It is not your power. You are invoking the power of Christ and his cross. And when they see that sign of the cross, they flee. You know, some people ask, what do you do if you encounter a demon? What do you do if you encounter the feeling of an evil presence? What do you do? Right? There's a lot of things you can do, all the things I just mentioned, but in the moment especially, you make the sign of the cross and you give praise and worship to Christ because that is the worship that they have attempted to steal for themselves. And they cannot stand to be in the presence of the worship of the one who is worthy of worship. There is only one worthy of worship, and that is Jesus Christ, our one and true God. And so my prayer is that whatever it is that you, in your wisdom, choose to do related to this American celebration of Halloween, but more importantly, all of the other things that that we do as Christians, that you do it in an exorcistic way, that you are there to do battle with these real demons, understanding that that is the Christian life, you have been recruited into an army and so get out there and fight. You're not alone. You're not alone. You have the power of Christ if you are faithful to him and you invoke him continuously. So thank you so much everybody for joining us for this special episode of the Lord of Spirits. That is our show for today. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything, but we can't respond to everything because we get a whole lot. And we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7353.33,"end":7368.21,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Don't forget to like our Lord of Spirits Podcast Facebook page. Join our Facebook group and while you're at it, leave a recommendation and invite your friends."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7368.21,"end":7376.46,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcast, then that raises the the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7377.66,"end":7385.02,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7385.34,"end":7389.5,"speaker":"Fr Andrew Stephen Damick","text":"Thank you and may God bless you and the angels and saints stand beside you."}
{"episode_id":"LOS - #006 - 2020-10-29 - The Real Demons of Hallowe'en - Special Episode","start":7396.7,"end":7434,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
