{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":0.24,"end":3.68,"speaker":"Fr Stephen De Young","text":"He will be a staff for the righteous with which for them to stand."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3.84,"end":8.04,"speaker":"Fr Andrew Stephen Damick","text":"And not to fall. And he will be the light of the nations and the hope of those."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8.04,"end":12.76,"speaker":"Fr Stephen De Young","text":"Whose hearts are troubled. All who dwell on the earth will fall down and worship him."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":12.76,"end":15.04,"speaker":"Fr Andrew Stephen Damick","text":"And they will praise and bless and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":15.04,"end":64.91,"speaker":"Fr Stephen De Young","text":"Celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":66.75,"end":117.52,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers and dragon slayers. I know it was a little delayed. I know there's usually no woo, like, right? Yeah. Yeah. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me from Ligonier, Pennsylvania. And I'm Father Andrew Steve McDamac, also in Ligonier, Pennsylvania. And that's because it's the Lord of Spirits conference, everybody. And for all of those very you who grew up in the 1980s, Lord of Spirits is taped before a live studio audience."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":119.6,"end":124.52,"speaker":"Fr Stephen De Young","text":"Although we are kind of giving a false impression here about how this usually works."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":124.52,"end":125.84,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":125.92,"end":149.36,"speaker":"Fr Stephen De Young","text":"Like you're saying I sit here at the table. Right. It's more like, have you seen Eddie Murphy's Party all the Time video? Usually I'm in the church office. I have like the headset with the thing turned around. So I just have like the one earpiece so I could kind of vibe with it. And like Matushkatruti is doing the Rick James thing."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":149.92,"end":150.64,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":150.88,"end":154.88,"speaker":"Fr Stephen De Young","text":"In the video. So this is not really how it usually is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":154.88,"end":157.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I usually don't have to look at him."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":158,"end":158.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":162,"end":185.7,"speaker":"Fr Andrew Stephen Damick","text":"So Matuska Trudy, who is over there? Everybody, next to some dude named Bobby. She will not be taking your calls tonight. It's just you and us. But we do have bouncers."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":185.7,"end":186.5,"speaker":"Fr Stephen De Young","text":"Pass her a note."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":186.5,"end":270.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go. You can pass her a note. We do have bouncers available if need be. Famed WWE grappler Richard Rohan is available to strangle those who ask the wrong questions. Comments posing as to it. Yes. So as sometimes happens, I have to read an ad. Lord of Spirits podcast is brought to you by our listeners with help from Leviathan Political Consultants. Are you a God king? Ready to level up to God Emperor? Having trouble stirring the satraps? Trying to be nimrod, but keep getting it, nimrong. Ever see beasts rising out of the sea and say to your wives, that should be me. If that's you, you need Leviathan Political Consultants. Whether you're just looking to expand your regional idolatrous footprint or need to subsume all cultures into one world, kleptocracy. Yeah. Lpc, LLC can make your dreams of imperium come true. With our patented vassal squeeze and peasant burnination techni techniques, you'll have even the worthless gods of the other nations ready to open your nostrils."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":274.46,"end":276.22,"speaker":"Fr Stephen De Young","text":"And feed, clothe and bathe you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":278.22,"end":289.1,"speaker":"Fr Andrew Stephen Damick","text":"Axe now and get a free Ziggy the Ziggurat Bobblehead scepter. Visit leviathanpoliticalconsultants.com today. Volcanic gas sniffing oracles are standing by."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":294.18,"end":296.58,"speaker":"Fr Stephen De Young","text":"So they made us into idols."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":296.58,"end":297.94,"speaker":"Fr Andrew Stephen Damick","text":"We got a big donation for that one."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":297.94,"end":298.34,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":303.22,"end":340.56,"speaker":"Fr Andrew Stephen Damick","text":"So. Right. This would normally be our Halloween episode. It's that time. And also, I don't know if any of our ladies were planning on announcing this, but. But I was informed by a listener just this week that the National Park Service. I'm not making this up. The National Park Service has declared October 24th through 31st to be international Bat Week. Not making that up. You can go to batweek.org on your phones and you can see that there for yourself."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":340.56,"end":342.36,"speaker":"Fr Stephen De Young","text":"They won't tell you what it's like to be one, though."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":344.12,"end":374.94,"speaker":"Fr Andrew Stephen Damick","text":"I know you can't do that. Yeah. So. But because it is. This is essentially our Halloween episode. But mostly we're going to be dedicating this to what you have to say because this is our Halloween episode. We thought that each of us would give you a little something at the beginning of the first and second halves. There will be three halves, God willing. And we're going to take a couple of real breaks in between, you know, where you can get up for a few minutes and, you know, use the restroom and so forth."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":374.94,"end":377.02,"speaker":"Fr Stephen De Young","text":"Do various non yoga stretching exercises."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":377.02,"end":379.3,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly, exactly."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":379.3,"end":379.66,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":380.86,"end":389.78,"speaker":"Fr Andrew Stephen Damick","text":"So I like how that laugh kind of had an extension to it. That's good. Levels as people are gradually getting the joke layers."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":389.78,"end":390.54,"speaker":"Fr Stephen De Young","text":"Like an ogre."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":390.78,"end":397.2,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So. So for the first half, the Reverend doctor Oger will be."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":397.44,"end":398.4,"speaker":"Fr Stephen De Young","text":"Very Reverend Doctor."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":398.56,"end":406.4,"speaker":"Fr Andrew Stephen Damick","text":"Excuse me. The Very Reverend Doctor Oker will be providing a little bit of Content for us this evening. So, Father Stephen. Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":406.4,"end":427.81,"speaker":"Fr Stephen De Young","text":"So my bon mote, which would be good death for this evening. I want to talk about exorcism. Yay. So not primarily the Exorcist movies. I haven't seen the new one yet. This became part of a conversation at dinner."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":427.81,"end":430.89,"speaker":"Fr Andrew Stephen Damick","text":"I haven't seen any of them. I know. That's a big shock that my Baptist stuff."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":430.97,"end":433.01,"speaker":"Fr Stephen De Young","text":"One and three are good. Just for the record."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":433.01,"end":433.69,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":433.69,"end":446.57,"speaker":"Fr Stephen De Young","text":"Three star George C. Scott, who both starred in the only good Exorcist sequel and gave a chilling performance in another movie where he explained the five points of Calvinism."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":447.21,"end":448.01,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":448.17,"end":450.89,"speaker":"Fr Stephen De Young","text":"You can look it up on YouTube. I'm not kidding. And General Patton."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":450.97,"end":452.81,"speaker":"Fr Andrew Stephen Damick","text":"General Patton. He played Patton."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":455.11,"end":462.91,"speaker":"Fr Stephen De Young","text":"But so exorcism, We've talked a little bit about possession on the show at."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":462.91,"end":465.83,"speaker":"Fr Andrew Stephen Damick","text":"Various points, which is 9/10 of the law."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":466.31,"end":521.12,"speaker":"Fr Stephen De Young","text":"Yes. So normally you can only hear my sigh. You can't see expression of sadness and disappointment. So we've talked about that. And we've Talked about Psalm 91 in the Hebrew, 90 in the Greek as having been used as an exorcism psalm. In a minute here, I'm going to read at least what we still have of the other Qumran exorcism psalms and make a few points about them. But exorcism is a phenomenon. Sort of appears. If you're reading a typical. Your typical American Bible."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":521.6,"end":522,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":522.24,"end":781.17,"speaker":"Fr Stephen De Young","text":"Just sort of appears in the New Testament. There aren't really incidents of exorcism in the Hebrew Bible. There are instances of possession. Right. You've got Saul being troubled by an unclean spirit. You've got that kind of thing. But you don't have people exercising demons, per se. Now if you go to the Christian Old Testament and we get the Book of Tobit in there, we've got something at least, Right. And we're gonna see that actually ties into some of these exorcism psalms from Qumran, too, but nothing in the Hebrew Bible proper. And then you get to the New Testament, you get to the Gospels, and all of a sudden Christ casting demons out of people is this huge focus that this incredible amount of attention is paid to. And there's some context missing there. And let me suggest that a big part of why this becomes a phenomenon in that period is the Greeks. We got any Greeks here tonight? Sorry in advance. As we've talked about before on the show, when we talk about possession and that kind of thing, demonic possession really was an institution in pagan Greek culture. In a way that it wasn't as fully embedded an institution in a lot of other and preceding ancient Near Eastern cultures. So there were oracular phenomenon. Right. People who would be possessed by a spirit, give some kind of prophecies, some kind of wisdom that is coming from that spirit. But this becomes not just the oracle at Delphi, but a number of local oracles. This becomes a major part of Greek religious life. Right. And at the same time, we've also read in past episodes some of those cool quotes from Socrates talking about the demon he has who whispers wisdom to his soul and all that creepy stuff. And so this was just firmly embedded in culture in a way that it wasn't until the Seleucids come to dominate Syria, Palestine. Right. The whole area. And so now the situation arises where demonic possession is going to be a more common phenomenon in the Levant. There are going to be pagan temples, Greek temples being built in that area, explicitly Greek ones, not just pagan in general. Right. And so these practices become much more prominent. And we see the rise of psalms being used as exorcism prayers and exorcisms happening because of it, because of that overlap. So it's the Greek's fault. Pagan Greeks, yes, Pagan Greeks. Pagan Greeks. Pagan Greeks. Although I. Every time I hear about the spirit of Hellenism, I wonder what exact spirit that is. Anyway, shots fired, just saying is all. Just narrow it down for me a little, guys. So we mentioned at the time in the episode when we kind of went through Psalm 91 or Psalm 90 in detail, which is, if you're orthodox, you may know, is the psalm that's read in our funeral service as well. We at least mentioned that it was part of a group of exorcism psalms that were found at Qumran. And what's interesting about that is that that Psalm, Psalm 91 or Psalm 90 is the only one that's a canonical psalm. The other psalms that are in this sort of exorcism psalm collection are extra biblical. So it's been kind of pulled out for this use. And so I'm not going to go back through that again because it's in a past episode. I don't know where I can't keep track of these things."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":781.17,"end":782.49,"speaker":"Fr Andrew Stephen Damick","text":"He doesn't listen to the podcast, I."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":782.49,"end":810.39,"speaker":"Fr Stephen De Young","text":"Don'T listen to the podcast. I already know all this stuff any. So, But I am going to talk about the other three as much as we can. So here's the reality of ancient texts, right? Ancient text this old, especially as the name Dead Sea Scrolls implies, these are Scrolls, meaning they're rolled up."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":811.51,"end":811.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":811.83,"end":880.04,"speaker":"Fr Stephen De Young","text":"And so when you have a text that's rolled up like this, and it's very ancient, it starts to fray at the end, Right. And it's the outer layer of the wrapped scroll starts to deteriorate first, break apart first, be damaged first. Right. And so the copy of Psalm 91 or 90 that's in this collection was the last of the four. So it is pretty much perfectly preserved and matches all the other Hebrew texts we have of that psalm. So doesn't help us a ton in terms of textual stuff, while the first Psalm is in little bits and pieces because it's what was on the outside right of the scroll. So I'm going to read now what we have left of the first one. It gets better after this, but here's what we have left of the first one. And the one who weeps for him, the curse by Yahweh, dragon, the earth exercising to this, to the demon he will dwell. So there's a lot to say there."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":882.36,"end":883.84,"speaker":"Fr Andrew Stephen Damick","text":"I feel like he left some bits out."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":883.84,"end":907.97,"speaker":"Fr Stephen De Young","text":"Yeah, you could do Mad Libs, right? Put an adjective in one of the holes and put the word called lacunae in the text. So, yeah, we can't do a lot with that. I mean, there's enough there. You can kind of get the vibe there's exorcism stuff there, dragons being slain or stomped on or something. Right. The second one, we have a little more."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":907.97,"end":908.33,"speaker":"Fr Andrew Stephen Damick","text":"There's."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":908.33,"end":1147.03,"speaker":"Fr Stephen De Young","text":"There's still a fair number of holes, but we've got a lot more chunks. And this one, the second one, we don't know who the first one was attributed to because we don't even. We don't have the beginning. Right. But the second one is attributed to Solomon in particular, and it begins, a psalm of Solomon. He will invoke the spirits and the demons. These are the demons and the Prince of Enmity, Israel, the abyss, the great, his people healing, leans upon your name and calls. Okay, now I know that sounded not much better than the first one, but as we go, keep in mind we're unwinding the scroll, so it gets better as we go. He says to Israel, hold fast to Yahweh, who made the heavens and the earth and all that is in them, who separated light from darkness, the depths, the earth and blank, the earth probably above the earth. Who made these signs and wonders on the earth, Yahweh. It is he who made these through his power, who summons all his angels and all the holy offspring to stand before him, all the Heavens and all the earth, who committed sin against all humanity and all evil against all people. So there's the offspring. They're sort of sons of God language in there. So the idea here is that God is calling all of these spirits, particularly the rebellious ones, to issue some kind of judgment. But they know his wonderful, which they do not. If they do not desist out of fear of Yahweh from killing the soul of them, they will fear that great something. One of you puts to flight a thousand, which is a quote, servants of Yahweh, great and great is the heavens. May Yahweh smite you with a mighty blow in order to destroy you. So here we get the move into the actual exorcism of the Spirit itself, right? So there's this first move where the Spirit is kind of invoked, and then there's this call on God to smash it, to judge it. And in the fierce wrath may he send against you a powerful angel to carry out his entire command, who will show no mercy to you against all those who will send you down into the great abyss and to Deepashiol. And there you shall lie in darkness no longer on the earth forever by the curse of Abaddon. Right, Destruction, the destroyer. We've talked about that. Talked about that in the eschatology series. The fierce anger of Yahweh in darkness for all affliction is your gift. And those possessed by demons, those crushed by someone, Raphael has healed them. So you get at the end this invocation of the archangel Raphael, who, Remember, we mentioned Tobit or Tobias a minute ago. So Raphael seems to have had this broader connection to exorcism and to dealing with demons beyond just the book of Tobit. And so then the third exorcism psalm, which is the most complete of the non canonical ones, this one is identified as a Psalm of David. Psalm 91 or 90 is also a psalm of David, and it's labeled a Psalm of David against demons. An incantation of the name of Yahweh to be invoked at any time to the heavens. For he will come at you at night, and you will say to him, who are you? Withdraw from humanity and from the offspring of the holy ones. For your appearance is one of vanity. And your horns are horns of illusion."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1147.03,"end":1147.31,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1147.31,"end":1278.94,"speaker":"Fr Stephen De Young","text":"Remember, horns are a symbol of power. You are darkness, not light, wickedness, not righteousness. The commander of his army, Yahweh, will bring you down into Deepeshield, the two bronze gates through which no light can enter, and the sun will not shine for you. That Rises upon the righteous. The bronze gates there. Remember, we've talked about that. And then you will say the righteous to come for a demon to harm him of truth from. Because he has righteousness. And it gets broken off. But so a couple of things we could hopefully saw along the way, right? These are invocations, not only of God, but also of angelic beings to come and make war against these demonic spirits. And this particular mode of spiritual warfare and exorcism is associated with the Davidic line of kings, with David and Solomon. So when we get to the Gospels, specifically the synoptic Gospels, because there are no exorcisms in St. John's gospel, they're all in the synoptic Gospels. When we get to the synoptic Gospels, and they're going to argue Jesus is the Messiah, right? Jesus is the son of David. His ability to cast out demons is an important criteria there to identify him with this line of kings. But more than that, notice when Christ casts out demons, he doesn't invoke anybody else. And when the apostles later cast out demons, they invoke Christ, not anyone or anything else, including the seven sons of Sceva who try to invoke Christ and get whooped like Roland will if he ever faces me in a steel cage. So that's my."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1279.74,"end":1280.3,"speaker":"Fr Andrew Stephen Damick","text":"You're done."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1280.38,"end":1283.98,"speaker":"Fr Stephen De Young","text":"Fun times with exorcism for this evening. All right, all right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1283.98,"end":1340.38,"speaker":"Fr Andrew Stephen Damick","text":"Well, on that cheery note, so now we are ready to take your not calls. We're actually ready to hear your voice. So if anyone is interested in. There's no hand raising. I know those of you listening to the recording right now, they're like, what happened? Yeah, so in the middle. Yeah, exactly in the middle. In the middle there are two mics. And it's actually important someone could actually adjust those so they're right next to each other. Because one of those mics is so everyone in this room can hear you, and the other mic is so that you get recorded for the episode. So if you would like to ask a question during this half of the Lord of Spirits podcast, you need to go ahead and line up behind that mic, and we're going to take your questions one right after the other. And then when I get tired of hearing you, we're going to have a break, but the break will be exactly 10 minutes, so please be prompt."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1345.09,"end":1348.85,"speaker":"Fr Stephen De Young","text":"That recording microphone does mean anything you say can and will be used against you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1348.93,"end":1352.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. So. So thank you, Montesqua. Trudy."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1353.49,"end":1355.13,"speaker":"Fr Stephen De Young","text":"See, she is taking your questions."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1355.13,"end":1363.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right. It's true, that's true. So when you stepped up to the mic, please give us at least your first name and where you're from. Hi, my name is Mark and I'm."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1363.25,"end":1366.77,"speaker":"Fr Stephen De Young","text":"From New Hampshire and huge fan of the show."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1367.26,"end":1380.82,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for doing it. So my question has to do with one of Father Steven's sort of famous, like, I'll lay out something super loaded and just not elaborate on it. What do you do?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1380.82,"end":1385.34,"speaker":"Fr Stephen De Young","text":"That may have happened once or twice. The David lynch approach. Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1387.5,"end":1430.94,"speaker":"Fr Andrew Stephen Damick","text":"So I remember in one of the. I don't remember one episode in particular where you're talking about how Greek was reading or how the Torah was read in Greek in the synagogue during the time of Christ. And then he went on to say something, but Aramaic was not. But then you made the point. This was sort of your thing. Like, I'll leave this here was. But so in the Gospels, when Christ says he's on the cross, says Eli, eli lamath habakthanai. My God, my God, you've forsaken me. Right, you said that was in Aramaic, right? Right. And you just sort of. You said you just sort of left it there as. Like that's a big deal, that it's that he said it in Aramaic. And can you elaborate on that a little further as to what."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1431.1,"end":1438.06,"speaker":"Fr Stephen De Young","text":"But folks, do I have to like chew your food and drop it into your mouth like baby birds?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1439.58,"end":1450.16,"speaker":"Fr Andrew Stephen Damick","text":"The first guy, the first guy. Unbelievable. Unbelievable. The first guy, you already throwing him under the bus. Remember the two stars, two star review."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1450.8,"end":1465.36,"speaker":"Fr Stephen De Young","text":"That was me. That was me. But this is part of my strategy, right. I don't want to say something dumb unintentionally and get canceled. I want it to be for something I did deliberately."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1469.12,"end":1469.44,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1469.44,"end":1532.22,"speaker":"Fr Stephen De Young","text":"Yeah. So not only is that in Aramaic, but I don't know if he's in the room right now. But as a friend of mine pointed out in the Syriac, you can tell the Syriac is translated from the Greek because in that passage it says that Christ cried out, eloi, eloi lama sabachthani, which means eloi, eloi, lama sabachthani. Like they just. Right. So, yeah, this isn't a thing of Christ just mixing it up. Right. Or something. I think the key thing to take away from that is that. And this is something that orthodox folks shouldn't have, but some of them still do. This idea that there is a text that is the real text in a particular language."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1533.42,"end":1533.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1534.54,"end":1608.3,"speaker":"Fr Stephen De Young","text":"So most Orthodox folks, it's no the Greek. Right. The Greek is the real text. There's a whole pile of questions there. Like which Greek stuff that makes that really complicated. But that's not the perspective that like the church fathers take. Right. You know how I know they don't take that perspective? Because they translated the Bible into other languages and they didn't tell the people. Okay, I know you're reading it in Slavonic now, but this is just a translation. So if you really. What you gotta. Right. And so the Aramaic, the reason I threw that in there was I didn't want what I was saying historically about the synagogue practice to play into that. Oh, well, the Aramaic is not the real text. Right. It's real enough that Christ quotes it. Right, right, right. That Christ prays that psalm in Aramaic on the cross. But him doing that doesn't mean, oh no, the Aramaic of that psalm is the real one. And forget the Hebrew and the Greek. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1608.3,"end":1608.98,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Either."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1608.98,"end":1617.3,"speaker":"Fr Stephen De Young","text":"Right. I see. So there is these different ancient translations, these different variants in the text."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1619.22,"end":1619.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1620.9,"end":1647.15,"speaker":"Fr Stephen De Young","text":"This is one of the things they don't talk about much either. Because if you study New Testament Greek in a Protestant context, they don't care about it much. And there aren't a lot of orthodox contexts to study New Testament Greek aid when you do, a lot of times they're just telling you the patriarchal text of 1914 is like the King James Bible. It fell out of heaven."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1648.59,"end":1651.87,"speaker":"Fr Andrew Stephen Damick","text":"But it did fall out of heaven. The King James Bible did fall out of heaven."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1652.27,"end":1715.32,"speaker":"Fr Stephen De Young","text":"Maybe in a plane crash, one of those miracles where like the Bible survived. Look, everyone, it's a miracle. Everyone else died in the plane crash. The humans died, but the Bible is intact here, laying on the ground. You totally know what we're talking about, right? Yeah. But if you get like the critical edition of the New Testament, a lot of the notes. Right. Especially if you get the edicio critica mayor for the books that that's available for. A lot of the variants are church fathers quotes. You could get whole. There's a whole sub genre of the Society of Biblical Literature publications of like, what did this church father's copy of the Gospel of John look like? Where they just get all the quotes in Greek and put them all together and say this must be what the text he was looking at. And that's sometimes not identical to the patriarchal text of 1914."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1716.17,"end":1716.97,"speaker":"Fr Andrew Stephen Damick","text":"Dun dun, dun."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1720.09,"end":1732.89,"speaker":"Fr Stephen De Young","text":"But that's not a problem. Right. The Holy Spirit is seen to it that every generation of the church has the scriptures, the scriptures that God wants them to have to do what they need to do."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1732.89,"end":1802.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think one of the problems right Is that modern people, one of the things we're into is antiquarianism. Like, if we find some old thing, you know, that's thousands of years old or whatever, we try to preserve it exactly as it is, you know, which, I mean, I love museums, don't get me wrong. But I think we take this antiquarian way of thinking and we even put it. Now, maybe there's a chicken egg issue here, I don't know. But we put it on the biblical text as well. Like, it's this idea of getting back to the original thing. And so, like, restoration needs to make it look like exactly the original thing. And we, as Orthodox Christians sometimes fall into this manner of thinking. We do and have this sense like, well, I don't care what anyone around me actually says, just tell me what the Fathers say. Right? I mean, it's good to read the Fathers. It's good to read the Fathers. But, like, God gave you your pastor. Like, he didn't leave a copy of the homilies of St. Gregory Palamas to run your church, as awesome as they are, which everyone should get them, you know, and support Dr. Christopher Veniamin, who has published that. Please, Thavori, it's a family to feed. Yeah, exactly."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1802.44,"end":1802.88,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1803.28,"end":1855.84,"speaker":"Fr Andrew Stephen Damick","text":"Right. But he gave you an actual living person to be your pastor, and he gave you the living church to be there to actually guide you. This is not an antiquarian exercise, Right? This is life, and it's actually alive now. But one of the things that makes Orthodoxy different from, say, the way that kind of Pentecostalism tends to act, right, which is completely in the other direction. Like, it's really the church of what's happening right this second, in many cases is that with Orthodoxy, it's this one seamless tradition that's still going, you know, and that we have all of it all at once, including what's happening at this moment. I remember one time, listening, I was taking class in liturgics when I was in seminary, and the professor said something I very much disagreed with and not related, but he was later deposed from the priesthood."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1859.28,"end":1861.2,"speaker":"Fr Stephen De Young","text":"He knows who to call to make things happen."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1863.68,"end":1864.24,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1865.92,"end":1867.36,"speaker":"Fr Stephen De Young","text":"Watch yourself. Watch yourself."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1868.96,"end":1916.05,"speaker":"Fr Andrew Stephen Damick","text":"He had this idea that the liturgical tradition had sort of. It was like a blossom that had completely opened and it was done opening. Nothing more. There's no more. Nothing more going to happen. Right? And the question I asked him was, like, well, what point did that happen? Like, at what point in history did it stop? And why did it stop there? You know, Again, it's not Because I believe in an evolutionary or like, throw all the history out of me, for crying out loud. Right. But there is this reality that it's all present together and the church is alive and the church continues to be created in a way that is completely consistent with its previous creativity. Right. That's probably not what you were asking about, but these are some thoughts that I had based on things he said."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1917.17,"end":1919.41,"speaker":"Fr Stephen De Young","text":"That's the kind of progressivism we're used to for me."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1919.81,"end":1920.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1922.13,"end":1922.65,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1922.65,"end":1927.17,"speaker":"Fr Andrew Stephen Damick","text":"Appreciate it. Thanks. Yeah, yeah. All right. Any chance you'll tell us how you were physically ejected from the Mormon Temple?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1927.25,"end":1931.73,"speaker":"Fr Stephen De Young","text":"Not tonight. The weekend is young."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1932.04,"end":1951.32,"speaker":"Fr Andrew Stephen Damick","text":"That's right. All right. Good evening, Father. Good evening. I'm Heath Hemphill from Austin, Texas. Heath Hemphill from Austin. Yes. The most alliterative man in the room, Heath Hemphill. Isn't that amazing, everybody? I just have to put. Just have to put out. Put that out there."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1951.32,"end":1958.84,"speaker":"Fr Stephen De Young","text":"It's a honor to meet you. Because H is a consonant now, according to this guy. It is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1962.14,"end":1964.86,"speaker":"Fr Andrew Stephen Damick","text":"Father, my question tonight is titled which."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1964.86,"end":1968.46,"speaker":"Fr Stephen De Young","text":"Came first, the Idolatrous Chicken or the Demonic Egg?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1969.98,"end":1994.62,"speaker":"Fr Andrew Stephen Damick","text":"So following the dividing of the nations, God assigned the sons of God to rule over the nations and shepherd them, all of which eventually fell. Right. And were accepting worship from those nations. So my question is, and then, you know, later we see the. The rise of giant clans from some of those nations."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1996.22,"end":1997.58,"speaker":"Fr Stephen De Young","text":"Was this the."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":1998.62,"end":2005.26,"speaker":"Fr Andrew Stephen Damick","text":"Were the fallen sinful men responsible, responsible for pulling down the sons of God?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2005.82,"end":2010.02,"speaker":"Fr Stephen De Young","text":"Or were the angels jealous of the."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2010.02,"end":2013.87,"speaker":"Fr Andrew Stephen Damick","text":"Forgiveness given to man, tempting men to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2013.87,"end":2015.67,"speaker":"Fr Stephen De Young","text":"Fall further than they already were?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2017.19,"end":2020.07,"speaker":"Fr Andrew Stephen Damick","text":"So who tempted the angels or these evil people? Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2020.55,"end":2021.03,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2021.83,"end":2024.79,"speaker":"Fr Andrew Stephen Damick","text":"I don't know that we know. Like, I don't think it's depicted in the scripture."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2024.87,"end":2026.31,"speaker":"Fr Stephen De Young","text":"Por que no los dos?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2026.39,"end":2027.03,"speaker":"Fr Andrew Stephen Damick","text":"Ooh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2030.39,"end":2091.45,"speaker":"Fr Stephen De Young","text":"Yeah, Yeah. I mean, that's my. Honestly, because when we're dealing with angelic beings, we get into the whole how do they experience time? Thing, right? So we've talked about, right? There are these eternal realities, and then there are points in time and space where they become reality from our human perspective. Right. But we don't know what that looks like from an angelic perspective, and especially not from God's perspective. And so it can be that the way in which the fall of those beings, those spiritual beings, becomes reality in the time space reality of human beings historically is within that idolatry. So there's not a causal connection. They're sort of the same thing. That would be my answer."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2093.46,"end":2108.34,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense? As I love to ask people, it Does. Thank you. Good. Thank you. Hi, Richard from Dallas, longtime listener, first time caller, I think. Actually, no, I think I've called him before."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2109.7,"end":2115.06,"speaker":"Fr Stephen De Young","text":"And you're not calling in right now. You realize you're not on the phone."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2115.3,"end":2116.1,"speaker":"Fr Andrew Stephen Damick","text":"That is true."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2116.18,"end":2117.14,"speaker":"Fr Stephen De Young","text":"Okay. Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2118.63,"end":2143.59,"speaker":"Fr Andrew Stephen Damick","text":"So I would just like a definitive, dogmatic, once and for all answer. I'm sorry, what was Psalm 90:91, the song that David was playing on the harp to banish the evil spirit from King Saul? Yes or no?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2148.08,"end":2148.64,"speaker":"Fr Stephen De Young","text":"Are you ready?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2148.96,"end":2149.76,"speaker":"Fr Andrew Stephen Damick","text":"I'm ready."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2151.6,"end":2152.08,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2152.96,"end":2153.44,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2153.76,"end":2157.92,"speaker":"Fr Stephen De Young","text":"And it's the one Leonard Cohen is talking about."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2161.76,"end":2164.48,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Our first Leonard Cohen reference for the night."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2164.64,"end":2166.16,"speaker":"Fr Stephen De Young","text":"Well played, well played."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2167.6,"end":2174.08,"speaker":"Fr Andrew Stephen Damick","text":"Leonard Cohen, by the way. Litvak, which means he was a Lithuanian Jew. Just putting that out there."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2174.08,"end":2176.16,"speaker":"Fr Stephen De Young","text":"All great Canadian Jews are Lithuanian Jews."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2176.16,"end":2177.36,"speaker":"Fr Andrew Stephen Damick","text":"That's right. William Shatner, you guys."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2177.36,"end":2179.72,"speaker":"Fr Stephen De Young","text":"William Shadow, also Litvak."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2179.96,"end":2211.97,"speaker":"Fr Andrew Stephen Damick","text":"Any litvaks in the room tonight? Any litvaks, People with Lithuanian. Hey. All right. Svekas. All right. It just means hello in Lithuanian. All right. Good evening, Fathers Stephen from Maryland. I have a two part question on war. Y' all have talked about how spirits can animate communities and institutions. And Father Stephen, I think you were contrasting the Roman army of the Byzantine."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2211.97,"end":2213.65,"speaker":"Fr Stephen De Young","text":"Period with its pagan predecessor."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2213.65,"end":2260.68,"speaker":"Fr Andrew Stephen Damick","text":"And you know, they weren't quite doing devastation against the barbarians at least and not on the scale of the pagan period. That got me thinking. Look, kind of going through wars, through history and certainly Orthodox countries have been involved in them, both what could be considered a defensive and offensive. And so I mean, outside of Byzantium, you go say to Rome, to the Russian Empire where they clearly expanded from this lawyer around Moscow all the way to Siberia at the expense of indigenous people. Fast forward to today where you have the Patriarch of Moscow giving blessings and encouraging Russian soldiers to go kill their Orthodox brethren in Ukraine. So my question, first part of the question, you can comment on that straight to spicy, man."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2260.68,"end":2262.12,"speaker":"Fr Stephen De Young","text":"Yeah, you can come in on that last part."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2262.28,"end":2334.59,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. So first part of the question is what is the Church's teaching on war? Is there an equivalent to the just war theory in the West? There seem to be parts where, you know, killing is bad, destroying the icons of Christ among us is bad. But there seem to be times where the church maybe not condones it, but maybe tolerates it in certain circumstances. Question two is, given the discussion on the taint of sin that you have mentioned several times, what is the moral implication for the participants in war in a modern context that would include everyone from like the intel guys looking at threats and advising policymakers to the policymakers making decisions, to the military guys who are actually executing that. And for both questions, does it matter if it's a quote unquote, defensive slash, good war, offensive, bad war, understanding? That's all a matter of perspective. Good times, everybody. Sorry. You got me thinking."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2335.23,"end":2336.67,"speaker":"Fr Stephen De Young","text":"Somebody should write a book about that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2337.47,"end":2768.4,"speaker":"Fr Andrew Stephen Damick","text":"I have a night. Will I get an acknowledgement? So I'll give you my last name. Yeah, read God is a man of war, everybody. Boy, so gird up your loins. Yeah, right. I'm not going to pass judgment on somebody else's bishop. That's not my. My position. But I will say that I think that when any people attempt to. And I'm not speaking about any particular thing, so I'm going to ask you to apply this for yourself in your own heads. But I think that when any people attempt to impose their own way of being on another people, that that is frankly, leviathanic behavior. Right. Like, I'll talk like. So I actually do know something about, you know, some of the work of historically, the Russian Empire. Like you mentioned, it expanded east to Siberia, but it also expanded west. Right, my Litvak friend, you know what I'm talking about. So, yeah, it expands. I've done a lot of research, and it's not just because I am ethnically Lithuanian a little bit, but just to point this out, okay, this is really obvious. I went to actually with Richard. We went on a pilgrimage to Lithuania and we went to a museum that was once a Nazi and KGB prison. And we actually went into the room where they shot people in the head. And you could feel the evil. Like it was evil. Yeah, Richard had to walk out. I mean, I crossed myself like 20 times. But when we walked into the museum, you know, there was a little sign next to the thing that actually explained when they made this building into a museum. And I asked, I said, when was this turned into a museum? They said right after independence. So right after the Soviets left, they immediately turned this building into a museum and explains on the sign it says this building was preserved as it had been used because this is the way that it was. All right? And as Christians, we need to focus on and face the way that things are, even if it's been being perpetrated by people that we like to think are our side. So I'll talk about the historical bit about the Russian Empire, but this is not unique to the Russian Empire. Many empires have done this stuff. Like, it's not special to that one, but, like, one of the things that they did and this actually, this is a bit of history that touched Pennsylvania, and I'll explain why. So there's a little town that I went to. I just came back from Lithuania a month ago for my second visit, and I insisted on going to a little town called Krazy. So Kraze has a. There's a big Catholic church there in the middle of it. Most of Lithuania is Catholic and a beautiful, beautiful church. And if you go in there, they have a church pew that looks different from the rest of them, and it's off to the side and kind of roped off. And you can read a little sign that they have there, both in Lithuanian and English. So it's for visitors, too, to see this. It says this pew was one of the ones where the Cossacks tied their horses. Now, why would a Cossack be tying up his horse inside a church next to a pew? Well, the reason is that the Russian imperial governor decided he was going to. First he kicked the nuns that were out of the convent there, and he decided he was going to demolish the parish church of this Catholic village. Right. He was just going to trash it. The Russians did this in many places in Lithuania. They demolished Catholic churches and then built Orthodox ones that were used by the local army garrison. So it wasn't like, oh, we want to spread Orthodoxy. It's, look, soldiers, they pray here on the ruins of what was your church. So they decided to do this. And so a bunch of the. After they shipped the nuns out, a bunch of the locals, they heard that they were going to destroy the church. And they said, well, over our dead bodies. And they filled it up and they took turns like they did shifts, sitting in the church, basically saying, look, if you're going to knock this place down, you're going to have to kill all of us. And so the imperial governor sent in the Cossacks, the Don Cossacks, who went and started beating people and massacred them and trashed the inside of the church. I've seen photos of the way the inside of the church was, right. And this became known as the Kraje Massacre. Well, word of this got out to the Lithuanian American community and they started printing descriptions of it in their Lithuanian American newspapers, which I've been reading some of them for the late 19th century. And in the late 19th century, there were enough Lithuanian Americans in northeastern Pennsylvania because a lot of them came there to be coal miners, including my great grandfather. Right. That they actually organized a protest against this massacre that took place way over in what was part of imperial Russia, but was Lithuania. And 10,000 people walked on the streets of Wilkes Barre, Pennsylvania to protest this massacre that took place over there. And one of the things that was promulgated in the newspapers that told this story about what had happened, there were political cartoons. And on the left side you see this Catholic Church, and above it is Jesus in the light and all these people there just trying to pray in their church. And on the right side, you see the Russian czar right next to a big Orthodox church and the devil is huddling down over them, inspiring them to do what they're doing now. That's the way that it was, right? So those were Orthodox Christians doing that thing like actually doing religious persecution against harmless peasants and nuns. You know, were they acting like Orthodox Christians when they did that? No, they were not. It would be profoundly stupid for any of us to say, well, that was my side and it's okay when Orthodox do it. No, it is not. It is absolutely not. So, yeah, I think that in our own day, if we're tempted to fist pump and like, yeah, us, when we pick some side that is literally killing people, lots of people, whatever side it is, whichever one you prefer, right? And not instead say, you know, this is all wrong, this is all wrong. You know, Christianity is the faith of martyrdom. Like the central fact of Christianity is the martyrdom of God himself in the flesh. That's the central fact. A lot of people have been willing to kill for their religion and for their values, but Christianity is about dying for it. It dying for it. So that's what I'm going to say about that. Father Stephen. Well."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2776.32,"end":2876.44,"speaker":"Fr Stephen De Young","text":"Yeah, I'll take off directly from that. And to quote the title of a really good book about the way war functions in modern society is that war is a force that gives us meaning. Because for someone to be willing to kill for something, or even as father and poet, to die for something. So people didn't like when we referenced the Battle Hymn of the Republic, the lyrics comparing the death of Union soldiers to Christ's death, atoning death, which is perverse, Right. It de facto has to be something bigger than themselves, right? Because they're offering themselves to it or for it. They're offering their virtue, they're offering their well being, they're offering someone else's existence toward it. And there are not a lot of things in the modern world, in the modern world, there are not a lot of things that can command that kind of devotion anymore. Very few. You could point to all the Marxists and Neo Marxists. You want at universities all over this country. Great. Not one of them is going to die to bring about a revolution. Not one. They're not even gonna give up their salary. They're not gonna give up cocktail parties, right? To have a revolution, right? War is one of the few things that can still do that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2879.32,"end":2879.72,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":2879.72,"end":3046.47,"speaker":"Fr Stephen De Young","text":"War grounded in nationalism, grounded in the idolatry of the nation state Is one of the few things that can still do that. They can motivate someone to. And it's not on the part of the person. The part of the person who goes and enlists. Part of the person who goes out to fight for their country. That's generally why that gives them a sense of meaning and of purpose that they don't have otherwise. And then the bestowal of that sense of meaning and purpose Is manipulated by other people and forces to accomplish other goals and other things. So that's the reality of war in the modern age. Is a far cry from what war was in the ancient world. And it's become something much more hideous. So the kind of war that we indulge in now has to be sort of resisted on all fronts. Because, as Father Edrew is pointing out, there's one cause you should be willing to die for. And it's not a nation state that might not be around in 50 years or 100. Right? That's not it. That may be hard to hear for some people, but it's the truth. It's a distortion. And when you read, I mean, you don't have to go any further than the Torah. You don't have to go further than Deuteronomy and the commandments regarding warfare. The whole idea of commandments regarding warfare was a foreign concept in the ancient near east and Greece and Rome, for even Rome, right? Rome inter arnim silens legis, right? The law is silent during war. There's no law during war. You rape, you kill, whatever, right? Aristotle says you need to have one every so often. Because people need to vent all of those parts of themselves. They need to go out and do that somewhere else. So they don't do it at home and commit crime, right? So the idea that God's going to come and say, no wars except defensive wars. When you fight a defensive war, you have to give them a chance to surrender peacefully. You cannot make total war. You can't even destroy the fruit trees. You can't destroy the crops in the fruit trees. You can't go scorched earth on your enemy. There's nobody in the world today who cares at all about the commandments of the Torah about war, including the people who really should. Right. So that's what I got to say about that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3046.71,"end":3057.07,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, thank you. And there are people waiting with other questions. I wouldn't mind continuing the conversation later, especially thinking about the guys in Ukraine trying to defend themselves."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3057.07,"end":3058.23,"speaker":"Fr Stephen De Young","text":"But there are other people."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3058.23,"end":3060.23,"speaker":"Fr Andrew Stephen Damick","text":"But thank you for the answers and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3060.23,"end":3062.23,"speaker":"Fr Stephen De Young","text":"Thank you for your wonderful work on the podcast."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3062.23,"end":3068.43,"speaker":"Fr Andrew Stephen Damick","text":"Really amazing. Thank you. We're going to take one more question before we take our break, and then."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3068.43,"end":3069.91,"speaker":"Fr Stephen De Young","text":"You need to line up in the same order."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3069.91,"end":3073.55,"speaker":"Fr Andrew Stephen Damick","text":"In the same order, yeah. So people don't jump in after these."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3073.55,"end":3077.61,"speaker":"Fr Stephen De Young","text":"I have an acute visual memory. I will know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3081.53,"end":3082.25,"speaker":"Fr Andrew Stephen Damick","text":"All righty."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3082.25,"end":3083.05,"speaker":"Fr Stephen De Young","text":"Hi, my name is Jeff."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3083.05,"end":3084.61,"speaker":"Fr Andrew Stephen Damick","text":"I'm from Raleigh, North Carolina."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3084.61,"end":3087.37,"speaker":"Fr Stephen De Young","text":"I'd like to thank you for going to the break after my question so I can."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3088.89,"end":3090.69,"speaker":"Fr Andrew Stephen Damick","text":"My question is about the visions of."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3090.69,"end":3112.79,"speaker":"Fr Stephen De Young","text":"Daniel after Daniel 7 and Daniel 8, 9, and 10. And who is the man that he sees? In Daniel 8, there's the man over the river, and a mysterious voice that tells him seems to indicate that It's Gabriel. Daniel 9 mentions that Gabriel was the man he saw before. And in Daniel 10 it's something similar. But it's interesting because in the visions, the way he is described is eerily."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3112.79,"end":3114.63,"speaker":"Fr Andrew Stephen Damick","text":"Reminiscent of the way St. John the."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3114.63,"end":3140.64,"speaker":"Fr Stephen De Young","text":"Evangelist describes Christ in Revelation 1. And so my question is, is this Gabriel, is this Michael, is this the angel of the Lord, or some combination of all three in different times and places? It's Christ. Footnote I know I never do these, but footnote, See, our episode is the heavenly man, the man from heaven."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3141.44,"end":3143.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In the Christology series, where we talk."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3143.56,"end":3144.56,"speaker":"Fr Stephen De Young","text":"About that for three hours."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3147.04,"end":3147.44,"speaker":"Fr Andrew Stephen Damick","text":"But I."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3147.44,"end":3149.56,"speaker":"Fr Stephen De Young","text":"Gave you the short version just now."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3149.56,"end":3149.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3149.88,"end":3150.32,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3150.32,"end":3155.83,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you very much. We're going to go ahead and take our first break, and we'll be right back with the Lord of Spirits."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3160.87,"end":3164.47,"speaker":"Fr Stephen De Young","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3164.47,"end":3166.03,"speaker":"Fr Andrew Stephen Damick","text":"To take your calls on the next."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3166.03,"end":3262.2,"speaker":"Fr Stephen De Young","text":"Part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO. Hi, do you know me? Hi, I'm Fr. Stephen DeYoung. My new book, An Introduction to Extra Biblical Literature, is now available. A lot of Christians today divide ancient Jewish and Christian literature into two what's in the Bible, what's not in the Bible? Christian east, however, has traditionally had a third category, a middle category, books that are read privately in the home. The Greek word for that is Apocrypha. These texts from the centuries before and the centuries after the incarnation of Christ that go beyond even the larger canons of Orthodox and Roman Catholic churches reveal to us the religious world and theological framework of the apostles and early Church Fathers. In this book, Apocrypha, I survey these works which connect elements of liturgy, scripture, iconography, patristic writings. Familiarity with these works will enhance readers understanding of the breadth and depth of the Orthodox Christian faith. Buy your copy of An Introduction to Extra biblical literature@store.ancientfaith.com that's store.ancient faith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3264.84,"end":3283.14,"speaker":"Fr Andrew Stephen Damick","text":"Alright, welcome back. It's the second half of the Lord of Spirits podcast and we're not taking any calls because this is not live. But it is live. We actually have people standing next to a microphone. But before we start to listen to people standing next to the microphone who have nicely lined themselves back up in the exact same order that they were before. I assume."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3285.46,"end":3289.3,"speaker":"Fr Stephen De Young","text":"Ken verified. Yes, actually, before you do what you're about to do."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3289.7,"end":3290.7,"speaker":"Fr Andrew Stephen Damick","text":"He knows what I'm about to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3290.7,"end":3291.78,"speaker":"Fr Stephen De Young","text":"I feel the need to do something."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3291.86,"end":3292.58,"speaker":"Fr Andrew Stephen Damick","text":"Uh oh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3293.06,"end":3315.03,"speaker":"Fr Stephen De Young","text":"And that is? It has been shown to me the way in which Father Andrew has been baiting and manipulating people with this announcement tomorrow night, online, teasing people, tantalizing them. And so. Yes. So I'm going to spoil it right now because the announcement's about me."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3317.99,"end":3319.67,"speaker":"Fr Andrew Stephen Damick","text":"So you know lying is a sin, right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3319.67,"end":3324.96,"speaker":"Fr Stephen De Young","text":"Many of you, maybe. I was gonna announce this tomorrow. You don't know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3324.96,"end":3325.36,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3327.6,"end":3369.22,"speaker":"Fr Stephen De Young","text":"So as most of you are familiar with at least some of my books, you know, I primarily have written nonfiction, but I'm going to branch out. I'm starting a new series of fiction books. In fact, it's a series of medieval fantasy romance novels entitled the Thirsty Night. And the title of the first book is It's Thirsty Night. You know what that means now you can go ahead."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3369.3,"end":3370.5,"speaker":"Fr Andrew Stephen Damick","text":"Okay, thank you very much."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3374.98,"end":3376.1,"speaker":"Fr Stephen De Young","text":"Ask him if they'll publish."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3376.1,"end":3388.48,"speaker":"Fr Andrew Stephen Damick","text":"We have not yet received a manuscript. You know, there are nephilim romance novels. It's a real thing."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3388.56,"end":3389.44,"speaker":"Fr Stephen De Young","text":"Don't Google it."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3389.44,"end":3390.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, please don't."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3390.28,"end":3390.72,"speaker":"Fr Stephen De Young","text":"It's not."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3392.56,"end":3395.68,"speaker":"Fr Andrew Stephen Damick","text":"There is also a romance novel called Amish Vampires from Space."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3396.64,"end":3399.8,"speaker":"Fr Stephen De Young","text":"It will get into your algorithm and never come out."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3399.8,"end":3439.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm not kidding about the Amish Vampires from Space. But also, please do not Google it. But it is real. Welcome back. So I like you people. So this is the second half. Before we get to your questions and comments, I had a little something I wanted to share, a piece of content, as it were, which I just revealed to some ladies who are in the back corner. I think they're still there. I told them what I was going to talk about and the response was what? Which is exactly what we like to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3439.8,"end":3441.6,"speaker":"Fr Stephen De Young","text":"Hear on the Lotus Pierce podcast."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3441.76,"end":3451.84,"speaker":"Fr Andrew Stephen Damick","text":"Whole lot of what. So if you pick up the oed, the Oxford English Dictionary, which is the greatest piece of scholarship ever assembled, something."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3451.84,"end":3454.16,"speaker":"Fr Stephen De Young","text":"You pick up daily on a. I do."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3454.16,"end":3456.24,"speaker":"Fr Andrew Stephen Damick","text":"I have my own personal copy of the oed."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3456.24,"end":3458.32,"speaker":"Fr Stephen De Young","text":"I think about the Roman Empire. You use the oed."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3458.32,"end":3489.09,"speaker":"Fr Andrew Stephen Damick","text":"That's correct. The Oxford English Dictionary. And you pick it up and you flip to the entry for psychopath. You continue on down the page and get to the word psychophysic. And then towards psychoplasm, which refers to the idea of consciousness as some kind of substance. That's not what I'm talking about. Then right after psychoplasm is the word. Psychopomp. Psychopomp."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3490.69,"end":3492.25,"speaker":"Fr Stephen De Young","text":"It's a great Rob Zombie album."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3492.25,"end":3638.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Also the name of my next band. Psychopomp. Yeah. Okay, so who's heard this word before? Psychopomp. A smattering of you. Congratulations. Yeah, so this word, you know, when I first ran across it, I thought it was like some kind of modern academic thing. Like occasionally academics put together words from Greek bits to create new words that are not represented in ancient sources. Psychopomp is in ancient sources as psychopombos is how it is in Greek, but it comes in English only in 1835. Father Andrews at Tomology Corner. That jingle was created by a guy named Chris who goes to my parish, which is so great. And you hear. If you've heard it, you've all heard it. There's like a little girl's voice at the end that goes. That little girl's name is Eleanor and she's awesome. So shout out to Chris and Kylie and Eleanor and their other children. Yeah. So Psycho cut. Pompomp comes in English in 1835. So it's been in English for about 188 years. It was pretty obscure for most of those years. People didn't use it very much in English publications. But starting in the 1950s, it really starts to climb in English language sources and has continued to climb in popularity ever since, which is a little weird. Like, why are we talking about this more? Right? Not a lot. I mean, it's still not like a super popular word. Weirdly enough, the rise of this word seems to be connected with a rise in interest in Jungian psychology, which includes the word psychopomp. But obviously Jung did not invent this word or this concept, because Jung, you know, is late 18th, early 20th century. Late 19th, early 20th century. Excuse me. And this is an ancient Greek word. So, okay, so what is the etymology in Greek? It's psychopombos from psyche, which who knows what psiki means? Soul. Very good. It doesn't mean psyche like the modern English word psyche, which comes from it, but it means soul. And pombos. Who knows what that word means? Not many. It means conductor. Soul conductor. Soul Conductor, which is also the name of my next album. Yeah, yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3641.03,"end":3643.83,"speaker":"Fr Stephen De Young","text":"That sounds like more of a 70s acid rock vibe."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3644.39,"end":3644.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3644.71,"end":3644.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3646.76,"end":3657.16,"speaker":"Fr Andrew Stephen Damick","text":"So conductive. I feel like it's some sort of alternative dance TV show. Like there's Soul Train, which was the good one, and then there's Soul Conductor, which is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3658.12,"end":3661.32,"speaker":"Fr Stephen De Young","text":"I think John Cornelius is the soul conductor."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3662.76,"end":3663.4,"speaker":"Fr Andrew Stephen Damick","text":"That's very."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3663.4,"end":3664.6,"speaker":"Fr Stephen De Young","text":"Governing the Soul Train."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3664.6,"end":3665.92,"speaker":"Fr Andrew Stephen Damick","text":"He's the psychopomp."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3665.92,"end":3666.36,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3667.64,"end":3672.6,"speaker":"Fr Andrew Stephen Damick","text":"What is happening right now? Etymology is happening."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3676.7,"end":3677.98,"speaker":"Fr Stephen De Young","text":"Philology gone wild."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3680.7,"end":3738.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So when you astonish Richard Roland, you have done a good deed. You could put that on a T shirt. Yeah. So soul Conductor. So a psychopomp is someone who guides the soul into the afterlife, the passage from life to death. So you can see how this sort of fits with Halloween. But it also can be used to refer to someone who guides the soul around while in the other world. So someone who visits the other world, there's often a guide, you know, a psychopomp. Right. So it does show up in ancient Greek sources. As I said, the original psychopomp. Anyone want to make a guess who the original psychopomp was? Virgil is not Virgil. Virgil is not ancient Greek. It's Charon. Yeah. Karen Charon, the ferryman of the dead. The guy. The River Styx guy who also wants."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3738.49,"end":3739.53,"speaker":"Fr Stephen De Young","text":"To talk to your manager."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3740.01,"end":3760.02,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Thank you for that. I just want to mention that the band Styx. Any sticks fans out there? Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3760.02,"end":3760.9,"speaker":"Fr Stephen De Young","text":"And you'll admit it."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3760.98,"end":3809.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes. One of their most popular hits was called Show Me the Way. Oh, yes. Were they thinking of psychopomps? I have no idea. But it really works, doesn't it? Show Me the Way. Yes. Right, so Karen is the original psychopomp, but in ancient Greek sources, the term also gets applied to both Hermes and Apollo, who have been known to come and get your soul. Right. And take it into the realm of the Dead. The psychopomp is a figure who's usually distinct from the death God himself or the underworld God. Like the guy who's kind of ruling the place is not the psychopomp. Although sometimes. Sometimes he shows you around, which is a little weird. Can you imagine getting a guided tour of Hades? From Hades? Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3809.73,"end":3814.37,"speaker":"Fr Stephen De Young","text":"Especially if he was singing. I feel like there'd have to be a musical number in a montage."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3816.69,"end":3834.78,"speaker":"Fr Andrew Stephen Damick","text":"Worst Disney musical ever. Yeah. Did you know I heard this? I don't know if this is true, but I'm just gonna throw it out there as a thing. I heard that when the Disney movie Hercules came out that there was actually riots on the streets in Greece. I heard that. Is that true? Does anybody know if that's true? On brand. Okay. It's on brand for the Greeks."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3835.02,"end":3838.42,"speaker":"Fr Stephen De Young","text":"Just because the movie was bad, I guess, I don't know, that it didn't."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3838.42,"end":3894.16,"speaker":"Fr Andrew Stephen Damick","text":"Represent their view of what Zeus should be like. I don't know. I mean, Zeus is kind of a terrible, terrible, terrible, terrible figure. So I'll give you some non Greek examples. This is not just a Greek concept. The Egyptian God Anubis, the Indic God Yama. So from Hinduism, the Norse Valkyries coming to get your soul. The Slavic God Morana, or Mora. There's actually a custom in Lithuania where they burn a big effigy of Mora once a year. Kind of a big fun, fun time. And speaking of Baltic people, the Baltic God, Veles, he's the soul guy. And then also the Grim Reaper, which shows up in English only in 1847. You get the Grim Reaper. Yeah. I could not stop for death, and so he stopped for me. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3895.36,"end":3897.6,"speaker":"Fr Stephen De Young","text":"But you can sing to the tune of the Yellow Rose of Texas."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3897.6,"end":3902.64,"speaker":"Fr Andrew Stephen Damick","text":"And you can sing all of her poetry. I'm blanking on the poet. Anyone remember her name?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3902.64,"end":3903.24,"speaker":"Fr Stephen De Young","text":"Emily Dickinson."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3903.24,"end":3920.78,"speaker":"Fr Andrew Stephen Damick","text":"Emily Dickinson. You can sing most of Emily Dickinson's works to the tune of Gilligan's Island. I swear I would not stop for death. But Daddy, stop for. For me. When I was an undergrad. Hey, this is just our show, so I could just say whatever I want."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3920.78,"end":3925.46,"speaker":"Fr Stephen De Young","text":"Yeah. When I was under, nothing ever stopped me. I know, I know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3925.7,"end":3943,"speaker":"Fr Andrew Stephen Damick","text":"I'm feeling very free tonight. When I was an undergrad studying English Literature, I got my BA in English Literature from North Carolina State University. Where are my North Carolinians at? All right, thank you. All right. Yeah. Wolf pack. Not Tar Heels. Uh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3943,"end":3944.4,"speaker":"Fr Stephen De Young","text":"Oh, we lost the crowd."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3946.72,"end":3973.73,"speaker":"Fr Andrew Stephen Damick","text":"I remember we were doing some Emily Dickinson, and I raised my hand and I said, so I heard you can sing this to the tune of Gilligan's Island. And everyone, all my classmates go. They're looking down at their poems and they're like. And the teacher was like, so, yeah. So, yeah, the psychopath, Emily Dickinson, she rhymed about the psychopomp."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3973.73,"end":3978.05,"speaker":"Fr Stephen De Young","text":"I ruined Sunday school. He ruins the greatest female American poet."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":3979.89,"end":4046.38,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's lovely stuff. Yeah. So psychopomps are not just gods that show you through the afterlife. Sometimes it's animals. So, most popular. Anyone guess what the most popular animal that shows you through or conducts you into the afterlife is? A bat. It's not a bat, it's a dog. Dogs are most popular. Oh, someone over here is really celebrating. Congratulations. Dogs. It's dogs. Dogs are the ones who show you into the afterlife most often in mythology and legends and fairy tales and stuff. But also owls. You also get cuckoos, a lot of birds, vultures, sparrows. Someone said horses. Horses are also in the mix. Ravens as well. If it's a bird that does it, usually it's not just one bird, it's a flock. And in a lot of the myths, the animal will sometimes show up right before somebody dies. So, like, if you're reading a legend and then, like, suddenly a dog shows up and then sort of walks off scene and doesn't do anything, people who are used to this be like, oh, it's a dog. Oh, somebody's gonna die. That's the way that they would read it, because they know that dogs are psychopomps. Right. They may not know that word."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4046.38,"end":4049.28,"speaker":"Fr Stephen De Young","text":"Like, three people just got in line to ask about Tobit's dog."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4049.28,"end":4050.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Exactly."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4051.2,"end":4054.36,"speaker":"Fr Stephen De Young","text":"Exactly, exactly. So you're fielding the questions."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4054.36,"end":4121.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. That's fine. I mean, you could talk about Tobit. Yeah, yeah. So, yeah, often the animal doesn't do anything but just sort of shows up, especially dogs. Depictions of psychopomps show up, particularly in funerary art. So, like art on coffins, on tombs, that kind of thing. They put animals there sometimes. It's not just decoration. It's a sense that this is a guide into the other world or sometimes a guide through the other world. In Christian sources, psychopomps are usually angels. Angels, Very good. Who said that? All right. Angels. They're usually angels. Angels are usually psychopomps, especially the Archangel Michael, the reaper of souls. Right. And sometimes when people have visions of heaven or the underworld, there's usually some kind of guide along the way. So here's something that's really interesting. This is the last bit I want to. The thought that I want to leave you with psychopomps are not just these sort of otherworldly figures, like a spirit. Right. Or sometimes like an animal showing up. Priests are psychopomps. A lot of priests in the room, which I'm very happy about, actually."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4122.79,"end":4124.15,"speaker":"Fr Stephen De Young","text":"Most of you, yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4124.15,"end":4124.71,"speaker":"Fr Andrew Stephen Damick","text":"I mean, not all."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4124.71,"end":4129.2,"speaker":"Fr Stephen De Young","text":"There's a couple. We won't name names, but some of."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4129.2,"end":4130.72,"speaker":"Fr Andrew Stephen Damick","text":"You we went to seminary with. No."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4131.28,"end":4132.2,"speaker":"Fr Stephen De Young","text":"Probably know who you are."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4132.2,"end":4256.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, priests are psychopomps. Our job is to help guide people into the afterlife. Right. Like, that's a significant piece of what it is that we do. But it's not just priests. It's Christians in general. Right. Isn't our task, in many ways to be guided appropriately into the life of the age to come? Like, that's what we're doing with each other all the time, is we're guiding. Now, you might not be thinking, like, okay, we're on our way to death, you know, but there is this traditional understanding of memento mori. Right. Like, remember death. Remember death. So when you think about these figures, these psychopompic figures, although I saw one place that says psychopompus, and I loved that Psychopompus. So good. You're not just pompous, you're psychopompus. Not related, I don't think. Quick, look that up. Yeah. It's not just these mythological or legendary figures. Like, this is supposed to be us. We have this role. We have this role of making a good death, not just for ourselves, but for the people around us, the people in our lives. We're helping them prepare them for death. You are. All the time. I mean, the way you're interacting with each other right now, the way you're interacting with each other at this conference, the way you interact with each other at home, you know, the way you pray for your families and so forth. You are acting in this psychopompic way, you know, so it's a really interesting and kind of cool figure to ponder. But remember, like, this is us as well. This is our task. This is why we. We of all people in the world have hope, is because we know what's on the other side, and we know that beyond the side that's past, the other side is resurrection. That's the goal, is resurrection. So next time you're doing a psychopompic thing, remember that it's all about resurrection in the end. So. All right, you're next."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4256.83,"end":4259.23,"speaker":"Fr Stephen De Young","text":"Moving on from Father Andrew. Psychopomposity."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4259.39,"end":4265.44,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Good evening, Fathers. I am Brett of Pittsburgh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4266.72,"end":4268.08,"speaker":"Fr Stephen De Young","text":"You have called in the past."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4268.08,"end":4298.65,"speaker":"Fr Andrew Stephen Damick","text":"I have. I'M a longtime listener of civil tongue color, first time con attendee. Nice. I thought I'd wrap this back around to the beginning with some comparative Jewish demonology. My question sort of pertains to how Jewish demonology compares to, to the Orthodox concept of demons and demonology. As we all know, in Talmudic Judaism, I believe in several of the tractates of Lisa Chinga. Wait, wait. As we all know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4304.33,"end":4308.09,"speaker":"Fr Stephen De Young","text":"I have somebody here who can call you on this too, so be careful. Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4308.49,"end":4311.05,"speaker":"Fr Andrew Stephen Damick","text":"Like, quick show of hands, who all knew."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4311.13,"end":4313.37,"speaker":"Fr Stephen De Young","text":"The next thing that he said after we all know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4316.96,"end":4317.76,"speaker":"Fr Andrew Stephen Damick","text":"Okay, just."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4321.84,"end":4325.28,"speaker":"Fr Stephen De Young","text":"Mention the appearance of demons."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4325.52,"end":4328.4,"speaker":"Fr Andrew Stephen Damick","text":"How to avoid demons, and how to deal with demons. Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4328.64,"end":4330.84,"speaker":"Fr Stephen De Young","text":"And with the fact that both Talmud."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4330.84,"end":4363.01,"speaker":"Fr Andrew Stephen Damick","text":"Of Judaism and Orthodoxy evolved from the same time period of Second Temple Judaism, how do they compare to each other? And if there is any sort of comparison or even a gulf between them, what can we think of and make up for Jewish demonology and how Talmudic Judaism and by extension Rabbinic Judaism deals with demons? In an Orthodox mindset, you get 20 words to answer that question. I'm just kidding. Okay. Just kidding."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4363.01,"end":4384.83,"speaker":"Fr Stephen De Young","text":"Brett, why are you bothering me? No, so, I mean, I, I, I think this is my take. I'm not an expert, far from it, on anything having to do with the Talmud. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4385.79,"end":4386.75,"speaker":"Fr Andrew Stephen Damick","text":"As we all know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4390.83,"end":4552.62,"speaker":"Fr Stephen De Young","text":"Like, well, as people should know, because I've said many times I lose interest in the world after about 400 A.D. so. But I think the biggest, my understanding is the biggest disjunctions in demonology have to do with more with the origins of demons than with the more practical aspects. Right. A sort of demonic activity. I think the practical aspects, at least to the end of my knowledge in Talmudic Judaism are still basically holding to the Second Temple view, again, of the practical issue of demonic activity, even though there's been this big disjunction, and that disjunction in terms of the origins of demons happened apparently really early. And I don't think we have enough documents on either side, Christian or Jewish documents, to know exactly when, because we're also dealing with. You've got a diversity within Judaism once you get back into the Second Temple period. Right. So it's not even, it's not true to say, for example, that the Pharisees, like, repudiated the Anakic literature. The Pharisees, by and large, didn't really accept the Anakic literature ever, really. I mean, I'm sure you can find a Pharisee here or there. Right. Josephus seemed fond of jubilees, but even that he mostly Seemed fond of it as filling in certain historical gaps, sort of the historical narrative of the Torah more than any of the more esoteric elements of the Book of Jubilees. So, yeah, so I don't think that's necessarily even a rejection so much as it is a never accepted. Whereas you have other currents and phases of Judaism that did accept that literature that ended up becoming Christian communities and brought that with them. So, yeah, that's my take on that. I think the big disjunction is like the origin of demons, particularly the relationships between demons and angels. My perception is that Rabbinic Judaism is held onto like the Old Testament view that we've talked about on the show a bunch, that sort of what would be called demonic powers."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4552.94,"end":4553.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4553.26,"end":4561.1,"speaker":"Fr Stephen De Young","text":"Spiritual powers that are negative are still something. Are still created by God and are still being used by God."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4561.9,"end":4562.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4562.22,"end":4589.96,"speaker":"Fr Stephen De Young","text":"Sort of the theodicy of the Hebrew Bible is sort of based on that. Right. That he sort of has them on a leash and they do his will. Right. Rather than. And that's. Rather than seeing them as rebellious powers per se. That I think is another key difference. But yeah, that's what I got to say about that. That was more than 20 words."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4590.04,"end":4604.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's true. That's true. But that's what we got. Hope that helps. Great. Hello, my name is Matthew. I'm from Carmichaels, Pennsylvania, which is about an hour south of Pittsburgh, so up."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4604.32,"end":4605.08,"speaker":"Fr Stephen De Young","text":"The city state."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4606.84,"end":4614.46,"speaker":"Fr Andrew Stephen Damick","text":"One. Someone somewhere got a dissertation topic comparing Socrates demon with Jung's guide in the Red Book. That was a moment for me."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4614.46,"end":4615.42,"speaker":"Fr Stephen De Young","text":"I don't remember thinking about it, that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4615.42,"end":4617.62,"speaker":"Fr Andrew Stephen Damick","text":"Jung probably wasn't demonically possessed. But anyways."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4619.38,"end":4637.04,"speaker":"Fr Stephen De Young","text":"He did used to put on a lion head, like an actual taxidermied lion head, and parade around his house with his cult and proclaim himself to be the Arian Christ. That's Arian with a Y. There's a reason he had Freud's split."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4641.84,"end":4688.17,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, Jungians staying within the Halloween theme and the demon theme, that is psychology. I work in the mental health field and so especially in the modern times, like the subject of mental health and its relationship with demonic possession comes up a lot. And you see, see that often, particularly in Pentecostal charismatic groups with deliverance ministries, which I'm not familiar with really at all. And then the modern Roman Catholic exorcism industry, which I'm familiar with just from having a Roman Catholic background. And I was curious about the development of exorcism in the orthodox tradition, especially to the modern day where Roman Catholics."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4688.48,"end":4689.52,"speaker":"Fr Stephen De Young","text":"Like, I don't Know if anyone knows."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4689.52,"end":4715.05,"speaker":"Fr Andrew Stephen Damick","text":"The names, like Father Chad Rittburger, he's written, like, an entire book called the Introduction of the Science of Mental Health that gets into, like, demonic possession and, like, sins that lead to mental illness and all that. I know that exorcist was a minor clergy role, like in the early church, but especially post Reformation, it seems like there's this debate over who has, like, the authority over demons. And I know that was, like, even, like, a competition that some Protestants groups have with the Catholics."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4716.17,"end":4717.85,"speaker":"Fr Stephen De Young","text":"Why do you think?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4717.85,"end":4754.82,"speaker":"Fr Andrew Stephen Damick","text":"I suppose the exorcism ministry develops the way that it does in the west, and does something like that exist in Orthodoxy or orthodox minority nations, and it's just that there's not a lot of stuff in the English language talking about that. Or is it. Do you think that Western Christianity has developed kind of a different demonology and perspective of exorcism than the east is kind of retained? Huh? I mean, I have some thoughts about this. I'll just roll a few of them out and we'll just see what happens. Hey, we all do this, right? We think out loud, but usually not into microphones."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4756.5,"end":4757.82,"speaker":"Fr Stephen De Young","text":"I do that all the time."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4757.82,"end":4763.3,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, but I have to work here."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4763.3,"end":4763.82,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":4763.82,"end":5019.91,"speaker":"Fr Andrew Stephen Damick","text":"Korea. So I mean, you mentioned. Okay, you mentioned the ancient minor clerical role of exorcist, right? And we. When we hear exorcist, right, it's usually the first thing that comes to mind for us as modern Americans is the movie, right? Ooh, an exorcist. Like, he's a demon professional. But the exorcist in the ancient church as a minor clerical role, his main task is that he was a catechist. And so the reason that he did exorcisms is because that was what you did on day one of catechism, Right. The idea is that these people come in, they're mixed up with demons, so you need to pray these prayers for them so as to get them out. And so now they can begin to receive this teaching, because if you don't do that, they actually are not going to be able to receive it very well, if at all. And I mean, related to this, of course, Saint Athanasius, I can't remember which text it is. I think it's on the Incarnation. But he says at one point that unless someone is living as the saints have lived, you can't understand their teachings, which I think is a really important point in our modern day of people who like to teach things who don't live according to the teachings. But, you know, Exorcism is bound up with repentance. I know a priest, for instance, who was called to do exorcisms over and over again in a home that was connected to his parish. This was in Chicago years and years and years ago. And he told me this story, and I said, why did they keep calling you? He says, well, you know, they kept calling me. And then finally I started asking some questions about, like, so tell me about your life and your family. And it turns out that there was incest being practiced. And he said, okay, look, if you want the demons to stop coming back, you should stop doing that. Because unless you're living, you know, faithfully, then you're inviting demonic powers. Obviously, that's a deeply evil sin. Right? So all of that is to say that I think that. And again, I'm just. I'm shooting from the hip generalizing here. But, I mean, I've never been a Roman Catholic. I've never seen a Catholic exorcism or any of that kind of stuff. So I'm only speaking generally from the way that people perceive them as kind of specialists. Right. Whereas in the Orthodox Church, generally speaking, priests are exorcists. Right. We don't have the role of exorcist as a catechist position anymore. But I think part of the reason why there is this sense of specialists is that there is this. I don't know, it's a kind of a personality thing of Western peoples is like, we like to classify and taxonomize everything, right? And. Whereas, I mean. I mean, I remember one time I was at a coffee house, and I happened to be wearing my cassock. I was getting coffee, and the young woman behind the counter says to me suddenly as she's getting me my coffee, she says, can I ask you something? I was like, yeah, because, I mean, usually when they're handing you your coffee, you don't get that. So I was like, oh, this could be good. And she says, do you do exorcism? I mean, I'd never had a conversation before with her in my life. And, I mean, I said, yes. And I mean, quick show of hands. The priests in the room, which of you have done exorcisms? Every single last one of you, Right? Yeah, we all do them. We all do exorcisms because we have all baptized people. And that's usually the first thing that happens. Interestingly enough, that exorcism part often is labeled with prayers for the making of catechumens, which, I don't know, a lot of people don't really realize that's what's happening to that baby is you're being made a catechumen, ma'. Am."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5019.91,"end":5021.91,"speaker":"Fr Stephen De Young","text":"Your baby is full of demons, right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5026.63,"end":5108.88,"speaker":"Fr Andrew Stephen Damick","text":"I mean, yes. So, yeah, yeah. So it is simply part of. It's sort of integrated into the church. Right. For the Orthodox, that does not mean that there are not separate prayers that are done for these question of, like, demonic possession sort of stuff. Right. And usually, in my experience and the things I've heard about and have known about happening, typically when there is a need for something special, it's often put within the purview of monasticism to sort of take care of it, you know, that there, because of the lives that monastics live, there's the possibility. I mean, it's not guaranteed by being tonsured monks or nuns that they just have this. But there's the possibility for discernment and so forth that a lot of the rest of us don't necessarily have. It's not an absolute thing. But yeah, that's at least how I would kind of characterize now. Why it develops that way, I don't know. I mean, that would be a really interesting book, as we like to say. Journal articles must be written and dissertations have to be defended. So I don't know if you've done any doctoral work, but here's an idea for you. Not yet. So I don't know. That's what I have to say about that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5108.88,"end":5120.36,"speaker":"Fr Stephen De Young","text":"Yeah. Well, I would just say, in terms of where I think that comes from, is there's a general ethos within modern Roman Catholicism, and this is something we've talked about on the show a lot."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5120.44,"end":5120.84,"speaker":"Fr Andrew Stephen Damick","text":"Where."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5123,"end":5159.29,"speaker":"Fr Stephen De Young","text":"There'S this view of the quote, unquote, supernatural. We're here in a corner, and then there's like, natural law, natural order, and these are separate things. And you see this in a lot of the organizations within the Roman Catholic Church, like when they're talking about canonizing a saint. Well, we have to isolate three miracles. Right. And we have to get so much testimony to these miracles and these miracles, we have to rule out any natural explanation. Right. Because God can't heal someone through surgery."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5160.57,"end":5160.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5160.97,"end":5166.37,"speaker":"Fr Stephen De Young","text":"It's got to be the whammy. Right? Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5166.37,"end":5167.69,"speaker":"Fr Andrew Stephen Damick","text":"Everyone remember, press your luck."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5167.69,"end":5168.65,"speaker":"Fr Stephen De Young","text":"Who watched that show."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5169.37,"end":5169.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5170.33,"end":5173.25,"speaker":"Fr Stephen De Young","text":"I'm going for more. Explain the scientific basis of the whammy."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5173.25,"end":5173.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5173.89,"end":5176.57,"speaker":"Fr Stephen De Young","text":"But, yeah, no whammies."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5176.57,"end":5177.29,"speaker":"Fr Andrew Stephen Damick","text":"No whammies."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5177.37,"end":5212.91,"speaker":"Fr Stephen De Young","text":"Right. And so it's sort of this idea. And so if you're taking the approach that, well, we only need to do an exorcism if we can exclude. Exclude all forms of mental and physical illness, then you're going to need a specialist with experience in those fields. Right. If that's your approach to it. But it's very rare that we as human beings have an either or like that. Let's just take physical and mental illness. If you have severe physical illness, severe physical disabilities, you're probably not going to be mentally well adjusted."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5213.78,"end":5214.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5214.02,"end":5269.74,"speaker":"Fr Stephen De Young","text":"Like, you could have a lot you're dealing with. Right. And vice versa. Right. If you're deeply, clinically depressed, you're probably not going to be physically, you know, in outstanding shape. Right. Because humans are a whole person. And the same is true spiritually. Right. The same is true spiritually. There are. You can look at photos of people, like people who have been deep in various sinful lifestyles and have gotten out of it, and you can look at before and after photos, and it's like, physically visible, like the transformation, and unfortunately, vice versa. So, yeah, I think the key issue there is separating off the spiritual from everything else. Like, it's this other category."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5272.7,"end":5273.34,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5280.06,"end":5281.18,"speaker":"Fr Stephen De Young","text":"I feel your pain."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5281.74,"end":5283.66,"speaker":"Fr Andrew Stephen Damick","text":"Say, are you taller than Father Steven?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5283.66,"end":5284.38,"speaker":"Fr Stephen De Young","text":"I think he is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5286.14,"end":5287.02,"speaker":"Fr Andrew Stephen Damick","text":"6 foot 8."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5289.42,"end":5302.71,"speaker":"Fr Stephen De Young","text":"We won't assume anything. It's okay to be tall. Yeah. My name is Adam."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5302.71,"end":5310.07,"speaker":"Fr Andrew Stephen Damick","text":"I'm from St. Louis, and I had a question about a Greek word in the gospel according to St. Matthew and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5310.07,"end":5312.35,"speaker":"Fr Stephen De Young","text":"How it relates to trusting the teaching."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5312.35,"end":5316.52,"speaker":"Fr Andrew Stephen Damick","text":"Of the church fathers. So to make a long story super."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5316.52,"end":5318.56,"speaker":"Fr Stephen De Young","text":"Short, my father is a Lutheran."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5318.56,"end":5321.16,"speaker":"Fr Andrew Stephen Damick","text":"He's a runous Lutheran, though, so he."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5321.16,"end":5332.56,"speaker":"Fr Stephen De Young","text":"Believes that the events have already happened. And so that would be depressing to me. We're living after the end, as good as it gets."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5334.08,"end":5334.48,"speaker":"Fr Andrew Stephen Damick","text":"Really?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5334.72,"end":5335.12,"speaker":"Fr Stephen De Young","text":"Really."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5337.76,"end":5338.24,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5342.82,"end":5357.82,"speaker":"Fr Stephen De Young","text":"In Matthew 24, where Christ is talking about the signs of the end of the age, destruction of the temple and the earthquakes and wars, he says, from the fig tree, learn its lesson. As soon as its branch becomes tender and puts out its leaves, you know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5357.82,"end":5358.74,"speaker":"Fr Andrew Stephen Damick","text":"That summer is near."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5358.9,"end":5362.82,"speaker":"Fr Stephen De Young","text":"So also, when you see all these things, you know that he is near at the gates."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5362.82,"end":5364.42,"speaker":"Fr Andrew Stephen Damick","text":"Truly, I say to you, this generation."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5364.42,"end":5374.09,"speaker":"Fr Stephen De Young","text":"Will not pass away until all these things have taken place. Heaven and earth will pass away, but my words will not pass away. My dad reads the gospel according to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5374.09,"end":5377.13,"speaker":"Fr Andrew Stephen Damick","text":"St. Matthew where the word eunia appears."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5377.13,"end":5398.76,"speaker":"Fr Stephen De Young","text":"As this generation in this passage of Christ's words. And he says that in all of the rest of the Gospel According to St. Matthew, when the word is used as yinia, it means explicitly, this generation, like a generation of people, not a generation of a whole People."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5400.52,"end":5401.48,"speaker":"Fr Andrew Stephen Damick","text":"Meaning, like."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5401.88,"end":5455.02,"speaker":"Fr Stephen De Young","text":"You know, the lifespan of a group of people rather than the lifespan of a nation or lifespan of an ethnicity or something of that matter. I have pointed him to the Church fathers, the commentaries on Scripture, which I'll continue to say, yeah, he means this generation of people. And so my dad just says that's lazy exegesis, because every other place. Yeah, he says that every other place that it appears in the Gospel According to St. Matthew, it's a specific thing. And then they take it and run with it from this passage. And no amount of showing the Church fathers or the continuous teaching of the church seem to help here. I was just curious if you happen to have any words of wisdom or anything to say, say to folks who say, well, the church fathers disagree all the time, so we can just kind of pick and choose and run with the ones we like. Yeah, thank you. You want me to take that one?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5455.02,"end":5455.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5457.94,"end":5486.79,"speaker":"Fr Stephen De Young","text":"So, yeah. Well, first of all, there's always a problem with. Well, everywhere else it means this. Well, does it? Right. We'd have to go through every one of those. But more importantly, when you take it into context there. And part of this is understand. So this will make the Greeks mad at me again. But. Okay, if you don't know any Hebrew and you don't know any Aramaic, you can't read New Testament Greek. There, I said it."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5486.79,"end":5487.95,"speaker":"Fr Andrew Stephen Damick","text":"Shots fired."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5489.15,"end":5490.59,"speaker":"Fr Stephen De Young","text":"I already said on this show, what's."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5490.59,"end":5491.11,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5491.11,"end":5497.41,"speaker":"Fr Stephen De Young","text":"You have said this doesn't exist. Yeah, I don't know if that didn't make you mad because."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5497.41,"end":5502.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because the New Testament writers are thinking in Hebrew and Aramaic and translating it into Greek."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5502.93,"end":5503.41,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5503.65,"end":5504.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5504.45,"end":5525.58,"speaker":"Fr Stephen De Young","text":"And one of the forms you have there is. You have this parallelism. This generation will not pass away. My word will not pass away. Does he think the word of God passed away? It's AD 70 when the temple was destroyed. I don't know if I have an answer."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5527.18,"end":5528.74,"speaker":"Fr Andrew Stephen Damick","text":"This is a good rhetorical question for."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5528.74,"end":5555.34,"speaker":"Fr Stephen De Young","text":"You to throw out, but my guess would be no, he doesn't think that was the end of. Right. And so there is a parallelism, Hebrew parallelism. I mean, he probably owns a copy of Robert Alter's the Art of Biblical Poetry because, like, everyone who goes to grad school does who studies the Old Testament at all. I don't think that he does. Oh, okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5556.06,"end":5556.86,"speaker":"Fr Andrew Stephen Damick","text":"Christmas gift."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5558.86,"end":5595.78,"speaker":"Fr Stephen De Young","text":"To sort of understand structures of parallelism. Right. And when you have two things that are set up in parallel like this, Right. You, you, and you interpret them together. Right. This is synthetic para. What's Called synthetic parallelism. There's also antithetic parallelism. Right? Like the wicked X, the righteous Y. Right? That's right. Antithetical parallelism. Synthetic parallelism is when you repeat it from different perspectives. This is all through the Psalms. You get these doublets, right. And these parallelisms. And that's what's going on there."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5597.62,"end":5597.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5597.94,"end":5611.56,"speaker":"Fr Stephen De Young","text":"And what Jesus is saying. So you have to interpret those two sayings together. That's part of why the church fathers are interpreting both of those phrases the same way. To read both of those phrases the same way."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5613.72,"end":5614.2,"speaker":"Fr Andrew Stephen Damick","text":"Awesome."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5614.2,"end":5615,"speaker":"Fr Stephen De Young","text":"Thank you so much."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5615.4,"end":5623.64,"speaker":"Fr Andrew Stephen Damick","text":"All right. Hello, Fathers Will from Florida."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5623.8,"end":5632.87,"speaker":"Fr Stephen De Young","text":"I have a Nephilim question. Get excited, people. Do you think that Napoleon was a giant?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5646.23,"end":5706.13,"speaker":"Fr Andrew Stephen Damick","text":"I will say this about Napoleon Bonaparte, Emperor of France. He was not actually short. That is propaganda. It's basically English propaganda. Napoleon Bonaparte was average height for his age, for his time. He actually was average height. The idea that he was some short little dude and thus giving rise to the phrase Napoleon complex that we now have. Right. Was English propaganda, actually. Yeah. Yeah. Napoleon was normal size for his time. So. Sounds like something a Frenchman would say. I happen to have both English and French blood, so I don't know what to do with that. But, I mean, you know, as all Englishmen now do, but I mean, you know, 1066 and all that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5706.13,"end":5707.29,"speaker":"Fr Stephen De Young","text":"Is that really normative?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5707.93,"end":5725.13,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Nice. I'm not going to say that's the first dad joke of the night because there were some that got close to it earlier. But. Yeah, yeah. But was he. You know, I'll say this, okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5725.53,"end":5727.45,"speaker":"Fr Stephen De Young","text":"He didn't eat anybody, to our knowledge."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5727.77,"end":5774.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. Important point. Cannibalism often comes. Goes with gigantism. How do you think they grow so big? But, you know, this comes up every so often, right. On the show. And I think, like, one thing someone could say is, well, there's no evidence that he was conceived in some kind of demonic sexual ritual. Right. Like, we have no reason to believe that. Right. And so therefore, he's not one of the Nephilim. But I'll say this. The idea that it must that you have to do a certain ritual in order to get this super demonized human is the kind of stupid crap the demons want you to believe. They want you to believe that magic works."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5775.42,"end":5776.02,"speaker":"Fr Stephen De Young","text":"It's working."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5776.02,"end":5861.78,"speaker":"Fr Andrew Stephen Damick","text":"Blue here, people, you know, they want you to believe that if you follow the formula, then you get this. You get to be powered up, you get to become a superhero. You get to be one of the mighty men of old if you follow this particular formula. Now, if you do that stuff, then they're of course going to jump in and make it happen for you, quite possibly. But you can become. I mean, St. John Chrysostom says this. You can become like a demon after death by living like a demon before death. It doesn't require any particular ritual. Right. Idolatry only quote, unquote, works because the demons show up and make it work. The demons show up and do communion with you. It's not that you actually can trap and control demons right now. That's what they think, and that's what the demons want you to think. But so one can be a giant in the sense of being a demonized, A truly demonized human without having followed some kind of ritual checklist. You can be deeply evil without that stuff going on. There's other ways to get there. There's lots of paths to evil, you know, even to profound evil. You know, one of the things that I don't know. Did you do this when you were in seminary? We had to visit prisons to do prison ministry. When we both went away to St. Tikon's we went to the same seminary. I know There are several St. Tikon's grads in the room. Right. Sorry about you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5861.94,"end":5863.18,"speaker":"Fr Stephen De Young","text":"Whatever the mascot is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5863.18,"end":5887.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sorry. Barely. In the 70s, they tried to make Leviathan the mascot. I'm not commenting on that. Wow. Someone tried to make Leviathan the mascot of the Saint Tikon sports team. Translation of Psalm 103, the Leviathan sports. Wow. I'm not defending it. I'm just stating it as historical Class."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5888.3,"end":5891.74,"speaker":"Fr Stephen De Young","text":"Do St. Vlad's. Do their team still identify as the Impalers?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5895.66,"end":5987.06,"speaker":"Fr Andrew Stephen Damick","text":"It's true. Vlad. Vlad's Impalers. If you ever get. Get an Impala, you should name it Vlad. What was I even saying? Oh, yes, we had to do prison ministry and as part of our seminarian stuff. And I remember being brought down into the place that was basically. I can't remember what they called that level, but it was essentially those who were the Criminally Insane Forensic Unit. Forensic unit. It sounds so clinical. The forensic unit. And there were guys literally chained to the walls. And I mean, you look at them and you're like, okay, yeah, that's real. Most of us have never been face to face with that kind of thing in our lives. And you see that, though. I mean, it'll haunt you. And it's absolutely, absolutely real. Was Napoleon one of those people? That's the question you asked. I don't know. I mean, he's certainly super ridiculously talented at Winning battles by using cannons. I mean, he was really good at that. And that's why he, you know, achieved what he achieved. Right. And also, he had a very clearly, very strong will to power. You know, he would be a superman from Nietzsche's point of view. Okay, maybe not so much, but. But, yeah, I mean, he definitely had that very, very strong will. But, I mean, was he a giant? I don't know. I mean, how could we. How could we tell?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5987.3,"end":5990.15,"speaker":"Fr Stephen De Young","text":"Well, yeah, also, two things can be bad."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5992.14,"end":5992.38,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":5992.46,"end":6058.63,"speaker":"Fr Stephen De Young","text":"Like, we don't have to. You know, some people are just horribly evil. They aren't all giants. So we don't have to. We don't have to reduce it. I don't see any evidence of any of that kind of ritual activity surrounding Napoleon. Now, I did mention I do think Napoleon was an Antichrist figure. And if you don't believe me, read what Hegel had to say about Napoleon. As Napoleon was ransacking his university, Hegel is looking out the window at him and saying, there is history incarnate. And if you know what Hegel meant by that, Hegel thought history was the Holy Spirit, that the Holy Spirit was God becoming incarnate as history. So he's kind of calling the Napoleon like the Messiah when he says that. Right. So there is, like, there was in Napoleon's day this Antichrist element. I know people got mad, too, when I pointed out in an episode that Beethoven wrote a lot of music, like in praise of Napoleon."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6059.75,"end":6061.23,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Not Beethoven."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6061.23,"end":6062.87,"speaker":"Fr Stephen De Young","text":"Yeah, I'm taking away your Beethoven."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6063.91,"end":6065.11,"speaker":"Fr Andrew Stephen Damick","text":"Dun, dun, dun, dun."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6070.84,"end":6098.05,"speaker":"Fr Stephen De Young","text":"The classical and classical music is not like classic rock. It's classical, like pagan Greece and Rome. It was a return to those values. Right. And Beethoven is actual. We call lots of different music that's not really classical music. Classical music, but Beethoven was actually classical music. So, yeah, Napoleon bad. I don't think he was a child."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6100.21,"end":6109.37,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. All right. I'm John. Could a Neanderthal be a saint? And if not, does that mean they."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6109.37,"end":6110.05,"speaker":"Fr Stephen De Young","text":"All go to heaven?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6110.93,"end":6115.65,"speaker":"Fr Andrew Stephen Damick","text":"Could a Neanderthal be a saint? And if not, what? Do they all go to heaven?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6115.97,"end":6117.49,"speaker":"Fr Stephen De Young","text":"I mean, are you saying they're dogs?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6117.57,"end":6118.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6122.49,"end":6124.25,"speaker":"Fr Stephen De Young","text":"I mean, I'm kind of offended. I have a lot."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6128.09,"end":6148.01,"speaker":"Fr Andrew Stephen Damick","text":"As do I. Yeah. Northern Europeans are somewhat Neanderthal. I mean, well, could a Neanderthal be a saint? I hope you become a saint, Father Stephen. I'm praying for you, bro. I mean. Yeah. Like, is there someone in heaven who's not a saint?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6149.55,"end":6151.07,"speaker":"Fr Stephen De Young","text":"No, no."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6151.07,"end":6152.83,"speaker":"Fr Andrew Stephen Damick","text":"Like, that's what it is. That's what Heaven is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6154.27,"end":6158.27,"speaker":"Fr Stephen De Young","text":"I'm in trouble there. I was gonna be like the Janet. Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6159.39,"end":6167.39,"speaker":"Fr Andrew Stephen Damick","text":"I mean. I mean, there are definitely levels. There's. There's. There's levels, right. There's being least in the kingdom of heaven and greater and greater. You know, like, there are definitely levels."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6167.39,"end":6167.71,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6169.23,"end":6208.58,"speaker":"Fr Andrew Stephen Damick","text":"But, you know, in as much as Neanderthals are humans, which I get. I mean, I don't know. They seem to be humans to me on some level in any meaningful way, that's what they seem to be. I'm not a paleontologist or whatever. Exactly. Is the ologist. That needs to be applied to this question. But if they can live in accordance with God's will and they are humans, then yeah, I mean, of course. Absolutely. Thank you. Yep. We're going to take one more and then go to our second break. Hello, Father's D and D. My question's."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6208.58,"end":6212.42,"speaker":"Fr Stephen De Young","text":"Kind of playing off of his question there. More Neanderthals."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6212.5,"end":6241.45,"speaker":"Fr Andrew Stephen Damick","text":"More Neanderthals just get that free pass to heaven. Did you know that people with high levels of Neanderthal DNA also tend to have a natural resistance to HIV infection? Now, Northern European people, please do not try this out at home. But it is true, especially Baltic people tend to have a higher degree of resistance to certain kinds of viruses. I don't know, it's kind of nice. I've never tested that on myself, but I have no intentions of it anyway."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6243.13,"end":6277.17,"speaker":"Fr Stephen De Young","text":"Not specifically about Neanderthals, though, more broadly about prayers for the non Orthodox departed. One thing that's been mentioned in this show repeatedly is that the dead acting requires a body and the dead don't have a body. That they can't act, they can't repent. And if I understand correctly, with our prayers for them, we can repent on their behalf. So the question is, one, do our prayers for the Orthodox departed and the."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6277.17,"end":6279.41,"speaker":"Fr Andrew Stephen Damick","text":"Non Orthodox departed differ?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6280.05,"end":6281.91,"speaker":"Fr Stephen De Young","text":"And if so, why?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6283.91,"end":6287.07,"speaker":"Fr Andrew Stephen Damick","text":"And do we allow the possibility of."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6287.07,"end":6312.3,"speaker":"Fr Stephen De Young","text":"Non Orthodox departed joining the choirs of saints? And is that what we see with the brother of Saint Perpetua, for example? And then do we make a distinction in prayers for different types of non Orthodox departed? For example, the non orthodox Trinitarian Christian versus the atheist versus the pagan versus the giant or the person specifically anathematized by the church?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6313.5,"end":6448.28,"speaker":"Fr Andrew Stephen Damick","text":"Okay, this is a great question. So the answer to your first question is yes. That's the short answer. Longer answer, I'm not gonna. No, I'm not gonna do it. They're waiting. I heard someone going, yes. Yeah, no. The longer answer is yes. So there is a difference between the way that we pray for the Orthodox and the non Orthodox in the Orthodox Church, those who are departed and even those who are living right now, the exact way that that plays out varies from tradition to tradition and sometimes bishop to bishop. Okay, so it's not standardized, generally speaking. Now I'm speaking generally generally because I know there's all kinds of variations in this point. Generally speaking, memorials that are done in church for the departed by name are for Orthodox Christians only. Now, I know that there's some variation even on that point. I've seen it personally. But generally speaking, those kinds of memorials are done in church only for Orthodox Christians. In some cases, there is an allowance made to do those kinds of memorials at the graveside only for non Orthodox Christians. Right. Only at the graveside. Certainly the funeral service for Orthodox Christians is a completely different service than the one that a priest has to get special permission from his bishop to do for a non Orthodox person who has no one else to bury him. It's a completely different service. Like, it's totally different, you know, and sometimes there may be some elements that are shared between them, but other than that, it's really kind of a different service. There are different opinions about. So some traditions during the great entrance will commemorate names of people. During the great entrance to Divine liturgy will commemorate names of people. And some traditions will say, only Orthodox names can be commemor. Commemorate it. Now other traditions will say, you can include non Orthodox names, because didn't we just pray for the President of the United States and that guy's not Orthodox, in case you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6448.28,"end":6449.24,"speaker":"Fr Stephen De Young","text":"But not by name."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6449.56,"end":6451.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But not by name. That's true."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6451.72,"end":6453.4,"speaker":"Fr Stephen De Young","text":"We don't say Smokin Joe."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6453.4,"end":6469.84,"speaker":"Fr Andrew Stephen Damick","text":"And for our president, Joe, it would have been interesting. Like, what if Mike Dukakis had become president of the United States? Would someone have anointed him as president? I don't know. Good thing we didn't have to find out."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6472.32,"end":6474,"speaker":"Fr Stephen De Young","text":"He was out of communion with the church."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6474.16,"end":6776.88,"speaker":"Fr Andrew Stephen Damick","text":"He actually was out of communion because. Yeah, yeah, that's true. Right. So all of that is to say there is this distinction made. And sometimes the nature of the distinction, where the line is, can kind of move a little bit depending on from one tradition to another. Why is there a distinction. Distinction made? Are we saying by having this distinction that, like with Orthodox people, like, everything is fine, and with non Orthodox people are saying, well, good luck. That's the impression that some people have. Right? That's not what we're saying. Because the truth is that any of us who make it into the kingdom of God are there by mercy. We're still saying, lord have mercy. Mercy is not something you want if you're deserving. Mercy is, please, I don't deserve this. Please, may I? Please. Right. But there is a distinction made because we can't pretend as though life within the Church with all the things that the Church provides is the same as people who are not utilizing those things. They're not the same. Right. All of these tools are given to us for our salvation. And if someone's not using them, we're not going to say, well, it's, you know, it's all, it's all the same. We're not going to say that. So that's why that distinction is made. It's not made in order to make a comment about the eternal destiny of any other one of those people. That's not the point of it. Because we don't know. The only ones we really know about are the saints. And as we've noted, there are cases like, you know, I can't remember what the source is now, but we've talked about this on the show before, where St. Gregory the Great, it was revealed to him that his prayers had released the Emperor Trajan, the guy who killed Saint Ignatius of Antioch, the Emperor Trajan, the one who threw Antioch to the lions. You can tell in Ignatius lines, you could tell of Sagnacious. Someone should write a book about that, about St. Ignatius of Antioch, you know, that through his prayers that Trajan had been released from Hades. You know, I mean, Trajan was a pagan and a Christian killer. Right? So this possibility does exist, but it's not something we, we rely on or expect or say like, it's gonna be fine, I'll pray for you. No, this life is for repentance. So let's use every tool that we have to repent. This is the sure way. This is the way. Right. The possibility, of course, does exist. And I'm not gonna even say like, well, you know, some make it. I don't know that. I don't know some or all or maybe or most or a few. I don't know any of that stuff. And I'm saying this, I'm saying this sitting here as a guy in front of you whose mother died a non orthodox Christian. My mother died. She was not orthodox. Right. I do pray for her. I am not given a blessing to pray for her in memorials in the church, but I do whenever I visit her grave in Colorado, I do go pray with the blessing of my bishop. I Do go pray. A memorial at her grave. And I privately pray for her in my prayers. Now I'll tell you something about my mom. She is way holier and more Christian than I have ever been or probably ever will be in my life. Way beyond me. Way beyond me. As she was dying, you know, she was saying, God has blessed me so much. She died at 61 years old of brain cancer. God has blessed me so much. God has given me so much. There was no point of, like, why me? Why, Why? I was expecting 20 some more years with my husband and my children and grandchildren. You know, she didn't say any of that stuff. She said, God has blessed me so much. And she said to everyone who came to her, God is. He's speaking to you and has something for you to do. That's the way that she died. When she came home to spend her last couple days, she said, I came home and she said, I know what I'm here to do. That's what my father told me. She said, I know what I'm here to do. And I was with her in some of the days leading up to her death. And so when I look at the love of Christ that my mother has, I can't look at that and say, well, she didn't join the right team. You know, I'm sorry, right? But I also cannot say, you know, it's totally cool not to make use of the great gift that the apostles gave. Ultimately, God judges each person based on what they do with what they know, right? And what someone truly knows is known only to them and God actually more to God than even to them. Some people might, for instance, have orthodox Christianity, present it to them and reject it because of the way that it was presented to them, was in a dark way. We talked about some of those dark ways earlier."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6777.44,"end":6779.2,"speaker":"Fr Stephen De Young","text":"Twitter, Twitter."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6783.83,"end":6786.67,"speaker":"Fr Andrew Stephen Damick","text":"It'S called X. Oh, you could always tell. You could tell the Elon Musk fans."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6786.67,"end":6787.59,"speaker":"Fr Stephen De Young","text":"In the room, you mean X?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6787.59,"end":6886.34,"speaker":"Fr Andrew Stephen Damick","text":"It's X. It's X, bro. Sorry. He says as he drives his Tesla up to the Kentucky village. Elon Musk is a weird guy. I mean, he might be, I don't know, but. Right. You know, my great uncle, when he died, no one was there for him. No funeral. The state had to hire a funeral home to put him in the dirt because no one was there for him. And, you know, 30 years after he died, my father, my uncle and I bought a gravestone for him and a friend of mine who's a priest, another priest, we came and we did a funeral for him 30 years after the fact, standing on top of the plain place that I had to find through research, you know, because I believe that prayers for the departed are effectual. I don't know exactly what way or how or whatever, but we had to do again, I got the blessing from my bishop to do the funeral service for a non Orthodox person. As far as I know, my great uncle had been baptized Lutheran. I'm not really sure about that. But yeah, these distinctions are there. And the distinctions are there for the living. That's why they're there. They're there for the living to say, this is what you should be doing. Today is the day of salvation. You have these tools, use them, you know. So I do believe everybody should be Orthodox. Absolutely, absolutely. Why? I couldn't imagine living outside of the Orthodox Church. Never, never, never, never. Abuna."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":6888.09,"end":7140.17,"speaker":"Fr Stephen De Young","text":"Matata. No. I don't know why I find that so funny. So, yeah, I think the church's practice on this is read in a way that seems intuitive, but I think if we press, it becomes counterintuitive. What is, what does St. Paul say in Romans 2 when he's talking about the relationship of the Jewish people and Gentiles to salvation? Right? He says, you know, yes, the Jewish people have the Torah, but a gentile who doesn't have the Torah, but who does the things that the Torah demands of him, is in better stead than the Jewish person who has the Torah and doesn't keep it. And he says, you know, the person who sins under the Torah will perish under the Torah. The person who sins without the Torah will perish without the Torah. And then, but then the, the question, the rhetorical question he poses, because St. Paul's always posing these rhetorical questions, objections, is, well, then what advantage is there that the Jewish people have? And he says, everything in every way, right? They have the Torah, they have the commandments, they have the promises, they have the covenants, they have the prophets, all of these things, meaning they have all of the, like Father Andrew said, all the tools, all the guidance, right? You want to live a life pleasing to God, here's how to do it. Here's a lot of good and bad examples of people who have done it and have failed to do it. Here's what that looks like. But that doesn't mean that they all find salvation and all the gentiles just go to eternal condemnation automatically. And here's what I mean by when we apply that the church, the way we look at it becomes counterintuitive. The fact that the church prays for its deceased members and the forgiveness of their sins and their entrance into glory means that the church is confessing every time we do that that just identifying as an Orthodox Christian, just getting baptized in Orthodox Christian is, is not your e ticket to sainthood by itself. That in the same way St. Paul is talking about the Orthodox Christian has all these advantages. Part of that is now being more culpable, being more responsible. And so the church's practice is to sort of pray for our own, the members of our own community who pass away. And we leave those outside to God. We trust them to God. God is the one who's going to judge them, not me. Right. God is. And I have told people this parish counseling a thousand times who have loved ones who have died. You know, forget about just they weren't an Orthodox Christian. Like, they weren't a Christian. They weren't anything. They were hostile to God in any form he ever took. Right. Ultimately, you have to be able to say, I trust God with this person more than I trust the world with this person. And that's who it's up to. And so the accommodations that Father Andrew talked about are accommodations to our modern life. Right. 300 years ago in Russia, there weren't people with like Protestant family members. This wasn't a phenomenon in the church's life. You know, everybody in the village was Orthodox. So anybody in the village who passed away, you did memorials."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7140.17,"end":7140.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7142.33,"end":7216.39,"speaker":"Fr Stephen De Young","text":"But we're accommodating to this now to allow for more. But the core of it is that the church prays for her own and by that testifies that. And I've thrown this challenge out many times. I'll do it again. Show me one church father who says Christians go to heaven and non Christians go to hell, and I'll show you every single church fathers warning Christians that they're going to hell. That's who they're preaching to. There's a journal article that a Jewish scholar wrote about the Gospel of Matthew called Hell is for Christians, pointing out that everywhere St. Matthew's Gospel talks about somebody going to eternal condemnation. It's a follower of Christ. It never talks about those random Gentiles over there and what's going to happen to them. And so that if we take that seriously, heightens our level of concern to pray for our own and the responsibility they have for what they've been given."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7216.95,"end":7292.86,"speaker":"Fr Andrew Stephen Damick","text":"You know, one thing I want to add before we go to our second break to that which has occurred to me a lot lately, and I've been really Contemplating this and trying to meditate on what it means in the Book of Jonah. Jonah is sent to the Ninevites to preach doom and gloom to them. Basically tell them, you know, so many days Nineveh will be overthrown. And they repent in response. And God does not destroy the city. And they are held up in the Gospels in some of these same passages, actually that were being mentioned earlier about generations by the 6 foot 8 man that's very tall, very tall. They're held up as actually a witness against the unrepentant generation Jesus is talking to. In other words, these people are better than the people that are listening to Jesus at that moment. Here's the interesting thing. You read the Book of Jonah, you get to the very end and we all remember the very last words. And also, much cattle come to Holy Saturday, everybody. Yeah, you read the whole. The reading is the book of Jonah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7293.34,"end":7295.26,"speaker":"Fr Stephen De Young","text":"They still say from, though. That's what's funny."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7295.26,"end":7296.3,"speaker":"Fr Andrew Stephen Damick","text":"I know from the book of Jonah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7296.3,"end":7296.86,"speaker":"Fr Stephen De Young","text":"It's from the book of Jonah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7296.86,"end":7298.06,"speaker":"Fr Andrew Stephen Damick","text":"It's not from the book of Jonah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7298.22,"end":7299.42,"speaker":"Fr Stephen De Young","text":"It'S the book of Jonah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7300.22,"end":7375.83,"speaker":"Fr Andrew Stephen Damick","text":"The reading is the book of Jonah. You read to the very end of the book of Jonah. It does not say, and they all got circumcised and became Israelites. So what does that mean that the Ninevites are at the end of the Book of Jonah? They're still pagans, they're still idolaters, they're still worshipping demons, and yet they repent. And God honors their repentance and uses it as a witness against unrepentant people who have the Torah, who are circumcised, who eat the Passover. Right. So that's interesting to me because it means that God specifically honors the repentance of a pagan people, of a people who are outside of the people of God, which means that repentance is repentance, even if it's coloring outside the lines. Now, I don't have a theology of that. Like, I don't have a system that I could say, now it works in these cases and not in these, and blah, blah, blah. I don't have that. But I can just point to it and say, well, that's definitely a thing. It's totally a thing. Repentance is repentance."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7375.83,"end":7379.83,"speaker":"Fr Stephen De Young","text":"God doesn't play by any rules you can come up with, right? To govern his behavior."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7379.99,"end":7407.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly, exactly. So, yeah, thank God, he's way more merciful than we are, you know, so that's what I have to say about that we're going to go ahead and go to our second break. Thank you very much for your question. Ten minutes. And we'll be right back with the third and final half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7412.8,"end":7416.16,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7416.16,"end":7417.8,"speaker":"Fr Andrew Stephen Damick","text":"To take your calls on the next."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7417.8,"end":7433.52,"speaker":"Fr Stephen De Young","text":"Part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO, new from Ancient Faith Publishing."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7434.08,"end":7487.5,"speaker":"Fr Andrew Stephen Damick","text":"Arise, O God, the Gospel of Christ's Defeat of Demons, Sin and Death, written by Andrew Stephen Damick. This book is not a sales pitch. I hope that instead it will be an authentic, true proclamation of the gospel. How or whether you respond to it is important, but I'm not going to make a marketing appeal to you at the end. Knowing what the gospel is and being able to teach it to someone else does not require that you know everything in this book. But by the end of it, you should know what a gospel is, why there is a gospel at all, what the gospel is and what the response to it requires. Arise, O God. The Gospel of Christ's Defeat of Demons, Sin and Death now available as an audiobook@audible.com."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7488.31,"end":7504.15,"speaker":"Fr Stephen De Young","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7507.27,"end":7527,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of the Lord of Spirits pod and it's way past Father Andrew's bedtime. I have four children, all right. Means every tiny moment of sleep is like a pearl, you know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7527,"end":7532.48,"speaker":"Fr Stephen De Young","text":"See, I would go the opposite way. I would try to outlast out, think, survive."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7532.64,"end":7633.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So because it is past Father Andrew's bedtime, Father John in the back is going to be our last question for the night. We have this young man here maybe. Yes. So basically the people that were in line a moment ago, they are the people. So we don't have anything, any particular content to deliver here at the top of this half. So you, sir, are up. Thank you. Hey, Fathers, my name is Chris. I am from Dallas, Texas, and I have a question. Before the break, we were talking about Orthodox Christians and non orthodox Trinitarian Christians. I am an aspiring ecumenist. I've been studying denominational studies and I've read. Yeah. About that. I've read Orthodoxy and heterodoxy. I've got a long way to go. But my question Basically, is this across the whole spectrum of Trinitarian Christianity? There's obviously a lot of division that's keeping us from being in communion with each other. Yep. You've talked on the show about a spirit of a people or a nation or a place, and the United States claims to be a Christian nation. But there is obviously some dramatic misalignment in our behavior. Given our many divisions, is it even possible for heterodox Christians to work together to bring about the glory of God through Jesus Christ in this country? Short answer. Wow. Someone else, someone over here has the answers."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7633.27,"end":7636.51,"speaker":"Fr Stephen De Young","text":"Okay, I'm supposed to be the harsh one. I know. No."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7637.47,"end":7796.8,"speaker":"Fr Andrew Stephen Damick","text":"Short answer yes. So I'll say this. Is it possible for orthodox, for heterodox Christians to get to together and do stuff for the glory of God? Yeah. I mean, take any food bank anywhere in America, take any crisis pregnancy center anywhere in America. That is for the glory of God. Right. I mean, these people are doing. Those are the works of God. Right. And most of the people running those things are not orthodox. Tell you that right now. They put us to shame. But I also want to say, since you said that dirty word, ecumenism, you know, the pan heresy of ecumenism. Who's heard that phrase before? Yes, yes. The dark, dark pan heresy of ecumenism. So this is the worst word ever because no one says what they mean by it. I don't know exactly what you mean by it, but I mean, I can guess. But here's the thing. People use that word to mean things like Christians should talk to each other. If that's what it means, then I am an ecumenist. People use that word to mean things like Christians should do useful things together. Like the stuff that I just named. If that's what it means, then I am an ecumenist. People use it to mean things like Christian churches should merge together and forget about their theological differences beforehand. If that's what it means, then I am not an ecumenist. People also use it to mean eventually someday all the churches are going to merge because that's just the way that it is. If that's what people mean, then I'm not an ecumenist. Right. That's the problem is it gets thrown out and people, you know, line up behind it or against it without defining exactly what it is that they mean. You know, it's funny, like people ask, I mean, the question you asked is a good question. You know, like, can you said, can heterodox Christians do these things together? I mean, part of Obviously, the implied question is, can Orthodox Christians do those things with heterodox Christians? And I mean, like, so which one of you has a job? Which one of you who are Orthodox works a job where you work with non Orthodox people? Yes, most of you. Which means that, and God willing, you're doing something constructive with your time. Don't tell me if you have a useless job. I don't want to know. They do exist. Mostly government funded. Sorry, sorry, that was a low. That was a cheap shot, but true."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7798,"end":7800.72,"speaker":"Fr Stephen De Young","text":"You're not the one from New Hampshire either. That's the weird thing."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7802.56,"end":7935.97,"speaker":"Fr Andrew Stephen Damick","text":"But, I mean, we're all working with people from. From other religious groups all the time to God willing, do something good and constructive. Maybe we don't do it under a religious label or banner, but, like, that's the actual reality on the ground. Are we supposed to. I mean, people say we shouldn't work together. I mean, very few people say this, but there are some who do. We shouldn't work together with non Orthodox people. I'm like, okay, are you going to quit your job? Are we supposed to, like, you know, crawl into little sectarian compounds and that's what we're going to do. I mean, there are religions that do that. Like, that's totally a thing. I mean, welcome to Pennsylvania. People have tried all kinds of religious stuff in Pennsylvania and still are, you know, So, I mean, this is a reality. And I'm not saying it like it's reality. Like, well, we just have to accept this. Like, no, like, engage the world, for crying out loud. We're supposed to be whatever kind of Christian you are. We're supposed to be transforming the world for Christ. You can't really do that if you're like, nope, nope, nope, nope. You must come and prostrate on the edge of my drawbridge and stay outside the moat and repent a thousand times, and then I will let you in and talk to you. Come on. That's not how this thing works, right? Like, where's the love? So, yeah, I mean, this is one of my big soapboxes. There is a way to engage with people without compromising. There is a way to engage and keep your integrity. You don't have to pick polemic or compromise. Like, those are not the only two options. You can engage and keep your integrity and be who you are. Jesus talked publicly with a Samaritan woman. I mean, so many layers. Yeah. Gasp. Clutch those pearls, everybody. You know, like, the Lord did that and he's perfect. So that's what I think you Want to add anything."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7935.97,"end":7939.02,"speaker":"Fr Stephen De Young","text":"So this is one of the places where he and I kind of disagree."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7939.02,"end":7939.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7940.06,"end":7949.1,"speaker":"Fr Stephen De Young","text":"And really, at this point, the show, we despise each other. I don't know if you can tell. I know there is this thinly veiled contempt between the two of us."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7949.1,"end":7956.94,"speaker":"Fr Andrew Stephen Damick","text":"There is this great meme that exists on Twitter that's about how, like. Like we actually are really hate each other."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7956.94,"end":7957.38,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7957.38,"end":7961.62,"speaker":"Fr Andrew Stephen Damick","text":"And like, he's required to have me on, like, people look. Making him have me."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":7961.62,"end":8138.15,"speaker":"Fr Stephen De Young","text":"People look, look for clues. I know, like, things I say where they're like, see, he let it out. He can't stand Damick. Like, like, trust me, I will voice my contempt for the man. You don't have to read between the lines. The. But. Yeah, so. But to me, this is. Why are we talking about. Why are we limiting this and talking about other Christians or other Trinitarian Christians? That's rhetorical. You don't have to argue with me about it. But that's the way it gets framed. Right. And if I'm going to start a soup kitchen, why can't I have Jewish people and non religious people working there? Right. And let's be honest, what does trinitarian even mean? Now William Lane Craig is going around saying that Jesus is like a cat skeleton. I'm not joking. Because a cat skeleton has the feline nature, but it is not in and of itself a cat. Wow. And this person is a Trinitarian Christian. Right. Like, I don't see how he has more in common with me than a Mormon. I honestly don't. Right. Like Muslims and some Jewish people hold to more Christian distinctives than William Lane Craig. Historically, in terms of historic doctrine. Right. And so. And I think when we've done this thing of, okay, well, we're gonna form this Trinitarian Christian club or this Christian club, and we can do things together, but these other people can't. I think that's where people's antennae go up because they're saying, well, wait a minute. What are you saying we have in common with William Lane Craig? Or pick your other person that we don't have in common with my neighbor who's just kind of not religious but wants to go out and help people and do good in the world. Right. Now, obviously, I want all those people to become Orthodox Christians. Right. Ultimately, I think that's the best way to go. I'm an Orthodox priest, so you probably could guess that. Right. But you know, the Pope thinks you should be Catholic. I don't know if you know this. I Mean, he's not. But. But he thinks you should be. Right? Right, But. But. So. Right. Do you see my point?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8138.15,"end":8138.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8138.47,"end":8176.72,"speaker":"Fr Stephen De Young","text":"My point is, I think we can. We. We need to just be more open to other humans who disagree with us in all kinds of varieties of ways and trying to do good in the world together. And part of that, hopefully, if we believe that we have the fullness of the truth, if we've got the turkey dinner for Thanksgiving and other people have the turkey sandwich. Right. That part of us working alongside each other is that maybe they'll develop an appetite and come over into our dining room. Right. But, yes, it doesn't have to. And that's neither polemic nor compromise."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8176.96,"end":8177.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8177.28,"end":8202.71,"speaker":"Fr Stephen De Young","text":"But I think it's the. When we try to adjudicate, how close to orthodox Christianity is close enough, or what are the things you have to believe and what are the things that are negotiable and what are the practices that you have to have and what are negotiable? That's where it starts entering into this dangerous territory where the Christian faith starts to get reduced and boiled down to something that becomes less recognizable and people get worried."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8204.55,"end":8207.35,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. I disagree with all of that now."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8207.43,"end":8210.79,"speaker":"Fr Stephen De Young","text":"Okay. I mean, you're wrong, but."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8213.75,"end":8223.65,"speaker":"Fr Andrew Stephen Damick","text":"I literally agree with all of that. All right. Good evening. My name is Ed. I'm from the uk, so forgive me if I stumble over my words in."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8223.65,"end":8228.97,"speaker":"Fr Stephen De Young","text":"This because it's about three in the morning. From my point of view, can you understand our thick American accent?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8228.97,"end":8237.01,"speaker":"Fr Andrew Stephen Damick","text":"This is the other issue here, is there's this language barrier question. So, Ed, didn't I meet you? We did. We did. In Kent. We did. Good."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8237.01,"end":8238.01,"speaker":"Fr Stephen De Young","text":"Very good. With memory."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8238.01,"end":8309.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. So my question, I had about six that I reduced into one. Just less interesting. So in the Quran, it's an orthodox, the construction of the temple. Solomon calls Jinn to help him out. And you get kind of other interesting ideas within Christian tradition, not on that topic itself, but for. In the voyage of St. Brendan, he goes to an island where I think they're birds that are angels that didn't choose God and they didn't choose wickedness. So they're kind of this neutral zone, right? They kind of sit in the middle and they. I think they have once a year they can sing or something like that. And Jin, some of the scenes, he's kind of like halfway. They're neither kind of good, but they're neither evil necessarily. So my question is, is this just kind of a fun idea or is there anything within the Christian tradition to kind of talk about a sense of kind of maybe neutral is the wrong word, but intermediate, perhaps, or kind of mercurial."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8311.19,"end":8312.79,"speaker":"Fr Stephen De Young","text":"Spirits, those kind of ideas."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8312.95,"end":8319.27,"speaker":"Fr Andrew Stephen Damick","text":"Does that make any sense? Yeah, yeah. Neutral spirits. Father, we get this. Every so often people ask about this question."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8319.83,"end":8321.67,"speaker":"Fr Stephen De Young","text":"True neutral, not chaotic neutral."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8323.27,"end":8323.75,"speaker":"Fr Andrew Stephen Damick","text":"Correct."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8326.64,"end":8434.42,"speaker":"Fr Stephen De Young","text":"Yeah. So, I mean, I think every created thing has some relationship or other with its creator. Right. You can't sort of opt out of that. You can't be sort of neutral on God. Right. And so I think that kind of has ruled out, for the most part, that kind of idea within most of the Christian tradition. There's always exceptions, Right. Traditions here and there because of that. Because of this idea. And why would that be problematic such that we'd have to rule out that kind of speculation? Well, because it might imply that it's possible for a human to somehow be in some kind of neutral state toward God. Right. Which is pretty clearly not the case. Right. We're either following God's commandments, we're either faithful to God, or we're not. Not just on a whole, but moment to moment and all of those things. So, I mean, in terms of speculation, like, I don't think this is like heresy. Right. But I think the reason it's kind of excluded is because of this idea that. No, we have to, you know, Joshua, the prophet Elijah. At a certain point, you have to choose who you're gonna serve. Right. God or someone or something else. Yeah, you got to serve somebody."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8434.42,"end":8467.91,"speaker":"Fr Andrew Stephen Damick","text":"You got to serve somebody. The one thing I'll add is that sometimes the idea of neutral spiritual forces exist within stories for the sake of the shape of the story. Right. It works within the story in a particular way without necessarily being some kind of commentary upon the way things really are. Right. I mean, there are also stories. Isn't there some second Temple Jewish stuff about Solomon using a magic ring to command demons to build his temple? Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8467.91,"end":8468.19,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8468.19,"end":8498.11,"speaker":"Fr Andrew Stephen Damick","text":"Like, it's demonstrating a lot of that kind of stuff. Yeah. You know, so the stories can get. The same story can get told in multiple different ways, you know, so just because something is depicted in a particular story in a certain way doesn't mean that that's how it truly is, but it might work within the story. Story in a particular way. So I hope that helps. That's great. Thank you. All right. All right, next. I'm Tom from Alabama, and my question concerns Psalm 82 in the Greek numbering. Of course, because we're all orthodox, we."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8498.11,"end":8499.19,"speaker":"Fr Stephen De Young","text":"Know this numbering better."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8499.75,"end":8512.54,"speaker":"Fr Andrew Stephen Damick","text":"But it describes a conspiracy, and my translation uses conspire I mean, that's the word. But of all these different pagan nations, essentially against Israel. And it names them out the tents of the Ishmaelites, Gebel and Ammon and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8512.54,"end":8514.58,"speaker":"Fr Stephen De Young","text":"Amalek, conforms to the dual tyre, etc."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8514.58,"end":8517.18,"speaker":"Fr Andrew Stephen Damick","text":"Etc. And first of all, unless I'm like."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8517.18,"end":8520.98,"speaker":"Fr Stephen De Young","text":"Terribly mistaken, there's not a point in the Old Testament where all the named."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8520.98,"end":8523.18,"speaker":"Fr Andrew Stephen Damick","text":"Nations just, like, get together, form a."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8523.18,"end":8525.18,"speaker":"Fr Stephen De Young","text":"Conference in, like, the Swiss Alps, like."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8525.18,"end":8530.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're taken for ourselves as inheritance, the sanctuary of God. We got to get it done by."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8530.5,"end":8532.9,"speaker":"Fr Stephen De Young","text":"Such and such a date. But second of all, none of the."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8532.9,"end":8539.11,"speaker":"Fr Andrew Stephen Damick","text":"Nations named exist anymore at all, right? There's no Gebal, unfortunately."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8539.51,"end":8549.35,"speaker":"Fr Stephen De Young","text":"I looked on the map. It's not there. But so. But obviously it's still, like, there in the Psalter. You can find it if you pray it. Etc."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8549.35,"end":8549.83,"speaker":"Fr Andrew Stephen Damick","text":"Etc."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8550.15,"end":8682.96,"speaker":"Fr Stephen De Young","text":"So, like, what's the psalm about? What are the nations named about? Because it's perplexed me for quite a while. Psalm 82. Know anything about this? Yeah, Greek 82, yeah, Greek 82. Hebrew 83, yeah. So, yes, you are right. They mostly do not exist anymore. If you go through the prophets, you'll find that there are specific prophecies dealing with each of those nations. So these are all nations that, at various points in Israel's history, threatened Israel's existence. Right. First one being, of course, Amalek, right? The Amalekites, who literally tried to attack at Sinai. Right? Giants, yeah. And Amalek becomes sort of the badge for the spirit that wants to destroy Israel. Right? So when you read Esther, right, all of a sudden you run into another Amalekite and you're like, wait a minute, I thought David killed off the last few of those, right? But that's because it becomes this sort of potent symbol. And so the idea there is it's sort of like getting together every enemy you ever had, right? It's like the Sinister Six, if you will, Right. I'm sorry, I don't know. Or the Injustice Gang, or the. Who do we need to do? The Crime Syndicate of Earth 3 kids need to read more comic books. I don't know where to go with this. The Legion of Doom. Yeah, right. Sort of all of the enemies, all the villains all get together, right? And all come to threaten. And even in that case, right, even in that case, Israel is not defeated. Why? Because of God, Right? It's sort of imagining the worst thing that could possibly happen. What if they all teamed up, right? Like, everyone who ever threatened our existence all got together."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8684.8,"end":8685.2,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8685.92,"end":8692.85,"speaker":"Fr Stephen De Young","text":"And the answer is no even then. Right? That makes sense."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8692.85,"end":8693.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8694.33,"end":8695.05,"speaker":"Fr Stephen De Young","text":"You're welcome."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8696.73,"end":8700.41,"speaker":"Fr Andrew Stephen Damick","text":"Is the psalm about Star Wars? Because it says they all perished at Endor."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8701.77,"end":8704.85,"speaker":"Fr Stephen De Young","text":"It does. He always says they should."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8704.85,"end":8709.41,"speaker":"Fr Andrew Stephen Damick","text":"He requests that. Yeah. Yeah. What are Ewoks? Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8709.41,"end":8709.77,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8715.37,"end":8754.66,"speaker":"Fr Andrew Stephen Damick","text":"Hello, I'm Yelena Grove. I'm from Detroit, Michigan. My question is about Halloween. Trick or treating, mermaids and unicorns. Because I have four daughters, and there's unicorns and mermaids on all the T shirts, you know, and after listening to your Halloween episodes, but honestly, not the whole monsters of Halloween, that one really freaked me out. I kind of got the gist, and I went with what I needed to know. So it kind of seems like if you're wearing mermaids and unicorns, you're just kind of wearing something that's demonic, that's dressed up, and it's everywhere. And it seems like that'd be a."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8754.66,"end":8756.14,"speaker":"Fr Stephen De Young","text":"Good farce for the devil to get."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8756.14,"end":8818.99,"speaker":"Fr Andrew Stephen Damick","text":"Us to parade in it. I don't know. That's part of the question. The other one is my family has recently converted to orthodoxy at Pascha this year. And, you know, when I was a kid, we didn't do Halloween because my mom was Pentecostal, and Halloween wasn't something that you did then. She allowed us, and we've been trick or treating ever since with my kids. But Halloween's gotten really. It's kind of been freaking me out, too, lately, because you see these giant skeleton sculptures in people's yards, which just makes me think of the giants. Whether they needed to be that big is irrelevant. But thank you. I was listening. But I find it interesting that some people say that just by participating in trick or treating in Halloween, you're being. You're saying it's okay by, like, affirming it by participating. And some people say you're just dressing up in Halloween costumes. Some say you can dress up in Halloween costumes as long as you're not dressing like a vampire. Bats are okay. I had to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8819.31,"end":8826.72,"speaker":"Fr Stephen De Young","text":"Bat men and women and girls, yes, but not bat boy. No, There is no such thing. Weekly World News."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8826.72,"end":8827.36,"speaker":"Fr Andrew Stephen Damick","text":"Robin."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8827.68,"end":8828.72,"speaker":"Fr Stephen De Young","text":"Robin, my friend."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8829.28,"end":8859.67,"speaker":"Fr Andrew Stephen Damick","text":"So the Orthodox world doesn't seem to have a conducive stance on trick or treating. Halloween kind of seems to be something that we all agree is kind of bad. But, see, even then, I'm not sure what everybody believes. So it's kind of hard because it seems like it goes from parish to parish, priest to priest, so. And also, you know, unicorns and mermaids everywhere. So. All right, so, I mean, orthodox Halloween Is usually in June. I have heard that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8862.07,"end":8863.07,"speaker":"Fr Stephen De Young","text":"July next year."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8863.07,"end":8875.99,"speaker":"Fr Andrew Stephen Damick","text":"Because All Saints. Yeah, it's late next year. Yeah. Because All Saints day is, you know, the Sunday after Pentecost. And I always tell people on that Saturday night vespers is like, who's going trick or treating tonight? Confuse your neighbors."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8882.8,"end":8883.52,"speaker":"Fr Stephen De Young","text":"One of these days."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8887.04,"end":8916.88,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, I grew up evangelical and in the 80s, you know, with the whole Satanic panic thing, I. Let me just say, by the way, there is a man here who gave me a complete set of all imprint Jack Chick comics. I know, what a gift, right? But, but, but Dark Dungeons is out of print. If someone would like to give me a copy of Dark Dungeons, I would."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8916.88,"end":8918.12,"speaker":"Fr Stephen De Young","text":"The movie is on YouTube."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8918.12,"end":8929.79,"speaker":"Fr Andrew Stephen Damick","text":"The movie's on YouTube. It's amazing. By the way, I will, in exchange for that, if you give me that, I will give you a signed copy of any one of my books. So if you want to give me a copy of Dark Dungeons, I'll give you a signed copy of anyone."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8930.1,"end":8930.5,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8930.66,"end":8942.42,"speaker":"Fr Andrew Stephen Damick","text":"So. But all of that is to say that I grew up with that whole satanic panic thing. Anybody remember Mike Warnke? Yeah, Mike Warnke, the Satan seller."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8942.42,"end":8946.66,"speaker":"Fr Stephen De Young","text":"He was my Facebook friend until I left Facebook. I know, he really was."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8948.58,"end":8967.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Mike Warnke, you know, claimed to be like some sort of Satanist high priest. All this kind of thing he was exposed by. Was it Christian century or Christianity today? I can't remember which. Tornerstone cornerstone. That's right. Yeah. It turned out to. Actually he eventually got himself ordained a bishop by some Episcopal vagans."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8969.45,"end":8970.65,"speaker":"Fr Stephen De Young","text":"What I know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":8970.65,"end":9073.75,"speaker":"Fr Andrew Stephen Damick","text":"Is that crazy cool. I mean, not in a good way, but I mean, the idea behind the satanic panic, a lot of it was this notion that there is this sort of secret taint out there. And if you involve. If you touch anything that's involved with a secret taint, then it's going to drag you in with its claws. Like wearing a unicorn on your T shirt means you're participating with behemoth, right? Like, that's how you would have to interpret that, you know, so here's the thing. Like, the question for me is, is the thing that I'm doing set aside any of that sense of like, you know, secret taint, Right? Because the question is, is the thing that I'm doing good or bad? Right? Like, is it good or bad to go from one house to the next and ask for candy? I mean, is that good or bad right now? I mean, your neighbors might give out bad candy, but, like, I don't see how this is a question of good or evil in and of itself, Right? That, like, if I do this thing, then that means I'm participating in the whole set of everything that Halloween is and does, but everyone's doing everywhere. Right. Which is sort of the way that the whole satanic panic idea works. It's kind of the cooties theory of spirituality. Everything's got cooties, and if you touch this, then you've got it, too, you know?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9073.91,"end":9077.83,"speaker":"Fr Stephen De Young","text":"Unless you make a cootie catcher and then you can."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9077.99,"end":9114.48,"speaker":"Fr Andrew Stephen Damick","text":"You can catch them all. It's a cootie. Yeah. Right. So for me, I mean, for me, the question is, what is the action? Is it good or bad or indifferent or whatever? I mean, I don't believe in anything that's truly indifferent. But is this moral or is it immoral? Is it moral or immoral to dress up in a costume? Well, what kind of costume is it? Because there's some costumes that are just someone's putting on. Why is no one wearing a bad costume? I almost brought one. You brought one?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9114.96,"end":9115.36,"speaker":"Fr Stephen De Young","text":"Almost."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9115.36,"end":9118.16,"speaker":"Fr Andrew Stephen Damick","text":"It was my daughter's. But you don't know that. I'm not."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9119.76,"end":9120.48,"speaker":"Fr Stephen De Young","text":"Okay, okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9120.48,"end":9125.32,"speaker":"Fr Andrew Stephen Damick","text":"I'm just throwing that out there. Yes. If you do. If you did bring a costume, please do not wear it to church."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9125.32,"end":9125.76,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9131.04,"end":9362.49,"speaker":"Fr Andrew Stephen Damick","text":"Unless it's the French word costume, which means a suit. So, you know, the question is, what is the thing? Not, what is some association with this thing? Now, related to this also might be, like, if you have Pentecostal family for whom any kind of participation in this is deeply evil, right? And you put this in front of them, knowing that that's how they feel about it, that's bad, right? Like, I'm gonna flaunt. I mean, St. Paul actually talks about this, right. I'm gonna flaunt my freedom in front of you, you know, and make you stumble. Like, don't do that. Right? So, like, if people say, is it okay for my kids to do Halloween? I'd be like, well, what do you mean by that exactly? Cause there's a lot of different things that people do in relation to that. I mean, the Halloween thing to do is to go and pray for your departed family. Because that's what All Hallows Eve is about as an actual religious holiday. Because it is a religious holiday. It's a Catholic religious holiday. You know, that's where it comes from. All Hallows Eve. It's the night before All Saints Day or All Souls Day. Saints Day. Now, there's also an element of Halloween. We covered this in Our very first Halloween episode. There's actually an element of Halloween that is actually about mocking demons and their defeat by Christ. That's an element that's there, right? That. That's where this stuff actually comes from originally. So, you know, I'm a parent. I have four kids, right? So for me, the question is, you know, whether the thing that I'm. I'm letting my kids do is good or bad in and of itself. And also, like, how does. What does this do with relationships that they're involved in that our family is involved in? How is that affecting our relationships? Good, bad, indifferent, whatever. You know, those are the questions. Not, does this thing have Halloween cooties? You know, because that's what it comes down to. And sometimes people will say, well, if you eat a whole pack of Skittles and one of them is poisoned, then you're dead. You know, like, well, that's not how this works. Maybe it works with skittles. I do not like Skittles. You know, that's true. Right, But. But, like, if you listen. Let's say you listen to someone give a speech and they say one thing in it that's wrong, but everything else in it is right, does that mean you've been poisoned? No, it means you heard a wrong thing. You know, which. You can filter that out, right? So, I mean, that's my opinion as a parent myself, and as someone raised with the idea off and on. My parents, frankly, were not super consistent about the question. It's interesting, but raised off and on with this idea of like, no, we don't do Halloween. You know, I mean, it's something, I think that each parent needs to judge for him or herself within the matrix of their community and their relationships and. And what they're personally comfortable with. Like, if you feel like Halloween cooties are real. Like, if you feel that even if maybe intellectually you're like, okay, I'm maybe tracking you, Father. If you feel like it's real, then maybe you shouldn't do it, because then you're violating your own feeling that feels like conscience. And I wouldn't tell people to go against a feeling that feels like conscience unless it's an actual moral imperative. Like, if someone says, I feel that going to confession is wrong. Like, no, no, you need to get over that, because going to confession is right. You know, but, like, I feel like trick or treating is wrong. Then don't do it. You don't have to do it. It's not like anyone. God did not say, thou shalt trick."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9362.49,"end":9367.05,"speaker":"Fr Stephen De Young","text":"Or treat, you know, trick and. Or treat it would be in that case."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9367.93,"end":9368.81,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9370.65,"end":9374.89,"speaker":"Fr Stephen De Young","text":"So while Father Andrew here clearly wants to promote child vagrancy and panhandling."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9379.32,"end":9381.12,"speaker":"Fr Andrew Stephen Damick","text":"Look, it's 11 o' clock at 9 now."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9381.12,"end":9384.76,"speaker":"Fr Stephen De Young","text":"He wants the Reese's dead crimes in many jurisdictions."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9391.08,"end":9393.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think so."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9395.24,"end":9539.23,"speaker":"Fr Stephen De Young","text":"Looking at this on a much broader scale, at some point we have to accept that we live in a world where five companies own everything and they're all evil. Right. And I think there is a danger. I think this is honestly something that's being used to distract us because we have this good instinct where we say, like St. Peter says, I need to keep myself pure from this present world. Right. I need to be holy. I need to live a holy life that's set apart. But the temptation, the distraction that comes in is focusing on that in kind of an external way. Right. And what do I mean by an external way? Well, so I'm not going to buy this particular brand of this at the grocery store, right. Or I'll only let my kid dress as this. And not that. I mean, obviously they shouldn't be dressing like the devil or anything pornographic, right? But I mean, you know, these kind of external things and we become so focused on remaining pure in those ways that we lose out on the real core of our holiness and purity because our efforts get misdirected. We're spending so much time researching, well, what company owns this and what do they do and how. What kind of medical research have they been involved in? And you know, who did they hire back in the 1950s who came from Central Europe and. Right. And we get all wrapped up in that. It's a similar thing thing to what we do as orthodox people a lot with fasting, right. A fast period starts and we spend like hours and hours looking to see if like whey protein is the 18th ingredient on the back of something and go, no, no dairy products. Right. And we end up spending more time and more money thinking about food than we ever have before and kind of defeat the whole purpose of fasting. Right? And so I think it's important to kind of refocus and say, right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9542.11,"end":9542.43,"speaker":"Fr Andrew Stephen Damick","text":"What."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9542.43,"end":9592.98,"speaker":"Fr Stephen De Young","text":"Are my kids learning by what we're doing and how we are or aren't celebrating Halloween? When I was a kid, celebrating Halloween was my dad being Dutch, didn't want to give away anything. So we turned off all the lights so we'd get. And then. But then we got together as a family and we drank apple cider and we ate powdered sugar donuts. And my dad told this corny going on a lion hunt story, right? Where he went rawr at the end and scared all the little kids. Right. And that's like a wholesome time, Right. You know, and it was this sort of family, but I think we all looked forward to. We didn't wear costumes."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9592.98,"end":9593.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9593.22,"end":9605.46,"speaker":"Fr Stephen De Young","text":"You know, and so I think that's the core is what are the kids learning from what we're doing or not doing. Right. And as long as that's good."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9606.98,"end":9607.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9607.34,"end":9649.27,"speaker":"Fr Stephen De Young","text":"And there are lots of churches that do things. There are people who go trick or treating it like retirement homes. And the kids put on little cute little costumes and they go around and they interact with the elderly people there who don't get a lot of visitors. And you get half candy and half like nickels. Right. But there's still something good that's happening there in the midst of it. Right. And so I think it's more important to focus on those things than on the am I participating in the evil that's out there in the world? Because you have to to live. Unless you become Amish, which I don't recommend."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9652.79,"end":9661.47,"speaker":"Fr Andrew Stephen Damick","text":"So then we can wear unicorns and mermaids. That's not the equivalent to wearing a devil on your shirt."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9661.47,"end":9669.67,"speaker":"Fr Stephen De Young","text":"If your kid is learning that friendship is magic for the talking unicorns, then that's a good thing, right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9670.31,"end":9670.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9671.75,"end":9678.88,"speaker":"Fr Stephen De Young","text":"If they're to trying drawing pictures of unicorns impaling people and like trampling them, then there's a different discussion, right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9678.88,"end":9682.24,"speaker":"Fr Andrew Stephen Damick","text":"Like that's a fair distinction. Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9682.24,"end":9682.68,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9682.76,"end":9683.8,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9687.64,"end":9691.16,"speaker":"Fr Stephen De Young","text":"Thank you, fathers. My name is Mitch from Cincinnati, Ohio."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9692.68,"end":9696.92,"speaker":"Fr Andrew Stephen Damick","text":"Is there another Cincinnati? There is in fact a Cincinnati, Iowa. Oh."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9697,"end":9698.9,"speaker":"Fr Stephen De Young","text":"The lesser known of the Cincinnati's."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9699.21,"end":9701.61,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sorry. I."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9701.69,"end":9704.97,"speaker":"Fr Stephen De Young","text":"Anyway, named for the great general Cincinnatus."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9706.89,"end":9709.37,"speaker":"Fr Andrew Stephen Damick","text":"My question has to do with, I."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9709.37,"end":9718.65,"speaker":"Fr Stephen De Young","text":"Guess I would say American folk funerary practices. Specifically the practice of like pouring out a beverage at someone's either someone's grave or in their honor."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9718.73,"end":9719.37,"speaker":"Fr Andrew Stephen Damick","text":"Oh man."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9720.57,"end":9749.18,"speaker":"Fr Stephen De Young","text":"It wouldn't have occurred to me until I think it was the gods. Gods of the nations are demons episode. Talking about when someone in a pagan would go and offer a sacrifice or something to a departed general. Now a demon is coming in to intercept that. Is that something we should still be concerned about? And I mean, clearly it seems different than when we do a memorial service and we have koliva. This is something that is different and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9749.18,"end":9750.02,"speaker":"Fr Andrew Stephen Damick","text":"This is part of our."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9751.95,"end":9757.39,"speaker":"Fr Stephen De Young","text":"Blessed ceremony than just going out to someone's gravesite and emptying a bottle of liquor or something."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9758.75,"end":9822.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, certainly. I mean, like, if you read the Odyssey, they pour out. In this case, it's blood, right. To feed, you know, dead spirits and stuff. But there are drink offerings. You know, there are pagan drink offerings, but there are drink offerings given to God as well. If someone goes to the grave of their departed, whoever, and pours out a beer on that, do they understand themselves to be feeding that spirit so that it can persist in the afterlife? Do they understand it to be feeding that spirit at all? I think in most cases, not. They don't think that way. But even if they did, like, the ritual context of what they're doing is. So it's a gesture more than it's an actual, like, true ritual act. I mean, it's a ritual act on some level, of course. Right. But I think in most cases, it's roughly similar to putting flowers on the grave. I mean, I'm not pouring out drinks on graves because, you know, you could drink that. I mean."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9825.77,"end":9827.29,"speaker":"Fr Stephen De Young","text":"Alcohol abuse is wrong."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9828.9,"end":9829.38,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9831.22,"end":9831.86,"speaker":"Fr Stephen De Young","text":"You know."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9834.66,"end":9861.05,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, it's. It's. I mean, yeah, obviously it bears a resemblance to drink offerings, but. And maybe even there's some level of belief that's similar. Like, here's one for you. I know this is your favorite, you know, like. But I don't know. I mean, I just. I don't. I don't think it's equivalent at all. It bears this passing resemblance, I think. I'm not saying to go do that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9861.05,"end":9863.17,"speaker":"Fr Stephen De Young","text":"Yeah. I wouldn't advise taking up the practice."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9863.17,"end":9863.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9863.61,"end":9879.21,"speaker":"Fr Stephen De Young","text":"But I don't think you need to go and dive. Tackle random Irishman. Not just my family. Yeah, you're doing a paganism. No. Thank you, Fathers."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9879.21,"end":9920.95,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right. Father John Katalik here from Canonsburg, Pennsylvania, about an hour away. I've got a little brood of parishioners here as well. God bless them for putting up with me more than anything. You know, in regards to that comment about the pouring a drink out, that's not my question. But, you know, the Serbs actually have the custom you pour half your shot of shlievo onto the grave and you drink the other half as a way of celebrating, you know, with that person continuing to have fellowship and continuous communion with them. I mean, you hang around with Serbs and slivovitz is coming out. Although that's true. I literally just visited a Serbian parish one time, and at the end, the priest hands me just a whole bottle. It's happened to me numerous times, especially when I was."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9920.95,"end":9925.55,"speaker":"Fr Stephen De Young","text":"And he couldn't even tell where it came from like, just reach behind his back and there it is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9925.71,"end":9941.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, yep, yep. Although the Carpath, the Russians have a far more problematic custom. I'm not going to. You know, some of them will throw coins into the, into the, into the grave of the newly deceased as a way to pay for the toll houses. Very messed up theology there. They don't quite understand, but that's okay. God bless you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9941.32,"end":9941.84,"speaker":"Fr Stephen De Young","text":"Don't do that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9941.84,"end":9996.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't do that. I'm not going to tell anyone. I see. Not to do that because, you know. Well, anyway, you know, I got in line to actually ask about Beethoven because you had that throwaway comment, oh, man, this is on you now, bro. You know, but, you know, you kind of addressed it about an hour and a half ago. But ain't no one going to tell me that there's sunk cost policy. You know, I'm just going to power through here. But in all seriousness, you know, when you said that, I don't know, probably two years ago, it made me, you know, think in the sense of I've always encouraged my parishioners to find beautiful things to fill their life with. Right. You know, I remember reading when I was a freshman in college or something like that, Father Seraphim Rose, who, by the way, loved listening to Beethoven and Mozart and Schuber and some others. Mozart, yeah, he loved Mozart."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":9996.07,"end":10001.59,"speaker":"Fr Stephen De Young","text":"I'll just quote what. Well, I can't quote what Beethoven said about Mozart on ancient face airwaves, but."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10001.59,"end":10074.61,"speaker":"Fr Andrew Stephen Damick","text":"In all seriousness, you know, I mean, I was curious as to why it was that you made that comment all that time ago about why, you know, classical music in general and Beethoven in particular is not a good thing. Because, I mean, for example, maybe I'm wrong here, but, you know, recently I was going through a pretty dark time in parish life, a lot of struggles, and I went to a live performance of Beethoven's Pastoral Symphony, which is, you know, as a pastor, a wonderful thing. You know, of course it's a shepherd, not a. Not a metaphorical shepherd of souls. But, you know, I found that very inspiring. Right. The sense of. In this dark place where there was ugliness, there is still beauty in this world that human beings can produce. And of course, we believe as Christians that that is most beautified in and through the Holy Spirit, in our life in Christ and doing beautiful things together. But I am curious, you know, if something is beautiful and inspires others to beauty. I guess, I mean, what's your problem with Beethoven? I guess it's the. And I say that as I'm not even a particular, you know, my favorite classical musician is probably, you know, he's a little pre classical, but I love Handel. I love the Kodak, who's a little later."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10074.69,"end":10075.49,"speaker":"Fr Stephen De Young","text":"There's a difference."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10075.57,"end":10076.57,"speaker":"Fr Andrew Stephen Damick","text":"There is, there's a difference."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10076.57,"end":10077.33,"speaker":"Fr Stephen De Young","text":"Of course there is."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10077.33,"end":10150.69,"speaker":"Fr Andrew Stephen Damick","text":"But I'm just, I'm just curious, you know, and if not that, you know, I do think it's important for our faithful to learn to be grounded in, not in and of itself, human beauty. But I think one of the big challenges we face as modern day catechists is we have people who are coming to us who are just so broken, they don't know what it means to be human, let alone to be a human deified, made holy, made divine. And I think an important step as a catechist is teaching especially my young men who, you know, as many of, many of us priests know right now we have this like, hoard of young men coming into our parishes, you know, teaching them to just be almost, you know, a normal human being first. And I, and I say that as someone who once was, you know, an 18 year old, overzealous convert myself. So, you know, I know, I know that we have to come to this sense of, you know, grounded humanity first. And I think things like classical music are a tremendous tool for us to do that. But if not that, what. And really, I guess I want you to dub a little more deeply, if possible, Father, into what, what you find problematic in classic music generally and Beethoven in particular. You know, Wow, I didn't think it was gonna go in this direction."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10150.69,"end":10180.46,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, you know, I got dramatic blood. I get fired up by some Beethoven, I read me some Nietzsche, right? You know, but so I think, I think the place where I take issue with what you said, if I had to find a place where I disagree, is so I think the music that helps you become truly human is the music of the church."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10181.74,"end":10182.14,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10183.26,"end":10266.93,"speaker":"Fr Stephen De Young","text":"I'm not saying no one should listen to Beethoven, right? I mean, I listen to like tool where like the times signature on any given song is like a differential equation. Right? Like, and I have said many times publicly that the first six Black Sabbath albums are a complete musical education in rhythm and blues and rock and roll, right? Like, you know what I'm talking about, right? So I listen to Beethoven. I listen to those things too, right? But I hold them in a different category than the music of the church or even like Handel or Bach, right? Because those were composers who were doing something fundamentally different. Beethoven was setting out to restore a certain Kind of beauty, but was the beauty of a pre Christian age, which also contained a lot of ugliness. And my reason for critiquing Beethoven is that I think there is. Nostalgia isn't the right word for it, but I think there's this idea that sort of old stuff is safe and new stuff is dangerous. And I don't think that's. I don't think it cuts that way."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10268.45,"end":10269.97,"speaker":"Fr Andrew Stephen Damick","text":"I was born an old fogey, so."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10270.29,"end":10296.38,"speaker":"Fr Stephen De Young","text":"That'S part of the problem. Right. But I mean, there was sort of that thing, right? And, you know, if you go back and watch a lot of like, say, 1950s sitcoms or 1960s sitcoms, a lot of them haven't aged well, like the Honeymooners. Like, the big recurring gag is that he's going to beat his wife. Like, seriously, one of these days I'm going to punch you in the face. That's. Ha ha. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10298.3,"end":10299.5,"speaker":"Fr Andrew Stephen Damick","text":"Put it on Nickelodeon."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10299.58,"end":10364.21,"speaker":"Fr Stephen De Young","text":"Right. But there's a lot of. And it's this puritan strand in our culture that says, well, if my kid's watching that stuff they put on HBO today, that's a problem. I want them to go watch that old stuff because that's all safe and not really look at it the same kind of thing. I don't want them listening to this hippity hoppity rock and roll music. I want them to listen to classical music. Right. And there's not. I think the same kind of discernment needs to be applied to classical music that gets applied to any other kind of music. And that doesn't mean you can't listen to something that you say. Well, this is problematic because, hey, classical literature, right? Like, I wouldn't say kids shouldn't read the Odyssey, but I hope kids don't go and sacrifice black goats to the dead. Right. Like, that would be bad if they started mimicking that behavior. Right. So there are clear pagan problematic elements there. Right. And so it has to be appreciated in a certain context and in a certain way."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10367.01,"end":10414.45,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right. And we are going to take one person after Father John, and that's Father Anthony Cook, the proto basaltis for the Lord of Spirits Conference. Thank you very much, Father Anthony, for leading the chanting. My pleasure. Glory to God. And thank you to those who saved my voice tonight. I was actually going to ask a question about orthodox funerary customs that are odd because I've been asked to pour out wine into a grave or to pour Koleva in there, but I think the others have already had you cover that. Would it Be possible for me to give my question to an old friend who has a question about the atonement."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10415.49,"end":10431.81,"speaker":"Fr Stephen De Young","text":"Sure, sure. Pass the mic. And it's a good thing you're leading the singing, because otherwise I'd have to. Let me tell you, I have a voice that will make you cry. You will shed tears and beg me to stop. Good evening, Father."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10432.36,"end":10438.36,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Father Anthony, for that kindness unexpected. All right, here's my question."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10439.48,"end":10443.4,"speaker":"Fr Stephen De Young","text":"I'm Carrie from Michigan. I'm one of your Protestant friends."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10443.64,"end":10445.72,"speaker":"Fr Andrew Stephen Damick","text":"So welcome, Protestant friends."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10445.8,"end":10446.36,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10451.64,"end":10453,"speaker":"Fr Andrew Stephen Damick","text":"I am attempting to."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10454.92,"end":10456.28,"speaker":"Fr Stephen De Young","text":"Clear some of."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10456.28,"end":10460.68,"speaker":"Fr Andrew Stephen Damick","text":"My Western floundering thinking here, and I'm wondering if you can help me point."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10460.68,"end":10466.92,"speaker":"Fr Stephen De Young","text":"Me in the right direction. In the past, on some of your episodes, you have stated that God could."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10466.92,"end":10469.48,"speaker":"Fr Andrew Stephen Damick","text":"Have chosen to forgive humans in any."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10469.48,"end":10479.84,"speaker":"Fr Stephen De Young","text":"Way he wanted to and that Christ's death upon the cross is not a legal atonement or substitution."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10480,"end":10485.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not a. I'm sorry, it's legal. Penal, substitutionary, atonement. Yes, thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10485.44,"end":10485.96,"speaker":"Fr Stephen De Young","text":"That one."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10486.28,"end":10491.04,"speaker":"Fr Andrew Stephen Damick","text":"So my question then is, why did Christ have to die if God could."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10491.04,"end":10494.68,"speaker":"Fr Stephen De Young","text":"Forgive anyway, what was the purpose of all of that?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10494.84,"end":10499.72,"speaker":"Fr Andrew Stephen Damick","text":"So could you please help a floundering Westerner come to grips with all of this?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10499.72,"end":10500.28,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10500.84,"end":10501.8,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I want to start."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10505,"end":10505.64,"speaker":"Fr Stephen De Young","text":"How about."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10505.8,"end":10548.93,"speaker":"Fr Andrew Stephen Damick","text":"All right. Christ died because that granted him entrance into the underworld. Because you can't get there without dying. That's what it means. To be there is to be dead. So Christ entered into the underworld and he stood at the gates of Hades. And as it says in the Psalms, a voice was heard saying, lift up your gates, O ye princes. Be lifted up, ye everlasting gates. And the King of glory shall enter in. And the voice says, who is this king of glory? The Lord strong and mighty. The Lord mighty in war. It's in Psalm 24. Right?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10549.01,"end":10549.65,"speaker":"Fr Stephen De Young","text":"24."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10551.09,"end":10604.64,"speaker":"Fr Andrew Stephen Damick","text":"And the gates of Hades are battered down, and the devil is flattened underneath those gates. And he goes in, the angels tie up the devil and all of his dark angels that are there. And the Lord reaches out his hand and grasps hold of Adam and Eve and all of the righteous of the old covenant and leads them out to paradise. That's why he died, is to go do that. And then he rose again, beginning the resurrection from the dead, in which someday all of mankind will also participate. That's why he died. There's other things you could also say about it. I'm not saying that's the only thing to say. Okay. But that's the thing that I say when people ask me why he Died."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10605.36,"end":10651,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that's. And part of the issue is that the west has come up with these atonement theories. Right. It's like we need to come up with the one that sort of explains it all, like a unified field theory of Christ's death. Why? Right. What we see in Scripture is this multitude of perspectives, all of them drawn from the Hebrew Bible, basically, but then applied. Right. So even like what Father Andrew just said, that might not sound like it's connected to, say, the day of atonement ritual in Leviticus 16 to you, right off the top of your head. Right. But there's connective tissue that connects those two things."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10652.92,"end":10653.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10653.28,"end":10698.62,"speaker":"Fr Stephen De Young","text":"Like in Second Temple literature. So you read 2 Enoch, and it presents that there is going to be this sort of eschatological day of atonement, this sort of final day of atonement, where not just the earthly sanctuary is purified, but the world will be purified from sin and its effects. Right. And part of that is Azazel, the evil one, being bound and thrown off a cliff into a pit. Right. Not just a goat, that's the goat representing, but like the devil himself being bound. Right. The imagery of the harrowing of Hades is taken over from the devil."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10698.77,"end":10699.01,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10699.49,"end":10708.05,"speaker":"Fr Stephen De Young","text":"It's arguing that Christ fulfilled that eschatological day of atonement. Right."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10710.45,"end":10710.73,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10710.73,"end":10802.9,"speaker":"Fr Stephen De Young","text":"But that's one through line, right. As we've mentioned on the show, way more often than the day of atonement, Jesus death is talked about in terms of the Passover, like that's when it happened, for one thing. Right, but. And even when you get atonement language, it's mixed with Passover language. Like, I don't think we've paused enough at Behold the Lamb of God who takes away the sins of the world. Because what you've got in the Torah is you've got a goat that takes away sin and you've got a Passover lamb, and they're not doing the same thing. Right. But that's even an argument, that form of expression of there being these multiple layers, different ways of seeing it. And then you've got St. Paul pointing out, cursed is everything which hangs on a tree, bringing in the language of blessing and curse and what that means in terms of the death of the Messiah. Right? So there are these multiple categories, there's this richness to what's going on in the Old Testament, and you've got to take as many of those through lines as you can to understand on a deeper and deeper level what's going on there. We can't just try to boil it down to, well, here's how it works. This is it. And now. Right, I've got it. You're missing out when you do that on a whole lot. A whole lot."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10804.73,"end":10848.66,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, fathers. You're welcome. Thank you. That is our show for tonight. Thank you for coming here to be with us this evening. For those of you who are at home and didn't get to be here, we'd still like to hear from you. We hold no grudges. You can email us@lordofspiritsancientfaith.com you can also message us at our Facebook page or you can leave us a voicemail@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10848.98,"end":10857.98,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And if you're here, listen to the FOMO episode."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10858.06,"end":10859.74,"speaker":"Fr Andrew Stephen Damick","text":"That's right, because there's an episode that."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10859.74,"end":10869.06,"speaker":"Fr Stephen De Young","text":"Released while you were sitting here with the world's oldest stand up set. I'm not kidding. And if you're on Facebook, you can."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10869.06,"end":10878.86,"speaker":"Fr Andrew Stephen Damick","text":"Follow our page, you can join our discussion group, leave reviews and ratings in all the appropriate places. But most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10878.94,"end":10887.44,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith 30, support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10887.84,"end":10889.44,"speaker":"Fr Andrew Stephen Damick","text":"Because apparently we don't exist."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10890.16,"end":10898.48,"speaker":"Fr Stephen De Young","text":"Yes, without Ancient Faith, we just go away. If you're not the media, do you exist?"}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10898.56,"end":10903.04,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Thank you, Good night. God bless you."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10903.04,"end":10922.49,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10922.65,"end":10925.97,"speaker":"Fr Andrew Stephen Damick","text":"Times 10,000 and thousands of thousands, saying."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10925.97,"end":10934.03,"speaker":"Fr Stephen De Young","text":"With a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10934.03,"end":10936.91,"speaker":"Fr Andrew Stephen Damick","text":"Honor and glory and Blessing."}
{"episode_id":"LOS - #079 - 2023-10-26a - Pananthropon and Pandemonium - Live, In-Person Conference Q&A","start":10937.23,"end":10940.27,"speaker":"Fr Stephen De Young","text":"Revelation, chapter 5, verses 11 through 12."}
