{"episode_id":"LOS - #052 - 2022-09-22 - Battle Wizards - Mauling at the Euphrates","start":4.8,"end":937.32,"speaker":"Fr Stephen De Young","text":"This is a Lord of Spirits special presentation. So Father Andrew and all the other ancient fake folks are at some kind of meeting or get together or conference or retreat or some other kind of fault or all. But I did not, as an independent contractor who is not involved, want our listeners to go completely deprived of new content on this fourth Thursday of the month of September 2022. And so I said to myself, self, I said what sort of content would appease the appetite of our listeners? And I decided that what you might want to hear, other than three hours of me monologuing about something, would be to hear the story of a Sumerian wizard duel from the 18th century BC. So this, this text was written down and recorded in between the time of Abraham and the time of Moses. That latter part we'll talk about a little more after I read it. I'm only going to read part of it, the cool part with the wizard duel. But this text is one of a series of Sumerian texts from that era telling stories about Enmerkar. Enmerkar was the grandfather of Gilgamesh and the king of Uruk. Most of these stories involve Enmerkar trying to place the king of another city into a vassal position beneath him to pay him tribute. And so there are all of these interesting ways in which he manages to subjugate these various other cities. So the beginning of this text, which is entitled Enmerkar and Ensugarana, and those get spelled in fascinatingly different ways, but if you spell it out phonetically, you could probably find it. It, if you want to read more about it, is about our friend Enmer Car trying to subjugate, in this case the city of Arata. Not Errata, but Arata with an A. And he has a little bit of difficulty doing it. At least it's sort of a. It's sort of a three step process, right? So it starts out with an exchange of letters. That exchange of letters between the two kings involves a bunch of insults and involves a series of brags, shall we say, by each king about how he has been a better lover to the goddess whom both cities worship. And verbally, at least in the letters Enmer' Kar kind of gets the upper hand in this exchange of letters. But that does not mean that Arata is going to immediately submit right to his authority. And so as I pick up reading here, and I'm going to be a little euphemistic in a few places, you'll be able to imagine why as we go along, but Arata is enacting a plan so since Ensugarano was unable to gain the upper hand in the letter exchange, he sends a sorcerer to go and enact a plot that he believes will allow him to get the better of Enmerkar and Uruk. So that is where we are picking up. If there's someone out there nerdy enough to have the critical edition of this text, we're picking up at line 170 of this particular Sumerian epic. And so the sorcerer, having planted the first seed, wended his way to Eresh, the city of Nisaba. He arrived at the byre, the place where the cows live. The cow and the byre trembled before him. He made the cow speak so that it conversed with him as if it were human. O cow, who will eat your cream? Who will drink your milk? The cow replied, nisaba will eat my cream. Nisaba will drink my milk and my cheese. The well ripened shining crown will be properly served in the great dining hall, the dining hall of Nisaba. For unless my cream has been brought from this splendid buyre, unless my milk has been brought from this splendid pen, faithful cow, Nisaba, Enlil's oldest daughter, cannot institute the levy. So just pausing there. Nisaba is a. A goddess who sort of is the goddess of the city of Eris, who we're talking about, the city we're talking about. And so Nisaba is also a goddess daughter of Enlil, who was depicted as bovine. So this cow has a sort of special connection to the local goddess. So the sorcerer responds to the cow, cow, your cream to your glistening horn, your milk to your back. And so the cow's cream was pulled back into its glistening horn and its milk retreated into its back. So the sorcerer sort of cursed the cow to retract its milk so it will not give milk. He, the sorcerer, arrived at the splendid pen, the pen of Nisaba. The goat in the pen trembled before him. He made the goat speak so that it conversed with him as if it were human. O goat, who will eat your cream? Who will drink your milk? The goat replied, nisaba will eat my cream. Nisaba will drink my milk and my cheese. The well ripened shining crown will be properly served in the great dining hall, the dining hall of Nisaba. For unless my cream has been brought from this splendid buyer, unless my milk has been brought from this splendid pen, faithful cow, Nisaba, Enlil's oldest daughter, cannot institute the levy. The sorcerer replied, goat, your cream to your glistening horn, your Milk to your back. And so the goat's cream was pulled back into its glistening horn and its milk retreated into its back. Thereupon Pen and Byre became a silent house, a ruin. There was no milk in the cow's udders. The calves days darkened. The young calf was hungry and mooed heartrendingly. There was no milk in the goats udders. The kids days darkened. Both kid and goat lay down starving their lives bitterly. The cow spoke to its calf and the goat commiserated with its kid. The holy churn remained empty, was hungry and lay starving. Surely on that day, Penn and Byer had become a silent house, a ruin. The drover dropped his staff, his eyes vacant in shock. The shepherd fastened his crook at his side, weeping bitterly. The shepherd boy no longer frequented Pen or Byre. He went elsewhere. The milkman no longer cried out loudly. He went elsewhere. Now there were a cowherd and a shepherd of Nisaba, sons of one mother and reared in pen and Byre they were. Mashgulla was the name of the former, rudina of the latter. At the great gate, facing the rising sun, the marvel of the land, both of them crouched in the dust and implored Utu in the sky. This sorcerer, a man from Arata, broke into the pens. In the pens he caused a shortage of milk. Even the calves do not get any. In Pen and Byre, he brought misery. He made scarce cream and milk. He cast their doom, caused their devastation. So now we have this problem, or Enmerkar has this problem, because this city is one of his other vassal cities. And so this sorcerer has been sent from Radha, sort of special ops. He's cursed this city. They don't have any dairy products. As a Dutchman, this is one of the most horrible fates that could befall you. And so how is. How is Edmer Carr going to respond? He is going to respond. And there's a little bit of a break of the tablet here, so I'm just going to have to tell you. He responds by sending. I'm reading a somewhat modern and politically correct translation that says wise woman. Older translations would say, which. This is a female worker of magic who works for Enmakar at Uruk. He sends her to go and have this wizard's duel with the sorcerer to settle this once and for all. And so the two of them are essentially serving as sort of champions for their respective cities. The wise woman is named Sagburu. And they go and they meet up. This is all from little bits and pieces in the cracked tablet. They go and Meet up at the banks of the Euphrates, which they call the river of the Gods. And so now we're going to have the showdown. We're going to have the main event, the wizard duel. So it begins. And we're at round line 228. Both through fish roe, fish eggs. Both through fish eggs into the river. The sorcerer drew out a big carp, but wise woman Sagburu drew out an eagle. The eagle caught the big carp and fled to the mountains. Again they threw fish eggs into the river. The sorcerer drew out a ewe with lamb, but wise woman Sagburu drew out a wolf. The wolf caught the ewe with lamb and dragged them to the open plain. A third time they threw fish spawn into the river. The sorcerer drew out a cow with calf, but wise womansegbouru drew out a lion. The lion caught the cow with calf and took them to the reed marsh. A fourth time they threw fish eggs into the river. The sorcerer drew out an ibex and a wild sheep. But wise woman said Booru, drew out a mountain lion. The mountain lion caught the ibex and the wild sheep and and dragged them to the mountains. A fifth time they threw fishspawn into the river. The sorcerer drew out a young gazelle, but wise woman Sagburu drew out a tiger and a Nimlion. The tiger and the Nimlion caught the young gazelle and dragged it to the woods. The sorcerer's face darkened and his mind was in turmoil. Then wise woman Sagburu spoke to him. O sorcerer, for all your magic lore, do you not understand anything? How could you go to Eresh, the city of Nisaba, the city whose fate was fixed by an and Enlil, the primeval city, the city well loved by Ninlil, in order to work your evil magic? How did you dare? The sorcerer replied. I went there without knowing what I did. Now I acknowledge your authority. Please do not be angry. He did obeisance. He pleaded with her. Let me go, sister. Let me go. Let me return safely to my city. Let me go back unharmed to Arata, the mountain of the inviolate powers. I will proclaim your greatness in all countries. I will sing your praise in Arata, the mountain of the inviolate powers. Wise woman Sadhguru replied to him in pen and byre. You brought misery. You made scarce cream and milk. You abolished lunch, breakfast and dinner meals. You cut off cream and milk from the supper in the great hall. Misery. Your sin of withholding cream and milk cannot be overlooked. King Nanna granted Everlasting milk in the bier. Therefore, your sin is a capital offense. I cannot grant you life. Wise woman. Sagburu confirmed her statutory verdict on the sorcerer. She threw down her victim on the bank of the Euphrates, took away his vital force, and returned this to her city, Erish. So after this, she having not only defeated the sorcerer in the wizard's duel, but having killed him on the bank of the Euphrates, that vital force, there is a translation of the word basically for soul. She ripped his soul out, pulled a Shang Tsung at this point. Then the. The king of Arata, he's got nothing. So he goes ahead and submits and becomes a vassal of Enmerkar. So, of all the strange Sumerian tales I could have have read for this, why did I read this one? Well, this one, as some of you might have detected, is kind of interesting because it shows us sort of this paradigm for ancient wizard duels. And you might have noticed something familiar about it in terms of the contest that happens between Moses and Jannes and Jambres in Egypt. Of course, the names come from Second Temple Jewish literature and are referenced by Saint Paul. The names for the wizards of Pharaoh who contest with Moses. Remember, there is this whole element there of them summoning animals and Moses, animals being larger and more powerful, right? The snakes and devouring them. This is, as you can see, a motif, right? The particular magic they work. Like, they're not throwing fireballs and lightning bolts at each other like battle wizards, but they are using fish roe, they're using fish eggs and the waters of the Euphrates to create animals, to create living creatures that then battle each other. And in every case, it's unclear whether they were picking the animals, because if they were directly picking the animals, the sorcerer was kind of lame in his choices, but that might not be the case. It may have been just a general sort of expression of their power or something, what kind of animal it was. And the wise woman may have just been a little more powerful. It's hard to totally track, but this motif of sort of wizards or sorcerers or wise people doing battle by the summoning of creatures, there is that biblical parallel. So hopefully this brief story time will tide you over until our next episode, Lord willing, on the second Thursday of October, when again, Lord willing, we'll be alive again."}
