{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":0.4,"end":65.06,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":66.82,"end":156.69,"speaker":"Fr Andrew Stephen Damick","text":"Good evening all of those of you engaged in gigantomachy and also Draco Maki. You are listening to Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with us from Lafayette, Louisiana and I'm Father Andrew Stephen Damick where we have winter in Emmaus, Pennsylvania and we are live. And if you are listening to us live and not via Memorex, you can call us at 855-237-2346. You can talk to us live. We're going to get to your calls in the second half of the show and our dear Matus Kha Trudy will be taking your calls. So sometimes people use their sense of right and wrong to judge God himself. Is everything that God does good? If something isn't okay for humans, why is it okay for God? So tonight we're going to be talking about ethics. It might seem like a dry topic and probably pretty straightforward. Just do what's right, right, don't do the wrong. But it turns out that how you understand what right and wrong actually are, the truth of what good and evil are and where these concepts come from, this all makes a big difference in how you understand not only what you ought to do, but also who God is and how you read the scriptures. So Father, are we going to start with Genesis this time? Adam and Eve?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":157.65,"end":158.53,"speaker":"Fr Stephen De Young","text":"Kind of, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":158.61,"end":161.17,"speaker":"Fr Andrew Stephen Damick","text":"But oh, that's to me."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":162.93,"end":163.65,"speaker":"Fr Stephen De Young","text":"Before that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":164.16,"end":164.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":166.64,"end":172,"speaker":"Fr Stephen De Young","text":"I have to say so like, you know, while, while the intro plays and everything, I am alone with my thoughts."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":172.88,"end":174.24,"speaker":"Fr Andrew Stephen Damick","text":"You have time to think over there."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":174.24,"end":179.92,"speaker":"Fr Stephen De Young","text":"And right before we came on live. So people hearing this recorded Won't know."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":180.16,"end":181.16,"speaker":"Fr Andrew Stephen Damick","text":"They won't know. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":181.16,"end":182.8,"speaker":"Fr Stephen De Young","text":"I heard someone use the word gumption."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":183.68,"end":187.04,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. You don't hear that too often up here. Yankee land."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":187.36,"end":202.09,"speaker":"Fr Stephen De Young","text":"And this made me think, right? Like, if there's a functional difference between gumption and moxie. Now, here's what I mean by functional difference. Because there's a different energy, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":202.09,"end":203.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes, absolutely."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":203.37,"end":205.61,"speaker":"Fr Stephen De Young","text":"Gumption has, like, an old prospector energy."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":206.09,"end":210.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, like, moxie is, like broad 1940s dancing."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":210.41,"end":212.41,"speaker":"Fr Stephen De Young","text":"Yeah. Or 1940s girl reporter."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":212.41,"end":216.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Lois Lane."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":216.25,"end":229.25,"speaker":"Fr Stephen De Young","text":"But I don't functionally know if there's a difference. So even though it's not related to our topic at all tonight, if you want to call in about gumption and moxie, go ahead and do it. We'll host that as a side conversation."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":229.65,"end":230.45,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":231.17,"end":244.13,"speaker":"Fr Stephen De Young","text":"But in terms of our topic at hand. Yeah. Why not start in Genesis, just for tradition's sake, Right. Pretty early on, we get the Tree of the Knowledge of Good and Evil."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":245.74,"end":246.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":246.22,"end":247.74,"speaker":"Fr Stephen De Young","text":"Where these terms are just kind of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":247.74,"end":249.98,"speaker":"Fr Andrew Stephen Damick","text":"Used and not defined."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":250.06,"end":282.79,"speaker":"Fr Stephen De Young","text":"And not defined. Good appeared even before that. Right. Because God saw that it was good. God saw that it was good. Tov in Hebrew. And then evil shows up in the tree with the. With the tree. But they're not sort of defined there, either one of them. And the word tov can mean just good. It could also mean beautiful. It can mean whole, intact."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":283.35,"end":293.99,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the Greek translation kalos, which is in the Septuagint, the actual Septuagint, it means good and beautiful. And I don't know that it means whole. Does kalos mean whole?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":295.67,"end":317.93,"speaker":"Fr Stephen De Young","text":"Well, if it's used to. So, for example, in Exodus, Chapter two, and Moses is born, his mom looks at him and sees that he's sometimes translated as beautiful, sees that he's beautiful, and so decides not to kill him. That's. Wow. But. But the idea is actually they're more whole or healthier. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":317.93,"end":320.65,"speaker":"Fr Andrew Stephen Damick","text":"Like, yeah. Yeah. Like, he's thriving."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":321.13,"end":383.93,"speaker":"Fr Stephen De Young","text":"Yes. Fully formed. And so. Yeah. Yeah. But so obviously, and very clearly with. Once we get to the tree, these terms are being used as an ethical set. In an ethical sense. Right. Or a moral sense might be better. But even then, you can't. You know, it's hard to extricate. And maybe we shouldn't extricate good from, say, beauty or truth. Right. As if they're completely separate things. I mean, is there, in truth, no beauty? So. Yeah. So we're gonna. Tonight, we're gonna be working on understanding these terms, and we are coming at it. This is why Father Andrew Was slightly surprised that I mentioned Genesis."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":384.01,"end":386.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. How dare you go off script."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":386.73,"end":387.29,"speaker":"Announcer","text":"That's."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":387.77,"end":389.53,"speaker":"Fr Stephen De Young","text":"When have I ever been on script?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":389.69,"end":390.25,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":390.33,"end":441.92,"speaker":"Fr Stephen De Young","text":"Well, okay, I was talking about gumption and moxie a minute ago, man. Anyway, the. But part of how we have to come at this particular topic is a little different because almost all of us who are going to be listening to this and we who are producing it. Right. Have been deeply shaped in our concepts of morality and ethics and the terms we use to describe those things by a lot of cultural forces and cultural developments and cultural shifts. And so we kind of have to get back to what's going on in scripture and what's going on in Christian theology. We have to first kind of deconstruct some of that cultural stuff."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":442.32,"end":454.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, what is it that makes a person get to a point where they say without batting an eyelash that pineapple on pizza is just wrong? Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":456.08,"end":461.53,"speaker":"Fr Stephen De Young","text":"Yeah, it clearly isn't on barbecue pizza. Spicy take."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":463.21,"end":466.65,"speaker":"Fr Andrew Stephen Damick","text":"Did you know that Hawaiian pizza was invented by a Greek in Canada?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":468.25,"end":470.61,"speaker":"Fr Stephen De Young","text":"I didn't know about Canada. I believe the Greek part, though."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":470.61,"end":472.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it's a Greek in Canada. It's amazing."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":473.05,"end":491.12,"speaker":"Fr Stephen De Young","text":"Is that what started the anti Greek riots in Toronto? But anyway, I'm making jokes about dark chapters in the racial history of Canada. Anyway, send your hate mail to. We're only eight minutes in ancient faith.com offended Canadians."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":491.91,"end":495.91,"speaker":"Fr Andrew Stephen Damick","text":"Usually you wait until after 9:30pm to throw out these hot takes so that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":495.91,"end":497.03,"speaker":"Fr Stephen De Young","text":"Yeah, no, they're getting."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":497.03,"end":498.39,"speaker":"Fr Andrew Stephen Damick","text":"All the nice people are in bed."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":498.71,"end":510.39,"speaker":"Fr Stephen De Young","text":"Right from the jump. My wife asked me, are you going to say anything controversial? And I said, yeah. And she said, what are you going to say? And I said, I don't know yet, but I'm sure something, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":510.39,"end":512.95,"speaker":"Fr Andrew Stephen Damick","text":"Like I'll come up with something. It'll be good. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":513.59,"end":612.13,"speaker":"Fr Stephen De Young","text":"I won't even have to try. Trust me. Yeah, but. So, yeah, so, but, but I mean, on a more on a more serious note than the. The dubious nature of putting pineapple on pizza, right. We to this day, there are humans who throw their support behind and who justify all kinds of horrible things in certain situations that they wouldn't in others. Right. Or who I think all of us at times act in ways that in our better moments we know are not correct. Right. And so that's a lot of shaping that's gone on in our life to cause us to think that black is white and white is black. Right. That to confuse what good and evil actually are. And this is, this is especially true, as you mentioned, because we're particularly coming at this tonight. I mean, ultimately, this is going to be about what we do, but we have to really start with God. We have to start with God because if we have a definition of good that doesn't work with God, that's probably not going to work real well. Right, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":612.45,"end":618.69,"speaker":"Fr Andrew Stephen Damick","text":"And also, as I think we said in one of our really early episodes, humans are theomorphic."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":619.25,"end":619.81,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":619.81,"end":628.75,"speaker":"Fr Andrew Stephen Damick","text":"So if we're made to be the images of God, then what does it mean? That God is good is a super important moral question."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":629.15,"end":648.67,"speaker":"Fr Stephen De Young","text":"Right, right. And this is something about which there has been a lot of debate over the years. And the answers to just that question, what does it mean that God is good? Are at the root of all kinds of theological systems."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":650.84,"end":651.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":651.16,"end":691.3,"speaker":"Fr Stephen De Young","text":"Arguably, it's at the root of Protestantism, if we're talking about the Protestant Reformers, for example. But so when this topic is addressed out there in the world, if you go and take a class about this, invariably they will start by assigning, because it's short, talking about Plato's Euthyphro. Plato. His dialogues, for the most part, are named after the person Socrates is talking to in the dialogue."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":691.78,"end":692.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":693.22,"end":712.61,"speaker":"Fr Stephen De Young","text":"So Euthyphro is the dude who Socrates is talking to. As usual, he's kind of a foil. Right. Like Socrates, interlocutors do not really come off as the smartest and sharpest people in the world, usually. And sort of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":712.61,"end":712.89,"speaker":"Fr Andrew Stephen Damick","text":"What."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":712.89,"end":775.06,"speaker":"Fr Stephen De Young","text":"What occasions this particular discussion that's recorded in the Euthyphro is that this Euthyphro guy is pressing a lawsuit against his own father. And this, in Athenian culture in the 4th century BC, was seen as this hideously wicked thing to do, to sue your own father. Right. It was sort of an attack upon your own father. Disrespect. Who does that for your father? Right. Yeah. So this was. And a public shame. Right. This would bring shame on his whole family. Right. So Socrates is sort of, well, man, what's up with that? And Euthyphro defends himself. His primary defense is that Cronus castrated Uranus. He refers to the story in Hesiod where Kronos, Zeus's father, castrates his own father."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":775.62,"end":775.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":775.98,"end":778.66,"speaker":"Fr Stephen De Young","text":"And so Ouranos, or Uranus, if he."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":778.66,"end":781.7,"speaker":"Fr Andrew Stephen Damick","text":"Can do that, you know, suing him. I mean, that suing your dad is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":781.7,"end":785.14,"speaker":"Fr Stephen De Young","text":"Much, much less, nowhere near that bad. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":787.79,"end":787.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":787.99,"end":844.32,"speaker":"Fr Stephen De Young","text":"And so he says, I'm, you know, if anything, I'm imitating the behavior of. Of the gods. And so the way this gets discussed and we're going to deal with the way it gets discussed in a minute. But I do want to point out. Right. The way it gets discussed is not at all what this dialogue is about in its historical context. In the historical context, Socrates counter argument is basically when you hear stories like that about the gods, you need to just disregard them. Yeah, right. When you hear stories that are unworthy of the gods because clearly divinity would not work like that. And this is part of, as we've mentioned before the show, Plato's overall program of taking Greek deities and sort of divesting them of their human qualities."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":844.48,"end":845.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's sort of trying to turn."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":845.88,"end":846.32,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":846.4,"end":850.16,"speaker":"Fr Andrew Stephen Damick","text":"Purify the whole thing so that it's acceptable."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":850.4,"end":898.96,"speaker":"Fr Stephen De Young","text":"Right. To turn them into the forms. Right. So you take Aphrodite, you bleach out all of her vanity and petulance and bed hopping and you get love. Right. And your beauty. Right. Those kind of things. Right. So you take these things, you strip away all that human stuff and you end up with Plato's forms. So that's what he's actually doing. That's what's actually going on in the dialogue in terms of 4th century BC Greece. But that's not how the euthyphro gets used in terms of today. Right. Your atheist philosophy professor is not going to treat it in its societal context. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":898.96,"end":899.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":900,"end":922.81,"speaker":"Fr Stephen De Young","text":"He's going to, excuse me, pose it as. Oh, well, Plato is posing this dilemma. Right. And you should. Here's, here's one of the tip offs that this isn't actually what Plato was doing, is that the dilemma they propose assumes monotheism and Plato was actually a monotheist."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":923.05,"end":940.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But like you can read the euthyphro and therefore disprove monotheism. A dialogue written by pagan polytheists who have no concept of monotheism that anybody's really aware of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":940.25,"end":945.45,"speaker":"Fr Stephen De Young","text":"Yeah. And nowhere there does anyone say that Cronus and Uranus don't exist."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":946.43,"end":947.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":947.31,"end":989.22,"speaker":"Fr Stephen De Young","text":"Right. So, but they will say, here's the dilemma. This is the important thought that they want to press that they are attributing to the euthyphro. Does God command things? Like when God gives commandments, does he command you to do something because it's right and not to do something because it's evil? Or is something good because God tells you to do it and something evil because God tells you not to do it? So it's which way does the cause and effect run?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":989.54,"end":997.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is there some kind of absolute morality that God is in conformity with? Or is morality just whatever God says?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":998.59,"end":998.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":999.07,"end":999.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":999.55,"end":1039.8,"speaker":"Fr Stephen De Young","text":"Right. And this takes A whole bunch of forms through history. Right. The nominalist, realist debates in the Middle Ages. Right. This takes all kind. This idea takes all kinds of forms, as I mentioned. Right. So this, this gives two possible answers. I'm going to say neither of them are good ones, but anyway, two possible answers to what it means for God to be good. One of those is good and evil are these objective categories. And God is in the good category."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1040.52,"end":1041,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1041.96,"end":1042.32,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1042.32,"end":1043.64,"speaker":"Fr Andrew Stephen Damick","text":"He fits in the good box."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1045.32,"end":1054.34,"speaker":"Fr Stephen De Young","text":"The other one would be God is good because God decides what is good. Right. That he has called himself good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1054.74,"end":1056.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I am the law."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1056.98,"end":1057.54,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1059.38,"end":1061.46,"speaker":"Fr Andrew Stephen Damick","text":"So I can't do my full Stallone tonight."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1061.78,"end":1085.07,"speaker":"Fr Stephen De Young","text":"Yes. Gaze into the fist of dread. So, right. And then this is posed as this dilemma. And sometimes your atheist philosophy professor will even try to use this to prove there is no God, because he's going to try and say these are the only two answers, and then he's going to say they're both bad answers, therefore there's no God."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1086.43,"end":1094.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Setting aside the fact that you might find one of the answers abhorrent, but it could be the truth."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1094.51,"end":1102.19,"speaker":"Fr Stephen De Young","text":"Yes. One of them could be true, even though you don't like it. Or there could be more possible answers."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1103.37,"end":1103.61,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1104.33,"end":1105.45,"speaker":"Fr Stephen De Young","text":"Yeah. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1107.77,"end":1110.57,"speaker":"Fr Andrew Stephen Damick","text":"Which is why this episode's not going to be only 20 minutes long."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1110.89,"end":1177,"speaker":"Fr Stephen De Young","text":"Yes, exactly. But the problems with these two answers start becoming pretty obvious. So if we say, okay, good and evil are these objective categories and God is in the good category. Right. Then right off the bat we have this standard that's over and above God. Right. It already exists. That exists at this higher level than God, such that God has to submit to it. God has to do the things that are objectively good and he can't do the things that are objectively bad or evil. Yeah, Right. Well, so this is a problem because where did that come from then? Right? Who or what created that? And who or what then would judge God to just by that standard? And if there is some being that does that, isn't that actually God?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1177.72,"end":1201.89,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, this is super common. Like, this is one of the things that happens a lot when people look at the Bible and they see God doing something that they don't like, they'll say, well, you know, if that is who God is, then I'm not going to worship him because he's horrible. Meaning I have this other moral standard, which is the moral standard that everyone should be subject to and God does not live up to it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1202.45,"end":1203.69,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1203.69,"end":1204.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1205.98,"end":1213.9,"speaker":"Fr Stephen De Young","text":"But so, I mean, at a cosmic level, you get this Eternal regress of like, well, okay, well, then there must be some actual God back there. Further, we talked about this when we talked about justice."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1214.38,"end":1214.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1214.9,"end":1222.54,"speaker":"Fr Stephen De Young","text":"Which is a real problem in certain threads of Reformed theology where justice is somehow over and above God and God has to submit to justice. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1222.54,"end":1222.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1222.9,"end":1265.24,"speaker":"Fr Stephen De Young","text":"Like, wait, what? Well, then isn't justice really God? Same thing there. And yes, we have people who then assume this. Right. That there is some access to that standard which stands above God that I can have and then by which I can judge God. Right. So this creates an obvious problem. Now, there is a very common way to try to get around this problem. Some of you may be typing it already. Go ahead and send the email to Father Andrew. He never gets enough emails. But we're going to respond to it right here beforehand. And that is they will say something like, well, God is bound by his nature."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1265.56,"end":1267.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He can't violate who he is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1267.56,"end":1269,"speaker":"Fr Stephen De Young","text":"He can't violate his nature."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1269.64,"end":1270.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1270.6,"end":1291.05,"speaker":"Fr Stephen De Young","text":"And his nature is good. Right. And then you say, you could say, well, that's just moving the question back, because by what standard is his nature judged to be good? And they'll say something like that starts to push toward the other answer of, well, no, just his nature is what good is. Or something similar."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1291.77,"end":1300.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is again, this idea that there's something exterior to God, you know, on some level that he has to be obedient to."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1300.97,"end":1329.94,"speaker":"Fr Stephen De Young","text":"Yes. The other big problem with this, this idea that God has this set nature and then that restricts what he can and can't do is that is not God's nature infinite? Right. How can you be bound by something infinite? How can something that is infinite restrict you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1332.98,"end":1333.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1333.94,"end":1345.06,"speaker":"Fr Stephen De Young","text":"Right. Or flipping it around to say that. Don't you have to say that God's nature is finite? That God's nature has boundaries that he can't cross?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1345.69,"end":1345.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1347.53,"end":1361.13,"speaker":"Fr Stephen De Young","text":"This is a big problem for the Christian God. Right. So the dodge of, well, God's restricted by his nature. That dog don't hunt."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1361.61,"end":1365.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's really just kind of using other terms to present the same."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1365.93,"end":1366.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1366.49,"end":1367.53,"speaker":"Fr Andrew Stephen Damick","text":"The same idea."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1367.85,"end":1410.91,"speaker":"Fr Stephen De Young","text":"Right, Right. Sort of a roundabout. Right. On the other hand. Right. On the other hand, there's the other answer. On the other hand, there are also five more fingers, but the other answer where just whatever God does is good and whatever he commands us to do is good and whatever he tells us not to do is evil. And we just have to go with that. Right. That his command is the cause. That's what makes something good or evil."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1411.07,"end":1420.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of the ultimate arbitrary morality. Which sounds bad, right? But if you decide, well, if you say, well, God is the arbiter, then that sounds good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1420.91,"end":1436.55,"speaker":"Fr Stephen De Young","text":"Arbitrio means the will, right? So it's God's will, but he decides. Yeah, it's literally arbitrary. It always cracks me up with my Calvinist friends, I say that I refer to predestination as arbitrary. They're like, no, it's according to God's will. And I'm like, do you know Latin? But anyway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1440.23,"end":1442.55,"speaker":"Fr Andrew Stephen Damick","text":"So meant they weren't meant to know Latin."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1445.83,"end":1477.66,"speaker":"Fr Stephen De Young","text":"But so one of the problems with this answer is that in a way it doesn't actually tell us what it means to say that God is good. Because in this instance, if what makes something good or evil is God's command and his will, then he's not bound by his own command. So he could tell you not to do something and that makes it evil, but then he can do it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1479.99,"end":1480.11,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1480.11,"end":1634.38,"speaker":"Fr Stephen De Young","text":"It'S not evil when he does it, right? There is no. It becomes meaningless to say that God is good, God is good, under this answer just becomes God is God, right? It just becomes kind of a meaningless statement. Right? But also then what this suggests is that the universe we live in, the universe that God created, is just completely morally neutral, right? That, you know, giving someone hungry food and murdering them, there is no actual difference between these two acts except that, right, God has told you to do one and not to do the other. Yeah, but. But beyond that there's no difference. And so if God did tell you to go and start killing people, you should go and start killing people. And now it's good, right? So that's a problem. And while it may be very clear to us why that's a problem, a version of this is at the core of, of how ethics is seen by almost everyone today in the late 20th century and early 21st century, even by the people who identify as conservatives. And the way I know this for sure, and I flinch every time someone says it, is that they keep using the word values. Values. We value this, we value that. And this is all sides of the political spreader. Like I said, folks who identify as conservatives will talk all the time about family values and traditional values and American values, and people on the other side will talk about how they value diversity and value. Right? Okay, here's where that comes from. This whole concept of values comes from a fella named Shaler, One of our 19th century German friends, right, who argued that the world we live in is morally neutral. There is nothing that is actually Good or evil, right or wrong in itself, but that different cultures value different things."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1635.82,"end":1641.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's just conventional. It's just the, you know, the social contract. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1641.32,"end":1642.36,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1642.52,"end":1643.88,"speaker":"Fr Andrew Stephen Damick","text":"We all got together and this is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1643.88,"end":1685.48,"speaker":"Fr Stephen De Young","text":"What we decided in our society. We value hard work or we value whatever. Right. We value certain freedoms and liberties. We value whatever. Right. But that can just as easily be. We value genetic purity. We value dominance and victory in war. We value. Right. It's this arbitrary thing. And so if you. Let me just say, if you don't believe that's actually true. Don't talk that way. Stop talking that way. I'm using different values."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1685.48,"end":1702.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say, I think for a lot of people value has just come to be a stand in for, you know, standards or beliefs or teachings or whatever. But yeah, it's, it's true. Like when, when you say it that way, then it's just sort of a war of, well, who values this more? How many more people value this?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1704.14,"end":1719.26,"speaker":"Fr Stephen De Young","text":"I value this. You value that. Okay. The only place you're allowed to talk about values is sales at the supermarket. A circus of value."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1720.54,"end":1721.58,"speaker":"Fr Andrew Stephen Damick","text":"It's the better value."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1722.14,"end":1770.64,"speaker":"Fr Stephen De Young","text":"Yes, but don't use that term ethically, honestly, because this is what it entails. And you may say, well, that's not how I mean it. Right. But the way we talk about things shapes the way we think about things. Right? It really does. And the term value values relativizes whatever you're talking about. It relativizes whatever you're talking about. If what you're really talking about is the command of God, talk about the command of God. If you're talking about the commandments of the Torah, talk about the commandments of the Torah. If you're talking about the commandments of the New Testament, talk about the commandments of the New Testament. If you're talking about an ethical principle, if you're talking about a political principle, call it that. Yeah, right. Don't refer to things as things you value."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1773.52,"end":1777.28,"speaker":"Fr Andrew Stephen Damick","text":"Might as well just say this is what I like, because that's what I mean."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1777.97,"end":1779.41,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1779.57,"end":1784.61,"speaker":"Fr Andrew Stephen Damick","text":"In this society, we like it when you don't murder people. Oh, okay. Well, I won't do that then."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1784.69,"end":1790.21,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And we also prefer you don't litter and clean up after your dog. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1792.29,"end":1793.33,"speaker":"Fr Andrew Stephen Damick","text":"Even if they're heathens."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1793.89,"end":1795.17,"speaker":"Fr Stephen De Young","text":"It planes things out."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1795.49,"end":1795.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1795.85,"end":1805.53,"speaker":"Fr Stephen De Young","text":"That should not be planed out. Be kind rewind. Yeah. So obviously from say that's only for."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1805.53,"end":1807.17,"speaker":"Fr Andrew Stephen Damick","text":"Us Gen Xers and older. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1809.01,"end":1820.21,"speaker":"Fr Stephen De Young","text":"Any kind of, you know, I imagine there, there, there Was some like elderly person at some point desperately trying to figure out how to rewind a DVD back in the late 90s."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1820.21,"end":1823.21,"speaker":"Fr Andrew Stephen Damick","text":"But remember laser discs, you had to flip them."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1823.21,"end":1852.72,"speaker":"Fr Stephen De Young","text":"Oh yeah. Oh yeah, yeah. There's a. I forget which movie it was, but there's a movie where the director's commentary, Kevin Smith yelled, forget about DVDs. Laserdisc forever. I think it's haunted him for a long time. But anyway, it was the wave of the future, man. Just not that far into the future. Yeah, not much. Yeah, exactly, just like a couple of years. But it was still the future at the time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1853.92,"end":1854.96,"speaker":"Fr Andrew Stephen Damick","text":"Oh, the 90s."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1858.4,"end":1905.55,"speaker":"Fr Stephen De Young","text":"So. Yeah. So obviously from any kind of Christian perspective, this idea that the world is totally morally neutral, even if we're talking about it's morally neutral until God starts commanding things, it doesn't work. Right. It doesn't work. So a way to kind of work with this. We talked about the God being bound by his nature. So a way to try to work with this kind of idea and make it work in a Christian context to say, well, you know, things are this way because God commanded them is really a way to make this work for Christianity is really found in the natural law tradition."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1906.43,"end":1917.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This idea that God creates the world and puts a certain order into it and what is good and evil is written into the order."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":1918.2,"end":2005.93,"speaker":"Fr Stephen De Young","text":"Right, Right. So it's not that, it's this moves the action of God that makes things good and evil. It moves it from some later point like when he gives the Torah or when he starts issuing commandments. Right. It moves it back to when he created everything. That's when he sort of made the decisions about what would be good and what would be evil. And he created everything accordingly. He created the order of nature and the universe accordingly. And now this. You know, there are passages in scripture, passages in the Fathers that will talk about, and we've talked about some on this show, like in the episode we did about Jewish astrology, that talk about God revealing himself or revealing things about himself or even revealing the knowledge of how humans ought to live, at least to some extent through nature and through the natural order. So the natural law traditions don't come out of nowhere. Right. They're not just random dodge like God is bound by his nature. These have a, a basis. Right. There is a taking off point."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2006.41,"end":2006.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2006.73,"end":2032.61,"speaker":"Fr Stephen De Young","text":"At least that is, that is valid, that, that this is sort of encoded in nature, that it's encoded in us. That's why people tend to have an innate moral sense about what is good, even in this case. Right. Even with this kind of explanation, we still have the problem of the statement God is good becoming basically God is God."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2033.81,"end":2034.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2037.33,"end":2073.84,"speaker":"Fr Stephen De Young","text":"And not being God, not being good per se. But then there's also a couple of deeper issues with this, with natural law and the idea of natural theology as it developed in the west past a certain point. Right. And I'm not going to say what point, because then we, Father Andrew, would just get 100 emails arguing about, no, it was 200 years later than that or 200 years earlier. But past a certain point, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2073.84,"end":2074.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2074.6,"end":2127.56,"speaker":"Fr Stephen De Young","text":"At some point. The first one is then first problem is, right, Christ comes and reveals God. Right. In a way that is substantively different than the revelation of God that is generally found in nature. Right. So the way we've, I mean, we've gone through this on the show a few episodes ago, we talked about, right, Christ is the Logos, right. Incarnate. The Logos is the pattern, the order through which all of creation was created. Everything is created through Christ. There's this connection, Right. But still the Incarnation, is this more full revelation of it. Do we want to say that the Incarnation of Christ sort of then has nothing to do with ethics?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2130.04,"end":2148.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, if you're going to say that all ethics, all morality is written into the creation, you know, from the moment of Let there be light or whenever, you know, whatever point you want to say, then that suggests that Jesus is kind of in some sense an obstacle."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2148.6,"end":2150.04,"speaker":"Fr Stephen De Young","text":"These revealing other things, maybe."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2150.2,"end":2152.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, other things, yeah. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2152.39,"end":2155.67,"speaker":"Fr Stephen De Young","text":"But morality was already squared away through."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2155.67,"end":2162.47,"speaker":"Fr Andrew Stephen Damick","text":"Natural revelation, which makes you wonder, you know, why there's so much of this, if you love me, keep my commandments stuff going on."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2162.63,"end":2179.03,"speaker":"Fr Stephen De Young","text":"Right. And we also, importantly, we don't see. We don't see, despite how sometimes the Gospels are taught. I would go so far as to say we never see Christ giving new moral commandments."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2181.65,"end":2181.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2182.37,"end":2184.61,"speaker":"Fr Stephen De Young","text":"That weren't already there in the Torah, for example."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2185.01,"end":2188.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, and I mean, this raises the question of why give commandments at all?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2188.45,"end":2189.97,"speaker":"Fr Stephen De Young","text":"Yeah. Why even give the Torah?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2190.37,"end":2193.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What do you need that for if it's just in creation?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2195.65,"end":2239.94,"speaker":"Fr Stephen De Young","text":"Right. So it should be there. Second big problem and a related one, if it's all there, why did no one find it there? And I mean this seriously, right. I mean this seriously. We know too much about the ancient world now, Right. I'm trying to be kind to say John Calvin, right. John Calvin basically argued that all the principles of morality and ethics, he was part of this natural law tradition, that it was all found there, it was all available through Nature. Right. And you know what he used as evidence? How just the Roman Empire's laws were."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2240.34,"end":2254.66,"speaker":"Fr Andrew Stephen Damick","text":"Wow. That's because he didn't, you know, I don't know. I mean, I don't know what he thought the ancient world was really like. Apparently he thought way better than it told."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2254.66,"end":2256.1,"speaker":"Fr Stephen De Young","text":"Living in the 16th century."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2256.55,"end":2257.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2257.51,"end":2265.35,"speaker":"Fr Stephen De Young","text":"Okay. So I mean, I'm sure he's getting Roman law through, handed down, through later European developments."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2265.59,"end":2266.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2266.71,"end":2278.79,"speaker":"Fr Stephen De Young","text":"And this kind of thing, the way, the way people like in modern democratic societies talk about Greek democracy like it was anything remotely similar. Right, Right. I have to assume it's something like that. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2278.79,"end":2289.65,"speaker":"Fr Andrew Stephen Damick","text":"This is what we just have to give another plug for Tom Holland's Dominion. If you want to know what the ancient world was really like and how Christianity changed it, like ancient Rome is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2291.41,"end":2307.57,"speaker":"Fr Stephen De Young","text":"Not what needs to be held up. As an example, Caesar killing a million Gauls and enslaving a billion more. Yay. Caesar is the greatest guy ever. It's a vicious, rampant slavery, gladiatorial amusements."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2307.81,"end":2314.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, read the great epics, right. These are the greatest pieces of literature of this world and look at what they glorify."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2314.79,"end":2315.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2315.15,"end":2333.03,"speaker":"Fr Andrew Stephen Damick","text":"Like they like literally. I mean, it was interesting, you know, like you read the, the Iliad, for instance. I think I've referenced this on a couple episodes ago. But I mean, there are a lot of descriptions about people putting spears through other guys throats and how awesome and fantastic and glorious and amazing and manly and powerful and godlike that is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2333.35,"end":2337.59,"speaker":"Fr Stephen De Young","text":"Yeah. The really amazing part is when the guy with the spear in his throat gives a speech as he dies."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2337.67,"end":2338.79,"speaker":"Fr Andrew Stephen Damick","text":"I love that. Well."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2340.76,"end":2341.16,"speaker":"Fr Stephen De Young","text":"Come on."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2341.16,"end":2348.36,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if we didn't have that, then we wouldn't have the whole trope of I've stabbed the dragon through the heart and he has to give a big speech before he dies."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2348.6,"end":2350.2,"speaker":"Fr Stephen De Young","text":"So we need that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2350.52,"end":2351.4,"speaker":"Fr Andrew Stephen Damick","text":"I want that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2355.24,"end":2367.95,"speaker":"Fr Stephen De Young","text":"Yeah. When I was a kid, I thought somebody would get shot or something and it would take them like a good 10 minutes to die. But there was nothing you could do to stop it. Right. Just sit there and listen to them give a soliloquy. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2373.87,"end":2374.27,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2374.35,"end":2417.39,"speaker":"Fr Stephen De Young","text":"So, yeah. So the truth is, right, that the Christian conceptions of good and evil did have to be revealed. And they were revealed Right. At a certain point in human history to humans. Right. So because we could kind of see that that had to happen. We could kind of know that they're not at least in toto beyond broad strokes, encoded in some way that humans could actually make out on their own."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2417.79,"end":2418.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2418.27,"end":2418.55,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2418.55,"end":2431.68,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you, you could also argue, right, like that when God gave commandments, he was just sort of reminding that what was in the natural law. But doesn't that sort of suggest that maybe he didn't set up the natural law? So, great."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2433.04,"end":2437.6,"speaker":"Fr Stephen De Young","text":"Well, or you're just, you're not familiar with humans, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2438.08,"end":2440.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. You think that they were actually noble."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2440.24,"end":2447.12,"speaker":"Fr Stephen De Young","text":"And just, thou shalt not commit adultery. Like, and no one's going to ask, well, is XYZ technically adultery?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2447.85,"end":2449.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2449.69,"end":2469.37,"speaker":"Fr Stephen De Young","text":"Right. Because you could point at. Well, humans have always thought murder was wrong. Yeah. They've all defined murder in different ways. Right, Right. So, yeah, the Aztecs thought murder was wrong. They didn't think sacrificing foreigners to their gods was murder. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2469.93,"end":2470.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2471.29,"end":2513.23,"speaker":"Fr Stephen De Young","text":"Everybody thinks stealing is wrong. But how do you define stealing? So if you go beyond, if you go into any actual depth, these moral principles are not self evident in the world. They just aren't. Yeah, right. How many? How many? I mean, maybe, maybe this just seems so ridiculous to me because I hear confessions, I don't know. But like, well, is XYZ technically stealing? Right. Like, I mean, this is. All humans do this, myself included. Right. We all come up with justifications and loopholes and. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2513.23,"end":2518.67,"speaker":"Fr Andrew Stephen Damick","text":"All I did was steal a loaf of bread and now the gendarmes are following me for the rest of my life."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2518.75,"end":2528.91,"speaker":"Fr Stephen De Young","text":"But according to the Torah, that's fine. That isn't stealing according to the Torah. But see, the details like that have to be revealed."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2529.31,"end":2529.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2532.83,"end":2596.72,"speaker":"Fr Stephen De Young","text":"To protect poor Jean Valjean. So then, you know, another element that comes into that has come into this in terms of our popular understanding of ethics. Right. So what do we even judge as being good or evil? Meaning the way we've been talking about it so far tonight, we've been talking about actions, right? Right. Even when you're talking about God, we've been talking about God's actions. Right. But there is a move that happens once we get into the modern period, starting in the 16th century, where. Well, no, maybe we don't judge, right. What people do, but we judge their motivations. Right. What were they thinking? What was their intent?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2596.96,"end":2602.96,"speaker":"Fr Andrew Stephen Damick","text":"Why? My kids say things like, I didn't mean to and feel like that should be the end of the discussion."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2603.77,"end":2606.81,"speaker":"Fr Stephen De Young","text":"Right. So when you look at, when you look at."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2606.81,"end":2608.57,"speaker":"Fr Andrew Stephen Damick","text":"You'd pre pummel your brother."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2609.21,"end":2619.05,"speaker":"Fr Stephen De Young","text":"When you look at pre modern stuff, like when you look at guides to confession in the Orthodox Church for the pre modern period, for example, it will talk about voluntary and involuntary sins."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2619.53,"end":2620.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2621.69,"end":2649.88,"speaker":"Fr Stephen De Young","text":"And an involuntary sin in this instance is not like something you did involuntarily. Right. Like it's not, oh, you had a seizure and you hit someone and that was evil that you hit someone while having a seizure that you couldn't control. That's not what it's talking about. Voluntary and involuntary is talking about, I threw a rock at a guy versus I threw a rock over a fence and hit a guy. Hmm."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2650.36,"end":2650.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2651.16,"end":2656.98,"speaker":"Fr Stephen De Young","text":"But in the pre modern sense, those are both treated as you hit a guy with a rock."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2657.78,"end":2661.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's dead or he's bleeding. Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2661.22,"end":2662.98,"speaker":"Fr Stephen De Young","text":"You need to repent of both of those."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2663.62,"end":2664.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2664.26,"end":2665.3,"speaker":"Fr Stephen De Young","text":"The same way."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2665.86,"end":2666.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2666.9,"end":2699.59,"speaker":"Fr Stephen De Young","text":"Right. The one isn't okay because you didn't mean to, or the one isn't, you know, assault. And the other one is negligence. Right. They're treated the same way. Right. But this becomes a big thing in once very early in the modern period. I've chosen a couple examples totally at random. John Calvin and Thomas Hobbes. I think I'm the first person to ever group those two people together."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2701.43,"end":2708.28,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely. It's giving me some ideas for a comic strip or so. It's just an idea."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2708.28,"end":2709.2,"speaker":"Fr Stephen De Young","text":"Can you even draw?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2710.8,"end":2712.16,"speaker":"Fr Andrew Stephen Damick","text":"I can draw conclusions."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2712.56,"end":2736.76,"speaker":"Fr Stephen De Young","text":"Okay, well, that's fair. I could jump to conclusions. I have this mat where Anyway. So for Calvin, Right. This becomes very important. Right. Because this is what allows Calvin to say, nothing humans do is ever good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2738.12,"end":2738.6,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2738.92,"end":2745.96,"speaker":"Fr Stephen De Young","text":"Right. Because we're judging actions. It's kind of hard to argue that humans never do anything good if we're just looking at actions."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2746.84,"end":2747.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2747.8,"end":2758.68,"speaker":"Fr Stephen De Young","text":"Because like the Bible says, hey, if someone is hungry, feed them. And so if you have someone who is feeding someone hungry, they're doing a good thing. You would think."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2759.22,"end":2767.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although, you know, the total depravity people would say, all your righteousness is as filthy rags."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2767.22,"end":2849.96,"speaker":"Fr Stephen De Young","text":"Right, right. But this whole idea of motivation. Well, why is he doing it exactly? Is he doing it for a tax write off? Is he doing it to impress other people with how good he is? Is he trying to earn his way to heaven? He makes him feel good with that works righteousness. Yeah. It makes him feel good to do it. So it's not good anymore. Right, right. You can see how this has generated, you know, billions of neurotic people in the world through history who are constantly over analyzing and micro dissecting everything they do. Right. Because of this. Right. Instead of just, I don't know, Christ tells you to do something, so you do it anyway. And of course, when it comes to God. Right. When it comes to God, if you're John Calvin, then God has this whole plan that is the whole history of the universe. And in the end everyone is going to agree that that is good. And so since none of us know that the whole plan, none of us can judge God. So we just have to say that he is good because it's going to turn out that he was good in the end."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2850.36,"end":2851.4,"speaker":"Fr Andrew Stephen Damick","text":"Just trust him."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2851.8,"end":2968.68,"speaker":"Fr Stephen De Young","text":"Yeah. Because he is right. And Calvinism, we've said before, and in Calvinism you have this idea of justice, this category sort of pre existing or external to God, shall we say. Right. Which fits with that too. So on to Thomas Hobbes. Hobbes, you know, obviously deals with this in a very different way than John Calvin. But Hobbes says, well, all human actions have sort of one of two springboards. Either they're self centered. Right. Either I'm doing it for my own benefit or they're other centered. I'm doing it for the benefit of others. And if I'm doing it for the benefit of others, then that's good. Yeah. But if I'm doing it for my own benefit, that's bad because that's selfish. Now this is an improvement on Calvin because at least you can do good things, right? There is a space here for altruism, right. That isn't just wickedness by another name. Right. And you know, I don't want to bash on Calvinism too much. People are laughing somewhere. But does anyone really honestly think. Does anybody really honestly think that there's no substantive moral difference between me buying a meal for a homeless person and telling my friends I did it and me murdering someone anyway, so. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2968.68,"end":2980.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it doesn't, it doesn't fit with human experience, right. To say that all good deeds are actually evil. It just, it doesn't fit with our actual experience. Like you have to create this virtual reality in which everything is just always bad all the time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2980.88,"end":2981.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2981.2,"end":2986.76,"speaker":"Fr Andrew Stephen Damick","text":"But I was hoping you were going to say sorry Hobbesians because like we, you know, there's sorry Calvinists in your corpus all the time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2987.4,"end":2994.52,"speaker":"Fr Stephen De Young","text":"But how many Hobbesians are there anymore? Sorry Leviathan fans. That would be a whole other thing."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2995.56,"end":2996.32,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":2996.32,"end":3028.34,"speaker":"Fr Stephen De Young","text":"Yeah, but okay, sorry Hobbesians or tigers or whatever. But yeah. So the. Are we really to believe that every action I take that is for my own benefit, like caring for my health if that was something I did? Or brush your teeth, you know, you brush your teeth, right? You try and eat healthy, you exercise. That's bad because you're just doing it for you, it's selfish."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3029.17,"end":3032.85,"speaker":"Fr Andrew Stephen Damick","text":"Although there is a point at which brushing our teeth is altruistic."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3034.37,"end":3040.53,"speaker":"Fr Stephen De Young","text":"Well, yeah, yeah, you have to brush your teeth purely for the benefit of those who are going to see you the next day and smell your breath."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3040.77,"end":3041.41,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3041.49,"end":3042.61,"speaker":"Fr Stephen De Young","text":"For no other reason."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3043.01,"end":3047.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. Just putting that out there."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3047.97,"end":3069.24,"speaker":"Fr Stephen De Young","text":"Right. And so, and this way of thinking that you find in Hobbes and lots of other places in modern thinking, this is what produces the kind of nut bar reaction you get from like Ayn Rand, right. Who just says that's ridiculous. And so she decides, no, no, selfishness is good and doing things for other people is bad."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3071.72,"end":3073.44,"speaker":"Fr Andrew Stephen Damick","text":"Rational selfishness, that's."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3073.44,"end":3115.99,"speaker":"Fr Stephen De Young","text":"Yeah. Just like wraps it around, right. You go get yours, don't worry about everybody else, Right. And then lives on the government dole for most of her life. But anyway, yeah, like it doesn't ultimately work, right? It doesn't ultimately work. And remember the parable Christ gave us, right? There's the two sons. God says to the one son, go work in the vineyard. Or his father says to the one son, go work in the vineyard. And he says, nah man, not Today, I'm playing PlayStation. And I may have altered this a little to modernize it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3117.75,"end":3119.11,"speaker":"Fr Andrew Stephen Damick","text":"Still better than the message."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3119.59,"end":3231.78,"speaker":"Fr Stephen De Young","text":"Yeah. But then later he feels guilty and so he goes out and he gets to work, right. And then there's the other brother who is like, oh yeah dad, I'm on top of it. And then never goes and does it, Right. Like Christ asks which one pleased his father, Right. So doing the right thing, even if it's for the wrong reasons or tainted reasons or stupid reasons or misguided reasons, reasons, is still doing the right thing, right? Yeah. And the neurotic self analysis doesn't help anything. Well, so then, so then with this, you know, we can't get into anyone's head, right? We can't really get into someone else's head and find out, well, like what were they thinking? Why did they do it? Why did they say that? What did they mean by that? Were they trying to do that? You know, that kind of becomes a dead end when it comes to other people. You can neurotically overanalyze yourself, but it's hard to do that with other people when you're, when you're trying to assess their behavior. So then another very common modern proposal of how to deal with this is just, well, what are the consequences of what they did? Right. Yeah. This seems to try to get back to some of that pre modern sense of the action, right? Like, it doesn't matter whether you threw the rock at the person or you just threw it over the fence. Person still got hit with a rock. Right. That was the consequence of your actions. Right. So we'll just deal with that. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3232.02,"end":3275.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, but this is very much a live idea, right. Where particularly, you know, political correctness. Right. Where you could say something that for all of your life has been a harmless thing to say, you know, and not even, like. Not even a little bit mean or whatever or, you know, like closet giggling, you know, but. But really just something that's a harmless thing to say, but someone heard you say it and they were offended. And so therefore you must be held responsible because the consequence of you saying that was that another person felt something negative."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3276.48,"end":3319.61,"speaker":"Fr Stephen De Young","text":"Right. Right. It's. What. What were the consequences of your speech in that time and place? What were the results? Right. Yeah. And that also touches on. Which we'll only touch on briefly because it's driving me nuts. But young people, by this, I mean anyone younger than me, by this, I mean most of our audience. Speaking and acting are not the same thing. I know you've been told all your life that speaking and acting are the same thing. You've been taught this, that saying something and doing something are the same thing."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3319.93,"end":3336.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you say the wrong thing, you should lose your job. You should be canceled. You should be, whatever. You say the right thing. That means you're standing up for whatever. It's funny. Like, you know, you see this on social media all the time. Like, I stand with and then fill in the blank. Whoever, whatever."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3336.08,"end":3338.92,"speaker":"Fr Stephen De Young","text":"And I'm like, you've done nothing to help those people. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3338.92,"end":3345.64,"speaker":"Fr Andrew Stephen Damick","text":"In what sense are you standing with them? Like, what does that. I changed my profile picture. I'm standing."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3345.64,"end":3351.6,"speaker":"Fr Stephen De Young","text":"I've done nothing. The Ukrainian flag is not helping anybody in Ukraine. The Russian flag is not helping anyone in Russia."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3351.6,"end":3355.6,"speaker":"Fr Andrew Stephen Damick","text":"Is someone going to stand up for the truth here? What is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3356.2,"end":3363.48,"speaker":"Fr Stephen De Young","text":"Talking and acting are not the same thing. And on the flip side, right, Someone's saying something mean to you. Right. They are not hurting you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3363.8,"end":3364.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3366.2,"end":3368.12,"speaker":"Fr Stephen De Young","text":"If they punch you in the nose, they're hurting you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3368.36,"end":3368.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3369.56,"end":3387.33,"speaker":"Fr Stephen De Young","text":"Okay. Talking and acting are two different things. And talk is cheap. So. But anyway. Old man yells at clouds. But. So, yeah, but. So there's this. We go by the consequences, we go by the results."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3387.81,"end":3394.97,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's like what Hadaway said. What is love, baby, don't hurt me. It's not just talking, Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3394.97,"end":3396.93,"speaker":"Fr Stephen De Young","text":"Don't hurt me no more, no more."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3396.93,"end":3398.77,"speaker":"Fr Andrew Stephen Damick","text":"Right. She's Been hurting him for a while."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3398.77,"end":3414.85,"speaker":"Fr Stephen De Young","text":"So he's been able to overlook the hurts of the past. Right. But now, going forward, if you love Hadaway, you have to stop hurting him. I say this to everyone. If you love Hadaway, you have to stop hurting him."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3414.85,"end":3416.33,"speaker":"Fr Andrew Stephen Damick","text":"So you've stood up for the truth. Today."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3416.41,"end":3417.97,"speaker":"Fr Stephen De Young","text":"I'm standing up for Hadaway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3417.97,"end":3419.45,"speaker":"Fr Andrew Stephen Damick","text":"We're standing with Hadaway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3423.13,"end":3449.97,"speaker":"Fr Stephen De Young","text":"So someone might try to justify this kind of approach by saying, well, doesn't the Bible say you judge a tree by its fruit? Right. And say, okay, well, so see the results. Right. The results. Right. If what you're doing is good, it should bring good results, and if what you're doing is bad, it should bring bad results. Right. That's what that means. Except that's not what that means."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3450.85,"end":3459.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the fruit of the spirit, Galatians 5. Right. Love, joy, peace, long suffering, self control."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3461.5,"end":3464.62,"speaker":"Fr Stephen De Young","text":"It's not, you forgot kindness, goodness, patience, gentleness."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3464.86,"end":3468.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, it's not, look at the results. It's. Look at the character of this person."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3470.94,"end":3474.54,"speaker":"Fr Stephen De Young","text":"Right, Right. That is not a list of results."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3474.94,"end":3477.22,"speaker":"Fr Andrew Stephen Damick","text":"That's the fruit of the spirit is the character."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3477.22,"end":3521.91,"speaker":"Fr Stephen De Young","text":"Yeah. And the other problem with this, with trying to go by consequences, is right. From Genesis in the Bible, we see how over and over again, one of the main things God does with reference to the evil in the world is he. God brings good out of evil in spite of itself. God takes evil actions and brings good out of them despite them. We've talked about this in terms of why he allows demonic activity. Paradigmatic example, of course, in Genesis is Joseph. Right. His brothers want to kill him. They sell him into slavery. They had no good intentions toward him."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3522.15,"end":3525.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have meant it for evil. God has turned it to good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3526.23,"end":3531.67,"speaker":"Fr Stephen De Young","text":"Right. But God uses that to save them all from a famine. And all of Egypt."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3531.91,"end":3532.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The whole region."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3536.15,"end":3559.92,"speaker":"Fr Stephen De Young","text":"So someone might ask, say in the book of Romans, Right. Well, hey, I mean, if God brings good consequences even out of the evil we do, why do we worry about ethics or morality? Why don't we just do whatever. And even if we're doing evil, God will come and bring good out of it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3560.16,"end":3562.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we could just. Sin and grace will abound."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3562.56,"end":3562.96,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3562.96,"end":3565.27,"speaker":"Fr Andrew Stephen Damick","text":"Makes total sense. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3566.95,"end":3610.66,"speaker":"Fr Stephen De Young","text":"And so that kind of consequentialism might work in a universe where there's no God. Right. But if we live in a universe where God will bring good even out of the worst of human evil, and we're still working to define what that means, don't forget. But we'll get there, then that means we can't just go by consequences, because there will be a lot of things, a lot of examples we'll find of horrible, horrible, hideous human evil, but where there are good things that happen in it and during it and relating it, through it and sometimes even because of it. Yeah, but that doesn't justify the evil. That doesn't make the evil good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3611.06,"end":3612.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3612.42,"end":3617.78,"speaker":"Fr Stephen De Young","text":"That doesn't make the evil. Okay, right. This is the problem with going by consequences."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3619,"end":3620.92,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3624.36,"end":3634.12,"speaker":"Fr Stephen De Young","text":"Then we have good old Immanuel Kant. Kant, even. You gotta do at least one Kant joke anytime you bring him up."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3635.16,"end":3640.68,"speaker":"Fr Andrew Stephen Damick","text":"You know, whenever someone mentions Immanuel Kant, all I hear in my head is the Philosopher song by Monty Python."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3640.84,"end":3641.32,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3641.48,"end":3645.35,"speaker":"Fr Andrew Stephen Damick","text":"I can't. I didn't intend that pun, but I can't."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3645.35,"end":3651.87,"speaker":"Fr Stephen De Young","text":"The basic premise of that is true, by the way, that all philosophers were just drunks, basically drunk."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3651.87,"end":3652.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3655.15,"end":3690.47,"speaker":"Fr Stephen De Young","text":"But. So Kant famously comes up with this categorical imperative. This is how we figure it out. Right. This is how we figure out what's right and wrong right in the world. Kind of has a God hanging around, but barely. Right. Right. In his universe. So he says, well, here's this concept of the categorical imperative. The idea there is that this is an ethical principle that could be applied to everyone in every situation all the time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3690.71,"end":3693.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If it's right and wrong for me, it has to be right and wrong."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3693.11,"end":3697.67,"speaker":"Fr Stephen De Young","text":"For everybody else in order for it to function as a categorical imperative. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3697.88,"end":3698.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3698.76,"end":3724.68,"speaker":"Fr Stephen De Young","text":"So, for example, he would say, well, I might be in a situation where it seems to me like the right thing for me to do is lie for various reasons, but I should then think to myself, self, I should think, what if everyone lied all the time? Well, that would be very bad. Yeah. Therefore, I should not lie at this time in this circumstance."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3724.92,"end":3726.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Try to remove all context."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3727.24,"end":3727.64,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3727.88,"end":3728.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3728.92,"end":3770.98,"speaker":"Fr Stephen De Young","text":"Right. So no reference to any situation. Right. So, I mean, there's a basic problem, Andy Kant admits this. Like, you can't use categorical imperatives as the basis for all ethics because he could only come up with a couple of them that actually worked. Right. In all possible. Right. And so. But the overarching structure that comes from that kind of argumentation in Kant, that's called deontological ethics is an ethics that's based primarily in duty. You have a duty and a responsibility to do certain things regardless of the consequences."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3772.02,"end":3783.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I cannot tell a lie, Therefore. Yeah. I mean, and you know, the classic. You know, one of the classic foils to this is, well, let's say you are In Nazi Germany and there are."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3783.67,"end":3786.47,"speaker":"Fr Stephen De Young","text":"Oh, God, with law now, everyone's tuned out anyway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3787.75,"end":3793.59,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But, you know, let's say you're Nazi Germany and can't we be somewhere else?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3793.59,"end":3795.99,"speaker":"Fr Stephen De Young","text":"Can't we be in Pol Pots Cambodia?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3796.07,"end":3817.68,"speaker":"Fr Andrew Stephen Damick","text":"Sure. Okay, that's fine. You know, and there's somebody. There's somebody that the government wants to kill hiding in your house, and they say, where are they? You know, should you lie to save their lives or should you say, well, I cannot tell a lie. They are in the parlor, you know, knowing full well that they're gonna walk in and shoot them or take them off to gas chambers or whatever."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3818.8,"end":3864.14,"speaker":"Fr Stephen De Young","text":"Right? And so this idea that there are just these principles, however you want to attain them, whether you want to attain them, as Kant wants to do, through logical reasoning, if you want to claim they come from nature, if you want to claim. If you want to take the commandments of the Bible and treat them as absolute in this way, right? You run into these very, very practical problems, right? These very, very practical problems. And functionally, you look at the history of Christian ethics and before that, Jewish ethics, and it's very clear, for example, that when it comes to saving a human life, all the other commandments go away."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3865.26,"end":3867.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a sort of hierarchy, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3868.54,"end":3909.38,"speaker":"Fr Stephen De Young","text":"This is what Christ was always arguing with the Pharisees about with the Sabbath, right? They say, oh, you're not allowed to do this on the Sabbath, right. You say, well, if your donkey falls in a ditch on the Sabbath, you pull the donkey out of the ditch, don't you? Out of compassion for the donkey. So how much more compassion for a human, right? These kind of arguments, right? But the point here is Christ very clearly doesn't treat no working on the Sabbath as an absolutely sacrosanct rule. And neither did the Pharisees, for that matter. As you just pointed out in that example, they had exceptions. Yeah, yeah, right. Everyone has exceptions, right? You could argue about what should be."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3909.38,"end":3914.94,"speaker":"Fr Andrew Stephen Damick","text":"The exceptions, but like, you know, a Sabbath day's walk, but if you take one more step, then you're working."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":3915.36,"end":4004.55,"speaker":"Fr Stephen De Young","text":"Yeah. It gets weird and arbitrary at a certain point, in the modern sense of the word, arbitrary. And so that's why you can argue about it. But they didn't argue that there are no exceptions, right? No one ever argued that. No one in the Jewish Christian traditions treated. And early Christian traditions at least, ever treated the commandments of the Bible that way, right? So that's kind of a problem, right? In terms. For. For that kind of view of how to what's good or evil, to try and reduce it to rules or principles that are derived in some way. So then the most recent sort of attempt at this that I've seen, this is the approach taken by Sam Harris at his recent book. He did not invent this. There are versions of this going back into the 19th century and even the late 18th century, but he has sort of the most recent version. And by the way, anyone listening to this who knows who Sam Harris is and doesn't know who his mother, Susan Harris, is, needs to go look up Susan Harris. You didn't think this was gonna happen, did you?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4004.55,"end":4007.07,"speaker":"Fr Andrew Stephen Damick","text":"Father Henry? No, this was. I was not prepared for this."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4007.15,"end":4033.48,"speaker":"Fr Stephen De Young","text":"Yes. Susan Harris, his mother, was one of the first female TV writers. She was incredibly successful. She won an Emmy for writing on Hill Street Blues. She created the Golden Girls. Sam Harris is very much the fail son of his mother. If you're upset about that, Sam, call in. We'll discuss it. Or I'll come on your show. I don't."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4033.48,"end":4034.04,"speaker":"Fr Andrew Stephen Damick","text":"I don't mind."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4035,"end":4069.97,"speaker":"Fr Stephen De Young","text":"No, it's behind a paywall. I won't come on your show. Okay, so, yeah, and so this, this idea, what Sam Harris does with it, his version is. Well, okay, look, we can all agree, all of us who are rational could agree that the worst possible world to live in would be a world where every sentient being, because he wants to include a lot of animals, every sentient being was constantly suffering the most horrible possible suffering. That would be the worst possible world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4070.38,"end":4070.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4070.7,"end":4076.18,"speaker":"Fr Stephen De Young","text":"Okay, well, that's the worst possible world would be. Yeah, that's hard to argue with. Right. That that wouldn't be the worst possible world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4076.18,"end":4077.46,"speaker":"Fr Andrew Stephen Damick","text":"That'd be pretty bad. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4077.46,"end":4077.9,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4078.62,"end":4083.26,"speaker":"Fr Andrew Stephen Damick","text":"So the best would be maximal pleasure all the time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4083.82,"end":4087.26,"speaker":"Fr Stephen De Young","text":"Yeah. For all sentient creatures. That would be the best possible world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4087.5,"end":4087.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4087.98,"end":4093.34,"speaker":"Fr Stephen De Young","text":"And so we define morality by working toward the best possible world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4094.54,"end":4095.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4095.58,"end":4110.23,"speaker":"Fr Stephen De Young","text":"Right. And so things are bad if they cause suffering to sentient creatures, and things are good if they bring joy and pleasure and growth to sentient creatures."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4110.31,"end":4152.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When I was an undergrad, back in the before times, one of my friends and co workers, this was his ethical theory, Right. And he kind of gave it a nice sort of little Star Trek y kind of Paul to it. He referred to trying to gather as many hedons. So he don't, you know, the, the pleasure particle, it's like tachyons, but. But pleasure particles. And, you know, the point was to try to generate as many hedons for yourself and others as possible. That was his Ethical theory. He was, he was a self avowed atheist, you know, decent guy, good guy. But yeah, that was his, his. He didn't call it hedonism. That's what it was."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4152.61,"end":4158.61,"speaker":"Fr Stephen De Young","text":"I mean it is properly speaking, it's a form of hedonism. Right. That's not what we think of when we think of hedonism."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4158.61,"end":4158.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4158.93,"end":4161.09,"speaker":"Fr Stephen De Young","text":"I mean we think of bacchanalia when we think of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4161.49,"end":4171.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. But there's a kind of like epicurean, you know, the high, the beautiful, the, you know, the glorious, the best possible pleasures kind of things."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4171.41,"end":4222.66,"speaker":"Fr Stephen De Young","text":"But so, but yeah, so earlier forms of this, they would literally have things called like a hedonistic calculus where they would have quasi mathematical and rational ways to try to, you know, compare. Right. The joy that this brings to this many people versus the joy that that other thing brings to that many people and all this kind of stuff. Right. To try to make this objective and sort of mathematic and scientific and all of this stuff. Right. And of course, the reason we're trying to make it mathematical and objective and scientific and all this stuff is because God's pretty much out of the picture at this point for these folks. So they're trying to figure without reference to God. And here's the functional problem. Once you've got God and the afterlife and judgment and all of that kind of stuff gone, why should I care about the suffering of other people who I don't know and will never meet?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4223.22,"end":4226.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Why be altruistic? Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4226.06,"end":4246.55,"speaker":"Fr Stephen De Young","text":"No, I can understand why I should care about my family members, people close to me. I understand why I should care about the other people in my city, even my nation. Right. Because I benefit from. Right. From all this. Right. But why should I care about starving kids in Africa?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4248.47,"end":4248.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4248.91,"end":4253.83,"speaker":"Fr Stephen De Young","text":"Never met one in this kind of case. Never will meet. Most of these people."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4255.59,"end":4256.27,"speaker":"Fr Andrew Stephen Damick","text":"Have no effect."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4256.27,"end":4257.39,"speaker":"Fr Stephen De Young","text":"On my life, in fact."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4257.39,"end":4262.84,"speaker":"Fr Andrew Stephen Damick","text":"I mean, who's going to say I'm willing to sacrifice to serve the algorithm of Pedin it?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4262.84,"end":4288.04,"speaker":"Fr Stephen De Young","text":"Well, but it's not even that. It's not even that because the algorithm doesn't work this way. Right, right. In fact, some of those kids who are starving are basically enslaved by Nestle Corporation to get rid. Oh, here we go. Here's the letters. Anyway, enslaved by Nestle Corporation in Africa. Right. They're why I could get cheap chocolate. So their enslavement and deprivation is making my life better."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4292.59,"end":4295.47,"speaker":"Fr Andrew Stephen Damick","text":"Everyone's quietly hiding their Nestle chocolate everywhere."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4295.47,"end":4307.87,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. Right. Why should I care about that from this view? Why should I make my Life worse to benefit these people I don't know and will never meet."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4308.19,"end":4311.95,"speaker":"Fr Andrew Stephen Damick","text":"Especially because if there is no hereafter."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4314.04,"end":4315.16,"speaker":"Fr Stephen De Young","text":"There'S not gonna be a reckoning."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4315.24,"end":4339.48,"speaker":"Fr Andrew Stephen Damick","text":"What? Yeah. Like why? Like, why should I sacrifice and suffer in my life so that other people's lives can be better if there's ultimately. No, it's just like, oh, well, I. I guess I'm the loser, you know, Or. Or like I'm willing to accept little losses, whatever it might be, because, like, there's no greater good that we all get to partake of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4340.49,"end":4361.29,"speaker":"Fr Stephen De Young","text":"Right? And this is something that most of our atheist friends haven't reckoned with, that once you get rid of there being a reckoning, once you get rid of there being justice at the end of the day, right. This is even a problem for."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4364.41,"end":4364.69,"speaker":"Announcer","text":"Some."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4364.69,"end":4403.93,"speaker":"Fr Stephen De Young","text":"Of the universalist folks, then why shouldn't I be Henry Kissinger? Here's some more letters. Why should be a person who lives his whole life surrounded by wealthy, powerful people, lives in wealth, More than three million people dead at my orders. Right. Were the three other people dead? Completely debauched and sexually immoral man died at. What was he, 100? He was close to 100."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4405.21,"end":4406.85,"speaker":"Fr Andrew Stephen Damick","text":"Isn't he still alive? I don't know."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4406.85,"end":4407.69,"speaker":"Fr Stephen De Young","text":"No, he's dead."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4407.69,"end":4408.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is he?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4408.57,"end":4411.69,"speaker":"Fr Stephen De Young","text":"He died on my wife's birthday this year. It was a great gift from God."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4412.49,"end":4412.97,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4415.45,"end":4426.84,"speaker":"Fr Stephen De Young","text":"I'm sorry. I know you're not supposed to speak ill of the dead and really, I know what scriptures say. How did I. I know that God does not delight the death of a wicked man. I'm not God. I'm a sinner. I'm glad Henry Kissinger is dead anyway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4426.84,"end":4429.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. He was just over 100 years old."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4429.44,"end":4431.08,"speaker":"Fr Stephen De Young","text":"Yes. Just over 100 years old."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4431.32,"end":4431.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4433,"end":4467.57,"speaker":"Fr Stephen De Young","text":"I'm sorry. If you're an atheist, right, how did he not do it? Right? If we could summon the ghost of Christopher Hitchens, who hated Henry Kissinger, right? Say, hey, Hitch. How did he not do it right? He was wealthy and powerful, sexually decadent his entire life. Lived to be a hundred blood all over his hands. How is he not living his best life? Right. As Christians, we know there's a reckoning, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4468.53,"end":4469.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4469.01,"end":4485.68,"speaker":"Fr Stephen De Young","text":"But without that, without there being some kind of reckoning, there is no way to construct a reasonable ethical system like this because most of the wicked people in the world get away with it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4487.6,"end":4490.48,"speaker":"Fr Andrew Stephen Damick","text":"Which is, you know, of course, repeated in the psalms over and over again. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4490.48,"end":4495.04,"speaker":"Fr Stephen De Young","text":"If there's no God, right, Then the wicked just all get away with it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4495.36,"end":4496.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4497.13,"end":4498.57,"speaker":"Fr Stephen De Young","text":"Or if you're a universalist."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4500.97,"end":4502.73,"speaker":"Fr Andrew Stephen Damick","text":"Well, on that bright and cheery note."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4505.13,"end":4511.01,"speaker":"Fr Stephen De Young","text":"There'S gonna be like Kissinger people emailing you. There's gonna be like Nestle Crunch fans emailing you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4511.01,"end":4517.05,"speaker":"Fr Andrew Stephen Damick","text":"I mean, okay, I will understand the Nestle Crunch offended, but if I have people like defending Henry Kissinger to me."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4518.25,"end":4522.89,"speaker":"Fr Stephen De Young","text":"Oh yeah, God bless you. That'll be next level. That'll be next level."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4524.53,"end":4532.53,"speaker":"Fr Andrew Stephen Damick","text":"I'm sure they're out there. All right. Well, that said, okay, this is the, this is the end of the first half of this episode of the Lord of Spirits. We're going to be right back after this break."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4532.61,"end":4548.93,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4554.22,"end":4569.02,"speaker":"Fr Stephen De Young","text":"What are we to make of the unseen world and spiritual warfare? The Lord of Spirits book version is now available@store.ancientfaith.com written by Father Andrew Stephen Damick."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4569.9,"end":4601.23,"speaker":"Fr Andrew Stephen Damick","text":"To the modern mind, dragons and demons are just the inner demons of psychology and angels are often reducible to the better angels of our nature, that is to our better human impulses and virtues. Talk of spirits is really about psychology, but to the ancient mind of millennia ago, even up to the pre modern mind of just centuries ago, these are real beings with personal presence who inhabit our world and affect us."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4602.19,"end":4605.43,"speaker":"Fr Stephen De Young","text":"Father Andrew provides a distillation and explanation."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4605.43,"end":4608.15,"speaker":"Announcer","text":"Of the material in the popular podcast."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4608.15,"end":4622.15,"speaker":"Fr Stephen De Young","text":"The Lord of Spirits which he co hosts with Father Stephen DeYoung. Get this brand new book today at store.ancientfaith.com that's store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4622.15,"end":4637.2,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Fr. Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4638.88,"end":4650.12,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. I haven't and during the break I did not get any Pro Kissinger emails. So we might be in the clear. I don't know. Of course, you know, a lot of people will be listening to this tomorrow."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4650.12,"end":4663.22,"speaker":"Fr Stephen De Young","text":"So yeah, yeah, I'm pretty sure that was on no one's bingo card for 2024 was Father Stephen goes off on Henry Kissinger. I mean if someone had said to."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4663.22,"end":4667.82,"speaker":"Fr Andrew Stephen Damick","text":"Me what is the likelihood that that will happen? I'm like, oh, 100%."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4668.54,"end":4677.78,"speaker":"Fr Stephen De Young","text":"I could see that happening. Yeah, yeah, yeah, yeah, it does check out, but still not necessarily what people thought was in the works here, y'."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4677.78,"end":4678.5,"speaker":"Fr Andrew Stephen Damick","text":"All thought he was going to go."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4678.5,"end":4681.94,"speaker":"Fr Stephen De Young","text":"Off on Sam Harris, but no, no, no, no."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4683.46,"end":4684.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Well, welcome back."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4686.74,"end":4691.62,"speaker":"Fr Stephen De Young","text":"At least I use someone other than Hitler as an example of the most evil person who's ever lived."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4691.62,"end":4735.99,"speaker":"Fr Andrew Stephen Damick","text":"I know. I mean, Godwin's Law doesn't mention Henry Kissinger by name. Yes, but yeah, yeah. So, yeah, we're talking about goodness and evil here on the Lord of Spirits podcast. And we just talked about a number of attempted models by which people judge God, by which people judge right and wrong for humans. And we mentioned some of the difficulties that those models have. We have not yet put forward any solutions. I think this will be a classic Lord of Spirits episode in which we would do not get to the answer until sometime in the third half. And actually, I think this one, it's towards the end of the third half."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4735.99,"end":4738.79,"speaker":"Fr Stephen De Young","text":"Yes. So you're on a journey, people."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4739.11,"end":4754.07,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Exactly. Board that boat. Theseus, your captain will take you on this trip. So, okay, right, so what exactly is evil?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4754.47,"end":4780.24,"speaker":"Fr Stephen De Young","text":"Right, so the first half we were mainly talking about what's good, right. Now we're gonna kind of talk more about the concept of evil. Right. And what that means. And there may be folks thinking to themselves that, well, it's just the opposite of good. Right. So whatever we say good is, evil's the opposite of that. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4780.24,"end":4792.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We do have, by the way, we have a caller from Tennessee who is calling in. Although his telephone says he's from North Carolina, but that's how it goes, I guess."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4792.29,"end":4793.13,"speaker":"Fr Stephen De Young","text":"That's shady."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4793.37,"end":4801.57,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, but it's still the south, sort of. Is Tennessee the south, caller, if that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4801.57,"end":4802.65,"speaker":"Fr Stephen De Young","text":"Is your real state?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4806.41,"end":4815.1,"speaker":"Fr Andrew Stephen Damick","text":"I'm just hearing crackling. Are you there, William? Nope. Nope. We're having trouble getting hold of Creature."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4815.1,"end":4816.26,"speaker":"Fr Stephen De Young","text":"In the Twin Peaks revival."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4816.5,"end":4827.9,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Well, actually, I never. You know, Twin Peaks is too creepy for me. I've. Yeah, I've never watched it. I can't even do Doctor who. I think, as we've discussed this before, too creepy for me. Something about weaklings."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4827.9,"end":4831.7,"speaker":"Fr Stephen De Young","text":"Creepy for eight year olds. Yeah, that's like being at eight year olds."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4831.7,"end":4835.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm very tender hearted, you know, I guess."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4836.98,"end":4839.7,"speaker":"Fr Stephen De Young","text":"Whereas my conscience has been seared as by a hot iron."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4840.5,"end":4844.74,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Well, God willing, we'll be able to get William back here."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4845.94,"end":4846.5,"speaker":"Fr Stephen De Young","text":"Call us back."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4846.5,"end":4851.78,"speaker":"Fr Andrew Stephen Damick","text":"And he won't just have that crackly sound. Okay, so, William, are you there?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4855.78,"end":4858.18,"speaker":"Fr Stephen De Young","text":"Well, speak to us, William. Who did this to you?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4860.1,"end":4870.54,"speaker":"Fr Andrew Stephen Damick","text":"William? Welcome to the Lord of Spirits. Podcast. Oh, just got that lovely crackly sound again. I feel like he's communicating, but it's just I don't speak that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4870.78,"end":4873.82,"speaker":"Fr Stephen De Young","text":"My Morse code isn't that good. Batman would be so disappointed."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4876.14,"end":4894.38,"speaker":"Fr Andrew Stephen Damick","text":"Blink three times if you're being tortured by Canadians. Blink five times if you're being tortured by New Zealanders. Anyway, I hear him blinking, but it's just not coming through. All right, well, we'll just have to. Have to roll on, but thank you for calling, William. It's a good try."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4894.7,"end":4896.59,"speaker":"Fr Stephen De Young","text":"I don't know how Canadians would even torture someone."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4897.22,"end":4897.7,"speaker":"Announcer","text":"I don't."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4897.7,"end":4899.94,"speaker":"Fr Stephen De Young","text":"Maybe give them only small portions of poutine."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4903.94,"end":4906.3,"speaker":"Fr Andrew Stephen Damick","text":"Have really soggy fries with your poutine."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4906.3,"end":4977.94,"speaker":"Fr Stephen De Young","text":"That's right. I'm continuing. I'm continuing the horrible, harmful stereotype of Canadians that they're very polite. Deal with it. So, yeah, so we're going to talk about evil. And as I said, that may. You know, it may seem obvious, Right. We may be able to give some obvious examples of things that are evil, like Henry Kissinger, but the way in which evil in particular and its relationship to good have been conceived of in the history of humanity, in the recorded history of humanity at least, has changed drastically. Right, has changed drastically. And this is. We kind of alluded to this a little bit when we were talking about the fact that sort of no one arrived at Christian ethics through natural law before Christianity. But that is really the pivot point, right? That is really the pivot point."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4978.42,"end":4998.82,"speaker":"Fr Andrew Stephen Damick","text":"By the way, I was gonna say we did get a. We did get a comment from one of our Canadian listeners, and she's actually called in in the past. This is Catherine of the Great White Zafone. She says that Canadians torture people with excessive politeness."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":4999.3,"end":5001.38,"speaker":"Fr Stephen De Young","text":"Oh, they just ramp up the politeness."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5001.46,"end":5003.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're really sorry."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5003.54,"end":5009.14,"speaker":"Fr Stephen De Young","text":"Just like they give me their poutine and they ask about your drink like, every three seconds."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5010.44,"end":5010.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5012.28,"end":5013.6,"speaker":"Fr Stephen De Young","text":"I mean, that would work on me."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5013.6,"end":5015.72,"speaker":"Fr Andrew Stephen Damick","text":"Because there's kind of only so much that I can handle."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5015.96,"end":5076.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. So. And when I say that Christianity is really the pivot point, that's not because we're not talking about the Old Testament or Second Temple Judaism. It's because. Right. Ancient Israel, Second Temple Judaism, weren't taking the view of good and evil that was revealed to them in the scriptures and sort of proselytizing the world with it the way Christianity did. Right. And so that's why it's Christianity in particular that marks this pivot point in terms of how most of us think about it. But so when you read in sources that are talking about this, that are before, that are pre Christian sources, what you find is that the idea of, say a good or a bad person, right. This is a good person, this is a bad person, is very similar to the idea of like a good or bad chair."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5078.35,"end":5078.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5078.71,"end":5080.03,"speaker":"Fr Stephen De Young","text":"Or a good or bad apple."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5080.27,"end":5085.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not good and evil. It's sort of, you know, better and worse."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5086.11,"end":5087.39,"speaker":"Fr Stephen De Young","text":"Right. It's a quality."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5088.03,"end":5095.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like this is a good chair, you know, Wouldn't say. As opposed to an evil chair. No. As opposed to a crappy chair, you know."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5095.95,"end":5100.39,"speaker":"Fr Stephen De Young","text":"Yeah. As opposed. Yeah. As opposed to a rickety chair or an uncomfortable chair."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5100.39,"end":5102.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's about capability."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5104.03,"end":5105.99,"speaker":"Fr Stephen De Young","text":"Performance functions. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5105.99,"end":5106.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5107.23,"end":5114.51,"speaker":"Fr Stephen De Young","text":"And yeah. Has certain. Some of the qualities that make it a chair are very excellent, Right. Like comfort or whatever."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5114.59,"end":5115.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5115.39,"end":5150.98,"speaker":"Fr Stephen De Young","text":"Or an apple. Right. The bad apple might be just like a rotten apple, an apple that's not ripe yet an apple is. Right. Whereas a good apple might be big and ripe and juicy, etc. Right. And so this is how humans were looked at. There wasn't really a concept of good and evil the way we think about it, Right. That we're like governing particular actions or this or that. Right. So it was, this is a better person, this is a better human."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5151.3,"end":5151.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5151.66,"end":5153.94,"speaker":"Fr Stephen De Young","text":"This is a worse person or a worse human."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5154.02,"end":5160.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. If you're strong, if you're good looking, if you're powerful, if you're wealthy, you are intelligent."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5160.5,"end":5160.94,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5160.94,"end":5162.38,"speaker":"Fr Andrew Stephen Damick","text":"You are better. You are better."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5162.38,"end":5204.44,"speaker":"Fr Stephen De Young","text":"Right. You are good. If you're poor, dumb, unattractive, according to your society, physically weak, sick, disabled. Right, whatever, then you are bad. Right. And so ethics, at this point, right. When you look at like Aristotle's ethics, ethics is, well, okay, how do you be a good person? But it's how to be a good person in that sense. Right. It's how to be a good person in the sense of, you know, how to be courageous. Yeah. Particularly how to train a child to be courageous."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5205.16,"end":5205.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5206.6,"end":5243.42,"speaker":"Fr Stephen De Young","text":"Right. Or how to train a child to be sort of a generous benefactor. Right. Of the arts. How to, you know, for Aristotle, humility is a vice. Right. Because for Aristotle, all virtues are a mean between two extremes. So on one extreme, he has people who are sort of arrogant and take more credit for themselves, think better of themselves than is true. But then on the other side, you have humble people, right. And he says, no, that's bad too. That's just as bad, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5243.42,"end":5246.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because both are lies, effectively."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5246.9,"end":5251.3,"speaker":"Fr Stephen De Young","text":"You want to be a person who has a completely accurate Sense of how great you are."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5252,"end":5252.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5256.32,"end":5277.28,"speaker":"Fr Stephen De Young","text":"Right, right. But it's all about. It's, you know, it's, it's cultivating virtues, but it's not really the way we use virtue. Right. It's cultivating virtue in the way that like an exercise program for an athlete is cultivating virtue. It's cultivating excellence at a particular sporting activity."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5278.15,"end":5298.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And within this context, right, like those famous words from, what is it, the American Declaration of Independence, you know, we hold these truths to be self evident, that all men are created equal. Like that is actually not self evident. You know, that only works in Christian."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5298.15,"end":5299.47,"speaker":"Fr Stephen De Young","text":"Was it before Christianity?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5299.47,"end":5306.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. That only works in Christian ethics. Everyone's not created equal. Some people are bigger than others. Some people are smarter than others."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5306.6,"end":5309.2,"speaker":"Fr Stephen De Young","text":"Some people are better looking than others, stronger than others."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5309.28,"end":5309.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5310.8,"end":5312.08,"speaker":"Fr Stephen De Young","text":"You have different talents."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5312.48,"end":5312.88,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5313.36,"end":5314.72,"speaker":"Fr Andrew Stephen Damick","text":"It's not self evident."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5315.44,"end":5316,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5317.12,"end":5319.92,"speaker":"Fr Andrew Stephen Damick","text":"It's revealed, but it's not self evident."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5321.12,"end":5351.53,"speaker":"Fr Stephen De Young","text":"Right. And this is why, for example, until things become very extreme, until things get to the point of madness, right? You see, for example, with Roman emperors and with kings and stuff, people tolerating what we would consider very evil, horrible behavior, like tyrannical behavior and all these kinds of things because, right. For them it was like being a college athlete. Nobody cares what you do as long as you're good on the field. No."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5353.45,"end":5356.73,"speaker":"Fr Andrew Stephen Damick","text":"Kind of true. Yeah, exactly. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5357.61,"end":5417,"speaker":"Fr Stephen De Young","text":"But it was sort of that thing, right? This person is very good. What they're really doing, which is being a general being, whatever it is that they're doing, they're really good at it. And so their personal behavior and that kind of things that we would judge in terms of good or evil didn't enter into the picture in the ancient world. The NFL has showed us all that you could be very good at a particular sporting activity and do impressive feats of human athleticism and be a horrible person from the perspective of good and evil categories that are going to come later. Right. So in the ancient world, though, again, we're in these categories of good and bad. So what do you do about bad people? Right. Well, they're not evil people, remember, they're just bad people. So there's no concept of like, oh, well, we need to punish them for the evil thing they did."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5418.95,"end":5419.27,"speaker":"Fr Andrew Stephen Damick","text":"Any of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5419.27,"end":5438.71,"speaker":"Fr Stephen De Young","text":"That kind of thing. Right. It's the idea that, well, okay, this person isn't very bright, Right. But we can extract a certain amount of labor from them. So they were born to be a slave. Yeah, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5438.79,"end":5466.34,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, these ideas come up, right. They're Used, frankly, to justify slavery in the United States. This was. The scientific view was that certain. Certain people who look certain ways are made by God to be subservient. You know, like, this is. This is kind of a. It's a pagan. Pagan idea that comes back and gets put, you know, with Christian clothing on it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5466.5,"end":5473.46,"speaker":"Fr Stephen De Young","text":"Early, early 20th century, as Western nations start to secularize eugenics, here it comes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5474.04,"end":5478.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is just. It's just pagan anthropology coming back."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5478.36,"end":5520.68,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And this is, you know, mentioned slavery. But hey, since we're giving different examples tonight, there's a lot more of this in the US Than people realize. This isn't just something that went on in Europe and, like, Germany and stuff. You know, everyone, you all learn in American history class about Oliver Wendell Holmes, you know, the great jurist, the Supreme Court justice, sometime you should read his majority opinion in the case where they said it was legal for the government to sterilize women by force. In which he says, and I quote, how many generations of imbeciles are enough."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5521.56,"end":5533.43,"speaker":"Fr Andrew Stephen Damick","text":"Wow. And they named a town in North Carolina after him, Wendell. It's just east of Raleigh. All my friends in Wendell are like, no."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5534.87,"end":5541.91,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. And that is, as Father Andrew said, that's a revival of this old pagan anthropology."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5542.47,"end":5542.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5543.59,"end":5580.47,"speaker":"Fr Stephen De Young","text":"Right. Where nature, the idea of nature is that each person has a nature. Right. So Aristotle could talk about there are people who are by nature, slaves. That's all they're good for. Right. That's their position. Right. And of course, Aristotle is going to say women are sort of defective humans, as I've pointed out before. I do want to say, to be fair to Aristotle, even though he does say that that's obviously horrible, he is the first person in the Greek world to say that women were at least human."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5582.63,"end":5583.43,"speaker":"Fr Andrew Stephen Damick","text":"It's a start."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5583.83,"end":5589.24,"speaker":"Fr Stephen De Young","text":"If you read the medical text in the Hippocratic corpus, they're pretty clear that women are a different species. They're not human."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5589.8,"end":5590.28,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5590.28,"end":5595.48,"speaker":"Fr Stephen De Young","text":"So Aristotle took a half step in sort of the right direction."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5595.48,"end":5596.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5596.92,"end":5645.14,"speaker":"Fr Stephen De Young","text":"He thought women were human, at least just defective ones. Right, right. But. So that's how nature was seen. Right. That each human has a nature and they need to be plugged into a place in society based on that nature. So if they're one of the wise ones, one of the smart ones, they need to go to the academy and become a philosopher. And if you're Plato, who's one of them, you should really be ruling the city. But no one will listen to you if they're. If they're physically certain they need to become an athlete or they need to become a soldier. Right. They need to become a general if they have a strategic right that everyone gets plugged into society based on their individual nature. And virtue is just being really good at something, being excellent at something."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5646.74,"end":5646.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5646.94,"end":5663.62,"speaker":"Fr Stephen De Young","text":"It's not. I mean, it is a moral category in terms of how they saw morality, but it's not a moral category in terms of how we see morality. It's just being excellent at something. That's what RT that we translate virtue of Greek actually means is like excellence."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5664.1,"end":5664.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5664.82,"end":5674.61,"speaker":"Fr Stephen De Young","text":"You're excellent at something, you're really good at it. And so there is no shared human nature."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5676.13,"end":5676.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5676.45,"end":5698.05,"speaker":"Fr Stephen De Young","text":"There's not the idea that human nature is a thing that all humans share, that all humans have the same nature at all remotely. Right. The people on top are the best people, people in the middle are eh. People at the bottom are the worst people. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5698.62,"end":5708.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, and within paganism in general, there's. There's even a sense of separate creations. Like different people in different cities, states and tribes were created separately by various gods and."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5708.7,"end":5709.1,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5709.26,"end":5711.66,"speaker":"Fr Andrew Stephen Damick","text":"So like this is. This is built into the whole system."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5712.06,"end":5714.94,"speaker":"Fr Stephen De Young","text":"Yeah. With different qualities for different purposes. Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5714.94,"end":5715.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5717.02,"end":5745.07,"speaker":"Fr Stephen De Young","text":"So when St. Paul goes to these nations and is preaching that there's one human nature, and St. Paul's getting that from the Torah, he's getting that from Genesis, that male and female humans, all of them are created in the image of God, that there's one human nature. This is a massive bomb dropped on the whole way humanity is thought about."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5745.55,"end":5749.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The whole notion of human rights is Christian."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5750.59,"end":5770.18,"speaker":"Fr Stephen De Young","text":"Yeah. The idea that the emperor and the lowest slave woman. Right. The lowest slave woman have the same human nature, are human in the same sense, and have the same dignity before God is an unbelievably revolutionary idea."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5770.26,"end":5773.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that would have been a massive joke."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5773.62,"end":5859,"speaker":"Fr Stephen De Young","text":"It was absurd. Yes. It was absurd to the Romans. Yeah, yeah, Right. It was absurd to the Romans, but it's basic to Christianity. And this is. So this is another one of these places where this has crept back into our secular society. You know, I gave some grotesque example there with Oliver Wendell Holmes. Right. And eugenics and stuff that we now see as grotesque. Rightly. But in a more subtle way. Right. There is a certain strand of thought in our society and it's frankly a strand of thought that is politically on the right that I think makes it attractive to some people who are more traditionally religious, shall we say, even though this is not a religious idea. Right. And. And that is that this Kind of anthropology creeps in in a softer way, in the sense that people will argue that the current structure of our society is natural. Right. So the people at the top of our society, like Elon Musk and Jeff Bezos, they're the smartest and hardest working people in our whole society. That's why they're the richest people in the world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5859.39,"end":5864.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you definitely get that. There's a sort of like, weird kind of awe for them."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5865.07,"end":5919.98,"speaker":"Fr Stephen De Young","text":"And I wonder what kind of sky, what color the sky is in your world. But still, like, have you seen Jeff Bezos laugh? Anyway, Right. And then anyone who is. Who is, you know, poor. Right. The poorer they are, well, that's natural, too. They're that way because they're not as smart. They made bad choices. That's natural. That's right. And the. The fallout of that idea is we shouldn't do anything about it, especially at the lower end. We shouldn't do anything to help people who are at the lower end, because, I mean, they're there because that's where they're going to be. That's just who they are. Right. That's their nature. So we shouldn't do anything."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5920.22,"end":5920.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5921.58,"end":5941.57,"speaker":"Fr Stephen De Young","text":"If you're someone who has fallen into that kind of ideology through politics or something, I would deeply encourage you to start reading the homilies of St. John Chrysostom. Because a lot of the homilies of St. John chrysostom are fighting the original version of this."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5942.37,"end":5942.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5943.25,"end":5951.49,"speaker":"Fr Stephen De Young","text":"Because he's got a lot of people he's preaching to, especially in Constantinople. Constantinople, more than Antioch, who are barely converted pagans."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5951.81,"end":5953.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":5953.73,"end":6075.51,"speaker":"Fr Stephen De Young","text":"They've come in the doors and become Christians for a variety of reasons, some good, some not so good, but they still have this basic pagan worldview. And so when he wants to talk to them about the poor, he has to overcome this. This idea that they're somehow supposed to be poor or they're poor because they're bad. Right. Or they're disabled because they're bad. Right. And so allow me to suggest that to you, if you've fallen into that way of thinking, I think St. John has some things to say to you that might help cure your soul of that particular delusion. But so this is the ancient world's view, as we just mentioned, with St. Paul, especially as he's going and bringing the faith in a whole new view of the world and of God and of everything to these pagans. Right. There's this massive shift, right. Where now a biblical view of this is adopted and the paradigm is no longer good and bad, but becomes good and evil. Right? Becomes good and evil. And despite all that stuff we talked about in the first half that's influenced us, that different philosophical stuff and ethical reasoning stuff, the scriptures don't primarily talk about good and evil in terms of ethical decision making or in terms of like abstract principles and arguments, right? About what is good and what is evil. Right. There's no calculus's hedonistic or otherwise, Right. There's none of that. Evil is presented from the start, meaning from Genesis, right? As evil is the power of sin, which brings death in the world."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6076.4,"end":6090.68,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, I think it's notable, right? One of the earliest Christian kind of catechisms which has a lot of ethical stuff in it. The didaki or didact, I don't know, D I, D, A C pronounced that way."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6090.68,"end":6092.52,"speaker":"Fr Stephen De Young","text":"They say dida K if they're dida."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6092.52,"end":6110.38,"speaker":"Fr Andrew Stephen Damick","text":"K, excuse my Greek pronunciation of Greek, you know that it starts out with there are two ways, the way of life and the way of death. It's notable. It doesn't say there are two ways. There's the good way and the bad way. It's the way of life and the way of death."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6111.02,"end":6113.02,"speaker":"Fr Stephen De Young","text":"Yeah. It's where they lead."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6113.9,"end":6114.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6115.34,"end":6312.14,"speaker":"Fr Stephen De Young","text":"And so. And remember sin, right? First place. Sin is talked about. First place. The Word occurs in the whole Bible, Genesis 4, right? With Cain, when God says, and we've talked about this on the show before, but it bears repeating. Sin is crouching at your door. It wants to master you, you must master it, right? That's not Cain. You know, I gave you these commandments and you're mad at your brother, and I think you're about to break one, right? That's not the way sin is envisioned, right? Sin is envisioned as this force, this malignant force that because of the expulsion from paradise, it's loose out there in the world and it comes for people, right? And it wants to master them, it wants to take control of them and it ultimately wants to destroy them, to kill them. That's what sin is. And that's what evil is, right? That's what evil is. And death, right, Is again, death is not just depicted in the scriptures, as you know. Well, this is the point where your soul leaves your body. This is the point where your heart stops beating. This is the point, right? And that's the way we think about it in modern terms, right? In terms of ancient pagan terms. It's not part of this circle of life, right? This cycle that just repeats and repeats and repeats, right? But death is this devouring, destructive decay that again is at work in the world. It is not natural, it is not good, it is evil. And so evil, biblically evil. In the Scriptures, evil is whatever enslaves humanity. This is how sin is talked about, mastering you. Right. It enslaves you. And evil is whatever brings death and destruction to humanity and to the rest of the creation. So from that understanding of evil that you get right from the beginning of Genesis and all through the Scriptures, you can sort of come up with a definition of good in contradistinction. Right. Over against that. Right. So over against that you could say, okay, well, if evil is this power of sin that's at work, then good is justice or righteousness. Right. It is things being in good order. And you can say, well, if evil is death, decay and destruction and death, then good is life. Right? Good is life. And these are categories we've talked about before."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6313.02,"end":6314.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, A lot."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6315.29,"end":6328.17,"speaker":"Fr Stephen De Young","text":"But it's important again that we double down on the scriptures understanding of life. Right. The word life in the scriptures is not just talking about biological functioning."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6329.61,"end":6335.45,"speaker":"Fr Andrew Stephen Damick","text":"No, it's. It's about the fullness. The fullness of what God made something to be."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6336.09,"end":6336.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6336.65,"end":6351.48,"speaker":"Fr Andrew Stephen Damick","text":"You know, perfection and not perfection isn't like, you know, like what a perfect little child you are. Meaning, you know, they don't ever do anything wrong. But perfection like this has been brought to perfection. This has been redefined. This is brought to its fullness, its growth."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6353.24,"end":6378.2,"speaker":"Fr Stephen De Young","text":"Right. So it's flourishing. So if we're talking about human life, real human life in the Scriptures is human flourishing, right? Plant life is plants flourishing. Animal life is animals flourishing. Right. This is what life is. This is why you can get the things that we get in the New Testament where Christ could say, I've come, that you would have life and that more abundantly. That doesn't mean you'd live a lot of years."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6379.08,"end":6381.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it means full living."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6382.2,"end":6499.18,"speaker":"Fr Stephen De Young","text":"Yes. It is this flourishing, Right. Or this is life to know you, the only true God and Jesus Christ whom thou sent. Right? That is what it means to be alive. That is what it means to flourish as a human is to know God. Right. In Jesus Christ. And we've talked before about how these are not exclusive things, that order and life are interdependent, that things being in good order allow life to flourish and. And flourishing life is necessary to have good order and for it not to just be tyranny. Right. Like a parking lot is a certain kind of order, but it's not flourishing with life. And you Know, one of the paradigmatic examples in Scripture of this is the beginning of the book of Exodus, right? Where the Israelites are flourishing, they're growing in number, they're flourishing and they're living in the Nile delta. Everything is good. Right. But Pharaoh comes and Pharaoh is the king. He's this figure of order, of justice for the Egyptians. He's the one who sets the order and enforces the order. But he comes not to use his commands and his ordering capacity in order to help the Israelites or even the Egyptians flourish. But the exact opposite. Yeah, yeah. He comes for population control. He comes to kill. Right. And to destroy. And so, you know, here at this point, as we're nearing the end of the second half, we've. We've kind of got a working definition of good over against evil."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6501.5,"end":6501.74,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6504.14,"end":6554.78,"speaker":"Fr Stephen De Young","text":"This is a good starting point, Right. And this is a good. We've arrived somewhere, but we aren't done yet because that definition of good doesn't necessarily work to describe God. When we say God is good, we don't mean that he is in good order and his life is flourishing. Right. At least not quite. Right. So there's a little more we have to say, we have to say about that. And part of the reason why this working definition we're at of good on the one hand and evil on the other doesn't apply to God is that we're going to say that God is good and not evil. God and evil are not equally ultimate."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6555.74,"end":6558.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Evil is not the opposite of God."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6559.5,"end":6571.1,"speaker":"Fr Stephen De Young","text":"Right. That has always existed somehow. Right. Not the case. So we have a little more work to do in terms of what it means that God is good. That's what the third half is for."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6571.82,"end":6580.28,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty. Well, we're going to go ahead and take our second break and we'll be right back with the third and final half of this episode of the Lord of Spirits."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6580.52,"end":6596.76,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6601.48,"end":6699.18,"speaker":"Announcer","text":"Robin Phillips book Rediscovering the Goodness of Creation offers a manual for recovering Gnostics and shows how the Church's polemics against this heresy have fresh relevance today. In his foreword to the book, Fr. Stephen DeYoung writes. With this book, Robin Phillips explores the way his own religious experience and way of life was shaped and its intersection with the Gnostic experience of God and the material world. Father Stephen continues commending this book for addressing the way cultural factors and have shaped modern Christianity and for showing how each of us can counter these factors and shape a new Christian consciousness for ourselves so that the propositional statements of the Christian creed become real lived truth. Father Stephen concludes by Phillips has made this beginning himself within his own person. This allows him to describe the landscape and lay guideposts for those who would follow him. While each person is shaped by larger cultural and community forces, those forces, those communities and the culture cannot be corrected and transformed of themselves. The change must begin within the minds and hearts of human persons. The change begins with Phillips and with the reader. It ends with a cosmos transfigured by the glory of God in the Lord Jesus Christ, rediscovering the goodness of creation. A manual for Gnostics is available at store.ancientfaith.com store.ancientfaith.com we're back now with the."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6699.18,"end":6714.03,"speaker":"Announcer","text":"Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6714.75,"end":6717.87,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. It is the third half."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6717.95,"end":6729.39,"speaker":"Fr Stephen De Young","text":"The commercial for Robin Phillips book was expected, but the powerade commercial that played only in certain markets before that, that was a little weird. Not something I thought I'd hear on. Anxious?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6731.39,"end":6746.4,"speaker":"Fr Andrew Stephen Damick","text":"Well, yes. Anyway, I was trying to come up with a, you know, a good springboard for the joke, but it just wasn't coming to me. You could tell it's approaching my bedtime. Yes, it is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6746.8,"end":6748.08,"speaker":"Fr Stephen De Young","text":"You up, Father Andrew?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6748.08,"end":6753.52,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, I know. I do live in the future as compared to you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6753.6,"end":6756.88,"speaker":"Fr Stephen De Young","text":"So, yes, all the way in the year 2000."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6759.84,"end":6772.39,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry, Dave, I can't do that. Right. So we're talking about goodness and evil and who is God with relation to all of that and what are we supposed to do?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6772.63,"end":6777.51,"speaker":"Fr Stephen De Young","text":"We're taking a bold stand that people should do good stuff and not evil stuff."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6777.83,"end":6787.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And Henry Kissinger has been referenced, Sam Harris and always take a few potshots at Calvinists and ancient pagans."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6788.07,"end":6885.97,"speaker":"Fr Stephen De Young","text":"Yes. Typical episode. So. Yeah, yeah, yeah, yeah. So now, as we mentioned at the end, right before the powerade commercial, at the end of the last half, we have a little more work to do in terms of what it means that God is good and what we have to take into account, we in particular on this show, the Lord of Spirits podcast, is what we've said over and over and over again on the show repeatedly, ad infinitum, if not ad nauseam, that God always acts with absolute freedom. God is absolutely free. Right. And so we're going back to some of the things we talked about the first half. There are a lot of things that are ruled out by that. Right. Ruled out by that principle. But what do we mean by it? Right. When we say that, we've put that in certain terms, like the idea that God has to obey some kind of justice that stands above him. Right. We've said, well, that's out. We've said certain things are out because of God's freedom. But what do we mean when we say God is absolutely free? So first of all we mean there is. God is affected by no necessity. There's nothing necessary for God to do. There's nothing he has to do."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6886.45,"end":6890.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like he must punish sin, for instance."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6890.53,"end":6890.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6890.89,"end":6892.61,"speaker":"Fr Andrew Stephen Damick","text":"As some theologians have said."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6892.77,"end":6926.4,"speaker":"Fr Stephen De Young","text":"Yes, yes. There are no restrictions of any kind on God. There's nothing God can't do. Right. Any argument prefaced with God can't blank is going to be problematic. Right. It's going to be problematic or it's going to be the kind of question asked by a simpleton like could God create a rock so heavy he can't lift it? Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6926.64,"end":6937.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that's just like saying this sentence is false. It's just pure contradiction."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6937.12,"end":6944.16,"speaker":"Fr Stephen De Young","text":"Yes. If you're a teenager and an atheist and you think that's a good argument against God, read a book anyway."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6945.69,"end":6946.41,"speaker":"Fr Andrew Stephen Damick","text":"Any book really."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6946.97,"end":6950.09,"speaker":"Fr Stephen De Young","text":"Yes, any book like Harry Potter will get you past that point."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6950.09,"end":6951.21,"speaker":"Fr Andrew Stephen Damick","text":"Like the monster at the end of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6951.21,"end":6970.65,"speaker":"Fr Stephen De Young","text":"This book will get you past that point. Exactly. Goodnight Moon even will probably take it past. That's a good argument. So God being absolutely free also means that with God there is not any kind of teleology. There's a five dollar word. What do we mean by that?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6970.81,"end":6971.21,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":6972.98,"end":7001.37,"speaker":"Fr Stephen De Young","text":"For me as a human, right. I have a telos, an end. Right. There is something that a mature human person like Father Andrew was talking about. Perfection in this way. Right. Maturity, completeness. Right. I was born as a gigantic baby with teeth, but that was not my final form. I continued to grow even more giant and get more teeth and hair and things."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7002.57,"end":7004.57,"speaker":"Fr Andrew Stephen Damick","text":"Have you reached level 9,000 yet or."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7004.65,"end":7032.99,"speaker":"Fr Stephen De Young","text":"Yes. What? 9,000. Anyway, so, right. I continue to develop. Right. An acorn, Right. Has its end. An oak tree. Right. That it is growing towards, that is sort of its full form. Obviously God is not in some kind of nascent stage of godhood where he's going to develop into full godhood. Down the road. Right, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7034.51,"end":7035.95,"speaker":"Fr Andrew Stephen Damick","text":"Unlike all the pagan gods."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7036.59,"end":7064.69,"speaker":"Fr Stephen De Young","text":"Yes. And so there's no way to apply that kind of reasoning to God. Right. And we also mean when we say God is absolutely free, that there's nothing that can act as a cause on God. There's nothing anyone or anything can do that will cause. Right. God to do something."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7066.53,"end":7066.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7066.93,"end":7069.73,"speaker":"Fr Stephen De Young","text":"That's how inside of his. His own will. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7070.85,"end":7077.33,"speaker":"Fr Andrew Stephen Damick","text":"You know, he's not the force, because as Obi Wan once said, the force will obey your commands."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7077.49,"end":7082.77,"speaker":"Fr Stephen De Young","text":"Yes. Although, you know, midichlorians, whatever."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7084.79,"end":7085.99,"speaker":"Fr Andrew Stephen Damick","text":"Heresy. Heresy."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7087.75,"end":7099.11,"speaker":"Fr Stephen De Young","text":"Right. So I believe it was Archimedes who said, you know, give me a place to stand at a long enough lever and I could move the world. Well, there is no place to stand and there is no long enough lever to move God. Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7099.11,"end":7108.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which is why, frankly, satisfaction, Soteriology implies that God is not free."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7108.63,"end":7110.94,"speaker":"Fr Stephen De Young","text":"Oh, you stepped in it now. Oh, yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7113.34,"end":7115.34,"speaker":"Fr Andrew Stephen Damick","text":"Let's have. It's after 9pm Eastern."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7115.34,"end":7121.18,"speaker":"Fr Stephen De Young","text":"So there's a whole bunch of people on Twitter who are going to say you're not a Christian now. So basically, like every other day."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7121.82,"end":7122.54,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7124.7,"end":7208.67,"speaker":"Fr Stephen De Young","text":"So right there. So there's no. Right. He's free. And this is. Right. This absolute freedom that God has is one of the ways in which he is not like any other thing. He is not like any created thing. I shouldn't say other thing because he's not a created thing. This is one of the ways in which God is not like any created thing. Right. Including the other gods. Right. Who are created things. He is not like that because none of them are free this way. No human is free in this way. No woodchuck is free in this way. There is nothing else. Right. That is free in the way God is radically and absolutely free. Okay, so within this, we need to talk about. Here comes some orthodox theology stuff. We need to talk about the distinction that gets made in orthodox theology between God's essence and his energies. All those things I just said about how God is absolutely free, I said about his essence. I said about who God is. That's why all of them, you may have noticed, were negative statements. Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7208.67,"end":7210.51,"speaker":"Fr Andrew Stephen Damick","text":"He's unrestricted."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7210.75,"end":7211.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7211.63,"end":7217.87,"speaker":"Fr Andrew Stephen Damick","text":"No, you know, not subject to necessity, not, you know, heading towards some telos."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7219,"end":7243.28,"speaker":"Fr Stephen De Young","text":"Right. Is all just ways in which God is not like any created thing. No positive statements about what God in His essence is like, because we can't know God in His essence. We could just know that it's not like any created thing. But what that means is and why that's important for our conversation tonight is."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7243.28,"end":7243.64,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7246.02,"end":7247.54,"speaker":"Fr Stephen De Young","text":"When we say God is good."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7248.5,"end":7248.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7248.86,"end":7262.26,"speaker":"Fr Stephen De Young","text":"Because again, this is one of the things we want to define tonight. When we say God is good, we're not saying that about his essence because it's a positive statement and we don't know his essence."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7262.58,"end":7263.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7264.1,"end":7318.21,"speaker":"Fr Stephen De Young","text":"We're saying that about his energies. Right. We're saying that about his energies. So good is about what God does. Right. Good is about what God does, not some statement about his essence. Now, we need to explain again, I'm pretty sure we've done this on the show before what we mean by energies. Right. Every episode is somebody's first. Right. And some people may not have heard this before. A lot of people may have heard this explained very badly before. But what do we mean when we talk about God's energies as opposed to his essence is pretty clear, right? God in his essence."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7318.29,"end":7318.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7318.61,"end":7322.73,"speaker":"Fr Stephen De Young","text":"God is. He truly is. God is. He is known to himself as God."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7322.73,"end":7324.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In himself, as it were."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7326.01,"end":7333.21,"speaker":"Fr Stephen De Young","text":"But energy. Because when we hear the word energy in English, we think like, maybe, right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7334.33,"end":7335.61,"speaker":"Fr Andrew Stephen Damick","text":"Or, you know, electricity."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7336.17,"end":7344.25,"speaker":"Fr Stephen De Young","text":"Electricity, you know, fossil fuels and policies regarding them in the government."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7344.49,"end":7344.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7344.97,"end":7346.09,"speaker":"Fr Stephen De Young","text":"The Department of Energy."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7346.33,"end":7359.57,"speaker":"Fr Andrew Stephen Damick","text":"Like. Like literally, you know, And I think this kind of works, maybe not perfectly, but literally, you know, energia, it means in working. So it is true to see."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7359.57,"end":7360.85,"speaker":"Fr Stephen De Young","text":"Yeah, but then what's a butterfly?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7361.17,"end":7367.41,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know it doesn't work with every single word. But, you know, God as he works in creation, as he acts."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7367.81,"end":7369.13,"speaker":"Fr Stephen De Young","text":"Sort of. Yeah, sort of."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7369.13,"end":7369.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7369.33,"end":7409.11,"speaker":"Fr Stephen De Young","text":"Yeah, sort of. So this is a category that we just. We see defy the energia, the Greek word that we see broken down like a lot of other categories in, for example, Aristotle. Right. So Aristotle distinguishes between dynamis, Right. Which you may hear yelled in liturgy at a certain point, sometimes you'll hear it translated in English as with strength, which is weak sauce. But I think we should just go straight. J.J. walker, if you have to translate it and have the priest yell, dynamite."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7411.59,"end":7414.39,"speaker":"Fr Andrew Stephen Damick","text":"But what's the deacon? You know, I know you don't have a deacon, but it's."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7414.39,"end":7417.03,"speaker":"Fr Stephen De Young","text":"I don't have a deacon who gets to say that. I am the deacon."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7417.19,"end":7422.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I am the deacon. Yeah. I still can't do Stallone."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7422.63,"end":7423.67,"speaker":"Fr Stephen De Young","text":"I wear many hats."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7426.31,"end":7428.23,"speaker":"Fr Andrew Stephen Damick","text":"Photos, please. Pixar didn't happen."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7428.31,"end":7430.39,"speaker":"Fr Stephen De Young","text":"Yeah, I can't find him. My head's too big."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7432.93,"end":7433.17,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7434.85,"end":7487.99,"speaker":"Fr Stephen De Young","text":"But what dynames. Often it gets translated in English as power or ability, but it's not. For example, when Aristotle describes it just an abstract ability or Someone being powerful or something. But it's directly related to, to the person who has that capability. So examples, these are actually the examples that Aristotle gives. Right? So you have a person, that person has the ability to sleep, right? They have the ability to go to sleep even if they're not sleeping right now. Right? They have the ability to go to sleep. If they were not able to go to sleep, they would die. Right? So yes, if you have a living human there, they have the ability to go to sleep. They have the ability to dance."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7490.63,"end":7493.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. You can dance if you want to, but."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7493.67,"end":7598.92,"speaker":"Fr Stephen De Young","text":"But dinamis is not just the ability to dance. It is the person with the ability to dance. Right. And then parallel to that, energia on the other side, energia is not sleeping or dancing. It's not just the activity. But energia is the person sleeping or the person dancing. It is the person in action, not just the action. So when we talk about the divine energies, we talk about the energies of God. What we're talking about is God himself at work. God Himself acting in his creation. This is why you will hear when orthodox people talk about the essence, energy distinction, they will say we don't know God in his essence, but we do know God in His energies. That is real knowledge of God that comes from. We encounter God in action. Right. In creation. Yeah. That's where we meet Him. That's where we come to know him in person. Right. Is in his working and creation. So do not let Plato brain mess this up for you. Right. This is not God as he quote, unquote, really is. And then some kind of impression of God that we derive from things in creation."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7599,"end":7600.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or like an emanation."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7601.32,"end":7738.7,"speaker":"Fr Stephen De Young","text":"Right. That's not what this is. Yeah, Right. This is God as He is in himself. God as he knows Himself. Right. Which we can't know versus the God we encounter, the God we meet who is acting in the creation. So the energies are also God himself. And we have to say one more very important thing about God's activities, His energies, these activities in which we encounter Him. That is that all of them are eternal. All of them are eternal. Meaning when we talk about God's activities, we talk about the nrea, we talk about the works of God. We're not talking about things that God does at an individual time, in an individual place. Right. We're not like last Tuesday, right? At 10:05am Local time, God healed this boy in Kenya. And then seven minutes later in Sri Lanka, He. He caused, brought this girl to repentance. And then Right. Like, that's not what we're talking about. We're talking about God's actions. God's actions are all continual and eternal because God is not within space and time. Yeah, but we humans, right, we humans have our human encounters with God within space and time. So God is pouring out his love on creation. God is present, loving his whole creation eternally. But I encounter him there at certain points in my life. Right. This is revealed to me at certain."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7738.7,"end":7744.1,"speaker":"Fr Andrew Stephen Damick","text":"Points in my life and in certain ways, like, it's not always the same, Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7744.42,"end":7815.71,"speaker":"Fr Stephen De Young","text":"Yeah, right. These are beyond that. So a good example of this in the Old Testament that we've talked about in the show before is the name Yahweh. Right. The name Yahweh, as we pointed out, means he who causes to be. And one of the phrases we see again and again in the Hebrew Bible is God saying, when this happens, then you will know that I am Yahweh. This gets kind of hidden in the English because then you'll know I'm the Lord. Well, yeah, that reads differently. But what he's saying is, then you will know I am the one who causes things to be. So he could say through Ezekiel to the exiles, the Judahites in exile, when I have raised you up from your graves, then you will know that I am Yahweh. Right. He could say about both the Egyptians and the Israelites, when I have brought you out of Egypt with a mighty hand, then you will know that I am Yahweh. Yeah, right. He's always Yahweh, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7815.79,"end":7818.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's always creative, he's always creating."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7819.47,"end":7934.74,"speaker":"Fr Stephen De Young","text":"It's not that he's sometimes Yahweh. Right. He's always Yahweh, but individual people and groups of people encounter him there, then you will know and come to know him there. Yeah, right. At a point in time, from their perspective. Right. And I use that very deliberately because the Greek translation of Yahweh, Oon, St. Gregory Palmas, lists as one of the energies of God. So he very much, at least interpreted it that way. Oh, wait, sorry, I just quoted a church father. I'll stop. I don't have to do that on this show. What was I thinking? So in a sense, you can say good means defining good in terms of God. Good is what God does. If by that you understand that we're talking about the divine energies, these eternal divine energies. Right. The God who we encounter in action within the creation. You can also say sort of looking all at all of that collectively. Right. Because again, God isn't doing one thing at one time and another thing at another time. Right. We can talk about there being these different divine energies, these different activities of God, but they're really all united. And one of the sort of classical examples of this, of how they're united is in your house, you light a fire in the fireplace, right? And the fire, that one fire sitting there burning, it lights the room and it heats the room."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7936.51,"end":7936.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":7936.75,"end":8056.55,"speaker":"Fr Stephen De Young","text":"Lighting the room and heating the room are not the same thing. You could distinguish those as two separate things. Right. But the fire isn't really like alternating back and forth between doing two different things, and it's not really doing two things at once. Like multitasking. Right, right. So this is the example that's given for how God. It's not like God is. Well, sometimes he's loving and sometimes he's creating and sometimes he's establishing justice and some. Right, yeah. And it's not that he's multitasking, but these activities are united, Right. They're all. They're all part and parcel of each other. This is why you get like These lists in St. Paul's epistles where he said, talks about how God is, you know, making us holy and making us just and glorifying us and Aunt. Right. Because these aren't like separate things, Right. These are. God's activity in our life is doing all of these things. Right. And so looking at it in that unified collective way, you could say good is the divine nature. Because the divine nature is the sort of sum total of all of the powers of God. Right. Which are always. Which are always in action. Right. So if this is what we mean by good when we're talking about God. Right? Is we're talking about. We're saying good is God's activity. God is good is talking about the God who we encounter in that activity. Then what does it mean for humanity to be good? Right. For a human to be good. Not just in contradistinction to evil, not just over. Against a human being. Evil. Yeah, we mentioned that last half, right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8056.55,"end":8065.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I think just to kind of underline that sometimes people have the sense that being good is just. I didn't do any bad things."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8065.67,"end":8066.87,"speaker":"Fr Stephen De Young","text":"Right. Just."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8067.03,"end":8067.67,"speaker":"Fr Andrew Stephen Damick","text":"And you know."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8067.67,"end":8068.15,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8068.47,"end":8075.97,"speaker":"Fr Andrew Stephen Damick","text":"Like that's the. That's the kind of the parenting. Now be good. That's what we mean by that is don't do any bad things."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8076.37,"end":8143.75,"speaker":"Fr Stephen De Young","text":"Yeah. Keep it neutral. Yeah, right. But so we defined what it means for a human to be evil, I think, because we've talked about it before. We didn't go into great depth, but we summarized it, I think, well, in the second half that a human being evil means you're under the control of sin, you're enslaved to sin, and that's bringing about destruction and decay for you and for the creation around you, right? That's what it means for a human to be evil. And we said, well, we gave kind of a provisional definition of good over against that. But now, now that we've come to hopefully a little better understanding of what it means for God to be good, now we can come to a better understanding of what it means for a human to be good, right? In some at least similar sense, right? And this happens through. This happens through the fact that our human nature, that we all share the one human nature that we all share and with each other and with Christ is the image of the divine nature."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8145.35,"end":8147.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Theomorphic."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8147.43,"end":8147.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8147.83,"end":8148.63,"speaker":"Fr Andrew Stephen Damick","text":"That's what we are."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8150.31,"end":8153.11,"speaker":"Fr Stephen De Young","text":"And you didn't know that was a spoiler when Father Andrew said it earlier."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8153.35,"end":8155.43,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. Sorry, everybody."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8156.15,"end":8358.72,"speaker":"Fr Stephen De Young","text":"And we've talked about how our nature being in the image of God, because nature itself is kind of a verbal category, right? We've talked about how nature is sort of like the way body was used in the ancient world, that it's this nexus of powers and potentialities, right? That imaging God being God's image, right? Or bearing God's image is this verbal idea. It's about what we do, right? And we can see how the human activity. Because humans have an energy too, right? Human nature has an energy too. The human activity that is. That is imaging God, right? Is good in multiple senses, right? So when a human is imaging God, when a human is working to bring order and life to the world, this brings about human flourishing. So we can say that the human doing that is good in that sense, right? In that he is flourishing as a human, right? We could talk about it in terms of. Again, throughout the word teleology, right? In terms of this person is becoming human. He's coming to maturity. He's becoming what a human was created to be. We can say that it's good because he is becoming like God, who is good. Because we've established that God is good and the God we encounter in his activity is good. When a human is participating in those activities, we could say that the human is good, right? Because it's the same activities. And of course, the human is definitionally here when he's doing good, is participating in God's energies, in God's activities in the world, right? And We've talked about. But taking this down again, right? God is at work, as we said, eternally loving his creation. So when we love each other, when we show love to another human being, right? And we truly are showing love, that's not our love, that's God's love. God is loving that other person through us. We are participating in what God is doing in the world. Right? And when God is healing, when God is establishing justice and order with all the things that God does, we participate in them. We don't just mimic. It's not an external, like mimicking. Yeah, Right. But it is. It is. We are actively participating in what he is doing, such that he's doing it through us and in us. Right. And that is transformative of us. So then, last kind of question within this context, it comes up in this whole discussion of good and evil, of course, is, do people have a free will? What does it mean to have a free will?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8359.04,"end":8376.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And most of the time, when people think about free will, what they think is, I can choose to do good, I can choose to do evil. And because I can choose between these things, or I can choose to have chocolate, I can choose to have vanilla, because I can choose between these things, that means I have free will."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8376.69,"end":8377.49,"speaker":"Fr Stephen De Young","text":"I am free."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8377.49,"end":8379.17,"speaker":"Fr Andrew Stephen Damick","text":"Woo. Yeah. Yes."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8380.37,"end":8383.25,"speaker":"Fr Stephen De Young","text":"What if there's 31 flavors of ice cream? Is that too much?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8385.33,"end":8387.17,"speaker":"Fr Andrew Stephen Damick","text":"No man needs 31 flavors."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8390.69,"end":8419.25,"speaker":"Fr Stephen De Young","text":"Right, but so we have to come to this question from a different perspective now. Right? All of those different views we talked about in the first half would come at this question from different perspectives. From Sam Harris saying, no, there is no free will. To most natural law advocates saying, yes, there's a free will. Unless you're talking about Calvin's view of natural law in which, no, you don't have a free will."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8419.25,"end":8419.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8422.58,"end":8464.83,"speaker":"Fr Stephen De Young","text":"But we have to approach it from everything we've been saying, Right? That's how we have to approach this question. And from what we've been saying, human nature has an energy. So we as a human person, we have an activity. We can act in the world. We can act in the world in accordance with our nature. But we've talked about that the question of sin and good. Right. Is not a question of just choosing to follow a rule or choosing to break a rule, making a good decision, making a bad decision."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8465.07,"end":8465.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8466.27,"end":8538.45,"speaker":"Fr Stephen De Young","text":"So we've talked about what sin really is, is participating in sin, but participating in sin as a particular character. Remember, sin is crouching at your door and wants to master you. You sin enslaves you. Right. Fathers Talk about the sinful passions, because they're passions, because they make you passive. They act on you. Right. Rather than you acting. So the person who is sinning, the person who is living a life of sin is a person who is entrapped by sin, enslaved by sin. They are not free. Right? They are not free. They may claim they're very free because they may say, I'm free to indulge my desires. Right? I'm free to do that I'm free to do. That's not freedom, though. That's not freedom. That's what enslavement looks like. Enslavement to those desires. But we've also said that doing good is not just like making good decisions or choosing to do the right thing. Yeah, right. That we figured out some philosophical calculus."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8538.61,"end":8539.73,"speaker":"Fr Andrew Stephen Damick","text":"Make good choices."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8540.21,"end":8582.73,"speaker":"Fr Stephen De Young","text":"Yeah. But that good is when we're participating the divine energies, when we're participating in God's activity in the world. Right. When we do that, then we become free as God is free. Because we begin to flourish. We come alive, and that is real freedom. Real freedom is freedom to flourish as what you are as a human person. If they do an adaptation of this podcast for dogs, I'll have to change that. But."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8586.44,"end":8588.44,"speaker":"Fr Andrew Stephen Damick","text":"See, that, that's what I was not expecting."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8588.76,"end":8593.96,"speaker":"Fr Stephen De Young","text":"For humans, right? There is television for dogs. I don't know if you know this."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8594.76,"end":8597,"speaker":"Fr Andrew Stephen Damick","text":"I didn't know that."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8597.32,"end":8611.49,"speaker":"Fr Stephen De Young","text":"It's mostly birds and squirrels and stuff. It's stuff that dogs find mesmerizing to look at. But anyway, Asian faith could start a division, a canine division. Try to convert my heathen dogs."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8612.29,"end":8615.89,"speaker":"Fr Andrew Stephen Damick","text":"Well, when you've converted your heathen dogs, then they can come work for us."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8616.21,"end":8616.85,"speaker":"Fr Stephen De Young","text":"Okay?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8619.25,"end":8619.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8619.61,"end":8621.89,"speaker":"Fr Stephen De Young","text":"So real food, it's freedom to flourish as a human."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8622.21,"end":8622.61,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8623.09,"end":8660.93,"speaker":"Fr Stephen De Young","text":"It's. It's not just choosing one flavor of ice cream or the other. Right. What kind of breakfast cereal or the other. Right. It's not just choosing to do a thing. Right. Freedom is when we are participating in God's activity in his creation. This is why, like, I'm going to refer to another church. Father Saint Maximus the Confessor talks about how in the age to come, we will all be free because we won't be able to sin. Right? Let that sentence sink in."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8662.69,"end":8663.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8665.24,"end":8701.65,"speaker":"Fr Stephen De Young","text":"Because we won't be able to sin. We will finally all be free completely. So, yeah. Freedom to destroy yourself is not freedom. Right? Self destruction is not freedom. Rebellion is not freedom. This is the message you were supposed to get from Fight Club but didn't because you thought Tyler Durden was Cool. He's not cool, right? He needs to die for you to become a mature adult. Right? Self destruction. It's not freedom."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":8707.89,"end":9173.6,"speaker":"Fr Andrew Stephen Damick","text":"Amen. So for my, my final thoughts, I, I made reference earlier to the. As you insist on saying it, Dida K. And I wanted to actually just quote the beginning of it because I thought this is a good way to summarize a lot of what we've been saying. So it's a short document, everybody. By the way, you can read the whole thing on the Internet. There are multiple translations available. It's spelled D I, D A C H E is how it usually is in English translations. And the beginning goes like this. There are two ways, one of life and one of death. But a great difference between the two ways. The way of life then is this. First, you shall love God who made you. Second, love your neighbor as yourself, and do not do to another what you would not want done to you. And of these sayings, the teaching is this. Bless those who curse you and pray for your enemies and fast for those who persecute you. For what reward is there for loving those who love you? Do not the Gentiles do the same? But love those who hate you and you shall not have an enemy. And it goes on. And you know, it would be easy to read this document as a kind of list of things you're supposed to do and things you're not supposed to do. And honestly, if you read it that way and you do all the things it says to do and you don't do the things it says not to do, you will be a saint no matter how you understand it. If you obey what's there, you, you will be a saint if you do everything that it says in this document and abstain from what it says not to do. But sometimes it's easier to obey things if we understand them at a deeper level. And I think it's notable that it, it starts out that way. There's a way of life and a way of death, and it says the way of life. Then is this. And notice like nothing is in with the part that I read that's not in the Scriptures. In fact, most of this document you'll find parallel passages in the scriptures. If you know the Gospels. Well, you know that I just referenced them as I was reading the beginning of this, this document. But notice it says first, love God who made you. Second, love your neighbor as yourself. Right? This is again straight out of scripture. But also it says again straight out of Scripture, bless those who curse you. Pray for your Enemies, fast for those who persecute you. What does all this come to? It's really about doing the works of God, right? Does God not bless those who curse him? Does he not do good to his enemies? Does he not love them? He. Did he not die for his enemies? Right. Did he not undergo suffering for the sake of those who had turned their backs on him? Right. This is what God does. So when we do these things, it's not just like, okay, here's a list of stuff you're supposed to do. It's doing the things that God does. And this document describes this as the way of life, not the way of, you know, doing what's right. It is that. Right. But it is the way of life, meaning that you, you have life. If you do these things right, you will find life in them. You know, it goes on to say, for instance, give to everyone who asks you. Don't ask back. This is. These are words of Christ, really. Right. And on and on. And it's about love, especially for those who are not loving you back. And indeed, sometimes not just not loving you back, but hurting you back, hurting you back again. These are the works of God and, you know, in daily life, like. Right. How does that work out? Well, number one, this is a very practical document. Do what it says, don't do the things it says not to do. But also, like, I'll give you an example from, from my life, right? So I'm a. I'm a parent. I have four children. My wife is a much better parent than I. And together we try to train our children to behave in this way, to do these things, right? And as we're trying to learn them ourselves, what's the point of that? It's so that we can live the commandments of God. Because as it says over and over and over and over again in the scriptures, if you love God, you will keep his commandments. Christ himself said that. It's in many places in the Bible. You know, do a little word searching on Bible Gateway or wherever you'll see love, Love God, keep the commandments. These things always go together. When you do that, it leads to flourishing. It's not just. You have a very nice record, you know, look at all his. His achievements. No, you. It's flourishing. You are being what a human is meant to be, right? And when you're training children or training anyone who's in your care or training yourself in many ways, it is like keeping a garden. Like, you can't make the growth come, but you can put all the conditions in place for the growth to be possible. It is God who gives the growth, right? We can water and, you know, so and all this kind of stuff. But it is God who gives the growth because. Because what is the growth? It is to become like God. The reason that we follow the commandments is not so that we will be known as good people. The reason that we follow the commandments is not so that we have some spotless record. The reason that we follow the commandments is because it makes us like God. This is the path of theosis. This is the path of being divinized or deified, of becoming, as Christ says, equal to the angels. That's what this is because this is what the angels do. This is how the saints live. So if we want to be like them, then this is what we do. There's an actual purpose to following the commandments. And so when we say that God is good, and by that we mean this is what God is doing in the world. This is who God is, this is how he acts, right? Then for us to join ourselves to that, to do those same things, to have him acting through us, is then to become like God. And as Father said, not just in an imitative way, but not just emulating him, but in a participatory way. God is working through us. And that transforms us to be elevated, to become what humans were destined to be when we were created sons of God, equal to the angels, co reigning with Christ forever and ever. That's why all this matters, Father."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9178.8,"end":9797.15,"speaker":"Fr Stephen De Young","text":"So to bring up Aristotle again, as is my want, Aristotle understood that there's this direct connection between ethics and politics. And so his somewhat problematic ethics was coordinate with a very problematic politics from not just our modern perspective, but from any Christian perspective. And this is sort of true across the board, right? This is true across the board in the sense that at whatever level of community we're talking about, right? Whether we're talking about a local community, a neighborhood, a workplace, a city state, a government of any size, a national government, the leadership is, whether they like it or not, they're going to be structuring things in a way that is coordinate with and ultimately promoting and inculcating a certain view of what a human person is, of what human nature is, and of what a good person and a bad person is, right? That's going to vary all over the place, right? So you know, North Korea, you know, a good person is a good citizen who loves Dear Leader, right? And a bad person is one who does not. Right? A A good person in another society might be the one who works hard, or the one who accumulates wealth, or the one who has power, or the one who founds charities, or the one. Right. But this will all be coordinated with some kind of ethical view. I think I can safely say that none of the folks who are going to listen to this are in a country where their civil government really has structured the society in a way to promote the flourishing of every human person, as that flourishing is understood within Christianity. They may pay lip service to that idea, right? Lots of governments have paid lip service to that idea. Like a lot of free market American folks in the 1950s would say that. So what? A lot of people in the 1950s in Stalin's Russia say that. But what flourishing means is not really subjective in the sense that it's not really negotiable, because humans actually do have a nature and we all share the same one. And so it's no more subjective when we talk about human flourishing than it is when we talk about, like, an oak tree flourishing, right? No one would look at an oak tree that's full of rot or that's run up against the foundation of a house or that's pulling up out of the ground and about to tip over and say, no, no, by my definition, this tree is flourishing. Right? Human flourishing is not any more subjective. It is a real thing. There have been movements, social movements, throughout modern history, throughout the period of time when such social movements were possible and became a thing to try to topple governments or reform governments in such a way that at least the people who sometimes a series of waves of people who take power through violence, each tries to restructure the society in a way that will promote their definition of human flourishing or something else. Sometimes they don't even pay lip service to that, but to promote something. And it's pretty clear that that's not a way forward, that that's ultimately utopian, that we can, through our human efforts and human reasoning, structure utopia. The good place, right? The perfect place, the perfect order in which everyone flourishes and everyone has everything they want, and there's no strife and no trouble, and everything will be perfect if we can just do this, right? And the road toward that is just littered with dead bodies, it's covered in massacres and atrocities, all of which are justified by the goal, right? The goal. And I'm saying this because I want to make very clear when we're talking about human flourishing in this kind of thing, in this episode, that that's not where we're going but if humans are going to flourish, they do need to be in communities that are structured around human flourishing, actual human flourishing. And there's only one place this can start. That's church communities. That's where it started in the Roman Empire. That's where it started in the Persian Empire. That's where it started everywhere in the world, right? That a Christian community can be and has to be, if it's really going to be a Christian community structured in such a way, led in such a way, participated in, in such a way that the humans who become a part of it begin to flourish, come alive. We've said how that happens. Through encountering God in His work in the world. Not just encountering God in liturgy, encountering God in the sacraments. That's included, right? Not just that, but in his actions in the world, within the community, his actions in the activities in the world, outside the community where we encounter Him. And this is done in very concrete ways. Very concrete ways. Humans need certain things in order to flourish. They need certain support. They need certain material things just to survive, let alone flourish. Our church communities are capable. They are capable. Every one of them is capable of meeting those needs for all the people in it. They are. If you look at me and say, well, our church is too small or whatever, bull, bull. You just have a bunch of people who aren't committed to it. You have a bunch of people who aren't committed to it, who don't really want to do that, who have some other agenda. And that church community needs to be transformed, needs to repent, frankly, let's just use that word for it and transform and restructure itself. Leadership needs to lead it in a different direction until it becomes that kind of place. And see when it becomes that kind of place where the people who come in are having all of those needs met and are able to flourish and are able to truly live and truly be free. A bunch of things are going to happen. It's going to start attracting a bunch of other people. It's going to start attracting a bunch of other people out in the world who are desperate for that, and there's no other place they can find it. And they're going to start coming and the community is going to grow. Remember, this is the path that the church took over against the Roman Empire. If you want the country you live in to be a country that promotes human flourishing, you don't stage a revolution. You don't start shooting at people. You don't storm the Capitol. You don't do any of those things, right? You work in your church, you build that community. You meet the needs of the other people there. You love them. You show compassion for them. You listen to them. You be with them. You give them all the things they need to flourish. You experience this flourishing yourself. You begin to truly live and truly be free. And then you remember that it's a long game. Took 300 years for the Roman Empire. You probably won't be alive to see it happen. And that's okay. That's okay. People used to start building cathedrals that their great, great grandchildren would get to worship in. They really used to do that. We can do that too. But it starts with us. Starts with you. Starts with the other people, your parish and your church community deciding that this is what you want that place to."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9797.15,"end":9797.43,"speaker":"Fr Andrew Stephen Damick","text":"Be."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9800.23,"end":9805.12,"speaker":"Fr Stephen De Young","text":"And then making it happen. So those are my thoughts."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9806,"end":9836.58,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's the podcast for tonight. Thank you very much for listening, everyone. If you were not able to get through to us live or didn't leave a comment in our streams, we'd still like to hear from you. You can email us at lordofspirits and ancient faith.com you can send us a message at our Facebook page. You can also leave us a voicemail@speakpipe.com Lord of Spirits and and if you have basic questions, introductory questions about Orthodox Christianity, or you need help in finding a parish, head on over to orthodoxintro.org."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9836.88,"end":9848.49,"speaker":"Fr Stephen De Young","text":"Join us for a live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific for another Turning Point fork Stuck in the road. Time grabs you by the wrist and directs you where to go."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9848.89,"end":9859.28,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, Join our discussion group Leave reviews and ratings every everywhere. Don't listen to Green Day, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9859.92,"end":9871.04,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to extrafaith.com support and help make sure we and lots of other AFR podcasters stay on the air. So make the best of this test and don't ask why. It's not a question, but a lesson learned in time."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9871.28,"end":9873.84,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you."}
{"episode_id":"LOS - #085 - 2024-01-25 - God is So Good","start":9880.01,"end":9917.06,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice. Worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
