{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":0.16,"end":64.79,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":66.79,"end":170.36,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast where it's the weirdest Bible study ever. I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And my co host, Father Stephen DeYoung is with me from Lafayette, Louisiana. If you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. As you just heard the voice of Steve tell you, Matuska Trudy will be taking your calls tonight and we're going to get to those. In the second half of today's show, the appearances of the resurrected Christ are emphasized so repeatedly in Orthodox tradition that there's a cycle of 11 resurrectional appearances by Christ that are repeated at the Sunday Orthros Gospels throughout the year. And they're announced by the priest while he is facing the north. And if you listen to our episodes on Sacred Geography, you know that that is the direction of God's enemies. These are the gospel readings used as the announcement of victory against those who oppose the Lord. That's how important they are. Yet the resurrection appearances of Jesus Christ are often thought of as a kind of denouement in the Gospels, an epilogue after the main action of Holy Week. Or sometimes they're understood as the evangelist presenting evidence to prove that Jesus rose from the dead. But is that what's really going on? And why does no one seem to recognize Jesus even when they see him? So in typical Lord of Spirits fashion, before we answer those questions, we need to set the stage. So let's begin with what exactly it means when we say that Jesus resurrected Father Stephen, doesn't that just mean that it was like when you see the doctors shock a dead patient in the operating room and he jumps up gasping and is just like he was before?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":171.64,"end":172.04,"speaker":"Announcer","text":"No."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":174.92,"end":176.52,"speaker":"Fr Andrew Stephen Damick","text":"I will never get tired of doing that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":177.88,"end":215.49,"speaker":"Fr Stephen De Young","text":"Yeah. So this is. This is not flatliners, either the good one or the horrible remake. This is a completely different sort of thing. This is also not the Terminator ending of Passion of the Christ or any of several other popular presentations. But that's sort of how, you know, as you mentioned, and we're going to be trying to push back against this whole episode. The resurrection appearances of Christ have so been treated as an epilogue."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":215.91,"end":217.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. That."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":217.35,"end":231.51,"speaker":"Fr Stephen De Young","text":"That. I don't think in, like, theatrical presentations and stuff. I don't even think that much thought is put into them, you know, in terms of trying to figure out what's going on, or it's just sort of like, yeah, Jesus is alive and some people saw him."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":232.39,"end":233.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":233.19,"end":245.36,"speaker":"Fr Stephen De Young","text":"And that. That's about it. Right. If. That. If it doesn't get left out of the movie entirely, you know, because of course, our dramatic crescendo is the crucifixion, really."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":246.24,"end":246.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":246.6,"end":252.72,"speaker":"Fr Stephen De Young","text":"And then the Resurrection even gets treated sometimes as sort of an afterthought, let alone the resurrection appearances."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":253.12,"end":262.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Especially if someone's theology kind of focuses on the cross as being the end all, be all of what Jesus came to do."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":263.2,"end":273.79,"speaker":"Fr Stephen De Young","text":"Right, right. And we have to back up a little, but only a little this time. We're not going back to the chalcolithic period or anything."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":274.43,"end":280.67,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Long ago, before the fossil record began."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":280.99,"end":294.46,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, we don't have to deal with any thousands of years BC dating issues we have to deal with. In fact, we're only going back from liturgy to Matinson."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":295.01,"end":352.66,"speaker":"Fr Andrew Stephen Damick","text":"There you go. You know, Matins, that service that takes place when no one's in the church, sadly, and in many cases, or, you know, which. So, like, in our tradition, we're Antiochian priests, it's done on Sunday morning right before the Divine Liturgy. And if you go to a Greek Orthodox church, you would see the same thing. And in Russian Orthodox parishes, it is sometimes done on Saturday night combined with great vespers. But there's a lot of variation on all these points. But, yeah, it's this service that happens every single weekend in most churches. And, you know, the point of this episode is not to complain to people like, why aren't you at that service? But I do hope that by the time someone gets the end of this, they will be more Interested in going if they haven't been going, you know, just because of this particular piece that's embedded in that. You know, these resurrectional appearances of Christ are one of the key moments in Sunday Madden."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":352.66,"end":363.78,"speaker":"Fr Stephen De Young","text":"So also, stay off our lawn. And the basketball is mine now. Okay, so in terms of elderly person rant, Watch the kids go to Mattins."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":363.78,"end":365.94,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Oh, wow."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":365.94,"end":367.42,"speaker":"Fr Stephen De Young","text":"Old man yells at clouds."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":367.82,"end":372.62,"speaker":"Fr Andrew Stephen Damick","text":"So that may be our first Simpsons reference, actually on the show. I don't know."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":374.14,"end":374.54,"speaker":"Fr Stephen De Young","text":"Maybe."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":374.54,"end":374.94,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":374.94,"end":376.46,"speaker":"Fr Stephen De Young","text":"Yeah, maybe anyway. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":377.26,"end":379.18,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, the resurrection. What's the difference between."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":379.58,"end":418.65,"speaker":"Fr Stephen De Young","text":"So, yeah, so it starts with. Really? We don't even have to go back to matins quite yet because we're starting with what we say when we say Christ is risen. At least when we say it in Greek and also at least Arabic. Unfortunately, this is not necessarily clear in the Dutch version, for example. Oh. As much as it pains me to say almost physically. So when we say that Christ is risen in Greek, we say Christos anesti."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":418.81,"end":419.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":420.49,"end":426.17,"speaker":"Fr Stephen De Young","text":"And the fact that we use the verb anesti is important."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":427.05,"end":428.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because there are other options."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":428.81,"end":452.51,"speaker":"Fr Stephen De Young","text":"Right, right. And the clear other option, the other biblical option, the other biblical verb that's used to refer to Christ rising is eiro. So we could say eira. Right? Christos eirae, which would be something like Christ has. Well, literally, Christ has gotten up, but something like Christ rose, like he got up again."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":452.75,"end":457.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's the verb that you would use, like, if I was, you know, sleeping and then I got up."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":457.69,"end":463.29,"speaker":"Fr Stephen De Young","text":"Right. And that's. Even. That verb is even used of Christ in the New Testament."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":463.45,"end":463.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":464.17,"end":468.01,"speaker":"Fr Stephen De Young","text":"To talk about his act of physically rising."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":468.73,"end":469.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":469.77,"end":480.25,"speaker":"Fr Stephen De Young","text":"But what we profess when we're professing that Christ is risen is more than that, not less than that. It includes that, but it's much more than that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":480.65,"end":535.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, He's. He's not just like waking up off an operating table, you know, like. Like, he flatlined and then now he's back, you know, which I think it's. You know, I think that's. And we're going to unpack what that means. But I think this is a really, really important point to pause at for a second because I think that that's what a lot of people imagine when they think of the Resurrection, in fact, you know, like. Well, and they think, for instance, that the stone gets rolled away. Well, of course the stone has to get rolled away so he can get out, you know, which is the way I've seen even depicted sometimes. Right. In various dramatic presentations is the stone has to get rolled away so that he can get out, because otherwise he's trapped in there, you know, which if she's just sort of resuscitated, then that's. Yes, obviously that would be sort of necessary. But actually the stone gets rolled away so other people can go in and."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":535.64,"end":538.68,"speaker":"Fr Stephen De Young","text":"Have a look and see that he's not there."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":539,"end":544.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right. So he's not just getting resuscitated. There's something else going on here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":544.52,"end":574.1,"speaker":"Fr Stephen De Young","text":"Right. And so what's happening when in Christ's resurrection is different than what's happening when Lazarus is restored to life, or the widow of Nain's son is restored to life, or the widow of Zarephath's son is restored to life by prophet Elijah. Right. It's not the same thing, though. I think a lot of people may think about it that way. They think that Christ just sort of comes back to life and then 40 days later flies up into the sky."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":574.42,"end":586.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, it's not that those other raisings are unrelated. Right. And we're going to talk about especially Lazarus later. But. But they're not the same event. It's not the same."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":586.34,"end":642.94,"speaker":"Fr Stephen De Young","text":"It's not the same phenomenon. Yeah, right, right. And so we don't. And this is why we don't go around festively proclaiming Lazarus is risen. Right, right. Because the consequences are not the same. So that particular word, Right, anastasis, that we use to refer to Christ's resurrection. Right. The. The icon of the. That's actually the icon of the harrowing of hell is usually labeled in Greek. That. That's what it's a depiction of. And so then that's against the. The Euro verb. Right. That I was saying earlier. And so that the verb form anistemi, which is related to anastasis, is actually a very important one in the Old Testament."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":643.57,"end":651.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Sorry, you guys thought you were going to escape the Old Testament for a second there. Yeah, no, that's not a thing on this podcast."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":655.97,"end":687.02,"speaker":"Fr Stephen De Young","text":"So we have to go back. When we're talking about Christ, we want to understand that. We have to understand how that verb is used in the Old Testament, and it's used particularly in relationship to the day of Yahweh or the day of the Lord as it's usually translated in English. So which. Which produces the interesting thing in most English Bibles, that it's day of the Lord in all caps in the Old Testament and day of the Lord without the caps in the New Testament."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":688.06,"end":688.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":688.94,"end":717.23,"speaker":"Fr Stephen De Young","text":"As if it's two different days. But we'll come back to that, too. So that day is a day that's described prophetically in the Old Testament when several things are going to happen. And they all come under the context of this is the day when Yahweh is going to visit his people, the God of Israel is going to come and visit his people, visit his creation."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":717.79,"end":772.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And this is a really important word, and it does not mean like, you know, oh, my cousin visited last week and we had a good time together. You know, it's not that it's the visited, like, you know, and judgment was visited upon them. You know, that's the visitation they were talking about, you know, in English. We don't usually use it that way. That's more of a. I think we probably associate that mainly with the Bible, but we still do have that usage in English that there's this visitation of the Lord, you know, God showing up in person, or, you know, as every mother has said, at some point, wait until your father gets home. Like, that's what's being kind of talked about. Like, there's a. It's a warning. You know, there's something really big that's happening. So, you know, you better get it together."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":772.86,"end":784.67,"speaker":"Fr Stephen De Young","text":"Right. It's the archetypal instance of this is in Genesis 3, when Adam and Eve have broken the one commandment. They had one job, Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":784.67,"end":784.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":784.95,"end":801.11,"speaker":"Fr Stephen De Young","text":"You had one job and they've broken it. And then God comes walking in the garden in. It's usually translated in the heat of the day. It's actually literally in the Hebrew in the spirit of the day, in the ruach."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":801.59,"end":802.39,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":803.59,"end":810.41,"speaker":"Fr Stephen De Young","text":"And it's the heat or the spirit of the day. Ha Yom."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":811.53,"end":812.29,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":812.29,"end":821.29,"speaker":"Fr Stephen De Young","text":"This is already an early, like, allusion to this day of the Lord idea. Right. And so that's why Adam and Eve kind of scatter and hide."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":821.77,"end":822.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":823.85,"end":838.01,"speaker":"Fr Stephen De Young","text":"Because he's now come to visit and so some things are going to happen based on him. Now stuff is about to go down. Yeah. So the kids go and hide behind the furniture. Right, Right. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":838.49,"end":912.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. You know, it's funny you mentioned that, but we were just doing. So I'm taking Old English, among other things, and we were just doing a translation of Genesis chapter 3 from Old English into Modern English. And what was interesting was to look at the way that that translation worded things. So, for instance, you know, in most English Bibles, where God shows up in the garden, you know, he says, why? Why were you hiding to Adam? You know, where are you? And Adam Says, well, I hid because I was naked. Right? And in most Bibles, you see him saying, you know, who told you that you were naked? Did you eat of the tree? But in the Old English, it says, how did you know that you were naked if you didn't eat of the tree? Like, it's this sort of accusatory, you know, like, he's not even giving Adam a chance at that point. In the Old English, which is kind of fun, which I think follows the Latin that the Old English is from. This is not a huge digression. It's actually kind of a fun, fun point about this because, you know, it's this idea of, you know, dad is showing up, things are out of place, and he's come to put. Bring justice."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":912.96,"end":921.6,"speaker":"Fr Stephen De Young","text":"Right. And that's. I'm pretty sure we've talked about this in a past episode, that, that justice biblically is not criminal justice."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":921.84,"end":923.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not punishment."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":923.52,"end":949.29,"speaker":"Fr Stephen De Young","text":"People have broken the law, so now here come the cops to punish everybody. Right. For the bad things they did. It's. Justice is a state of being where, you know, the. The web of relationships we've talked about that sort of constitutes what a thing is. Those are all correct and all in the right place, and everything is in proper order and everything is functioning together properly. That's justice."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":949.45,"end":949.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":949.85,"end":954.25,"speaker":"Fr Stephen De Young","text":"And so injustice is when someone does something that throws that out of whack."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":954.49,"end":954.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":955.05,"end":994.62,"speaker":"Fr Stephen De Young","text":"And then to judge is to come and put that back into whack, to put it back into the correct order. And so when God comes to visit, that's going to happen. Right. And so that's going to be good news for some people and not good news for some other people. Right, Right. And so this is one of the major things that's going to happen when the day of the Lord comes. Yahweh, the God of Israel, is going to come into his creation and he's going to set things right. Right. This is what the prophets are saying again and again. And do you want to read an example? One of many that we."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":994.62,"end":1059.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, there's piles of them. Yeah. It's fun if you like. If you do. If you go to BibleGateway.com and just search for instances of day and Lord in the same verse, you'll just see boom, boom, boom, boom, boom, boom, boom. All these references to the day of the Lord. And here's one example. So this is Isaiah, chapter 24, verses 21 and 22. On that day, the Lord will punish the heavenly forces in the heavens and the Earthly kings on the earth, they will be imprisoned in a pit, locked up in a prison, and after staying there for a long time, they will be punished. That is the useful Net Bible, which is not particularly poetically phrased, but kind of gives you the sense of what's going on with the underlying language. Yeah. The day of the Lord, he's going to punish the heavenly forces in the heavens and the earthly kings on the earth. So there's that sense of the judgment of both the, you know, the divine council and human beings at the same time."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1059.97,"end":1070.62,"speaker":"Fr Stephen De Young","text":"Right. And an important thing to note here is that you notice that they're imprisoned on the day of the Lord."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1071.02,"end":1071.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1071.9,"end":1079.1,"speaker":"Fr Stephen De Young","text":"And then punished after this. After many days, after this long period of time."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1079.1,"end":1090.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As the Net Bible puts it, they'll be imprisoned in a pit, locked in a prison, and after staying there for a long time, they will be punished. So there's clearly a span of time that happens between these two different events."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1090.38,"end":1133.33,"speaker":"Fr Stephen De Young","text":"Right. And so this has. This has something to say about how we interpret Revelation 20, light of the Old Testament. Right. That when St. John talks about demonic forces being imprisoned or bound for a period of time after which comes their judgment, that's not some new revelation, pardon the pun, that he's having about. About pure future events. He. He's. He's speaking out of. Out of this prophetic idea. So the day of the Lord here, for Isaiah is not the last day, like the end of the world day, like."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1133.33,"end":1134.09,"speaker":"Fr Andrew Stephen Damick","text":"No. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1134.57,"end":1135.29,"speaker":"Fr Stephen De Young","text":"Last day."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1135.53,"end":1138.33,"speaker":"Fr Andrew Stephen Damick","text":"No, it's the coming of the Lord to set things right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1138.49,"end":1146.65,"speaker":"Fr Stephen De Young","text":"Yeah. It is sort of a quintessential day. It is a day where certain divine realities are going to break into the world of human experience."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1147.9,"end":1148.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1148.1,"end":1149.26,"speaker":"Fr Stephen De Young","text":"In a powerful way."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1149.5,"end":1157.1,"speaker":"Fr Andrew Stephen Damick","text":"It's a. It is, frankly, a doomsday. Because to lay down doom. Yeah, well, but to lay down doom is to lay down judgment."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1157.26,"end":1157.74,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1157.74,"end":1172.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. So. So I like the English word I deem. Right. A deem is to. Is. Is about perceiving the way things are and laying down a judgment of what the way they're going to be. So it is a doomsday. You know, sorry, I had to throw in a little bit more Old English there."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1172.18,"end":1174.87,"speaker":"Fr Stephen De Young","text":"So this is your want."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1175.51,"end":1182.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Thank you. I can't make all of the pop culture references that you make, so I'm going to import a bunch of Old English. So."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1182.75,"end":1185.99,"speaker":"Fr Stephen De Young","text":"Yes, yes. Different kinds of nerds. Appreciate."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1185.99,"end":1186.63,"speaker":"Fr Andrew Stephen Damick","text":"It's okay."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1186.63,"end":1187.67,"speaker":"Fr Stephen De Young","text":"Our repartee."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1187.75,"end":1189.83,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1192.15,"end":1225.99,"speaker":"Fr Stephen De Young","text":"There are also a number of passages within the prophets that talk about the signs of this day. Right. When this day arrives, here's how you'll know it's that day. Yeah, right. And we've got. Honestly, again, for any of these things we're talking about, there are countless examples we mostly talk about. We picked shorter ones so that we wouldn't be reading all night."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1227.39,"end":1229.79,"speaker":"Fr Andrew Stephen Damick","text":"Once you know the pattern, you start to see it everywhere."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1229.95,"end":1236.35,"speaker":"Fr Stephen De Young","text":"Yeah, but. So we've got one of those from Isaiah. Two Isaiah as well."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1236.59,"end":1266.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, another. Yeah, Isaiah, chapter 13, verses 9 and 11. Again, this is from the Net Bible. Look. The Lord's day of judgment is coming. It is a day of cruelty and savage raging anger, destroying the earth and annihilating its sinners. Indeed, the stars in the sky and their constellations no longer give out their light. The sun is darkened as soon as it rises and the moon does not shine. It's interesting how, again, you've got this theme of justice being given in both heaven and earth at the same time."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1267.14,"end":1330.34,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. There is never a point where the Hebrew prophets are materialists, where they're just purely talking about, like, social justice. Right. They do talk about social justice, but they talk about social justice as it flows from. Right. The, the, the rebellious spiritual powers, the way in which sin infects humans and then the way in which they then tyrannize and victimize the poor and the weak and the cosmic justice and the powerless. Right. And so when God cast his judgment, he starts with, you know, it's. It. It goes from the head down. Right. So it starts with the actual progenitors of the actual problem. But as Father Andrew was reading that you might have noticed that the description there of the day of the Lord. And you'll find this if you do the searching in all these passages. A lot of that imagery shows up in the Gospels."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1331.38,"end":1332.28,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1332.51,"end":1335.23,"speaker":"Fr Stephen De Young","text":"A particular place. And that's surrounding the crucifixion."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1335.71,"end":1336.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1336.43,"end":1405.49,"speaker":"Fr Stephen De Young","text":"And is depicted in our crucifixion icons of Christ, the sun and the moon hiding their faces. It's in our hypnography. Right. And we've talked about how the sun and the moon, them having faces is not quaint or artistic. Right. Or a sub reference to Mac tonight, but is. You see, these are the spirits associated with them. Right. These are the heavenly hosts that the heavenly powers. Right. Who are being sort of blotted out. So this is. Here's one association where we see that the gospel writers are telling us that this day of the Lord that was prophesied comes about at Christ's crucifixion. And so Then there are other things within the prophets that are going to happen when the day of the Lord comes. And one of those is the rising of the saints, of the righteous ones, of the holy ones."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1405.97,"end":1406.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1406.33,"end":1449.16,"speaker":"Fr Stephen De Young","text":"This is the resurrection, as for example, the Pharisees would have understood it. Right, right. Which is. Comes out of. You especially find this theology laid out really well in Second Maccabees, where within the experience of martyrdom that the faithful Judeans had under the Greeks, under the Seleucid Empire, where they refused to disobey God and were tortured and killed for it, for keeping the Torah, the promise to them is that not just that, oh well, you'll have some kind of bodiless, eternal heavenly well being, you know."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1449.24,"end":1451.24,"speaker":"Fr Andrew Stephen Damick","text":"Or go to heaven when you die."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1451.32,"end":1467.97,"speaker":"Fr Stephen De Young","text":"Yeah. Some kind of paradise. But no, you know, the limbs that are now being tortured and severed will be restored. Right, right. That there will be part of that justice being established, is that these people who have been wrongfully slain will live again."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1468.45,"end":1562.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's this for all of you Peugeot fans out there, a flip that occurs. Right. Those who have been being oppressed by these evil powers and by those who, you know, those human beings who are in cahoots with them, those who are being oppressed are going to be lifted up on high, not to become new oppressors, but rather to take the place of these rulers who have abused their rule and have been harmful to others. That the fallen are going to be lifted up, that they're going to be vindicated. And not just vindicated, given some kind of restitution or whatever, but actually brought up to the very top. I mean, it's a pattern you see over and over again in Scripture. Right. I mean, think about Joseph, for instance, who's given in slavery into Egypt and then, you know, by the end of the story, he's in charge of Egypt essentially, you know, and he of course, is regarded as a type of Christ. Yeah. So, I mean, it's a cool. It's a cool pattern. And it's. Again, it's a really interesting. Because it's not one you see in paganism. Right. In paganism, the, you know, this sort of great chain of being where the important people are on the top and the lowlier on the bottom. Like that's the way it's supposed to be. And it never changes. You know, peasants and slaves don't become rulers within a. The pagan model. But this is exactly what happens on the day of the Lord, is that people who are slaves become like stars."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1563.29,"end":1565.05,"speaker":"Fr Stephen De Young","text":"Yeah. Small G gods."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1565.37,"end":1565.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1566.01,"end":1593.9,"speaker":"Fr Stephen De Young","text":"Yeah. In the Roman system, it's Caesar who. Who becomes a God, Right. And the slaves, you know, become dirt, which they're only slightly above in the first place. Right. And so, and this is what Christ is saying over and over and over again when he says, the last shall be first and the first shall be last. Right. And he has been faithful with a little, will be given much. He who has been right will have it taken away from him again and again and again."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1594.7,"end":1595.1,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1596.94,"end":1631.31,"speaker":"Fr Stephen De Young","text":"In particular, St. Matthew in his Gospel highlights this happening at Christ's death. And that's in that kind of cryptic and somewhat weird passage in Matthew 27, verses 52 and 53, where many of the saints of old, many of the holy ones of old, these righteous ones. And it's interesting how if you read it in detail, how St. Matthew describes it, right. Everyone reads over it very quickly. It just says, oh, so people came to life and they were seen around Jerusalem."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1631.47,"end":1631.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1634.83,"end":1646.59,"speaker":"Fr Stephen De Young","text":"What it actually says is they. They rise, they come back to life. Right. They're resuscitated in their tombs, but they don't come out of their tombs until Christ comes out of His."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1648.19,"end":1648.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1648.91,"end":1680.57,"speaker":"Fr Stephen De Young","text":"So on a very literal reading, it's like St. Matthew is saying they sort of sat around for 36 hours or so in their tombs on Friday night and Saturday in the tombs, because they didn't want to jump the gun. And then when Christ rose, they came out. Now, that's. I don't think that's what he's trying to say. Yeah, like I said, it's a very literalistic reading. I think what he's doing is he's tying. They're rising to Christ's death to the day of the Lord."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1680.81,"end":1681.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1681.21,"end":1693.29,"speaker":"Fr Stephen De Young","text":"This is one more piece that this is the day of the Lord. But he's saying that they aren't seen. They aren't seen in Jerusalem until. Yeah, until after Christ's resurrection and the heroine of Hades."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1693.45,"end":1818.22,"speaker":"Fr Andrew Stephen Damick","text":"And just as a kind of sidebar on this, because, like, some of the questions that we get sometimes are about questions about literal versus metaphor and all that kind of thing. And this is important because often modern thinkers, we tend to. We put things in either one of two categories. This literally happened or it metaphorically happened, which means it didn't happen, but it teaches us something useful, you know, whatever. In this particular example, when we say that this is the way that St. Matthew depicts it, that that's the important very first step, Right. We're not going to say, do we need to say that these people were hanging around for 36 hours in their tombs, waiting for Jesus to rise, and then they could come on out. Like, we're not saying that, but we should ask, well, why does Matthew depict it in this way, even while we don't know what actually is going on inside those tombs? Right. And the answer to that question in this case is because Matthew. Matthew's connecting it to the day of the Lord. It's saying these are the things that happen when the day of the Lord comes. Right. And so these are signs by which we know that the day of the Lord has happened. So you know that. That one can. One can look at something and say, well, that's not just a metaphor or it's not just a symbol, and yet not take it literally in a materialist sense. Like, materialism is not the only way to take things literally. If that makes. If that makes any sense. Like when we say that the sun and the moon and the stars are angels, if you take that literally as material in a materialist sense, then you're saying. So you're saying they're not big balls of gas. Is that what you're trying to say? You know, but. But again, taking it in the sense literally, in other words, taking it by what is written, that's what literally actually means that. That assuming materialism as the only frame within which to take things literally is where you get into big trouble with all of this. So I know that's a bit of a digression, but I think it's a useful hermeneutic point to make as we kind of move forward through some of this stuff."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1818.46,"end":1842.52,"speaker":"Fr Stephen De Young","text":"Right. It's. You determine what St. Matthew is saying, and then as orthodox Christians, we're committed to the fact that what St. Matthew is saying is true. Right, Right. But he's not saying everything. He's not saying every possible way. You could write, read it. He's not saying. He's not a. A 21st century person."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1843.32,"end":1843.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1844.84,"end":1848.6,"speaker":"Fr Stephen De Young","text":"So he's not making any they might be giant sub references."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1848.76,"end":1849.16,"speaker":"Pedro","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1849.24,"end":1853.16,"speaker":"Fr Stephen De Young","text":"Even if you think you see one, you're wrong. He's not making one. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1855.24,"end":1857.24,"speaker":"Fr Andrew Stephen Damick","text":"So now you might be the other way around."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1857.32,"end":1868.02,"speaker":"Fr Stephen De Young","text":"Yeah, I might be. It might be the other way around. They might be giants might be referencing St. Matthew, but. Right. So that's the key. The key is what is he saying?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1868.34,"end":1869.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1869.94,"end":1871.38,"speaker":"Fr Stephen De Young","text":"What can I read into that?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1871.54,"end":1995.59,"speaker":"Fr Andrew Stephen Damick","text":"Right, so the righteous live again as part of the day of the Lord. And it's fun, actually. Like there's. And again, this is not a piece of dogma. Okay. But a couple of episodes back. You heard me finish out the episode by reading from the Gospel of Nicodemus talking about the harrowing of hell. The interesting frame that I didn't read as part of that is that sometime after the resurrection, there's this conversation going on. And I think they actually have Ananias and Caiaphas become believers, I think, within this text, if I remember correctly. That's not the important point, though. The important point is there was a discussion about, you know, the harrowing of hell. And I think it's Nicodemus says to these other Jewish leaders, well, if you want to know what happened down there, do you remember when these people rose from the dead, when Jesus died? Well, two of them were the sons of Simeon who received Jesus into his arms when Jesus was a baby. And these two sons of Simeon are living in this town nearby, and they're just praying night and day. Maybe we can get them to come here and tell us what it is that they saw down there in Hades when they were there and everything went down. So that's. That this bit from Matthew is used as a sort of a framing device for that passage, which is so powerful. And I mean, I'm not saying that I believe that that is literally what happened and that whoever wrote that text is saying that that's literally what happened. But. But as a way to introduce, transmitting that tradition to us. That's the frame that's used within the scope of that text. And I don't need to accept that as being a historical document in the sense that we think about those things now like it's a newspaper article, but rather the point is, it's expressing this is what happens when Christ harrows hell. And I've never seen it written in any better way, actually, from. Frankly."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":1996.07,"end":2031.79,"speaker":"Fr Stephen De Young","text":"Yeah. And so all of this is going to happen on the day of the Lord. And so because of that, what we find in the Psalms, particularly other places as well, but particularly in the Psalms, because this is hymnography. Right. Are these calls for God to come and. To come out of his holiness and come to visit. Right. To come from his throne. Right. Where he's seated, and a throne to come and judge the earth."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2031.87,"end":2032.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2032.27,"end":2054.65,"speaker":"Fr Stephen De Young","text":"To come and do this. To come and have this visit, have this day, bring about justice, restore them to life. And so the way those calls are phrased is for God to arise. Yeah, right. Reading from his throat. To arise. And in Greek it is anesti at. Various forms of the verb."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2054.89,"end":2055.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2055.29,"end":2073.05,"speaker":"Fr Stephen De Young","text":"That are used in these. In these psalms to describe this, of course, you know, the one that should jump to mind if you've been listening to our past episodes is probably Psalm 82, 81 in the Greek, verse 6. Right. Arise, O God, and judge the earth."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2075.04,"end":2075.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2075.68,"end":2112.97,"speaker":"Fr Stephen De Young","text":"You shall inherit from all the nations. Right. But there's a ton of them. And I'm going to rattle these off. They'll be in the transcript at some point. And there you go. Pause, pause the recording of this later. We're not going to read them all, but these are just a sample from the Psalms. Psalm 3, verse 7. 7, verse 6, 9, verse 19, 10, verse 12, 12, verse 5, 17, verse 13, 68, verse 1, 74, verse 22, 102, verse 13. And then I threw in Isaiah 33, verse 10, another one from Isaiah where it's calling on God to. Using that verb arise."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2113.53,"end":2113.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2114.49,"end":2139.18,"speaker":"Fr Stephen De Young","text":"And many of those, if you. If you. When you could pause it or transcript it or what have you, if you look those up, you'll see that several of those are actually used as the prokimanon, meaning they're sung right before we read the resurrection appearance Gospels in Matins in Orthros."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2139.26,"end":2139.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2141.26,"end":2178.33,"speaker":"Fr Stephen De Young","text":"So they're done immediately as a lead in. Right. And they're calling on this. And so this means that the day of the Lord also becomes known as the day when God will arise to come to judge. It becomes the day of Anastasis. Right. And so when in our Pascha hypnography, which. On Pascha, and we're still doing it now for the whole Pascha season, when we sing, for example, this is the day of resurrection. This is the day of Anastasis."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2178.73,"end":2183.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And also this is the day that the Lord has made."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2184.28,"end":2187.96,"speaker":"Fr Stephen De Young","text":"Yes. That doesn't just mean, hey, God's given us another day."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2188.44,"end":2188.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2188.8,"end":2191.16,"speaker":"Fr Stephen De Young","text":"No, look at the trees and flowers and butterflies."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2192.28,"end":2201,"speaker":"Fr Andrew Stephen Damick","text":"No, this is the day that the Lord has appointed. This is the day he set aside. This is the day that he made for all of this to go down."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2202.12,"end":2216.08,"speaker":"Fr Stephen De Young","text":"Which is how it fits. Right. We have this sequence when we're singing the paschal verses of God arising and his enemies being scattered and smoke vanishing and wax melting. And then it's like, this is the day the Lord has made. Let's rejoice and be glad."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2216.4,"end":2220.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not like a non sequitur, right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2221.12,"end":2251.45,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. This is the day. That's why we're rejoicing, and that's why we're glad. Because God has come to visit his people and establish justice. And that's what we're celebrating on Pascha we're celebrating the anastasis. And the New Testament, particularly St. John's Gospel, really established this point that Christ is the anastasis."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2251.77,"end":2252.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2252.53,"end":2256.41,"speaker":"Fr Stephen De Young","text":"And Christ is Yahweh, the God of Israel, visiting his people."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2256.81,"end":2389.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And I think sometimes when. When people celebrate Posco or Easter, they have this sense of. Again, this takes us back to that resuscitation versus resurrection thing, you know, like, oh, he. Like, he made it. Like, that's. That's the way I think some people feel about it. Something like. Like, he died, but. But he. He made it. You know, they brought him back. That. That's. That's the way it's. It's taken sometimes. And obviously it's. It's supercharged with a sense of he did it for himself or the God, the Father. Father raised him or the Spirit raised him. Right. I mean, these are all. This is all biblical language, but still, I think it's the sense of, like, everything was risked and it looked like he died, but he made it. But actually, what's going on here is this is him. I mean, we talked about the herring of hell, you know, a couple of episodes ago, but this is. This is. In a sense, this is now what's going on everywhere else, all at the same time. Right, right. You know, like, there's this great hymn that we say it's said by the priest during the Divine Liturgy. It's also done at the end of the Proskamidi service. And I think there's a couple of other places too, where we say, in the grave with the body, but in Hades with the soul is God, and in paradise with the thief, and on the throne with the Father and the Spirit was thou, Christ, filling all things thyself uncircumscribed. In other words, he was doing. He was harrowing hell. His body was in the grave. He was, you know, meeting the thief in paradise, and he was on his throne, you know, reigning with God the Father and the Spirit all at the same time. This is all. So in some sense, this. This episode is continuing to talk about everything that happens in the resurrection. You know, that it's. That it is, as you said, it's just arising. He's standing up now to offer judgment on the world, which, as you said, is bad news for some beings and good news for others based on where they are. Are they unjust? Then they're going to be, you know, put in their place. If they're just, then they'll be justified. You know, they're vindicated. They're put back, you know, where they should be."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2389.6,"end":2390.4,"speaker":"Fr Stephen De Young","text":"In a good way."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2390.72,"end":2392,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2393.52,"end":2437.94,"speaker":"Fr Stephen De Young","text":"Yeah. And one of the ways St. John really brings this out, right. In Christ's identity. And this is another one of those pieces of the gospel. Writers knew full well that they were saying Jesus is God. They were saying he's Yahweh, the God of Israel, because this arising is arising from his throne in the heavens and coming to earth to visit his people. And so when St. John says that's what Christ is doing, right? That Christ is the anastasis, that's what he means. But in John 11, verses 23 through 25, there's kind of a subtle wordplay going on in the Greek that doesn't necessarily come out in English."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2438.82,"end":2439.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2440.34,"end":2444.02,"speaker":"Fr Stephen De Young","text":"And this gets a little thorny, so I'm gonna go through it slowly."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2444.34,"end":2454.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is the raising of Lazarus, and it's the little dialogue that Jesus has with. With Saint Martha right before he calls Lazarus forth from the grave, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2454.83,"end":2497.88,"speaker":"Fr Stephen De Young","text":"She has sort of gone out to meet Christ as he's arriving. From her perspective, arriving too late, right? Because she's already said that, you know, if you had been here, Lazarus wouldn't have died, right? So in verse 23, Jesus says to her, your brother will rise again. Right? Literally, your brother will rise. Your brother will. And it's honesty. It's that verb, right? Your brother will rise. Right. And so St. Martha hears that and interprets it as Christ saying that St Lazarus was a righteous man. He's one of the righteous."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2498.36,"end":2500.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Gonna be part of that resurrection, Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2500.88,"end":2523.26,"speaker":"Fr Stephen De Young","text":"When the day comes, he will be one of those who is restored, who shines like the sun, stars. He will be one of those. And so we know that that's how she heard it. Because in verse 24, Martha says, I know that he will rise again. I know that he will. Honesty. And in English, it's in the resurrection, Right? I know that he will. Honesty in I anastasis."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2523.26,"end":2523.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2523.62,"end":2566.33,"speaker":"Fr Stephen De Young","text":"He will rise when that day comes, when the anastasis happens, Right. When God visits his people. Yes, I know. He was. He was a righteous man. He will rise. He'll be one of those who rises when that day comes. And then she says, at the last day, right? So she's referring specifically to that event. When the day of the Lord comes and the anastasis happens, then he will rise. Verse 25, Jesus responds to her and says, I am e goe me. He spells it out, which you don't have to in Greek. That's why it's so Important. You don't need to put the EIO there at the beginning, Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2566.41,"end":2569.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, you can. He could have just said imi, Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2570.01,"end":2608.41,"speaker":"Fr Stephen De Young","text":"Yeah, IMI covers it. Right. He says. But he says, I am invoking, obviously, all of that for the Old Testament, the resurrection, the anastasis and the life. Right. So he is. He says, I am the anastasis. So he identifies himself, Christ, identifies himself in that verse as Yahweh, the God of Israel who has come to visit his people. Meaning Lazarus doesn't have to wait. Yeah, right. Lazarus doesn't have to wait. This is happening. This is happening now."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2608.81,"end":2617.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The day of the Lord has come. And now. Would it be correct to say it's in progress even now, 2000 years later?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2618.98,"end":2622.94,"speaker":"Fr Stephen De Young","text":"Well, no, but we'll get to that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2622.94,"end":2623.46,"speaker":"Fr Andrew Stephen Damick","text":"All right, all right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2623.46,"end":2624.54,"speaker":"Fr Stephen De Young","text":"We'll get to second and third half."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2624.54,"end":2625.78,"speaker":"Fr Andrew Stephen Damick","text":"Just wanted to throw that out there."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2627.62,"end":2643.87,"speaker":"Fr Stephen De Young","text":"But so if you understand that, if you understand that exchange and that Greek wordplay and what Christ is saying there, then all of a sudden, the Troparian that we sing at the raising of Lazarus, the Apolitikian of Lazarus Saturday makes a lot more sense."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2644.11,"end":2737.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then we sing it on Lazarus Saturday, and then the next day in Palm Sunday. And it brings all this together. So this is what it is in the version that we use. O Christ God, when thou didst raise Lazarus from the dead, before thy passion, thou didst confirm the universal resurrection. Wherefore we, like babes, carry the insignia of triumph and victory and cry to thee, O vanquisher of death, Hosanna in the highest. Blessed is he that cometh in the name of the Lord. So you've got all this imagery there of not just raising Lazarus from the dead, but then it's connected to that, to the resurrection. Right. But then also triumph and victory, destroying death. And blessed is he that cometh in the name of the Lord. Cometh to do what he's bringing the day of the Lord. That's why he's arrived. All of that is coming there. Yeah. You know, it's interesting to me, a lot of times you hear sermons on Palm Sunday where. And this is not wrong, Right. They'll kind of point out the irony, like, well, today they're saying, you know, blessed is he that cometh in the name of the Lord. But then. But. But, you know, in a few days, they're going to be saying, crucify him. Crucify him. Which is accurate, of course, but the hymnography actually for Palm Sunday is nowhere ironic like that, because I think it's underlining like. No, they're right. When they say that this is the day of the Lord when they're saying, blessed is he who comes in the name of the Lord. They're correct. Now they don't really understand the full import of what they're saying, but that's correct. And so we're going to say that with them, this is the day."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2738.73,"end":2753.07,"speaker":"Fr Stephen De Young","text":"Right, right. And universal resurrection is not my favorite translation in that because it. We, we think of universal meaning. Oh, well, just, you know, when he raised Lazarus, that showed that everybody's gonna rise from the dead."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2753.15,"end":2754.11,"speaker":"Fr Andrew Stephen Damick","text":"Right? No. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2754.11,"end":2761.15,"speaker":"Fr Stephen De Young","text":"And it's actually like. And some translations have this. The resurrection of the universe. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2761.39,"end":2762.59,"speaker":"Fr Andrew Stephen Damick","text":"The cosmic resurrection."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2762.59,"end":2790.78,"speaker":"Fr Stephen De Young","text":"Right. So. So Lazarus rising is the sign. Right. Is the sign that's given at the time that to show to St. Martha and everyone else that what Christ just said about the day of the Lord having come is true, is the fact that Lazarus isn't waiting around, he's already risen. And that confirms that the whole cosmos, the anastasis of the cosmos now is coming."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2792.46,"end":2792.86,"speaker":"Pedro","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2793.18,"end":2823.33,"speaker":"Fr Stephen De Young","text":"And so that's why throughout the New Testament, the New Testament authors, the apostles, will refer to the time we're living in, that. The they that they were living in the beginning of. And we're living in the second millennium of. Or the. Sorry, the third millennium of is the last days, the latter days, the last days. Because we're in that window that we saw, for example, and there's plenty of other prophets who talk about it, but that we saw the prophet Isaiah talking about."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2823.57,"end":2824.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2824.05,"end":2827.33,"speaker":"Fr Stephen De Young","text":"Between the day of the Lord and the final judgment."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2828.02,"end":2831.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there we're in the period where he rules in the midst of his enemies."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2831.78,"end":2836.82,"speaker":"Fr Stephen De Young","text":"Right. More about that in our next episode."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2836.82,"end":2837.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2837.82,"end":2843.7,"speaker":"Fr Stephen De Young","text":"Refer to a future episode, people playing bingo out there. That's right, our episode in two weeks."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2844.1,"end":2869.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. Lord of spirits. Bingo. Yeah. In two weeks it's gonna be ascension and then a couple weeks after that we're gonna talk about Pentecost. So it's going to be fun. Yeah. So the day of the Lord has come. We are now in the last days. And then there's this final wrap up that's going to occur and we'll be doing Lord of spirits episodes until then, God willing."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2871.21,"end":2873.25,"speaker":"Fr Stephen De Young","text":"I don't want to live that long necessarily."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2873.25,"end":2873.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2873.53,"end":2879.33,"speaker":"Fr Stephen De Young","text":"Who knows how long depending on when it happens. If I make it to 90, I'm going to wake up every morning and just look around and be like."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2879.33,"end":2879.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. Really?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2881.11,"end":2881.91,"speaker":"Fr Stephen De Young","text":"Seriously?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2882.63,"end":2897.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean. Yeah. You know, three score years in ten four score years was more than those as toilet. So. All right. Well, that wraps up the first half of our show. So we're going to go ahead and go to break and we'll be back and we'll be taking your calls."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2899.35,"end":2915.67,"speaker":"Steve","text":"Father Andrew Steven Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of of the Lord of Spirits. Give them a call at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2921.11,"end":2951.92,"speaker":"Announcer","text":"Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2952.16,"end":2960.42,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2960.42,"end":2964.62,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a tovarish you could count on."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2965.34,"end":2974.86,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2974.86,"end":2977.42,"speaker":"Steve","text":"Dervish Parish didn't even know her name."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2977.9,"end":2979.98,"speaker":"Fr Stephen De Young","text":"It wasn't anything they thought about."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2980.7,"end":2992.65,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":2992.65,"end":3007.69,"speaker":"Steve","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3009.93,"end":3029.46,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. We are now at the second half of the show and this is where we begin to take your calls. And like you just heard the voice of Steve said, It's 855 AF radio. That's how you connect with us. And we actually do have a caller waiting, but I'm not exactly sure who this is. So caller, can you hear me?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3030.9,"end":3035.62,"speaker":"Steve","text":"He will be a staff for the righteous. Wait for them to stand and not to fall."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3035.94,"end":3039.3,"speaker":"Fr Andrew Stephen Damick","text":"Jody, did you play the recording again there? What's going on?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3039.3,"end":3042.3,"speaker":"Steve","text":"In hope of those who should I keep going? I should get going."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3043.66,"end":3050.06,"speaker":"Fr Stephen De Young","text":"I have to say when you do that live, read every single episode, you nail it at the beginning."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3050.86,"end":3053.26,"speaker":"Fr Andrew Stephen Damick","text":"Ladies and gentlemen, the voice of Steve."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3053.74,"end":3055.7,"speaker":"Steve","text":"Yeah, Calculon is a one take robot."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3055.7,"end":3066.06,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I get it every time, Bobby. That's pretty good. I Mean, you almost made me believe that Trudy was playing the recording, so nice."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3066.78,"end":3069.06,"speaker":"Steve","text":"Longtime voiceover contributor, first time caller."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3069.06,"end":3069.66,"speaker":"Fr Andrew Stephen Damick","text":"Good to be here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3069.66,"end":3133.45,"speaker":"Steve","text":"Thanks for taking my question. So before we get too deep into the giggles, which I know we can do, because you guys are talking about post resurrection appearances of Christ, and I guess the question that I want to toss out to you is something that Father Stephen alluded to earlier when he mentioned Genesis chapter three, which includes a pre manifestation of the Lord, right? The walking in the garden, the hearing of the feet, the footsteps. But the question that I have is in the hymn of Cassiani, right, Which we sing on the matins of Holy Wednesday, she draws a connection between, you know, the feet of Christ, the feet that the sinful woman washed with her hair, and the feet that were in the garden. And, you know, into this question of like, post versus pre, what does that mean for a Lord that in this resurrected body walks around with a wound in his side and enters this room where the doors were locked? And I'm not trying to ask a time travel question. I don't know if I'm asking a time travel question, but."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3135.69,"end":3148.41,"speaker":"Fr Andrew Stephen Damick","text":"These are the questions that my wife hates. She actually fast forwards through a lot of calls. No offense, callers, but what could I say? But yeah, whenever we watch Star Trek, she's like, it's a time travel episode. I'm leaving."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3148.81,"end":3149.45,"speaker":"Fr Stephen De Young","text":"Like, oh, great."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3149.45,"end":3151.53,"speaker":"Steve","text":"They're hard to write, admittedly. They're hard to write."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3151.85,"end":3164.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So, okay, so your question basically is, is the. The God who walks in the garden, is that the resurrected Christ?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3165.34,"end":3178.34,"speaker":"Steve","text":"Is it the same body? You know, like, maybe that's a way to phrase it. Is it the same body? Is it the same feet that are. That the sinful woman is wiping, that are actually that Adam and Eve? Eve here in the garden? Maybe that's the way to ask it."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3178.34,"end":3189.69,"speaker":"Fr Andrew Stephen Damick","text":"Although even then, like, she's doing that before he's crucified before, you know, like, obviously there's lots of timey wimey wibbly wobbly. I'm not actually a Doctor who fan, but I know that phrase."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3190.01,"end":3191.29,"speaker":"Fr Stephen De Young","text":"Yeah, you said it backwards."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3191.45,"end":3198.73,"speaker":"Fr Andrew Stephen Damick","text":"I. Well, that proves I'm not actually a Whovian. I tried and they became too creepy for me. What can I say? Sorry, whovians."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3200.25,"end":3202.41,"speaker":"Steve","text":"There's only 70 years of catch up to do."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3202.89,"end":3203.29,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3203.29,"end":3206.57,"speaker":"Fr Stephen De Young","text":"That's from. That's from Blink, which is one of the best episodes."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3206.73,"end":3207.29,"speaker":"Fr Andrew Stephen Damick","text":"Is it?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3207.99,"end":3213.59,"speaker":"Fr Stephen De Young","text":"Yes, from season three of the new series. I think it's episode 10. Anyway."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3213.75,"end":3216.95,"speaker":"Fr Andrew Stephen Damick","text":"Of course, you could just rattle that off. Congratulations."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3217.11,"end":3217.75,"speaker":"Pedro","text":"Thank you."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3217.91,"end":3243.67,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. So. Right. Okay. So what is the relationship between. Because, I mean, I think I have some idea of this, but, I mean, I don't know, lay some of it out. And actually, part of the answer to this question actually is so just to pull the veil off a little bit for everybody, part of the answer to this question is, you know, c. The second half of this episode. Right. But. But we can take it head on initially. So help us out here, Father Stephen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3243.83,"end":3249.91,"speaker":"Fr Stephen De Young","text":"So the question is, are they the same feet? Is it the same body? The answer is yes."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3250.47,"end":3253.79,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Thanks."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3253.79,"end":3254.15,"speaker":"Steve","text":"Thanks for."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3254.15,"end":3254.47,"speaker":"Fr Andrew Stephen Damick","text":"Thanks."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3254.47,"end":3255.19,"speaker":"Steve","text":"I appreciate it."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3258.23,"end":3271.73,"speaker":"Fr Stephen De Young","text":"Right, so to say a couple of other things and let the reader understand or the hearer understand, I guess in this case, that someone keeps moving my chair."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3272.45,"end":3275.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh, see, I got that one. I caught that reference."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3276.21,"end":3285.01,"speaker":"Fr Stephen De Young","text":"So, Captain America. I caught that reference. You catching that reference was a reference to the Inception sound."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3289.3,"end":3294.18,"speaker":"Fr Andrew Stephen Damick","text":"That guy out there who hates the giggles on this show right now is out of his mind. He's going out of his mind."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3294.42,"end":3327.56,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. But to say Sabura, part of. I think what's getting asked in this question, aside from the wibbly, wobbly timey wimey bits, is, I think, partly an appearance question, because sometimes it's depicted that way in orthodox iconography. Like you could find icons of the creation. Creation of man, where it's Christ. Right. The way he looks in the incarnation, in the icons of Christ, like forming Adam out of mud."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3327.56,"end":3332.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I have one of those right here in my studio. Have him the sun and the moon."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3332.36,"end":3371.61,"speaker":"Fr Stephen De Young","text":"Yeah. And so insofar as it's a question of. Or when Moses was sitting there talking to Christ, was he seeing the form that the disciples saw? Right. In terms of the visual thing, that gets complicated. That's part of what we're going to be talking about in this half. And so because there's this degree to which, after the resurrection, Jesus did. Did and didn't look like Jesus."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3372.09,"end":3372.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3373.69,"end":3418.9,"speaker":"Fr Stephen De Young","text":"And even more so, in the book of Revelation, St. John sees Christ. Right. It's the same person who he was, like, leaning on at the mystical supper. Right. And he's like, bronze and has, you know, white woolly hair and. Right. But he still knows exactly who it is. Right. So the yes is to identity. Right. The yes is not necessarily to the way in which it was visually his. He was experienced by human eyes."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3419.38,"end":3435.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, when Moses sees the angel of the Lord in the burning bush, that is our Lord Jesus, but he's not seeing him the way that you Know, Thomas saw him when he said, my Lord and my God."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3436.65,"end":3439.77,"speaker":"Fr Stephen De Young","text":"Well, his act of seeing is the same."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3440.33,"end":3442.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, There you go."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3442.33,"end":3452.42,"speaker":"Fr Stephen De Young","text":"Right. But the way he describes that experience is different. Yeah, Is different. Right. But there's still an I. There's still an identity there. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3452.58,"end":3452.98,"speaker":"Fr Andrew Stephen Damick","text":"We."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3453.3,"end":3458.86,"speaker":"Fr Stephen De Young","text":"We are at a very visual age where, for us, identity. One of the big factors in identity."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3458.86,"end":3459.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3459.02,"end":3461.14,"speaker":"Fr Stephen De Young","text":"Your ID card has a photo."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3461.46,"end":3461.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3461.82,"end":3494.59,"speaker":"Fr Stephen De Young","text":"Right, Right. That's how you prove you are who you say you are, is a photo id. Right. Here's a picture. Here's me. They look the same. Take your mask off. Right. But that's not. When you have a society that can't even think of a camera. Right. That's not how you identify people. Right. That's not. Your sense of identity, isn't what you look like. Right. When you've seen a not very good quality reflection of yourself on occasion."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3495.71,"end":3496.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3497.87,"end":3500.03,"speaker":"Fr Stephen De Young","text":"Your image is not who you are."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3500.55,"end":3500.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3500.75,"end":3524.27,"speaker":"Fr Stephen De Young","text":"I would say now, today, and I think social media has really brought this home, that the image we put out there is not who we are, and we kind of know it, but it sort of. It sort of never was. So that. That gets into another aspect of what we're about to talk about in this half. And so if you want to just hang around Steve for the next 45 minutes, I mean, we could spend an."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3524.27,"end":3526.54,"speaker":"Fr Andrew Stephen Damick","text":"Entire show just answering questions from Steve."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3527.25,"end":3531.01,"speaker":"Steve","text":"Yeah, well, look, I mean, I've got to talk you guys into the next commercial break, so come here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3531.09,"end":3532.21,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3533.97,"end":3544.77,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well. All right. Well, I'm just gonna. I'm just gonna leave you unmuted if you want to. Just. If you have something that really important that you want to ask about. But remember, this is not your show. Okay, Steve?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3545.33,"end":3547.61,"speaker":"Steve","text":"So I know boundaries. I appreciate boundaries."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3547.61,"end":3555.67,"speaker":"Fr Andrew Stephen Damick","text":"And I don't want people to think that we're suddenly having, quote, unquote, guests on the show. So he's just a caller. But anyway. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3555.83,"end":3557.67,"speaker":"Steve","text":"A persistent caller who's overstayed his law."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3557.67,"end":3558.07,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3558.07,"end":3558.71,"speaker":"Fr Stephen De Young","text":"Well, there you go."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3560.39,"end":3562.55,"speaker":"Fr Andrew Stephen Damick","text":"So, voice of Steve, everybody."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3564.87,"end":3565.83,"speaker":"Fr Stephen De Young","text":"Round of applause."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3567.83,"end":3627.67,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right. Okay. So. All right. Father Christ's resurrection appearances, we mentioned these are in the. These are what are called the Eothenon Gospels that are in the. There's 11 of them in matins on Sundays, and we hear them over and over again. I mean, we do all 11, and then we do all 11 again, and we just keep doing it until Lent starts. Right. Actually, it even continues into Lent, if I remember correctly. So, like, this year's Lent is actually affected by last year's Pascha, you know, the same cycle continues on and on, and then it finally resets. Then when you get to Palm Sunday is actually when it finally resets. So, okay, Christ appears. So let's actually talk about some of those. What's going on there when Christ appears, Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3627.67,"end":3676.52,"speaker":"Fr Stephen De Young","text":"So we've covered the procumina, right? We've covered the setting, the stage for. For what was going to happen. And we covered a bit of what happened. And so now this is the next thing, right? This is the next thing that happens, right? But these are resurrection appearances, right? These are resurrection gospels, right? So what's going on in these series of stories in the final chapters of the Gospels and in these appearances is part and parcel of what Anastasis is. It's part of that reality. So we have actually, before any of the gospels were written, St. Paul was already writing his epistles."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3677.24,"end":3678.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah, they're older."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3679.32,"end":3720.75,"speaker":"Fr Stephen De Young","text":"In his first canonical epistle to the Corinthians, which wasn't the first one he wrote, because in it he refers to a previous one in chapter 15. This is sort of well known, I think, by people as sort of the Resurrection chapter. Right. This is the Anastasis chapter. This is the chapter where St. Paul is talking about Christ's resurrection and our resurrection and sort of. Sort of laying all that out. And so he begins that discussion in verses 3 through 8 by laying out sort of what. What a lot of people think is an early creedal statement, sort of an early statement of an early encapsulation of the Gospel."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3721.07,"end":3781.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. I'm going to read this to everybody so you can get what we're talking about. This is First Corinthians, chapter 15, verses 3 through 8. For I delivered to you first of all that which I also received, that Christ died for our sins according to the Scriptures, and that he was buried, and that he rose again the third day according to the Scriptures, and that he was seen by Cephas, then by the 12. After that, he was seen by over 500 brethren at once, of whom the greater part remained to the present, but some have fallen asleep. After that, he was seen by James, then by all the apostles. Then last of all, he was seen by me also as one born out of due time. And it's. It's interesting. Like he says, now, I'm going to deliver to you this gospel that I received. And he lists off, you know, four things. He died, he was buried, he rose again, and he was seen. And he was seen, and he was seen, and he was Seen and he was seen. Like for Paul, this is part of what the Gospel is, is that he was seen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3782.5,"end":3785.78,"speaker":"Fr Stephen De Young","text":"Right. And actually most of the text. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3786.1,"end":3786.94,"speaker":"Fr Andrew Stephen Damick","text":"Is about that. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3786.94,"end":3807.12,"speaker":"Fr Stephen De Young","text":"Characters or words is about these resurrection appearances. Right, right. He covers Christ, crucifixion, burial and rising in two verses and then spends three on listing these. Sorry, spends four or five listing these appearances."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3807.2,"end":3808,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3810.56,"end":3869.95,"speaker":"Fr Stephen De Young","text":"And so clearly these appearances are of greater import to St. Paul in terms of his, his argument. Right. About the salvation of humanity. St. Paul sees the resurrection appearances is playing this, this important role. Which would explain why we read them over and over again in our, in our Sunday matin services. Right. This is that the church in her liturgical worship has carried on this sense of importance that St. Paul already saw in the, in the 50s A.D. so the way, nonetheless, the way this is read, this list is read by most modern people, regardless of their sort of background or theological commitments or otherwise, is this is read as St. Paul is presenting a bunch of evidence."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3871.4,"end":3871.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3872.12,"end":3928.11,"speaker":"Fr Stephen De Young","text":"So St. Paul, you know, says this, that Christ was crucified and that he was buried. He doesn't think he has to prove that. Right. That's, that's a matter of Roman record. Right. Nobody's, nobody's disputing that. But then he says Christ rose from the dead. And so he's expecting that there could be some people who dispute that. And so he's like, well, I'm going to give evidence, I'm going to name all these witnesses, right. To prove my case that Christ rose from the dead. And there are examples of this sort of across the ideological spectrum when it comes from the Bible 1 on the, what we would call the more liberal side. Now, Rudolf Bultmann is not a 19th century German liberal, but he might as well be mid 20th, a mid 20th century German neoliberal. Yeah, yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3928.19,"end":3928.59,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3930.99,"end":3947.47,"speaker":"Fr Stephen De Young","text":"He said about this passage and his comments on this passage was that he found it, he found it very strange and surprising that St. Paul thought that giving evidence would, for Christ's resurrection would help prove his case."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3948.51,"end":3949.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3950.2,"end":3964.2,"speaker":"Fr Stephen De Young","text":"Like he thought that was weird. And this comes from something we talked about. I don't remember if it was last time or the time before. I bash 19th century German liberals so much, it's hard to keep track."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3965.4,"end":3968.44,"speaker":"Fr Andrew Stephen Damick","text":"It's like breathing for you, this sort."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":3968.44,"end":4013.89,"speaker":"Fr Stephen De Young","text":"Of positivist, this 19th century positivist view of history. Right. Where we could have this scientific understanding, understanding of exactly what happened. Right. And you apply this methodology and we determine what happened. And so, you know, you can look at that and say, well, look, you know, we've, we've read David Hume. No testimony can ever prove that a miracle happened because a miracle is so far outside the bounds of nature that the amount of evidence you would need to believe it can never be supplied by fallible humans. Therefore we can't believe it. So Bultmann looks at it and says, well, listing a bunch of people who claimed they saw Jesus doesn't. Doesn't prove anything."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4014.21,"end":4014.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4014.93,"end":4064.63,"speaker":"Fr Stephen De Young","text":"This can't be a historical event because people don't rise from the dead. Right. So this has to be a spiritual, some kind of spiritual event or metaphor or something in the immaterial realm that St. Paul is talking about. And so why is he talking about evidence? And so then we also talked about how the response to that from most conservative Protestant and Roman Catholic scholars, Bible scholars, has been, rather than staking out another position, has been to take that same definition of history and then just to insist that. No, what the Bible gives us is exactly that kind of objective perspective, lists sort of mathematical, scientific kind of history."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4065.11,"end":4071.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, yeah, St. Paul is trying to satisfy historical, you know, his. The historical critical method."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4072.15,"end":4082.87,"speaker":"Fr Stephen De Young","text":"Right. And so Josh McDowell and son. I'm not meaning to pick on them. They're just, they're the highest profile people who have done this, who have taken this evidential approach to."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4083.11,"end":4083.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4083.76,"end":4131.14,"speaker":"Fr Stephen De Young","text":"Christ's resurrection appearances very publicly and are famous for it. Say. Okay, well, no, St. Paul is giving evidence. And this is good evidence. Right. And this testimony is good. And this proves Jesus rose from the dead. Right, right. And that's not a solution to the problem either because St. Paul was not a 19th century German and didn't understand history that way and isn't trying to. Isn't here trying to give evidence. Right. That's not why he lists this, as we're all we were already talking about. And as we're about to talk about further, there are other reasons why St. Paul sees these appearances as crucially important to."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4131.54,"end":4134.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's part of the gospel."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4134.34,"end":4136.82,"speaker":"Fr Stephen De Young","text":"Yeah, right, right. Yeah, right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4137.62,"end":4150.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think a lot of this then is we can kind of wipe away that whole question of evidence by asking this question, why does almost no one seem to recognize Jesus after he rises from the dead?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4151.14,"end":4151.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4151.5,"end":4168.67,"speaker":"Fr Andrew Stephen Damick","text":"And the reason why. Yeah, exactly. As a way into to describing this. Because. Because if this is supposed to be quote, unquote, evidence for the resurrection of Jesus, then why include the detail that they didn't recognize them? That undercuts that argument."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4169.55,"end":4169.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4169.91,"end":4173.03,"speaker":"Fr Andrew Stephen Damick","text":"You know, well, they saw somebody who."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4173.03,"end":4189.45,"speaker":"Fr Stephen De Young","text":"Knows who that was, you know, if you were manufacturing. Manufacturing stories, right. If you were manufacturing evident testimony, right. There are all kinds of things in these stories that you would definitely not include."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4189.52,"end":4189.76,"speaker":"Fr Andrew Stephen Damick","text":"Include."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4190.48,"end":4207.96,"speaker":"Fr Stephen De Young","text":"And this element of people not recognizing Jesus after the resurrection, like, I mean, this is basic, right? Like your whole idea of testimony would be, if you're gonna have someone testify to the fact that Jesus rose from the dead, it would be, yeah, I saw Jesus die and then later I saw him alive. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4207.96,"end":4208.92,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's the same guy."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4208.92,"end":4212.72,"speaker":"Fr Stephen De Young","text":"That's basic. And it's the same guy testifying."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4212.72,"end":4228.85,"speaker":"Fr Andrew Stephen Damick","text":"Put him in a lineup and identify him. Yeah, but that's not what's going on. Over and over again, you get this detail that some people, like, who is this? Or that they have no idea who he is, even though they totally knew him before. You know, over and over you have."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4228.85,"end":4247.08,"speaker":"Fr Stephen De Young","text":"You know, in Matthew 28, verse 17, all of these people are gathered on. On this mountain in Galilee, right? Where. Where Christ is. They all see him there. And it tells us in Matthew 28, verse 17, they worshiped him. But some doubted."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4248.04,"end":4252.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That's another one of those phrases. You're like, I don't know what that means. I'm just going to keep reading."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4253.4,"end":4262.68,"speaker":"Fr Stephen De Young","text":"Right. Some doubted that he's standing right there. Right. Like, why, why, why would anyone doubt if he's standing right there? Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4262.68,"end":4269.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's something about him that is not the same, the memory that they had."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4271.81,"end":4331.97,"speaker":"Fr Stephen De Young","text":"And you see, now we have to do a brief. I'm not going all the way down the rabbit trail, I promise. But St. Mark's gospel is the gospel that if you go with what's called the shorter ending of Mark, where it ends in Mark 16, 8. There are no resurrection appearances in St. Mark's Gospel, properly speaking. Right. The second eothenan is from St. Mark's Gospel, but it's the women, the holy myrrh bearers coming to the tomb and seeing that Jesus isn't there. And then that's it. There are another 12 verses, right, that are referred to as the longer. There's some other stuff too, but anyway, referred to as the longer ending of Mark. This could get really granular. I'm fighting my urge to get into it because I'm a nerd. This is hard."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4331.97,"end":4332.37,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4334.93,"end":4396.81,"speaker":"Fr Stephen De Young","text":"These other verses, they're referred to as the longer ending of mark. These other 12 verses and those other 12 verses when you read them are sort of a summary of. I mean, it's not like clear narration of resurrection appearances. It's sort of A summary of a bunch of resurrection appearances, some of which are in other gospels. Like, it refers to Christ appearing to two of them while they were walking on the road, which seems to be a reference to the road to Emmaus in St. Luke's Gospel and that kind of thing. And so there's all this back and forth in scholarship about whether that's part of St. Mark's gospel or not. But there's like a really simple solution to it if you're familiar with the orthodox lectionary, because those extra 12 verses are the 30 Athenan gospel. So they come after Mark 16, 1:8 is the second E Athenan and before the beginning of the ones from St. Luke's Gospel."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4397.13,"end":4397.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4398.41,"end":4438.35,"speaker":"Fr Stephen De Young","text":"So there are actually several little pieces of scripture like this. The woman taken adultery is one of them. They're little passels of verses where in our early New Testament manuscripts they show up in different places. Sometimes they're omitted, sometimes they're in a different gospel, sometimes they're in a different place in the same Gospel. And so your typical practitioner of biblical scholarship amongst our Protestant friends will say based on that, well, it's not quote unquote original. Just ignore it, get rid of it. Don't worry about it. Not in the Bible."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4438.83,"end":4454.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because there's this concept that the Bible consists of a series of continuous texts known as the gospel according to St. Matthew or the Gospel, you know, whatever, rather than the way that these texts actually were used initially, which is as lectionary readings."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4455.08,"end":4481.26,"speaker":"Fr Stephen De Young","text":"Right. And just shy of half, a little over 40% of the new Testament manuscripts we have today are lectionary manuscripts. If you buy a critical edition of the Greek New Testament, there are precisely two of them that were incorporated into it. Not 2%, two, like 1, 2."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4481.82,"end":4482.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4482.7,"end":4560.18,"speaker":"Fr Stephen De Young","text":"So there are literally thousands, like 2400 or so, a little more than that of New Testament manuscripts whose readings you do not find in critical Greek New Testaments. The patriarchal Greek text that the patriarch of Constantinople put out in 1904 and it was revised in 1912, used 250 of those lectionaries to put together its text. But so even with that, there's thousands lecture texts not taken into account if you're copying from a lectionary into a continuous text. Right. So someone wants a copy of the Bible for themselves for their own study. Right. Or we're going to be giving a copy of the Scriptures to someone, a bishop comes to visit the monastery, and so we're going to have one of our copyists make him a beautiful text of The Scriptures to give to him as a gift to take back to his cathedral. Right. The texts you have to copy from in a lot of cases are your lectionary texts. Right. You've got the Gospel book, the Epistle book. So when you take and copy from those, you run into things like the 30 Athenan."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4560.74,"end":4561.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4561.86,"end":4578.9,"speaker":"Fr Stephen De Young","text":"Well, where does that go? Well, we can't shove it into the middle of Luke to put it before E. Athenan 4 in Luke's gospel. That wouldn't make any sense in the reading. But if we put it at the end of St. Mark's gospel, it kind of makes sense because he doesn't have any resurrection appearances."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4579.54,"end":4580.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4580.26,"end":4635.75,"speaker":"Fr Stephen De Young","text":"Right. And so if, for example, at different monasteries or different churches, the gospel reading about the woman taken in adultery was read on different days, it would fall in different places in the lectionary. And so when a copy of The Gospel of St. John was made from those lectionaries, it would occur in different places when you copied it. So there's really a simple explanation for that. All that is to say that there is in Mark 16:14. Right. So if we take this longer ending. Right. Or if you'd rather, if you want to be super dogmatic about it, in verse 6 of the 30 Athenan, Christ basically upbraids his disciples for not believing that he was risen from the dead."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4636.07,"end":4657.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is an interesting point because it says, you know, in that verse, he rebukes them because they did not believe those who had seen him after he had risen. So what you're getting then is, you know, this bit that's stuck at the end of Mark where it's referring to things that didn't happen anywhere else in Mark's Gospel."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4657.57,"end":4658.05,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4658.13,"end":4658.69,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4659.01,"end":4682.45,"speaker":"Fr Stephen De Young","text":"Yeah. But so even in St. Mark's gospel, if we take that longer reading here, here again, we have this weird thing where people who. People have seen him and they don't believe it. Right, right. St. Luke's Gospel. Right. The road to Emmaus is probably a famous one of these, where Christ is walking on the road with two people. Those two people are talking to Christ about Christ."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4683.33,"end":4683.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4685.17,"end":4691.83,"speaker":"Fr Stephen De Young","text":"They're talking to Jesus of Nazareth about Jesus of Nazareth and don't recognize that they. They're talking to Jesus of Nazareth."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4691.91,"end":4696.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is the one that I refer to as the feast day that comes to our church here in emmaus once every 11 weeks."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4697.03,"end":4697.51,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4698.07,"end":4738.83,"speaker":"Fr Andrew Stephen Damick","text":"And actually we have. So if you ever. So, folks, if you ever come to St. Paul's here in Emmaus, Pennsylvania, you will see on the outside of the Church, great big icon of Christ sitting down at the table and eating with Saints Luke and Cleopas, breaking bread with them there. And that's the moment that they rec. That's the moment that they do recognize him. After having this whole conversation with him on the road, I always get these jokes like, so do you live on the road to Emmaus? I'm like, no, I live in Emmaus. I live on the roads in Emmaus. Not to road to Emmaus. That's known as Allentown. That's the road to a maze. But yeah, they have this whole chat with him and then it's only at the end that they finally recognize him for who he is."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4739.47,"end":4742.27,"speaker":"Fr Stephen De Young","text":"Right. After he's explained the whole Bible to them."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4742.35,"end":4747.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. And not just explain the Bible, but explain how the Bible applies to him, you know?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4747.92,"end":4748.36,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4749.4,"end":4751.96,"speaker":"Fr Andrew Stephen Damick","text":"All the things in the scriptures concerning himself."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4752.6,"end":4753.32,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4753.4,"end":4753.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4754.04,"end":4785.09,"speaker":"Fr Stephen De Young","text":"And so you see this in. You see this again in another well known one, John 20:14, 16, right. Where St. Mary Magdalene turns around and is looking right at Jesus, thinks he's the gardener, Right. And asks him where he put Jesus. Right. So asks Christ where Christ is while she's looking right at him. And it's only when he then says her name, all of a sudden she recognizes him."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4785.49,"end":4785.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4786.69,"end":4820.06,"speaker":"Fr Stephen De Young","text":"And then you have it in the next chapter in this is one of the weirdest ones in terms of how it's phrased in John 20. Or, sorry, John 21:4. Right. Christ is walking on the shore, they're fishing, they see him. They don't know that it's Jesus. Then in verse 12, once they've come ashore, they're getting ready to eat with him. There's this phrase that St. John uses. No one asked him who he was because they knew it was the Lord."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4821.75,"end":4835.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which suggests that on the one hand, they are not sure who this is. That's why no one dared ask him. You know, like it's on their minds, like, should we say, who are you? And yet they somehow they know that it's the Lord."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4836.39,"end":4848.43,"speaker":"Fr Stephen De Young","text":"Right. Like no one says on Sunday, right after liturgy at my parish, they wouldn't say. Well, none of us asked who the priest was because we knew it was Father Stephen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4849.22,"end":4851.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Kind of an odd thing to say."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4851.18,"end":4907.78,"speaker":"Fr Stephen De Young","text":"Yeah, right. It would just be, yeah, our priest is Father Stephen. Right. So even though they now know it's him, it's not because they recognize him. And it's not until verse 20 in the same chapter, it says, then the disciples were glad when they saw the Lord. So they know it's him, but they haven't seen it's him yet. First six verses. So yes, this is this pattern that we see in the resurrection appearances of Christ through all the Gospels. That is weird. And especially makes no sense if these are supposed to be evidence that he rose from the dead. Yeah, right. Because if you were to present this as evidence, any cross examining attorney worth their salt would look at this and say they weren't sure it was him."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4908.58,"end":4911.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. This is bad evidence."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4911.54,"end":4914.58,"speaker":"Fr Stephen De Young","text":"Right. This is not a good id. This is not a good witness id."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4914.66,"end":4915.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4917.38,"end":4926.26,"speaker":"Fr Stephen De Young","text":"If you told them that, yeah, we had a lineup and at first they didn't recognize him, but then all of a sudden they did, and now they're totally sure that would not go over in court."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4926.82,"end":4942.34,"speaker":"Fr Andrew Stephen Damick","text":"And the Emmaus one is the worst because they literally spend all this time having a conversation with him and they're like, so wait, so you're saying, counselor, that your witness here had this whole conversation, then only later said, oh, yeah, that was Jesus?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4942.9,"end":4943.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4944.02,"end":4945.38,"speaker":"Fr Andrew Stephen Damick","text":"Like it's terrible evidence."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4946.02,"end":4970.61,"speaker":"Fr Stephen De Young","text":"Right. So why are the gospel writers presenting us this shift between seeing Jesus and seeing the Lord? Right. Seeing this person standing in front of them and seeing the Lord. Right. And where do we have a parallel for that in the Gospels? And that's one place. That's the Mount of Transfiguration."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4971.33,"end":4991.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. Where they go up on the mountain. Peter, James and John go up on the mountain. They know they're there with Jesus, They've been with Him. They went up there with him and then he's transfigured in front of them and they see him for who he is. They actually see the Lord of glory in his glory."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":4993.38,"end":5006.47,"speaker":"Fr Stephen De Young","text":"Right. And so that is what is being described in these resurrection appearances. Right. They're glad when they see the Lord because Christ reveals his glory to them. This is talking about his divine identity."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5007.5,"end":5013.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It doesn't necessarily. Yeah. It doesn't necessarily mean that they saw some kind of blinding light."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5014.86,"end":5015.58,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5015.58,"end":5026.78,"speaker":"Fr Andrew Stephen Damick","text":"Like, it's not. It doesn't say that. But he reveals himself in glory to them because his glory is, as you said, it's who he is. It's his identity."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5027.02,"end":5031.18,"speaker":"Fr Stephen De Young","text":"Yeah, right, Right. So this isn't ID card identity."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5031.18,"end":5031.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5031.38,"end":5037.82,"speaker":"Fr Stephen De Young","text":"This isn't a picture. This is, this isn't what the person in front of me looks like. The shape of their nose and the shape of their eyes."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5037.98,"end":5073.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. These resurrectional appearances are, and we've hammered this 20 times now, they're not evidence that he rose from the dead. They are revelations of who he is. It is a revelation of Christ. And this is one of the reasons. I mean, you could say that he spends 40 days with them. You know, he appears clearly he appears to them many, many times that aren't mentioned in the Scriptures. You know, he's with them for 40 days and appears to them many times and then ascends into heaven. So there's revelation that's going on here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5075.11,"end":5107.34,"speaker":"Fr Stephen De Young","text":"Right? And this is. Yeah, this is. This is Christ presenting his divine identity to themselves. So it's after. On the road to Emmaus, they understand the Scriptures and what the Scriptures say concerning Christ after the breaking of the bread, which is pretty obviously to everybody, eucharistic symbolism. This is when they see that Christ is Yahweh, the God of Israel, which means God has come to visit his people, which means the day of the Lord has come."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5107.66,"end":5190.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know, I wanted to give a fun detail that. So there was a senior Ukrainian priest who lived here in our area for a while named Father Basil Zaviruka. It took me years to learn to pronounce his last name. And then, God bless him, he died. I loved that man. And one of the things that he told me about, which I had no idea when I first met him, he said, you're the priest in Emmaus? And I said, yeah. He said, did you know that a lot of the Byzantine churches in southern Italy, you know, during that period, that the icon that was in the apse of the church. So in other words, you know, if you don't know where the apse is, everybody that's the usually curved wall that is right behind the altar. So if the priest is standing at the altar and he's offering the Divine Liturgy, he's looking across the altar, and the apse is what's sort of in front of him, that the icon that was placed in the apse, rather than being, as you see in many churches, you know, the community, apostles, or sometimes the crucifixion, the resurrection, various things like that, that often it was the supper at Emmaus. And so you think about that as being not just a eucharistic image, but this is a revelation of Christ in his glory that's right there in front of the altar. It's pretty cool. So just wanted to share that image and his memory. So. Yeah. Okay, so you. You."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5190.09,"end":5197.93,"speaker":"Fr Stephen De Young","text":"You can't. Right. You can't present evidence that Jesus of Nazareth is Yahweh, the God who created the universe."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5198.17,"end":5204.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, what evidence? Like, on the. What basis would you say that this is the right evidence to show that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5204.73,"end":5207.41,"speaker":"Fr Stephen De Young","text":"Right. Well, these people saw that he was right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5207.41,"end":5223.25,"speaker":"Fr Andrew Stephen Damick","text":"They saw that he was. But like, if you're a forensic investigator or whatever, it's not like you can pull out your book and say, okay, so this is what we're looking for if we're going to expect to see Yahweh, the God of Israel, you know, that Jesus is him. There's no book for that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5223.33,"end":5223.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5223.65,"end":5224.25,"speaker":"Fr Andrew Stephen Damick","text":"You know, but."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5224.25,"end":5268.16,"speaker":"Fr Stephen De Young","text":"So what you have St. Paul doing instead is he says Christ is crucified and dies according to the Scriptures. He's buried and rises again. According to the Scriptures, he repeats that phrase. Yeah. And then he appears. He appears. He appears. So when he says, according to the Scriptures, what's he saying? He's saying that Christ is back there. He's talking about the Old Testament. New Testament hadn't been written yet. Christ is back there in the Scriptures. Right. And the testimony to the fact that Christ is the God who revealed himself to the fathers of Old in the Old Testament is that he was seen to be that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5269.04,"end":5269.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5269.44,"end":5288.5,"speaker":"Fr Stephen De Young","text":"That the day of the Lord has come that. That the fulfillment of those scriptures has come specifically in Christ. And the places where. The sort of key places where people see the Lord have this experience of seeing the Lord in the Old Testament are when prophets are called as prophets."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5288.66,"end":5333.18,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. And that vision is stuff like what it's the way it's actually described in the Scriptures are scenes where it's unmistakable what they're seeing. For instance, Isaiah sees God enthroned in glory. Right. So it's clear that he's seeing God. Or Moses, for instance, sees him up on top of the mountain and he understands that's where you meet God. You know, like this is. Or you know, the vision of Ezekiel, God in his chariot, throne. Right. It's. They're seeing God enthroned. They're seeing God acting as God. You know, it's unmistakable who they're seeing. This is the prophetic experience. That is what makes them prophets."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5334.46,"end":5388.74,"speaker":"Fr Stephen De Young","text":"And the vision is then accompanied by them being sent. Right. And that verb in the Greek of these prophetic commissions is apostelo. That's where we get the word apostle. That's where we get the noun apostle. Right. That that's what makes someone an apostle. They're sent on a mission. And this idea is preserved really well in the Arabic language. Yeah. At which I am at best a dabbler. But this bit I know, and that's that there, there. There are actually two words in Arabic. I mean, there's probably more. But there are two main words, words that are used for a prophet, and those words are nabi, which is from the Semitic root in that. In Hebrew, it's na'."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5388.74,"end":5388.94,"speaker":"Pedro","text":"Vi."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5389.1,"end":5397.74,"speaker":"Fr Stephen De Young","text":"If you've studied other languages beyond English, you know that the B sound and the V sound tend to be the same consonant in most languages."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5397.98,"end":5399.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes? Yeah. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5399.98,"end":5410.76,"speaker":"Fr Stephen De Young","text":"So it's navi in plural. It's the naviim, the prophets that are part of the Hebrew Bible. But it's nabi in Arabic. But then there's also the word rasul."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5411,"end":5412.04,"speaker":"Fr Andrew Stephen Damick","text":"Rasul, Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5413.08,"end":5418.36,"speaker":"Fr Stephen De Young","text":"And that word is also used for the apostles."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5418.76,"end":5433.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's used for both the prophets and the apostles. You could say Elias Arasul, Elias the prophet, or Bulus Arasul, Paul the prophet, the apostle. But it's literally the same word in both cases in Arabic."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5434.79,"end":5520.03,"speaker":"Fr Stephen De Young","text":"And the way this has been distinguished in Arabic is that a nabi is someone who brings a message. Right. He comes and he brings a message. Whereas a rasul is someone who receives a message from God himself. Right, right. Who has this direct contact with God himself and then conveys it. So all of the rasuls, every rasul is a nabi, but not every nabi is a rasul. And so by using that word for the apostles, that word contains the idea that the apostles saw the Lord and received the message and the commission directly from the Lord and then went and brought it, that it wasn't second hand. And so they're able to convey through that terminology a lot of what's going on with St. Paul when he's defending his claim to be an apostle, that he didn't get it secondhand, that he received it directly from the Lord, but also what he's doing again in First Corinthians 15, that the apostles are those who had this prophetic experience, this apostolic experience of seeing the Lord face to face, and that that happened in these resurrection appearances."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5520.51,"end":5529.23,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. All right, well, that wraps up the second half. And we will be back in just a moment with the third half of the Lord of Spirits. We'll be back."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5529.63,"end":5551.79,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5551.79,"end":5590.72,"speaker":"Announcer","text":"Ignatius, first century bishop of Antioch, called the God bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God. Fr. Andrew Damoch recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he martyrdom, salvation in Christ, the Bishop, the unity of the Church, and the Eucharist."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5590.88,"end":5603.92,"speaker":"Pedro","text":"For Ignatius, martyrdom is really the fullness of Krishnamite in a sense, which that can be challenging for us because, number one, he doesn't seem to have any reticence at all about going to martyrdom. Like, there's no sense of, well, this."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5603.92,"end":5604.8,"speaker":"Fr Stephen De Young","text":"Is what I have to do."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5605.28,"end":5610.88,"speaker":"Pedro","text":"You know, I wish I didn't have to, but this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5611.12,"end":5622.4,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com again. That is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5622.4,"end":5637.36,"speaker":"Steve","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5638.88,"end":5666.73,"speaker":"Fr Andrew Stephen Damick","text":"You know, now, I'm not sure whether that's Steve or whether it's Steve. You know, is it life or is it mysterious? Indeed. Okay, well, we actually do have another caller. So Alex is calling in and he has a question about life after death. So, Alex, can you hear us? Alex, are you there? I think we might have lost Alex."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5667.4,"end":5670.28,"speaker":"Fr Stephen De Young","text":"All right, Alex Kidd. And he got lost in Miracle World."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5671.4,"end":5676.84,"speaker":"Fr Andrew Stephen Damick","text":"See, that's a reference I didn't get, but I giggled anyway. Just, you know. Yeah, it's okay."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5676.84,"end":5677.12,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5677.12,"end":5679.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. All right, well. Oh, Alex, are you there?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5680.36,"end":5681.32,"speaker":"Pedro","text":"I am. Hello?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5681.48,"end":5684.52,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we made it. All right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5684.52,"end":5685.88,"speaker":"Pedro","text":"Yeah, thank you."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5686.12,"end":5691.88,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, Alex, to the Lord of Spirits. What is your question? Comment, Insinuation? Accusation?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5694.85,"end":5776.09,"speaker":"Pedro","text":"Yes, my question is about our experience of afterlife or the age to come. As far as I know, my question kind of blurs the two together. So I was raised Catholic, so I have the image of the Lake of Fire in my head for hell, the garden for paradise, both just part of what I, as far as I know, we're going to experience. As I was Chrismated and have been orthodox for a while, what I've been hearing was, no, our experience of the age to come is not going to be a created fire, but instead hell is going to be those who hate God feel the presence of God in a hellish way, and those who love God experience that presence of God in a way of paradise. But then listening to the spiritual geography that doesn't quite mesh well and that I'm back to the Lake of Fire and Garden of Paradise."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5778.09,"end":5881.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you're kind of wondering what is the deal, right? Yeah, yeah. I mean, so this is something you see a lot on the Internet, this idea that hell is heaven differently experienced. I think that's the way I've seen it summarized that view. So I don't know. I mean, I. I think the thing that I'll say about this before I hand it over to Father Stephen is there are different ways of trying to describe exactly what the experience of the life of the age to come is. And they get at it from different angles sometimes. Some are wrong, some are right and can be. Even if the particular images don't aren't reconcilable with each other, they can still be right. But simply looking at things from different angles. Right. So certainly, as we know, hell and death do get cast in Lake of Fire. That's in the scripture, Right. That's not a made up idea from somewhere else. That is part of the picture. So we can't just throw that out because it's in scripture. But then again, the idea that there is this cartoon set of caverns that are with lava in them and there's demons sticking forks in everybody's butts and that's what damnation is about. And that's not really true because that is a sort of materialistic understanding of what the age to come is about. So anyway, that's what I would have to say about that. Father, why don't you go ahead and help us all out here?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5883.36,"end":5887.2,"speaker":"Fr Stephen De Young","text":"Well, you don't know what it's like to be a dead bat, Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5888,"end":5889.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's the problem."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":5891.6,"end":6055,"speaker":"Fr Stephen De Young","text":"That really is the core of the problem. Right. So when we talk about the life of the age to come, right, where we're going past a period where our human soul, consciousness, our life will be separated from our material body for a period. We don't know what that's going to be like because we haven't experienced it. Right. And then we're going even past that to the renewed heavens, the renewed earth that have been transfigured by the grace and glory of God and what that's going to be like and then what that's going to be like for whoever it is, hopefully very few who experience eternal condemnation. We have no way to get at what it's going to be like for the demons at that point. Right. In their condemnation because we don't know what it's like to be a demon now. So, because we can't know that. Right. The. The Bible presents us with a lot of imagery, but I think deliberately to keep us from being able to take any of it to sort of materially, literally. A lot of it's contradictory. Right. Like a lake of fire and outer darkness are contradictory. Right, right. These are two different images. And then we have this other image of weeping and gnashing in teeth, which is actually an image of madness. So they're competing images. They're all bad. Right. I mean, they all give us a negative idea of what that experience is like, but they can't convey that experience because there's not an analogy. There's not a way across the gap between our human experience in this age and that until we get there. This is why, you know, why it says what we will be has not yet been made known. Right. We know we'll be like him because we'll see him as he is. But. Right. And St. Paul talking about seeing through a glass darkly now. Right. So we can't fully know it. So the problem with the sort of material like a fire thing is, again, it's taking one of those images at the expense of the others and kind of overly materializing and literalizing it. There are other. I mean, a lot of that imagery related to, too. So, for example, that we use of the Orthodox Church, in addition to. Right. God's going to be all in all. So what does it even mean that someone is going to be outside of everything?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6056.38,"end":6056.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6057.74,"end":6086.29,"speaker":"Fr Stephen De Young","text":"What does it mean for a person to not exist in the sense of madness and chaos? But an imagery you'll hear is that in our salvation, we become more truly human and more fully human. And then the opposite of that is applied to what happens in eternal condemnation as people losing their humanity. Well, what does it mean to lose your human nature and not take on the nature of anything else?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6087.49,"end":6161.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, I'll add this is that one of the problems that I've seen is taking these things that are in scripture, which, remember, is given to us by God through the apostles and prophets for our salvation, taking a certain image in scripture and using it essentially to negate something else. Right. So, for instance, the idea that God is going to be all in all, there are some people who use that to say, well, then that means that there can't be any damnation. That's not a thing. And yet it very clearly says in other places that it is totally a thing. Right. So the point is that attempting to use human reason to reconcile these things. And usually the way it's done is they're not reconciled. It's just one part is pushed to the side. Right. It's just simply not going to work. Right. You know, so we're not trying to fall back on the bat thing. Although, sure is fun. But, but, but, but it's true. Right? It's true. Like, we don't know what that's about. And there's places in scripture that explicitly say to us, we don't know what that's about, or, you know, where we have these images. But we don't. We can't go past that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6161.45,"end":6177.05,"speaker":"Fr Stephen De Young","text":"That. And this is related to the hermeneutic issue we were talking about earlier in that. And this is true quite literally. From the first chapter of Genesis to the last chapter of Revelation, the scriptures weren't written to answer our questions."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6178.01,"end":6178.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6178.49,"end":6225.89,"speaker":"Fr Stephen De Young","text":"And our curiosity and explain the mysteries of the universe to us. Right. God didn't write or, you know, inspire, give the vision to the prophet Moses to write Genesis 1 and 2 to explain to us how he created the world. Right. That's not why that's there. And the last chapters of Revelation are not there because God wanted to answer our curiosity and explain to us exactly what the life of the age to come is about. Right. So we got to go with not just how do we reconcile these images in a rationalistic way, but what is each of those images being used to say? And quick rule of thumb here. All those images are to say, don't let this happen to you."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6226.29,"end":6228.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Repent."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6228.05,"end":6228.93,"speaker":"Fr Stephen De Young","text":"This be you."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6229.41,"end":6236.85,"speaker":"Fr Andrew Stephen Damick","text":"Repent for the kingdom of God is at hand. I mean, that is the message of the scripture. Repent for the kingdom of God is at hand. The day of the Lord has arrived."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6237.57,"end":6257.27,"speaker":"Fr Stephen De Young","text":"That road of sin seems awful nice now, but here's what's at the end of that road where you will end up if you go down it. Right. It's this very bad place. So it's not to give you all the details about exactly how bad it's going to be. It's just to say, this is really bad. Don't go there. Right. Take this other road instead."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6258.55,"end":6260.39,"speaker":"Fr Andrew Stephen Damick","text":"Does that answer your question, Alex?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6261.99,"end":6263.35,"speaker":"Pedro","text":"Both yes and no."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6263.59,"end":6266.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I've got new questions now. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6267.19,"end":6269.09,"speaker":"Pedro","text":"I might follow up on Facebook."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6269.65,"end":6278.45,"speaker":"Fr Andrew Stephen Damick","text":"All right, great. Good to hear from you. Okay, well, we also have Pedro on the line. So, Pedro, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6279.49,"end":6281.33,"speaker":"Pedro","text":"Hello, Fathers. Christ is risen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6281.57,"end":6282.85,"speaker":"Fr Andrew Stephen Damick","text":"He truly is risen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6285.09,"end":6288.93,"speaker":"Fr Stephen De Young","text":"Note the exact verbiage. Exactly."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6291.17,"end":6293.25,"speaker":"Pedro","text":"It has a certain euphonious quality."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6293.93,"end":6296.89,"speaker":"Fr Andrew Stephen Damick","text":"It's euphonious. Yes. To say he truly is risen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6298.73,"end":6316.25,"speaker":"Pedro","text":"So you touched on this a little bit both in your answer to the last question and previously, you know, you were talking about, for example, Boltmann. My question is largely about the value of. And you know, Father Steven, I apologize if this sounds like a loaded question coming from me, because I promise it's not."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6319.21,"end":6320.44,"speaker":"Fr Stephen De Young","text":"Talking about toll houses."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6321.63,"end":6322.79,"speaker":"Pedro","text":"No, no, I'm not trying to go."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6322.79,"end":6324.03,"speaker":"Fr Stephen De Young","text":"Okay, okay, okay."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6324.19,"end":6391.33,"speaker":"Pedro","text":"That was a one shot, you know, okay. The value of engaging in that kind of secular materialist approach to making sense of the data of scripture and spiritual reality, right? So, you know, you have people like John P. Meyer, who wrote a five, soon to be six volume, you know, thousands of pages on the historical Jesus, you know, who, you know, in his preface, he says that this is an impossible figure to reconstruct. Right. You have people like Boltzmann who kicked off a great deal of research in that same area, and you have people who try to make sense of what that historical data might actually tell us about sort of quote the true story, end quote, behind what scripture has to say day. And so, you know, is there value in engaging with that kind of scholarship? And if so, what's, what's the benefit for us as orthodox Christians who are, you know, we, we don't know what it's like to be a dead bat. And I, hopefully most of us are trying not to know what it's like to be a 19th century German materialist philosopher."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6393.81,"end":6395.33,"speaker":"Fr Andrew Stephen Damick","text":"This is all you, Father Stephen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6395.57,"end":6396.29,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6397.17,"end":6400.17,"speaker":"Fr Andrew Stephen Damick","text":"I'm not even gonna. I mean, I could say something, but whatever, you go ahead."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6400.17,"end":6560.34,"speaker":"Fr Stephen De Young","text":"Right. Let, let me start by heaping further condemnation on 19th century. Yeah. I want to be. Well, I want to be clear before I say what I'm going to. Part of what I'm going to say and answer your question. I want to be utterly clear in just how vain, void and worthless I think that whole project is in case I haven't been enough. But this modernist thinking infects even very conservative Orthodox people, right? There are plenty of well meaning, good scholars, good orthodox scholars out there, fine Orthodox Christians, holier than me by a lot. That's not saying much. I'm a low bar. But still, who take this approach to the faith or take this approach to the scripture, that, for example, you know, each biblical text means this one thing, and if we apply the right methodology to it, this sort of pseudo scientific methodology, we could extract that one thing. Right. Or they may not even apply the methodology. They may just pick a favorite church Father or favorite group of church fathers and say, well, they said it means this, so that is what it means. Right. No further anything necessary. Each thing has one mean we can establish it. And so the orthodox faith is. I have my spreadsheet and the columns are different areas of theology, and I need to fill in the correct values in each field, and then I am truly orthodox. There's going to be a test. Yeah. And where you find those, Right. That's that same kind of modernist thinking and going back and trying to reconstruct, like, I'm going to go into church history and I'm going to reconstruct the history of this, and that will tell me what the accurate orthodox belief is. Right. That I can then fill into my field. And anyone who doesn't share it, I will batter for not really being Orthodox. And. And so I. I have no love for this approach. I don't think it's worthwhile to actually exercise this approach in any field of scholarship at all. Okay, so let me be utterly clear on that. Okay? Now, that being said, in terms of why would I say somebody was doing a master's thesis and I recommended a bunch of books to them by scholars using this approach? Right? Why would I do."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6560.34,"end":6564.5,"speaker":"Fr Andrew Stephen Damick","text":"Something much has literally happened between the two of you."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6564.66,"end":6627.47,"speaker":"Fr Stephen De Young","text":"Why would I do something like that? Right? Well, because despite the flawed methodology, what that methodology teaches you to do is basically go in and tear apart a text and go in there and try and look for all of the archaeological data, all of the intertextual data, all of this stuff, and then based on your bad methodology, you will draw a lot of dumb conclusions from it. But you've also compiled all of that data, all of that information surrounding the text and related to the text. And there are things that I have ideas or chains of thinking about parts of scripture and stuff that really opened things up for me that I've gotten from some horrible radical, nutbag scholars. But they said something where I was like, well, wait a second, I feel."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6627.47,"end":6630.07,"speaker":"Fr Andrew Stephen Damick","text":"Like there should be some reference to stealing the Egyptian gold here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6632.23,"end":6702.54,"speaker":"Fr Stephen De Young","text":"Plundering the Egyptians, right? Where they take it to the total wrong place. And I come to a totally different conclusion. But they help me see some piece of data, or they help me make some connection between some extra biblical piece of literature and scripture or some ancient custom in some culture or something. And so they're doing a lot of work. I mean, you said this yourself, right? Meyer, like, basically says I'm about to embark on an impossible project and then spends decades and thousands of pages on that impossible Project. Right. So, yes, he's right. It's an impossible project. His methodology is wrong. It's not going to bear any fruit at the end. But you've got all those pages of research and material that. That you could take and do something else with, something better with that is related to what God is actually saying in scripture. Does that make sense?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6702.54,"end":6703.46,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go, Pedro."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6704.58,"end":6705.86,"speaker":"Pedro","text":"Yeah, absolutely."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6706.1,"end":6707.46,"speaker":"Fr Stephen De Young","text":"You still have to read that stuff."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6708.18,"end":6731.93,"speaker":"Pedro","text":"Yeah, I was going to say two quick follows. One, I guess I'll keep flogging through the Meyer book. And two, you know, so outside of people who hypothetically are working on a master's thesis, what is the. Is there the same value for people who aren't engaged in being in, you know, academia or scholarship? Sort of, you know, the general orthodox layman."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6734.57,"end":6810.33,"speaker":"Fr Andrew Stephen Damick","text":"You know, what I would say to that is there can be. But it's super important to have someone help you who knows what they're doing. Because it's so easy. It's so easy if. And I don't know, I don't. I doubt that this applies to you, Pedro, because I know you. But it's so easy. I mean, I did this when I was younger a lot. You read some book and it blows you away because it's talking about stuff you've never heard before, right? And then that becomes your skeleton key for everything else. You judge everything else you read. You're like, wow, now I have the key to the scripture. Now I understand, you know, whatever it might be. And, like, while. While I wouldn't devalue the experience of having your mind blown by something you've never seen before, like, that's really cool and very helpful at the same time. It's important not to let it take you into really weird places. Like, I've watched people, otherwise smart people, utterly go off the deep end because they became obsessed about, you know, aliens or about, you know, trying to figure out what it means that God can, you know, write a predestination, you know, whatever. They pick some piece, right? And then their whole theology becomes about that thing, right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6810.41,"end":6812.81,"speaker":"Pedro","text":"So you get these sort of, like, name worshipers."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6813.21,"end":6865.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, right. And I mean, I've seen people do this. So, like, they'll pick a particular church Father, for instance, and, like, everyone should be reading this church Father. I'm like, he's great. The stuff he says is good. But what you just expected every Orthodox Christian to do, the vast majority, 99.9999% of them throughout the history of the world, could never have done that. And even now, most of them still couldn't and never would. You know? So to make one particular teacher, one particular approach, whatever it might be, whatever is rocking your world at the moment, and make that the thing by which you judge everything else, the single canon, that's a problem. Right. Scripture says that there's wisdom in many counselors, if I remember the quote correctly. So that's what I would say about that. I don't know if Father Stephen would have any addition or correction to that."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6865.71,"end":6871.91,"speaker":"Fr Stephen De Young","text":"Well, yeah, it's partially just an addition to that idea that Orthodoxy is having the correct values in the correct fields."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6871.91,"end":6872.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6872.11,"end":6889.08,"speaker":"Fr Stephen De Young","text":"So people will. Before they read a book, they'll be like, well, is this book Orthodox? Is this. Is it fully Orthodox? Is everything in it Orthodox? Is there anything in it that's problematic? And if there is anything, they won't read it, or if they find out it is, then they're like, okay, well, I'm just gonna believe every word. Right. This is the truth then."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6889.32,"end":6889.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6890.36,"end":6910.09,"speaker":"Fr Stephen De Young","text":"So it's either the Bible or it's nothing. Right. I've said a few times that a lot of Orthodox folks read the Fathers the way evangelical fundamentalists read the Bible. Bible and read the Bible the way evangelical fundamentalists read the Fathers. It's either this or nothing."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6910.89,"end":6912.89,"speaker":"Pedro","text":"It's bad that that happens, but that's a great phrase."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6913.05,"end":6919.69,"speaker":"Fr Stephen De Young","text":"Right. The Orthodox Church is not here to teach you the precise and accurate meaning of each text of Scripture."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6920.17,"end":6920.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6921.13,"end":6928.86,"speaker":"Fr Stephen De Young","text":"The Orthodox Church, however, will help you learn how to read Scripture. It's not what to think, it's how how to think."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6929.02,"end":6955.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And since we're on this long, wonderful. Since we're on this long, wonderful. Actually, this is. It's a digression, but this is actually a perennial thing. We discuss in this show an article that I read by Father George Florovsky, really beautifully described. And he said that these categories overlap, but he described three categories. There's dogma, there's doctrine, and there's theology. And with dogma, everybody needs to be exactly on the same page. You know, these are the core things of our faith."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6955.81,"end":6956.05,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":6956.05,"end":7020.84,"speaker":"Fr Andrew Stephen Damick","text":"That Christ is God. That, you know, Father, Son, Holy Spirit is God. You know, these things are core doctrine is the way that you teach those dogmas. And there could be a little bit more flexibility on that. Teaching changes over the years in terms of the way that you teach something. And then theology is reflection on those other two categories. And the truth is that most of the things that are said by Orthodox theologians and writers are in that third category, which Means it's okay to disagree. As long as what you're saying is consistent with the dogma of the church, it's okay to disagree. You know, it's all right. It's okay, everybody. It's okay. So, you know, like, even, even, you know, even this, this particular program, right, we're saying a lot of things that. That could be wrong. People maybe never heard some of them before, certainly stuff I've never heard before. And that's okay, you know, take what's good, leave what doesn't, help you get on with your life, you know. So anyway, that turned into a rant. But is that helpful to you, Pedro?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7021.8,"end":7022.76,"speaker":"Pedro","text":"Yeah, absolutely."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7023.4,"end":7035.64,"speaker":"Fr Stephen De Young","text":"One last cryptic note that I won't expand upon here just to tantalize everyone. Maybe at some point in the future I will. If you understand the church fathers correctly, they never discuss, disagree about the interpretation of Scripture."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7036.12,"end":7137.52,"speaker":"Fr Andrew Stephen Damick","text":"There we go. So dun, dun, dun. Okay. All right. Well, thanks for calling, Pedro. Good to have you on the show tonight. Thank God. All right. Okay, so let's talk about. We're going to finish up in this third half. We're going to talk about some of these appearances that St. Paul lists off. Right? So the first one that he. That we want to talk about is the. The myrrhbearers. And of course, in the most orthodox churches, two Sundays after Pascha is the Sunday of the myrrhbearers. So we're talking about these women that came to the tomb of Christ to come and anoint his body, and then they discover that he's not there, that he's risen from the dead, and then they go back and they tell the apostles and they don't believe them. Right. You know, St. Mary Magdalene, of course, is called the apostle to the apostles because. Because she goes and preaches this, the resurrection, to them, and they don't believe her. My favorite bit is where when Christ is talking to Saints Luke and Cleopas on the road to Emmaus, and one of them says, you know, they literally are talking about the resurrection. You know, some women of our company amazed us and said that they had seen. They'd even seen a vision of angels who told them, told them that he was alive. But these words seem to us an idle tale. And as the one detail you pointed out to me, Father, when we were doing our prep is like, one of the women who is one of the myrrhbearers is Saint Mary, the wife of Cleopas. And Cleopas is one of the two that are on the road with him. To Emmaus. So he's literally saying, so my wife said. But that seemed to me to be an idle tale, like, dude, your own wife."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7138,"end":7138.88,"speaker":"Fr Stephen De Young","text":"Your own wife."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7139.61,"end":7146.17,"speaker":"Fr Andrew Stephen Damick","text":"Come on, man. But there's something deeper in here actually. Right. Why is it that the women get this first?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7146.49,"end":7163.53,"speaker":"Fr Stephen De Young","text":"Right. And this may not. You know, we're modern people, and so we want. We want to. It might not be apparent to us why it would be so shocking from an ancient perspective that the first people to see Christ risen would be a bunch of women."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7164.09,"end":7174.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And again, if you were trying to write a propaganda piece favoring Christ's resurrection from the dead, if you're in the first century, you do not put women as your primary witnesses."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7174.54,"end":7174.94,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7175.02,"end":7177.26,"speaker":"Fr Andrew Stephen Damick","text":"Because women can't give witness in the ancient world."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7177.26,"end":7191.18,"speaker":"Fr Stephen De Young","text":"Right. They could not testify in court. They could not testify to the truth of the matter, because people's attitude toward them is exactly what you see reflected by the disciples, by the male disciples. Right? Yeah. Some women said this. We were kind of amazed. Kind of crazy."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7191.18,"end":7191.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7191.54,"end":7227.96,"speaker":"Fr Stephen De Young","text":"You know, women. Right. But so that. That wouldn't be something you would construct. Right. But so why is it a scripture? Well, this is part of a pattern that you see repeatedly in the Old Testament, probably the most famous one. And people get super happy about me talking about the Book of Judges, but is with the prophetess Deborah and Barak, where Barak is called to be the judge of Israel, meaning he's not called to sit on the bench and hear cases. He's called to be the. The man who steps up and restores justice. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7227.96,"end":7228.32,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7229.36,"end":7278.39,"speaker":"Fr Stephen De Young","text":"To the people of Israel from their foreign oppressors. And he chickens out and whips out and fails. And so God does not leave his people to suffer because Barak failed, but raises up the prophetess Deborah and another woman jail. This is the whole tent peg through the temple thing. He raises up these women to deliver Israel. Instead, he does it through women. And this is to embarrass Barak. Right, Right. The idea is they looked down on women, considered women to be weaker, considered women to be less than a. And so the fact that he wimped out and then this woman came and did his job for him is sort of putting him back in his place."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7278.63,"end":7279.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7279.35,"end":7285.59,"speaker":"Fr Stephen De Young","text":"You see the same thing with Moses when he's confronted by his wife Zipporah about not having circumcised his children."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7286.55,"end":7286.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7286.83,"end":7339.3,"speaker":"Fr Stephen De Young","text":"Where Zipporah has to go and do it, which was his responsibility, and she has to go do it to stop God from killing Moses is how it's actually presented. Exodus has to Save has to save his life. And so it's not coincidental that while the myrrh bearing women, while the holy myrrh bearers are on their way to the tomb to anoint Jesus body, the male disciples are all hiding in a room with the doors locked because they're scared to death, right, that. That they're gonna get executed too. And so they're in hiding, whereas the women embark to go and do and give honor to Jesus. And even though they don't have a good plan, right, they're kind of halfway there and they're like, hey, who's going to roll away the stone from the tomb for us? Right? But they go and they, and they get to work, right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7339.3,"end":7339.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7339.66,"end":7369.27,"speaker":"Fr Stephen De Young","text":"And so if what's happening, as we've just said, is that when Christ is appearing to these disciples, he's making these disciples apostles, he's sending them on a mission, right? He's sending them on a mission. Then who are going to be the first people you send? Well, the ones who take their duties seriously and who aren't scared. Right. So the women disciples are given this gift of being the first disciples to become apostles."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7369.67,"end":7416.17,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Awesome. Okay, so the second one that we wanted to talk about, when Christ appears to St. Peter, if I remember correctly, if you're looking at the Eothenon gospels, this is the very last one, isn't it? The one in St. John where Christ restores Peter by asking him, you know, do you love me? Do you love me? Do you love me? And so you might ask the question, well, why does Peter, why does he ask him three times, you know, do you love me? And you know, number one, the question, do you love me? Is not, Peter, how do you really feel about me? Right. That's not. That is not what love is. That is not what love is."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7416.33,"end":7418.09,"speaker":"Fr Stephen De Young","text":"That is, you think I'm a good guy?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7418.33,"end":7472.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. You know, how is our friendship, Peter? You know, that's not what it is. Love is to sacrifice yourself for the other. It's. It's about loyalty, right? So basically he's saying, peter, are you going to be loyal to me from now on because you left, you know? And so he asks him three times. And as the Fathers say, why does he ask him three times? Because Peter denied him three times, and so it's to bring him back, you know, but there's, there's something, there's some fun textual stuff lurking under there. In English, it says, do you love me? Do you love me? Do you love me? Some people look down and they see that there's two different Greek verbs in there that refer to love, and then they say, oh, there's something going on here other than just the English word love. Is that true, Father Stephen?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7472.31,"end":7476.31,"speaker":"Fr Stephen De Young","text":"Yeah. So if you weren't mad at me about the judges thing, get ready to get mad at me now."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7476.63,"end":7477.19,"speaker":"Fr Andrew Stephen Damick","text":"All right?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7478.15,"end":7487.6,"speaker":"Fr Stephen De Young","text":"Because, I mean, this preach is like crazy. People have preached beautiful sermons on this, and unfortunately, yes, unfortunately, it's not true."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7487.92,"end":7497.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And C.S. lewis kind of writes a whole book about. This is where we're gonna really make people hate us. C.S. lewis writes a whole book called the Four Loves, which is a lovely book. A lovely book."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7497.6,"end":7505.04,"speaker":"Fr Stephen De Young","text":"Yeah. And you could make distinctions about love. I'm just saying they don't hold up grammatically, linguistically."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7505.36,"end":7506.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7506.48,"end":7517.74,"speaker":"Fr Stephen De Young","text":"So the idea is something along the lines of when Christ. Christ first asks St. Peter if he loves him, he uses the verb ao."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7518.94,"end":7522.38,"speaker":"Fr Andrew Stephen Damick","text":"Which is, you know, a in the noun form."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7522.94,"end":7556.76,"speaker":"Fr Stephen De Young","text":"Yeah. Which, you know, they want to say is, this is divine love. And then he. He uses fileo in the second two times. He also switches lambs and. And lamb and sheep. And sometimes people draw something out with that, too. But the. The loved one is the one they tend to focus on. And they say, well, Christ is sort of condescending by switching the verb, because they want to say that. That. That. That phileo is. Is sort of love. Like friendship, brotherly love."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7556.76,"end":7557.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7558.4,"end":7560.32,"speaker":"Fr Stephen De Young","text":"And like Philadelphia. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7560.72,"end":7562.24,"speaker":"Fr Andrew Stephen Damick","text":"Just like in Philadelphia."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7563.28,"end":7565.44,"speaker":"Fr Stephen De Young","text":"So it's always sunny there, I heard. But anyway."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7567.39,"end":7570.67,"speaker":"Fr Andrew Stephen Damick","text":"It is, in fact, not always sunny in Philadelphia."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7571.07,"end":7599.15,"speaker":"Fr Stephen De Young","text":"So here's the problem with that. If you're going to argue that linguistically, if you're going to argue that contextually with St. John, you have to show that St. John uses those terms different ways consistently in his writing. Right, Right. Or at least in his Gospel, at least in St. John's Gospel, you'd have to be able to go through and say, well, see, look what he uses as one verb. He means this, and when he uses this other verb, he means that. And that's not what you get if you read St. John's Gospel in Greek."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7599.47,"end":7599.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7599.87,"end":7603.15,"speaker":"Fr Stephen De Young","text":"What you get is that he uses the two words interchangeably all the time."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7603.63,"end":7614.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then, you know, sort of exhibit A is that phrase. Again, we see in English the disciple whom Jesus loved that gets described with those different verbs."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7614.27,"end":7627.56,"speaker":"Fr Stephen De Young","text":"Yeah. Loved in there. You don't see it in English because they both get translated. Love, loved. But he alternates the verbs, and that doesn't mean there's one disciple who Christ loves. With divine love and then another disciple who he's just friends with."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7628.28,"end":7640.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or that his relationship with John is going back and forth between. Right, yeah. No, it's literally a synonym. It's literally a synonym, everybody."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7640.44,"end":7654.81,"speaker":"Fr Stephen De Young","text":"And this is reflected by the fathers, St. John Chrysostom. Don't take my word for it. St. John Chrysostom's Greek was a lot better than mine. He says very explicitly that Christ asked St. Peter the exact same question three times."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7655.21,"end":7655.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7657.21,"end":7681.21,"speaker":"Fr Stephen De Young","text":"So it just doesn't work. And I'm sorry I had to do that to people I hate. There's some Sunday school and homily thing I hate ruining for people. Right. There's also no linguistics relationship between eleison and kyrie. Eleison and olive oil. But anyway, I won't go into that now. But. So the key here is that St. Peter is being contrasted with Judas."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7681.61,"end":7682.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7682.37,"end":7695.46,"speaker":"Fr Stephen De Young","text":"Both of them betray and deny Christ. St. Peter repents and is restored by Christ. Judas goes and destroys himself. That's. That's the key contrast that's going on here."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7695.46,"end":7731.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which, honestly, that, to me, is a much better homily than the agape Philia one. But. Yeah. Okay, so the next one we wanted to talk about, we sort of already talked about a little bit, so we don't have to say too much about it, I think is, you know, the 11 who Christ appears to them finally. Right. What were they spending most of their time doing? Hiding and then later fishing. Like, literally, they saw the Lord and then, like. And then they went back to their boats. Guys, guys, you have a job to do here, you know?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7733.2,"end":7739.76,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah, yeah. And you could say, well, Christ told them to wait for the Holy Spirit. It's like, yeah, he told them to wait there."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7741.2,"end":7741.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7741.68,"end":7744.48,"speaker":"Fr Stephen De Young","text":"In Jerusalem, which is where Pentecost happened."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7744.88,"end":7745.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7745.76,"end":7747.44,"speaker":"Fr Stephen De Young","text":"Not go back to Galilee and fishing."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7748.24,"end":7758.08,"speaker":"Fr Andrew Stephen Damick","text":"And again, if this is apostolic propaganda, this makes them look bad. So it's badly done propaganda, if that's what the claim is, that this is all just propaganda."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7758.4,"end":7769.12,"speaker":"Fr Stephen De Young","text":"Right. Because our defense attorney would say, oh, he appeared to you risen from the dead and sent you to go baptize and make disciples, and that's why you went back to fishing."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7770.16,"end":7804.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. Another major appearance is to the saint who's called the brother of the Lord, and that's James. Saint James who's the first bishop of Jerusalem. Why do we know that it appears to St. James? One mention of it, 1st Corinthians 15:7. St. Paul says that he appeared to James. Doesn't say what that's about, but there actually is context from the ancient church which does say what it's about. So what is going on there, Father?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7806.05,"end":7842.15,"speaker":"Fr Stephen De Young","text":"Well, so we have these Data points about St. James and Scripture, right? We have one data point which is in the Gospels that says that he and the other brothers of the Lord did not believe that Jesus was the Christ during his earthly ministry before his crucifixion. We then have this data point from St. Paul in First Corinthians that Christ appeared to him after the resurrection. Right. There's a resurrection appearance to St. James. And then we have in the Book of Acts, he's just in charge of the church in Jerusalem."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7842.55,"end":7842.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7844.07,"end":7865.47,"speaker":"Fr Stephen De Young","text":"So even if we had no historical record about what happened from our forefathers in the Christian faith, it seems like a pretty good, just Occam's razor way of working out what happened is that in that appearance after the resurrection, Christ put St. James in charge of the church in Jerusalem."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7866.03,"end":7866.59,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7867.23,"end":7901.92,"speaker":"Fr Stephen De Young","text":"Right. I mean, that would seem to be a basic. But the fact is we have all kinds of historical records, both in sort of pseudepigrapha in, like Eusebius and his church histories and other church histories that say precisely that, that when, when Christ appeared to St. James, he put him in charge. He made him the overseer, the episcopos, the bishop of the church in Jerusalem. And then we see that he's in charge of the church of Jerusalem, unquestioned by anybody in the book of Acts, that he's the one in charge."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7902.4,"end":7938.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think that last point you made is a good one. Like, for instance, when the apostolic council comes up and he's the one who kind of gives the sentence at the end. If he had just been sort of appointed there by the apostles, like if he was a successor to the apostles, you couldn't. He wouldn't be presiding over them. You know, they would have said, well, that's, that's nice, St. James, but sit down. You know, the older brothers are talking here, whatever. But no, he's clearly the local, you know, to use the. The common English term, he's the local ordinary. Right. He's the bishop of that place. So he's the one who's going to give the sentence. So."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7938.99,"end":7966.01,"speaker":"Fr Stephen De Young","text":"Yeah, right. And. So, yeah. And so there's. There's a basic problem that we alluded to in answering Pedro's question where for some reason. Well, I know why there's a historical reason, but we're at a state now where a lot of our Christian friends will believe everything pagans write about ancient history, but nothing that Christians write about ancient history outside of the Bible."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7967.21,"end":7967.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7968.01,"end":7999.52,"speaker":"Fr Stephen De Young","text":"Right. So if anything about the apostles, anything about the Theotokos, anything about any biblical figure or the early church that's written outside, well, that's not the Bible. So I, you know, I don't, I don't believe any of it. But, you know, Plutarch's lives. Oh, yeah, that. Yes. Julius Caesar stabbed 23 times, floor of the Senate. Oh, yeah, yeah. All that happened. Right. So the pagans are all telling the truth, that the Christians are all liars. Does it make a lot of sense as a Christian perspective on historical trustworthiness?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":7999.76,"end":8023.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. So a couple more appearances that we wanted to go over. And so here's the one that's numerically the biggest, where Jesus appears to 500 people at a time. What's that all about? Maybe this seems like the best candidate for being, quote, unquote, evidence. The resurrection. Look at all those people he appeared to, you know?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8023.44,"end":8023.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8024.08,"end":8034.32,"speaker":"Fr Andrew Stephen Damick","text":"But that's not what's going on there because again, it's just, it's not attested in a way that would sort of hold up in court again. Right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8035.36,"end":8040.64,"speaker":"Fr Stephen De Young","text":"He would have had to name three. Right. People."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8041.12,"end":8047.8,"speaker":"Fr Andrew Stephen Damick","text":"500 people, and here are their names, you know. Right. It's again, it's bad. It's bad evidence. It's not. It's not evidence. That's not what the purpose of it."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8048.12,"end":8049.04,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8049.04,"end":8073.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, It's Okay. So it's this vision of Christ being given to all of these people at the same time. This goes back to some of the stuff that we've talked about before about prophets and also about the people of God, like gathering, for instance, on a mountain to worship him. So, yeah, unpack this for us a bit."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8073.95,"end":8081.23,"speaker":"Fr Stephen De Young","text":"Right. Well, this. We went through a short list of people who saw God in the Old Testament. Yeah, right. And it was a short list."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8081.87,"end":8082.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8082.35,"end":8139.41,"speaker":"Fr Stephen De Young","text":"It's these few prophets. Right. And a similar list, not to tease too much our Pentecost episode, but in four weeks. But that list is roughly the same as the list of people in the Old Testament who were told had the Holy Spirit dwelling within them. Right. Prophets, the king, maybe the high priest, but not all of the high priests. Some of them. Right. It's this few, these select few. Right. Whereas what we see here in St. Paul is emphasizing is now it's, hey, 500 at a time. Right. So there is this new accessibility, the vision of God. And we'll be talking about this more, much more in the Pentecost episode with the coming of the Holy Spirit, this is something that's now available. And this commissioning to be sent out is something that's now available to everyone in Christ, not just to this select few."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8141.01,"end":8209.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. There's been this big change that has occurred that everyone can now receive the Holy Spirit. Everyone is sent out as the emissaries of God. God to retake the world on his behalf. Yeah, it's pretty cool stuff. Okay. Last, but almost certainly, certainly not least, the chosen vessel himself, St. Paul the Apostle, the patron of our church, right here in Emmaus. He describes himself, what you get in English Bibles, he says, and to me, last of all, as one born out of time or one out of time, which is frankly a really sort of euphemistic way of saying an abortion. He describes himself as being like an abortion, like, you know, a child that is miscarried. Right. That's. That's how he describes himself in comparison to everybody else. He doesn't just mean, oh, yeah, I was one of the last ones. That's not what he's saying. It's actually this very negative and kind of visceral image. Why would he use that word?"}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8210.58,"end":8218.46,"speaker":"Fr Stephen De Young","text":"Right. Well, this is St. Paul taking something that was used against him by his opponents and owning it. Yeah."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8218.46,"end":8225.62,"speaker":"Fr Andrew Stephen Damick","text":"Much like the word Christian. Right. Which was like those little Christs, you know, they're like, oh, yeah, we'll take that. We'll be called Christians."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8226.42,"end":8327.92,"speaker":"Fr Stephen De Young","text":"And so, so he takes. This was both a way of mocking his physical appearance. We have a couple places extra canonical, of course, that kind of describe St. Paul's personal appearance. And it's not pretty. And so it's partly that, but also this was a contrast between this familial language is what's being used in the early church. Right. We see this in the Book of Acts, the brethren, the way of saying the Christians in a place, place is the brethren of that place. Right, Brothers and sisters, because of the importance of the sons of God. Right. As what salvation is about. Right. So if the other apostles are sons, right. St. Paul is this abortion, this rejected child, right. This, you know, lesser sort of. And so St. Paul, rather than being angry and oh, man, I'm going to take him down. I'm going to write this opponent just takes it and owns it in his humility and says, yeah, you know, it was me last of all. Yeah, I am compared to them. You know, I'll use. I'll use the word abortion about myself. But the next verse that we didn't read earlier, he Says because. Right. The reason he accepts it is because he was out there killing the brethren. He was out there persecuting the church. He was a murderer. He's like, yeah, you know what? I wasn't worthy of it. I'm least of all worthy of it. So, yeah, I'll take that. I'll take that. I'm still a child, but I'll take the unwanted."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8328.16,"end":8404.15,"speaker":"Fr Andrew Stephen Damick","text":"It's extreme humility. Yeah. Which is interesting how it's coupled with his great boldness at the same time, you know? Yeah. So. All right, well, those are the. We could say post resurrection, but that's not really the right phrase. These are the resurrection, the appearances of the resurrected Christ in glory to various people. And again, you know, if your one takeaway is, wow, I really need to go to Sunday matins, then we have succeeded. Right. But we just want to offer some. Some final thoughts about this. Yeah. For me, I mean, as I said, one takeaway is, you know, go to matins. Okay. On Sunday. It's such an amazing service for lots of reasons, but the gospel readings are particularly powerful. And to keep having them given over and over again is really an amazing experience. And it's. And it's. It's a ritual participation in those events that we are there with them. Right. You know, and. And so what is that experience then? Well, as we said, this is not just a sort of epilogue to, like, oh, the big action already happened. You know, he suffered, he died, he rose from the dead."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8404.15,"end":8404.63,"speaker":"Fr Stephen De Young","text":"Yay."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8405.03,"end":8616.53,"speaker":"Fr Andrew Stephen Damick","text":"You know, that's not what's going on. It's. It's not just a denouement. It's not just evidence. Like, oh, yes, Jesus really did rise from the dead. And here's the proof. Because as we showed, it's not very good proof. It's not very good evidence. So what actually is going on? So one of the central claims of the gospel is this question of who is Jesus Christ? Who is he? And these resurrectional appearances of Christ answer that question. Now, they don't give all that you could say about it, but they answer that question. He is the Lord of glory. Right. He is one with his Father. He is the one who sends his apostles out into the world to baptize, to teach, to exorcise, to make disciples, all of these things. That's who he is. And so we should really regard these gospel passages as very precious to us because they reveal to us the risen Jesus Christ, not just reveal to us that he is risen, but who he is, that he is God, that he is truly the Firstborn from among the dead. Right. That is the one that they reveal to us. And the whole point of doing this thing we called Christianity is to know Jesus Christ, to know him who's sent by the Father and that Father who sent him. Right. That's what Jesus Christ himself says. This is eternal life, that they may know the only true God and Jesus Christ whom thou hast sent. He said that we don't learn who Jesus Christ is as a kind of set of data. Like, okay, I've got this Jesus stuff down now, and now I'm going to move on to other things about Christianity. This is Christianity to know him, to see him, to have this vision of him. Now, it may be the case that you're not having miraculous visions of him the way that these people did, but there are certainly people throughout the history of the church who have, and we trust their testimony because it's consistent with the stuff that came before and because we see the fruit that happens in their lives as a result of those visions. Right. It may not satisfy those who are using the historical critical method, but let's face it, that method, while useful for certain things, is not useful for everything. And it's certainly not useful for determining is this person truly the Son of God. It can't cover that. It's just not a good tool for that. It's a good tool for other stuff, but not for that. Right. So what I would encourage you to do is not just to read these Gospels, although, yes, to read these Gospels, but as you read the Scriptures, and particularly as you look at those particular four books, Matthew, Mark, Luke and John, that you look there to meet Christ, to know Christ. That is the point of what we're doing. Again, it's not, you know, it's not just Christianity 101. Okay, I've got that down now. Now let's do something else. That's not it at all. This is the whole of what it means to be Christian is to seek for the face of Christ, to know him, to see him as he is. So those are my final thoughts. Father Stephen So."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8618.48,"end":8884.75,"speaker":"Fr Stephen De Young","text":"We see this dynamic play out in, in vespers and matins that we've kind of been talking about the matins part of it, especially tonight. And, you know, vespers is the service where at least some of the time we have Old Testament readings, right? And then we come into matins, we come to that procumenon before the Gospel, and we're calling out to God to arise and judge the earth. We're calling for the day of the Lord to come, for Christ to come. And then we read in the Gospel about it coming, about Christ coming and visiting his people, about the anastasis, right? And about how the anastasis, how the day of the Lord entered into the lives of these people who. Who had these experiences after Christ rose from the dead. But all of that is preparing us for what's about to happen in liturgy, for us to have that same experience in liturgy. Just like on the road to Emmaus, we read and have explained to us the Scriptures and Christ in them. We have the breaking of the bread in the Eucharist, and then after the Eucharist, we sing. We have seen the true light. We have received the heavenly Spirit. We have the opportunity to have that same experience. But the experience isn't an end in itself. We don't pursue this vision of Christ as an end in itself. We don't pursue coming to experience, experience Christ, the resurrection, as an end in itself, because it wasn't for the apostles. It's what made them apostles. It's what started something new. This is why we start reading the Acts of the Apostles at Pascha. This is the sending out. And so every one of us at the end of the liturgy is sent out into the world. The reason we read the Eothenon Gospels, these Resurrection Gospels to the north, is not just to tell the demons that they've lost. It's because the apostles are proclaiming a warning that Christ is risen. He's warning the demons and the spiritual powers of evil that you're coming, that you and I are now going out into the world and they'd better look out. And so this is what the Resurrection Gospels call us to call us to. When we've had that experience of seeing the true light, when we've received Christ, when we've come to see him and know him and know who he is, to then go out into the world and change it and execute judgment and start to restore and transfigure it, to change it. And how do we do that? Well, we go out. When we find that there's strife, we act as peacemakers. Where there's despair, we come with love and with hope. Where there's loneliness, we come with companionship and compassion. Where there's joy at God's blessings, we rejoice with them. When people are mourning, we provide comfort. When we actually go out and do that, we can literally change the world the same way the apostles did after they saw Christ and went out into the world in the Acts of the apostles. But most of the time we, myself included, don't do that. We go to liturgy, we celebrate the services, we have this beautiful experience and then we go home and watch some TV and, you know, maybe drive past a few homeless people on the way home and ignore them. We don't then follow through. And the place where we experience salvation is not in the beautiful experience. It's not in the fulfilling spiritual experience. It's in faithfully answering the call that comes with that experience. So those are my final thoughts for Danette."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8885.39,"end":8889.23,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Father. And thank you, voice of Steve."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8892.35,"end":8895.79,"speaker":"Steve","text":"I've been listening here and this has been amazing. I'm just in awe."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8896.51,"end":8900.27,"speaker":"Fr Andrew Stephen Damick","text":"Just again, Steve was not a guest, he was a caller."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8900.83,"end":8904.53,"speaker":"Steve","text":"No, I may hang her on just sort of offer offers good feedback."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8904.53,"end":8926.29,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Exactly. All right. Well, that is our show for tonight. Thank you everyone for listening. If you did not get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We read everything, but can't respond to everything. But we do save what you send."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8926.29,"end":8935.54,"speaker":"Fr Stephen De Young","text":"For possible use in future episodes and join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8936.18,"end":8950.1,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook and Father Stephen is weirdly back on Facebook, but it's just to flog his book, you can like our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8950.42,"end":8962.31,"speaker":"Fr Stephen De Young","text":"Yes, and on Facebook they say I'm the greatest, but it's because I'm not that good. And they're being sarcastic. Finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8962.63,"end":8967.03,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. And Christ is risen. He truly is risen."}
{"episode_id":"LOS - #020 - 2021-05-28 - We Have Seen the Lord","start":8975.51,"end":9012.78,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the lamb that was slain to receive power and riches and wisdom and strength, strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
