{"episode_id":"LOS - #078 - 2023-10-26 - The FOMO Episode","start":0.24,"end":64.82,"speaker":"Unknown","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First, Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #078 - 2023-10-26 - The FOMO Episode","start":67.78,"end":76.82,"speaker":"Fr Stephen De Young","text":"All right, welcome to the FOMO episode of Lord of Spirits. I don't know what intro may or may not have been inserted before I."}
{"episode_id":"LOS - #078 - 2023-10-26 - The FOMO Episode","start":76.82,"end":77.22,"speaker":"Unknown","text":"Began."}
{"episode_id":"LOS - #078 - 2023-10-26 - The FOMO Episode","start":79.38,"end":629.24,"speaker":"Fr Stephen De Young","text":"But welcome nonetheless. So this is a very special episode which is being recorded for all those folks who aren't going to be at the Lord of Spirits conference this week at which we're recording this week's actual episode, but which you won't get to hear live because the Internet at the Antiochian village is lame, so you'll have to hear it recorded after the fact. But those of you who are not in attendance will get to hear this first. So this is sort of the consolation prize, the Turtle Wax, as it were, of Lord of Spirits episodes. And so since unfortunately, those of you who are listening to this when it first airs on Thursday evening are going to be missing out on whatever sort of party is happening at the village. I thought I would talk a little bit about ways in which one might miss out on a party in the second millennium BC in Mesopotamia. There are several ways you could do this, right? So one way is you could not have proper clothing for the party, or just your clothing isn't clean. And this could especially happen to you if you're kind of a Karen. And so when you take your clothing to the cleaners, you do something like is recorded on this ancient Akkadian tablet. Come now, cleaner, let me give you a commission. Clean my clothes. Don't neglect the commission I am giving you. Don't do what you usually would. You should lay flat the fringe and the border. You should stitch the front to the inside. You should pick out the thread of the border. You should soak the thin part in a stew. You should strain that with a strainer. You should open out the fringes. You should wash it with clean water. You should treat it as if it were imported cloth. Will this be ready overnight? Will this be in a closed container? You should use soap and mix in gypsum. You should beat it on a stone. You should stir it in a crock and rinse it. You may want to stretch it out and comb it. You should tap it with a Cornell tree branch. You should fluff out the flattened nap. You should work the woven work with a pin. You should split the seam and cool it. You should dry it in the cool of the evening. If the south wind has not dried it, you should put it on a rack in the east wind. Make sure it's cool. Carry this out. I'll make you very happy. Fast. You should deliver it to my home. A measure of barley will be poured into your lap. The cleaner answers him. By Ea, Lord of the washtub, who keeps me alive. Lay off. Nobody but a creditor or a tax collector would have the gall to talk the way you do. Nor could anyone's hands do the job. What you ordered me. I could not narrate, declaim, speak or repeat. Come now. Upstream of town, at the city's edge. Let. Let me show you a place to launderthis big job you have on your hands. You can set to yourself. Don't miss your chance. Seize the day. Do ease if you please, the countless tangles of a cleaner. If you can't give yourself more breathing room. The cleaner is not yet born who will pay you any mind. They'll think you a ninny. So, as they say, you'll get all heated up and then you'll have a stroke. So say, you're liable to get told off. Made to do your own laundry. Miss the party. Another thing that could happen could leave you left out of the party in the second millennium B.C. has to do with having a kid. Everybody loves their kids. People who adopt love their adopted kids as much as a biological kid. Even if that kid's a little weird, right? You love that kid. You want to protect that kid. There's just such a story written in cuneiform on the bottom of a monkey's foot found in Mesopotamia. Ms. Enhuti Ramini, slave woman of Ms. Karibru, the palace woman of Aser Eden, who lifted Neru Ereba, the monkey man out of the river, has raised him. He is her son. Whoever shall bring a lawsuit or complaint concerning him. He shall give up six sons and let him go free in accordance with the command of the gods. They must not monkey with this monkey. So see, if you have a monkey child who you've adopted and raised as your own, gotta be careful about bringing him to parties. You might get thrown out. Even in a party where kids are allowed, bringing your adopted monkey child might be a problem. Finally, everybody wants to be the life of the party. Everybody wants to have that little crowd gather around them and be waiting on their every word. One way to do that is to be funny, to be humorous at a party. But telling jokes can go wrong, right? Very easy to cross lines and offend. And let me suggest we have. This is actually from the early first millennium BC in Mesopotamia. We have a very early stand up set from a professional jester and I don't know how these jokes would go over. The lion can terrify, I can let out air too the lion can swish his tail I can wag my tail too I'm as trustworthy as a sieve I hold onto my followers like a net I sing like a she assumes theft is abhorrent to me Whatever I see doesn't stay where it was. I've gotten large from starvation, enormous from eating I make myself throw up 10 quarts I feast on 30 more I don't leave off till I've filled the bushel to the brim among the shortest of them, the tallest of them there's none like me among women My limbs are elephantine, My face a hyena's I tower like a tortoise I cannot be equaled Even if I weren't alive how much would my lover be loving me? He would keep turning around forward and backward Like a trained crab he can't hurt a ewe in the 20 acre field by the city gate on account of me and my rats I used up all my plans. Jester, what can you do? Rope weaving and singing laments Squeezing out fruit juice and brewing beer Jester, what can you do? Snatching on the run pod weeds and turnips Groats and stinkwort or anything else Jester, what can you do of the whole Exorcist's craft? Nothing's beyond me Jester, how do you exorcise? Here's how I take over the haunted house. I set up the holy water I tie up the goat I skin a donkey and stuff it with straw I tie a bundle of reeds, Set it on fire and toss it inside I spared the boundaries of the house and its surroundings. But the haunt of the house, the serpent, the scorpion are not spared In October what is your diet? Thou shalt dine on spoiled oil and onions and goose pluckings and porridge in November what is your diet? Thou shalt dine on pod weed in turnips and cleanser plant in Crowfoot in December what is your diet? Thou shalt dine on wild donkey dung in bitter garlic and enmerchaff in sour milk in January what is your diet? Thou shalt dine on goose eggs and dung embedded in sand and cumin infused with Euphrates water in ghee in February what is your diet? Thou shalt dine on hot bread and donkeys rear end stuffed with dog turds and fly dirt So I don't know if any of those classic bits from 3,000 years ago had you rolling in the aisles or if any of those comedy St of the ancient near east made up for not being able to go to the Lord of Spirits conference, but hey, it's better than nothing."}
