{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":0.56,"end":65.17,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":67.57,"end":188.34,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the Lord of Spirits podcast. Thank you. Voice of Steve. I feel funny saying that because I literally just had dinner with the Voice of Steve and he's headed back to New York now. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. If you're listening to us live, you can call in at 855- AF-RADIO. That's 855-237-2346 and Matushka Trudy will be taking your calls tonight. Please be nice to her. We'll get to your calls in the second part of today's show. So Lord of Spirits is brought to you by our listeners with help from St. Athanasius Academy of Orthodox Theology. St. Athanasius is an online academy for kindergarten through 12th grade, offering live classrooms in core subjects, foreign languages, various electives, and Orthodox studies. To learn more about St. Athanasius Academy, please visit www.saaot.edu. so thanks everybody at St. Athanasius for your help. So how do we know what we know? What in us is doing the knowing? Is it the mind who is doing the knowing? Do we actually know what we think we know? And do we know it in the way that we think we know it? The modern world tends to collapse all of these questions into a few basic answers. We know with our minds. Our minds think thoughts and we know things because they can be proven. But the ancient world in which the Scriptures were written, in that world, what it means to know and how things are known and even what thoughts are form a much more complex picture that applies to human experience. In a richer and more vibrant manner. So tonight we mean to sort through these questions, especially focusing on what the scriptures say about them. But first, let's start with this modern concept. So, Fr. Stephen, I want to start by asking, can we even know what we're knowing without ever knowing the way?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":189.86,"end":197.58,"speaker":"Fr Stephen De Young","text":"Well, anyone can see that the roads that they walk on are paved in gold and it's always summer and they'll never grow cold. Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":197.74,"end":205.1,"speaker":"Fr Andrew Stephen Damick","text":"That's one of my favorite sort of, sort of semi personal apocalyptic songs. You know, people just walk off into, you know, just leave it all behind."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":205.98,"end":213.66,"speaker":"Fr Stephen De Young","text":"Yeah. When you walk off into the sunset, though, eventually, like you're just standing somewhere in the dark."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":214.14,"end":214.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":214.58,"end":237.08,"speaker":"Fr Stephen De Young","text":"And that awkward moment of you've made your dramatic exit. Now what. So, yeah, we're gonna talking about what it means to know things, which people probably think they know what it means to know things, but maybe you don't know, you know, what it means to know things."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":237.56,"end":237.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":239.72,"end":249.97,"speaker":"Fr Stephen De Young","text":"And mainly part, a big part of what we're gonna be getting at tonight is that it means different things to know different things."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":250.93,"end":251.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":252.21,"end":287.48,"speaker":"Fr Stephen De Young","text":"And if we kind of boil that all down to one idea, which of course is what the modern world has done for us, boiling all that down to one idea, you're not going to have a good time because they're going to be things that you try to know in a certain way that you can't know that way and just can't get at it. Yeah. And things that then become completely closed and unknowable to you."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":287.96,"end":288.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":288.52,"end":292.12,"speaker":"Fr Stephen De Young","text":"And that will make sense as we go on. That's not just us playing with the word. No."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":292.44,"end":320.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is not just a bunch of, you know, punny double talk or whatever. Yeah. So the place we're going to start with is the modern concept of knowing. Right. To me, the. Yeah, exactly, exactly. The ancient parallel. Yeah. To me, the characteristic phrase of the modern notion of knowing is studies have shown, you know, whenever you hear that, that's like, oh, now we know that we know something because studies have shown whatever it might be."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":321.55,"end":321.87,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":321.87,"end":326.67,"speaker":"Fr Andrew Stephen Damick","text":"So. So, right. We tend to think of science, Science is the way to know things in the modern world."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":327.51,"end":341.51,"speaker":"Fr Stephen De Young","text":"Right. Yeah. And studies especially, as we're going to see, are sort of a democratization of knowledge. Right. So we sort of get to all vote. We did this study, X percent said this, therefore Y. But we'll get there."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":342.47,"end":343.35,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":343.59,"end":409.68,"speaker":"Fr Stephen De Young","text":"So, yeah, the, the word that's used for this kind of knowledge and that gets transliterated into English and Greek is epistemi, where we get epistemology, epistemic and all those related words. And episteme is sometimes even translated science, depending on what you're reading, translated from Greek. And this is the kind of knowledge we major in. But in the ancient world, it was distinguished. Right. Epistemic knowledge was knowledge a very particular thing. Specifically, it was things that could be demonstrated. And demonstrated had a particular meaning too. It meant I could show it to you, I could prove it to you. Right. So if I come to you and say two plus two equals four, and you say, nah, man, I don't buy it. Right. What's all this about? I can take two apples and put them on the table, and then take two more apples and put them on the table and I could show it to you, I could prove it to you."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":409.84,"end":410.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":410.72,"end":425.36,"speaker":"Fr Stephen De Young","text":"And so these are things that you can have a certain. I was about to do a word play on the word certain. But you have a certain type of knowledge, and that type of knowledge is certain. You could be sure."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":425.52,"end":426.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":426.8,"end":430.56,"speaker":"Fr Stephen De Young","text":"Because if you ever have any doubt, it could just be demonstrated to you again. Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":430.56,"end":480.99,"speaker":"Fr Andrew Stephen Damick","text":"Again, the proof again. Yeah. And this is the basis for the scientific method. And it's why, for instance, there's, you know, if you ever read stuff that's about the way that science actually gets practiced, there's a number of interesting articles floating around out there about what's called the replication crisis in the sciences, where a lot of studies that are done that no one can, can replicate them to get the same results as the original study that was done that supposedly everything, know, some big policy decision was based on or whatever. Because scientific method requires the ability to replicate that demonstration. And if you can't get the same results over and over again by doing exactly the same things, then, then it's not really science, you know, so it's not demonstrable, it's not epistemy."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":481.71,"end":507.99,"speaker":"Fr Stephen De Young","text":"Right. And so this is a very narrow type of knowledge in the ancient world. Right. Most of what we would say we know does not fall into that category. So in the ancient world, like, history is not in that category. Right, right. Because you can't. I can't like, recreate and prove to you the date Napoleon was born."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":508.63,"end":519.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Or, you know, the political crisis of the 18th century in France. Like, you can't run an experiment, you know, where you recreate the French Revolution."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":519.33,"end":559.53,"speaker":"Fr Stephen De Young","text":"Or do a mathematical proof or. Right, so. So all of that was outside of. Of that. And so every other type of knowledge that you couldn't demonstrate in, in that way was Some form of doxa. And doxa is a noun that comes from the verb doke. Oh. Which means to seem or to appear. And there was an ancient heresy called docetism, which. It was called docetism because it was the idea that Christ only seemed to be human."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":559.93,"end":565.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. These were some of the enemies of our old pal, Saint Ignatius of Antioch."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":565.53,"end":568.89,"speaker":"Fr Stephen De Young","text":"Right. He looked like a man, but he was not actually a man."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":569.21,"end":570.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that was their claim."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":570.65,"end":617.76,"speaker":"Fr Stephen De Young","text":"So that was. That's this idea of seeming. And. And so doxa really conveyed that there was. It was an appearance, it was a viewpoint. Right, right. It was a perspective. And so based on that, anything within that realm was going to be something that. That you established, sort of based on testimony. You would collect the testimony of people with various viewpoints on an event happening, an idea. Right. And then you would sort of compile those. Right. To get a sense of it. But you could never demonstrate it. You could never prove it."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":618.16,"end":618.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":618.8,"end":638.49,"speaker":"Fr Stephen De Young","text":"And this, by the way, to annoy a bunch of people. This is gonna be one of those things that. See, I'm not on Facebook anymore, so I won't have to read all the people trying to challenge this when they get upset. Father Andrew will. It's true. The. The doxa in Orthodoxy is this doxa."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":638.81,"end":644.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It's the doxa of opinion or of seeming or viewpoint or perspective."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":644.89,"end":664.25,"speaker":"Fr Stephen De Young","text":"The right viewpoint. The right perspective. The right. You know, that. That the right opinion. That's what orthodoxy means. The word for glory is related to this, actually, because glory, you can see how the idea of glory is related to the idea of appearance. Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":664.25,"end":665.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or of reputation."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":666.53,"end":677.82,"speaker":"Fr Stephen De Young","text":"Right. And so you could. You could see how those are connected. But even that kind of glory isn't connected to worship. So, folks, stop saying that orthodoxy means."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":677.82,"end":685.9,"speaker":"Fr Andrew Stephen Damick","text":"Right worship right now. We're not saying that Orthodoxy, orthodox Christianity isn't right worship, but it's just not what the word means."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":685.9,"end":695.5,"speaker":"Fr Stephen De Young","text":"It's not what the word means. Yeah. Etymologically, Right. Yeah. So send your angry cards and letters to Father Andrew Damick."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":695.82,"end":762.09,"speaker":"Fr Andrew Stephen Damick","text":"I'll take them. I'll take all of them. Yeah, yeah. Right. But, yeah, books. This. This idea of a kind of knowledge that's about testimony and about perspective. And, you know, we'll. We'll talk. We'll talk about why that's sort of a problem in the modern world and yet inescapable. Right. So, for instance, you know, like at a court case, there's all kinds of things on which the basis of judgments are made and verdicts handed down that are simply based on someone's perspective. Now, they usually try to get multiple witnesses to say, you know, to say essentially the same thing, but it can't be demonstrated. You know, you can't, you can't do a scientific experiment to, to show someone killing someone else or something like that. Now, you might have evidence for it, but that's not the same thing. Right. You know, it can't be replicated. You know, all you have is these things that indicate that it did happen, but it's still not a demonstration in the same way."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":762.57,"end":807.78,"speaker":"Fr Stephen De Young","text":"Yeah. And this, if you've ever watched a court show, just about any court show, you've seen this dynamic play out because they'll call some expert witness, right, who will give the scientific testimony about the car accident. Like, we can tell from the skid marks that the car was going this fast, right, and in this direction. And here's how all the physics works, here's how all this stuff. And the defense attorney will get up and say, well, is it also possible that this other thing happened? Right. Is it possible that it actually went this other way? Or are you saying that it's just completely mathematically demonstrable that it happened this one way? And the witness will admit, well, okay, no, it could have happened this other way. And then, oh, there goes the whole case. Roll credits on the show. Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":808.26,"end":820.74,"speaker":"Fr Andrew Stephen Damick","text":"Because even if you're bringing scientific evidence into something, it still has to be curated by people who then deliver a doxa about what it is that they saw."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":821.14,"end":822.98,"speaker":"Fr Stephen De Young","text":"Right. Here's how the data seems to me."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":823.3,"end":823.9,"speaker":"Fr Andrew Stephen Damick","text":"It seems."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":823.9,"end":847.72,"speaker":"Fr Stephen De Young","text":"Yeah, that I'm looking over. Right. Here's how I interpret the data. And we have a clue. Clear idea of this. Right. Like, I don't think anything we just said about data having to be interpreted would be controversial, but some of our friends 150 years ago approach things a little differently, especially in Germany."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":847.72,"end":850.04,"speaker":"Fr Andrew Stephen Damick","text":"Is this 19th century German scholars again?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":850.28,"end":860.09,"speaker":"Fr Stephen De Young","text":"Yes, this is 19th century Germany. And it bled out all over everywhere. But so there's a bit, there's a."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":860.09,"end":863.17,"speaker":"Fr Andrew Stephen Damick","text":"Bingo sheet somewhere that just got. Got crossed. Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":863.17,"end":939.54,"speaker":"Fr Stephen De Young","text":"It's all about the Wissenschaft. So, right. They, they wanted. Right. They were very keen on, you know, they still had that head rush from the Enlightenment going. And, and they were very keen that all of human knowledge could come to be sort of scientifically established. Established. And so that means we can make everything a science. Right. So you get the idea of political science, right. Not politics the way Aristotle did it. Right. When, when Aristotle wrote his politics, he went and got the Constitutions of Athens and a whole bunch of other cities and compared them. Right. Evaluated them and interpreted that data. He was not claiming to have some kind of mathematical science, but no, we're going to do political science now. And history, as we've talked about before, was seen in this positivist sense, you know, as a science. And just to take another shot at Hodge at old Princeton, right. You read the preface to his Systematic Theology, and he directly says, you know, you go to the Bible and you get the data, you get these logical propositions."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":939.94,"end":940.06,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":940.06,"end":962.1,"speaker":"Fr Stephen De Young","text":"You get proposition A, proposition B. You use your logic, right? A, B, therefore C, you know, C, D, therefore E. You construct these logical chains. And so for Hodge, his 19th century Presbyterian American Calvinism was as firmly established as the laws of physics and just as demonstrable."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":962.34,"end":963.14,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":963.3,"end":994.18,"speaker":"Fr Stephen De Young","text":"And now we look at that and kind of laugh. At least I do, but. Right. But that was the idea. That was the idea. And those ideas still bleed through a lot. There, There are still a lot of people among us with that enlightenment head rush still going on. Right. You get, get these, you know, I'm, I'm a, I'm an atheist. I only believe in science folks who want to come and tell you that Jesus never existed because there's no evidence, because they're trying to do history by way of science."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":994.9,"end":1159,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the problem, of course, is that it's a reduction in terms of what human knowledge can be. You know, if you say that something is an opinion or it seems to me, right, in our modern parlance, that's immediately suspect. Oh, well, that's just your opinion. Right. But the problem is, is that we, we have ruled out that as being a valid way of knowing things without actually, you know, ironically, without actually demonstrating that it's always wrong. And, and, you know, there's some kinds of things that you can't know through demonstrable, repeatable mathematical means. You know, and history is the classic example. There's, you know, if we were going to try to use positivistic methods on history, we basically have to chuck out pretty much all history that's ever been written. Because all history that's ever been written requires interpretation. It requires relying on testimonies, all these things that can't be shown in those ways. So if we're going to be truly consistent and say we only believe in things that are truly demonstrable in this kind of mathematical, scientific method kind of way, then we have to, we have to throw out a whole lot of human knowledge, culture, all kinds of things, and the Problem, of course, is that it's not actually congruent with human experience. Human experience knows that there's ways of knowing that are not about these sort of scientific processes. We're not putting down science by any means. It is a valid way of knowing the things that you can know by it, but it doesn't give you knowledge of everything. It can't. So, you know, the shift that occurred is that this idea of the duksa, the things that are based on perspective and testimony in the ancient world were regarded as just as much knowledge. Now you treat them in a different way, you know, than you do demonstrable knowledge, but it is still a kind of knowledge that can only be gotten in certain ways that can't be be gotten through scientific or mathematical kinds of means. So, yeah, that's the problem is that we now have this idea that that's not real knowledge except in certain limited kinds of frames. Like a courtroom is another one, is a great example like we gave before. You can't very well have a trial without testimony if it's about anything really important. So we accept that. And. But in our daily lives, we accept it. Someone says something to you about something else, you know, do you say, well, you have to show that to me. You have to demonstrate it for me. But there's some things that can't be demonstrated. It just can't."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1159.56,"end":1177.91,"speaker":"Fr Stephen De Young","text":"No one lives their life that way. Yeah, there's no way you don't go and master mechanical engineering before you get in your car and start it because you want to make sure it's safe. And you have to have it all laid out to you, like, exactly the safety structures and the tensile strength of the panels in the car or do."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1177.91,"end":1203.1,"speaker":"Fr Andrew Stephen Damick","text":"Stress tests on the road that you're about to drive on every foot of it, you know, like, it just. It becomes. And the problem is that we severely limit our ability to know things because we in certain cases will cut off that kind of knowing because it doesn't adhere to the criteria, the scientific method. That's the problem, you know."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1203.1,"end":1316.92,"speaker":"Fr Stephen De Young","text":"Right, right. So what you had in the ancient world, to borrow a turn of phrase from Plato that he used all the time, is based on testimony, you construct the likely story. Right, right. Based on. This is most likely right in history. This is most likely what happened. Right. Or this is most likely how this works, or. Right. You, you know, have developed a certain amount of faith in your. In your motor vehicle. So, you know, when you go out to start it, you think it is likely that it is going to start, and it is going to successfully get you to where you're going. And so the idea is that rather than having an experiment, right, where you reconstruct, repeat something and demonstrate it again, you talk about explanatory power. Meaning I have this idea, I have this hypothesis, right. I have this theory about life. I have this belief, and I evaluate it based on how well it explains things, how well it explains the details. Right. So I have a belief, right, that my wife loves me, right. If she did certain things, right. Like if she went and cheated on me, I would take that data and say, well, my belief can't accommodate that data. Right. Like that. Or at least it makes it difficult. At least I have to adapt my belief to fit this new data. Right. That's how we actually all operate most of the time in real life, right. That we have a belief and then we adjust it."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1317.56,"end":1523.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because like with the example of, you know, if your wife loves you, the, you know, if you're going to take this sort of purely materialist, scientific method way of asking that question, the only question it could answer is whether or not certain kinds of biochemical processes might be observable under certain circumstances. Does her brain do a certain thing when she thinks about you or sees you in all of your glory when you wake up in the morning? No pun on glory there. Actually, this is going to. I'll accept that pun. But, you know, the. It's a question that can't be answered. And then, then the, the trap is to say, is to go full materialist and say it's not a question that's worth even asking, you know, like, there's no such thing as love or you could never know or you can never know because it's not something that we can observe by demonstrable, repeatable processes, you know? You know, and it creates, I mean, it creates all kinds of problems. You know, like there can be interpersonal issues like, prove it to me, prove it to me, you know, or. Or even on. On a cultural level. Right. It's interesting, for instance, right now, you know, within the past, especially, I would say 20 years at least this is how I remember it. How much kind of personal testimonies have become, like, really important in politics, you know, politician that'll bring up someone with a story and put it in front of everyone. And then that's designed to elicit certain kinds of responses, emotional responses, typically, and then based on that, to make certain kinds of policy decisions and so forth. And what's interesting is to watch the tension over that because on the one hand people will say, yes, this is what's really going on. And so there's a sense of, okay, I accept this idea of testimony. But on the other hand, then you will get people who say, well, that's just one person's story, you know, that one person doesn't establish a trend and in other words, trying to push it back towards that kind of scientific approach. And I would say that the solution to this is not to push hard in one direction or the other, but rather to recover a robust sense of, as you said, the likely story, as Aristotle puts it. So it is true that one person's difficult story is not something on which the basis of, you know, governmental policy should be made, because maybe that person's problem can be solved in some way that doesn't involve passing a law that changes everybody's lives, you know, but, but, you know, seeing what a whole mass of people are doing, for instance, or whatever, you know. Yeah, it's interesting, you know, the kinds of pathologies that this puts into a society, you know, where on the one hand, testimony is the only thing that some people believe and on the other hand, it's never believable because, well, I don't, you know, appeals to emotion or whatever are irrelevant. You know, we shouldn't think about that. And then of course, it's, it's all, it can all be used very, very cynically and in a very manipulative way as well. Right. You know, for any, for any mode of knowing, there are ways to, to turn it dark, for sure, you know."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1524.6,"end":1534.88,"speaker":"Fr Stephen De Young","text":"Right. Well, and, and part of it is that what we call postmodernism, like post structuralism, emerges as the backlash against those 19th century Germans."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1534.88,"end":1536.12,"speaker":"Fr Andrew Stephen Damick","text":"Exactly right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1536.2,"end":1553.21,"speaker":"Fr Stephen De Young","text":"So it's, we, we thought, well, we can know all these things scientifically and lo and behold, duh, you, you can't know all these things scientifically. And so rather than going back to the pre modern position, it's, well, no, you can't know those things at all then."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1553.77,"end":1554.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1554.33,"end":1595.65,"speaker":"Fr Stephen De Young","text":"The only things you can know are this small scientific subset and everything else you can't know at all. Everything else is just opinion. And therefore all opinions are equally valid. Right. Those all perspectives are equally valid. And so the, the opposite extreme. Right. And so to make clear to people, because sometimes I know people worry that this is where we're going, this is not where we're going, the rest of tonight is going to be about the ways that we know and truly know just as much as, you know, those scientific things you could Truly know all those other things. You just know them a different way. Right. Not in the same way way."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1595.81,"end":1643.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so. Yeah, so. So, you know, now nowadays we have this notion of objective knowledge versus subjective knowledge. And objective is this demonstrable stuff and subjective is kind of everything else. And of course. And then that means it can be dismissed. Well, that's just subjective, you know, but, but in, in the ancient concept. And we're going to get to this after a break. We're going to take in a moment here. There's actually, it's. There's actually multiple ways of coming upon objective knowledge, but it's just received in different ways. It's known in different ways. You know, it's just a much more complex and rich picture, which is great. You know, we don't have to live in a world where everything is either fact according to a certain sort of narrow requirements or that's just somebody's opinion."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1643.85,"end":1674.29,"speaker":"Fr Stephen De Young","text":"Right. And, and yeah, to, to go a little deeper into that. Right. The way we use objective and subjective is completely wrong. Right. You have never known anything objectively, right? No. No human has. Right. Because the subject is you and the object is the thing."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1674.85,"end":1675.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1675.65,"end":1701.1,"speaker":"Fr Stephen De Young","text":"And I'm using thing here broadly to mean other person or object or animal or plant or the world or whatever. Or God. Right. For you to know it objectively would have to mean that there was no subject involved. You cease to exist. Right. You, you know, the object as the object knows itself. Right, Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1701.1,"end":1702.66,"speaker":"Fr Andrew Stephen Damick","text":"That's not a thing that."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1702.66,"end":1739.3,"speaker":"Fr Stephen De Young","text":"Yeah. That you know, the essence of the other person or the other thing or of God. Not gonna happen. Right. So there is always a subject, There is always a viewpoint in all knowledge that you will ever have because you are finite. Right. So you are always there as the subject. You are always approaching the knowledge object. Now, there are different types of objects and this is a lot of what we're going to be talking about tonight. So there are different types of objects and objects present themselves and reveal themselves to you in various ways."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1739.62,"end":1740.34,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1740.74,"end":1868.73,"speaker":"Fr Stephen De Young","text":"So the, the things we're talking about here. So it isn't strictly objective versus subjective. It's different types of objects. And the objects we're talking about here in scientific knowledge are a certain type of object that very much reveals itself to you. This is, this is part of what I know. Certain listeners aren't big fans of phenomenology, but sorry, here's some Heidegger. The brute facticity of reality. Right. These are things that impose themselves on you. Like two plus two equals four. You can't deny that that's true. I mean, you could verbally do that, but you can't really make your brain think that two plus two equals five. You can't do it. Right. It impresses itself upon you. Right. And so that those are the types of objects. There are certain objects like that that impress themselves upon you that, that reveal themselves to you almost of their own volition, even though this is a, this is an ancient use of volition, but not one we're used to anymore because we think of that as making choices. But they impress themselves upon you in that way and reveal themselves in that way. And so we know those scientifically. That's why we can so easily demonstrate them is because they sort of impose themselves upon us. Other things we come to know differently because they're different objects and they do not reveal themselves to us in the same way. My wife. Right. To use her again, which I'm sure will make her overjoyed when she hears this eventually as another human. Right. Does not reveal herself to be in this scientific way. When I encounter her and interact with her, I am not receiving a bunch of data about her exact height and dimensions and. Right. The details of these various scientific. That's not how mathematically. That's not how she presents herself to me. That's not how I interact with her as an object in the world. That is how I interact with numbers."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1869.61,"end":1870.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1870.49,"end":1873.37,"speaker":"Fr Stephen De Young","text":"And shapes, that kind of thing."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1874.81,"end":1887.35,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that said, we're going to come right back in a few minutes and we're going to talk about the various ways and kinds of things that can be known and we'll start to take your calls. So we're going to to go ahead and go to break and be right back in a second."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1887.91,"end":1904.15,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1909.43,"end":1970.11,"speaker":"Announcer","text":"No end of books these days offer us techniques for self improvement. But in the newest release from the ancient faith store Gratitude Trenches, Robin Phillips takes a different tack. He shows us that God meets us where we are in the pain and heartache of the present moment. Instead of looking for a way to escape from hardship, we can cultivate an attitude of gratitude, peace and self acceptance that will transform our experience of suffering. Drawing on his own experiences and his work as a consultant in the behavioral health industry, as well as stories of saints and sufferers, teachings of the fathers and recent discoveries in neuroscience, Phillips shows us that the journey to personal well being is one we can all travel regardless of the hardships we may face. To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1970.11,"end":1985.15,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1986.67,"end":1998.83,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Voice of Steve. I feel like I just saw you. Welcome back, everybody. Before we start talking about the various ways of knowing things, we're going to take one of your calls. So I believe we have James on the line. James, are you there?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":1999.66,"end":2001.02,"speaker":"Audience Member","text":"I am. Thank you, Bobby."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2001.26,"end":2018.22,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, James, to the Lord of Spirits. What's on your mind? Are you there, James? Oh, I think we lost him. No. Oh, wow. He was just there. He was just there."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2018.46,"end":2022.14,"speaker":"Fr Stephen De Young","text":"And you had that mind pun I know, lined up there and everything."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2022.38,"end":2043.83,"speaker":"Fr Andrew Stephen Damick","text":"James, are you back? James, are you there now? Okay. Well, he looks like he's on the caller board, but I'm going to try one more time. James, can you hear us? All right. Well, hopefully James can call back and we'll hear from him another time."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2044.39,"end":2049.67,"speaker":"Fr Stephen De Young","text":"This time we'll boomer it up a little less on the technology. Answer your question."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2049.99,"end":2053.75,"speaker":"Fr Andrew Stephen Damick","text":"I know. I thought that what's on your mind joke was a really good one."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2054.48,"end":2054.88,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2055.36,"end":2064.96,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay. I'm just being told to try again. James, are you there yet? Oh, man. All right. That's okay."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2064.96,"end":2067.12,"speaker":"Fr Stephen De Young","text":"Live radio, everybody. Yes, it is."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2068.08,"end":2087.96,"speaker":"Fr Andrew Stephen Damick","text":"All right. So. Okay. Well, there's lots of different ways of knowing. So let's start rolling through, start rolling through our kind of catalog here. The first one that we have is about moral reasoning. I mean, is that really a way of knowing or isn't that just a way of like arranging the facts and figuring out the right thing to do? So what's that all about?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2089.4,"end":2127.98,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, moral reasoning. Or sometimes if you're using old, this is the Greek term here would be phronesis, which is sometimes in your Old English translations, not old English, but older English translations translated as prudence. Prudence, dear Prudence. And this is in the Old Testament in particular. This is the kind of knowledge we're talking about when we talk about, for example, the knowledge of good and evil. Right. Knowing good and evil."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2128.22,"end":2130.3,"speaker":"Fr Andrew Stephen Damick","text":"So like in Genesis, chapter three."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2130.3,"end":2145.33,"speaker":"Fr Stephen De Young","text":"Right, right. And other places, notably a little bit of an expanded version Shows up in Isaiah 7, which is knowing to choose good and shun evil."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2145.89,"end":2153.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And that prophecy about. Isn't that the prophecy about the birth of Christ and other things?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2153.49,"end":2160.93,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yes, yes. We won't go down that particular rabbit hole. We'll save that for a future Christmas episode."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2161.17,"end":2161.73,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2161.73,"end":2162.13,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2164.23,"end":2166.47,"speaker":"Fr Andrew Stephen Damick","text":"And I'll get to say Mahershalal Hashbaz."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2166.87,"end":2227.48,"speaker":"Fr Stephen De Young","text":"Yeah. All right, thank you. So I still prefer Kushan Rishatayam from Mahanaharayam, but that's just me in terms of Old Testament names. But so when you take it in that context of knowing to choose the good and shun the evil, that kind of puts it in perspective because we tend to think of moral reasoning as modern folks. As I'm facing this ethical dilemma, I have these options. Which one is the good option? Can there be more than one good option? Are they all bad options? If they're all bad options, which ones do I choose? Right. And this is not really the perspective of what we're talking about when we're talking about most of the ancient world and in the Old Testament."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2227.8,"end":2350.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, and even, you know, I'm a father of four children, and, you know, part of parenting is a major part of parenting. Most of parenting maybe is teaching children right and wrong. And as you watch, children especially make the wrong choice. But God willing, sometimes the right choice, hopefully more often than not, it's almost never, oh, I have this problem. I need to figure out the right thing and the wrong thing to do. It's instantaneous most of the time. Right. There's just this movement in a particular direction. And, you know, human beings tend to move in the wrong direction over and over again until gradually trained to move in the right direction. And then it becomes like a second nature, right? It becomes. It becomes the thing that you want to do, you know, that you don't have to sit down and, okay, now, is this right thing or that the right thing? You know, is this better than that? You know, a kind of cost benefit analysis? I mean, we do make decisions like that sometimes, but the vast majority of the decisions we make are not made that way. And we don't even have a conscious sense that we're making a decision. Right. It's not like if one of my family members says something and I get angry that I thought to myself, okay, they just said this thing. What shall I do now? I think I'll get angry. That seems like the right thing. Like, that's not the way that it actually works. There's this sort of movement in that direction. Right. So like you said, it's about knowing how to choose the good and to shun evil. But it's almost never actually a deliberative process. It's much more, what are you trained to do? You know, what is it that you have been formed to do? Right. So, yeah, it does have this connection very much to nature, but often it's skewed."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2350.94,"end":2454.4,"speaker":"Fr Stephen De Young","text":"Right. And you're. You're moving towards something and away from something else. Right, right, right. It's that kind of choice. You're moving towards something and away from something else by these. By these choices. And yeah, this is. This is the. The. The number one thing on those rare occasions when I'm asked to talk to teens, which really isn't a good idea because I'm like, hello, fellow kids. But the one piece of hopefully good advice I tried to give them is, right, that there's a. There's a person who God wants them to be and who they want to be when they're 40. Right. And if they look at the decisions and things that they're called to make now in terms of will this help me get there and become that person, or will this make it more difficult for me to get there and become that person? Right. When you think about it in that context, a lot of those choices become clear. Right. That there are some of them that are not going to help you get to that point. And there are other things that are. Right. And so this points out that the kind of reasoning we're talking about here with moral reasoning is not about ends, it's about means. Right. There's an. There's an end we're trying to get to, and we're trying to figure out the means what will get us there. And you see this sort of classically, when the devil, right, the serpent, is talking to Eve and says, you know, no, if. If you eat the fruit, you'll become like God."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2455.11,"end":2455.35,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2455.75,"end":2477.75,"speaker":"Fr Stephen De Young","text":"Right. Knowing good and evil. Right. So Eve wants to become like God. God has a way for her to become like him. It's not eating the tree. Right. So it's. It's her then taking this other means, her seizing this other means to try to. To get to that end."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2477.91,"end":2541.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. I mean, and likewise, to bring it back to the parenting analogy or example, really, I want my children, for instance, to be respectful to their mother. Right. That's the appropriate thing for them to do. They're being disrespectful. I could yell at them to be respectful to her. I could threaten them. Right. Those are means towards that end. Or I could train them by showing them what it's like to be respectful to her by, you know, helping them restrain themselves when they're being disrespectful. You know, and the truth is I want the same thing at the end. But there's one means that actually is going to get me. You know, there might be more than one. There are means that will help me get there, and then there are means that feel right in the moment that are not going to help me get there. You know, what I would be teaching them by threatening them or yelling at them is you should be afraid of your dad. You know, that's, that's the, the end that will come from those means."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2541.75,"end":2554.95,"speaker":"Fr Stephen De Young","text":"Right. And. And your kids do love their mother, right? Like they, they actually do love her and want her to be happy. Right? And want to honor and respect her. They just don't always know how to do that."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2555.19,"end":2556.95,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2557.51,"end":2559.35,"speaker":"Fr Stephen De Young","text":"They just don't always know how to get there."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2561.27,"end":2561.55,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2561.55,"end":2643.83,"speaker":"Fr Stephen De Young","text":"Yeah, so this is, this is then tied directly into, for us, human nature, right? The, the directedness of our being, the purpose for which humans were created, which is to become like God. Right? That's, that's what humanity is created for, what we call theosis, right? And so when, when we sin, pretty much all sin, and this is where the, the orthodox understanding of the sin of sin as the passions comes from. All of these sins are ways that humans try to become like God or just become God. Right. Or set themselves up as gods apart from actually coming to know God. Right. There are these other, other attempts, right? Whether it's pride, just elevating your own ego to that point, whether it's amassing wealth and power, whether it's becoming beloved by other people, whether it's through pleasures of various pleasures of the body of various kinds, whether it's trying to become immortal in some sense to stave off death, but trying to do it under our own means."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2644.54,"end":2867.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's power, you know, it's the exact. We're reaching for the tree of the knowledge of good and evil once again. We're grabbing for the fruit rather than doing what is needed to be ready for the fruit, you know, like, you know, I've been having conversations with friends lately about especially people who are doing ministry in a way that puts them in the, in the public eye, you know, and one of the observations that I think is really, really apt is that if someone's sort of success outpaces their character, then they're probably doomed for some kind of spectacular fall. And, you know, it's exactly. This kind of thing is that if someone's not ready for, for instance, being well known or whatever it might be, then it will destroy them. You know, they're reaching for, as you said, they're reaching towards Godhood, towards being like God, but they're actually reaching in the wrong direction, and so they end up becoming demonic instead. And as you mentioned, this is the basic. For our ascetical theology about redirecting the passions. The desire, for instance, for immortality is a good desire. The desire for love is a good. I mean, these are good desires. But when we try to short circuit the way that God has given us to arrive at those things, then it becomes very dark and can be very harmful to other people and definitely harmful to ourselves. Right? You know, and it's interesting how much literature is based on this idea, right, that the quick path, the easy path, the path to instant power, celebrity, whatever, is the destructive one. Right? But what's funny is that while these are the stories that we're telling each other, the stories that we're selling each other, you know, get rich quick, you know, take this pill, it's going to change everything, you know. You know, solve this problem with one easy. With this one weird trick, you know, that's. It's funny, we do both things at the same time, and we wonder why we're so sort of kind of conflicted and, you know, function in this kind of like a multiple personality disorder sort of way. We're very fragmented, you know, I mean, I think that's why. I think that's why good stories are so important, is because they help to form the taste of the person. To me, one of the most important things I know, I keep coming back to parenting, but I think this is. So when we're talking about moral reasoning, I think it's a great place of application. One of the things that's so important in my family is to give our children really good stories to read so that they have a sense of what it means to choose the good and what it means to shun the evil and what happens when you do those things so that when they then encounter a situation that's analogous in some way, that the narrative that they have in their mind is a good one, and then they. They live into that narrative having already been formed by that, you know, so there's, it's. There's so many ways that this is applicable. And. And I think the beauty of it is that by seeing clearly what it is we're trying to attain to, and knowing that there is a way given to us to attain it, then it becomes. I don't want to say easier, but at least it becomes clearer. Clearer how we should live. Because so many people. I tried this, I tried this, I tried this, but I'm still not happy, I'm still not content, I'm still not at peace or whatever it might be. I'm still not satisfied. Well, of course not, because those things can't do that, you know."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2867.27,"end":2958.13,"speaker":"Fr Stephen De Young","text":"Yeah. They can't actually make you like God. Yeah, yeah. And that, that end, that purpose, that telos is built into us. It's built into every human. You can't get rid of it. Right. We could deliberate over the means, but the end is just there and just built in. It's constitutive to us. Right. And so, yeah, that could go dark places. You could have a guy like Lamech at the end of Keynes genealogy. Right. And you know, what were, what were human beings built for? How do human beings become like God? Well, continuing God's act of creation, of putting the world in order and filling it with life. Right. So what does Lamech do? Well, he puts the world in order, all right, by going out and murdering everybody who opposes him and becoming a tyrant. Right, and dominating everything. And then he, he, you know, he. He's fertile, all right? He's got, you know, multiple wives who he sings a song to about how great he is by means of. Of seducing them further. Right. That, that's how he's presented in the scriptures. Right. So these things can. Can turn bad. And in that boasting, what does he say? He says, well, you know, God said he was going to avenge Cain sevenfold, you know, well, I'm. I avenge myself on my enemies seven times, sevenfold. Right. So again, setting himself up as, you know, I not only like God, but better."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2960.37,"end":2960.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2960.81,"end":2965.89,"speaker":"Fr Stephen De Young","text":"In that, in that sort of, that sort of dark and twisted way."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2966.05,"end":2988.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. Yeah. So, you know, the question with moral reasoning is how do I become like God? There are the ways that he gives us to get there, and there's lots of bad ways to get there that don't actually get you there. So. All right, well, there's some more ways to know things, but before we move to the next one, God willing, James has gotten back in touch with us. So. James, are you there?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2989.19,"end":2990.71,"speaker":"Audience Member","text":"I am, Father, yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2991.27,"end":2996.71,"speaker":"Fr Stephen De Young","text":"Speak to us, James. Speak to us quickly before I lose back again."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":2998.09,"end":3056.88,"speaker":"Audience Member","text":"So I've been thinking about the noose and our spiritual bodies in similar Terms like with the episode on Hades and the mountain of God being richly present in liturgy or in Tabernacle on Mount Sinai, etc. And so thinking of it in context of, well, they talk about the nous or heart being where our sort of like where our physical heart is. Like, when I read some of the stuff on hesychasm, like, they'll say, like, you know, you want your awareness to be at where your heart and. But don't let it drift lower because that's where the passions reside. So I was wondering if there's like a similar idea where there's a ritual intersection of our spiritual location, of our passions lower in our bowels and then our heart, our noose higher up, closer, above our heart. And I'm on right track with that. And then also as a coach, I work with personality a lot, and I've always wondered where does personality fit into all of this?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3058.88,"end":3193.27,"speaker":"Fr Andrew Stephen Damick","text":"You know, on that first question, it's interesting if you read, you know, if you read pre modern literature, there's various ages where the concept of where the seat of emotion is moves around in terms of the way that it's conceived in the body, right. So like in the modern world, we tend to think that emotions are in the hearts. You know, you feel things in your heart, right. But there's a lot of medieval texts where you feel them in your kidneys. That's where, you know, the feelings are. And of course, you know, as you move around to different parts of the anatomy, there's all kinds of jokes you could make about where the real center of the human person is. But yeah, I mean, I'm not an expert on this kind of ascetical literature about, you know, the mind descending into the heart and I think as this. But I do think as this, this episode proceeds and we actually, you know, this is classic Lord of Spirits. We never, we don't ever start, quite start where we say we're going to talk about the noose, you know, but I think that'll become clear as we go. But, but I mean, we don't want to leave you totally hanging since you finally did get through. God bless you. But yeah, you know, it's, it's. I think part of the idea of the mind and the heart is it's really about focus for what it is you're taking into yourself. Right. And even though there's not, I don't think, and I don't know, Father, you can correct me if I'm wrong with this. I don't think that you can Pinpoint parts of the material anatomy of the human person as. As being sort of specifically linked to these spiritual realities that they're. They're more. I don't know. I. I would say that they're more metaphorical for a spiritual reality that is going on, you know, like. So if someone doesn't have their kidneys anymore, as I say, if someone doesn't have any kidneys anymore, does that mean that they can't feel? I don't know. Yeah, save me, Father. But, I mean, I get the basic sense from the aesthetical literature, but I'm not sure that I, you know, would pair it up with particular organs, you know, like, material organs. So I'm actually. Me. Please, please."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3193.35,"end":3203.11,"speaker":"Fr Stephen De Young","text":"Yes. I'm gonna actually. You a little bit. But I'm also gonna be an even worse tease because we're really going to get into this in two weeks on our next episode of Lord of Spirits."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3206.71,"end":3209.19,"speaker":"Fr Andrew Stephen Damick","text":"But gotta keep it coming back for more, James."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3209.43,"end":3220.47,"speaker":"Fr Stephen De Young","text":"Right, so. So there is. There is materiality and spirituality to everything."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3221.35,"end":3221.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3222.55,"end":3226.47,"speaker":"Fr Stephen De Young","text":"Because spirit and matter are not actually separate."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3227.19,"end":3235.67,"speaker":"Fr Andrew Stephen Damick","text":"Right. But can we peg these things to specific organs? That's. That's kind of what I was sort of."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3236.07,"end":3237.63,"speaker":"Fr Stephen De Young","text":"Sort of, sort of. Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3237.63,"end":3238.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3238.15,"end":3249.77,"speaker":"Fr Stephen De Young","text":"So those chemicals in your brain when you see someone you love are not unrelated to love. Right. Love is not reducible to them."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3250.17,"end":3251.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3251.21,"end":3271.46,"speaker":"Fr Stephen De Young","text":"But they're not unrelated and separate either. Right, Right. So there are, you know. Yeah. You can't train like. Yeah. In Greek, the word for compassion is built around the word for spleen. So, like, when you read in the Gospels that Christ had compassion for someone, it literally says in the Greek that He splendid spleaned at them."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3273.38,"end":3274.26,"speaker":"Fr Andrew Stephen Damick","text":"That is amazing."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3274.58,"end":3287.54,"speaker":"Fr Stephen De Young","text":"Right. So you can't. You can't, like. Yeah, you can't, like, do it that directly. But there is a physiological reality to all of these spiritual things. Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3287.86,"end":3299.95,"speaker":"Audience Member","text":"And this is life is in the heart and the heart and also like the breath of life. And yet all heart does literally carry oxygen to our body. So, like, as a physical corollary to that spirituality, same kind of thing."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3300.51,"end":3311.71,"speaker":"Fr Stephen De Young","text":"Right, Right. And we've all seen and known someone at some point in our life where we've seen someone who has fallen deeply into sin. And they look different."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3312.75,"end":3313.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3313.39,"end":3340.84,"speaker":"Fr Stephen De Young","text":"Like, physically, physiologically, they start to look different. And we've known people who have repented who have in the opposite direction started to look different. Right. And that's that again, there. There is no separation between spirit and matter. That. That these things are always connected and permeate each other. And go both ways. But we're going to talk about that a lot more in two weeks. On the next Lord of Spirits."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3342.44,"end":3344.6,"speaker":"Fr Andrew Stephen Damick","text":"Does that. Does that help, Lisa? A little bit there, James?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3344.76,"end":3363.36,"speaker":"Audience Member","text":"That does help a lot. Will the personality aspect possibly be touched on next episode, or does that fit more with this one? Because I thought of personality is like a lens of perception. So that kind of how he perceived the world through this lens rather than like an identity like a lot of people seem to say. I wonder if that fits in this episode more as far as how you perceive truth."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3363.92,"end":3460.59,"speaker":"Fr Stephen De Young","text":"Yeah, we're not going to get into that next time for sure. Yeah. So the modern concept of personality includes a lot of things and. Yeah, so it includes things like habits and patterns of behavior. It includes, you know, learned responses. It includes all these. All of these kinds of things. But then it also, like you mentioned, includes ideas of identity. And that's kind of a rabbit hole. We will get to this in a future episode. But the way we. The way we think about identity in the modern. In our world today, it's a contemporary world. I shouldn't say modern in this case. In the contemporary world, we think of identity as. Identity is what sets me apart from all the other people and makes me different. And identity in the ancient world was the exact opposite. Identity was like an onion or an ogre. It had layers and it was. It was these layers of belonging. Right. So it was your family and your trade guild and the. The city and place you were from and the community. Right. This is why we know all these people. Like, everybody refers to Thomas Aquinas as Aquinas. That's not his name. That's the city he's from."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3461.23,"end":3461.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3461.95,"end":3515.73,"speaker":"Fr Stephen De Young","text":"You're calling him of Aquino, but we read that as if it's a last name. Right. And many of the saints have the place where they're. Because that's part of their identity, the community they're part of and where they're from. Right. That's part of who they are. Right. And so identity in the ancient world was composed of all of these things. They were all of the things that connected you to other people and places and realities and things. And so, yeah, we have kind of an inverted sense of identity, and I think that affects how we view personality, too. Where we tend to look at personality as. Personality is what sets this person apart from other similar people, rather than seeing it in that context. So, yeah, going further into that might be too much rabbit hole for this episode."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3516.85,"end":3519.25,"speaker":"Audience Member","text":"Wes. My appetite for future episodes, I will."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3519.65,"end":3534.29,"speaker":"Fr Andrew Stephen Damick","text":"There you go. There you go. All right. Well, thank you very much for calling, James. We're glad you finally got through. Okay, so. Well, we have another caller and we have a question from Troy. So, Troy, what is on your mind?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3535.9,"end":3537.1,"speaker":"Audience Member","text":"Hello, Fathers, can you hear me?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3537.34,"end":3539.06,"speaker":"Fr Andrew Stephen Damick","text":"Yep, we hear you. Yes, sir."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3539.06,"end":3555.82,"speaker":"Audience Member","text":"Oh, great. Thank you for having me on. My question is, so when you were talking earlier, since we are subjects, we don't have access to the objects of knowledge. Does that mean there's a similar distinction in how we know other people or angels to the essence, energy distinction with how we know God?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3557.34,"end":3681.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Yeah, I recall, you know, when I was. And we don't just leave it at that. Although it's always great to get one of those monosyllabic yeses from Father's or the no is very good as well. But, I mean, I recall when I was in seminary and we were talking about this question of essence and energies, that Dr. Bousalis, who was the patristics professor at St. Tikon's at the time, great professor. He, you know, someone said, wait, wait, wait. Because we were talking about anthropology, you know, about human beings, and someone said, wait, wait, so you're saying that God in his essence is unknowable, but he's knowable in his energy is okay? In human beings, it's the same essence, unknowable energies, knowable. And he gave, just like Father Steve, it's like, yes, but think about that, right? You don't know. I mean, this takes us back in some ways. You don't know what it's like to be a bat. You don't know what it's like to be another person. You can't know that person in their essence. You can't even know their experience of themselves, right? All you know is your interactions with them, right? You know the way they look, you know the way that they sound. You know what they have said to you and done to you, done with you. You know what their reputation is. You know, all of these things are part of that, right? Now, you wouldn't say, because you don't know what it's like to be that other person, that you don't know them. You do know them, but it's the kind of knowing that you have. It's the knowing that you participate in, right? You can't know anything because you're, you know, only God knows things in their essences. You can't even really know your own essence. You know what it's like to be you. But. But God knows you on a level that you don't even know yourself. Right. So. So, yeah, it's true, you know, that. That human beings likewise, are participable in their energies, but their essence is off limits. You know, just not. Not accessible any, actually, is there, Father Stephen?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3683.2,"end":3684.08,"speaker":"Fr Stephen De Young","text":"No. That is great."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3684.08,"end":3684.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3684.48,"end":3689.92,"speaker":"Fr Stephen De Young","text":"Yeah. You don't know what it's like to be a bat or a tree or a raven or a writing desk."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3690.32,"end":3695.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Thank you, Lewis Carroll. All right. Does that make sense, Troy?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3696.64,"end":3697.8,"speaker":"Audience Member","text":"Yes, thank you. That's."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3697.8,"end":3698.72,"speaker":"Fr Andrew Stephen Damick","text":"That's very helpful."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3698.72,"end":3699.57,"speaker":"Audience Member","text":"Thank you, Fathers."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3699.96,"end":3700.2,"speaker":"Fr Stephen De Young","text":"Great."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3700.52,"end":3701.16,"speaker":"Fr Andrew Stephen Damick","text":"Excellent."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3701.96,"end":3704.76,"speaker":"Fr Stephen De Young","text":"You never know just how you look through other people's eyes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3705.08,"end":3725.64,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right, so moving on. We've got another kind of knowledge, and this is one that should be very, very familiar to modern people. And that's what in ancient Greeks called techni. But we could translate it as know how, know how, you know, and it's the origin of our modern English word technique. Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3725.8,"end":3732.2,"speaker":"Fr Stephen De Young","text":"And also technology, though people jump to what we call technology a little too quickly."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3732.2,"end":3757.45,"speaker":"Fr Andrew Stephen Damick","text":"A little too quickly. Right. It could be like, you know, I know how to work, you know, I know how to drive my car. It doesn't mean I'm a computer scientist or an engineer or whatever, you know, or I know I know how to brush my teeth. I know, like, these are. It's this kind of. I know how to. Whatever it might be, it does connect with technology, but it's about."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3758.33,"end":3761.29,"speaker":"Fr Stephen De Young","text":"We use technology to refer to, like, digital technology."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3762.01,"end":3762.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3762.97,"end":3778.41,"speaker":"Fr Stephen De Young","text":"And I'm sorry to any Amish people who might be somehow listening to Internet radio. I guess I don't have to apologize, but everything is technology. Right. The buggy was. Technology was high technology at one point."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3778.72,"end":3781.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Human activity, the things that we make."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3781.08,"end":3793.28,"speaker":"Fr Stephen De Young","text":"On your coat were technology at one point. Right. The coat slacks at one point. These were technological innovations."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3794.08,"end":3831.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. This has come up a lot for Lord of Spirits listeners because, of course, we talk about the dark gift of techni to Cain and other people throughout time that have. Were given this knowledge by demons. And so occasionally we get this question of, like, okay, well, which kinds of technology are demon technology? You know, the idea that we shouldn't touch that because that came from demons, you know, so it's very much an ongoing concern, you know, and so this will be an opportunity to kind of talk about some of that a little bit more."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3832.4,"end":3868.07,"speaker":"Fr Stephen De Young","text":"Right, right. Because. And now this. This counter technique expands even beyond even those examples I just gave of technology. Right. Because we're also including with this, you know, things like handicrafts and sculpting and art, poetry and music, poetry. Music, Right. And all of this sort of human creative activity, taking the things that exist in the creation and putting them in order."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3868.87,"end":3869.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3870.07,"end":3871.27,"speaker":"Fr Stephen De Young","text":"Putting them to purpose."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3871.67,"end":3992.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so for all you Tolkien fans out there, his term for this is sub creation. Because human beings can't truly create. That is, we cannot make something out of nothing. All we can do is take what God has created and put it into a new order. Right. So, you know, God made the things that we can make paints out of. We make paints out of them and then use those paints to paint icons. Right? So yes, icons are man made, but it is, they are sub created. They're not truly, truly created. And the reason that we do that, I mean, this is inherently a good thing. We're made in the image of a maker in whose likeness we are made. So we are made to be makers. We're made to make stuff. So it's a good impulse that we have to want to do this. Now the knowledge itself, knowing how to make a chair, is that good or evil? It's knowing how to make a chair. What do you do with a chair? Well, that might be good or evil, you know, but it's not inherently good or evil. This is simply knowledge. Now, what you do with it. So for instance, when demons give technology to mankind at various points, they do it in such a way that they know that we'll harm ourselves with it. Like matches are a good thing. They're a useful item, but I'm not going to give them to my 4 year old. It's not appropriate for him to have matches. Now my 14 year old, if I give her matches and tell her to light a candle, then she has done a good thing with the morally neutral knowledge that I gave her. But she did a good thing by obeying her father, by making light. So that's what we're talking about. And this is in the classical world, the ancient world, this is a kind of knowing, knowing how to do things. This is knowledge."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":3993.8,"end":4016.76,"speaker":"Fr Stephen De Young","text":"And it's, as you said, it's, it's morally ambivalent. Right? Ambivalent meaning ambivalent, Right. It can go either way, right? You can, you can take any of these arts or any of these crafts and use them to, to do good or use them to do evil. Right? You can make a scythe to help you harvest crops. You can turn that into a sword and use it to kill people."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4017.64,"end":4018.04,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4018.28,"end":4037,"speaker":"Fr Stephen De Young","text":"You can, you can make the first two Pearl Jam albums, you can make Nickelback albums or record as your alter ego Chris Gaines. And Create abominations. Right. Any of these things can be, can be taken in either direction."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4037.16,"end":4037.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4037.56,"end":4039.76,"speaker":"Fr Stephen De Young","text":"Like at any point I was saying."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4039.76,"end":4042.36,"speaker":"Fr Andrew Stephen Damick","text":"I wondered if you're going to work in the Nickelback reference. That's good."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4042.36,"end":4049.81,"speaker":"Fr Stephen De Young","text":"Yes, I was. And people get mad when I take cheap shots at Garth Brooks. So I threw that into."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4052.13,"end":4054.29,"speaker":"Fr Andrew Stephen Damick","text":"This is how you remind us who we really are."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4056.85,"end":4062.13,"speaker":"Fr Stephen De Young","text":"So I know they won a bunch of Canadian awards, but that's low hanging fruit. Come on. Don't come at me with that."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4064.45,"end":4067.17,"speaker":"Fr Andrew Stephen Damick","text":"Don't, don't, don't add me for what he just said. Everybody."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4068.77,"end":4076.8,"speaker":"Fr Stephen De Young","text":"What, what are the Canadians going to do? They're going to be friendly about it. They're going to be kind about it. They're good people. They're good indeed."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4076.96,"end":4079.12,"speaker":"Fr Andrew Stephen Damick","text":"We love you. We love you Canadians."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4079.2,"end":4089.92,"speaker":"Fr Stephen De Young","text":"You have many great qualities. So. Right. So, but, so this could go either way. And that's why there is that danger of giving it to someone who is not prepared."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4090.32,"end":4090.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4090.8,"end":4093.04,"speaker":"Fr Stephen De Young","text":"To execute that moral reasoning."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4093.28,"end":4094.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4096.4,"end":4114.56,"speaker":"Fr Stephen De Young","text":"And, and that's what's going on with the, the, the, the fallen angelic beings in Cain's line. Right. They're giving them metallurgy, not so they could make tools to help them, you know, produce more crops to feed more people and prosper on the earth. They're giving it to them so they can make weapons and kill each other."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4114.96,"end":4149.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And. Or likewise, music, like music can be, you know, used to make something beautiful that lifts the person towards God or it can be used for seduction or. I mean, not so much these days. But in certain times music was used to, to rile people up, to do, to make war. You know, like that's, I mean, I recall in some of the wars between the, the English and the Scots, the English actually, actually declared the great Highland War pipes to be weapons which, you know, as a lover of bagpipes, you know, I'm both sort of delighted by that and also slightly appalled."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4149.37,"end":4165.93,"speaker":"Fr Stephen De Young","text":"So I do, I do sometimes feel victimized by bagpipe music. Oh, I must say. So there is something to that. Right, but, so, so this is a type of. But this is a legitimate type of knowledge."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4166.17,"end":4167.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4167.25,"end":4173.77,"speaker":"Fr Stephen De Young","text":"This is a legitimate type of knowledge. Jonathan Pageau knows things about working with wood."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4174.09,"end":4176.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And I do not."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4176.01,"end":4190.71,"speaker":"Fr Stephen De Young","text":"That I do not know. Right, right. That that craft is something which he possesses. It's a kind of knowledge and a relationship with those objects in the world that he has, where those objects in the world reveal themselves to him in a different way than they do to me."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4190.95,"end":4213.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. This is arts and crafts, also artisans and craftsmen. Right. This is making things. And there are people. I'm sure some of you listeners are really great at making things, and some of you are not so great at making things. I'm on the not so great at making things line, at least in terms of what people might normally think of as art."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4213.55,"end":4214.19,"speaker":"Fr Stephen De Young","text":"Now, I would."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4214.27,"end":4215.39,"speaker":"Fr Andrew Stephen Damick","text":"I make podcasts."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4215.39,"end":4225.07,"speaker":"Fr Stephen De Young","text":"You could make a lovely kind of macaroni picture, like, for. For a Father's Day thing or a Mother's Day thing. That seems up your alley to me."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4225.15,"end":4225.47,"speaker":"Audience Member","text":"That."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4225.47,"end":4227.39,"speaker":"Fr Andrew Stephen Damick","text":"That I'll. I'll have to try that."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4227.63,"end":4233.79,"speaker":"Fr Stephen De Young","text":"Okay. And the main reason I mentioned Pageau there was, again, I'm trying to get back in with the Canadians after."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4234.35,"end":4235.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes, it's true."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4235.31,"end":4236.79,"speaker":"Fr Stephen De Young","text":"Yeah, that's true. I mean."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4236.79,"end":4240.43,"speaker":"Fr Andrew Stephen Damick","text":"I mean, after William Shatner, he is the world's greatest Canadian, possibly."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4240.43,"end":4241.23,"speaker":"Fr Stephen De Young","text":"Yes. What do you think?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4241.32,"end":4241.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes. There we go."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4241.92,"end":4260.44,"speaker":"Fr Stephen De Young","text":"Okay. Yeah, yeah, yeah. Definitely. Definitely the greatest Jewish Canadian, number two, Leonard Cohen, just for the record. So this brings us to our penultimate way of knowing. Right. Which is wisdom."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4261.08,"end":4272.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's. And, And. And it's great that we just mentioned Jonathan Pageau, because this will be. This will really, really appeal to the Pajovians out there. This section of the podcast, it's almost."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4272.93,"end":4274.21,"speaker":"Fr Stephen De Young","text":"Like I planned a segue."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4274.85,"end":4276.37,"speaker":"Fr Andrew Stephen Damick","text":"It might well have been."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4276.61,"end":4284.05,"speaker":"Fr Stephen De Young","text":"Yeah. And. Yeah. And this is in Greek. This is Sophia in Hebrew. This is a whole bunch of words."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4285.97,"end":4291.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which was news to me. Yeah. I mean, do they have shades of meaning that are different from each other?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4291.97,"end":4307.63,"speaker":"Fr Stephen De Young","text":"Yes, but there's shades. This is. I think this is sort of the. The indigenous people in. In Alaska and Canada have, you know, what, seven or nine words for snow kind of thing, like."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4308.51,"end":4311.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although some of that's urban. Some of that's urban legend."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4311.35,"end":4332.13,"speaker":"Fr Stephen De Young","text":"Early early Semitic languages have, like, all these different words for variations of wisdom. One of my favorite. Which is. But sometimes I think Hebrew should be Flemish. Really? Based on. They have six consonants that make roughly the sound. So."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4332.13,"end":4339.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. So wisdom is. And here's. Here's where all the Pajovians will love this. Wisdom is the patterns built into creation."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4339.85,"end":4342.45,"speaker":"Fr Stephen De Young","text":"Well, yeah. Wisdom is knowing them, Discerning them."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4342.45,"end":4343.25,"speaker":"Fr Andrew Stephen Damick","text":"Knowing them. Yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4343.25,"end":4344.09,"speaker":"Fr Stephen De Young","text":"Perceiving them."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4344.25,"end":4344.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4344.61,"end":4387.76,"speaker":"Fr Stephen De Young","text":"Right. That there are within. Within the created order. And as we've talked about, God creates by setting things in order. That's what the creation story in Genesis 1 is. So since he creates by setting things in order, that ordering is perceptible to us in varying degrees. But that Way of knowing that, way of perceiving it. That's what we're talking about when we're, when we're talking about wisdom. And that order built into creation is also connected to the idea of justice, which is why wisdom and justice are always kind of aligned in the Old Testament."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4388.72,"end":4397.68,"speaker":"Fr Andrew Stephen Damick","text":"Now, would this be the kind of thing like, for instance, astronomical observations or ecological. I mean, like, is it even on that level?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4398.16,"end":4427.37,"speaker":"Fr Stephen De Young","text":"Right, all of that. That's why in Proverbs you get the go to the ant, thou sluggard, which famously inspired Henry Pym to become ant man. But the. So you, you look at ants and you, you perceive something. Or when Christ points and says, consider the lilies of the field, consider the birds of the air. Right. It's pointing to these patterns in the created order."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4428.39,"end":4429.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4429.11,"end":4446.23,"speaker":"Fr Stephen De Young","text":"And then revealing them about the way in which, you know, if the whole creation is ordered in this, this way, then that also applies to humans and human life and the human soul and the order that should be, that should be reflected there as well."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4446.95,"end":4447.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4447.67,"end":4453.11,"speaker":"Fr Stephen De Young","text":"And it goes downwards in that way and then it also goes upwards back toward God, who put the order there."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4453.5,"end":4512.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And, you know, understanding it in this way is much deeper than the kind of sort of proof that's sometimes given for, you know, the fact that God exists. Oh, look at the creation. Look how beautiful it is. That must have been made by somebody. Like that's true, right? That's true. Of course it's true. But there's something much deeper there, you know, that that's related to real attention being paid to what's going on in creation. You know, a much deeper sense of that than just simply a kind of aesthetic appreciation for what you see and hear and smell so forth, you know, so the wisdom, the logic of creation itself is something that's knowable and worth knowing and does lead you to God. I mean, this is, this is the idea, right, that, you know, that the stars preach the gospel. Right, Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4512.63,"end":4623.94,"speaker":"Fr Stephen De Young","text":"You see this in both Romans 1, right. In Romans 1, where St. Paul is talking to the Gentiles about how they had knowledge of God before the gospel came to them. When he talks about how the invisible attributes, it's usually translated in English of God were made plain in, in the created order, right, in the creation, right. That they could have looked with wisdom and discerned, right, those patterns and come to understand, understand who God was. And then also in Romans 10, where he's talking about, again, how they could have known the gospel before the gospel came to them. By saying that, as we talked about back in our Christmas astrology episode, that that was written in the stars of the heavens, that these patterns were there for wisdom to discern. And. Yeah. In those passages in Proverbs and elsewhere in the wisdom literature, the Old Testament, where Christ is identified as wisdom, it's always in tandem with his involvement in creation. Right. So that the second person of Yahweh, the God of Israel, is involved in creation and is serving this function of wisdom. And this then gets developed through, you know, St. John's use of logos in the prologue of his gospel into what we see later in patristic theology. Saint Maximus the Confessor being exhibit A of the idea of Christ as Logos and then the logia of creation. Right. The structures, the patterns, the order in creation that leads back to the Logos."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4624.26,"end":4664.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, and like, I've read some of those passages on from Saint Maximus, and I see people talk about them a lot on the Internet and a lot of it's kind of bewildering, you know, like, I've seen a lot of weird things that are said about them. So I don't know. I mean, could you give a brief summary of exactly what he's. I mean, really. Right. Just. Yeah, Just to lay this out, because it's one of these things that gets talked about all the time, or at least in the stuff that I read. But. But could be, I don't know, can seem very esoteric. Right. You know, like. Like each, each thing has a Logos in it. Like, what. What is that? Is it some sort of mystical diamond."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4664.93,"end":4678.52,"speaker":"Fr Stephen De Young","text":"That everyone's carrying around? It's not the essence. Yeah, yeah, yeah. So you start with Christ. Right. Christ is the. The Logos, the."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4678.52,"end":4679.6,"speaker":"Fr Andrew Stephen Damick","text":"Ooh, Right, yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4679.6,"end":4744.36,"speaker":"Fr Stephen De Young","text":"He is the Logos of God. Right, right. He's the Logos of God. So that's setting up a. A paradigm of. Of the relationship. Right. So he is how God reveals himself to creation. Right. We don't come to know God the Father directly. We come to know Christ. We come to know the Logos, and through him we come to know the Father. Right. So the logi or the logia in all created things are that capacity in which it's coming at. I was using the phenomenological language of the way objects of the world present themselves to us. This is coming at it the other way. This is the element of the objects in the world that is accessible to our knowledge. Okay, Right. So it's coming at the same kind of idea from the other direction."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4744.52,"end":4746.92,"speaker":"Fr Andrew Stephen Damick","text":"I see. So this is what we can sort of perceive."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4747.56,"end":4747.76,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4747.76,"end":4748.28,"speaker":"Fr Andrew Stephen Damick","text":"Of them."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4748.36,"end":4796.27,"speaker":"Fr Stephen De Young","text":"Right, Right. The order, the structure. Right. What makes them. Them. So it's closely related to, to nature. It's closely rate. Right. It's not the particular essence. Right. Because we don't come to know God in his essence. Right. We don't come to know Christ in his essence. Right. We. We come to know his, his person as the Logos of God. So it's not the individual essence, but it is the pattern, the form, the structure. Right. And that is what is accessible to us as subject when we look at, when we perceive and come to know object."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4796.59,"end":4802.19,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. Gotcha. Well, that makes sense. So. Yeah, but."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4802.19,"end":4816.91,"speaker":"Fr Stephen De Young","text":"So. And that's how they can lead us back. Right. Because if we start to understand these structures and these patterns and we understand them through wisdom at a larger and larger level, they lead us back to the Logos, the."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4816.91,"end":4817.23,"speaker":"Fr Andrew Stephen Damick","text":"Ooh."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4817.23,"end":4821.59,"speaker":"Fr Stephen De Young","text":"The Logos proper, which then leads us to come to know God."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4821.83,"end":4830.92,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Exactly. All right. Well, having said all of that, we're gonna go ahead and take our second break and we'll be right back. Give us a call."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4831.64,"end":4847.96,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4853.49,"end":4884.07,"speaker":"Announcer","text":"Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4884.39,"end":4890.75,"speaker":"Fr Andrew Stephen Damick","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4890.75,"end":4892.67,"speaker":"Fr Stephen De Young","text":"Out any work in the church."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4892.67,"end":4896.79,"speaker":"Fr Andrew Stephen Damick","text":"The woman was astound, a tovarish you could count on."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4897.51,"end":4904.55,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4904.55,"end":4909.66,"speaker":"Fr Andrew Stephen Damick","text":"Church folks at St. Alexander the Whirling Dervish Parish didn't even know her name."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4910.06,"end":4912.14,"speaker":"Fr Stephen De Young","text":"It wasn't anything they thought about."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4912.94,"end":4924.3,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4924.3,"end":4939.35,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":4942.07,"end":5004.38,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back, everybody. Welcome to the third half of the show. We'd love to hear from you. So we've been talking about various modes, ways of knowing, kinds of knowledge that come by means of those ways of knowing. This is the nous episode. So we're now finally going to talk about the noose. And I recall when I was in seminary, I don't know, this is maybe my first or second semester, we were in a class and the professor was asking provocative questions. I can't remember throwing out stuff, and one of my classmates raised a hand and said, is it the noose? And the professor says, don't worry about that. You're going to hang yourself with it. So I always think of that now whenever I start contemplating the nous. Obviously, the Greek word nous and the modern English word nous are not the same word. Although now I have to go look up the etymology just so I can see what the origin of the English word is. Nous. So, all right, so what is the noose, Father Stephen?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5004.86,"end":5017.03,"speaker":"Fr Stephen De Young","text":"Yes. So this isn't a pretty noose. This isn't fake news. This is. I get all my noose from Gary Gnu, by the way."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5017.03,"end":5017.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5017.51,"end":5019.19,"speaker":"Fr Stephen De Young","text":"For anyone who gets referenced."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5019.27,"end":5032.79,"speaker":"Fr Andrew Stephen Damick","text":"I got it. Yes. Oh, boy, that thing. That really does take me back. So the modern English word noose, as in the thing you hang yourself with, comes from the Latin nodus, which refers to a knot. So that's where that comes from. Yes. They're not related."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5033.75,"end":5036.23,"speaker":"Fr Stephen De Young","text":"So now that I'm done digging in the reference crates."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5036.96,"end":5041.76,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Thank you for throwing me a few bones. I really do appreciate it."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5044,"end":5078.13,"speaker":"Fr Stephen De Young","text":"So, yeah, this is. This is nous, usually transliterated into English as N O U S. Right. And often translated as mind. But a whole bunch of other things we've been talking about are also translated as mind in a lot of your English Bible translations. So, but to get into this, we have to get into then sort of the concept of. Of the mind, and we have to start getting into that by sort of breaking down our common contemporary notion of the mind, which is really the brain."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5078.53,"end":5090.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, okay. So before we jump into that, we actually do have a caller, so we have Scott. So, Scott, are you there? I am, Father."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5090.47,"end":5091.19,"speaker":"Audience Member","text":"Can you hear me?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5091.43,"end":5095.67,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we can hear you, Scott. Welcome to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5096.71,"end":5097.35,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5097.91,"end":5099.71,"speaker":"Audience Member","text":"Yeah, I had a just a thought."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5099.71,"end":5110.43,"speaker":"Fr Stephen De Young","text":"As you were describing wisdom in the previous half, that the wise men of the east seem to be like, what."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5110.43,"end":5113.99,"speaker":"Audience Member","text":"Is their characteristic that calls them wise?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5114.64,"end":5121.36,"speaker":"Fr Stephen De Young","text":"They seem to be gentile or pagan people who understand the patterns of the world."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5121.84,"end":5129.92,"speaker":"Audience Member","text":"And is this, is this their wisdom that you've talked about in the previous half, the understanding the patterns of what goes on?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5131.04,"end":5131.52,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5132.08,"end":5142.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you know, think of. I mean, they're described often as essentially having knowledge of the stars, right. So they're, they're astronomers, at the very least."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5144.01,"end":5208.28,"speaker":"Fr Stephen De Young","text":"And if you, if you, if you look at, I mean, this is. Right, the word philosophy comes from philosophia, right? The love of Sophia, the love of wisdom. And when you look at the first philosophers, you look at the pre Socratics, what are they trying to do? They're trying to understand, you know, the structures of the principles that underlie the world around them. Right. Everything is water, everything is flux, everything is, is earth, everything is. Right. Everything is fire. And then you look at, you look at Socrates and he's trying to understand, like, what is justice? Not, you know, what are some examples of justice and injustice, but what is, what is justice? What is the pattern or the structure that exists that, that, of course, Plato, by extension, that, that we're pointing at when we say this is just or this is unjust. Right. They're. They're looking for those patterns and to understand those things. The same thing with Aristotle. That's really what Sophia wisdom means in the context of philosophy, at least originally, is understanding these patterns. Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5209.88,"end":5213.76,"speaker":"Fr Andrew Stephen Damick","text":"Does that concrete example of. Yeah, it feels like a concrete example."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5213.76,"end":5226.93,"speaker":"Audience Member","text":"Of what Paul was talking about in Romans, like that there is a wisdom that the Gentiles can see. Having not seen Christ directly, these guys were coming to worship him based on nothing, but based on nature. So."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5227.17,"end":5227.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5227.45,"end":5236.37,"speaker":"Fr Stephen De Young","text":"And. And if they follow it out, it will lead them to Christ. It's not a separate other way to get to God, but it will lead them to Christ, who is the Logos."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5236.61,"end":5240.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, There you go. All right, well, thank you very much for calling, Scott."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5241.01,"end":5241.57,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5242.13,"end":5248.39,"speaker":"Fr Andrew Stephen Damick","text":"All right, we have Aaron on the line. So, Aaron, what is. What are you thinking about?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5249.75,"end":5251.03,"speaker":"Audience Member","text":"Hey, can you guys hear me?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5251.19,"end":5252.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5252.15,"end":5252.71,"speaker":"Fr Stephen De Young","text":"Yes, sir."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5253.75,"end":5256.15,"speaker":"Audience Member","text":"All right, so what's the deal with the soul?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5257.43,"end":5261.75,"speaker":"Fr Andrew Stephen Damick","text":"What is the deal with the soul? I feel like that's a question. Like, that's a Seinfeld."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5262.23,"end":5262.71,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5264.95,"end":5330.82,"speaker":"Audience Member","text":"I spent a long time thinking that the voice in my head was myself and that that was the soul that I see sat in my mind and I judged thoughts. And now I'm starting to form the idea that. That not the soul, it's an aspect of my thoughts and that the soul is kind of this thing that I Have to train for right conduct and not so much for, like, you know, pursuing my passions and ultimately shape my soul to resemble Christ and to, you know, get to know him. But also, I'm kind of curious because the Orthodox Church is always referring to the soul and like, female pronouns, her and she. And it's like the bride of Christ. Like the church, we are all members of this body and Christ is the bridegroom. And we collectively, maybe collectively our souls are the bride of Christ that's being shaped and acting in the world. And so my general question is. Yeah, what's the deal? What is the soul?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5331.46,"end":5349.53,"speaker":"Fr Andrew Stephen Damick","text":"What is the soul? Well, you know, with regards to thoughts, this is literally the next thing that we're going to be talking about. So just hang in there. Yeah. So, Father, how does that relate exactly to the soul? I mean, your thoughts are not your soul. Well, at least start with that."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5350.25,"end":5650.71,"speaker":"Fr Stephen De Young","text":"Right, right. And your soul is also not your identity, which is another way we tend to think about it, or your ego. The I is not your soul. The I would refer to you as a person, which includes your body. Right. So your soul is a few things, right. In terms of. In terms of what it's doing. So the first thing it's doing is it's giving shape and form to the big pile of matter that is you. Right? That is you at any given point in time. Because the matter in your body changes out about every seven years. So what makes you you is not the particular matter that makes you up at any given point in time. Something like between 30 and 40% of the cells in your body are actually cells and organisms other than you, Strictly speaking, yes. Lots of bugs. There's like, bacteria colonies living in your digestive tract that communicate chemically with other bacteria colonies out in the world. Now, I've creeped everyone out completely, but so your soul is giving form to all of that matter and all of those suborganisms all the time. And. And is. Is what's persisting, right. In your person and making whatever matter composes you at any given time you. It is also what is animating. Pardon the pun, because anima is the. The Latin word for soul is animating that manner, that matter. Right. As. As a human person. Right. So when you're. This is how nefesh in Hebrew is used throughout the Old Testament. Right. And this is why in the ancient world, including in the Old Testament and the New Testament, animals and plants also have souls because they're alive, but they have a different type of soul. Right. Not all souls are the same type of soul, but everything alive has a soul. That's what makes it alive. And so when something dies, that means that that life, right, the soul, the life has left it. And so since it has left it and the life is no longer there, that life no longer gives form to that matter. The matter decomposes, right? The mat. The matter falls apart and decomposes. And so when St. Paul, for example, talks about what happens when we die, we tend to kind of reify our soul into a thing, right? We're kind of closet originists and think there's like this sort of sphere that's our soul that flies up into the sky somewhere, right? Like goes to dwell somewhere. Or we think of our ghost, right? Sort of an ethereal version of us that's up in heaven somewhere. But what St. Paul says is our life is hidden in Christ, right? That, that life doesn't just vanish when it leaves our body, but that. That life is hidden in Christ. Meaning he's got it, he's cherishing it, he holds it, he possesses it. And that that is then returned to our bodies at the resurrection. The question of, well, what's that like? The answer is, I don't know. The only person I could think of who we could ask is maybe Lazarus. But St. Lazarus hasn't appeared to me to let me ask him that question. So. Because he's done it twice. But. Yeah, so we don't. We don't know what that's going to be like to experience anything without our body. But, but that's, that's really what the soul is. And that's why sometimes in scripture and people get all worked up trying to get this all nailed down in their spreadsheet. But this is why sometimes soul and spirit are spoken of differently when, when sometimes soul and spirit are spoken of in the scriptures like they're the same thing. And sometimes they're spoken of as if they're two separate things. When they're spoken of as two separate things, it's because the soul is being used in this strict sense that I was just mentioning of sort of the life of the body, right? And then other things related to us as person are ascribed to spirit. And then sometimes those things are put together in one category. So don't sit around getting in arguments about whether humanity is bipartite or tripartite. It's boring and passe."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5650.87,"end":5659.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, you can see church fathers will. Some of them will say body and soul. Some say body, soul and spirit. They don't fundamentally disagree with each Other."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5661.35,"end":5668.71,"speaker":"Audience Member","text":"Okay, so what is the difference between a soul and the spirit? Well, not to like do a follow."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5668.71,"end":5713.83,"speaker":"Fr Stephen De Young","text":"Up question, but yeah, it depends if they're being separated out. Right. Then soul is being used strictly to refer to the life of the body. Right. Whereas spirit would then be. What they're talking about would be with. With Christ. Right. And spirit is something with an immaterial body by the definition of body we used in our body episode, which is like an angel is a spirit. Right. It has a body. Right. It has a nexus of powers and potentialities, but it's not a material body."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5715.59,"end":5727.83,"speaker":"Audience Member","text":"So I'm understanding the soul is kind of like a nexus of potentialities and that the noose is one of those potentialities that our human souls have, but the tree doesn't have. It's the place where we meet God."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5728.94,"end":5733.5,"speaker":"Fr Stephen De Young","text":"Well, the noose has both a spiritual and material reality."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5733.82,"end":5739.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we're about to talk about that some detail. So just, just hold on."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5741.26,"end":5748.06,"speaker":"Audience Member","text":"And then get a little comment. I know I'm long. A little comment on why people refer to female all the time."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5748.54,"end":5781.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean that's mostly grammatical because the words have grammatical gender. That's female. And you know, in modern, in the late modern English that we speak, almost no word has grammatical gender anymore. Although we have kept it around for a few things like ships, ships or she's. Why are ships she's. Because they were in old English pretty much. Actually. Richard Roland right now is writing it down. I'm going to call him. It's not in old English, but yeah, it's about grammatical gender is really all it is."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5783.49,"end":5785.25,"speaker":"Audience Member","text":"All right, thank you, fathers."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5785.33,"end":5786.21,"speaker":"Fr Andrew Stephen Damick","text":"Okey doke."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5786.77,"end":5787.57,"speaker":"Fr Stephen De Young","text":"Thanks, sir."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5788.05,"end":5801.65,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay. So yeah, the modern concept of the mind tends to be this notion that we're sort of. That it's equal to the brain, which is like a meat computer that, you know, comes up with thoughts. Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5801.65,"end":5804.61,"speaker":"Fr Stephen De Young","text":"It's in your brain, it's in the box of your skull."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5805.01,"end":5805.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5805.41,"end":5812.46,"speaker":"Fr Stephen De Young","text":"And it sort of churns and processes information that comes in through your eyes and ears and nose and mouth and nerve endings."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":5812.86,"end":6040.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, that's, that's the mind in the modern. And I mean we can, you know, we could, we could blame Descartes or whoever. But, but, but that's the way that we, that's the way we conceive of it now. You know, we don't. And this, and I hope that everyone will listen to this part especially closely if you haven't, if you haven't really been close to this thing yet. But really listen to this part closely because you're going to see how this actually really gets down to the individual spiritual life and pastoral work and all this kind of thing. Because the question. And we'll get to. Yeah, the question is, where do thoughts come from? And it's really vital that we correct our way of conceiving this, because if we have this modern idea that thoughts are something that are generated by your head, right, that you come up with them like a computer, and then let's say you keep having a bad thought over and over and you can't get rid of it, maybe it's a horrible, horrible thought, then it would be potentially reasonable for you to conclude I am a bad person and I am flawed and there is something wrong with me and I can't get rid of this. This is just who I am, right? I was born this way. But that is not congruent with the ancient conception of what the mind is, the nous is, and where thoughts actually come from. Thoughts are not something that you come up with in the ancient conception. The mind is actually essentially an organ of perception, like your eye or your ears, that it receives thoughts, that thoughts come from the outside. So if you keep having the same thought over and over again, that means you keep receiving it over and over again. Now, it's your choice as to what you. And we'll get into this choice as to what to do with the thought. It's your choice to pay attention to that thought, but the thought is not being generated by you. So I turn my head left and right and different kinds of light come into my eyes, and then I perceive that light. I see different things in the room that I'm in right now, and I focus on them and I see that image. I'm not creating those images. Now, you could talk about the way the mind deals with the way the brain deals with that stuff, but fundamentally, I'm not inventing the way that, for instance, the room looks. I'm perceiving and I'm receiving. And that's the way thoughts are in this ancient conception. And I think as you listen to what we're about to talk about, it's going to become clear, I hope that this is actually a much more workable way of understanding spiritual life, of living the spiritual life. It's doable. It becomes doable. You know, if we make it a purely kind of psychological thing where like, wow, I just keep having terrible thoughts. I can't get rid of them, then it might be a trap, you know. Whereas if we understand Thoughts in this way, then there is something you can do about it. There's something you can do about it. So the noose is a perceptive organization. It sees the spiritual world, it receives thoughts, and ultimately it's designed to see God. That's why God gave us the news, to see him. That's what he wants us to see, is him."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6041.28,"end":6163.4,"speaker":"Fr Stephen De Young","text":"Right. And this corresponds to our experienced reality. I've never met anyone who's actually experienced creating a thought. Yeah, thoughts appear in our heads and we may wrestle with thoughts, we may struggle to understand and interpret thoughts, but there's no experience of generating a thought, right? Like I can, I can experience writing a sentence, right? Like I write a letter and then another letter and I write a word and then another word and I might be kind of composing and coming up with the sentence as I'm typing, right. Or writing on a piece of paper. I have had that experience, but I've never had that experience in my mental world of composing a thought. Right. And in fact, what I'm doing while I'm trying to write the sentence is thinking thoughts, is dealing with thoughts as to what I should put next. Right. But those thoughts are just appearing before my mind. So this is this h. Way of seeing it is based on how we actually experience it, right. And so this is, this is how when, when you get in any ancient source, we're going to start with a couple of, of Greek philosophers, but when you go into any, any ancient source, this is how they view. The nous is sort of the highest of all these ways of knowing. The noose is sort of at the, at. At the top of the heap, right. And all of the others participate in the nous to one degree or another. Like this is that the highest way of knowing? Right. And everything, all the other ways of knowing are related to it. But so for Plato, the noose is how you discern the eternal forms like the, the, the unchanging eternal reality beyond the world of becoming and change and, and chaos and transition."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6163.72,"end":6164.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6164.36,"end":6203.61,"speaker":"Fr Stephen De Young","text":"You come to see them, for Plato, with, with the noose, you perceive them. And Aristotle, when you get into metaphysics lambda, and he's talking about the being that later becomes known as the, the prime mover, who's more the unmoved mover. He describes it as the, the noises, noicios, which is something like people struggle to translate that it's based on the word noose. It's sort of the noose that's noosing. So it's, it's sometimes translated as something like thought thinking itself."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6204.09,"end":6204.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6205.29,"end":6221.97,"speaker":"Fr Stephen De Young","text":"Sort of pure thought in action with itself. But how, how did Aristotle come to. Come to perceive that? Well, he, he came to perceive that noetically through like a meditative process."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6222.53,"end":6222.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6222.85,"end":6271.94,"speaker":"Fr Stephen De Young","text":"For him, in the metaphysics, you arrive at this through this kind of meditation by which you, you ascend above the being of beings, to being, capital B, to, to. To the contemplation, which. And contemplation means seeing, looking upon this. This. Right. Thought. Thought thinking itself, however you want to, Want to conceive. And I, I've never met anyone who's read metaphysics, and specifically metaphysics lambda in Greek and hasn't gotten a headache because of trying to, you know, deal with this. But you also find this here's to be the totally non controversial part of this episode. You also find this in great detail in Eastern religions."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6272.45,"end":6277.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it wouldn't be Lord of Spirits if we didn't do at least one segment that's about something deeply weird."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6277.73,"end":6280.21,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So get ready, buckle up."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6280.85,"end":6286.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's. There's this notion of. Here we go. The, the third eye. Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6286.53,"end":6293.97,"speaker":"Fr Stephen De Young","text":"And you know, usually depicted or painted or indicated at the center of the forehead. Right, right. Associated with the mind."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6294.21,"end":6309.52,"speaker":"Fr Andrew Stephen Damick","text":"Up, up top. Yeah, yeah. And, and, and you're trying to open it up is, is the idea so it can see. You know, there's, there's the notion of. Okay, I mean, you're gonna just need to help everybody with this, the pineal gland."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6309.6,"end":6365.6,"speaker":"Fr Stephen De Young","text":"Right. So that, that is associated with the pineal gland, which is sort of at the center of the brain. And the pineal gland is, is triggered by a bunch of things, both meditative spiritual practices and psychedelic drugs, we'll put it that way, drugs. So yeah, that, that, that trigger it. And this is again what we were talking about, that we would be talking about more in two weeks, that there are these physical structures associated with these spiritual realities, this material structures. And so then what you find in, in for example, ancient Greece, particularly in the mystery cults, you find all this imagery of the cornstalk. And this is corn in the ancient broader sense. So don't send your cards and letters. We're not talking about maize."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6366.16,"end":6366.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6366.56,"end":6368.44,"speaker":"Fr Stephen De Young","text":"In north and South America, it's."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6368.44,"end":6372.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, it's corn, as in Commonwealth English, meaning grain."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6372.88,"end":6429.55,"speaker":"Fr Stephen De Young","text":"Right. But so a stalk of grain with the head of grain at the top, or it works with a corn cob, if you want to think of it that way. It works with any kind of great, that kind of imagery. Right. Where you have this at the top and this is related to meditative processes in these mystery cults and in Eastern religion, where some form of energy was seen to travel up the spine to the pineal gland in order to activate this. And so in certain forms of yogic practice, this is what's referred to as the Kundalini serpent, which is. You've got to think of like a cobra that's standing up, right. With like, its head up. And the idea is that this is sort of this energy pattern or being that's coiled up in your bowel region, which sort of extends itself up your spine and then bites into your brain, sort of into your pineal gland and injects it."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6429.87,"end":6431.71,"speaker":"Fr Andrew Stephen Damick","text":"And this is supposed to be a good thing."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6432,"end":6463.59,"speaker":"Fr Stephen De Young","text":"Yes. Thereby opening your third eye and giving you access to the. To the spiritual world. Right. And as we mentioned, like psychedelic drugs. The same kind of idea, whether it's in some kind of native shamanistic practice like ayahuasca or what have you, or more modern, you know, you extract dmt. And so all of these things represent, by technique or by chemical means, a way of sort of spiritual bootstrapping. Right. Like shortcutting."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6463.83,"end":6464.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6464.27,"end":6466.95,"speaker":"Fr Stephen De Young","text":"Using the noose to access the spiritual world."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6467.11,"end":6501.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. And I mean, this is. In some ways, this is basically taking techni and trying to, you know, wedge it in to this. Right? Like. Like. Yes, yes. I could go through all kinds of. Of purification and asceticism and repentance, or I could just do drugs or whatever, one of these other techniques. And the idea is to kind of force it to make it happen. Right, right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6502.08,"end":6561.71,"speaker":"Fr Stephen De Young","text":"But inducing that experience in yourself, inducing access to the spiritual world does not mean. Does not entail that you're going to have the means by which to interpret, understand, prosper. Right. Operate within the spiritual world in a way that is healthy and not harmful to you. Because the way this is supposed to happen. Right. Is through the Holy Spirit that the Holy Spirit purifies the news. The Holy Spirit purifies the eyes of the heart. Right. And opens them. And in the light of the Holy Spirit. Right. There's this participation in the divine light that then allows Christ to be revealed to us. Right. And then the noose finds its proper object, which is seeing Christ. And so any kind of bootstrapping by nature does not involve the Holy Spirit. It involves other spirits."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6562.19,"end":6620.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, There are other spirits who are perfectly happy to help you open that third eye or whatever conception you want to use, you know, to. To. To open it up and give you access, but it gives them access to you. It's a mutual, it's a mutuality. You know, like we said, you, the noose receives thoughts. So if you're opening yourself up to other kinds of spirits, you're going to be receiving something from them. So. All right, we're going to talk a little bit more about that and we'll head out to one of my favorite places and that's out into the Woods. One of my favorite musicals is into the woods, by the way. Great show. Very related to all of these things, actually. Yeah, yeah. Spirits out in the woods. You know, almost every, almost every pagan culture has this idea that there's spirits that live it out in the woods."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6621.67,"end":6625.19,"speaker":"Fr Stephen De Young","text":"And even, you know, this is non pagan cultures. Yes, that's."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6625.19,"end":6733.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's what I was about to say is that, you know, Israel has this idea that out in the wilderness there are spirits out there. Right. Like this is a thing again, you know, so many of the sort of facts on the ground are agreed upon by both Israel and pagans. The question is interpretation of them and what exactly you do in relation to those, those beings. Yeah, so if you go out into the woods and you feel some, some, you know, something deeply that then makes you act in some way that you don't normally act. It was understood to be that you were under the influence of spirits. You know, if, if you are overcome with rage, you are filled with a spirit of rage. If you're overcome with, with lust, you're filled with a spirit, spirit of lust. I mean, everybody agreed on these ideas, you know, and this is, this is this idea that thoughts happen to you and, and there's even, and this was something that I, I didn't, I hadn't thought about. But it should be pretty obvious to me the, the, the Greek word evonia or eudaimoinia, if you want to sort of anglicize it, which means, you know, kind of blissful happiness in our modern sense of that. I mean, right there in the word, it means you have a good demon spirits, good spirits are there, you know, and so, so, you know, again, the idea of the human person as being this kind of impermeable, closed off fortress is just not a thing in ancient conceptions. And so it's not a thing in, in Christian theology. The human person is very permeable. Right. So a lot of what spiritual life is, is about guarding that permeability and using it appropriately."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6734.16,"end":6740.56,"speaker":"Fr Stephen De Young","text":"Right. And, and thoughts come into the noose from noetic beings."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6741.76,"end":6742.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6743.28,"end":6768.89,"speaker":"Fr Stephen De Young","text":"From spiritual beings. Right. Who bring them, put them there. And that means your inner monologue is not you. It's not you narrating your life. As much as we've been conditioned by television shows and the original kind of Blade Runner to think so, it is. It is not you. I don't really have the voice of."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6769.13,"end":6772.01,"speaker":"Fr Andrew Stephen Damick","text":"Morgan Freeman in my head narrating my life."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6772.65,"end":6851.79,"speaker":"Fr Stephen De Young","text":"No, no. Though that would be nice. Or just pay someone to follow you around and describe what you're doing. Right. So. So. So this is one of the big shifts we have to take. Right? That's. That's not you. So then. So then what do you have then? Right. What you have is a point of focus or a point of attention. Right? You have the. The point of focus or point of attention before which those thoughts enter. Right. And. And through which those thoughts enter. That's what you have to do. That's what consciousness is. Right? That's what. That's what your human consciousness is, and that's what's you. And so therefore, as you were giving the example with vision and turning your head. Right. We are not required to focus that point of focus on every thought that enters our head. Right? Right. That is not a de facto given. Right. And so this is the whole idea of guarding your thoughts. Right? Right. And asking God to guard our thoughts. Right. Placing a guard, not letting everything in."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6851.86,"end":6852.1,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6852.26,"end":6889.74,"speaker":"Fr Stephen De Young","text":"And then thoughts are sort of like seeds. Right. Even once they come in, you don't have to let them take root. And even if they have taken root, you don't have to let them keep growing. You could rip them up by the root and throw them out. Right. And this is what St. Paul is talking about in 2nd Corinthians 10:5, when he talks about taking every thought captive and making it obedient to Christ. Christ sort of capturing it. Right. But so doing that is a. Is a discipline that has to be developed. Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6889.74,"end":6890.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6890.46,"end":6980.4,"speaker":"Fr Stephen De Young","text":"And we, because as modern Western people, we're the only people in the history of the world who don't believe in the news. Everyone else always has understood that it's there since we don't think it's there since we don't believe it's there. And that's not how we understand things. We don't exercise it at all. We don't. We don't attempt to use it at all. And if. If we have, it's probably because we've dabbled or gotten involved in some kind of New Age practice or Eastern practice or Neopagan practice. Right? And that's been how we've. We've approached it, but we haven't approached it from this Christian perspective. And so getting from the point where we have this constant. Right. The stream of thoughts is not, again, my internal monologue or narration. It is this stream of thoughts flowing through my head. Right. Just like the cascade of images you see when you, you know, watch TikTok clips that go past it. Hello, fellow kids that go past super fast. Right. You have these thoughts, this constant stream running through your mind. Right. All the time. Right. And this is. This has been the great boon to the demonic powers of our contemporary era, is that we're constantly bombarded by all of these thoughts. This is why when you go and try to pray, there are all of these thoughts. Right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6980.4,"end":6980.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6980.64,"end":6995.22,"speaker":"Fr Stephen De Young","text":"Because they show up and start putting them in your head and giving you all of these things to think about. And so when you look at the prayer disciplines of the Orthodox Church, they're aimed at helping you exercise this flabby muscle, right?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6995.22,"end":6995.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":6995.82,"end":7000.46,"speaker":"Fr Stephen De Young","text":"They're aimed at working at this. So you have the prayer of a single thought."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7001.18,"end":7001.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7001.82,"end":7002.94,"speaker":"Fr Stephen De Young","text":"The Jesus prayer."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7003.1,"end":7009.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Monoloistos fhi, which is. That's the Greek phrase for that. Yeah."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7009.97,"end":7044.09,"speaker":"Fr Stephen De Young","text":"And you start there by training that point of focus that you have to focus on just that one thought and get rid of all the other ones. Right, Right. Run off all the other ones and train yourself to focus more and more on just that one. And the goal is eventually to get to the point where even that one goes away. Yeah. That's when you have contemplative prayer. This is hesychasm. This is the silence of hesychasm. Right. Of those thoughts being gone and being able to, purely with the news, come to see Christ."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7044.57,"end":7247.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, in terms of one's experience of the Christian life, you know, I've been sometimes asked, you know, why is it that Orthodox prayers, for instance, are so, you know, kind of overflowy and poetic and long and, you know, with all of these endless periodic sentences and, you know, oh, God, who? Comma, comma, comma, comma, comma, colon, please. Now, do you know, like, they go on like this, and I mean, often people give explanations like, well, you know, these come from the ancient world where people are just much more poetic, and that's the way they talk and that kind of thing. I think there's actually something much deeper going on, which is that in the way that this pattern presents itself, it's actually designed to be like a shepherd for your thoughts. Right. If your prayer functions in a purely utilitarian fashion, if that's all you've Got then there's a lot more space for your thoughts to get distracted by, you know, for you to receive distracting thoughts. And so, you know, if you look, if you just walk into an orthodox church, the way that the prayer works, the way the music works, the way that what you see works, the way all of it works together is multi vectored and designed to bring you all to Christ. Like it's designed to, you know, give you many good thoughts all at once. Right. And you can kind of follow any of them and, and get to Christ. And, and it's, you know, it's, it's why, like, you know, think about. So the opposite. What is the opposite of a, of an orthodox church? Well, it's Times Square, right? That's the, the opposite. It's, you know, it's being bombarded by advertisements and all kinds of other, you know, thoughts that are trying to extract something from you. But, but the way that orthodox life actually functions in terms of its prayer and so forth is, is not designed like, you know, you're going to have a thought when you attempt to pray that says just get this over with. Right. But why would you want to get it over with? Well, so you can move on to other ridiculous, distracting thoughts. That's why, you know, so, so the struggle is to focus. The struggle is to bring ourselves back to that single thought who is Christ, and to receive him. And I found in pastoral experience, especially when talking to people in confession, that explaining this and beginning to teach, I mean, I'm no expert at this, I just pass on the wisdom that I've been given. But in explaining this, beginning to teach that this is the way thoughts work and how you can actually be working on them is very liberating for people. And then there's a final goal, right? Well, I shouldn't say final, but there is a goal to this. Why do you want to receive the thoughts that are from God and turn away from, from evil thoughts? Because it actually does do something. Right, so, so what is that, Father?"}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7247.94,"end":7317.62,"speaker":"Fr Stephen De Young","text":"Right, so the nous is also, you know, transformational, Right. So to quote, to quote Aristotle again, as we've done a few times this evening, right. The mind in some sense becomes all things. Right? Is shaped and formed by all things. And so whatever we direct that point of attention at, that point of focus at, we are going to start to become like it. It is going to shape and transform us. Yeah. And so you're going to become what you focus on. And so this is intimately connected to the idea of theosis on the positive Side that we've talked about before, and also on the negative side, demonization that we've talked about about before on the podcast, that what you're. What you're focusing your gaze on, what you're seeing is going to be what you're going to become in the way in which you begin to change and shift. And you referenced, when we were talking about this before in Matthew 6, something that Christ says on this account."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7318.1,"end":7431.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Matthew 6, verses 22 and 23. The eye is the lamp of the body. So if your eye is healthy, your whole body will be full of light. But if your eye is bad, your whole body will be full of darkness. If then the light in you is darkness, how great is the darkness? So you get this idea of shining a light into something and it lights up the whole thing. It begins to glow sort of from within. It transforms that thing. And that's the way that the noose works, is if the light of God shines in you through the news, then you're lit up, you change, you become like him. You shine with his light. But if you receive instead the dark light of the demons, then you become like them. It actually does change you. There's sometimes people will say about various kinds of sins, well, you can look so long as you don't touch. I'm sorry, but looking is touching because looking is transformational now. I mean, there are circumstances under which you might say that and not mean quite the same thing. But if you look with lust or if you look with envy or if you look with anger, I mean, if you're looking is to bring that thought into you and to turn it around within yourself. You are being changed by that look. You're receiving something by that look. So that's the lesson, is that you are receiving something. It's not just what you touch. Looking is touching on a certain level. So, yeah, it's a great. I mean, I remember reading that passage from Matthew 6 and always kind of wondering what exactly is meant here. And then as I learned about what the noose is and how it functions and so forth, then it, pun fully intended, lit up. It lit up for me exactly the way that it works."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7431.98,"end":7493.96,"speaker":"Fr Stephen De Young","text":"Right. And this is why when we talked before about man being in the image of God, we talked about how that's kind of a verbal idea of imaging God. And so people have asked us questions about how you find in some of the fathers, they'll say that the nous. Right. Sometimes translated as reason. Right. Or the mind is the image of God, or they'll talk about the angels also being in the image of God in a sense, and this is what connects those concepts, right? Because the noose, the mind, is the capacity that we have, that we share with other noetic beings like angels, through which that imaging happens. This transformation we're talking about is that imaging, right? So this ability to image God. Right. Is through the noose, and that's how those are connected. But then, of course, on the flip side, as we said, you can also use the noose to image the demons. And do you want giants? Because that's how you get giants."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7493.96,"end":7782.39,"speaker":"Fr Andrew Stephen Damick","text":"That's exactly, yeah, yeah. There isn't an opposite to theosis, an opposite direction. So, yeah. Well, this is another mind bender, again, pun fully intended. But I think that even though these are difficult concepts and maybe new concepts for some folks, I think they're really, really important to wrestle with. And I believe that the reason why they're really important to wrestle with and to gain some master of these concepts is so that we can actually exercise who it is that we are. You know, what it is that we have in a much better way, much deeper, richer way, right. We went through the various kinds of knowledge according to the ancient world. And if you understand that all of those kinds of knowledge truly are knowledge and are worth pursuing in the good ways, Right. Then it opens up so much and it helps us actually to be more compassionate to other people. So, for instance, let's say someone pursues knowledge that is within that category of doksa, and they're really pursuing that. We should see that as being a good thing and not just say, well, you're just living in a world of subjective opinion. That's stuff you can't really count on that. No, it's true knowledge. But especially with regards to where we just finished, you know, I already said this before a little bit, but I feel that it genuinely bears repeating, which is if we understand that the thoughts that we have are being received and not internally generated, then that actually puts us not in the position of the tortured prisoner down somewhere in the dungeons of the castle who, you know, can't get away from himself. You know, he's the worst thing ever. But rather it puts us on the walls of the castle and we are there to guard the entrances. And, you know, when enemies come to the gates that we turn them away. If enemies come through for some reason, then we defeat them and send them on their way. And then when the king comes to the door, you open the doors to him. That's what the spiritual life consists of in a certain sense. And so all of the things that we do, whether it's our training in prayer, whether our training in asceticism, our training in corporate prayer, especially participating in the sacrifices of the church, going on pilgrimages, almsgiving, I mean, all of these things that are evangelism, all these things that are the good things that we are to do as Christians, all of these are designed to purify our nous and to train us to focus on the thoughts being given to us from God and from, you know, sometimes through his angels and saints, but ultimately from him and turning away from thoughts that come from the dark sources. And the more that we do that, then the more we become like him. And we don't have to feel trapped by our thoughts. We don't have to feel like there's some kind of fatal flaw that can never be overcome. I'm just broken. I'm just no good. I'm just born that way. We have the ability to refocus ourselves, and it takes practice. It takes a lot of practice doing it over and over again. We get comfortable receiving certain kinds of thoughts. We might like it, but then we get addicted, and then we get destroyed. So it's really a beautiful teaching and a liberating teaching and shows us the love of God for us that. You know, one of the most beautiful things that I ever heard was that every good thought that you receive is from the Lord. So think about that for a second. Think on that. Focus on that for a second. Every thought that you have that is about God's love for you, every thought that you have that is about doing something, caring for another person, every thought that you have that's about making beauty that is being sent to you from God. And so receive that thought, nurture that thought, integrate that thought into who you are, and you will become more like Him. Father."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":7784.95,"end":8102.98,"speaker":"Fr Stephen De Young","text":"Yeah, we live today. Probably anybody who's going to hear this podcast, at least in the society of the spectacle, where we are bombarded and surrounded continuously by this spectacle that's made up of propaganda and advertising and images and thoughts and ideas that are being continually projected at us. And it's not reality. We know it's not reality. That's often what makes it very attractive to us, because we, for various reasons, at various times, don't want to deal with reality. And so the circus, the spectacle, seems very attractive. And it's coming to us through TV and streaming services and the Internet and social media and podcasts other than the ones that Father Andrew and I do and a thousand other sources continuously. And the producers of the spectacle know full well that it's shaping us, that as we take it in, it is shaping us and it is changing us. And they're deliberate about it. It's changing us into something that is not as good as being human. It's changing us into consumers, people who want to not only consume goods and services and commodities and things out in the world, but who want to consume each other for our own gratification of our egos or our desires. It's making us into something worse. They don't understand the producers of it, that it's making us into something more like the demons, because they don't believe in demons, but they think it's making us into consumers and customers, that it's making us into something that's more useful to them. And so if we want to escape that, if we continue to just passively receive and absorb all this stuff, as we've been trained to do, to just sit and passively let things stream into us and over us, if we want that not to happen to us, we have to be very deliberate. We have to make a conscious decision about disciplining our minds and about disciplining our thoughts and about spending our time and our energy and our focus on things devoted to Christ and to God and to each other, rather than taking in the spectacle, because it's focusing on those things. It's our relationship to Christ mediated through prayer, mediated through each other, mediated through our church community, mediated through the holy icons, mediated through the Scriptures, mediated through all of these connections. These are the things that are going to transform us in a different direction and make us human, make us human again. There's a lot of things that we talk about on this podcast that we've lost from the ancient world. And one of the struggles I know people have because they ask us about it all the time is, well, how can we go back and look at the world that way? How can we go back and think of the world in that way? And yes, you can't flip a switch and just see the world the way an ancient person saw it, but you can, by drawing near to Christ, become human in the sense that they were human again and become a real person again in the sense that they were real persons and have real relationships with your fellow human beings the way they did, and draw close to Christ not only yourself, but together with your family and your community and have a real sense of community and that you're not alone, and a sense of community that's not just based on you consuming the same things, but based on what you're becoming more like Christ together. But we've got to get serious about it and we've got to actually do it and not just talk about it. And that means we've got to give up some things that come quick and easy, that make us feel better when we don't want to deal with some of the rougher stuff and the tougher stuff in life. We've got to stop taking the easy way out. Because it's not just alcohol and drugs that are easy ways out. It's the spectacle that surrounds us all the time. So that's that's my thought for tonight, is that once we understand that what we allow into our mind and what we entertain there changes us, then we should realize the dire danger that we're in living in modern Western culture."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8104.58,"end":8128.12,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Well, that is our show for tonight. Thank you everyone for listening. If you did not get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We do read everything, but we can't respond to everything and we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8132.36,"end":8134.92,"speaker":"Fr Stephen De Young","text":"Of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8135.88,"end":8146.05,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can like our page and join our discussion group. You can leave reviews and ratings everywhere, but most importantly, share the show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8146.77,"end":8154.05,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8154.69,"end":8157.25,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you always."}
{"episode_id":"LOS - #023 - 2021-07-08 - But We Have the Mind of Christ","start":8177.58,"end":8214.71,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
