{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":0.64,"end":65.3,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits. It is angels, demons and saints in our time. Many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":66.98,"end":88.35,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, bashers of baal. You are listening to the Lord of Spirits podcast and my co Host, the Very Reverend Doctor Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Day McNaught as many initials next to my name here in Emmaus, Pennsylvania. And we're live."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":88.35,"end":89.83,"speaker":"Fr Stephen De Young","text":"Don't give up. You can get there."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":92.15,"end":95.99,"speaker":"Fr Andrew Stephen Damick","text":"You have six master's degrees now. Five, six."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":96.47,"end":99.51,"speaker":"Fr Stephen De Young","text":"I haven't told you yet, but it looks like I might be getting another one this summer."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":99.83,"end":109.23,"speaker":"Fr Andrew Stephen Damick","text":"Okay. As one does on your way to your second PhD. So. Yeah, I mean, you are going to die much younger than I am, so it is possible I could catch up someday."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":109.23,"end":110.47,"speaker":"Fr Stephen De Young","text":"Probably. See, there you go."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":110.63,"end":111.11,"speaker":"Fr Andrew Stephen Damick","text":"Probably."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":111.51,"end":111.99,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":113.27,"end":171.58,"speaker":"Fr Andrew Stephen Damick","text":"So we are live and listener. If you're listening to us live, you can call us at 855-237-2346. That's 855 AF radio. And you can talk to us. And we're going to get your calls in the second half of the show and Matuska Trudy will be taking your calls. In the great feast of Theophany, Jesus Christ is baptized in the Jordan river by the forerunner. It's the inauguration of his public ministry, but it's a whole lot more. In previous episodes we've discussed baptism as well as the great blessing of water, which are of course both closely related to this feast. But tonight we're going to be discussing the feast itself. So it turns out that Theophany has something to do with Adam. Probably no big surprise, it might also not be a Big surprise to learn that it has something to do with water gods. But it may be a surprise to learn that it also has something to do with the Canaanite storm God, baal. So what is that all about, Father?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":172.98,"end":174.34,"speaker":"Fr Stephen De Young","text":"I don't know, man. You brought it up."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":174.58,"end":176.46,"speaker":"Fr Andrew Stephen Damick","text":"Oh, let me look it up real quick."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":176.46,"end":207.25,"speaker":"Fr Stephen De Young","text":"Oh, wait, hold on. Yeah. So, yeah, there is. So I don't know how constant the text of the Great Blessing of the Waters is, but at least as it's currently done in the Antiochian Archdiocese, there's this place in the text where you do this big, long prayer about all the accomplishments of Christ and then just sort of tacked onto the end of the prayer is, thou hast ended or destroyed the worship of baal."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":207.81,"end":209.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":209.97,"end":211.09,"speaker":"Fr Stephen De Young","text":"It's just thrown in there."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":212.93,"end":214.05,"speaker":"Fr Andrew Stephen Damick","text":"As everyone knows."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":214.69,"end":276.38,"speaker":"Fr Stephen De Young","text":"Right. And sort of centrally to the Great Blessing of the Water, the celebration of Theophany is, oh, by the way, no more BAAL worship. Right. And so that's not the only place BAAL comes up. Right? BAAL comes up in the Old Testament readings. BAAL comes up other places as well. And so, as you mentioned, we've. We've done a couple episodes in the past. We did talked about baptism. We did an episode on the Great Blessing of the waters. And so the thing is the feast of Theophany. And we'll talk a little bit more about this in the beginning of the second half, being one of the most ancient celebrations within Christianity, sort of the reality of it, there's a number of trajectories you could kind of take through it or."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":276.38,"end":292.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I. Angles, especially for being so old. I do pity the poor fools that do not have Theophany in their Christian life. It's so sad because it's such a. An amazing, amazing feast. So, yeah, come on, you guys, let's do Theophany."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":292.59,"end":307.55,"speaker":"Fr Stephen De Young","text":"Yeah. Epiphany kind of is a weak sister, right? Like, I mean, I like the magi as much as the next guy. Right. But it's just not the same."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":307.87,"end":312.67,"speaker":"Fr Andrew Stephen Damick","text":"They do have really cool names, though. Caspar, Melchior. Those are names."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":312.67,"end":414.06,"speaker":"Fr Stephen De Young","text":"Here's the beautiful thing about being orthodox in Southern Louisiana. You could both celebrate Theophany and then eat king cake. Hey, you don't have to choose. So, yeah. So there's a lot of different angles to come at the feast from. And you alluded in your introduction, which sometime at the last minute, I'm going to go in and, like, change your written introduction and see if I notice to see if you do a Ron Burgundy and just read whatever's there. Yeah. So the audience will find out as well at some point in the indeterminate future. But, yeah, you alluded to a couple of those. This. This prevalence, these repeated mentions of Adam and these repeated references to baal. And so while it may not immediately be apparent, it may be a little more apparent to longtime listeners of the podcast, may kind of have at least a vague idea of how those two are connected. Right. How Adam and BAAL might be connected in the Hebrew scriptures, in the Old Testament. But that's what we're going to start by getting into. Right? So we're going to talk a little bit about who BAAL is and then how he's connected to Adam, and then that'll take us into our discussion of the Feast of Theophany and what's going on with Christ's baptism."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":414.56,"end":416.88,"speaker":"Fr Andrew Stephen Damick","text":"I know there's somebody out there right now going, it's baal."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":418.08,"end":433.52,"speaker":"Fr Stephen De Young","text":"Yes, I know. Okay, so here's the thing. Let me cover this right now. Let me just cover this right now, because I know I've already said this many places, right, that I think one of the cringiest things in the world is when people refer to Jesus as Yeshua."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":434.56,"end":439.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or my favorite is when they add extra syllables like Yahoo. Yahushua, or whatever."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":439.16,"end":445.43,"speaker":"Fr Stephen De Young","text":"Well, yeah, but. Yeah, yeah. It's like, don't. Okay, you're speaking English."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":445.83,"end":448.63,"speaker":"Fr Andrew Stephen Damick","text":"You're right. There are English versions of these names."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":448.87,"end":476.54,"speaker":"Fr Stephen De Young","text":"Yes, yes. And this even goes for our Greek friends. I do not get this weird selectivity, right? Where, like, you know, the prophet Nathan is the prophet Nathan and the prophet Samuel is the prophet Samuel. But then all of a sudden, we've got, like, Elias and Elyseus because we can't say Elijah and Elisha now. Oh, man, we don't walk around talking about Petros, but we got to talk about Jakubos. Really, guys, Shots are being fired."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":476.54,"end":485.02,"speaker":"Fr Andrew Stephen Damick","text":"That's the one that really, I don't get. Yeah, it's like. And Peter, John, Andrew, Matthew, Jacobos. You know, I. I don't."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":485.02,"end":522,"speaker":"Fr Stephen De Young","text":"If you want to use all Greek names, cool. I totally vibe with that. Use all Greek names. Right? Or I prefer my preference. I use all standard English pronunciations, right? So I say BAAL apropos this question, but you got to pick one, man. You can't just be bouncing around and, like, you know, well, this day I'm going to say in Aramaic, this one I'm going to say, you know, so, yes, it is technically baal, two syllables. That is technically Aramaic. That's actually the Aramaic pronunciation, not the original Phoenician pronunciation."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":523.2,"end":524.96,"speaker":"Fr Andrew Stephen Damick","text":"What is it in the original Phoenician?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":525.2,"end":526.32,"speaker":"Fr Stephen De Young","text":"It's closer to bel."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":528,"end":532.4,"speaker":"Fr Andrew Stephen Damick","text":"So the Hellenization then is actually a little bit closer to that."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":532.72,"end":559.23,"speaker":"Fr Stephen De Young","text":"Yeah. The first A is sort of a shvael. Yeah. And so that's why it ends up getting shortened like in Babylonian to bel. And in some of the languages it gets shortened to bell. Yeah. And so while that is on one hand a word. Right? Yeah, it's just a common word."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":559.31,"end":559.87,"speaker":"Fr Andrew Stephen Damick","text":"Lord."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":559.87,"end":562.51,"speaker":"Fr Stephen De Young","text":"Yeah, Lord, master or husband."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":563.39,"end":564.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":565.47,"end":578.45,"speaker":"Fr Stephen De Young","text":"Which already tells you something about the ancient Near East. Right, so that is a title. That was a. That's a title just used in general. Right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":578.45,"end":578.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":578.93,"end":593.57,"speaker":"Fr Stephen De Young","text":"It's a word that's used in common everyday speech. It also becomes a title that gets attached in the ancient near east in the pagan world to a whole bunch of different deities."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":594.45,"end":594.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":595.25,"end":681.13,"speaker":"Fr Stephen De Young","text":"Right. So you could say BAAL and then the name of a pagan God. It also, as we've talked about before, like BAAL Pa or in numbers being a good example, you have the, the BAAL of a particular place. Yeah, right. To refer to a spirit, a God associated with that place. But it shows up in surprising places. Right. Like if you've, if you've looked at the history of later Rabbinic Judaism, you've heard of the BAAL Shem Tov, right. You're like, why does he have BAAL in front of his name? They're just using it to mean master. Right, right. To refer to this rabbi the way Christian churches, like in Syriac churches they use mar or more, which has basically the same meaning or say, or villadica or. Right, whatever. So it could have this many valences. I don't want to go too down for too far down this rabbit troll, but one of the my prophets, there's a phrase where, where God says, before you knew me as. As baal, but now you will know me as. Right as. And of course our 19th century German friends. Aha. See, there's the tell. There's the one they missed. See?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":682.9,"end":683.14,"speaker":"John Maddox","text":"Yes."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":683.14,"end":684.9,"speaker":"Fr Andrew Stephen Damick","text":"Our terrible editors strike again."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":684.98,"end":695.82,"speaker":"Fr Stephen De Young","text":"Yes. They used to worship baal. And of course it's before you knew me as lord and master. Now you will know me in more intimate terms. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":695.82,"end":703.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, we have someone tuning in from Bavaria, from Munich actually. So speaking of 19th century Germans, we have a 21st century German."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":703.94,"end":710.83,"speaker":"Fr Stephen De Young","text":"I'm hoping it's not a 19th century German. It would be amazing if Hegel was somehow listening from sort of a."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":710.99,"end":713.31,"speaker":"Fr Andrew Stephen Damick","text":"Some sort of vampiric appearance."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":713.79,"end":745.52,"speaker":"Fr Stephen De Young","text":"Yes. Or. Yeah, some kind of machine that allows him to hear broadcast signals through time. Nikola Tesla would be involved somehow too. Right. Come up with a really good episode of Doctor who here, like if we worked on it. So there is that general usage of the word, but that. That name is also used as a proper name for a particular God in certain cultures."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":745.92,"end":746.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":748.8,"end":968.59,"speaker":"Fr Stephen De Young","text":"And probably the. Not. Probably the most significant culture that uses that name for a particular God, biblically, is the Phoenician culture to the immediate north Right. Of. Of Judah and Israel and what's now Lebanon, basically. Yeah. And this is because this is where sort of the cross currents come in. The BAAL who's being referred to in the Bible is that baal, The Bale of the BAAL cycle that we've talked about a few times on the show was found at Ugarit. Ugarit is in what's now Lebanon. The BAAL cycle was found there. That's the BAAL we're talking about. Right. So not any of the other various Baals. Baals is used in the plural in places in the Old Testament, but we're referring to this one, this particular one, the baal. Yeah, the Phoenician BAAL who is the son of El. Right. And similar to how BAAL could just be lord or master, El is also just the word for God. Right. As a lot of people probably already know. But that word is also used within to refer to a particular God who is the father of baal. So we've talked before on the show several times about the BAAL cycle and about BAAL in the course of that, and Baal's various exploits in which he totally wins several battles and then reacts as if he lost them. And we've talked about how in a couple of places in the Old Testament, that Baal's story, as it is told by the Phoenicians and other neighboring countries and as it is told in the BAAL cycle gets sort of reworked or corrected. The record gets corrected by the Hebrew scriptures which identify the. The BAAL figure with. With the devil. What, with who? The one who comes to be called the devil. And so baal, Right. We're not going to go through everything in super detail that we've gone over in the past again. But if you remember, BAAL is sort of the rebellious son of El, and El is this sort of remote, most high God, sort of a prototypical example of it. We've talked about this before on the show how within pagan cultures, sort of parallel to the story that's told in the story of the Tower of Babel, there's an observable phenomenon in cultures across the world that whoever was seen as the most high God above the other gods kind of drifts off into the background. And it is sort of the lower gods usually provided over, presided over by a God who is seen as being the son of that most high God, are the ones who are worshipped."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":969.31,"end":983.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah. So obvious parallel. Like in Norse culture, Odin is considered to be the most high God, but it's Thor that is really, as we know from archaeology and stuff, is the one who's really being worshipped a lot."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":985.24,"end":1111.28,"speaker":"Fr Stephen De Young","text":"Right, right. And the same thing is true, though we're less aware of it unless you dig into direct sources. Like you read Plato, for example, and you read Hesiod, Cronus is still lurking in the background in Greek religion with Zeus as his son. Right. So Plato talks about the age of Cronus and these things, like sort of before he withdrew. So he's still lurking in the background there, but it's his son Zeus who's. Who everybody is paying attention to. Right. You don't find. I mean, there. There are a few here, there, but you don't find primarily temples to Cronus. Right, right. You find temples to Zeus. And the same thing is true here. You don't find a lot of temples to El, you find temples to baal. And there are depictions of El within those. Right. Of Baal's father, who's just depicted as this sort of old man. And in the BAAL cycle and other places, he really is depicted as this kind of useless old man. We've talked before, I know, about Baal's sister wife threatening to crack his skull open if he didn't make BAAL a temple. Right, right. Like, he's not. He's not portrayed as sort of this majestic father of the God's most high God figure. It's again, it's like this, this doddering old fool, and Baal's the one who's making things happen. Right. So there's this element of rebelliousness even between BAAL and El, even though Baal's rebellion in the BAAL cycle actually is what makes El technically the most high God. There's. It's not. He's not this submissive, dutiful sort of son carrying out El's will on the Earth or something. Quite the opposite."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1111.52,"end":1112,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1113.2,"end":1174.2,"speaker":"Fr Stephen De Young","text":"And of course, we've talked about that sort of revolution that previously Yam the sea and Nahar the river. Right. Where the most high God and his son respectively so it's King Yom and Prince Nahar. Right. And they get unseated in the succession myth by Baal's rebellion. Other things that figure prominently in that story are his defeat of Lotan, AKA Leviathan, the great sea monster. Right. Because these are the symbols of chaos. Right. And then BAAL is depicted as the one because he's a storm God who rides upon the clouds of heaven, who has wields the thunderbolt. Right. It's a symbol of power, all of these things. Right. So we've talked about all that before, multiple times, I think."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1174.2,"end":1175.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1175.68,"end":1227.3,"speaker":"Fr Stephen De Young","text":"So what we wanted to now talk about a little more this time is we're going to come at this from another angle and we're going to talk about this from the perspective not so much of the myth of baal, the BAAL cycle, the BAAL story, and comparing or contrasting that with the story of the devil, as we have before. But we're going to come at this more from the perspective of BAAL worship. Right. The phenomenon of BAAL worship in the Levant. Right. In the ancient near east, as it affects Israel. Right. Because, you know, our starting point there, it's the worship of BAAL that ceases. Right. Worship."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1228.18,"end":1238.65,"speaker":"Fr Andrew Stephen Damick","text":"Not just, you know, people forget the stories or whatever. Although that does happen. Right, right. Eventually the actual stories get forgotten until the 20th century because it was the."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1238.65,"end":1240.89,"speaker":"Fr Stephen De Young","text":"Ritual worship that was keeping those stories alive."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1241.53,"end":1242.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1242.25,"end":1296.24,"speaker":"Fr Stephen De Young","text":"And so now it's mythology. Now we look back on it and dissect it, but it's not alive anymore. And so one way to take into that is to sort of briefly revisit those two passages that I mentioned, one of them in particular, but we're going to mention the other one where the prophets, the Old Testament prophets, make this connection between the devil and BAAL and the context of those. So the one mainly we want to focus on here from this other angle is Ezekiel, chapter 28. And this is the one that is framed as an oracle against the king of tire. T Y R E. Not the king of tires."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1296.72,"end":1297.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1297.04,"end":1300.48,"speaker":"Fr Stephen De Young","text":"Not your local tires for 60 bucks down the road. That's right, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1301.92,"end":1316.25,"speaker":"Fr Andrew Stephen Damick","text":"Discount tires. Although, you know, it's. It is T Y R E the city. Is that right? But if you're in the uk, that is how you spell tire, like on your car with the Y. So all of our British listeners are like, what? What?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1316.41,"end":1318.73,"speaker":"Fr Stephen De Young","text":"We definitely need to disambiguate for them then."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1319.13,"end":1319.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1325.37,"end":1361.12,"speaker":"Fr Stephen De Young","text":"So within that oracle, and I believe we mentioned this when we, when we've gone through it before, there's this differentiation that's made between the King of Tyre, the Melech. Right. Of Tyre in Hebrew, and the Prince of Tyre, or Sar. And that word sar, that's translated prince, really is a different thing than king. Right. So the ancient near east, the word king carries with it, as we've talked about many times, the idea of, frankly, divinity."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1362.16,"end":1363.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1365.39,"end":1376.35,"speaker":"Fr Stephen De Young","text":"You know, the God king. Right. That whole idea. Whereas the word here that's translated prince can mean like chieftain, leader."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1377.15,"end":1377.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1377.51,"end":1500.72,"speaker":"Fr Stephen De Young","text":"The big boss of a group. Right. Head man is really the core of it. Right. Is that. It's like the head man, Right. The guy in charge. Right. And as I believe we've talked about before, that differentiation is important because there is this divine figure who fell from among the stones in Eden, right, called the King of Tyre, who's being talked about sometimes. And then there's this Prince of Tyre who's talked about in very material human terms, which is the human guy who calls himself the King of Tyre. Yeah, Right. So that language is being used to sort of demote, from the perspective of your Phoenician worldview, to demote the King of Tyre from divinity, number one, and then number two, to say that the spiritual power, who they're worshiping is baal. The spiritual power that stands behind Tyre is this spirit that seeks the destruction of humankind who's already gone one round with God and lost very badly. Right. And so the prophecy then is talking about how the Prince of Tyre, right, the human king will follow. If he keeps following baal, he will follow BAAL right into the underworld. Right. So to talk a little more about Tyre and Sidon, because they come up frequently in the Old Testament and even a couple times in the New Testament, these are massively important cities in the ancient world. We haven't talked a lot about Phoenicia. We've talked a lot about Babylon. We've talked a lot about some other civilizations, Sumer and Akkad and Egypt. And because we haven't really talked about."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1500.72,"end":1505.52,"speaker":"Fr Andrew Stephen Damick","text":"The Phoenicians yet, these are cities up on the Lebanese seacoast. Because the Phoenicians."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1505.52,"end":1506.28,"speaker":"Fr Stephen De Young","text":"Yeah, they're still there."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1506.68,"end":1514.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, they're still there. The Phoenicians are sea traders. This is their big thing. They found Carthage, like the Carthaginian Empire."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1515.08,"end":1541.41,"speaker":"Fr Stephen De Young","text":"Eventually. Yeah. We have to disambiguate here, Right. A little bit. Because if people think about the Phoenicians and even I don't think about the Phoenicians every day, Roman Empire, sure. But Phoenicians know, they tend to think about Hannibal, Carthage, the Punic wars with Rome. Obviously that's much later."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1541.65,"end":1542.33,"speaker":"Fr Andrew Stephen Damick","text":"This is way."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1542.33,"end":1542.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1542.61,"end":1543.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1543.09,"end":1550.69,"speaker":"Fr Stephen De Young","text":"It's a much earlier stage. Right. So this is the period when Carthage is like a trading outpost in North Africa."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1551.93,"end":1552.33,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1552.81,"end":1563.77,"speaker":"Fr Stephen De Young","text":"Because what Mediterranean trade meant at this point in history. Right. That they didn't have the capacity to sail like across the Mediterranean, at least not on purpose."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1563.93,"end":1565.81,"speaker":"Fr Andrew Stephen Damick","text":"No. It was always coastal sailing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1565.81,"end":1640.36,"speaker":"Fr Stephen De Young","text":"You could. You could get blown off course and get lucky. Right. Maybe. But the intent was always you went around the coast, which means you had to have ports and stops sort of all along the coast because you have to put your boat in to birth every so often. Right. And to keep. Right. Then from those trade ports, caravans would follow trade routes all over the place. Right. So all through North Africa up into various parts of Europe. Right. Moving eastward from what's now Lebanon across the Fertile Crescent. Right. Egypt, all of these places. And so Phoenicia is really the first empire, not the first empire that does trade. Right. Because we've talked before about, like, Hammurabi's Babylonian empire, the original Babylonian empire is doing trade all over. Not just what we think of as the known world at the time, but I mean, we've talked about how they had things going from Afghanistan to Cyprus to. But they are the first empire that is an empire of trade."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1641.4,"end":1645.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not really based on, like, conquering big tracts of land."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1646.2,"end":1680.58,"speaker":"Fr Stephen De Young","text":"Right. They're not going and con. It's not about conquering your neighbors like the previous. And frankly, most of the subsequent empires are. Right. It is at this point especially. Right. They later will see. That's why I wanted to differentiate. By the time Carthage really becomes their focal capital, you have a Phoenician empire in North Africa that has become a military power, as is obvious from Hannibal. Right. And so things have changed. But at this stage, it is purely a trade empire."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1680.74,"end":1683.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're. They're just super good merchants."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1683.38,"end":1687.3,"speaker":"Fr Stephen De Young","text":"Yeah. So more like the Ferengi than the Klingons. Right. Like."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1689.54,"end":1690.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1690.1,"end":1690.62,"speaker":"Fr Stephen De Young","text":"And that's."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1690.62,"end":1696.46,"speaker":"Fr Andrew Stephen Damick","text":"I mean, and this is why they have to invent the Alphabet. Right. Because you need written records if you're going to really do trade."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1697.1,"end":1723.33,"speaker":"Fr Stephen De Young","text":"Right. And, and, and a means. And a means to communicate. Right. Because people don't realize, like in, in revised cuneiform languages, like the revised ones, the, the ones that they teach you first. If you decide you want to learn to read cuneiform, there are between 80 and 90 symbols that you have to learn."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1723.81,"end":1729.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they're not easy to make. Like each one takes multiple little indentations in clay."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1729.33,"end":1731.81,"speaker":"Fr Stephen De Young","text":"In clay. And that's your only writing medium."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1732.69,"end":1733.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Alphabet is just."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1733.85,"end":1735.49,"speaker":"Fr Stephen De Young","text":"Can't write Cadeiform on parchment."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1735.65,"end":1743.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. I mean, Alphabet is just way easier to use. Much more sort of fungible, as it were, in terms of text."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1744.69,"end":1754.49,"speaker":"Fr Stephen De Young","text":"Right. And can be adapted to other languages. Right. Meaning famously, the Greeks can take it."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1755.05,"end":1755.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1756.01,"end":1760.73,"speaker":"Fr Stephen De Young","text":"And take their spoken language and write it using the Phoenician Alphabet."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1761.61,"end":1762.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1762.25,"end":1766.01,"speaker":"Fr Stephen De Young","text":"With a couple of adaptations for sounds they don't have. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1768.33,"end":1768.73,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1768.81,"end":1790.15,"speaker":"Fr Stephen De Young","text":"And that's, you know, for folks who don't know. Right. In most Aramaic languages, you make something definite. You put the definite article in front of it. The. By adding an Aleph. An A. That's not totally accurate, but."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1791.91,"end":1793.27,"speaker":"Fr Andrew Stephen Damick","text":"That'S like in Arabic there's."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1793.27,"end":1794.87,"speaker":"Fr Stephen De Young","text":"It's a simplification, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1794.87,"end":1795.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1795.79,"end":1798.39,"speaker":"Fr Stephen De Young","text":"You put an ah sound, Right. An olive letter."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1798.39,"end":1798.67,"speaker":"Fr Andrew Stephen Damick","text":"Olive."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1798.67,"end":1840.08,"speaker":"Fr Stephen De Young","text":"It's an ah sound roughly at the end of the word. Right. And so this is where even the names of the Greek letters come from. So you have Aleph, ah becomes alpha, beta, Dalet, ah becomes delta. Right. And on and on. So if you know the Greek Alphabet, you know some Semitic languages, that's how you get from one to the other. But yeah, so it's because it's a trade empire. If you have an empire of conquest, you just sort of impose your language upon the. Right. The people you've just conquered. It's like, well, you better learn. Right. Or you just use it to exclude them."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1840.48,"end":1843.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but in this case, they want money, they want the commodities."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1844.32,"end":1871.27,"speaker":"Fr Stephen De Young","text":"But with a trade empire, where you're wanting to make partners, partnerships and ongoing cooperative partnerships, Right. Communication becomes key. That's part of what leads to, of creating the Alphabet. But you can see within that ethos then how that connects to their worship of baal."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1872.15,"end":1876.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because BAAL is the guy who beats up the God of the seas."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1877.03,"end":1883.51,"speaker":"Fr Stephen De Young","text":"The sea. Right. He tames and controls the seas, which is where they're making their living. And BAAL is a storm God."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1884.45,"end":1885.73,"speaker":"Fr Andrew Stephen Damick","text":"Super important for sailors."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1885.97,"end":1990.19,"speaker":"Fr Stephen De Young","text":"And storms are what you're worried about when you're out there with a boat full of trade goods on the sea. Right. So this is why BAAL becomes so. And you've got. So you've got BAAL in the positive, quote, unquote, positive sense, like in the BAAL cycle, being praised for his defeat, his conquering of the sea and the river. Right. And then on the negative side, you want to. He's a storm God. You want to appease him so he doesn't smack you around with thunderbolts and winds and rain and sink your battleship. So there is this integral relationship between their worship and their culture in this regard. And so Ezekiel's prophecy. You could go read Ezekiel 28 again. We won't read it all right now, but you can go read it again. You can see how this is intertwined together, right? It's intertwined together for them. There's not this separation between, well, like this is our religion and then we have our business dealings over here and then politics and then these other things. Right. This is all intertwined for them. And so the oracle against them. Right. Calling them to repent, that oracle, it's all intertwined within it. The other place that we'll just mention if people. I go back to and look at where the figure of Baal, or at least a very Baal, a Baal, is brought into parallel with the devil is Isaiah 14."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":1990.91,"end":2000,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's the Lucifer passage in Latin. Yeah, in Latin where he says he's gonna set his throne above the stars and so forth."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2000.24,"end":2001.44,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2002.48,"end":2002.88,"speaker":"John Maddox","text":"So."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2006.08,"end":2037.59,"speaker":"Fr Stephen De Young","text":"The way in which BAAL primarily appeal appears in terms of volume of text dealing with baal, Right. In. In the Hebrew Bible in the Old Testament is actually not about the devil. Right. You may have noticed that there's not a ton about the devil himself in the Hebrew Bible of the Old Testament. Yeah, there's some. We just gave two examples. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2037.75,"end":2038.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2039.03,"end":2049.43,"speaker":"Fr Stephen De Young","text":"And we're going to come back to another example that you're probably all expecting here in a little bit. But the primary place where BAAL comes up is actually, again, in the context of BAAL worship and BAAL worshipers."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2049.83,"end":2053.99,"speaker":"Fr Andrew Stephen Damick","text":"And because this is actually on the ground, this is a live concern. It's part of life."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2054.75,"end":2124.85,"speaker":"Fr Stephen De Young","text":"Right, right. And that comes into play through the Omrid dynasty in the Northern kingdom of Israel. And we need to, I feel the need at least to constantly reframe for us the history of Israel as it is actually presented in the Old Testament and actually was in the world. Right. In the sense that I don't want to go down this road again, but as we've talked about in our episodes on how to read the Bible, the knee jerk reaction to sort of Protestant liberalism and the denial of the historicity of the Old Testament was this knee jerk response of, no, the Old Testament is objective history. Right. The objective there being the problem. Right. It is modern history. It is objective, modern scientific history."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2125.65,"end":2126.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2127.65,"end":2165.57,"speaker":"Fr Stephen De Young","text":"And it's clearly, it's clearly not. But what do I mean by that? How does that affect this? Folks who haven't studied the ancient near east and the archeology in the history probably think that the most famous and prominent king of Israel in the world was Solomon. Right. Especially if you grew up or first read the Bible within that kind of context where it's like, no, this is like this literal, objective, scientific, modern history. That is simply not true."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2166.05,"end":2172.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's not what archaeological record shows. It's not what we actually find in the records of other cultures."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2173.65,"end":2174.05,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2175.41,"end":2176.93,"speaker":"Fr Andrew Stephen Damick","text":"So big deal for them."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2177.33,"end":2191.75,"speaker":"Fr Stephen De Young","text":"That's not the reality. But that's not a problem if you actually understand what's going on in what we now call the historical books, what were originally called the former prophets."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2195.03,"end":2195.43,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2195.59,"end":2216.64,"speaker":"Fr Stephen De Young","text":"The Hebrew Bible in the Christian Old Testament. And that's that we are being given a very deliberate perspective, God's perspective on these people and these times and what happens. And we're reminded of that over and over and over again. Right. Pretty much every king at the end of the description is as for everything else he did."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2217.52,"end":2219.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is it not written in the chronicles?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2219.8,"end":2233.28,"speaker":"Fr Stephen De Young","text":"Is it not written in the annals of the kings of Israel, Judah. Right. Because they had annals, they had chroniclers. Right. Who were writing down all the great things that all those kings did. Right. People kept track of that stuff."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2233.44,"end":2238.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you're looking for the big list of all the things that these guys did, it's written somewhere else. That's not what this book is about."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2238.64,"end":2272.35,"speaker":"Fr Stephen De Young","text":"Yeah, that's not what it's about. Right. And exhibit A of this is actually the Omride dynasty that we're about to talk about in more detail. Omri, who's the founder of the Omride dynasty, who basically comes to power in the northern kingdom of Israel over the 10 times through assassination, is simply the most prominent king of Israel or Judah in the eyes of the surrounding world."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2274.19,"end":2274.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2275.07,"end":2303.7,"speaker":"Fr Stephen De Young","text":"Archeologically, he's. Israel is referred to as Beit Omri, the House of Omri, pretty much for the rest of the time it exists. Which isn't long. Right. Let me read. I think it's important to reiterate that too. There was a political entity called Israel in the ancient near east for a grand total of about 270 years."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2304.82,"end":2306.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It wasn't like millennia long."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2307.06,"end":2322.67,"speaker":"Fr Stephen De Young","text":"Yes. Other than that 270 year period, 3,000 years ago, the only other time there's been a nation in the world called Israel has been very recently."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2323.47,"end":2323.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2324.75,"end":2329.39,"speaker":"Fr Stephen De Young","text":"We have to frame that. Right. Judah lasted a little longer after the split."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2330.35,"end":2330.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2330.83,"end":2369.98,"speaker":"Fr Stephen De Young","text":"Right. But even if you add Up. If we. If we start with Saul and we end with the Babylonian exile. Right? When Judah is taken into exile, no more kings. Yeah. We're dealing with a little over 400 years, right? So, like, the US is getting into this kind of territory in terms of how long it's existed. Right. It's not like, say, France or England existed for millennia. Excuse me."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2372.06,"end":2378.14,"speaker":"Fr Andrew Stephen Damick","text":"Omri is the king of the Northern Kingdom, right? He's not a. Yeah, he's not a Davidic king."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2378.54,"end":2401.3,"speaker":"Fr Stephen De Young","text":"Right. But Omri, despite being super important, right. You could see his name on monuments at the British Museum. Right. And it's not his name because he made the monuments. It's like monuments of his descendants as King Jehu from the house of Omri, coming and paying tribute to the Assyrians."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2402.18,"end":2402.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2404.74,"end":2417.5,"speaker":"Fr Stephen De Young","text":"He's the one who. And this part is recorded in the Bible, he's the one who basically begins the establishment of the capital of the Northern Kingdom at Samaria. He builds up."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2417.5,"end":2436.72,"speaker":"Fr Andrew Stephen Damick","text":"He shows up in first Kings, chapter 16, and then he Himself. Yeah, he himself. You know, it's a few more than that. 16, 16 through. And then he dies in verse 28. And then you get. Sorry, yeah. Then you get Ahab after that."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2436.72,"end":2451.2,"speaker":"Fr Stephen De Young","text":"Right? So he gets 12 verses basically saying he's bad, Right? Wicked, wicked bad buys the hill where Samaria is built. Very bad. Right. And as for the other things he did, are they not written? Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2451.35,"end":2452.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's 27."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2453.03,"end":2477.19,"speaker":"Fr Stephen De Young","text":"Right, right. Whereas, you know, David, where we finally found a couple places where his names are mentioned, because his name is mentioned. Because until then, all of our 19th century German friends had assured us he was like King Arthur and was mythical. Obviously has the better part of two books of the Bible about him."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2477.71,"end":2479.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2479.95,"end":2539.33,"speaker":"Fr Stephen De Young","text":"Right. Solomon obviously has a great deal more. Right. So those who are important in the sight of God and those who are important in the sight of the world are not always the same people. Right. And the scriptures are talking to us about the former, not the latter. Right. So Omri, though, is this. This massive figure who really establishes the dynasties before his in the Northern Kingdom, generally last two generations. And then when I say assassination, it's not just, oh, somebody assassinates the king and then takes over. You had to assassinate the king's whole family. Yeah, right. You had to kill the king, all his wives, all this, the children of those wives. Right, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2539.33,"end":2541.09,"speaker":"Fr Andrew Stephen Damick","text":"Because otherwise someone could show up and."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2541.09,"end":2632.07,"speaker":"Fr Stephen De Young","text":"Say, hey, as a rival claimant. So you had to destroy that dynasty so that it could not go on. Right. One of the female descendants of this line, Athaliah is going to try to do that in Judah. He's going to try to wipe out the Davidic line that way in her role as queen mother in the southern kingdom of Judah. But so Omri, part of how he establishes himself and establishes the northern kingdom of Israel is by making trade agreements. Right. There were a decent amount of natural resources in the northern kingdom, but not on par with Phoenicia, whether we're talking about cedar wood or whether we're talking about their shipping empire, this kind of thing. But Israel occupies this important place in the Levant at the end of the Fertile Crescent, where people going to Egypt. Right. It's along trade routes. And so this gives him opportunities to make deals and to make alliances to bolster the northern kingdom's power. And one of those major alliances, the most major of those alliances, because Ahab, his son, is going to be his heir. He marries Ahab to the daughter of the king of Sidon."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2633.44,"end":2635.92,"speaker":"Fr Andrew Stephen Damick","text":"And her name is Jezebel."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2636.48,"end":2653.36,"speaker":"Fr Stephen De Young","text":"Yes, her name is Jezebel. So I should mention we mentioned Tyre. Sidon. Tyre and Sidon were sort of the twin capitals of Phoenicia at this point. I say twin capitals because Tyre was, at this point in history, on an island."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2654.32,"end":2655.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a peninsula now."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2656.48,"end":2697.37,"speaker":"Fr Stephen De Young","text":"Yes, but it was on an island. And so it was the military capital because it was obviously very defensible. Right. Kind of hard to lay siege to an island, especially when you're competing against a naval power and a shipping power. Sidon was on the mainland, so that was sort of the business capital. Right. Where people were most of the time. Right. When. When they weren't under attack. Tyre was considered to be unconquerable until Alexander the Great conquered it, which he did by turning it into a peninsula, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2697.53,"end":2698.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2699.69,"end":2704.49,"speaker":"Fr Stephen De Young","text":"By getting a lot of slave labor to build him a land bridge."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2704.97,"end":2720.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the two cities, by the way, everybody, are just about. If you were driving about 35 minutes apart, like, Sidon is up the coast, and then Tyre, you can see, if you look at a modern map, you can see how it sticks out into the water."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2722.06,"end":2742.3,"speaker":"Fr Stephen De Young","text":"Yeah. So at this time, a nice fellow named Ethobaal is the. The priest king of Sidon, Jezebel. And that bell is baal. Baal."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2742.94,"end":2748.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. She's got a theophoric name, a name with a God tucked away in there."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2748.52,"end":2806.64,"speaker":"Fr Stephen De Young","text":"Yeah. And Etobaal is actually known from other places. His name is found in Greek chronicles. This is a sort of known guy. Menander mentions him and calls him Ithobalos. Who he says was a priest of Astarte, who, if you remember, is Baal's sister wife. So this is he. He is relatively known from other places. Phoenician King Jezebel's name is probably fiddled with. So we've talked before about, I think on the show about how the ancient Israelites and Hebrew speakers liked to fiddle with other people's titles and names."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2807.2,"end":2809.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Insult them typically."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2809.52,"end":2816.64,"speaker":"Fr Stephen De Young","text":"Yes. So there's a king who's an enemy of Israel in the Old Testament named Kushan Rishatayim from Mahanaharayam."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2819.12,"end":2821.92,"speaker":"Fr Andrew Stephen Damick","text":"I feel like this would be the beginning of a rap or something by you."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2822,"end":2879.17,"speaker":"Fr Stephen De Young","text":"Yeah, Say that five times fast. Mahanaharayam. Right. Naharayam. You might have picked up Nahar. Right. Mahanaharayam is a way referring to Mesopotamia between the rivers. But Kushan Rishitayam is, we could be pretty sure, not what his mom named him because it means sort of double, dark, evil one. Probably not what you'd name your kid. Right. I mean, maybe today some people would, but not. Not so much in the past. So this is very clearly like he had some name similar to that, and he was fiddled with it a little to mean that. And that's what they called him. We've talked about how the title, the Phoenician title, BAAL Zabul, which means like great Lord BAAL or. Or High Lord exalted baal, they turned into Beelzebub."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2879.75,"end":2880.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lord of the."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2880.67,"end":2881.99,"speaker":"Fr Stephen De Young","text":"Lord of the flies. Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2882.07,"end":2887.87,"speaker":"Fr Andrew Stephen Damick","text":"You know, in other words, Lord of the stuff that flies like to land on, congregate about. Wink, wink."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2887.87,"end":2888.19,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2888.19,"end":2888.95,"speaker":"Fr Andrew Stephen Damick","text":"Say no more."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2891.03,"end":2902.79,"speaker":"Fr Stephen De Young","text":"So that they did this. So it looks like Jezebel. Right. Because Jezebel means. In Hebrew means something like, where is baal?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2904.23,"end":2905.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where's your guy?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2906.32,"end":2983.16,"speaker":"Fr Stephen De Young","text":"Yeah. Where is Bail now? Yeah. My surmise is that there are different people who have different views of this because, you know, journal articles have to be written and dissertations have to be published. But I think it's the fiddling is, it was probably something like BAAL is there. There is Bail, the place of Bail, the place where Bail is. Something like that was her actual name and they changed it to where is he? Right. Also worth noting, though, as we mentioned with the different uses of the word baal, this could also mean where is your husband? Right. And in terms of the story of Ahab, who is not the one who wears the pants in the family, shall we say, throughout the. What we see in the scriptures about Ahab, there may be something There, too. Also worth thinking about Saint Photimi, the Samaritan woman, the woman from Samaria, who Christ says, where is your husband?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2985,"end":2985.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2986.25,"end":2991.77,"speaker":"Fr Stephen De Young","text":"And if he was speaking in Aramaic, what would he have said? Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2992.01,"end":2992.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2993.37,"end":2999.53,"speaker":"Fr Stephen De Young","text":"So you think about that, too. There's a free sermon for after Pascha to all the priests listening."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":2999.53,"end":3000.65,"speaker":"Fr Andrew Stephen Damick","text":"There you go, guys."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3000.73,"end":3061.44,"speaker":"Fr Stephen De Young","text":"Latch onto that and run with it. Okay? Saint Phottini is the anti Jezebel. So, I mean, I think it's popular use. Even if you haven't read the story of Elijah and Ahab and Jezebel and detail the scriptures, you probably have the idea that Jezebel, or referring to someone as a Jezebel is a bad thing. So. But this is because of her. In the Scriptures, she earns this. So what concretely happens? Ahab, as the heir of Omriga, is married to her, and then when he becomes king, she is now. She is now the queen. So before this, in Israel, the religion that's being practiced is the religion that was set up by Jeroboam, son of Nebat."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3062,"end":3084.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The. The. He takes. You know, remember everybody, he's the one who sets up the golden calves and says, you can worship. Yeah. Using these things. And it's become so iconic in the Old Testament that worshiping Yahweh with golden calves is referred to as the sin of Jeroboam, son of Nebat, over and over."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3084.85,"end":3089.65,"speaker":"Fr Stephen De Young","text":"Yes, yes. You have just a category of abominations named after you. Gratz."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3090.37,"end":3090.85,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3091.49,"end":3291.49,"speaker":"Fr Stephen De Young","text":"This is why there are no kids named Jeroboam running around in your church. The only reason that would be because people love that name. But no, he was a bad guy. Time until someone starts yelling on Twitter that there's a Saint Jeroboam. What do you give it? Somebody Photoshops an icon. Anyway, so Jeroboam sets up this state religion essentially, of calf worship, which is nominally still worshiping Yahweh, but as embodied, they believed within these two golden calves, one at Bethel, one at Dan. Because there's nothing but good things to say about Dan in the Bible. But Dan was the northern end, the very northern end of the northern kingdom, and Bethel was the southern end. So it was. That's why they're. They're at either end. Right. So there's theoretically one nearer to you. And with that came a whole series of feasts other than the feast prescribed by the Torah, because we're doing worship other than the worship prescribed by the Torah. And so it's sort of this syncretistic. We're going to say we're worshiping Yahweh, the God of Israel, but we're going to just do paganism, just inserting his name instead of BAAL or whomever. Right? And so with the coming of Jezebel to the throne, right, she is going to want to shift this further. Right? So there's already within the BAAL worship of Phoenicia, the idea of the chthonic baal, the bull BAAL that we've talked about a little bit on the show that we have to talk about carefully. Let the listener understand. Go look it up for yourself. So there is this bull calf element, right. And we sometimes forget, again, we read or we've gotten a Cliff Notes version at some point of the divided kingdom of the northern kingdom of Israel, the southern kingdom of Judah. And we don't realize that, like, not only were they separate, but for the couple hundred years that the northern kingdom existed, they were perpetually at some level of cold or hot war with Judah that there was active hostility. So not just Athaliah, who I mentioned earlier, who tried to wipe out big monarchy, but of course, the Syro Ephraimite war, where the northern kingdom teamed up with the Arameans, the Syrians, to attack Judah. Right. The whole purpose for Jeroboam of setting up those calves was he didn't want his people going to Jerusalem to worship at the temple."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3291.89,"end":3298.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it gives. It gives power to Jerusalem. It also brings, frankly, tourist money, you know?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3299.65,"end":3392.93,"speaker":"Fr Stephen De Young","text":"Right, right. So again, it's all intertwined, right? You can't pull these things apart. They're all intertwined in ancient areas. And so this enmity is sort of a religious thing too. So from the perspective of now this powerful Omride dynasty, Jezebel wanting to solidify her power. Very easy move is right. Why are we still calling this God we're worshiping at the calves, Yahweh. Why don't we just worship BAAL there? Right? Because after all, Yahweh is the God being worshiped in Judah who we don't like. And the prophets of Yahweh are causing trouble all the time in the northern kingdom, denouncing the worship of the golden calves, denouncing the kings, right. Proclaiming doom on the last two dynasties that got wiped out. Right? And remember from the, from the, from the pagan mindset which Jezebel firmly had. Right. It was not a question, a prophet. She would have thought of prophets. More like Balaam. Right? Balaam. Remember who got son of Beor, who gets hired to curse Israel by the king of Moab. So it's not that those previous two dynasties were doomed because the God who created the heavens and the earth told them they were doomed for their disobedience. Right. And they're."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3392.93,"end":3395.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, for most pagans, that's not a thing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3396.69,"end":3440.85,"speaker":"Fr Stephen De Young","text":"No, it was these representatives of this other God put the curse. Put a curse, put the whammy Right. On those rulers. Right. And so this is why not only does she start converting all of these high places, including the golden calves, into shrines to baal, but she starts massacring every prophet of Yahweh she can find. Right. Because they're the threat to her and her husband's power. Right. And their dynasty and their rule. So this is the backdrop for the Elijah story."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3443.02,"end":3443.42,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3443.74,"end":3452.22,"speaker":"Fr Stephen De Young","text":"This that we just described is what's going on in the background, literally, of the Elijah story. And if you. Yes, I said Elijah. Deal with it anyway."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3454.62,"end":3458.38,"speaker":"Fr Andrew Stephen Damick","text":"I could say Eliyahu or I'm not even sure how exactly how you pronounce it."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3458.38,"end":3468.18,"speaker":"Fr Stephen De Young","text":"Yeah, that's. Eliyahu is roughly it in Hebrew or El Yas in Greek or et cetera. Right. We all know it's the same name. Or Louis. I could be French. Louis."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3468.18,"end":3468.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3469.84,"end":3529.14,"speaker":"Fr Stephen De Young","text":"St. Louis. But yes, Elijah, this is the backdrop. Right. And if you go back and read the story of Elijah with this in your mind that this is what's going. Things start to click and make sense in new ways. Right. Like is a very different. Right. Experience. Right. And so you know the Elijah story in terms of this contest between him and the prophets of BAAL and Jezebel's BAAL worship, of course, Mount Carmel is this big apex. Right. Of that conflict. Right. But we know from reading the rest of Two Kings that. Or Fourth Kingdoms, that there's not this mass repentance in the Northern Kingdom after."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3529.14,"end":3532.58,"speaker":"Fr Andrew Stephen Damick","text":"Mount Carmel, they do not turn their hearts back to the One."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3532.58,"end":3532.82,"speaker":"John Maddox","text":"True."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3532.82,"end":3541.06,"speaker":"Fr Stephen De Young","text":"They don't all say, oh, Elijah was right. We've been worshiping the wrong God. We've been doing this all wrong. We need to all start going to the temple in Jerusalem. Right. That doesn't matter."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3541.06,"end":3545.34,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he's popular in the moment. You know, Yahweh is God. Yahweh is God."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3545.34,"end":3545.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3545.74,"end":3546.14,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3548.95,"end":3600.64,"speaker":"Fr Stephen De Young","text":"Yeah, it's. It's easy to get people to chant and get excited in the moment, see Palm Sunday. But that often doesn't lead to anything good. And so because there's. There's not this mass repentance, there's this changing, of course, of the Northern Kingdom. Right. BAAL is the spirit. Right. That, that the people are following. Right. That is leading them. And so he leads them to destruction. Right. And the Northern kingdom gets wiped out. Right. Because. And again, the northern kingdom getting wiped out. Think about what we've been talking about. This isn't just like, oh, they did a lot of bad stuff and eventually it was too much bad stuff."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3601.45,"end":3601.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3602.01,"end":3612.65,"speaker":"Fr Stephen De Young","text":"It's not just they were following this spirit who promoted lust and bad sinful things. They actively hated Yahweh, the God of Israel."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3612.65,"end":3616.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They became the enemies of God. Like they went full pagan."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3616.49,"end":3672.64,"speaker":"Fr Stephen De Young","text":"They hated Yahweh, they hated Judah and wanted to destroy it. Right. They hated the promises that were made to the line of David and wanted to destroy it. Right. In defiance of God. Right. Like this is. They literally. Yeah. Made themselves God's enemies by their own choice. Right. Despite these calls to repentance, Elijah isn't the last prophet God sent to them either. He kept sending them prophets. Right. But they did not repent and they killed some of those prophets. So. Right, that's, that's one later nexus point and that's laying important groundwork, Right. For where, where we're going to go and talking about theophany. So the other little piece we need to do here in the first half before we move on is remember the other thing, Adam."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3673.6,"end":3674.24,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3674.24,"end":3682.33,"speaker":"Fr Stephen De Young","text":"And. And with Adam, there is a place where he has a run in with the devil. Right, Genesis 3."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3682.57,"end":3684.61,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. The serpent."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3684.61,"end":3711.19,"speaker":"Fr Stephen De Young","text":"And it's not just another run in, but this is as we've talked about before on the show several times. This is the same story that's being told in Isaiah 14 and Ezekiel 28. Same story is being told from a third perspective. Right. In terms of how the devil fell."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3711.59,"end":3717.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And remember everybody, the serpent gets thrown out of the garden. So this is the devil being kicked."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3717.71,"end":3719.67,"speaker":"Fr Stephen De Young","text":"Out of paradise into the underworld."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3719.75,"end":3722.83,"speaker":"Fr Andrew Stephen Damick","text":"Heaven. Yeah, into the underworld where he's going to eat death."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3722.83,"end":3795.81,"speaker":"Fr Stephen De Young","text":"The dead. Yeah. He's going to become the eater of the dead. Sorry, Michael Crichton. Right. And we've. So we've talked about how. Right. The motivator of this is this envy, this jealousy, this envy. This is everywhere in the church fathers, this jealousy and envy that he had toward Adam over Adam's destiny in Christ. Right. Over his destiny, what we call theosis. Right. That Adam, humanity was going to end up being greater than the angelic beings, including him. Right. And this is what brings about this fall. This is what brings about this treachery. Him wanting to lead humankind to destruction, as we've talked about before. Right. Pose it again. Okay. So the devil wants to get God to stop being God and to be God himself. What's step one?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3796.05,"end":3797.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not. Not a thing, everybody."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3797.81,"end":3800.85,"speaker":"Fr Stephen De Young","text":"This is not a thing that's metaphysically, ontologically possible."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3801.97,"end":3802.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3803.73,"end":3815.64,"speaker":"Fr Stephen De Young","text":"Right. But what he can do is he can attack and try to destroy the creation, the fellow creature of God of which he is jealous. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3817,"end":3817.4,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3821.08,"end":3830.28,"speaker":"Fr Stephen De Young","text":"The core of probably the question, I think you would agree with me, Father Andrew, at least go along with me for the sake of the show."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3830.92,"end":3831.56,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3832.92,"end":3844.39,"speaker":"Fr Stephen De Young","text":"The question we get the most often addressed to the show, if we had to pick one question the most often, is always how come humans can repent and angels can't?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3844.71,"end":3845.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that is correct."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3846.87,"end":3848.55,"speaker":"Fr Stephen De Young","text":"This is the most common question."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3849.27,"end":3855.71,"speaker":"Fr Andrew Stephen Damick","text":"I don't know why we've answered it a thousand times, but it's really. It's something that's really hard to wrap your mind around, I think is what it is."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3855.71,"end":3876.98,"speaker":"Fr Stephen De Young","text":"I think so. And I think they're asking the question from the wrong perspective because I think the question usually gets asked. And this is not a condemnation of anyone who has asked it this way, right? No, no, it's just a. Let's think about this a second. I think it's asked for the perspective of mechanism."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3877.78,"end":3888.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because I think people think of holiness and sin or sin and repentance as simply equal and opposite movements of the will. Like, it's a decision I make."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3888.74,"end":3891.62,"speaker":"Fr Stephen De Young","text":"Right. And so it's a. How is it that."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3892.22,"end":3895.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I can change my mind. Why can't angels change their mind?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3895.74,"end":3910.94,"speaker":"Fr Stephen De Young","text":"To what mechanism does a human have recourse that an angel does not? Right, right. And so when we give the answer about a material, changeable body, I don't think people find that satisfactory because they don't find it satisfactory as mechanism. Yeah, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3911.26,"end":3911.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":3913.02,"end":4060.12,"speaker":"Fr Stephen De Young","text":"But as we've talked about many times on other theological issues, mechanism is never the right way to come at a theological question. The actual answer to why humans can repent and angels can't. Right. Is because the sin of the angels was an attempt to destroy man. Therefore, God gives man a way out of that destruction. Right. Because otherwise, if God did not give humans the capacity to repent, the devil would have won. It'd be a Pyrrhic victory. Yeah, right. While we're talking about the Punic wars, it would be a Pyrrhic victory because he still would have ended up in the underworld, but he would have ended up in the underworld, not only with other fallen spiritual beings, but with all of humanity, mission accomplished, humanity destroyed. That's why God gives humans a chance to repent. That's the actual answer mechanism. I can't tell you. Right. Don't know what it's like to be an angel. Right. But that's the, that's the reason. That's why humanity gets the chance to repent. Because the repentance and salvation of humanity is how the devil is ultimately defeated. So. And the way this is expressed though, in the text of Genesis 3, as we've talked about before, is this issue of garments, of skin. Right. Mortal flesh. Right. That provide that capacity for repentance. And even though it's not explicit in the way people might like it in the text of Genesis 3, that Adam is repentant is a key thing to understand in understanding early Christianity and Second Temple Judaism as we've talked about before, is that Adam is not the archetypal sinner."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4060.92,"end":4061.32,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4061.32,"end":4168.79,"speaker":"Fr Stephen De Young","text":"Cain is for, for Jewish people in the, in the first century A.D. cain is. Yeah, sorry, Calvinists. Adam. And the difference between the two, there are several. Right. They're the differences in the curses, right. In Genesis 3 and 4. But what those are taken to signify ultimately is the fact that Adam is repentant and Cain is not. And as the figure of Cain gets elaborated not just in his genealogy, but as that genealogy gets interpreted, he doubles down, he gets worse and teaches his descendants to be even worse. Right. Whereas Adam is seen as not only given this capacity for repentance, but as. As repent. Repentant. And there's a text that will fit. We'll read a little bit here to finish off the first half called the Life of Adam and Eve. That likely it was written in the first century AD but is a pre Christian Jewish text, meaning it was probably literally written during Christ's life, after his birth, before his baptism is likely. Where this was actually originally composed. We don't have the Hebrew original. We've got a lot of different translations in other languages. We've quoted from it before about something else and a section that's not going to be in the part that we're reading right now. But we'll close with this because this is sort of from that period. Sort of a very full meditation and collection of traditions about the repentance of Adam."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4168.95,"end":4173.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we should emphasize this is an apocryphal text. Meaning it's."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4173.91,"end":4175.51,"speaker":"Fr Stephen De Young","text":"Yes. Don't look for it in your Bible."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4175.83,"end":4392.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's. Yeah, it's. But it is an edifying text that you can read at home. Or, you know, on a podcast. And, you know, as you said, it's a collection of traditions. Yeah. So this is from the life of Adam and Eve, and this is the part that's about their repentance. So it starts out this way. Eve said to Adam, my Lord, tell me, what is penitence and how long should I perform it, lest perhaps we place on ourselves a labor which we cannot endure and he not hear our prayers. And the Lord turned his face from us because we did not fulfill what we promise. My Lord, how much penitence are you thinking of doing since I brought labor and tribulation upon you? Adam said to Eve, you cannot do as much as I, but do as much so that you might be saved, for I will do 40 days of fasting. You, however, arise and go to the Tigris river and take a stone and stand upon it in the water up to your neck in the depth of the river. Let not a word go forth from your mouth. Since we are unworthy to ask of the Lord, for our lips are unclean from the illicit and forbidden tree, stand in the water of the river for 37 days. I, however, will do 40 days in the water of the Jordan. Perhaps the Lord will have mercy on us. Eve walked to the Tigris river and did just as Adam told her. Likewise Adam walked to the Jordan river and stood upon a rock up to his neck in the water. Adam said, I say to you, water of the Jordan, mourn with me. And separate from me all swimming creatures which are in you. Let them surround me and mourn with me. Let them not lament for themselves, but for me, for they have not sinned, but I. Immediately all living things came and surrounded him. And the water of the Jordan stood from that hour, not flowing in its course. 18 days passed. Then Satan grew angry and transfigured himself into the brilliance of an angel and went off to the Tigris river to Eve. He found her weeping. And then the devil himself, as if mourning with her, began to weep and said to her, come out of the water and rest and weep no longer. Cease now from your sadness and lamenting. Why are you uneasy, you and your husband, Adam? The Lord God has heard your lamenting and accepted your penitence. All of us angels have pleaded for you, praying to the Lord, and he sent me to lead you forth from the water and to give you the nourishment which you had in paradise and for which you have grieved. Now, therefore, come out of the water, and I will lead you to the Place where your food is prepared. Hearing this, Eve believed him and went out of the water of the river. Her flesh was like grass from the water's coldness. When she had come out, she fell to the ground. But the devil stood her up and led her to Adam. When Adam saw her and the devil with her, he cried out with tears, saying, o Eve. O Eve, where is the work of your penitence? How have you again been seduced by our adversary through whom we were alienated from the dwelling of paradise and spiritual happiness? When Eve heard this, she knew that it was the devil who had persuaded her to go out from the river. And she fell on, her face on the ground, and her grief was double, as was her wailing and lamentation. She cried out, saying, woe to you, devil. For what reason do you fight against us? What concern do you have with us? What have we done to you that you should persecute us so grievously? Why does your malice extend to us? Did we ever take your glory from you or cause you to be without honor? Why do you persecute us, O enemy? Impiously and jealously unto death? And it goes on. But that's. That's the excerpt."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4392.66,"end":4393.94,"speaker":"Fr Stephen De Young","text":"This is a piece of it. Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4393.94,"end":4394.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4394.58,"end":4408.98,"speaker":"Fr Stephen De Young","text":"There was some before that, there's some after, but indeed. Yeah. So. But hearing that, some elements to keep in mind. Right. The tradition of Adam's repentance connects it to the Jordan River."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4410.27,"end":4412.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he's up to his neck in the water."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4412.51,"end":4470.42,"speaker":"Fr Stephen De Young","text":"Yeah. Up to a 40 day period. For a 40 day period. During that, the water stops. And notice sort of all of the elements of creation. Right. Not just the living creatures of the water, but the water itself. Right. Signifying the angels, the spiritual, the spirits associated with them are all praying and interceding on his behalf as he repents. Right. And praying for his forgiveness. And note this might be familiar to folks from somewhere in the New Testament that it literally directly talks about the devil transforming himself into an angel of light here to trick Eve the second time. So that's some groundwork laid for us to build upon now."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4471.06,"end":4476.9,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that wraps up the first half of this episode of the Lord of Spirits. We'll be right back in a moment."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4477.14,"end":4493.44,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 858-552-3-72346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4498.24,"end":4505.04,"speaker":"John Maddox","text":"Hi, this is John Maddox. I know you thought I retired, but as Michael Corleone in the Godfather said."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4505.28,"end":4508.88,"speaker":"Fr Stephen De Young","text":"Just when I thought I was out, they pulled me back in."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4509.84,"end":4564.75,"speaker":"John Maddox","text":"Seriously though, I am both honored and excited to begin producing a series of audio documentaries as special editions of Father Tom Siroca's popular live show, Ancient Faith Today. These documentaries will be designed to explore in some depth various topics of interest to Orthodox Christians. Topics such as the reception of converts into the Orthodox Church, ecumenism, an Orthodox look at the environment, deaconesses, and many more. The intent of the format is to give various views ample opportunity to express their opinions in a non debate and ironic setting. They will all be pre recorded and produced and then played on Ancient Faith Today with time allotted afterward for comments and reactions via calls, emails and texts. I hope you'll tune in."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4568.02,"end":4583.94,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4585.22,"end":4610.11,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. We're talking theophany and we just did a whole bunch of stuff about BAAL and Adam, Adam up to his neck in the River Jordan. So yeah, we're on our way. Lots of fun stuff. So, yeah, why don't we talk about the actual feast itself? Obviously people listen to the first half. They caught some stuff, I'm sure, I."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4610.11,"end":4613.15,"speaker":"Fr Stephen De Young","text":"Don'T know because normally we wait to the third half."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4613.47,"end":4619.06,"speaker":"Fr Andrew Stephen Damick","text":"It's true, but we like to mix it up once in a while, people to be a little surprised."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4619.06,"end":4636.42,"speaker":"Fr Stephen De Young","text":"Yeah, we could, we can change format and confuse people. There's gonna be those people. It's like the people who try to show up like just for the gospel reading, right? Like they're gonna, they're gonna tune in at like 8, 10. We've had. Darn it, they already covered the topic."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4636.74,"end":4649.77,"speaker":"Fr Andrew Stephen Damick","text":"We've had. Well, we've had people that. They're like, well, can I just listen to the bits that you guys do at the end? And we're like, well, you can, but it's kind of all predicated upon the three hours that came before it. But sure."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4650.09,"end":4664.89,"speaker":"Fr Stephen De Young","text":"Look, man, I love eating the burnt ends, but you don't eat just the burnt ends, right? Like, you gotta get a slice of the, of the good meat too. Yeah, yeah, get yourself a slice of the brisket, ladies and gentlemen. That's what life's all about."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4664.89,"end":4669.29,"speaker":"Fr Andrew Stephen Damick","text":"I'm a pulled pork guy actually, since I spent so many years in North Carolina."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4670.67,"end":4673.95,"speaker":"Fr Stephen De Young","text":"So yeah, with, you know, you Wouldn't turn down brisket."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4674.43,"end":4678.91,"speaker":"Fr Andrew Stephen Damick","text":"I do. Like, I have room in my stomach for all God's barbecues, that is for sure."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4679.07,"end":4679.63,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4680.03,"end":4688.91,"speaker":"Fr Andrew Stephen Damick","text":"But, you know, pulled pork with vinegar and maybe some hot pepper. That's. That's the top of the heap for me. Yep."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4689.39,"end":4691.27,"speaker":"Fr Stephen De Young","text":"With okra, we won't get into this here."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4691.27,"end":4692.11,"speaker":"Fr Andrew Stephen Damick","text":"Hush puppies."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4695.83,"end":4697.35,"speaker":"Fr Stephen De Young","text":"I spent too much time in Texas."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4697.67,"end":4701.67,"speaker":"Fr Andrew Stephen Damick","text":"That's fine. It's fine. It's fine."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4705.27,"end":4709.19,"speaker":"Fr Stephen De Young","text":"So. And you know, I've discovered that you could put jalapenos in literally anything."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4709.99,"end":4711.67,"speaker":"Fr Andrew Stephen Damick","text":"That does seem to be accurate."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4711.67,"end":4796.53,"speaker":"Fr Stephen De Young","text":"And you could deep fry literally anything. But so accurate. Although the greatest thing. Greatest thing. And then we'll get back to the topic, because I know how many huge fans we have of my digressions. But the best was during. During the brief period where I was a guard in a Texas prison. We would. This literally was a common occurrence. Like you cook up a pot of chili and we'd spray our pepper spray into it for seasoning. Because people don't know this, but pepper spray, even the sort of variety that civilians can't buy, is just pure capsicum. It's just pepper. There's no additives. So, yeah, you know, you just mix it into the pot. Spicy chili. It's all good. So, yeah. Now back to theophany. I don't have a good segue for that. Even. So theophany, spicy chili pot to holy water baptism. That. It seems like there should be something, but there isn't. So as we. As we alluded to way back at the beginning, the theophany is probably. And, you know, how do you number this? We're going to go ahead and say it's the second oldest Christian feast."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4797.89,"end":4803.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. But oldest. Oldest being Pascha. Well, sort of specifically Christian."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4804.18,"end":4804.94,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4804.94,"end":4807.22,"speaker":"Fr Andrew Stephen Damick","text":"Not a Christian transformation of a Jewish feast."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4807.3,"end":4813.06,"speaker":"Fr Stephen De Young","text":"Right. Which Pascha and Pentecost directly are. Right. Pascha is the Greek word for Passover."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4813.14,"end":4814.26,"speaker":"Fr Andrew Stephen Damick","text":"Passover. Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4814.58,"end":4833.91,"speaker":"Fr Stephen De Young","text":"Right. So. And not to go back to that earlier rant, but I really wish we'd translate it in English. The hymns would make so much more sense if we were talking about a new and glorious Passover rather than a new and glorious Pascha, because what's the."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4833.91,"end":4835.95,"speaker":"Fr Andrew Stephen Damick","text":"Old and less glorious Pascha?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4836.19,"end":4881.18,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. But so that's, you know, Pascha is Passover. We're celebrating it differently in Christ, but it's still Passover. And Pentecost is still Pentecost. We're celebrating it differently in terms of the New Covenant instead of the Old Covenant, but in terms of sort of New Christian feasts. Theophany is the second oldest because we know it was around from at least the very early part of the second century ad. So the early one hundreds, we know Theophany was being celebrated, but before that was actually St. Stephen's Day."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4881.67,"end":4882.31,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4882.47,"end":4987.05,"speaker":"Fr Stephen De Young","text":"Which was the first martyrs feast. So I'll just go ahead and say this now. So if you want the game winning argument against your annoying Internet friend who thinks Christmas was a pagan holiday, you need to point out to him that like 250, 300 years before Christians were celebrating Christmas on December 25th. They already had feasts on December 27th and on January 6th. So they did not need a new winter feast to replace anything. They already had winter feasts. In fact, say Steven's Day is on juvenileia. So if they're just trying to replace Roman feast, that was already done, no need to introduce Christmas. Doesn't make any sense. Stop it with that nonsense. So from the very earliest evidence we have, Theophany was celebrated as the feast of the Incarnation. Right. We tend now again to look at the Feast of the Nativity, Christmas where Jesus is born, as being the primary site of the Incarnation. Let me argue that even from the perspective of Christian doctrine, that doesn't make sense. If you want to go for the perspective of Christian doctrine, the feast of the Incarnation would actually be March 25th."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4987.13,"end":4990.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the annunciation, not December 25th, the conception of the Lord."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4991.11,"end":4991.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4991.47,"end":4994.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":4994.95,"end":5019.32,"speaker":"Fr Stephen De Young","text":"But this is sort of the Feast of the Incarnation. And what we mean by that is what we're going to be exploring for the rest of the episode. Right. Because we'll start with what we don't mean by that. Right. And I don't care. I'm just gonna say stuff."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5020.28,"end":5020.68,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5023.88,"end":5380.17,"speaker":"Fr Stephen De Young","text":"So as you, as you might expect, anyone who's listened to me at all about anything, I think that a very dumb surface level reading of that fact led 18th and 19th century scholars to some really bad conclusions based on bad presuppositions. Right. So what do I mean by that? So we have to remember some of the presuppositions we're dealing with when we're dealing with 18th and 19th century scholarship. And this isn't just biblical scholarship now we're getting into historical scholarship and church history and Von Harnack and this kind of stuff. What are our presuppositions? We have a presupposition, everything starts simple and then gradually gets more complex. Right. This sort of evolutionary hypothesis for everything. Right. So that's one assumption, and it's an Assumption, because it's not provable. It's a first principle. It's just a presupposition that that's the way things work, right? Yeah. One could just as well take the opposite assumption that things start out very complex and nuanced and then get watered down. Right? Like, I could argue that just as easily. I give you just as many examples, right? But this is the presupposition. Things start simple. Over time, they get more complex, elaborate, Right? And, and put into place. Right? So there's an assumption that means when we're talking about church history, that whatever we have with the apostles and the quote, unquote, historical Jesus, very simple, right? Very simple. They're starting over, starting a new religion. It's very simple, very basic. Just a bunch of hippies who are like, hey man, just love everybody, be cool. Like, don't own stuff. Right? Like that's early Christianity, right? And then, you know, all of a sudden all these bishops and stuff show up out of nowhere and ruin everything really fast too. It's kind of amazing, but. Right, so it starts this real simple and then the complexity comes later. The other major presupposition, right, comes out of 16th, 17th century, this idea of a taxonomy of religions. We've talked about this before, that human religion as a whole, as a human construct, starts out simple and then gets more complex, gets refined, improves. Right? And so this is where you construct the chart that begins with some kind of animism among cavemen and then ends with 19th century German Lutheranism. Right? The culmination of all human religion. Right? So, and I say that flippantly, but I could point you to books that argue that seriously, so this kind of thing and have these, you know, well, there's polytheism and then there's monotheism. And monotheism is more sophisticated. It develops out of polytheism. And so presupposition is all the apostles, all of the early Christians in the first century AD are Unitarian monotheists. They think there's only one God that exists and that, that only one God is one person, right? So then, right. Obviously all of these folks, and again, you can just read the books, all reject the idea that there's any idea of the Trinity in the first century, Right? Because that would be crazy to Jewish people. Now we know that's not true, Right? At least the people around this show know that's the opposite of true. Right? But again, these are their presuppositions. And so when it comes to Christ, right? Like the disciples all just thought Christ Was this. This cool guy, kind of a prophet who they hung out with, who taught them all to love everybody and not own stuff. And, you know, he died, but they thought like his spirit lived on in them and stuff. Right. Like, totally awesome. And then you have to go through these evolutionary stages to get from that to thinking that Jesus is God. Yeah, Right. And so a whole evolutionary process of Christology gets constructed. FC Bauer is the big guy behind this, right. Where you start out with what's called a low Christology. Jesus is just a human guy. He's a prophet in some sense, right. Charismatic spiritual leader, however they define that, the historical Jesus. And then they start to think, oh, well, no, like he was more than that. Right. And then he kind of gets promoted and promoted until, oh, now at Nicaea, we're going to say he's God. Right. And again, see our whole series about the Son of man, Old Testament stuff, right. About how all that's bunkum. Right. But now if you have that idea, that construct. Right. Which I will give him credit for, friend of the show Bart Ehrman used to have and now doesn't. For the record, he famously wrote a book called How Jesus Became God that was just laying out that in a very NPR friendly way. But he's now sort of repudiated that he now has a different view. He has a version of the early high Christology view."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5381.78,"end":5383.22,"speaker":"Fr Andrew Stephen Damick","text":"Hey, there may be hope for him yet."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5383.62,"end":5390.54,"speaker":"Fr Stephen De Young","text":"Well, I don't. I still don't think he's right, but he's much closer than he was. Yeah, he's rejected a lot of that nonsense."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5390.54,"end":5391.54,"speaker":"Fr Andrew Stephen Damick","text":"Bart, call in."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5391.7,"end":5582.27,"speaker":"Fr Stephen De Young","text":"Yeah. Friend of the show Barter, but is always welcome to call it to discuss anything he wants. But if you take that paradigm and then you drop in the fact that, oh, look at the beginning of the second century, Christians are celebrating the baptism of Christ in the Jordan by St. John the Forerunner, St. John the Baptist, as the feast of the Incarnation. What do you do with that? Well, what you do with that is, oh, they thought that when he was baptized and the Holy Spirit descended upon him, that's when he became the Messiah, or that's when he became divine. This must be one of the steps that's called an adoptionist Christology, Right. That Christ isn't the begotten Son of the Father, he's the adopted Son of the Father. And this is the moment of that adoption. Today you are my son. Today I have begotten thee. Taking that very literally, as if it wasn't a quote from a psalm used at the coronation of a king of Israel. But anyway, so that all gets fed into that paradigm. Here's why that's dumb. See, here's part of the problem here, right? Is that you start with presuppositions. You filter data like this historical data about the Feast of Theophany. Through those presuppositions, you come to a conclusion. But there needs to be this other step where you look at the conclusion and you look at all of the other historical data and see if your conclusion makes sense. Not if, like your mode of reasoning that got you from point A to point B makes sense. But does point B make sense with reality and the rest of the data? Those are two different things, Right? And so even though you can see that logic. Right. The second question is possibly the most important one. Right? What do I mean by that, by this conclusion ultimately being dumb? Well, there are a whole bunch of groups that did have adoptionist Christologies in the second century. Yeah, totally Corinthians. Right. A bunch of other gnostic groups. Right. And they all got condemned. They didn't get condemned later. It's not like at the Council of Nicaea, they were like, oh, crud, we need to go back and condemn all these guys because now we've got this new teaching that he's God. They were condemned at the time, they were condemned concurrently. They were condemned at the beginning of the second century by mainstream Christians. Right. So how could mainstream Christianity be liturgically celebrating something that they were simultaneously condemning as heresy among certain sects? That doesn't make any sense."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5582.51,"end":5587.15,"speaker":"Fr Andrew Stephen Damick","text":"That's the problem with trying to analyze bits of this in isolation from all the rest."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5587.55,"end":5631.85,"speaker":"Fr Stephen De Young","text":"Right? So it's not about, is there a flaw in your argument from A to B? It's does B make sense? Yeah, right. Does B make sense with the rest of the facts of the rest of reality? And I have to say. Well, I don't have to, but I'm going to say I completely. Even, a lot of. Even a lot of orthodox sources, respected and respectable orthodox sources on anti dicene Christianity get this wrong. And again, I'm not saying this to. Oh, go ahead."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5631.85,"end":5644.09,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say, yeah, some kind of suggests like, okay, this is the reality. Christ is truly God, he's truly man. But over time they sort of realize that that's how they kind of get this wrong."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5644.25,"end":5644.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5644.73,"end":5645.13,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5645.83,"end":5665.35,"speaker":"Fr Stephen De Young","text":"So I will use an example because I'm using him as an example because he is the best example, not because he's the worst example. Right. And that's Father John Bear. I'm not going after Father John Behr. I'm not seeking revenge just because the last time he and I spoke he made fun of me about my wedding registry. But that's another story."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5668.79,"end":5672.72,"speaker":"Fr Andrew Stephen Damick","text":"Have to add this to the James Earl Jones story. Yeah, at some point, yes."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5672.72,"end":5719.34,"speaker":"Fr Stephen De Young","text":"But waited, I see a very well written book. Right. And he does the best version of this. He does the orthodox version of this, but it's still a version of this is the problem. Right. So his book, like I said, I'm using that as the best example. But there are lots of other orthodox books and non orthodox books about that early part of church history and patristics that are doing the same thing, mostly from the 20th century, late 20th century. Just accept sort of the academic narrative about the development of doctrine as a fact. Right. Like these are just the facts we have to work with. This is data, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5719.34,"end":5719.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5720.34,"end":5857.97,"speaker":"Fr Stephen De Young","text":"And so okay, as an Orthodox priest, as an Orthodox scholar, I want to come at this data from an orthodox perspective. So the Nicene doctrine of the Trinity is true. It got discovered over time. Right. It unfolded over time in the understanding of the church, etc. Etc. Right. So I'm not saying it's flawed as in it's wrong or bad or harmful to read or anything. I'm saying it's wrong in the sense of just those things that were presumed to be data are not data. They're bad conclusions based on bad presuppositions. And we could, we could reject that whole thing. And we've been doing that on this show. Right. We've laid out the positive case again in the episode about the Son of Man and the angel of the Lord and those things that Christology. There's not really a discontinuity between Second Temple Judaism and early Christianity on Christology. Not much of one. Right. So I'm not saying that to say Father John's book is bad or worthless. He has a lot of books I really like. Even that one is a really well written book. I'm just saying it's now kind of out of date because we've been able to discard some of those bad conclusions. We don't have to try to work around them and frame them, we could just jettison them. And let me also say I hope that every book I write eventually becomes outdated. Right. My Hope is that 100 years from now somebody will look at a copy of Religion of the Apostles and be like, eh, that's not really worth reading anymore because he doesn't know about the second set of Dead Sea Scrolls. I Hope that happens. I hope that human knowledge and our understanding of the faith and of our tradition continues to increase. I want to help with that with my own writing, but I'm trying to help with that, like, in real time. So hopefully by the time I've been gone a few decades, everybody will have moved on and understand everything better than I ever did. Right. That's my hope. So that's not a shot at Father John in any way? I know there's someone furiously typing on the Internet."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5860.05,"end":5861.89,"speaker":"Fr Andrew Stephen Damick","text":"Emails are being sent, but."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5861.89,"end":5866.13,"speaker":"Fr Stephen De Young","text":"Yeah, but if Father John wants to call me and talk about it, I'd be happy to just talk with. It's been a while."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5866.13,"end":5867.17,"speaker":"Fr Andrew Stephen Damick","text":"Did you hear what that guy said?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5867.57,"end":5873.01,"speaker":"Fr Stephen De Young","text":"Yeah, but I'd be totally happy to talk with him about that. Or we probably end up talking about a whole bunch of other stuff unrelated."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5873.09,"end":5874.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, actually, but."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5876.77,"end":5902.24,"speaker":"Fr Stephen De Young","text":"But so it's, it's. And it's important that we don't fall back into that. Right. So that's a negative statement about what we don't mean when we say that theophany is the feast of the Incarnation. We don't mean that Christ's baptism is the point at which he was incarnate, that that's the takeoff point of our Christology, that that's when he becomes the Messiah, that that's when he becomes the Son of God, et cetera, et cetera. None of those things are things that we're saying, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5902.32,"end":5903.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yep."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5904.8,"end":5919.84,"speaker":"Fr Stephen De Young","text":"So now we're going to come from a few different angles of what we are saying. Right. And just one, one note before we move on from that. Did they still play the disclaimer before the show?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5921.54,"end":5924.82,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I didn't hear it play when we were."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5925.22,"end":5929.1,"speaker":"Fr Stephen De Young","text":"They're probably going to want to bring that back, let me just say. Okay, so. But now moving on."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5929.1,"end":5931.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Thanks."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":5934.98,"end":6117.7,"speaker":"Fr Stephen De Young","text":"Hey, that disclaimer is doing some of your work for you. Right. They email you at FatherAndrewcient. So what are some things that are happening? So we've talked before on the show about how within the Old Testament, within the Hebrew Bible language that was traditionally applied within BAAL worship to BAAL is applied instead to Yahweh, the God of Israel. Right. And some of the big examples of that are Psalm 104 or 103. It talks about God walking on the wings of the wind and Leviathan, who he made to sport, meaning to play with like a pet. Right in the waves. This is sort of taking that BAAL language. And you can see with Leviathan it's not now. Oh, your big epic battle was against my house cat, right? That this is a reappropriation, right? So again, unlike some of those fine scholars of the 19th and early 20th century, this is not the smoking gun that Yahweh is really BAAL under another name. This is. There's something deliberate going on here, right? Saying, no, this is Yahweh, not Baal, right. Daniel 7, of course, has the Son of Man coming on the clouds of heaven. These are just a few quick examples that we've gone over in more detail in the past. Yeah, job 41 talks about Leviathan. There's there, that's the passage in Job where there's kind of a chaos conf view of creation. Go back and listen to past episodes if you don't know what chaos conf is, other than a cool sounding German word. And Isaiah 27, verse one also talks about Leviathan, right? So this is. This language is taken. This is a sort of direct action to say, no, your stories about Baal are wrong. You're giving glory to Baal. That belongs actually to Yahweh, who created everything, including Baal and threw Baal out of heaven, etc. Etc. Out of the heavens. But what we see in the Feast of Theophany, in the iconography, in the liturgics, right, Is that that same language, right, and that same imagery, same symbolism is taken and applied to the incarnate Christ, right? There are a lot of examples of this, right, in the icon of Theophany. One thing that might jump out is that Yam and Nahar are hanging out in the Jordan River. That at the bottom, the little dudes. Yeah, the Greek inscription, that's Thalassi and Potomos, right? That's sea and river. That's Yam."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6117.7,"end":6121.42,"speaker":"Fr Andrew Stephen Damick","text":"And in Greek or often Yordani, actually often see that now."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6121.42,"end":6124.06,"speaker":"Fr Stephen De Young","text":"Yeah, he's the little dude riding on the."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6124.06,"end":6125.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6128.06,"end":6239.58,"speaker":"Fr Stephen De Young","text":"So here. And you see the trampling on the snakes or the serpents or the dragons, right? Like Leviathan, the fugitive serpent. So this imagery that's typically applied to BAAL is now being applied not only to Yahweh, the God of Israel, but to the incarnate Christ, right? So, and it's being done, it's being reapplied in this same kind of way, right? The same kind of way. So there is this parallel being made between. On the one hand, you have this contest of Yahweh versus baal, both in him casting BAAL the devil into the underworld, right? The later conflicts, we Described on the other side, you have Adam versus Baal or Adam versus the devil in Genesis 3. Right. So in terms of battles between Yahweh and Baal, he's about. I don't know if we just take the ones recorded in scripture 27 and. Oh, right. But Adam and his descendants are like the opposite. Like, O, O and a million. Right. In terms of the devil. But so we have here, not just because this is the incarnate Christ, not just victory, umpteenth victory for Yahweh, but the first victory for Adam."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6241.11,"end":6266,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And this is. And it's, you know, this is, this is why, as we said, you've got those little critters down there in the water in many cases, in theophany icons, not all of them, but a lot of them. So it's, it's. It's not just baal, Right. It's not just yam and Nahar. It's also the sense of Christ cleansing the creation from demonic power entirely."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6266.64,"end":6267.04,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6267.92,"end":6279.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We actually had. I was gonna say we had someone call in, and that was their question. I was like, I told Trudy to tell him. Like, we're. We're about to do that."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6279.84,"end":6280.44,"speaker":"Fr Stephen De Young","text":"It's coming."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6280.44,"end":6282.32,"speaker":"Fr Andrew Stephen Damick","text":"It's coming. People tracking with us."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6282.32,"end":6287.84,"speaker":"Fr Stephen De Young","text":"So. Right. And so that's. And we. We've talked about this in terms of Christ's divine identity before."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6288.64,"end":6289.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6289.92,"end":6297.93,"speaker":"Fr Stephen De Young","text":"That part of Christ's divine identity. Right. In the Torah, if you touch something that is unclean, you become unclean."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6298.89,"end":6300.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6301.13,"end":6315.21,"speaker":"Fr Stephen De Young","text":"When Christ touches something that is unclean, it becomes clean. So he touches a leper. Right. The leper becomes whole, is healed. He touches a dead body that is unclean, the dead body comes back to life."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6316.17,"end":6316.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6316.61,"end":6354.66,"speaker":"Fr Stephen De Young","text":"Right. And this is part of, as we've talked about, the manifestation of his divine identity. Right. But so it's key here. What we really want to key in on here in this episode is that theophany Feast of the Incarnation also involves here Christ's human identity. Right. His human identity in having this victory over baal, over the devil. Right. Over the powers. That this isn't just, again, round, whatever, that Yahweh wins. This is the first round that humanity wins."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6355.14,"end":6359.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a huge turning point for humanity that Adam wins."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6359.9,"end":6412.9,"speaker":"Fr Stephen De Young","text":"Right. And the connection, shall we say, between St. John the Forerunner and Elijah that we talked about in our episode about the Forerunner. Right. Is fully at play here in the baptism. I think we often that element of Elijah gets kind of sidelined here in this scene because, well, there's so much to talk about. Right. There's 87 different directions you can come at this. Right. And points you can make. But it is fully in play here and not just in the spiritual. Again, before, we've talked about primarily spiritual sense, right. Sort of Elijah is the patron, the guide, the friend of St. John the Forerunner."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6412.9,"end":6413.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6414.38,"end":6429.6,"speaker":"Fr Stephen De Young","text":"But also this is all intertwined, right? So think about the situation of Judea at the time this is happening, right. Think about Herod. Herod who's been rebuilding the temple."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6431.44,"end":6431.76,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6431.76,"end":6461.94,"speaker":"Fr Stephen De Young","text":"Sadducee families who have the high priesthood and who are in charge of the temple and are corrupt. Right. And wicked and heretics and everything else. Right? Herod, this evil. Right. Foreign king. Right. Who St. John is there opposing and the way Elijah had to oppose Ahab over and over and over and over again. And note in this case, too, it involves his wife who shouldn't be his wife, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6461.94,"end":6462.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6463.66,"end":6474.86,"speaker":"Fr Stephen De Young","text":"And it's kind of his wife who's calling the shots that's causing the problem. Right. And think about. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6475.99,"end":6476.23,"speaker":"John Maddox","text":"We."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6477.43,"end":6491.35,"speaker":"Fr Stephen De Young","text":"So one of the Old Testament readings, we already mentioned this in passing, but one of the Old Testament readings that we read in the Great Blessing of the Water in the Vespera liturgy for Theophany is the story of the showdown at Mount Carmel with baal."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6491.83,"end":6503.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not. I know some people and I have been guilty years ago, but I got better of saying, you know, look, they just took every reference to. To water in the old."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6503.28,"end":6509.16,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Anything got to do with water. Yeah, yeah. That ain't it. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6509.8,"end":6510.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6511.4,"end":6532.07,"speaker":"Fr Stephen De Young","text":"This is about a showdown with baal. Right. The story was showdown with bail. And now we're having another showdown with baal. But within that showdown with baal. Right. Notice what is, what does Elijah do? The prophet Elijah do? He soaks down the altar with water and then fire from heaven comes down upon it."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6533.19,"end":6534.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6534.39,"end":6537.19,"speaker":"Fr Stephen De Young","text":"Which I ruined everybody's Sunday school by pointing out was lightning."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6537.51,"end":6538.03,"speaker":"Fr Andrew Stephen Damick","text":"Lightning."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6538.03,"end":6579.2,"speaker":"Fr Stephen De Young","text":"But. Right. But then fire comes from heaven. Right? But look at the language that St. John uses regarding baptism and regarding himself in Christ. He baptizes with water what is coming. Who's going to baptize with fire and the Holy Spirit? Water, then fire. Right. Fire from heaven. And that water and fire and baptism language doesn't actually just get dumped after the story of Satan. I mean, we hear that language on a Feast of the Forerunner where we're reading St. John saying that stuff."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6579.81,"end":6580.05,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6580.05,"end":6590.61,"speaker":"Fr Stephen De Young","text":"In the first few chapters of Luke. Right. The beginning of Matthew mainly, But that doesn't just get forgotten, Right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6590.61,"end":6591.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6591.09,"end":6595.85,"speaker":"Fr Stephen De Young","text":"It gets brought up again, even though we kind of gloss over it later. In Luke, St. Luke's gospel, for example."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6595.85,"end":6614.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In Luke 12:49, 50, Christ says, I came to cast fire on the earth, and would that it were already kindled, I have a baptism to be baptized with, and how great is my distress until it is accomplished? Is that anybody's life verse?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6617.88,"end":6734.72,"speaker":"Fr Stephen De Young","text":"Somebody. Somebody do the cross stitch and put lightning in it just for me, anyway. Yeah. And so this is. This is this showdown language, right. We're not just reading it there for no reason. We're into it because it's being alluded to in the story. Right. Over to go, that this is part of what. This is the showdown with baal, with the devil. Right. It's happening again. It's happening in Christ's baptism, which is something we usually don't associate it with. Right. And think about right at that showdown before it begins. Elijah, in the original Hebrew, the way the question reads is essentially he says to the Israelites, how long will you hover between two opinions? And the language of hover there, it's sort of the language of like a bird coming in for a landing. And like you've got two spots you can land and you're kind of hovering in between, like you're trying to decide where to land. Right. And then, hey, if BAAL is God, worship him. If Yahweh's God, worship him. Right. And this is exactly what St. John is posing to the people who are coming out to him in the desert, Right. Even to the point that when some of the bad guys start to come out there, Right. The people who he's been opposing, he says, you brood of vipers who warned you to flee from the wrath to come. Right? And then comes that. This actually may be my life verse, because it's your brood of vipers who warned you to flee from the wrath to come. And with such words and others, he proclaimed to them the good news."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6736,"end":6741.76,"speaker":"Fr Andrew Stephen Damick","text":"Right? That's good news there, Forerunner."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6744.16,"end":6766.58,"speaker":"Fr Stephen De Young","text":"So. Because that's great news, right? You're a brood of vipers, and, you know, darn it, somebody warned you. I was hoping to see, hey, good news, everybody. Right? But. But this is the same thing, that he's posing right to them. And then the baptism of Christ is this critical moment after which those who had come to follow St. John become."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6766.58,"end":6770.06,"speaker":"Fr Andrew Stephen Damick","text":"Followers of Christ, like my patron saint."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6770.7,"end":6882.02,"speaker":"Fr Stephen De Young","text":"Yeah. Saint Andrew. So. And. And, you know, we quoted from Luke 12, right, in the context of that ministry. Right. That ministry of Christ and his sending out the 70, sending out the disciples, ministering, you know, this counter offensive against the powers that be, the king and the prince in Judea, we find out who loses, right? We get told who loses, right? Satan, Christ sees fall like lightning. There's my lightning, right? Falls like fire from heaven, right? This contest, he loses. So the, the one other element that we should mention before we end this, this second half, is because I got explicitly asked about it, and I do almost every year by somebody in my parish. They're listening to the hymnography and they hear all this language about the Jordan river stopping and turning back and parting. And we already saw a little of that actually in the life of Adam and Eve. But that comes from the same place. These are not literal references to say that this happened at Christ's baptism, right. Like St. John in his Gospel says, Christ came up out of the water. It's not that he tried to get baptized in the water, parted, and he didn't get wet, right? So that. That hypnographic language isn't literal in that way, but it's alluding back to someone else named Joshua. Joshua, when he led the people into the land of Canaan through the Jordan river, when the Jordan river parted in front of him."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6882.02,"end":6892.02,"speaker":"Fr Andrew Stephen Damick","text":"So this is about how Joshua of the Old Testament is a. A type of Jesus, who of course has the same name."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6892.74,"end":6939.42,"speaker":"Fr Stephen De Young","text":"And so again, what does that mean Jesus is doing with these followers who come to follow them? He's mounting a counteroffensive, a reconquista, as it is, as it were, of the. Of Judea, of Canaan. Right. That is coming into this again. So this is. This is language of this conflict, this battle with the devil that he is going to lose. But it's a battle. Right. Again, this is what we're really going to focus on in the third half in terms of the incarnation. It's a battle that he is winning not only as another victory of Yahweh over the devil over baal, but as the first victory of humanity over the enemy."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6940.22,"end":6948.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, that's the second half, but there's a third half coming. So we will be right back after our second and final break."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6949.1,"end":6965.43,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-223-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6970.95,"end":6972.47,"speaker":"Fr Stephen De Young","text":"What are we to make of the."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6972.47,"end":6985.01,"speaker":"John Maddox","text":"Unseen world and spiritual warfare? The Lord of Spirits. Book version is now available@store.ancientfaith.com written by Fr. Andrew Stephens."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":6986.92,"end":7018.21,"speaker":"Fr Andrew Stephen Damick","text":"To the modern mind, dragons and demons are just the inner demons of psychology. And angels are often reducible to the better angels of our nature, that is to our better human impulses and virtues. Talk of spirits is really about psychology, but to the ancient mind of millennia ago, even up to the pre modern mind of just centuries ago, these are real beings with personal presence who inhabit our world and affect us."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7018.93,"end":7037.41,"speaker":"John Maddox","text":"Father Andrew provides a distillation and explanation of the material in the popular podcast the Lord of Spirits, which he co hosts with Father Steven DeYoung. Get this brand new book today at store.ancientfaith.com that's store.ancient faith.com."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7037.57,"end":7053.73,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7054.53,"end":7062.61,"speaker":"Fr Andrew Stephen Damick","text":"And hey, you can get, there's Kindle versions, there's, you know, ebooks. There's an audiobook. You can listen to me read it to you."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7065.13,"end":7071.29,"speaker":"Fr Stephen De Young","text":"I think somebody's got to talk to John Maddox. Oh, this is the second time he's been inserted into this show."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7072.57,"end":7074.01,"speaker":"Fr Andrew Stephen Damick","text":"He just doesn't want to retire."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7074.09,"end":7081.45,"speaker":"Fr Stephen De Young","text":"Does he just want to come on Lord of Spirits? Like this is like turning into a whole Lucille Ball begging Ricky to be in the show thing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7082.97,"end":7085.41,"speaker":"Fr Andrew Stephen Damick","text":"Should he be our first and only guest?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7085.41,"end":7087.45,"speaker":"Fr Stephen De Young","text":"No, we need to inform it. We don't have guests."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7087.45,"end":7088.88,"speaker":"Fr Andrew Stephen Damick","text":"We don't do guests. Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7088.88,"end":7091.76,"speaker":"Fr Stephen De Young","text":"Like if he wants to call in, he could call in. Right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7091.76,"end":7092.24,"speaker":"Fr Andrew Stephen Damick","text":"True."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7093.6,"end":7111.24,"speaker":"Fr Stephen De Young","text":"He talks about whatever he wants. Friend to the show, Bart Ehrman privileges. But I mean, you can still call in. We'd love to talk to you, John. Is it just loneliness? Are you bored in your retirement? Right. You could call and talk to us. We'll talk to you. We like you a lot."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7111.24,"end":7113.36,"speaker":"Fr Andrew Stephen Damick","text":"He's great, actually. John's a great guy."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7114.67,"end":7122.35,"speaker":"Fr Stephen De Young","text":"Give him a big head. Come on. He's fine. I mean, he's solid."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7123.07,"end":7213.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, yeah, we're talking theophany. And again, this is not the baptism episode. That was another episode. This is not the great blessing of water episode. That was another episode. Although of course, those are closely related to this. This is, this is about the actual feast day itself, the event in the Jordan. Yeah, yeah, good stuff. And we're, you know, if you're listening to this live, especially if you're on the new calendar, we're in the theophany post festival period, it's going to be lasting for a few more days. So if you're on the old calendar, we're prepping you. Yeah, yeah, you're on the old calendar. It's just what, a week and a half or so away? Something like that. Yeah. So eight days. No, eight days, yeah. So a week in a day. So. Yes. All right. So you know million dollar question in that great hymn from Holy Week that we hear both on Holy Thursday night and then Holy Friday morning, you know, the, the hymn that begins, he is suspended on the tree, who suspended the earth over the waters. One of the things it says in there is he receives smiting or he's slapped in the face, depending on which translation you're reading. He who freed Adam in the Jordan. So how does he, how does he free Adam in the Jordan? Like how. What happens in the Jordan? How is that about Adam being. Being saved?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7214.5,"end":7221.42,"speaker":"Fr Stephen De Young","text":"Right. So I'm assuming you misspoke because the million dollar question would mean that when I answer this, you give me a million dollars."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7221.66,"end":7223.58,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, I'll write you a check."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7226.22,"end":7227.02,"speaker":"Fr Stephen De Young","text":"Don't bother."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7227.58,"end":7229.94,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I can't guarantee what it'll do when you try to, you know."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7229.94,"end":7244.14,"speaker":"Fr Stephen De Young","text":"Yeah, positive. Exactly. Oh, I can. But so. Right, so. And it's not that that Pascal him is a great example, but there are a bunch of other places."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7244.67,"end":7245.71,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7245.95,"end":7339.11,"speaker":"Fr Stephen De Young","text":"Leading up to in the theophany, liturgics, the hymns in the post theophany period season that talk about Christ saving Adam. Right. In some sense. Right. Sometimes with the word save. Right. As the verb, other times with other similar verbs. But this idea that at the ophany, at this event of Christ's baptism, right. Adam is saved. And we've already kind of alluded to where we're going with this. Right. That's what we've sort of built up to in the second half. Is that where we're going, is that Christ incarnate wins this victory over Adam's ancient enemy, the devil. Right. But to really sort of understand the fullness of what this means, we need to talk a little more about the Incarnation, right. And some of this, a fair amount of this is sort of bug squashing. It's sort of we have some kind of bad ideas or bad habits of thought about this, right. That need to get kind of squished to help us understand. So want to be clear, right off the bat, we already kind of said this about the question about angels repenting, right. We're not talking about mechanisms Here we're not going to explain to you how the Incarnation works."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7340.63,"end":7341.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7341.11,"end":7341.59,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7342.63,"end":7350.07,"speaker":"Fr Andrew Stephen Damick","text":"I think it's important to remember everybody, it is God who saves. Right? That's how it works. God saves."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7350.23,"end":7358.08,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. So, yeah. Or the other good answer to how it works, if you want to go with the hypnography of the Church, is ineffably."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7358.64,"end":7359.36,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7359.76,"end":7368.32,"speaker":"Fr Stephen De Young","text":"Ineffable is a beautiful word because ineffable means unable to be described in words, which is kind of ironic because there's a word for it."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7368.32,"end":7371.68,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, saying I'm at a loss for words. He says in words."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7372.08,"end":7406.33,"speaker":"Fr Stephen De Young","text":"Yes. But, yeah, so, yes, the Incarnation happens ineffably. That's how it works. But we're approaching this from, as we've said many times before, what the Incarnation does in the sense of what the Incarnation accomplishes. Right. What its ongoing meaning is in various regards. And again, this is not exhaustive, Right? No episode of this show ever is exhaustive. You may have noticed this if you've listened to many episodes."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7406.57,"end":7408.25,"speaker":"Fr Andrew Stephen Damick","text":"Exhausting, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7408.41,"end":7409.77,"speaker":"Fr Stephen De Young","text":"Exhausting, definitely."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7410.09,"end":7410.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7411.37,"end":7415.93,"speaker":"Fr Stephen De Young","text":"Definitely not for me. I'm perpetually reinvigorated."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7416.01,"end":7421.37,"speaker":"Fr Andrew Stephen Damick","text":"But once again, Father Andrew is up past his bedtime."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7423.29,"end":7443.2,"speaker":"Fr Stephen De Young","text":"But they're not exhaustive. Right. We come back to these things. I mean, we already did an episode of the Great Blessing of Waters at Theophany, and here we are again. Right. So trust me, there's no claim here that we're now going to give you a thorough explication of the Incarnation of Christ. There is no such thing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7443.52,"end":7443.92,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7444.4,"end":7463.4,"speaker":"Fr Stephen De Young","text":"Right. Even from the perspective of meaning and what it accomplishes, there's no completely comprehensive description. Right. We could keep this show running for another 25 years, do every episode on this topic and not get done. Okay. If we were trying to be exhaustive, but that would be exhausting. So we're not going to do that."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7464.84,"end":7467,"speaker":"Fr Andrew Stephen Damick","text":"Except for you, or perpetually reinvigorate."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7467,"end":7558.21,"speaker":"Fr Stephen De Young","text":"Yes, yes, Well, I could, but I'm not going to. I just don't want to. So where do we start with the Incarnation? Well, in terms of defining it in terms of the language that the tradition, the Christian tradition has given to us, this is really the Christian tradition. This is Third Ecumenical Council stuff. Right. And the Third Ecumenical Council, which John Calvin at least claimed in writing he disagreed with, none of that's highly debatable. But. Right. So Third Ecumenical Council, Condemnation of historianism, First Christological Council. This is universal Christian stuff. Right. Or at least it used to be in the good old days, before people could just identify as Christian and believe all kinds of crazy things. But I choose to live in the world of the past. That language that we have about the Incarnation is that Christ is a divine person. Right. One of the three divine persons. One of the three persons who shares in the divine nature. Right. The Father, the Son, the Holy Spirit. Christ is one of them. He is the Son who takes upon himself human nature. That is the language. Yeah, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7558.45,"end":7565.62,"speaker":"Fr Andrew Stephen Damick","text":"There's. There's other language as well. Like, there's like Saint Maximus talks about him being a composite person."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7566.1,"end":7570.9,"speaker":"Fr Stephen De Young","text":"Right. And there's the. What? We could go. Just go to Chalcedon and there's other language, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7570.9,"end":7572.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, exactly. Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7572.74,"end":7576.34,"speaker":"Fr Stephen De Young","text":"100 years later. But this is 120 years later. This is where we're starting, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7576.42,"end":7576.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7578.66,"end":7606.62,"speaker":"Fr Stephen De Young","text":"Christ is a divine person, takes upon himself human nature. Right. But even that, even this language. Right. Is now greatly misunderstood. Right. And part of that, as we've talked about many times before on the show, one of the perils of the English language, Latin, has the same problem, is that English tends to reify things."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7607.74,"end":7608.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7608.1,"end":7609.9,"speaker":"Fr Stephen De Young","text":"Meaning that turn things into things."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7610.22,"end":7618.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When we see the word nature, we think that, like, nature is a thing. A thing. Like a. Like somebody even will say, he took on a human nature."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7619.35,"end":7641.84,"speaker":"Fr Stephen De Young","text":"Right, right. As if that's a thing. That's an isolatable, describable thing that exists in time and space. A human nature. Right, right. Even sometimes I will hear people, not super informed people, but I'll hear people say, well, you know, an icon of Christ is just a depiction of his human nature."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7643.76,"end":7646.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7646.96,"end":7684.97,"speaker":"Fr Stephen De Young","text":"Which is fascinating me to me, because if someone told me draw a human nature, I don't know what I would draw. Yeah, right. Like I could draw a human person, but I don't know how I would draw a human nature. That's because a human nature is not a thing. And the language I used was very deliberate about Christ being a divine person, meaning he's one of the three persons who share in the divine nature. A nature is something that is shared among hypostasis, among persons, among individual existence."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7685.13,"end":7685.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7686.41,"end":7849.35,"speaker":"Fr Stephen De Young","text":"So all the dogs in the world share the canine nature. Right. A dog is not a creature that has, like a canine nature attached to it in some way. Right. And I could draw a bad. I have no artistic talent, but I could draw a bad picture of one of my heathen dogs, but I could not draw a picture of its canine nature. Right. Because that's not a thing. Right. So human nature is what is shared by all humans. This sharing, by the way, is what consubstantial means. It's what homoosios means. That's the language from Chalcedon that Christ, according to divine nature, is homoosios with the Father and the Spirit, and according to his human nature is homoosios with all of us. Yeah, yeah, all 8 billion of us right now, plus all the ones who came before. So that nature is what is shared. Right. And we've talked about this before, but as a reminder, the way that the. The Greek term nature, feces is not a biblical term. It really isn't. It starts to show up in the New Testament in St. Paul in particular, but he. And I'm not going to go into this right now, but he repurposes it. He uses it in a very different way then it was commonly used in Greek before that. It's not in the Greek Old Testament tradition. But feces comes to be used in Christian theology the way body was used previously in sort of Semitic thought. This is. And so remember our definition of body on the show? It's a nexus of potentialities and powers. Right? So when we say, right, Christ is a divine person, right. We mean he is a person who possesses all of the things that it means to be God. Yes, right. All the powers, all the things, whatever we want to talk about attributes. However, whatever language we want to use when we're talking about the Father, Christ has the same thing, right? That's what we mean by him sharing in the divine nature and him taking upon himself our human nature then means he adds to. That adds human powers and potentialities. So now he can sleep, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7849.59,"end":7852.11,"speaker":"Fr Andrew Stephen Damick","text":"He can do all those things that humans do."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7852.11,"end":7856.96,"speaker":"Fr Stephen De Young","text":"And now he can voluntarily grow hungry, right? And tired and all of these things."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7857.68,"end":7907.02,"speaker":"Fr Andrew Stephen Damick","text":"And the Third Ecumenical Council has. I mean, there's a big pile of language related to this. Like, it's really driven home if you read the actual texts. But there's one that's sort of half a sentence that expresses this in a pretty compact way. And it says, for the scripture has not said that the word united to himself the person of man, but that he was made flesh. Made flesh, Right? So that's straight out of John 1, and of course, lots of stuff in St. Paul as well. But again, the idea that he's made flesh, meaning that he now has our human abilities, you know, he is what it means to be human as well."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7907.5,"end":7974.4,"speaker":"Fr Stephen De Young","text":"Right. So there is not this sort of human person, Jesus, the man Jesus. Right. Or whatever we want to say. And then the Logos or God, the Son or the Son of God, or however we want to describe it. Right. As these two sort of separate entities. Right. Not even separateable in speech. Right. But the one divine person takes upon himself these human potential voluntarily. Right. These human potentialities and powers which are. Which are added. Right. That added is also very important. Right. And not understanding this has led to some really horrible and destructive theology at the fringes of Protestantism. This isn't mainstream Protestant stuff. This is. This is fringe Protestant stuff. I'm looking at you, Bethel. Why'd you name yourself after one of the places where there was a golden calf anyway?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7975.92,"end":7977.28,"speaker":"Fr Andrew Stephen Damick","text":"Fringe and cringe."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7977.28,"end":7990.13,"speaker":"Fr Stephen De Young","text":"It ended up being appropriate. Wow. Right. In that. The way it gets talked about a lot and in really extreme ways in those circles, but in less extreme ways in a lot of other circles."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7991.88,"end":7992.12,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":7992.52,"end":8017.81,"speaker":"Fr Stephen De Young","text":"The idea that rather than seeing Christ continuing to be God in the full and complete sense in the Incarnation, but taking upon himself also human potentialities, powers that taking on the becoming human, taking on those human aspects somehow meant he had to give up some aspects of his divinity."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8018.13,"end":8019.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When they see that or put them."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8019.77,"end":8021.65,"speaker":"Fr Stephen De Young","text":"On hold or whatever."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8021.65,"end":8028.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He set it aside. Yeah. Like, and this is theoretically based on the language of him emptying himself."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8028.29,"end":8029.13,"speaker":"Fr Stephen De Young","text":"Right. Kenosis."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8029.13,"end":8035.73,"speaker":"Fr Andrew Stephen Damick","text":"And so they sort of literalize that, you know, like he emptied something out."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8036.37,"end":8072.43,"speaker":"Fr Stephen De Young","text":"Right. And the, the. If you read Philippians 2, the karma Christie there, we've read it on the show in a past episode, but it's very clear what that self emptying is talking about. It's talking about Christ pouring himself out, even to death on the cross. His humiliation. Right. And humility and suffering and death. That's what that emptying is. It's not talking about him stopping being God. And even if you can't see how catastrophic it is on the one side. Right. Meaning on the other side, say, oh, well, he kind of put that stuff on hold to be human for a while."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8072.51,"end":8072.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8072.87,"end":8083.1,"speaker":"Fr Stephen De Young","text":"Even if you can't see how destructive and wrong that is on that side, what does that mean on the other side? What does that mean when Christ descends into heaven?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8083.5,"end":8085.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I've seen people."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8085.34,"end":8087.26,"speaker":"Fr Stephen De Young","text":"Is he not human anymore because he's."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8087.26,"end":8092.86,"speaker":"Fr Andrew Stephen Damick","text":"God again now that he leaves being? You know, he transforms into human and he kind of transforms back."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8093.82,"end":8126.98,"speaker":"Fr Stephen De Young","text":"Yeah. Because see, that's where it really becomes a problem. Right. It's not so much the divinity on hold that's this horrible heresy. That's wrong. But it's a destructive sort of heresy. But the other half, that Christ somehow ceases being human. Right. In any sense. Ceases being human I won't name anyone, but in any sense ceases being a male human. This is rank heresy that destroys the gospel."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8127.94,"end":8130.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep, yep."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8130.02,"end":8147.4,"speaker":"Fr Stephen De Young","text":"Right. Rank heresy. Rank referring to the smell. Yeah. William Lane Craig, level. Yeah. Wow. But fortunately not on all topics like William Lane Craig."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8147.4,"end":8150.88,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you've got the sin of Jeroboam, son of Nabat, and then you've."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8150.88,"end":8171.05,"speaker":"Fr Stephen De Young","text":"Got William Lane Craig instead of William Lane Craig, except his is just ubiquitous theological error. Wow. Being fractally wrong. Right. So Christ doesn't give up anything. And we have a prayer that we pray very frequently as priests of the Orthodox Church about Christ. Right. That cry in the grave with the body."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8171.05,"end":8178.65,"speaker":"Fr Andrew Stephen Damick","text":"Grave with the body, but in haze with the soul. Is God in paradise with the thief and the throne, with the Father and the Spirit, Wast thou, Christ filling all things thyself uncircumscribed?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8178.73,"end":8194.49,"speaker":"Fr Stephen De Young","text":"Right. So at the Incarnation, Christ does not leave the throne of the Father. Right, Right. When he rises from the dead, he doesn't leave paradise with the thief. Right. He's not like, I'll be back 40 days."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8194.97,"end":8196.89,"speaker":"Fr Andrew Stephen Damick","text":"See you. See you, Dismas."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8197.21,"end":8197.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8198.09,"end":8198.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8202.73,"end":8210.97,"speaker":"Fr Stephen De Young","text":"And he doesn't even. This is key, too. He rises from the dead. He doesn't leave Hades either. But it's a whole other thing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8211.29,"end":8212.25,"speaker":"Fr Andrew Stephen Damick","text":"That's another story."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8213.77,"end":8376.98,"speaker":"Fr Stephen De Young","text":"Read Ephesians anyway, so. Right. And so what we're getting at here, this is another question. I know this is a thing that makes people's wheels grind. I don't know. That makes heads explode, but it makes wheels grind. The way we've talked about Christ being sort of eternally incarnate. Right. In a sense. Right. Part of the core of this. And we're going to be. Here's a teaser post. Pau Jo Fest. We're going to be going deep into this in a series of episodes. But part of this is how we view identity. The identity of a person, including in this case, the identity of Christ. Right. But this extends to the identity of any given person, and that's that we sometimes, only sometimes, tend to recognize that the identity of a person is continuous over time. I'm going to unpack that. Right. I'm going to unpack that. So we tend to get this retrospectively. We look back on our life, Right. And I think about based on my memories or looking at old pictures, right? Me when I was seven, right? Nightmarish child, I say, were you ever seven? Out of control? I was seven. I was not small, but I was seven and a terror. But me and seven, right. I would say that's me at seven, Right? That's still me. Right. I am the same person that is now. I'm not. That's not a different person now. I might say I'm a different person now than I was in the past. Meaning I have changed. Right. But it's still me that's changed. Yeah, right. Like I wasn't literally. Like I didn't go through a Star Trek transporter and get re put back together. Right. And what I mean by that is, yes, it's true. Every time someone uses a transporter in Star Trek, they die and are clones."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8377.3,"end":8379.06,"speaker":"Fr Andrew Stephen Damick","text":"It's one impossibility."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8379.46,"end":8381.22,"speaker":"Fr Stephen De Young","text":"Bones was right the whole time."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8385.14,"end":8386.66,"speaker":"Fr Andrew Stephen Damick","text":"How many Rikers are there?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8386.74,"end":8511.8,"speaker":"Fr Stephen De Young","text":"Sorry. Yeah, but so I'm not literally a different person, right? So we kind of understand that retrospectively, but we don't understand that prospectively. And here's what I mean by that. I don't know that we'd recognize that the seven year old me was already me, the me I am today. Right, Right. Then when you talk about me, my identity is not a snapshot, right? Or a series of snapshots in that my identity is sort of protean and shifts every second, right. We've talked about how the matter in my body. Yeah. Every few years gets sloughed off. It gets replaced by a completely different matter. Right? And that's why we talked about identity is not a function of being composed of the same matter. Remember the boat of Theseus? So identity is not being composed of the same material. Right? But identity is what carries through all of that, right? And so when we talk about who a person is, right. We're not talking about this snapshot of some particular time in their life, but we're talking about the whole span of their life. Here's a place where we understand this clearly, okay? When we talk about a saint, so we talk about St. Nicholas, right? When we talk about St. Nicholas and we tell the story of the life of St Nicholas, we don't start it with like, Nicholas was born, and then there's at some point in his life where he achieves the status or transforms into St. Nicholas. Right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8512.2,"end":8514.84,"speaker":"Fr Andrew Stephen Damick","text":"Right. You always just say St. Nicholas, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8515,"end":8561.34,"speaker":"Fr Stephen De Young","text":"He's St. Nicholas from start to finish. Because the person, St. Nicholas, that whole story is his identity is who St. Nicholas is. Right. We're not just talking about any given snapshot. An example, an opposite example, Tertullian, not a saint, right. Not a saint. Was an important writer and theologian within the church for a chunk of his life, right. And then ends up joining The Montanists joins a heretical sect, right? And that's where he ends his life, Right? We don't say, well, he was Saint Tertullian until he joined the Montanists."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8562.46,"end":8562.86,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8563.26,"end":8788.84,"speaker":"Fr Stephen De Young","text":"And then he stopped being holy. Right. Rather, we talk about him in terms of his life as a whole. His identity is his whole life. Right? His whole life. And that's why you have saints who are penitent, Right. When we talk about David in the Old Testament, we're not just taking a snapshot because there are some pretty bad snapshots, the whole Bathsheba thing, right? But we're talking about his whole life, right? That's who the prophet and King David is, Right? His whole life. And so the same is true of Christ. When we talk about Christ, we're talking about Christ. We're talking about his entire existence, which means we're talking about his eternal existence and his whole earthly life. That's his identity, right? So Ricky Bobby is incorrect in Talladega Nights. You cannot choose the baby Jesus as your favorite Jesus. You know, they did that for comedy. But we're just coming out of the Christmas season. I think a lot of people's favorite Jesus is the baby Jesus. Yeah, right. Baby Jesus doesn't tell you to do things you don't want to do. He's just cute and you can come and adore him, right? You get to take these slices, right? These snapshots, right? But at the same time, right? When his mother, St. Joseph, the Magi, the shepherds, at different times, by the way, were looking at the baby Jesus, they were seeing Christ. They were seeing the divine Logos. They were seeing God, they were seeing Christ. They were seeing the one who's crucified for the foundation of the world. They're seeing the one who's resurrected. They're seeing the one who's seated at the right hand of the Father. They're seeing him. And all of that is his identity, right? So identity, the identity of a person, right? Like this is one for us as humans, right? And we've talked about this before on the show. And again, like I said, we're going to go deep into this in a series, in a few weeks, in a couple of months. For us as humans, we sort of. Our identity, who we are sort of unfolds and is worked out in time and space because we experience reality within the categories of time and space, right? So for us, we sort of become who we are and come to understand who we are, right? And this unfolds and we participate in it and come to understand it. But we can't do that with Christ because Christ is God, right? We, we don't understand how a bat experiences things, let alone how God experiences things, right? So we don't know how God experiences his Godhood, right? Like, I mean that's even that language is silly, right? In the sense that. Like what? Right? Like, so that spiritual reality, right? Is eternal. Christ is eternal, right? And this way of describing it has to be true. Why does it have to be true for Hebrews to be true?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8789.88,"end":8797.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where it says Jesus Christ is the same yesterday and today and forever, right?"}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8797.88,"end":8799.88,"speaker":"Fr Stephen De Young","text":"It's not just today and forever."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8801.88,"end":8802.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":8802.84,"end":9116.24,"speaker":"Fr Stephen De Young","text":"It's also yesterday. Even if the yesterday that we're talking about is when he was 15 in Nazareth, right? Or before his birth in Bethlehem or before his conception, right? All of those yesterdays he was the same as he is today and will be forever, right? That's what Hebrews is getting at. And so because once we start to get at and again, this is not something we can explain and comprehend and explain how it works. This is something we can describe the outline of and sort of wonder at, right? The incarnation, it's ineffable. But as we start to understand this, right? We could see how bad it is a destructive of our real understanding of who Christ is to try and psychologize him, right? To try to attribute, well, he must have had some separate human consciousness like ours, right? And try and say, well, since Jesus is man, we can understand how he experienced. How did he experience being God? As a man, right? He's not a man, right. He's taken our human nature, right? That doesn't work. We don't know what it's like to be God, right? So all of those kinds of things, any, anytime you hear anyone interpreting anything in scripture or doing anything theologically that requires you, that requires entering into the head of Jesus and what Jesus knew and when he knew it and those kind of things. Run, don't walk, right? That's not going to go anywhere good. And people will go there with no ill intent, no ill intent whatsoever. Completely well meaning people will wander off into those woods. But they're woods, they're dark, scary woods and you just stay out of them, right? And, and as we've talked about before, right? Just as Christ's entry into the waters purifies the waters, right? This victory, right? Christ's entry into our humanity purifies our humanity, the humanity he shares with us. So this victory of his that's described by the gospel isn't just an individual victory for him. Not just even the victory of Yahweh anymore, victory of God, but it's also our victory, right? And Christ shares the spoils of that victory that he's won with the rest of us. This is one of the fundamental building blocks to understanding salvation in the New Testament. This idea of Christ winning this victory and then sharing with us and the spoils, right? And finally Christ's victory where Adam failed, Adam ends up naked and then being clothed with the garments of skin, right? In Christ, right? Our humanity is reclothed, as St. Paul says in 1 Corinthians 15, with immortality, not with mortality, but with immortality now with the divine life and the divine glory that belong to Christ, right? And so this metaphor of being reclothed, getting rid of the garments of skin and those being replaced by these new garments, right. Is a major, sorry, Calvinist thing. This is not about earned merits, earned credit, good deeds, credit with God that earns salvation, whether earned by us or by Christ. That, that's not in the picture, right? We're clothed with who Christ is, right? With who Christ is. As many of you as have been baptized into Christ have put on Christ, right? Not put on Christ deeds, not put on his daughter, but put on Christ who He is. He became who we are so we could become who he is, right? And so this gives us, again, I would say it's a full orbed picture, again, not even close to a comprehensive picture, right. An outline of something that we can look at, right. Of what it means that in this moment, this moment which is really described as this showdown, this moment of battle, the beginning of this reconquest of the baptism of Christ, right? This is the victory then in Christ of humanity over our ancient enemy. And Adam gets saved in those waters."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":9118.08,"end":9607.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For my final bit, I wanted to share one of the many hymns of Theophany. As I said at the beginning, I mean, there are Christian groups out there that don't have theophany. And I feel so bad. I'm not, you know, like I'm really, I'm not trying to be disdainful, but I just feel so bad that some people don't get to do this. I remember when I became Orthodox that the Feast of Theophany was just like a revelation to me. Certainly, you know, as a Christian, I had always believed that Jesus was baptized, but I had no idea really what it was for, honestly. And then encountering the Feast of Theophany was just astonishing to me. And there are many, many, many, many hymns connected with the Feast, but I just wanted to share one of them. And this comes from the Vespers of Theophany, which in most years is going to be part of the vesperal Divine Liturgy that is celebrated on the day before. So on the 5th of January. In some years it's in great Vespers the night before, but in most years it's going to be the Divine Liturgy on the day before the 5th. So this is from towards the end of the. The hymns that are connected with the. The psalm Lord, I have cried. And it says this. When thou didst choose to save lost man, thou does not disdain to put on the likeness of a servant, for it was meet for thee, O Lord God, to accept what is ours for our sakes. For when thou hast baptized in the flesh, O Redeemer, Thou didst make us worthy of forgiveness. Wherefore we cry to Thee, O Christ, our benevolent God, glory to Thee. And I mean, in a lot of ways, this hymn summarizes a lot of what we were just talking about, especially a lot of the Christological stuff. But it's interesting, you know, again, this is. This is the feast of the Incarnation. And this hymn explicitly talks about the Incarnation, that Christ accepted what is ours, human nature, for our sakes. He did it for us, and when. And it says also he took on the form of a servant, you know, that he. He humbled himself, right? But it also says that when he was baptized in the flesh, and it calls him O Redeemer. This is part of the. This is the redemption of human nature. O Redeemer. It says, thou didst make us worthy of forgiveness. Which is an interesting thing to say. Some people might object to that. Say, Warren, isn't everybody worthy of forgiveness? And the answer is yes, everyone is worthy of forgiveness because of what he did there. But that doesn't mean it's a matter of like, okay, we were valueless before. We were just trash. But what it means is that we're now capable of receiving it. Like, it sort of. It opens the door, right? We're counted. It's now fitting for us to receive forgiveness, but it's not an automatic thing and it's not imposed on us. Forgiveness is not imposed on mankind. The reception of it requires our cooperation. Like, the door is open, but we have to walk through it, right? We have to participate in it. You know that what Christ does in the Jordan is for us, for Adam, for all of mankind. It's for us, but we can't receive it if we don't participate in it. And participation, number one is through baptism. When we're baptized, we receive the blessing of the Jordan, the blessing that Christ gave, the purification, the atonement that Christ gave to the Jordan through baptism. But we also receive, speaking of this feast, in particular, this blessing by celebrating the feast, right? And I mean this. Like I said, this is my experience. I had never received the blessing of theophany until I celebrated the feast. And if you haven't ever done it, then you don't. You're not going to know what I'm talking about. So if that makes you feel sad, then, you know, go do it. Go participate, right? And then also like someone who lives into this. So it's not just about going and celebrating the feast day at church, but also at home. There's things to do at home that are related to this. Get your house blessed, for instance, by the priest, sing the hymns together at home, especially like before meals and family prayer time and stuff. But when you live into this, when you are actually participating and you're conforming your whole life to what Christ does in the Jordan, then you become a theophanic person. Of course, theophany means the appearing of God. God is manifest in the flesh in this river, but then in you. In you. And a theophanic person then is one who, in whom God is manifest. And it's not just a private personal experience. That is an experience for the people around you as well. When you live theophanically, people will want to be baptized, will be baptized, right? So theophanic mother and father, their children are baptized, but also their friends and their family are going to be drawn into this as well. If they're not already baptized. They're also going to be drawn into the celebration of the feast. They're going to be drawn into all of these things because we're all called, as we said, when we put on Christ in baptism, then others will approach, and then they approach Christ. They're not approaching you, they're approaching Christ. They're not approaching me, they're approaching Christ. So it's this moment of Christ's baptism in the Jordan, this moment of theophany has this cosmic impact, right? And it participates in all of the great acts of salvation that happen in the life of Christ. There's an image here also of his harrowing of Hades. Like, he stands in the waters, he stands in the abyss. He stands over the mouth of death, right? But he's not swallowed up. He defeats it all. He defeats the chaos, he defeats the death, he defeats the destruction, right? There's so many things about the life of Christ. You can see them sort of all nested in each other. That's just one example. Right. And we've talked about a few others. So, yeah, read the hymns. If you missed the feast, if you're on the new calendar, read the hymns. You know, it still is in the immediate future, if you're still celebrating according to the Julian calendar, so you can go and do that. That'll be the 18th and 19th for those people. But yeah, at least read, read the hymns. They're just astonishing. It's just magnificent. I just read you just one of them, but there's so much more, so much more. So, so powerful. Thanks be to God. Father Stephen, your final thoughts."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":9610.12,"end":9994.66,"speaker":"Fr Stephen De Young","text":"So one of the things that comes with adolescence and my life is nothing if not an extended adolescence, is a certain level of disgust with oneself. It doesn't matter how happy and well adjusted you seemed as a younger kid, you hit adolescence and all of a sudden you decide that in reality you are ugly and stupid and dumb and everything's wrong about you and you're clumsy and no one likes you and everyone hates you and you're going to go eat a worm. And I think for most people, even those who don't have a radically extended adolescence, that feeling and that sensation stays around for a long time. And in adolescence especially, it's especially obvious. At least it'll manifest in this kind of series of sort of cosplays as potential other yous or actually as other people who you wish you were instead of yourself. You try to look like that person would look, or dress like how they would dress, or write the bad poetry they would write. You try to find some kind of identity other than your own that would be better, less gross. Maybe a post production we can get somebody to play a slowed down version of Radiohead's Creep in the background or something. But that's real and it continues for a lot of people well into adulthood. The Internet has made it easy, right? You could just full on pretend to be that other person online and hope no one ever finds out. Even adults, though, continue to try on these different potential selves other than themselves, these other identities. And part of the problem with those other identities is that you can't ever actually become that other person who isn't you. You try and make yourself look like them. You could try and make yourself act like them, but you're acting, you're cosplaying, you're pretending. When I was six, I wanted to be Spider man, didn't matter how many spiders I let bite me, I wasn't gonna be Spider Man. But the thing is, there is someone better than me, more human than me, more real than me, who I can actually become. And that's Christ, of course. You know, I don't mean I could become another Christ. I don't mean I could become a God. That's not what I'm talking about. Right, but who Christ is, right? The gospel is that I can become that. And that doesn't mean ceasing being me. It means the opposite. It means the opposite because when we look at the saints, we see thousands of people who became Christians, who are formed into the likeness of Christ, poured into Christ as a mold, their identity shaped by his identity. They put on Christ in their baptism, and they lived it out in their life, taken as a whole. But each of them is also different from each other. They lived different lives. They look different. They lived in different places, in different times, in different cultures. They died different deaths. They lived different lengths of time. And it's only in those differences, once we've put on Christ, once we've become like Christ, it is in those differences, those uniquenesses of the way in which we bring Christ into the world. That's where we find our actual identity. That bit, Right, that bit. If I ever were to achieve it, if I ever were to be formed into the fully formed in the likeness of Christ, that uniqueness, that would be who Father Stephen DeYoung actually is. That would be my actual identity. So if rather than trying not to be father Stephen DeYoung and to be someone else who's prettier and smarter and better looking and has better teeth and a nice smile and is loved by everyone, rather than trying to be this fictional, imaginary person, whoever else I might want to imagine myself to be, if what I pursue in my life is Christ, if what I seek to live out in my life is Christ, then that's where I'll find out who I actually am. And that's where all those doubts about who I am, all those misgivings about who I am, all that shame about who I am, all that disgust at who I think I might actually be, that's when all that goes away. That's how someone actually finds themselves. That's how someone actually becomes human. And I think that that promise of the Gospel is the core of what we're really celebrating, the core of the promise to us that is given to us by the Feast of Theophany."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":9995.03,"end":10020.31,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's our show for tonight. Everybody, thank you very much for listening. If you didn't happen to give us a call tonight, we'd still like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page. You can also leave us a voicemail@speakpipe.com LordOfSpirits if you have basic questions about Orthodox Christianity or you need help finding a parish, head over to Orthodox Intro."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":10021.92,"end":10026.88,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":10028.24,"end":10041.04,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, follow our page. Join our discussion group. Leave reviews and ratings in all the appropriate and even inappropriate places. But most importantly, share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":10041.44,"end":10057.29,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to acebaith.com stroke support and help make sure we and lots of other AFR population podcast or stay on the air. And folks, if you're in the market for a bidet, let me recommend hello Tushy Bidet System. Easy to install on a cold winter morning. Absolutely bracing."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":10058.57,"end":10061.69,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you."}
{"episode_id":"LOS - #084 - 2024-01-11 - Waiter, There's Gods in the Water","start":10066.57,"end":10103.79,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
