{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":0.56,"end":65.17,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":66.45,"end":126.47,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Christ is risen. He truly is risen. Welcome giant killers and dragon slayers. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana. We are recording live, but we're not going to be taking any phone calls tonight. That said, if you leave a question on our Facebook or our ancient faith YouTube streams and we spot it, it is possible that we might take and respond. So tonight our topic is prophets. What is prophecy? Who is a prophet? Do prophets predict the future? Does prophecy still happen in our times? What's the difference between a prophet and apostle? How can we recognize a true prophet or prophecy? What about people who claim to have prophecies even now? So it's been a while since we did this. Few episodes maybe, but we always love going back to the ancient near east and it turns out that there is a larger context for prophecy than just what we see in the Bible. So where are we starting tonight?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":126.47,"end":145.39,"speaker":"Fr Stephen De Young","text":"Father Stephen Well, I'm starting with a disclaimer, okay. Because I know ancient faith is a big tent, right. You have lots of different podcasts, lots of different voices, lots of different opinions. But that guy whose podcast you were playing right before we went on the air."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":145.39,"end":146.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, that guy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":146.51,"end":149.07,"speaker":"Fr Stephen De Young","text":"I do not want to be associated with him in any way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":150.17,"end":150.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":150.49,"end":155.85,"speaker":"Fr Stephen De Young","text":"So I disavow that person and everything he has ever said that's good just for the record."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":156.81,"end":157.69,"speaker":"Fr Andrew Stephen Damick","text":"Well, thanks for that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":157.69,"end":162.41,"speaker":"Fr Stephen De Young","text":"So that taken care of, Right. We can now move on."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":162.41,"end":162.81,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":163.05,"end":168.73,"speaker":"Fr Stephen De Young","text":"Right. So we're starting. Yeah, we're starting in the ancient Near East."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":168.97,"end":169.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":169.85,"end":180.35,"speaker":"Fr Stephen De Young","text":"That's a broad swath, sort of the earliest written Material we're going to be starting with is going to come from the 18th century B.C."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":180.83,"end":181.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":181.63,"end":185.63,"speaker":"Fr Stephen De Young","text":"So the 1700s B.C. so for us, relatively recently."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":186.03,"end":186.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":187.87,"end":230.57,"speaker":"Fr Stephen De Young","text":"And now this is. I say that that is not sort of when the idea of a prophet or prophecy sort of begins. Right. This is just sort of the earliest written sources we have that we found so far that we have to talk about Right. Tonight. But by the time we get there, the idea of prophets and prophecy are already established. Right. There are already multiple terms in different Semitic languages for prophets and prophecy. The idea of a prophet is a known quantity."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":230.73,"end":231.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":231.01,"end":324.93,"speaker":"Fr Stephen De Young","text":"So someone is identified as a prophet. People know what that means already. So this is something that goes back centuries and centuries and centuries before even the 18th century B.C. but we have to start where we have sort of data and records, Right, exactly. In terms of getting specific. But before we get specific, we'll get a little general. Right. Because we have to first kind of talk about what prophecy was in a broad sense. So a lot of times today when people talk about prophecy or call someone a prophet, it's about, as you kind of mentioned in your intro there, it's about predicting the future. People want to find a prophet who can tell them the future if they're in the stock market, they want to find a prophet who could prophesy prophets. But that's not really what it's about. That's not really what it's about. So prophecy as such is sort of a subspecies of divination, Right. Divining. And people may not have noticed before that divination involves the word divine, right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":325.01,"end":340.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's about talking to gods or some kind of spirit or, you know, trying to get some kind of knowledge that you could not otherwise know by, you know, divine divine assistance, you know, in some way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":340.35,"end":406.61,"speaker":"Fr Stephen De Young","text":"Right, Right. So there's a divine realm. Right. There's a divine perspective which is greater than the perspective of humans. Yeah, Right. So there is. There is a wisdom that divine beings have or an understanding or a knowledge that they have, a perspective that they had that human beings aren't otherwise privy to. And so divination as a broad category consists of various ways in which humans have or have tried to sort of access that wisdom or knowledge. Right. Either with the spirits themselves or through signs left by the spirits or some means by which spirits were thought to communicate. Now, that includes. Because as we've talked about many times, and we talked about this when we talked about apocalyptic. I know this includes the fact that divine beings have a different relationship with time than humans. Do."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":406.93,"end":414.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So they might know things that it seem like they're from the future or whatever."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":415.41,"end":442.78,"speaker":"Fr Stephen De Young","text":"Right, right. Or from the distant past. Right, right. Yeah. And we see this like for example in Isaiah when Yahweh, the God of Israel is talking about the gods of the nations and sort of comparing himself to them, he says, you know, who will tell you about the things of the past. Right. How the earth was formed, all these things, who will tell you about those things."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":443.67,"end":443.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":443.83,"end":452.87,"speaker":"Fr Stephen De Young","text":"In the future. Right. So that is implying that Yahweh, the God of Israel is the one who truly has this total and complete perspective."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":452.87,"end":453.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":453.67,"end":471.05,"speaker":"Fr Stephen De Young","text":"Unlike the fallen spirits who are the gods. Right. Who may have a greater knowledge or sense of these things than humans, but don't really have the knowledge and wisdom that, that the true God possesses."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":471.05,"end":479.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're much bigger and smarter than us, but they're not omniscient, they're not omnipotent, they're not omnipresent, they can't know everything."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":482.29,"end":504.33,"speaker":"Fr Stephen De Young","text":"So within divination you have a whole bunch of things. Right. And so a lot of these things in the ancient near east and the ancient near world in general are related to employing some kind of technique or reading signs. So the most, probably the most obvious and well known one of those today would be astrology."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":504.49,"end":504.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":504.93,"end":506.61,"speaker":"Fr Stephen De Young","text":"Looking at, we've talked about before, the."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":506.61,"end":508.49,"speaker":"Fr Andrew Stephen Damick","text":"Stars figuring out what's going on there."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":509.29,"end":544.07,"speaker":"Fr Stephen De Young","text":"Right. The stars and the planets are seen to be sort of divine beings. And so there could be some communication from the divine realm there that could be red. But again there's a technique there. Right. You have star charts. Right. You sit there and plot the movements of the constellations of the planets. Right. And so it's a person who's going to participate in that is going to be a specialist. Right. He's going to be somebody who has devoted this time and study to it. Fairly well known one would be Haruspex, plural Haruspices."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":547.19,"end":549.59,"speaker":"Fr Andrew Stephen Damick","text":"It's about guts. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":549.59,"end":559.5,"speaker":"Fr Stephen De Young","text":"Who we've also talked about before they got guts, who would read the, the entrails of sacrificial animals."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":559.5,"end":559.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":559.86,"end":560.42,"speaker":"Fr Stephen De Young","text":"For sight."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":560.42,"end":568.5,"speaker":"Fr Andrew Stephen Damick","text":"And there's, there's a whole like subspecies, well, not subspecies of that, but there's a whole other variant in this which is about watching animal movements. Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":568.66,"end":569.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":569.3,"end":584.88,"speaker":"Fr Andrew Stephen Damick","text":"Like, like my favorite is, is mirmomancy, you know, which is, you know, reading the signs by watching ants. But also a luromancy, which is about watching cats, I can't remember the term for birds. I don't know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":584.88,"end":587.84,"speaker":"Fr Stephen De Young","text":"But Theirs was actually more common than either of the others. Yes, yes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":587.84,"end":588.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":589.84,"end":590.56,"speaker":"Fr Stephen De Young","text":"For example."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":590.8,"end":597.44,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. But I love the idea that people. I mean, it's a real thing. People actually would watch ants to try to read the signs."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":598.64,"end":636.73,"speaker":"Fr Stephen De Young","text":"Right, right, right. Because, you know, built into the world. Right. There are spirits connected to all of these things. Right. And so those spirits could potentially communicate through them. But again, it's all technique. Right. So your haruspex has. We have a lot of them because they're fired clay, so they basically last forever. Livers and kidneys, like models with little notations on them of what to look for in different places. Right. So this is. Again, you're a specialist. Right. And this is what most pagan priests were, frankly, in the ancient world."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":637.13,"end":637.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":638.17,"end":668.98,"speaker":"Fr Stephen De Young","text":"Most pagan priests, they were not like preaching sermons and giving counseling. Right. They running parish council meetings. Yeah. Doing stewardship programs with a big thermometer. Yeah, no, they were. They were specialists. Right. So like if you go to the. The early. The old kingdom of Egypt, for example, and even the Middle Kingdom, like most of the priests were basically people who could read and write."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":669.22,"end":675.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And included in that then is reading signs, omens."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":676.02,"end":700.56,"speaker":"Fr Stephen De Young","text":"Right, right. So if you could read it, Right. You were a priest. Right. And you were in charge of keeping all the sacred texts, which texts contain the methods for reading all of these things. Right. So you're sort of preserving this knowledge. Right. And Harlow says was a priest, he knew how to read the signs of entrails. They knew these particular things. We see this in the Bible too, like when people are called in to interpret dreams by like Nebuchadnezzar."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":700.56,"end":702.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":702.32,"end":728.92,"speaker":"Fr Stephen De Young","text":"There were priests who. That was. Their job was. They were the. They. That was what they had studied and mastered. Right. Long time before Freud. Right. They figured out the interpretation of dreams. And. And so this is. It's. It's a specialist knowledge thing. Right. And that plays into a lot of the things we've talked about, like with. With the watchers of the Apkalu and this knowledge that gets revealed."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":728.92,"end":729.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":729.68,"end":795.05,"speaker":"Fr Stephen De Young","text":"And then. So. Yeah. So prophecy is also a subspecies of divination, but it's different than those other ones we've been talking about. Because unlike those, prophecy was not primarily. There are. There's exceptions to everything. Right. But for the most part, prophecy did not involve that kind of technique. Right. It was not about reading signs. It was about a direct. More direct encounter and direct relationship between the person who's considered a prophet and the deity. Yeah, right. Who. For whom they are a Prophet. And there is a relationship there where someone is a prophet of this God or this small group of gods. Right. They weren't just a prophet in general. And then different, you know, gods came and whispered in their ears. Right. There was an ongoing sort of direct relationship between them and some spiritual being."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":795.45,"end":795.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":796.01,"end":831.85,"speaker":"Fr Stephen De Young","text":"And that, that took a couple of forms in the sense that on one hand you have prophets, the way we tend to think about them, like in the Old Testament, where it's a question of contact and interaction between the two. Then you also have what are usually called oracles or some version of that. Right. Where the spirit actually like, possesses the person and like, literally speaks through them."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":833.21,"end":834.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":835.29,"end":843.29,"speaker":"Fr Stephen De Young","text":"So more like the, the council of the gods in moon night than, than your, your typical Hebrew prophet. I know you watched."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":843.29,"end":849.97,"speaker":"Fr Andrew Stephen Damick","text":"I, I know I haven't watched it yet. It's on my list. I don't know. I, I, I, I, Yeah, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":851.41,"end":856.69,"speaker":"Fr Stephen De Young","text":"So, but, so those are sort of, but in both of those cases it's direct."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":857.17,"end":857.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":857.73,"end":862.53,"speaker":"Fr Stephen De Young","text":"There's not sort of an intermediary of birds or ants or stars or guts."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":863.65,"end":864.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":864.21,"end":870.45,"speaker":"Fr Stephen De Young","text":"Through which, through which some kind of message is conveyed. It's a direct sort of relationship."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":870.53,"end":871.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":871.33,"end":877.09,"speaker":"Fr Stephen De Young","text":"And sort of the phenomenon of prophecy, from what we could tell, again we go by the evidence we have."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":878.85,"end":879.09,"speaker":"Fr Andrew Stephen Damick","text":"Seems."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":879.09,"end":892.61,"speaker":"Fr Stephen De Young","text":"To have primarily been a phenomenon in Semitic areas. So it's, it's less pronounced. You get more of other forms of divinity. Divination in Egypt, for example."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":892.85,"end":893.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":893.33,"end":956.36,"speaker":"Fr Stephen De Young","text":"There are some sort of prophet things that you would call prophecy as a phenomenon in Egypt. So it's not totally absent, but it's much less prominent than other types of, of divination in Egypt. We don't have really record of a lot of prophecy among the Hittites, for example, for an Indo European people. Yeah. But even among Semitic people in the near east, it's kind of a scattered thing. And again, we're going based on evidence. Right. So it may be less scattered than we think because we just don't have the, the text and stuff. But from what we can tell. Right. There are certain periods and certain places where this phenomenon comes to a great prominence and then others where we don't, don't find and read a lot about it. And that includes. Right. It's not purely fragmentary evidence because there are places and periods where we have a lot of written records and don't see much about prophecy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":956.61,"end":956.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":957.65,"end":968.37,"speaker":"Fr Stephen De Young","text":"Right. So it's not purely the fragmentary evidence, but we always have to have that as a proviso. Right. We Could. There could be a big textual find tomorrow that could change that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":968.85,"end":969.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":971.65,"end":1002.34,"speaker":"Fr Stephen De Young","text":"Hypothetically. So now we want to look at. Now that we've done that general kind of thing, we want to look at more in particular a couple of those places where sort of prophetic activity in the ancient near east sort of starts to flourish. And the first one of these, these are written records that come from before any part of the Bible was written down. Right. Because this is. We're talking now 18th century BC."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1004.42,"end":1005.94,"speaker":"Fr Andrew Stephen Damick","text":"Is that before Abraham even?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1006.02,"end":1009.22,"speaker":"Fr Stephen De Young","text":"Lord. Well, Abraham didn't write anything."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1009.22,"end":1009.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1009.99,"end":1012.07,"speaker":"Fr Stephen De Young","text":"But I mean, I don't know if you've been hanging out with Mormons."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1012.07,"end":1012.71,"speaker":"Fr Andrew Stephen Damick","text":"No, but."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1014.63,"end":1015.91,"speaker":"Fr Stephen De Young","text":"You actually did not."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1017.03,"end":1036.87,"speaker":"Fr Andrew Stephen Damick","text":"Little known fact about me, actually, I've been to more Mormon historical sites than most Mormons, which whenever I meet a Mormon and tell them that they're like, you are so blessed. I'm like, well, I'm interested in religious history, but that's so great. Do you feel. And like, no, I don't, but thank you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1037.82,"end":1044.54,"speaker":"Fr Stephen De Young","text":"So, anyway, I was physically ejected from the temple in Salt Lake City. But that's a story from another time."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1044.54,"end":1047.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it is. How many holy sites have you been ejected from?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1048.38,"end":1053.58,"speaker":"Fr Stephen De Young","text":"Probably less blessed and less great in the eyes of most of our LDS friends."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1053.74,"end":1059.66,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Have to use that one for a fundraiser."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1060.14,"end":1106.84,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So this is after Abraham lived, but I'm still bored by arguments about the date of Moses. But even on the earliest possible date, or I should say the earliest suggested date, that puts him in the 16th century BC. This is older. Right. By a couple centuries. Right. So no text that's currently in the Bible had been written down. Doesn't mean the stories didn't exist. Right. Doesn't mean things didn't happen. But nothing had been written down at the time of the writings we're about to talk about. And so these are usually called the Mari documents or the Mari letters."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1106.84,"end":1107.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1108.12,"end":1110.36,"speaker":"Fr Stephen De Young","text":"Because they're found in a city called Mari."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1110.44,"end":1113.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. M A R I. Right, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1113.32,"end":1117.16,"speaker":"Fr Stephen De Young","text":"Right. And so, yeah, super creative name for them."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1119.47,"end":1126.15,"speaker":"Fr Andrew Stephen Damick","text":"It's better than the usual way that documents get named where, you know, you get like a 36 or that, you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1126.15,"end":1133.15,"speaker":"Fr Stephen De Young","text":"Know, letter and a number. Yeah, yeah, yeah, yeah, yeah. Gothic. P46."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1133.23,"end":1133.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1135.15,"end":1149.16,"speaker":"Fr Stephen De Young","text":"So except if I ever let me vow today, if I ever find a trove of ancient documents like this, the letter before the numbers will be in Comic Sans. I'm doing it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1150.68,"end":1154.68,"speaker":"Fr Andrew Stephen Damick","text":"Wow. So a cruel joke for the ages."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1155.16,"end":1166.12,"speaker":"Fr Stephen De Young","text":"Yeah. So the Mari documents. Right. Or the Mari letters are from the city of Mari, which was in sort of the central Euphrates region. So part of Akkad."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1166.52,"end":1178.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And you know, folks, you can look this up. You can actually look up where this is on Wikipedia. Mari comma Syria, M A R I comma Syria. And you'll get cuneiform right there in the top. Hey."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1180.95,"end":1226.24,"speaker":"Fr Stephen De Young","text":"And yes, cuneiform. These are. These are clay tablets. That's why they survived. And so there was a massive trove of these. And a lot of them are communications for people who identify themselves as prophets and they're contained in here. Things referring to both male and female prophets of different gods. But this is also important because this is not just the example of prophecy, like the phenomenon of prophecy that we see in the scriptures, but these are also then writing prophets. Right, Prophets who write things down or whose prophecies are written down. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1226.24,"end":1230.04,"speaker":"Fr Andrew Stephen Damick","text":"So they become sacred texts. Maybe, Maybe."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1230.12,"end":1231.84,"speaker":"Fr Stephen De Young","text":"Yeah, maybe."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1231.84,"end":1232.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1232.24,"end":1240.68,"speaker":"Fr Stephen De Young","text":"But they're writing. So that then puts it in a genre that's similar to big chunks of the Old Testament."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1240.68,"end":1241.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1243,"end":1278.87,"speaker":"Fr Stephen De Young","text":"So this idea that the prophecies of a prophet would be written down or that a prophet himself might send it in the form of a letter. Right. Is not sort of a new phenomenon in the. In the Old Testament. This is something that's already been around in the ancient Near East. And I copied over, complete with weird lacunae notations and before I edited it, weird Greek letters inserted in places and things. Just one of these is semi random. But this is like a typical one."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1278.95,"end":1279.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1279.35,"end":1282.59,"speaker":"Fr Stephen De Young","text":"And we should say that you get a flavor of what it sounds like."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1282.59,"end":1290.21,"speaker":"Fr Andrew Stephen Damick","text":"Even though there were random Greek letters, was not in Greek, it was not written with Greek letters. It was just. It was a cut and paste thing. Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1290.29,"end":1312.81,"speaker":"Fr Stephen De Young","text":"Yeah. See, because I had to get it out of this. So this is my plight. I got it out of this book published by sbl, where they had the transliterated Acadian in one column and then an English translation in the other column. And I had to try to pull the text out of the English column and I ended up with all kinds of weird diacritical marks and symbols."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1312.81,"end":1314.6,"speaker":"Fr Andrew Stephen Damick","text":"I feel your pain. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1314.6,"end":1326.56,"speaker":"Fr Stephen De Young","text":"Yes, yes. It was a tragedy. It was a tragedy. If you want to support me in my plight, you can PayPal me and help assuage my difficulty."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1327.04,"end":1376.74,"speaker":"Fr Andrew Stephen Damick","text":"I will consider that. So I'm going to read this. And like you said, this is just like a sort of a typical one of these cuneiform tablets from the Mari letters. Moreover, a prophet of Adad, Lord of Aleppo, came with Abu Dalim and spoke to him as follows. Write to your lord the following. Am I not Adad, lord of Aleppo, who raised you in my lap and restored you to your ancestral throne? I do not demand anything from you. When a wronged man or woman cries out to you, be there and judge their case. This only I have demanded from you. If you do what I have written to you and heed my word, I will give you the land. From the rising of the sun to its setting, your land greatly increased. This is what the prophet of Adad, lord of Aleppo, said in the presence of Abu Dhalim. My lord should know this. Not that exciting, really."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1378.02,"end":1403.99,"speaker":"Fr Stephen De Young","text":"No, but this is, again, it's just sort of typical, Right. And so Abu Dhalim is some kind of scribe, right. To whom the prophet comes and says, hey, write this down for the king, right? And he's bringing this word from Adad, the God of Aleppo. So, yeah, I'm gonna do it. I'm gonna pause here, talk a little trash on Herman Gunkel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1405.11,"end":1406.23,"speaker":"Fr Andrew Stephen Damick","text":"I don't even know who that is."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1406.55,"end":1408.31,"speaker":"Fr Stephen De Young","text":"One of our German scholar friends."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1408.39,"end":1411.35,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. So dead for 150 years, probably."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1413.43,"end":1427.04,"speaker":"Fr Stephen De Young","text":"I think he's. Well, not that long, but, you know, not long enough probably. So you may have noticed when you're hearing that, right, that that sounds a lot like a lot of prophecies in the Bible."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1427.2,"end":1430.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's very similar to a lot of what you get from the Bible, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1430.68,"end":1441.12,"speaker":"Fr Stephen De Young","text":"In the format and everything. Right. So Gunkel was a big guy in prophetic form criticism."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1441.84,"end":1442.48,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1443.2,"end":1477.06,"speaker":"Fr Stephen De Young","text":"And so what form criticism does is you get sort of all the examples of a genre you can. Right. And then you categorize them. Right. So Gunkel did like, well, this is an oracle of judgment against a person. This is an oracle of judgment against a king. This is an oracle of judgment against a nation. This is an oracle of deliverance for a nation. This is. Right. Sort of categorizes them all. Right. And sort of tries to find patterns in the genre."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1477.06,"end":1477.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1477.54,"end":1528.36,"speaker":"Fr Stephen De Young","text":"Right. And then, because this is. This is like what German scholars do, right? They just taxonomize and catalog everything. Right. And so. And so he's including the Old Testament stuff in this. And then stuff like, you know, the Mari documents all. All these kind of things. Some of the other stuff we're going to talk about in a minute throws it all in there. And then he says, right, well, okay, so any time a prophecy in the Bible follows the format, now, these are templates that he's created based on his taxonomy, right? So every time it follows the template, it's Unimportant and not interesting. Right. It's the only important part of any biblical prophecy is if you could find a place where it breaks from the template."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1529.55,"end":1529.95,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1530.83,"end":1537.95,"speaker":"Fr Stephen De Young","text":"Right. And so then you take wherever it breaks from the template. Now, mind you, this is a template that he made up."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1538.19,"end":1538.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1538.59,"end":1556.84,"speaker":"Fr Stephen De Young","text":"Right. Based on the limited examples we have that have survived to his day. So that if he finds a place or breaks the template, then you read everything into that word or phrase. Right. That you didn't find in all the other similar ones."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1558.84,"end":1559.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1559.32,"end":1570.28,"speaker":"Fr Stephen De Young","text":"And that becomes what the whole thing is about. So this has been another episode of why most biblical scholarship is kind of goofy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1571.32,"end":1572.32,"speaker":"Fr Andrew Stephen Damick","text":"By the way, I looked it up."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1572.32,"end":1574.08,"speaker":"Fr Stephen De Young","text":"Father Stephen D. And we should."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1574.08,"end":1586.82,"speaker":"Fr Andrew Stephen Damick","text":"That. That should have its own theme. Chris Hoyle, you know what to do. Yeah, no, I looked it up and he died in 1932. So he's been gone."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1586.82,"end":1588.34,"speaker":"Fr Stephen De Young","text":"I was going to say he was not that long."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1588.34,"end":1591.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not. Not 150 years, but 90 years. 90 years."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1591.54,"end":1610.4,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Early 20th century German friend. Yeah. Yeah. So, but the reason why I wanted not just because I like picking on Germans. I mean, you know, they spent the 20th century picking on the rest of us, so it's fair game. But."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1610.96,"end":1611.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1613.52,"end":1641.96,"speaker":"Fr Stephen De Young","text":"It's not just because I like picking on Germans. It's that. Right. This is an example of how to do what we try to do on the show, how we try to use this kind of data, like the Mari letters or things from the ancient near east or Second Temple Jewish literature. How to use that really badly. Yeah. Right. And really unhelpfully."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1643.08,"end":1643.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1643.44,"end":1652.68,"speaker":"Fr Stephen De Young","text":"It's very scholarly and very academic to sort of categorize and taxonomize everything. Right, right. But I don't begrudge him that. Publish a journal article. Sure you do. You."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1654.12,"end":1660.84,"speaker":"Fr Andrew Stephen Damick","text":"But, like, would the people who use this as part of their live culture and religion have understood it that way?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1661.65,"end":1668.69,"speaker":"Fr Stephen De Young","text":"Right, right. And for a chunk of the 20th century, Gunkel stuff was being taught in, like, seminaries."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1669.09,"end":1669.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1670.93,"end":1721.68,"speaker":"Fr Stephen De Young","text":"And grad schools as how to interpret prophetic texts of the Old Testament. Right, right. And it just kind of makes a mess of it. Right. It just kind of makes a mess of it. So rather than seeking to learn what we can learn about the background of the ancient near east and how prophecy functioned, like we're trying to do tonight, how did prophecy function in the ancient Near East? Okay. Now that we've talked about that a little, now let's look at the biblical text and see if that enlightens us on anything that's sort of in the background here. Right. Of these prophets and prophetic books. It's trying to plane out and reduce the biblical text. Right. There's nothing privileging the book of Amos for Gunkle over one of the Mari letters."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1721.84,"end":1722.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1723.28,"end":1731.12,"speaker":"Fr Stephen De Young","text":"It's the same thing. Right. And it's only even interesting again if there's something quote unquote weird in it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1731.6,"end":1731.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1731.96,"end":1749.21,"speaker":"Fr Stephen De Young","text":"Based on his established normal. Right. And so when you attack things in that way, you really are attacking them. Right. Rather than sort of deepening the meaning and understanding of the biblical text, you just kind of make it uninteresting and irrelevant."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1749.61,"end":1750.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1752.57,"end":1755.49,"speaker":"Fr Stephen De Young","text":"Right. So anyway, now I'm done with, with."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1755.49,"end":1756.97,"speaker":"Fr Andrew Stephen Damick","text":"Gunkol, that being said."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1758.41,"end":1768.41,"speaker":"Fr Stephen De Young","text":"Right. But yeah, yeah, but I think it's important that once in a while we point to these things because every once in a while there's someone on the Internet who doesn't like this show."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1769.17,"end":1769.77,"speaker":"Fr Andrew Stephen Damick","text":"How dare they?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1769.77,"end":1789.17,"speaker":"Fr Stephen De Young","text":"Hard to believe. I know, Right, right. And one of the things is, one of the sort of knee jerk criticisms we get is that they're taking all this biblical scholarship and that wrecks the Bible. Right. And it's not that. That's totally wrong. Like it can. Right, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1789.33,"end":1791.01,"speaker":"Fr Andrew Stephen Damick","text":"There's scholarship and there's scholarship."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1791.41,"end":1822.98,"speaker":"Fr Stephen De Young","text":"There are modes of doing it. Yes, right. That sort of relativize and negate the force of the text of scripture and stuff. Right. There certainly are approaches that do that. But the fact that we talk about this ancient Near Eastern stuff, there are also ways to read this stuff and understand this stuff that actually helps to deepen the understanding of the biblical text. Right. And you can differentiate those at the level of method. Okay, so enough banging on beating Grunkle's dead horse."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1823.22,"end":1823.7,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1824.18,"end":1825.38,"speaker":"Fr Stephen De Young","text":"Or is he the dead, I don't."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1825.38,"end":1827.14,"speaker":"Fr Andrew Stephen Damick","text":"Know, 90 year old dead horse. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1829.1,"end":1858.47,"speaker":"Fr Stephen De Young","text":"Right. So, but what the, that, what that text, that Mari letter that you read also shows us is that even in Mari, this prophet sort of shows up and, and says this to the king. And that means this prophet, his sort of authority and his voice is derived directly from the deity also meaning he stands apart from the king. He's able to come and tell the king something."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1858.71,"end":1875.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not part of the king's administration. He's not appointed to that position by the king. You know, it's not, he's not part of the establishment, I think is one of, is the big thing to take away from this right here. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1875.27,"end":1878.47,"speaker":"Fr Stephen De Young","text":"So the king is himself a priest."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1879.36,"end":1879.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1879.6,"end":1881.92,"speaker":"Fr Stephen De Young","text":"And we're talking about divine kingship."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1882,"end":1882.56,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1882.56,"end":1919.99,"speaker":"Fr Stephen De Young","text":"Divine kingship at this point in history. Right. So one of the gods and so his priests are, as we were just saying, mostly what we would call diviners of various kinds. Right, right. And so you have that establishment and then you have a prophet who comes, who derives their ability to speak directly from this God. Yeah, right. Who is at least the king's equal because they think the king's divine. Right. But who can then come and challenge the king and tell the king what to do or correct the king, or in this case, remind the king of his duty to establish justice."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1920.39,"end":1920.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1921.59,"end":1926.07,"speaker":"Fr Stephen De Young","text":"Which most people could not get away with doing, shall we say, if they wanted to live."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1926.15,"end":1931.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So the."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1931.32,"end":1951.76,"speaker":"Fr Stephen De Young","text":"The prophet has this kind of outsider role to the establishment. Right here in the. In the ancient Near East. Another place where we see sort of a flowering of prophetic activity is actually in and around Nineveh in the seventh century bc."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1952.24,"end":1953.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, good old Nineveh."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1953.6,"end":1961.05,"speaker":"Fr Stephen De Young","text":"You may see where we're going with this. So Nineveh this time is the capital of the Assyrian empire."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1961.29,"end":1961.93,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1962.97,"end":1981.65,"speaker":"Fr Stephen De Young","text":"The assyrians made those 20th century Germans I was joking darkly about earlier look like choir boys. They were possibly, again, based on records, possibly the most brutal imperial regime in the history of the world."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1981.65,"end":1996.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is this where we recommend everyone listen to the Fall of Civilizations podcast again about Assyria? Yeah, they did an episode on Assyria, which I can't remember how long it was. You know, like, people think that this podcast has longest episodes. That show is routinely four hours."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":1997.4,"end":2001,"speaker":"Fr Stephen De Young","text":"Yeah. I also recommend their YouTube channel too."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2001.16,"end":2003.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Got some nice visuals."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2004.12,"end":2018.44,"speaker":"Fr Stephen De Young","text":"They've taken the audio podcast and they just sort of put really high quality, sometimes like 4K, like visuals of actual, like archaeological sites and stuff to give you an idea of the places that are being talked about."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2018.44,"end":2034.36,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, I mean, the. It's been a while since I listened to the Assyria episode, but yes, I mean, you will. It is. They are some mean, mean people. Like, it was a really nasty empire and I mean, and these are the people that carry off the Northern Kingdom of Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2035.08,"end":2090.91,"speaker":"Fr Stephen De Young","text":"Right? Yeah, right. Which ceases to exist. Right, yeah, yep. So, yeah, they're incredibly brutal. But also there is this flowering in 7th century of prophecy that we have from written sources. Again. Right. That tell us they have this tradition of. Of prophets, which again, this is standing apart from the Assyrian King, who's seen as a divine king, his priesthood. Right. Of. Of diviners and that kind of thing. Right. Who are doing their thing to try and get the signs of the gods, but also just. It was a phenomenon that a prophet could arrive, bringing a message from one of the gods and, you know, deliver it to the king or deliver it to the civilization. And this is in the background, of course, then. And helps us understand what's going on in the book of Jonah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2090.91,"end":2131.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When. When he just sort of shows up out of the blue and says, you know, how is it in 40 days, whatever, Nineveh will be overthrown? Or is it three days? I can't remember off the top of my head now. And. And they are able to receive that. And they're not like, who's this wacky Hebrew? You know, why should we listen to this guy? It's because, like, wait, this guy fits into. He looks, he sounds, he smells like a prophet. Wow. That. What he's saying stuff that's really scary. So maybe we should go ahead and listen to him. And so they're able to. They. Maybe his God isn't their God, but you don't want to get a God mad, even if he's not your God kind of thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2131.84,"end":2221.84,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. You don't mess with. And this is important for a couple reasons. One, I think a lot of people's picture of Jonah is sort of like he shows up in Nineveh and, you know, he's carrying around a sign saying the end is near. Like, you know, the crazy guy outside Comic Con. But this is Dodd. He fits into for them. Right. This is a phenomenon that they know about. Right. And this also affects, you know, not just our 19th century German friends, but lots of our scholarly friends who will say, well, of course Jonah's fictional. It couldn't have happened. Right, Right. There's no record of Nineveh repenting or converting to the worship of Yahweh. Right. But that. That's not what the text is talking about. Right. The text is talking about them repenting because a prophet showed up and told them that there was a God who was very angry at them for having done certain things. And so they perform rituals of repentance. And this explains why Jonah would have thought that that was the likely result. Because remember the Book of Jonah, Jonah says after the fact that one of the reasons at least, that he didn't want to go to Nineveh was that he knew they'd end up repenting and God would nuke them right after, you know, because Jonah ever goes and proclaims this to Nineveh and then goes and sort of sets up his folding chair on a nearby hill to watch the fireworks."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2221.84,"end":2222.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2223.12,"end":2249.86,"speaker":"Fr Stephen De Young","text":"Then it doesn't happen. And he's all ticked off. He's like, I knew this was going to happen. So. Right. So why would he have suspected that this is the most brutal regime in the world? Why would he have thought that if he walked into the capital city of the most brutal regime in the world at the time, that they would have listened to what he said about a God destroying the city and repented? Well, because the Ninevites, right. Had. Right. This was a cultural idea."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2249.86,"end":2251.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2252.22,"end":2277.27,"speaker":"Fr Stephen De Young","text":"Yeah. That they understood. Right. So, yeah. So those are just two examples, but this is a known phenomenon. So now we're going to talk a little bit about. This isn't really Father Andrew's etymologies here because it's gonna be mostly Akkadian and Neo Assyrian."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2277.27,"end":2285.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Father Steven's etymology corner. Once you step out of Indo European, I'm pretty lost."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2286.79,"end":2329.52,"speaker":"Fr Stephen De Young","text":"So. And some of these are very hard to pronounce, at least for me with my white boy tongue. So we'll see how we do. But so in Akkadian, Right. In Akkadian records, the most common title for a prophet is mukhu, for a male prophet. And Mukutu, it's two syllables for a female prophet, that two ending is. Is feminine. In Neo. Neo Assyrian, it's Makhu and Makutu. Right. So you can tell the difference. The consonants are the same."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2329.76,"end":2330.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2330.72,"end":2360.7,"speaker":"Fr Stephen De Young","text":"The difference is the vocalization, the vowels, we would say. Right. Because that's how Semitic languages work, basically. So those are. Those are the two main words. Those are derived from the verb. The Akkadian verb mahu, which means to go insane, basically. Or to enter into a frenzy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2361.02,"end":2509.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of a crazy trance. Altered consciousness flopping around on the ground. Yeah, yeah, yeah. And what's interesting. So I. So I looked this up because I remembered a similar etymology. So now I'll bring it over into the Indo European world now. So Odin, whose name really is actually properly Odin. No, no one in any of the Norse periods from then till now would have said Odin. It was Odin. So he. But Odin is the way we say it generally in English, his name means like the infuriated one. And he is this God associated with wisdom and prophecy and visions. You know, like that. Like that's what the whole single eye thing is kind of about. Right. That he sees things. And I'll, you know, I'll just finish out my little side break about Norse mythology by mentioning. And I just learned this recently, actually, so I'm not. Again, I'm not an expert in these things, but I'M learning them. So apparently cultic helmets related to Odinic religion have been found that have a mask included in the helmet. And on the one side, if I remember correctly, the eye is sort of blocked or just nothing special about it or whatever. But then on the other side, one eye has gems embedded around it in the helmet. And the idea is that when you were entering into this, you know, I don't know if it's a sacrificial space or whatever, but some kind of cultic space that would be dark, that would be only lit by firelight, that what would happen then is the gem studded eye on the cultic helmet would sort of light up because of the light, you know, so the person wearing this helmet is kind of embodying Odin and their one eye, the eye of wisdom, you know, lights up. Right. The eye of seeing and prophecy and that kind of stuff. So it is interesting that, you know, even though like that's a very long distance from the ancient near east, but you know, this idea of frenzy and prophecy kind of going together is totally a thing. I mean, I don't know if this is the case in, you know, like native North American and South American religions, but I wouldn't be surprised if that same association were not there as well."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2510.99,"end":2518.51,"speaker":"Fr Stephen De Young","text":"Well, you even see it, and this will be a non controversial part of our show, you even see it in the very early accounts of Muhammad."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2519.07,"end":2519.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2520.11,"end":2603.02,"speaker":"Fr Stephen De Young","text":"When he first receives his visions, he's sort of in this state of terror and panic and even seems to be about to like throw himself off a cliff. Right. So I mean, that ancient Near Eastern conception sticks around in the Middle east until he's the, you know, 6th 7th century A.D. yeah. Right. So that kind of. And this is describing sort of the state that's brought about by this sort of direct contact with this spiritual being. Right. That provokes this response. And so as we said before, there's sort of two categories then prophets in the sense that there are some of them who are sort of visionary prophets with that external relationship. Right. With the spirit. Right. Who usually describe that interaction as seeing as sort of encountering. And that's usually in visual terms. The. I would. Well, we'll talk more about visions later on, but yeah, I won't get into all that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2603.34,"end":2604.22,"speaker":"Fr Andrew Stephen Damick","text":"We'll get to that later."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2604.22,"end":2615.1,"speaker":"Fr Stephen De Young","text":"I was about to digress about Aristotle a bunch and we don't need to. And then the other is that oracular, that internal. Right. That possession. Right. Idea."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2615.34,"end":2615.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2617.26,"end":2646.3,"speaker":"Fr Stephen De Young","text":"So those are the most common words for, for prophecy in this context, there are a couple of others. In Acadian, sometimes prophets are called apulum, which means answer, because it's from the verb Apollo or Apollo that means to answer. Right. So the idea is this. Some, this, this seems to convey a function more like, say, the oracle and Delphi. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2646.54,"end":2647.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2647.42,"end":2657.58,"speaker":"Fr Stephen De Young","text":"Someone comes to this person and asks them questions, inquires in order to inquire of the gods, rather than them showing up with a proclamation from the gods."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2657.74,"end":2658.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2660.94,"end":2673.85,"speaker":"Fr Stephen De Young","text":"And now, now we're going to get weirder because with the Assyrians in particular, there was a particular group called the Asinu."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2674.32,"end":2675.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what does that word mean?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2676.64,"end":2678.16,"speaker":"Fr Stephen De Young","text":"That word means man, woman."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2679.52,"end":2680.4,"speaker":"Fr Andrew Stephen Damick","text":"Well, there we are."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2682.24,"end":2711.98,"speaker":"Fr Stephen De Young","text":"So these were people in Assyria who were men, but then the encounter they have with the spiritual realm causes them in some way or another to sort of no longer be men. So they're in this sort of weird liminal space."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2712.54,"end":2713.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2713.02,"end":2714.78,"speaker":"Fr Stephen De Young","text":"Between sexes and genders."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2714.86,"end":2794.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. Yeah. Well, you know, to bring it back over to Odin. Right. So he was known to practice. Now this is from like, this is like from the real actual source texts that we have of Norse mythology, which I should say, by the way, all are written down by Christians. So we don't know that this is exactly Norse pagan religion. We don't know, but this is what we've got. So anyways, Odin practiced this kind of divination called Seder S E, I E. I don't know what the. How you would call the. The that letter in, in Norse, but in Old English it's an eth R, se and it's considered to be disreputable kind of divination because it. In Norse society, it's mostly associated with women and in order for men to practice it, they have to cross dress. So there is this again, like this sort of androgyny or, you know, liminal thing going on in terms of prophecy, at least some particular kinds of prophecy that exists all the way over there. And the reason why it's considered disreputable in Norse culture is that cross dressing was a big. No, no. You know, like, it was a dark, weird thing, you know, that you do a very different image of Odin than you get from the Marvel Cinematic Universe."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2795.06,"end":2798.9,"speaker":"Fr Stephen De Young","text":"Yeah. Although, hey, you never know what Anthony Hopkins might be up for in the next movie."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2799.38,"end":2800.34,"speaker":"Fr Andrew Stephen Damick","text":"That is true."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2804.74,"end":2821.18,"speaker":"Fr Stephen De Young","text":"Yeah. And you see this kind of thing lots of other places. One place that gets sort of brushed up against in the New Testament is there was a cult center to Kybali, often pronounced Cybele."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2821.34,"end":2821.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2822.22,"end":2845.59,"speaker":"Fr Stephen De Young","text":"Or Sibily or Sibila or all kinds of different ways in English, in Galatia, the region of Galatia. And those priests would, at a certain point in their initiation, enter into this level of ecstasy at which they would emasculate themselves."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2845.99,"end":2846.71,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2846.71,"end":2864.27,"speaker":"Fr Stephen De Young","text":"Physically. And so then after that, they too, occupied this space. And the Romans also found the whole idea repulsive, which is saying something, because the Romans were into some weird stuff, man."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2865.63,"end":2865.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2865.95,"end":2867.23,"speaker":"Fr Stephen De Young","text":"But even they found this."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2867.23,"end":2869.07,"speaker":"Fr Andrew Stephen Damick","text":"But even the Romans think you're weird."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2869.23,"end":2908.18,"speaker":"Fr Stephen De Young","text":"Yeah. Even they had their limits. They're like, man, this is just too weird for us. And so they would confine the priests of Kyberly to their temples, wouldn't let them leave because they didn't want to see them, except for one day a year where they could come out and beg from people on one of their feasts. But so this isn't just a weird Assyrian thing. Right. There are versions of this. And this is part of that frenzy that. This idea that having this encounter with these spiritual forces sort of breaks people."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2910.34,"end":2915.15,"speaker":"Fr Andrew Stephen Damick","text":"They're touched, right? I mean, that's. That's what that word means. Yeah, they're touched."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2915.95,"end":2930.67,"speaker":"Fr Stephen De Young","text":"And in these. In the. These pagan contexts we're talking about, like Assyria and Kaivoli and some of these others, these pagan contexts, you notice that it's. It's like it's always in destructive ways."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2930.67,"end":2932.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2932.43,"end":2963.63,"speaker":"Fr Stephen De Young","text":"It's not that they're made somehow, like, wiser and more virtuous by this experience. It's that they're made like crazy. Right. Or, you know, they do physical harm to themselves. Right. Or, you know, they're roofs from society by no longer being able to function. Being able to function if they wanted to. Right. In sort of a normal societal and cultural way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2963.63,"end":2964.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":2966.84,"end":3032.41,"speaker":"Fr Stephen De Young","text":"Yeah. So. And then there's one more. One more term before we leave our ancient Near Eastern terms, and that's a Neo Assyrian term, which is regamu is the verb that means to shout. And so certain prophets are called either ragimu, if they're male, or ragintu, See that two feminine ending, again, if they're female. And that literally means, like, shouters or yellers. But this is the kind of idea between the Greek word that becomes important in scripture. More on this later, of Kerygma, the idea. Right. A message that's proclaimed. Right, right. So these would be. Right. If the. If the answers are more like the oracle of Delphi, who you go and consult with these. This would be designated. This prophet is more the type who shows up yelling at you the end is near or whatever."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3032.49,"end":3035.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3035.69,"end":3055.38,"speaker":"Fr Stephen De Young","text":"Right. So having talked now about sort of those ancient Near Eastern prophets outside of the Old Testament, we now turn to the most famous pagan ancient Near Eastern prophet who shows up in the Old Testament. Right. It's not an Israelite prophet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3055.62,"end":3056.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3057.14,"end":3058.7,"speaker":"Fr Stephen De Young","text":"And that is Balaam, the son of."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3058.7,"end":3061.62,"speaker":"Fr Andrew Stephen Damick","text":"Beor, the donkey guy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3062.26,"end":3066.98,"speaker":"Fr Stephen De Young","text":"Right, right. Cannot turn into a bear, despite certain Tolkienian similarities."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3067.14,"end":3069.7,"speaker":"Fr Andrew Stephen Damick","text":"No, no, he's not a werebear. Not a werebear."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3072.82,"end":3114.02,"speaker":"Fr Stephen De Young","text":"So he did kind of turn into a donkey at a certain point, in a way, in a sense. So in the Book of Numbers, which I know is everyone's favorite book in the Bible, people can't get enough of it. Balaam gets hired by Balak, the king of the Moabites. Right. And Balak, not to be confused with Baylock, played by everyone's favorite actor, Clint Howard, in Star Trek original series episode the Corbinite Maneuver."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3114.1,"end":3134.09,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow. And see, I thought we actually had a request from someone saying, you know, the fact that we titled this episode Profit Motive, that we had to make references to the deep space. Right. But no, see, sorry, Scott Brewer. I know you're listening. He referenced original series first."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3134.41,"end":3147.97,"speaker":"Fr Stephen De Young","text":"Way too old school for that. I worked at a TOS and a Clint Howard reference. Pretty sure that was Clint Howard's first movie role because he was literally like 4 years old or something, it looks like."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3147.97,"end":3148.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3149.51,"end":3152.87,"speaker":"Fr Stephen De Young","text":"Yes, yes. He offers them tranya, which looks like orange juice."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3152.87,"end":3159.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Anyway, Right, Yeah, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3159.83,"end":3217.3,"speaker":"Fr Stephen De Young","text":"So back to reality. Gets hired by. By Balak, the king of Moab, and he's hired to curse Israel. Right, yeah. So he says, I want you to go and put the whammy on Israel. Right. So that they will fail in battle against me. Right. And does not explain the scientific basis of the whammy. But so in numbers 22, there's probably the most famous episode regarding Balaam, which is where he's. He's riding his donkey, right. And trying to ride over. He's on his way to go try and curse Israel. And the angel of the Lord comes and blocks his pass, his path, and Balaam can't see him, but the donkey can."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3217.3,"end":3218.1,"speaker":"Fr Andrew Stephen Damick","text":"The donkey does."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3218.1,"end":3220.3,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, the donkey."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3220.3,"end":3228.55,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. Could you say, in trying to, you know, put the whammy on Israel, that he was pushing his luck? Sorry, I couldn't."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3230.39,"end":3231.43,"speaker":"Fr Stephen De Young","text":"First of all, it's. Press."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3231.59,"end":3233.67,"speaker":"Fr Andrew Stephen Damick","text":"Press your luck. Well, okay, okay. Press you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3233.91,"end":3234.55,"speaker":"Fr Stephen De Young","text":"So you even."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3235.03,"end":3237.31,"speaker":"Fr Andrew Stephen Damick","text":"I know, I mean, Right, well, you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3237.31,"end":3239.51,"speaker":"Fr Stephen De Young","text":"Know, it's not as old as radio, ladies and gentlemen."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3239.91,"end":3244.71,"speaker":"Fr Andrew Stephen Damick","text":"I know you could tell, you could tell us. The joke was not in the notes, you know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3244.95,"end":3246.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3247.75,"end":3250.87,"speaker":"Fr Andrew Stephen Damick","text":"Is that show still going? I don't know. I have to look that up now."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3250.87,"end":3251.99,"speaker":"Fr Stephen De Young","text":"Yeah, they brought it back."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3254.38,"end":3255.82,"speaker":"Fr Andrew Stephen Damick","text":"Of all the things to bring back."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3256.3,"end":3261.9,"speaker":"Fr Stephen De Young","text":"Elizabeth Banks hosts it now. Anyway. Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3262.14,"end":3266.7,"speaker":"Fr Andrew Stephen Damick","text":"The original series ended in 1986. Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3267.02,"end":3272.94,"speaker":"Fr Stephen De Young","text":"Yeah, there was that whole controversy with the guy who won like 200,000. Anyway, now we're really digressing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3272.94,"end":3273.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3273.26,"end":3325.09,"speaker":"Fr Stephen De Young","text":"But there's a documentary about it, about the guy who won like 200 some thousand dollars on Pressure Lock. There was a whole scandal. Anyway, so Balaam is riding his donkey, donkey sees the age of the Lord, Balaam doesn't. Right. And so stops and you get this whole thing where he's like beating the donkey, trying to get it to go, and then finally sees the age of the Lord, he's like, oops. Right, but now that we've talked a little about ancient Near Eastern prophecy. Right. And since before on the show, we've talked about who the angel of the Lord is. Right. Here's an example of how this provides some important subtext. Right? Because what makes Balaam a prophet? Why would someone hire him to go and curse Israel? Well, because he has seen and encountered the gods."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3325.73,"end":3329.33,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah, that's why. That's the only reason."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3330.05,"end":3345.42,"speaker":"Fr Stephen De Young","text":"Right. And so his powers of divine vision are apparently inferior to that of your average riding donkey. Right. In Israel. Right. So that's a deliberate juxtaposition."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3345.82,"end":3348.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That the donkey sees God and Balaam does."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3348.98,"end":3392.9,"speaker":"Fr Stephen De Young","text":"Yeah, the donkey sees God. The donkey has a better understanding of how the spiritual world works and how it affects physical world than Balaam, the famous prophet, does. Right. So that said, Balaam's been hired to do a job. He's a professional if nothing else. Right. So he goes to try to do it anyway. Right. And so first he goes to the seven altars to BAAL at Kiryat Hazot and tries to curse Israel. Ends up prophesying blessings for Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3394.02,"end":3394.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3394.42,"end":3424.99,"speaker":"Fr Stephen De Young","text":"Right. So he's trying to speak and God keeps putting words in his mouth. So he's now gone from being sub donkey level prophet to ventriloquist dummy. Then in chapter 23 of Numbers, he goes to the seven altars at Pisgah to have another go at it. Right. And so the idea that they actually build the seven altars at Pisgah, the idea here is that they're offering sacrifices."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3425.15,"end":3429.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To kind of attract divine attention sort."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3429.15,"end":3498.77,"speaker":"Fr Stephen De Young","text":"Of before each try. Right. So they go to the one place where there are already These established altars, they offer their sacrifices. He gives it a go. It doesn't work. He's like, oh, let's try somewhere else. Right. Maybe. Maybe this place doesn't have the vibe anymore. Right. This sacred space is not so sacred anymore. So they go to this other sacred space, they build seven altars to make their sacrifices. Attempt number two. Right. Strike number two. He ends up blessing Israel. And then finally in numbers 24, he goes to Baal Paor, another high place, to Baal, third time, not the charm. And he ends up super blessing Israel and making some important prophecies. Right. That actually we're not going to read the whole thing, but there are a couple of bits that we wanted to highlight because these are bits that are quoted as prophecies in our hymns in church that we think about and talk about. And we may not realize that these came out of the mouth of Balaam when he was trying to curse Israel. Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3499.01,"end":3518.14,"speaker":"Fr Andrew Stephen Damick","text":"He was a demon worshiper. But yes. So he said these very famous lines in numbers 24 9. He crouched, he lay down like a lion, and like a lioness who will rouse him up. Or sometimes it gets translated, I think. Lion's whelp. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3519.1,"end":3532.62,"speaker":"Fr Stephen De Young","text":"Well, yeah, well, this is picking up on imagery from the prophecy concerning Judah, the tribe of Judah, in the testament of Jacob in Genesis 48. So this is dovetailing with that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3532.62,"end":3548.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then another one, probably more famous, Numbers 24:17, A star shall come out of Jacob and a scepter shall rise out of Israel. I mean, these are messianic prophecies about Jesus coming out of the mouth of this guy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3549.65,"end":3561.33,"speaker":"Fr Stephen De Young","text":"Yeah. Now, given he's operating as a ventriloquist dummy at the time, but yeah. He also pronounces doom on the Amalekites. So he does curse somebody."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3561.41,"end":3563.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, curses the giants."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3565.73,"end":3623.67,"speaker":"Fr Stephen De Young","text":"So. Yeah. But notice, though, how prophetically those things go together. Yeah. The coming of the Messiah and the doom of the giants here are, in Balaam's prophecy, are sort of wrapped up together. Right. And those two things continue to be wrapped up together throughout the Old and into the New Testament. We had to talk about giants at some point. It's Lord of Spirits, come on. So now somebody may have had, you know, the ding, ding go off when we said that this third time, this third and final time that he tried to curse Israel, he was at BAAL Peor. So you may remember some other stuff that went down there, some bad stuff, and that was that there were these groups of Moabite, they're usually called Priestesses or just women in vulgarized English translations. They're actually essentially shrine prostitutes for this high place."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3623.75,"end":3624.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3624.79,"end":3674.49,"speaker":"Fr Stephen De Young","text":"At BAAL Peor, they seduce a number of the Israelites that results in this plague breaking forth in the camp. We've talked about Phinehas or Phineas or Penihas before on who puts an end to it on the show before. But importantly, right? So there's these two sort of dots. Dot one is this is where Balaam makes his third attempt to curse Israel and fails. Dot two is there's this apostasy by Israel at the same time place. You might expect that at some point in rabbinic and or Christian tradition, they would connect those two dots and say that Balaam was involved in the apostasy. But you don't have to wait for that because those dots are connected already in numbers, chapter 31 and in Joshua 13."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3674.89,"end":3676.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3677.37,"end":3708.27,"speaker":"Fr Stephen De Young","text":"Where essentially Balaam having tried three times and fails, Right. To curse Israel. Right. The idea is, well, I can't curse them as long as they're following their God. Right. But if I could get them to betray their God, because he's looking at it as their God must be too powerful for me. Right. And for my gods, but if I could get them on the wrong side of their God, they'll end up cursed. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3708.64,"end":3711.04,"speaker":"Fr Andrew Stephen Damick","text":"Which is. So this is not entirely wrong."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3711.84,"end":3772.5,"speaker":"Fr Stephen De Young","text":"Right. So he does understand some sort of spiritual technology here, Right. Well, you know, their God is too powerful for my God to curse, that maybe I could get their God to curse them. Right. By getting them on the wrong side of it. And so that's how it's then portrayed there in the Old Testament. And that idea of Balaam then also gets picked up in the New Testament in Second Peter chapter two, in the book of Jude, in Revelation chapter two, where Balaam is presented as sort of this archetype of the heretic, Right. Of the false teacher who arises within the church. Right. And who sort of leads. Leads people into apostasy. Right. Leads them away from Christ, leads them right back under the curse. They're sort of analogized to Balaam, the son of Beor. He becomes sort of the archetype of that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3772.58,"end":3774.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3776.34,"end":3782.9,"speaker":"Fr Stephen De Young","text":"But interestingly, he did still make those messianic prophecies, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3782.9,"end":3785.38,"speaker":"Fr Andrew Stephen Damick","text":"Which are quoted and affirmed."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3787.04,"end":3841.61,"speaker":"Fr Stephen De Young","text":"So. And it's not that the apostles didn't know about that, Right. When they were using him as this archetype, Right. So they didn't have to say every word that comes out of the mouth of these false teachers is a lie. Right. St. Paul talks about people who are preaching the gospel for false motives. It says, well, at least the gospel is getting preached. Right. So it's not sort of all or nothing. Right. The fact that the prophecy came out of Balaam's mouth or the donkey's mouth. Right. Doesn't make it false. Right. But the fact that a prophecy came out of their mouths also doesn't make sense them true as beings."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3841.61,"end":3842.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3842.29,"end":3846.13,"speaker":"Fr Stephen De Young","text":"Right. It did not make that a holy donkey. Right. I mean. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3846.21,"end":3854.69,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes God makes use of people, even against their will, without endorsing them, you know?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3855.33,"end":3857.73,"speaker":"Fr Stephen De Young","text":"Right. Which is very reassuring as a priest."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3858.61,"end":3859.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, thank God."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3862.61,"end":3872.19,"speaker":"Fr Stephen De Young","text":"And then, you know, just another note. Philo of Alexandria, who we've brought up on the show before, identifies Balaam as a wizard."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3872.59,"end":3873.55,"speaker":"Fr Andrew Stephen Damick","text":"You're a wizard."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3873.55,"end":3903.11,"speaker":"Fr Stephen De Young","text":"Balaam, which. Which I just think is kind of cool, but even cooler than that. Right. Is that there was an inscription found in Deir Allah, which is now in Jordan, but which was in Moab in the. This inscription is from the late 9th or early 8th century B.C."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3904.15,"end":3904.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3904.87,"end":3924.77,"speaker":"Fr Stephen De Young","text":"And the inscription is in a wall, but it's written in a wall. So these Iron Age buildings were generally made of stone, and then the inside and sometimes the outside were then plastered."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3925.57,"end":3926.09,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3926.09,"end":3939.89,"speaker":"Fr Stephen De Young","text":"With sort of primitive plaster. Right. And while the plaster was wet, they would paint, essentially use pigment to paint or write in the plaster."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3940.29,"end":3941.57,"speaker":"Fr Andrew Stephen Damick","text":"So basically fresco."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3942.93,"end":3947.17,"speaker":"Fr Stephen De Young","text":"Right. Sort of. Although a lot cruder than the frescoes you're thinking of."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3947.17,"end":3947.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3948.53,"end":3948.73,"speaker":"Fr Stephen De Young","text":"History."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3948.73,"end":3950.45,"speaker":"Fr Andrew Stephen Damick","text":"But the same basic technique."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3950.93,"end":3983.08,"speaker":"Fr Stephen De Young","text":"Right. Often it was writing rather than, you know, elaborate paintings and this. And in this case, it's writing, it's an inscription. Which makes it kind of mysterious because it's unclear why someone would want this on the wall of their house. But anyway. But it does date from that time. We've got firm dating on it. This is within what was Moab, and it refers to Balaam, the son of Beor. Right. So literally the same name, Balaam, the son of Beor."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3983.4,"end":3983.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":3985.88,"end":4006.19,"speaker":"Fr Stephen De Young","text":"And it identifies him as a prophet of Ashtar. A S H, T A R. Okay. Who is. Was the wife of Chemosh, the moon God, who was the primary deity of the Moabites."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4006.43,"end":4009.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. Is this the same. Is the same guy as Shemesh?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4011.39,"end":4012.91,"speaker":"Fr Stephen De Young","text":"No, Shemish is the sun God."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4012.91,"end":4014.23,"speaker":"Fr Andrew Stephen Damick","text":"Sun God. Okay. All right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4014.23,"end":4025.07,"speaker":"Fr Stephen De Young","text":"All right. So Ashtar is generally seen, I mean, linguistically to be a version of Astarte."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4025.23,"end":4025.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4026.35,"end":4049.76,"speaker":"Fr Stephen De Young","text":"Who's Baal's wife. Right. So this is sort of the goddess figure, your usual goddess figure coming out of Canaanite. Religion. So that's who he is. And also of a God who. We're not sure who it is, so we only have consonants. And the consonants are so sugar. I don't know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4050,"end":4050.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4051.04,"end":4095.83,"speaker":"Fr Stephen De Young","text":"Or Chaga or Chagre. I mean, there's lots of ways it could go who could have been vocalized. Right. So that is a secondary God, maybe in some way related to Ashtar. And then also the gods of Shadae, which may be a collective name for those two or something else. Right. That we're not exactly sure. And this Balaam son of Beor, exact same name, is said to have brought a prophecy from that. From that goddess, saying that that goddess, he had had a dream that that goddess was coming to destroy the earth and bring about Everlasting Night."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4097.59,"end":4100.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's a cheery thing to put on your wall."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4101.11,"end":4106.95,"speaker":"Fr Stephen De Young","text":"Yeah. So I guess it was like, don't worry, be happy. Right. Eat, drink and be merry, because tomorrow we die."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4107.75,"end":4108.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4108.63,"end":4110.31,"speaker":"Fr Stephen De Young","text":"Live laugh love. I don't know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4111.03,"end":4113.35,"speaker":"Fr Andrew Stephen Damick","text":"The live laugh love of its time."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4113.75,"end":4128.05,"speaker":"Fr Stephen De Young","text":"8Th 9th century BC have a great time because Endless Night. But what it shows us is this Balaam son of Beor was some kind of known figure."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4128.69,"end":4133.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is still how many centuries later or whatever that he's being talked about. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4133.53,"end":4153.98,"speaker":"Fr Stephen De Young","text":"He's some kind of known figure. And a lot of people interpret this as him being some kind of folk hero. I think that may be a little bit of presentism. Right. Like comparing him to Paul Bunyan. Right. Hey, Minnesotans. So there's a bunch of Minnesotans listening to this going, you're saying Paul Bunyan isn't real."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4156.22,"end":4158.38,"speaker":"Fr Andrew Stephen Damick","text":"He's just very tall and Dutch. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4158.94,"end":4179.7,"speaker":"Fr Stephen De Young","text":"He's not. Babe is real. The Blue Ox is real. Yeah. The Bull of Heaven behemoth. So. But yeah, so he. That. That's probably reading a little too much back in terms of the idea of a folk era like that. But he is clearly some kind of major figure."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4180.34,"end":4181.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4181.1,"end":4213.71,"speaker":"Fr Stephen De Young","text":"Some kind of major figure there in their religious past too. So. And this is in Moab, but of course, it's the Moabite king in numbers who. Who hires him. Right. So this is to be. To be really presentist about it. This is like a special guest appearance. Right. This is like a crossover episode in numbers. This is like when Mork showed up on Happy Days, where Balaam shows up sort of in the Story of Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4213.87,"end":4215.71,"speaker":"Fr Andrew Stephen Damick","text":"I had almost forgotten about that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4219.15,"end":4221.8,"speaker":"Fr Stephen De Young","text":"Wow. We've raged far and wide in this episode. Episode so far."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4221.8,"end":4222.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4223.48,"end":4229.72,"speaker":"Fr Stephen De Young","text":"You know, when we don't have, like, an engineer sitting on us. This gets. This gets weird, man."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4230.44,"end":4232.28,"speaker":"Fr Andrew Stephen Damick","text":"Because I'm engineering, so. Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4232.44,"end":4233.32,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4233.72,"end":4234.52,"speaker":"Fr Andrew Stephen Damick","text":"It's okay."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4236.04,"end":4261.12,"speaker":"Fr Stephen De Young","text":"So finally, in our first half here, in talking about extra biblical prophecy, we need to say a little bit about prophecy in Greece, right? Greek prophecy is really going to verge into Greco Roman. Right. How was it seen? Sort of those circles. So in Greek prophecy, oracles are way more common than yellers."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4262,"end":4271.6,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Because I'm sure there's more money in being an oracle. Like they're coming to you. I know. I mean, that's a little cynical, but I mean, they're coming to you. Right. Looking for answers."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4271.68,"end":4327.5,"speaker":"Fr Stephen De Young","text":"Well, a lot of the oracles also were slaves, either virtually or literally, like in Acts. Right. But I mean, the Oracle of Delphi was virtually a slave, so. And Delphi, the Oracle of Delphi, of course, is the most famous one probably. But there were oracles all over the Greek and Roman worlds who practiced this. And this is possession. Remember, the Oracle of Delphi was believed to be possessed by Apollo. Apollo was generally seen to be the God connected with prophecy. We talk about him a lot. I think, you know, even people who haven't read Nietzsche are under. This whole. Nietzsche's distinction between the Apollonian and Dionysian has kind of infected everybody's view of Apollo. But, you know, Helios is the God of the sun."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4328,"end":4328.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4328.2,"end":4343.76,"speaker":"Fr Stephen De Young","text":"So Apollo there is a connection to the sun, but Apollo is more a Lightbringer figure. Right. That's why he's connected to philosophy. Right. A bringer of light and wisdom. So he's Lightbringer. More like the devil."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4344.24,"end":4345.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4345.36,"end":4437.32,"speaker":"Fr Stephen De Young","text":"That kind of Lightbringer in the Old Testament. So. And if you look at. I know we've mentioned this before, that actually one of the four Horsemen of the Apocalypse is actually an old. A moldy old Canaanite God, Refesh, who is. Was depicted as an archer. And this is actually referred to in the. In the psalm. Right. The arrows that fly by day, fiery darts of the evil one. These are Refesh references. So he was a sort of demonic being, this Canaanite God who. Who had these plague arrows. And the earliest, most archaic depictions of Apollo we have are similar. He has plague arrows. So he seems to have been an assimilation from the near east of that type of idea. So Apollo is a much darker figure than we give him credit for being, ironically being the Lightbringer guy. But he's also the one associated with prophecy in terms of the shouter type of prophet who shows up with a message. The most famous One is easily cherisias, at least in terms of texts we still have that have been passed down to us who was associated with Apollo and who was blind. We'll talk about how he became blind in just a second."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4437.4,"end":4437.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4438.2,"end":4446.84,"speaker":"Fr Stephen De Young","text":"So Theresia shows up a bunch of places, but he was thought to be the son of a nymph and a human. So we've got some Nephilim action going on there."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4448.36,"end":4448.84,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4448.84,"end":4511.24,"speaker":"Fr Stephen De Young","text":"So there's this nature spirit and a human who produce him. He's from and associated with the city of Thebes. So he has this. What makes him a prophet is that he has this encounter with Zeus and Hera, sort of direct encounter with the gods that sort of initiates him as a prophet. But then he kind of gets in trouble with Hera because he sees two snakes copulating and gets grossed out by it and kills them. So Hera and Athena, for that matter, when you look at their cults in Greece, are constantly connected to serpent imagery, snake imagery. There were snakes in certain places that were sacred to Hera. Athena is often depicted with a snake. So there's a whole woman and a snake. Snake giving the woman wisdom motif in Greek stories."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4511.69,"end":4511.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4511.93,"end":4514.81,"speaker":"Fr Stephen De Young","text":"That gets really creepy when you think about Genesis chapter three."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4514.97,"end":4516.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4517.37,"end":4527.05,"speaker":"Fr Stephen De Young","text":"But so when Hera gets mad because he killed these snakes, Hera turns him into a woman. This again. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4527.05,"end":4527.53,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4529.29,"end":4536.57,"speaker":"Fr Stephen De Young","text":"And Teresius, now a woman, decides to make the best of it and becomes a priestess of Hera and gets married and has some kids."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4538.42,"end":4541.58,"speaker":"Fr Andrew Stephen Damick","text":"Does he change back after a while, like seven years or something? Yes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4541.58,"end":4562.18,"speaker":"Fr Stephen De Young","text":"He remains a woman for seven years, gets changed back into a man, and then he has the misfortune because, again, he's having these encounters with the gods all the time. Right. Because he's a prophet. He sees Athena naked, taking a bath."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4563.23,"end":4563.59,"speaker":"Fr Andrew Stephen Damick","text":"Not good."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4563.59,"end":4600.52,"speaker":"Fr Stephen De Young","text":"Walks into the bathroom. Oh, no. And gets struck blind. Right, right. So this is how he becomes the blind prophet Theresias. So you get that kind of blind seer motif that you were referring to with Odin, this idea that you sort of sacrifice, again, your ability to fit in with and interact with the material world in order to instead see and interact with the spiritual world. And also the idea that, again, these encounters with the gods, in his case are all sort of destructive."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4600.68,"end":4601.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4601.12,"end":4623.64,"speaker":"Fr Stephen De Young","text":"To him. Right, right, right. They all exact this horrible sort of toll on his humanity. What if it there is, since he's only half human in the first place. So then he shows up a bunch of famous places. He shows up in the Odyssey and in the Odyssey, the interesting Thing about him is it's his. It's his shade."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4623.72,"end":4624.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4624.12,"end":4624.96,"speaker":"Fr Stephen De Young","text":"It's his spirit."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4624.96,"end":4625.64,"speaker":"Fr Andrew Stephen Damick","text":"He's dead."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4626.28,"end":4649.82,"speaker":"Fr Stephen De Young","text":"Yeah. That shows up in Hades when Odysseus goes there to talk to Achilles and he sacrifices the black goats and pours the blood into the pit and the shades come and drink the blood. Not creepy at all. But before even, you know, the other shades have to come and sort of drink the blood, like to reinvigorate them themselves. Right. Like Achilles, who can talk to them, but Tiresias just sort of comes wandering out."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4650.14,"end":4652.38,"speaker":"Fr Andrew Stephen Damick","text":"Hey, guys. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4652.62,"end":4712.08,"speaker":"Fr Stephen De Young","text":"Tiresias shade is sort of of a different category. It's still there in Hades, but there's sort of shades of the Rephaim here. Right. He's kind of quasi divine. And so even his shade seems to be in this sort of different category, albeit in Hades. Yeah, the goth club, that is Hades. He's in a sort of different state. He also shows up in the story of King Cadmus. He shows up in Oedipus Rex, Oedipus the king, to tell Oedipus, hey, Oopsie, killed your dad, married your mom. Not cool. Which leads to Oedipus gouging out his eyes sort of in imitation of Tiresias with his blindness. Right. Because now the truth has been revealed to him and so now he can't see anymore."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4713.44,"end":4713.92,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4715.04,"end":4743.97,"speaker":"Fr Stephen De Young","text":"So, yeah, so we've given you here kind of the outlines, the first half of what sort of the prophet is the pagan world sort of surrounding the scriptures. Hopefully you've seen the through line that this is sort of a dark thing. This involves madness, this involves mutilation. This involves sort of destructiveness, the interaction of humans with these spirits."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4744.21,"end":4744.69,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4744.85,"end":4755.22,"speaker":"Fr Stephen De Young","text":"And so in our. In our second half, we're going to turn to the Old Testament where we will get a little bit of a different picture of prophecy. Not completely dissimilar, but different."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4755.46,"end":4763.86,"speaker":"Fr Andrew Stephen Damick","text":"A little bit of a breather, as it were, from all this weird dark stuff. All right, we're going to take a break and we will be right back."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4764.34,"end":4780.67,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4785.55,"end":4786.51,"speaker":"Fr Stephen De Young","text":"New from ancient."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4786.51,"end":4842.05,"speaker":"Fr Andrew Stephen Damick","text":"Faith Publishing, Welcoming Sacrifice in the Bible and Christian Life by Jeremy Davis. You'll find surprising answers in this book. You'll learn that sacrifice had a very different significance for ancient people than it does for us today. You'll hear how it drifted away from this ancient significance into a fundamentally different meaning in our modern world. You'll discover how Old Testament sacrifices were gifts from the heart, only tangentially related to killing and death. You'll see in Christ's cross the ultimate gift that ushers us into communion with God. And you'll find inspiration to offer your own gift alongside Christ's, inviting God into your life. Welcoming gifts, Sacrifice in the Bible and Christian Life."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4842.77,"end":4849.09,"speaker":"Fr Stephen De Young","text":"Now available in paperback, ebook and audiobook@store.ancientfaith.com."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4864.3,"end":4876.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's our theme in metal that was sent in by listener Rob. So thank you, Rob, very much for that. I know you were trying to get our attention. Wanted to leave you hanging for a while."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4878.78,"end":4881.82,"speaker":"Fr Stephen De Young","text":"In terms of that commercial. Was that Father Jeremy doing the."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4882.06,"end":4885.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that was Father Jeremy doing the reading his own book there."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4886.34,"end":4900.42,"speaker":"Fr Stephen De Young","text":"I don't do great live reads. That was a better live read than I do. But it came off to me as a little dry. So I want to tell people, even if that came off to you as a little dry, that's a really good book and you should buy it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4900.42,"end":4902.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Father Stephen did endorse the book."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4903.7,"end":4907.7,"speaker":"Fr Stephen De Young","text":"I endorse this product. I'm Commander Shepard. No."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4910.5,"end":4926.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I've looked through it. I haven't read it yet. But, I mean, it looks like he's, you know, a lot of the stuff that people like about some of the stuff we talk about is in there, you know, just focusing on this one topic, though, on sacrifice. So I'm looking forward to reading it myself. I haven't read it yet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4928.63,"end":4934.79,"speaker":"Fr Stephen De Young","text":"Yes. I. I will not have to write a book on sacrifice because he covered it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4935.03,"end":4936.31,"speaker":"Fr Andrew Stephen Damick","text":"Wow. There you go, everybody."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4936.47,"end":4941.34,"speaker":"Fr Stephen De Young","text":"So. Yes. So by all means, get it. Nice."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4941.58,"end":4953.02,"speaker":"Fr Andrew Stephen Damick","text":"Nice. All right. Well, we're in the second half. The second half. Despite what you. Despite what you. I'm not sure what that sound was, but we're live."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4953.82,"end":4955.42,"speaker":"Fr Stephen De Young","text":"It was terribly mysterious."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4955.42,"end":4998.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yes. Despite what you heard from the voice of Steve as we were going to the break, we're not taking calls, but I am monitoring the chat on our YouTube stream and on Facebook. So a couple of people have asked questions that basically will just simply say, yeah, they're. Oh, well, it's funny. There is a fun little blip during the first maybe 20, 15, 20 minutes or so where if you actually sort of watch the video feed instead of like the generic banner, you could see the furniture at the Chesterton Studio. And people are talking about, like, what could this mean? Why are we looking at furniture? You know, And So that was a lot of fun."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":4998.65,"end":5004.17,"speaker":"Fr Stephen De Young","text":"You know why that happened? We were talking about divination. Right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5004.17,"end":5005.45,"speaker":"Fr Andrew Stephen Damick","text":"That became the discussion."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5006.01,"end":5007.21,"speaker":"Fr Stephen De Young","text":"This must be a sign."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5007.69,"end":5009.05,"speaker":"Fr Andrew Stephen Damick","text":"Why is this chair at that angle?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5009.05,"end":5011.53,"speaker":"Fr Stephen De Young","text":"You know, who can interpret this for us?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5011.53,"end":5019.77,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. And also we received one little bit of review from a gentleman who is unhappy with the number of Star Trek references we've made so far."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5019.93,"end":5023.69,"speaker":"Fr Stephen De Young","text":"So how few? We can make more."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5025.18,"end":5026.38,"speaker":"Fr Andrew Stephen Damick","text":"I think it's too many for him."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5026.38,"end":5029.34,"speaker":"Fr Stephen De Young","text":"Take it under advisement. We made one."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5029.42,"end":5030.74,"speaker":"Fr Andrew Stephen Damick","text":"I don't. I know. I don't know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5030.74,"end":5031.58,"speaker":"Fr Stephen De Young","text":"One and a half."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5031.9,"end":5049.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, here we are. But, you know, this is the show, so. All right, well, back to prophecy. But now we're looking at prophets of the Old Testament. Prophets of. Of Israel. Right. Rather than this dark, freaky, bizarre pagan stuff."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5051.51,"end":5055.03,"speaker":"Fr Stephen De Young","text":"It gets a little freaky sometimes, but not near as freaky as what we were just talking about."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5055.19,"end":5055.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5058.23,"end":5155.39,"speaker":"Fr Stephen De Young","text":"So, yeah. So we're going to start sort of with titles again. Right. Sort of the. The Hebrew titles that are used to refer to prophets. The main one and the one that people know, they don't know any others. Right. Is navi or navi im being the plural sometimes. So that V sound is actually. So it could be pronounced as a B or a B or a V. Yeah. Depending on context and vocalization. So na V or not B, Navi' im or nabi'. Im. And that word comes into Hebrew from Akkadian, from the Akkadian nabu, which means to call out. Right. Or to yell. So again, keep in the back of your head this Greek idea of kerygma. Right. Of a message that is called out. So that could be the primary context in which prophecy is talked about. Right. So we don't really see oracular prophecy. Right. Possession type prophecy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5155.39,"end":5174.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, you get like David inquiring of the Lord, should I do this? You know, especially like, should I go out to this battle or whatever and God's saying don't do that or. Yes, or do that. But there's not. Like you said, there's not oracles who are being possessed and God speaking through them kind of thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5174.84,"end":5187.75,"speaker":"Fr Stephen De Young","text":"Right. There is a phenomenon, especially in Joshua and judges in 1st and 2nd Samuel or 1st and 2nd kingdoms of holy Spirit possession."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5187.99,"end":5189.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5189.11,"end":5203.75,"speaker":"Fr Stephen De Young","text":"And using those terms probably freaks people out, but deal with it. That's what everybody calls it, where it's usually translated as something like the Holy Spirit comes upon someone, like one of the Judges."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5203.91,"end":5214.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not that they were filled with the Holy Spirit. Yeah. Not that they were filled with the Holy Spirit, which is this very sort of saintly kind of image. But yeah, like you said, comes upon or rushes upon."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5216.06,"end":5225.82,"speaker":"Fr Stephen De Young","text":"Right. And then usually they kill a whole lot of people. But it's. They do something. It's not that they're sort of possessed and a voice comes out of there."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5225.82,"end":5226.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5228.22,"end":5265.64,"speaker":"Fr Stephen De Young","text":"And, you know, someone speaks. So that particular type of prophecy you don't really see in the Old Testament, but you do see that. And there is a certain affinity in that Holy Spirit possession phenomenon in the frenzy idea in the. Right. But the idea there is more that the actions that the person is taking in that case are the actions of God, not their own. Yeah, right. So like they're meting out God's judgment."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5266.92,"end":5267.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5267.24,"end":5323.58,"speaker":"Fr Stephen De Young","text":"It's not their own vengeance or what have you. Right. Is the idea that's trying to be conveyed by that. Right, right. So that. That's a different thing than sort of oracular possession. So that said, Na' vi is not the only term that's used for prophets. The actual earlier term that we find in the. The older or the oldest parts of the. The Old Testament are there are two terms, hosea or roa, both of which literally mean a seer, someone who sees something. Right, right. And so that again, gives you this visionary idea. Right. The idea that they have this direction. Encounter, encounter with God, and then the second piece, they then are given a message to deliver."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5323.82,"end":5324.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5325.5,"end":5346.71,"speaker":"Fr Stephen De Young","text":"There's also the feminine form, neva, which is used both for a prophetess, if you want to go all King James, a female prophet, like someone like Deborah in the Book of Judges, but is also used for the wife of a."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5346.71,"end":5354.63,"speaker":"Fr Andrew Stephen Damick","text":"Prophet, sort of a title by association, just like we have, you know, prismicera or. Yeah, yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5354.63,"end":5375.35,"speaker":"Fr Stephen De Young","text":"Which literally means like priestess. Right, right. Literally means female priest and is used for the priest. So the same thing was true with prophets. And so a good example of that in the Old Testament is Isaiah. Right. God tells him to go into the prophetess. Right. And that's not some woman who's not his wife. That is his wife."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5375.83,"end":5376.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5376.71,"end":5379.51,"speaker":"Fr Stephen De Young","text":"And have a son and name him Mahershalal Hashbaz."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5379.91,"end":5384.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. God would not tell him to go and be with a woman that's not his wife."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5384.55,"end":5384.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5384.95,"end":5387.43,"speaker":"Fr Andrew Stephen Damick","text":"That's not something God says to do."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5387.83,"end":5393.99,"speaker":"Fr Stephen De Young","text":"Right. Go to the prophecy, prophetess, definite article, meaning specific one, your wife, yours."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5393.99,"end":5395.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5396.04,"end":5417.64,"speaker":"Fr Stephen De Young","text":"And name him Mahershal al Hashbaz. And we actually read that and I think two points in the liturgical year. And let me just say people who translated that from the Greek. So you don't have Mahershala Hashpaz. And they put in something like name him, runs quickly and divides the spoils or something. It's not working, dude. Mahershala Hashpaz."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5417.8,"end":5426.18,"speaker":"Fr Andrew Stephen Damick","text":"There's an actor now that. That's his name. Like, that's his name. I can't remember what his last name is, but he goes by something shorter. But that is his actual first name."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5427.06,"end":5484.86,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. It's impressive. I mean, Isaiah's son. I'm just saying. Throwing it out there. Baptismal name. Can't come up with one. So these are the terms. Right. One of the most prominent ways, though, that we talk about and use that term of navi or naviim, Right, Prophets is to refer to a division of the Old Testament. Okay, Right. So classically, the. The Hebrew Bible or the Christian Old Testament is divided into three parts. There's the Torah, the naviim, the prophets, and then the ketuvim, which is the writings. Right. Sort of the rest of the stuff."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5485.02,"end":5489.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. These are the traditional Hebrew terms for these divisions in the Bible."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5489.42,"end":5509.75,"speaker":"Fr Stephen De Young","text":"Right. Those are Hebrew words. Torah, navim, ketuvim. That's why you'll sometimes hear Jewish folks and the occasional evangelical who's trying to sound cool refer to it as the Tanakh, Right? Yes, Those are the first letters."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5509.83,"end":5510.71,"speaker":"Fr Andrew Stephen Damick","text":"T, N, egg."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5510.71,"end":5513.35,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5516.07,"end":5516.47,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5516.55,"end":5542.72,"speaker":"Fr Stephen De Young","text":"So that big central division, right, is the prophets, right. And you'll hear sort of the scriptures referred to in the New Testament as the Law and the prophets. Right, which is a translation of the Torah and the prophets. Right. Sort of COVID everything because people are still debating which of the writings were in and which ones were out. Right. They weren't really debating it, just different places had received different collections of writings."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5542.72,"end":5543.04,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5544.4,"end":5589.64,"speaker":"Fr Stephen De Young","text":"That they considered authoritative at that time. So the prophets, that division of the Hebrew Bible or the Christian Old Testament is generally considered to consist of, on one hand, Joshua, Judges, Ruth, the books of Samuel, the books of Kings or the books of Kingdoms. Right. And then also on the other hand, the sort of writing prophets, Isaiah, Jeremiah and the Jeremiah material, Ezekiel, and then the book of the 12, which I've now discovered a lot of people haven't heard that term before."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5590.6,"end":5591,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5591.8,"end":5600.84,"speaker":"Fr Stephen De Young","text":"The book of the 12 is what you've probably heard referred to more commonly in modern English Bibles as the minor prophets. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5601.08,"end":5604.08,"speaker":"Fr Andrew Stephen Damick","text":"So it was like bound together as a single collection."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5604.08,"end":5605.76,"speaker":"Fr Stephen De Young","text":"Is that why all one scroll?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5605.84,"end":5635.9,"speaker":"Fr Andrew Stephen Damick","text":"One scroll, yeah, yeah. So what's interesting about that list that you gave is that like normally, at least in English, when we think about prophetic books, we would think about books like Isaiah. Right. Or Jeremiah, you know, but Joshua. Right. Which is, you know, a series of wars and so forth, Judges, I mean, you know, these are just sort of narratives. Is that prophecy like thus saith the lord, you know, etc. Etc."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5637.42,"end":5680.47,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, this is, this is where our German friends once again rear their ugly heads in the 19th century. Right. So a lot of English Bibles, you will not find the prophets, including all these books as a division. Instead you find historical books and prophetic books. These have been divided. And those books with Joshua and Judges and Ruth and kingdoms, those are considered, quote, unquote, historical books that are telling us about history. And then the other books are books of prophecy. And that even gets skewed into. This is all stuff about the future. Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5681.03,"end":5691.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So these are genre categories that we're putting. Putting onto them versus the ones that the people who received them initially, how they understood."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5691.62,"end":5695.38,"speaker":"Fr Stephen De Young","text":"Yeah. And not, not just initially, until modern time."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5695.46,"end":5696.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5696.3,"end":5706.58,"speaker":"Fr Stephen De Young","text":"Right, right, right. Even when these are distinguished like by church fathers and stuff, it's the former prophets and the latter prophets."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5706.66,"end":5708.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just a chronological distinction."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5709.06,"end":5737.64,"speaker":"Fr Stephen De Young","text":"Right. But it's still all considered, considered prophets. And so this is a problem we've talked about at length now on the show. The modern view of history intruding itself into how we read the Scriptures and the Old Testament in particular. Right. And it makes a big difference whether you read the book of Joshua as a prophetic book, as a book of prophecy, or as a history book."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5738.52,"end":5738.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5738.96,"end":5740.84,"speaker":"Fr Stephen De Young","text":"Especially if you have a modern idea of history."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5741.96,"end":5752.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. It's the story of a people, which is the traditional view of history versus a reconstructed narrative of events based on evidence."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5753.8,"end":5791,"speaker":"Fr Stephen De Young","text":"Right, yeah, right, right. And prophecy. Prophecy comes out. We talked about this a little bit when we talked about apocalyptic. Again, prophecy is presenting this divine perspective. So it's not objective. It's not claiming to be objective. Right, right. The book of Joshua is making no more claim to be objective than Isaiah is. Right. The author of the book of Joshua is presented to us in scripture as speaking for God. This is God speaking about these events."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5791.88,"end":5792.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5792.36,"end":5795.8,"speaker":"Fr Stephen De Young","text":"Just as in Isaiah, God is speaking about events."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5796.44,"end":5796.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5797.72,"end":5837.41,"speaker":"Fr Stephen De Young","text":"So there's not a fundamental difference between the prophetic writer of the book of Judges. Right. Talking about these elements of the history of the tribes of Israel and Isaiah coming and talking about what was happening in his day or what was soon to happen or what had happened in the past. Right. This is all presenting God's perspective, God's interpretation. It's presenting meaning of events, not just presenting events and making the claim that those events actually happened in exactly this way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5837.49,"end":5838.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5838.69,"end":5845.02,"speaker":"Fr Stephen De Young","text":"It's not saying they didn't happen. Right. But it's saying something about them and about their meaning."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5845.42,"end":5848.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And how does this function within the community?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5849.82,"end":5852.1,"speaker":"Fr Stephen De Young","text":"Right. Not just presenting a series of facts."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5852.1,"end":5853.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5853.5,"end":5893.1,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, that is very important in terms of how we approach those books, that those are also considered books of prophecy. Those are also considered a message from God. Right. And if we consider that history of the people was understood at that time to be, this is who we are, this is where we came from, this is where we're going, then this is God telling Israel, this is who you are, this is where you came from, this is where you're going. Yeah, right. And that's with that prophetic understanding. So even though."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5894.3,"end":5894.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5894.62,"end":5932.09,"speaker":"Fr Stephen De Young","text":"Those are the prophetic books, those texts are designated as the prophets. Prophecy doesn't start there. You've got prophecy, obviously. Probably. Obviously to most people in the Torah. Right, right. So Moses. Right. But even before Moses, really, the first person who's presented as a prophet directly by the text of the Torah. I know somebody's going to bring up Enoch, but Enoch doesn't say anything in the book of Genesis anyway."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5932.97,"end":5934.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's just sort of mentioned."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5935.13,"end":5948.33,"speaker":"Fr Stephen De Young","text":"Yeah. He doesn't himself say anything. You got to get the Book of Enoch for that. Right. And that's that whole discussion. But so Abraham is really the person who's first presented as a prophet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5948.8,"end":5954.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, the first thing that we, the first major thing we know about him is that God says, get up and leave."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5955.6,"end":5959.6,"speaker":"Fr Stephen De Young","text":"Yeah. God appears to him and says, right, get up and leave."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5959.6,"end":5979.28,"speaker":"Fr Andrew Stephen Damick","text":"Get up and leave. Which, I mean, this is, you know, this one of these basic sort of elements of prophecy. Someone who's kind of outside of the social order. And you know, he's living in Ur, the greatest city of the time, you know, the civilization. And God tells him to leave and go someplace else."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5980,"end":5987.04,"speaker":"Fr Stephen De Young","text":"Right. So he's removed from the social order by this experience of having this directed kind of. He has many of them over the course of his life."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5987.12,"end":5987.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":5987.84,"end":6042.9,"speaker":"Fr Stephen De Young","text":"Where he sees God, stands and talks to God. Right. Has these direct encounters with God unmediated. Right. And of course, we've talked about how this is Christ. Right. In our, in our series on this. But so he has these direct encounters, direct encounters with God and is directed to do things, to go places and do things. Right. And so this is really the first person who's presented as a prophet in that sense. Right. We're told Enoch has this. Some kind of direct encounter with God, but we're not told in the text of Genesis what comes of that. Right. But you can certainly understand why after the fact that people reading that in Genesis will say, oh, Enoch must have been a prophet. Right, right. Based on that. So this continues. Right. With his. We don't really have anything very clear like this with Isaac, but Jacob certainly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6043.22,"end":6043.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6043.62,"end":6072.51,"speaker":"Fr Stephen De Young","text":"Multiple visions, sees God multiple times and wrestles with him and sees the ziggurat. Right. Is AKA the latter. Yeah. At Bethel. Right. The. The house of God. Right. So he has these direct encounters. Right. But then we see a little bit of a. We see a little bit of a shift, right. When we get to Joseph."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6074.03,"end":6074.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6074.43,"end":6075.31,"speaker":"Fr Stephen De Young","text":"Jacob's son."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6075.71,"end":6076.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6076.67,"end":6089.14,"speaker":"Fr Stephen De Young","text":"Who. Who the narrative follows because Joseph does not have, as is recorded, these direct encounters. Instead he has dreams and interprets the dreams of Pharaoh."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6090.02,"end":6100.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. And he's embedded within civilization, although he is still kind of an outsider on some level. Right. He's brought in as a slave. He's a Hebrew, but."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6100.74,"end":6101.14,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6102.02,"end":6115.78,"speaker":"Fr Andrew Stephen Damick","text":"But he start. But it's interesting, you know, to look at the pattern with his life, right. Is that he's. He's not only brought in as a slave, but it's when he's in prison that he's called up as this answerer, as an interpreter, you know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6115.78,"end":6198.38,"speaker":"Fr Stephen De Young","text":"Right, right. But because ultimately, right. God is moving him into position there to save his brothers. Right. To save his family. He's going to have to be sort of re embedded. Unlike his father and grandfather and great grandfather, re embedded in society. He's going to become an official. Right. In Egypt. And so he doesn't have these direct encounters. God still communicates with him. Right. God still has this relationship with him, but it's more mediated than it was with Abraham, who's going to go live as a nomad. Right, right. Or Jacob, who lives as a nomad. Right. So there's a shift there for that purpose. And then when we get to Moses in Exodus. Right. And Moses has the direct encounters again with God in the. In the burning bush. Right. And then later on it's out in the wilderness, Right. He doesn't see God while he's in Pharaoh's court, Right. He gets pulled back out of civilization. Right. And is. Is living in the desert when he has these direct encounters. And he then sort of becomes the paradigm for what a prophet is because he has these extended experiences, direct experiences of God."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6198.38,"end":6198.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6198.78,"end":6202.02,"speaker":"Fr Stephen De Young","text":"40 days on top of Mount Sinai. 40 days and 40 nights of the."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6202.02,"end":6205.42,"speaker":"Fr Andrew Stephen Damick","text":"Divine council face to face as a man speaks to his friend. I mean."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6205.5,"end":6208.58,"speaker":"Fr Stephen De Young","text":"Right. And then going into the tent of meeting. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6208.58,"end":6209.06,"speaker":"Fr Andrew Stephen Damick","text":"And that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6209.06,"end":6233.91,"speaker":"Fr Stephen De Young","text":"Right. So he's sort of on this ongoing basis in a way that no one before that and really nobody after that in the Old Testament has. Right. Just this sort of ongoing basis. And it's not just, you know, me saying, hey, quantity wise, he's the paradigmatic prophet. Right. The promise at the end of Deuteronomy is that God's going to send them a prophet like Moses."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6233.99,"end":6235.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's treated in this."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6235.27,"end":6283.37,"speaker":"Fr Stephen De Young","text":"So Deuteronomy sets him up. Right. This is the paradigm as this is. This is what the prophet of Yahweh is going to be like. He's to, going, going to be like Moses. Right. So, so, yeah, so you can see that there's a modulation here from what we saw outside of Israel already just with these prophets in the Torah. So on one hand, yes, these figures who have these direct encounters with God, it does do something to them. Right. It does pull them out of society. It does make them sort of function at a different level. It does relativize, it does remove them, make them kind of an outsider figure. Right. But that is not done in this destructive way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6284.25,"end":6315.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You don't see them like losing their minds and harming themselves. And yeah, it's very different. There's, there's, and, and, and, and I mean, I would say, well, well, why is that different? It's because they're having an encounter with the God of the universe who created them and loves them, versus demons. Right, right. I mean that's a big difference because the one you're encountering and having a communion with is very, very different."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6316.73,"end":6324.58,"speaker":"Fr Stephen De Young","text":"Right, right. And so there's continuities and discontinuities, but the discontinuities there are significant and important."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6324.9,"end":6326.1,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6326.26,"end":6346.94,"speaker":"Fr Stephen De Young","text":"And they continue, they have wives and children. So it's not that they're made something inhuman or subhuman or non human and they're in some weird liminal non human space now, but that they're now a human who lives and acts and understands things differently because they have this different perspective now."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6346.94,"end":6347.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6347.9,"end":6349.34,"speaker":"Fr Stephen De Young","text":"On, on the things of the world."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6352.54,"end":6352.94,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6355.42,"end":6386.98,"speaker":"Fr Stephen De Young","text":"We get to, as we have prophets coming to, to Israel. Right. And people come and say, I have a message from, from Yahweh, the God of Israel. We get to a point where people need to discern who really is coming bearing a message From Yahweh, the God of Israel and who's nuts or a liar or a grifter."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6387.7,"end":6391.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A problem that still holds today."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6392.9,"end":6393.3,"speaker":"Fr Stephen De Young","text":"Really?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6393.86,"end":6397.5,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. You want to believe the best of. Of everyone."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6398.46,"end":6434.1,"speaker":"Fr Stephen De Young","text":"Yes, yes. You know me, Pollyanna, Father Stephen. So, so there has, there has to be an understanding of what makes someone. And so the, the, the. We've talked already about there being these sort of two pieces. Right. But the first and foremost piece we kind of get spelled out in Jeremiah about the fact that that direct encounter with Yahweh, the God of Israel. Right. Is necessary."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6434.58,"end":6434.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6434.98,"end":6446.82,"speaker":"Fr Stephen De Young","text":"Because if whatever this message is, is something you've divined, word choice, intentional. Right, Right. That means it's not from Yahweh, the God of Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6447.06,"end":6447.46,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6448.66,"end":6456.93,"speaker":"Fr Stephen De Young","text":"Right. If it's something you've read the tea leaves or you've, you know, worked out for yourself. Wait, or you took every 8 8th letter of the Torah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6456.93,"end":6463.09,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. Are you saying the Bible code. The Bible code is not. Oh, man."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6463.81,"end":6469.97,"speaker":"Fr Stephen De Young","text":"And you know how I know this? How do you know this? Because if you use the same algorithm on Moby Dick."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6470.21,"end":6470.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6471.89,"end":6477.11,"speaker":"Fr Stephen De Young","text":"On page. I think it's like 173 or something, it says there are no codes of the Bible, but there are codes in Moby."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6477.74,"end":6480.7,"speaker":"Fr Andrew Stephen Damick","text":"Nice. I thought there was gonna be a Patrick Stewart thing, but."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6481.02,"end":6503.5,"speaker":"Fr Stephen De Young","text":"No, no, no, no, we've already gone to that. Well, okay, We've already gone to that. Well, if I were gonna do another Moby Dick thing, it would be gone anyway, so. Yeah. So that, that direct encounter over against those kind of ways of divining. Right. Flipped open my Bible and it opened to this page."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6503.66,"end":6504.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6505.51,"end":6515.51,"speaker":"Fr Stephen De Young","text":"Whatever else, that's sort of the key thing. And that's spelled out in. So in, in Jeremiah, there's this contest between Jeremiah and these other people who claim to be prophets of Yahweh."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6515.51,"end":6515.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6516.15,"end":6527.51,"speaker":"Fr Stephen De Young","text":"And they kind of have the upper hand because Jerusalem's under siege by the Babylonians and Jeremiah is showing up actually from the God of Israel saying, yeah, you guys are doomed, man."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6528.71,"end":6529.91,"speaker":"Fr Andrew Stephen Damick","text":"Not what anyone wants to hear."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6530.85,"end":6552.85,"speaker":"Fr Stephen De Young","text":"Right. And they're saying, you traitor. Right. And these other so called prophets of the God of Israel are saying, no, no, we're good, man. Everything's good. God's going to deliver us. Right. And so God himself, through Jeremiah, sort of lays out what's required."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6552.85,"end":6619.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this is Jeremiah, chapter 23, verses 18 through 22. For who among them has stood in the counsel of the Lord to see and to hear his word? Or who has paid attention to his word and listened. Behold, the storm of the Lord wrath has gone forth. A whirling tempest, it will burst upon the head of the wicked. The anger of the Lord will not turn back until he has executed and accomplished the intents of his heart. In the latter days, you will understand it clearly. I did not send the prophets, yet they ran. I did not speak to them, yet they prophesied. But if they had stood in my council, then they would have proclaimed my words to my people and they would have turned them from their evil way and from the evil of their deeds. And I think it's worth pointing out here. It starts out, you know, who has stood in the council of the Lord to see and to hear His Word. It's not just words, it's the word. Because you don't see a word. You know, you see the word, the word of Yahweh, the word of the Lord Christ himself."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6619.74,"end":6775.89,"speaker":"Fr Stephen De Young","text":"But yes, so, yeah, right, and so when you're standing in the council of Yahweh, the person who you see in here is the word Dabar Yahweh, right? The Word of God. See previous episode right? Yes, but so you have here those two pieces. You have piece one. You have to be in the divine council, right? You have to have this direct encounter with God like Moses had, right? Like the previous prophets have had. And then, right, you get sent on a mission, right? And so you get this sort of inverted there in verse 21, right? I did not send them, but they ran. They didn't just show up, they came running. They were very eager, right? And he did not speak to them. Yet here they come with a. With some message they got somewhere, right? And so we see that second piece especially laid out if you read like Isaiah, especially Isaiah has the vision, right, of. Of the Lord, and then there's the whole dialogue of who shall we send and who will go for us, right? And Isaiah says, here I am. Send me, right? The us being the council, right? Meeting there with the chairman of the seraphim. And so that being sent, then being sent out with this message, right? And so again, as we were just reiterating in Jeremiah, remember when it says the word of Yahweh, the word of the Lord Debar Yahweh came to blank, right? This isn't a whisper lilting in the wind, right? Again, because this is being contrasted with people kind of divining it or figuring out or working off hints, right? This is. That is the bad kind, right? The kind we're extolling here is you see and hear the word of the Lord. It's clear, right? So this is the word of the Lord. This is a person showing up and talking to them, right? And so this is the word who St. John tells us became flesh. This is Christ, right, Coming and speaking to them. These people, or they are brought into the divine council and Christ is there speaking to them, and they see him and hear him and interact with him. Right. And so we have to disambiguate a little between a false prophet, which is what we're talking about here. This is a false prophet. This is someone who presents themselves as a prophet, but who is not a prophet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6776.45,"end":6778.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6779.34,"end":6781.74,"speaker":"Fr Stephen De Young","text":"Versus, for example, the prophets of baal."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6782.3,"end":6790.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, I just wanted to break in, actually. We just got a pretty relevant question from Facebook. This is from. I think it's."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6790.22,"end":6791.1,"speaker":"Fr Stephen De Young","text":"That's shocking."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6791.82,"end":6792.7,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6792.94,"end":6793.9,"speaker":"Fr Stephen De Young","text":"It came from Facebook."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6794.86,"end":6811.44,"speaker":"Fr Andrew Stephen Damick","text":"I think it's pronounced Evan, E V O N. So she writes this. So when King Saul prophesied with the prophets, was he just possessed by the Holy Spirit or was he actually counted among the prophets? That's her question."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6811.44,"end":6925.6,"speaker":"Fr Stephen De Young","text":"It's a good question. Yes. So he is an example. We're going to get into this a little bit more in. In just a minute with this as a specific example. But so Saul, when that happens, Saul's looking for David, right? David's on the Lamb, and he goes to this dwelling place where Samuel is. Samuel is sort of the prophet and judge of Israel at this time, but he lives in this community of prophets, this sort of village of prophets, where he has his own altar, by the way, and offers sacrifices. And what the text says is that this place is so sort of thick with the Holy Spirit, right? With. With the Spirit of God, with the prophets living there. Right? And this is such a holy place, this has become such a sacred space that when Saul goes there looking for David, thinking David might be hiding there, as soon as he enters the place, he sort of has this encounter, right, with the Spirit. And we tend to think, right, hey, if you suddenly had this direct encounter with God, right, Like, that would be this wonderful ecstasy, right? Or this joyous moment, right? But you don't actually see that anywhere, even with the prophets in the Old Testament, right? When Moses sees the burning bush, he kind of freaks out. Isaiah, when he has his vision, he's standing in the divine council, basically curses. He basically curses. He's like, I'm blanked, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6927.36,"end":6927.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6927.68,"end":6928.64,"speaker":"Fr Stephen De Young","text":"He's not done for."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6929.12,"end":6930.24,"speaker":"Fr Andrew Stephen Damick","text":"I am undone."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6931.12,"end":6958.61,"speaker":"Fr Stephen De Young","text":"Right? That's a Nice bowl arm. You know, woe is me, for I am a sinful man. Yeah, but. And so that's why. Right. To come into the presence of God is to suddenly become very much aware of your lack of holiness. Yeah, right, right. And so with Saul at this point in his life, when the Holy Spirit has left him and an unclean spirit has entered him."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6958.61,"end":6959.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6960.94,"end":6988.32,"speaker":"Fr Stephen De Young","text":"Right. It becomes sort of this almost violent encounter where he strips naked and he's thrashing around on the ground. Yeah, right. And. And it seems more like one of these pagan prophets having an encounter. Right. Than. Than what we see with the. The Hebrew prophets. But it's because of who Saul is at the time. Yeah, right. Saul's a lot more like Balaam than he is like Samuel at that point."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6988.4,"end":6997.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's. That's a great question. And she just informed me that her name is pronounced Yvonne, which I've never seen spelled that way. Ev, O, N. So I learned something new today."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6997.44,"end":6998.92,"speaker":"Fr Stephen De Young","text":"You're not the spelling police, man."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6998.92,"end":6999.4,"speaker":"Fr Andrew Stephen Damick","text":"I'm not."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6999.4,"end":6999.92,"speaker":"Fr Stephen De Young","text":"Let it go."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":6999.92,"end":7007.64,"speaker":"Fr Andrew Stephen Damick","text":"But spelling changes. It just does."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7007.64,"end":7016.69,"speaker":"Fr Stephen De Young","text":"Yeah, but I mean, if you, if you spell it with a Y, you sell Yvonne with a Y, then poor kids in the back of the line coming in for recess every day. You don't need that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7016.69,"end":7017.17,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7017.17,"end":7018.01,"speaker":"Fr Stephen De Young","text":"Alphabetical order."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7018.09,"end":7018.73,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7019.69,"end":7021.53,"speaker":"Fr Stephen De Young","text":"Unless there's a kid named Zeke or something."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7021.77,"end":7029.05,"speaker":"Fr Andrew Stephen Damick","text":"I mean, my name starts with an A, so I've always been somewhere. Somewhere. Yeah. I'm privileged. Privileged, exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7029.13,"end":7029.89,"speaker":"Fr Stephen De Young","text":"Check yourself."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7029.89,"end":7030.41,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7031.69,"end":7036.49,"speaker":"Fr Stephen De Young","text":"So alphabetically privileged. So."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7036.97,"end":7042.85,"speaker":"Fr Andrew Stephen Damick","text":"All right. So, yeah. So, yeah, False prophets and BAAL prophets. Yeah. Like, this is another issue."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7043.01,"end":7049.09,"speaker":"Fr Stephen De Young","text":"So the BAAL prophets. Right. Aren't false prophets. They're really prophets of baal."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7049.49,"end":7050.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7050.61,"end":7086.3,"speaker":"Fr Stephen De Young","text":"Right. They really have this spiritual relationship with this what we would call a demonic spirit. Right, Right. Whereas these false prophets are people who are not prophets at all. Right. But who claim to be. And that distinction kind of gets blurred by modern folks who want to say, well, you know, BAAL doesn't exist. Right. And so therefore they're essentially the same boat. Right. They're just making it up. Right. But the kind of experience we've been talking about that these pagan prophets had isn't made up."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7086.78,"end":7087.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7089.02,"end":7096.71,"speaker":"Fr Stephen De Young","text":"Someone doesn't go into, like, a fevered ecstasy and emasculate themselves physically imaginarily."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7097.75,"end":7110.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. One or two crazy people might do that, but you don't get this sort of sustained institution of that kind of thing unless there's some kind of results that people are actually experiencing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7110.99,"end":7124.95,"speaker":"Fr Stephen De Young","text":"I know about Marshall Applewhite, but still, you don't have that going on over centuries. And I would submit that there's probably something demonic going on with Marshall Applewhite too. So. There is."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7125.03,"end":7128.31,"speaker":"Fr Andrew Stephen Damick","text":"He's the Heaven's Gate guy, by the way. Everybody. If you don't know who that is."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7128.47,"end":7137.75,"speaker":"Fr Stephen De Young","text":"Yeah. If you don't know who Marshall is. Yeah, yeah. You mean people don't just sit around watching documentaries about cults all day? Seriously, in between episodes of Star Trek?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7138.47,"end":7141.75,"speaker":"Fr Andrew Stephen Damick","text":"I don't do it all day, but I do sometimes do that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7142.07,"end":7173.28,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And so, so, yeah, these are two different things. And so, and this is important to distinguish also because, and we've even commented on this on the show before, there are folks among some groups of our Protestant friends who identify as prophets or as being able to prophesy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7174.53,"end":7174.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7176.85,"end":7199.72,"speaker":"Fr Stephen De Young","text":"And as we've said before, although I don't know if it got through before, we're not saying those people are like demon possessed. Right. They're not like BAAL prophets. Right. They're not like. We're not saying they're like Marshall Applewhite. Right. We're not trying to draw that comparison. Right, Right. But someone can be self deluded."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7201.23,"end":7201.47,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7201.47,"end":7278.01,"speaker":"Fr Stephen De Young","text":"Right. And be a false prophet in this sense we're talking about. Right. They might even think they're legitimately a prophet. They may think that the message that they've intuited or however they believe they've gotten it. Right. Came to them in a dream, whatever. They may believe that that is from the Lord. Right. And it may not be. Right. And that makes them a false prophet and that makes them spiritually deluded. Right. And spiritual delusions do come. Right. Those are not good things. Spiritual delusions don't come from God. Right. They come from somewhere else. Right. I'm kind of disambiguating my former comments on the show to try to clarify them, but you enter into this messy space here because Deuteronomy, for example, is so clear on what is supposed to happen to false prophets, which is namely the first time they say something that they claim comes from Yahweh, the God of Israel, that doesn't. And it becomes apparent that that did not come from Yahweh, the God of Israel. They're stoned to death."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7278.66,"end":7281.78,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. They get executed."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7282.82,"end":7288.98,"speaker":"Fr Stephen De Young","text":"Right. And so we are not for the record advocating stoning anyone to death."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7289.14,"end":7289.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7290.42,"end":7298.62,"speaker":"Fr Stephen De Young","text":"No matter how much they prophesied that Donald Trump would already be president again by now, they should not be stoned to death by you or Anyone else."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7298.62,"end":7303.94,"speaker":"Fr Andrew Stephen Damick","text":"That was a thing. I mean, there was a lot of prophecy going on that, that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7304.28,"end":7308.64,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So we're not advocating for stoning anyone to death."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7308.64,"end":7309,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7309.72,"end":7348.66,"speaker":"Fr Stephen De Young","text":"But if you follow the show, if you've read Religion of the Apostles. Right. You know that the language that's used in the Old Testament, being cut off from among the people and the death penalty is applied in the New Testament. It's not thrown away. It's applied in the New Testament in the form of excommunication. Right, right. Because the. The life of the life of Christ. Right. Is the life of God. That's real life. Biological life is an image of that, a derivative form of that. Right. That's the real life. So being cut off from that is actually a worse punishment than being stoned to death."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7350.74,"end":7351.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7351.14,"end":7360,"speaker":"Fr Stephen De Young","text":"Right. And again, reiterating, the purpose of excommunication in the New Testament is to drive someone to repent."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7360.56,"end":7362.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7362.32,"end":7389.69,"speaker":"Fr Stephen De Young","text":"Right. So the idea here is, what we would be saying is if someone is under the spiritual delusion that they are a prophet and it becomes clear that what they're saying and claiming is from God is not from God. Right. Then they need to be cut off from. Be with the people of God until they come to repentance. Right. And come back to the truth and back to Christ."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7389.85,"end":7404.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the normal way that happens is excommunication, which we see that in the New Testament, you know, someone, as it says, I mean, this is a very strong language, being handed over to Satan, you know, so that they would repent, so that their soul can be saved."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7405.21,"end":7413.17,"speaker":"Fr Stephen De Young","text":"For the destruction of their body and the salvation of their soul. Right. That destruction of the body is included in there to make the connection to the death penalties of the Old Testament. Clear."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7414.05,"end":7414.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7416.29,"end":7420.93,"speaker":"Fr Stephen De Young","text":"So that's the idea. But the purpose is repentance. The purpose is to break that delusion."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7421.17,"end":7421.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7422.37,"end":7433.65,"speaker":"Fr Stephen De Young","text":"That someone is suffering under. Because it's destructive to them as much as everybody else. Right. Because after the first few times you make those prophecies and they turn out to be bogus, people stop listening to you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7434.21,"end":7434.61,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7434.69,"end":7437.33,"speaker":"Fr Stephen De Young","text":"But that delusion can still do a lot of harm to you."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7438.06,"end":7438.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7438.94,"end":7443.18,"speaker":"Fr Stephen De Young","text":"Even though everybody else is over it. Right. And so that's why it needs to be broken in that way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7443.34,"end":7443.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7446.3,"end":7478.41,"speaker":"Fr Stephen De Young","text":"So, but again, we see in the Old Testament here sort of the. At the end of our second half, we see that another point of continuity is that the prophet in the Old Testament, because of this direct encounter. Right. With God and this direct relationship, their authority derives from that direct relationship. And so they stand as sort of an outsider over against the king and the high priest and the priesthood in Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7478.57,"end":7480.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7480.41,"end":7491.13,"speaker":"Fr Stephen De Young","text":"Not over against. Isn't opposed always. Sometimes. Right. Depending on what the king and the priests are doing. Right. But. But they are sort of separate. They're sort of outside that."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7491.58,"end":7491.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7491.98,"end":7492.7,"speaker":"Fr Stephen De Young","text":"That system."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7492.78,"end":7505.66,"speaker":"Fr Andrew Stephen Damick","text":"There's a sort of. It's not checks and balances exactly. But that's kind of the concept, you know, in independent authorities that, you know, and the prophet functions this. As this outsider."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7506.22,"end":7573.52,"speaker":"Fr Stephen De Young","text":"Right. And so the prophet can then come to the king, you know, Nathan can come to King David. Right, right. And say, you know, Moses can come to Aaron and say, you've done messed up Aaron. Straighten him out. Right. So there are. And. And so there are those structures, but then there's also these prophets with whom God is. Is dealing directly and who provide this important. Right. Check this important corrective. And we see in the Old Testament that these prophets form communities. Right. We just used the example, or talked about the example of Samuel who had this community of prophets around him. We see this in the lives of Elijah and Elisha. It talks about them going and staying on the other side of the Jordan with the community of the prophets. Right. So there were these groups, you know, these people were married, these people had children. Right. But see, they're still kind of outside. They're in their own place. Right, right. They're not within. Right. And it's not just when it's corrupt, it's all the time."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7574.08,"end":7577.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's inherent to prophecy that it has this removal."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7578.08,"end":7628.28,"speaker":"Fr Stephen De Young","text":"Right. This removal. And so you even get some sort. Not as extreme as we saw in the pagan world, but you get some kind of extreme forms of this. Right. In the Old Testament in places. We just talked about that whole episode with Saul. That's an example of an extreme episode you get with Ezekiel, for example. So Ezekiel is living with the other deportees, Right. In Babylon in a regular Israelite community. But he does things like wandering around naked for a while, burning dung and cooking over it. Right. He does these sort of bizarro things. Right. That separate him from everyone else. Right. And that are a product of this direct experience with God. So he is changed by it. It's not in a physically destructive way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7628.6,"end":7628.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7628.92,"end":7637.96,"speaker":"Fr Stephen De Young","text":"But it is in a way where there are these sort of public displays of being set apart and being different, being outside, being. Having this different perspective."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7638.04,"end":7638.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7638.44,"end":7641.64,"speaker":"Fr Stephen De Young","text":"Which all things cultural, which is quite."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7641.64,"end":7658.36,"speaker":"Fr Andrew Stephen Damick","text":"Different from a lot of our modern, glitzy, spectacular prophets who, you know, live at the top of a very wealthy heap. Right, right. Generally speak. I mean, not all the time, but a lot of them are that way. I mean, that's. They are not living in caves and exercising a set of cities."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7660.03,"end":7669.71,"speaker":"Fr Stephen De Young","text":"Yeah. If Benny Hinn wanders the streets of, say, omaha naked for 7 years, I will believe he is actually a prophet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7669.87,"end":7672.59,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Previously unsaid sentences in human history."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7672.99,"end":7674.51,"speaker":"Fr Stephen De Young","text":"Yes. There you go."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7674.51,"end":7679.87,"speaker":"Fr Andrew Stephen Damick","text":"So, that being said, we're gonna go to our second and final break. We'll be right back."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7680.11,"end":7696.44,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment. Take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7707,"end":7709.63,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7710.1,"end":7712.74,"speaker":"Fr Stephen De Young","text":"Do you have questions about Orthodox Christianity."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7712.9,"end":7716.5,"speaker":"Fr Andrew Stephen Damick","text":"That you can't trust strangers in Internet forums to answer?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7716.66,"end":7722.66,"speaker":"Fr Stephen De Young","text":"Are you an Orthodox Christian looking for a reliable first place to send your interested friends?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7722.82,"end":7725.7,"speaker":"Fr Andrew Stephen Damick","text":"Do you need help finding an Orthodox church near you?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7726.18,"end":7733.94,"speaker":"Fr Stephen De Young","text":"My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7734.02,"end":7736.59,"speaker":"Fr Andrew Stephen Damick","text":"I serve in the Orthodox Church and America."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7736.75,"end":7742.51,"speaker":"Fr Stephen De Young","text":"My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7742.59,"end":7751.87,"speaker":"Fr Andrew Stephen Damick","text":"And I'm Father Andrew Stephen Damick, Chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox Intro team."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7752.27,"end":7758.27,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop online to get an introduction to the Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7758.43,"end":7761.41,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clerks."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7762.04,"end":7768.36,"speaker":"Fr Stephen De Young","text":"A place to send your friends and not just toss them into the chaos of the Internet, a place to get."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7768.36,"end":7820.45,"speaker":"Fr Andrew Stephen Damick","text":"Help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient faith Ministries and made possible by our donors. It's an Orthodox on ramp to the Christian life again. That's orthodox intro. Intro.org There it is. There's that metal version of our theme once more. Thank you, Rob."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7823.17,"end":7824.33,"speaker":"Fr Stephen De Young","text":"Your powers combined."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7824.33,"end":7824.77,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7824.77,"end":7827.17,"speaker":"Fr Stephen De Young","text":"You are the Orthodox intro team."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7830.29,"end":7860.29,"speaker":"Fr Andrew Stephen Damick","text":"It's true. We're like Voltron. Well, welcome back, everybody. It's the third half of our show on prophets and prophecy. In the first half, we talked about prophecy in paganism, and the second half we talked about prophecy within Israel in the Old Testament. And now we're talking about the New Testament. I mean, are there still prophets in the New Testament? Isn't that just an Old Testament thing? Wasn't John the Baptist the last, the final. You know, what's going on?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7860.93,"end":7863.09,"speaker":"Fr Stephen De Young","text":"Is the church a nonprofit organization?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7863.41,"end":7863.89,"speaker":"Fr Andrew Stephen Damick","text":"Hey."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7868.62,"end":7948.78,"speaker":"Fr Stephen De Young","text":"The answer is no. Right. We may think that. And it is. We do refer to. Right. Old Testament saints as prophets. Right. For example, and we do talk about St. John the Forehonor being the culmination of the prophets or even sometimes the end of the prophets. But brief digression, the word end, like telos. Right. And the words we usually translate as perfect in the New Testament in Greek really mean more like mature or complete. Right, Right. The fullness of the prophets and fullness not. Yeah. Not like the last one, the final prophets. Not like perfect, like flawless. Right. It means like. Right. So, yeah, that's what we're saying about St. John. Right. Is that he is the ultimate fullness. That doesn't mean. Right. Just like we said, Moses is sort of this paradigmatic prophet. That doesn't mean there weren't any others. Right, Right. Right. So. And if anyone would want to say, well, no, I'm drawing a hard and fast line. There are no prophets after St. John the Forerunner. You're going to run into some problems when you get to the book of Acts."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7948.78,"end":7955.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that word is used very explicitly to refer to this one guy named Agabus."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7955.86,"end":7961.06,"speaker":"Fr Stephen De Young","text":"Yes. Agabus. Also underutilized baptismal name."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7962.18,"end":7964.58,"speaker":"Fr Andrew Stephen Damick","text":"Very true. I have never met an Agabus."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7965.06,"end":7968.02,"speaker":"Fr Stephen De Young","text":"Yes, an Aggie is a perfectly good nickname. There you go."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7968.02,"end":7981.55,"speaker":"Fr Andrew Stephen Damick","text":"If you're out there. If you're out there. If you're out there, Agabus, write in, tell us. We want to hear from you, so let us know. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7982.67,"end":7999.56,"speaker":"Fr Stephen De Young","text":"So Agabus, the prophet Agabus, he's explicitly identified as a prophet the two times he shows up in the Acts of the Apostles. And the first time he shows up, he shows up in Acts 11 to warn everybody that there's going to be a famine."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":7999.64,"end":8005.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he comes kind of out of nowhere, just, you know, in the classic prophetic style."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8006.44,"end":8025.45,"speaker":"Fr Stephen De Young","text":"Right. Like, he's not, he's not like hanging around. He's not one of the apostles. He's not one of the seven deacons. He's not. Right. He's. He's not in one of these sort of formal church leadership position positions. He just shows up. Right. And, and has this mentioned and he's even announcing a famine. So I mean, this is like old school Elijah stuff. Right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8025.45,"end":8025.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8027.33,"end":8053.57,"speaker":"Fr Stephen De Young","text":"This is St. Elias stuff. He's doing this classical prophet, Old Testament prophet kind of thing, as you can get. The second time he shows up he shows up at Acts 21, and he even does. This time he does some Ezekiel stuff, right? Because Ezekiel was always called upon to do these sort of visible things, right? Take two stabs, bind them together, break them, right? This kind of thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8053.57,"end":8053.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8054.37,"end":8059.23,"speaker":"Fr Stephen De Young","text":"And when Agabus shows up the second time in Acts 21, he shows up with his belt."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8059.63,"end":8078.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's weird. He takes Paul's belt and ties up his feet and hands, right? And says, you know, I'll just read it. Thus says the Holy Spirit, this is how the Jews at Jerusalem will bind the man who owns this belt and deliver him into the hands of the Gentiles. So he's prophesying Paul being, you know, arrested, right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8079.39,"end":8130.7,"speaker":"Fr Stephen De Young","text":"Right. So he's doing this kind of weird prophetic act, right? Which is very Ezekiel. So it's not just that the text calls him a prophet. It's not just he says, thus says. Notice, thus says the Holy Spirit, instead of thus says Yahweh. For all you people who don't think the Holy Spirit being God is explicit in the New Testament, right? It always Spirit, God, the Holy Spirit is Yahweh according to this pattern. But it's not just. It's that he's again, doing something that the prophets in Scripture did, right? Doing this prophetic action, right? This display, right? Which, you know, strictly speaking isn't necessary, right. You could have just showed up and said, it's been revealed to me by the Holy Spirit that, you know, you're going to get arrested."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8130.86,"end":8136.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But everyone's going to remember how he took Paul's belt and tied it around his hands and like."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8136.81,"end":8153.13,"speaker":"Fr Stephen De Young","text":"Oh, yeah, right. Because this is part of this again, this, this prophetic thing, right? This sort of display, right? So we have this prophet in the Book of Acts, right? And the Book of Acts does not really, like, meditate upon his existence."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8153.13,"end":8155.41,"speaker":"Fr Andrew Stephen Damick","text":"No, he just comes and goes, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8155.41,"end":8212.92,"speaker":"Fr Stephen De Young","text":"And it just takes for granted that, yeah, there's a prophet, Agabus, right? And so then we also find, especially in First Corinthians, St. Paul talking about prophecy, and he's not talking about prophecy, right? Like, so, like, St. Peter talks about prophecy. He says no prophecy was ever given by the will of man. He's talking about, like, the Old Testament scriptures, right? So St. Paul isn't talking about the prophets of old, right? He's talking about prophecy as a gift within the church in Corinth, right? So there are some prophets in the Church of Corinth or could be prophets in the church of Corinth in First Corinthians. 12, verse 10. He lists it as one of the gifts."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8212.92,"end":8214.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8214.31,"end":8242.58,"speaker":"Fr Stephen De Young","text":"That the Spirit has given to the church. Right. To some prophecy. So this is paralleled with these other. These other kinds of gifts of teaching and these sort of things. And when he brings it up in more detail in chapter 14 of First Corinthians, St. Paul is very deliberately trying to distinguish the gift of prophecy from the gift of tongues."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8243.54,"end":8248.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, it's pretty clear if you actually read the chapter, he doesn't say that they're the same thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8248.58,"end":8252.42,"speaker":"Fr Stephen De Young","text":"Right. Which is. He's literally arguing the exact opposite."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8252.74,"end":8253.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8253.14,"end":8255.78,"speaker":"Fr Stephen De Young","text":"He's literally deliberately saying they're not the same thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8255.86,"end":8256.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8256.14,"end":8262.1,"speaker":"Fr Stephen De Young","text":"Which is a distinction that I think is lost on at least some of our more charismatic friends."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8262.26,"end":8262.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8264.02,"end":8282.88,"speaker":"Fr Stephen De Young","text":"Who tend to blend those things together a little more. So the way he distinguishes this in particular is that he says that tongues are directed toward the unfaithful outsiders, those outside the church."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8283.12,"end":8284.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. So it's an evangelistic tool."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8284.96,"end":8290.88,"speaker":"Fr Stephen De Young","text":"Right. Whereas prophecy is directed toward those in the church, toward the faithful."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8291.61,"end":8292.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A pastoral tool."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8292.89,"end":8295.37,"speaker":"Fr Stephen De Young","text":"Right. That makes them two different things."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8296.17,"end":8330.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And he says very clearly, and he says, of course, that tongues requires an interpreter. It requires somebody to explain what is being said, which basically just means that he's talking about what we saw in, you know, in Acts at the day of Pentecost, where they're speaking and people understand in their own language, you know, that it's about foreign languages. This is what we call xenoglossia. Right. That that's what he's talking about. And the point of being able to speak foreign languages is so that you can preach the gospel and evangelize."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8330.98,"end":8343.98,"speaker":"Fr Stephen De Young","text":"Right. So this is tongues is something directed outwards. Right, right, right. And so I don't know how you explain that from the current sort of charismatic view of tongue speaking."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8344.61,"end":8345.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8345.13,"end":8356.61,"speaker":"Fr Stephen De Young","text":"Because that would seem to imply that tongue speaking of that kind, glossolalia, would be something you did toward unbelievers as an evangelistic tool."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8357.25,"end":8357.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8357.69,"end":8362.69,"speaker":"Fr Stephen De Young","text":"And I don't think that's how it functions in those communities, but that's how St. Paul says it's supposed to function."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8362.69,"end":8363.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8364.93,"end":8436.1,"speaker":"Fr Stephen De Young","text":"And so that's why I think it's much more clearly the Pentecost issue, the ability to speak other languages and say, very basically say things in other languages if there's nobody around who understands that language, because it's pointless. Right, right. It just creates confusion. Right. Whereas prophecy, again, is toward the faithful, it's directed toward the church. And so this is someone who has had this kind of direct encounter with God and who is then going to share from that with the people of God. And so we're going to argue a lot of the rest now of the third half is going to be making the point. It's a point I made before. Not as much detail on this show, but other places that really are. Paradigmatic prophet for the New Testament. Right. If Moses is the paradigmatic prophet in the Old Testament, the paradigmatic prophet in the New Testament is actually St. Paul."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8436.82,"end":8438.82,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So how does that work?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8440.26,"end":8442.74,"speaker":"Fr Stephen De Young","text":"And that's not how we're used to thinking of St. Paul."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8442.74,"end":8445.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, we don't call him the prophet Paul."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8446.1,"end":8464.34,"speaker":"Fr Stephen De Young","text":"Yeah. Because we've been trained by a long course of Western history. I'm looking at you, St. Augustine and Martin Luther to think about St. Paul in a very different way. Right. And that starts with what gets called the conversion of St. Paul."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8464.98,"end":8466.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8466.9,"end":8571.1,"speaker":"Fr Stephen De Young","text":"So both. And this comes from a fairly honest place with St. Augustine. Right. St. Augustine was himself a convert to Christianity. Right. After going through sort of a Platonic phase and a Manichean phase and other phases. Right. He finally comes to Christianity. Right. And so he had this experience. And so when he reads of St. Paul and when he reads St. Paul's letters, he kind of over identifies. Yeah, right, right. And since he over identifies, he kind of casts St. Paul as himself. Right. He says this experience I had must be like the experience St. Paul had when he converted from Judaism to Christianity. Right. And Martin Luther, of course, is an Augustinian monk, literally. Right, right. And an Augustinian influence also. And he very quickly. Right. Casts his own experience as St. Paul's experience. Right. So the Pharisees, of which St. Paul was one, becomes medieval Roman Catholicism and St. Paul becomes Martin Luther who, you know, has this change of religion. Right. That really. It's all about. About faith. Right. And all that's all wet. Right. But neither of those is doing justice to St Paul or the Pharisees for that matter. Right. As they actually existed. And neither of Those is how St. Paul's experience is actually described."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8571.18,"end":8571.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8573.02,"end":8583.9,"speaker":"Fr Stephen De Young","text":"The first big clue to that is the fact that this happens in about A.D. 35. And there is are not two separate religions, Judaism and Christianity at the time."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8584.14,"end":8588.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Christianity is a religion, is a movement within the Judean community."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8589.27,"end":8600.87,"speaker":"Fr Stephen De Young","text":"Yes. And one that's only existed for a few years. Right, Right. Like Christ ascension was as long ago as like Biden becoming president."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8601.51,"end":8602.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8605.11,"end":8701.85,"speaker":"Fr Stephen De Young","text":"There's not been a lot of time for development here. Right. So the idea that St. Paul was leaving one religion and joining another religion just does not work. Yeah, right. Just on the face of it, that's not what's happening. It can't be. Right. So if we set that aside, if we start setting all this conversion stuff and the way we've been taught to look at St. Paul's side and we look at how St. Paul describes it. Because not only does St. Luke describe it, this episode on the road to Damascus gets described several times in the New Testament. Yeah, it's a key event in the New Testament. It gets narrated sort of as it happens in the narrative of Acts. It gets narrated a second time at the end of the book of acts when St. Paul is speaking about it, and then it shows up again in St. Paul's epistles a couple of times. He talks about it directly. Right. So we have a lot of direct sort of Testimony here from St. Paul and St. Luke as to exactly what happened here and how it was understood by them. So when he describes this experience, he's on the road to Damascus, Christ appears to him. He sees Christ. He sees the Word of God. Right, Word of God. Right. Christ. The word comes to him, speaks to him, reveals himself to him. He has this direct encounter, and then he's sent on a mission."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8702.41,"end":8733.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. And that. That word sent is pretty key because, like the word apostle apostolos in Greek means one who is sent out. And it's actually a. It's also a military term. Right. Like for a sortie, as we would call it now, which is a good French word. But it's, you know, a group sent out or a person sent out on a mission. Right, but. But it's. But. But that's not the first time that we see that word. Right. Not just in the New Testament. That shows up in the Greek Old Testament."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8733.07,"end":8746.75,"speaker":"Fr Stephen De Young","text":"Right, Right. The verb apostolo that stands behind it is the verb that's used, for example, in the Greek of Isaiah. Here I am send me. That's the verb for send."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8747.23,"end":8753.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's already kind of a prophety word. Prophety, Prophetic prophetess."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8753.35,"end":8823.78,"speaker":"Fr Stephen De Young","text":"In Greek, Isaiah is the one sent. He is the apostle of the divine council to Israel. Right. So we see there this pattern. But. But there's even more direct than that. So one of the places that St. Paul talks about this experience directly is in Galatians. That's about a fair amount in Galatians, actually. Yeah, but. And everyone. Right, Everyone. Every scholar who's actually a scholar accepts that St. Paul wrote Galatians. I know there's people who argue out of their epistles, but I mean, friend of the show Bart Ehrman, I once saw in a debate with the Jesus mythicist. And when the Jesus mythicist said he didn't think St. Paul wrote Galatians, Bart Ehrman laughed out loud. That pretty much ended the debate because the guy didn't like being laughed at. So even friend of the show Bart Ehrman knows that it's ridiculous to suggest that St. Paul didn't write from Galatians. So this is straight from St. Paul if anything is describing his experience. Yes."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8823.94,"end":8877.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. So this is Galatians 1, 11, 16. For I would have you know, brothers, that the gospel that was preached by me is not man's gospel, for I did not receive it from any man, nor was I taught it, but I received it through the revealing of Jesus Christ. For you have heard of my former life in Judaism, how I persecuted the church of God violently and tried to destroy it. And I was advancing in Judaism beyond many of my own age among my people. So extremely zealous was I for the traditions of my fathers. But when he who had set me apart before I was born, and who called me by his grace, was pleased to reveal his son to me in order that I might preach him among the nations. And that, of course, parallels. Almost. Almost identically in some ways."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8878.65,"end":8880.01,"speaker":"Fr Stephen De Young","text":"The Greek quotes it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8880.09,"end":8882.37,"speaker":"Fr Andrew Stephen Damick","text":"Oh, the Greek actually literally quotes it. There you go."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8882.37,"end":8885.21,"speaker":"Fr Stephen De Young","text":"Okay, the Greek. You could throw in quotation marks."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8885.21,"end":8885.93,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8885.93,"end":8886.25,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8886.25,"end":8917.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So, yeah, now this is not from the Greek, but you'll hear basically that this is the same. This is Jeremiah. Jeremiah, chapter 1, verses 4 through 5. Jeremiah, speaking of himself. Now, the word of the Lord came to me and said, before I formed you in the womb, I knew you. And before you were born, I consecrated you, I appointed you a prophet to the nations. And as you said, the Greek Old Testament. This is literally Paul is quoting that when describing himself."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8918.56,"end":8926.92,"speaker":"Fr Stephen De Young","text":"Right. He's taking the same words and applying them to himself in terms of what happened again on the road to Damascus."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8926.92,"end":8927.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8928.16,"end":8968.68,"speaker":"Fr Stephen De Young","text":"So St. Paul saw what happened to him as a prophetic call, like Isaiah had or like Jeremiah had or like Moses, direct encounters. Right. That's how he understood what had happened. And. Right. What else do we see in terms of parallels then? Well, Moses has this direct encounter, and he's sent with something, the Torah. Right. In the same way as what St. Paul is saying here in Galatians, he's sent with the gospel. Right. Moses receives the Torah during that encounter, St. Paul here in Galatians is saying he received the Gospel in that encounter."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8968.91,"end":8969.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8969.79,"end":8979.11,"speaker":"Fr Stephen De Young","text":"He didn't hear it from anybody else. He didn't get it from anybody else. He received it from Christ in the way that Moses received the Torah from Christ on Mount Sinai."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8979.11,"end":8979.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8979.63,"end":8988.27,"speaker":"Fr Stephen De Young","text":"Right. And we even see. Notice what happens to St. Paul after this encounter. Note his way of life."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8988.91,"end":8989.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8989.95,"end":8992.55,"speaker":"Fr Stephen De Young","text":"He becomes nomadic, he travels from place."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8992.55,"end":8995.87,"speaker":"Fr Andrew Stephen Damick","text":"To place, and he's celibate, unlike most of the apostles."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":8996.46,"end":9001.18,"speaker":"Fr Stephen De Young","text":"Yeah. He's an outsider. Right. He's even an outsider to the other apostles."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9001.58,"end":9004.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. He functions as a corrector, even to St. Peter."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9005.9,"end":9035.07,"speaker":"Fr Stephen De Young","text":"And he says, he makes this clear. I didn't go after that experience. I didn't go consult with the apostles in Jerusalem. I went out into the desert of Arabia. He goes out into the desert by himself. He's sort of thrust out into the desert by this experience. Right. And that's where he holds it. And that's the same Arabia where later in the same epistle, he talks about Mount Sinai being in Arabia, which he's."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9035.07,"end":9044.55,"speaker":"Fr Andrew Stephen Damick","text":"Not identifying where Mount Sinai is. Yeah, no, it's. It's that I had a Sinai experience when I was in Arabia is essentially what he's saying."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9044.55,"end":9054.83,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And then you notice how he functions going forward, even with the other apostles. Right. Coming to St. Peter in Antioch and calling him to account."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9055.23,"end":9055.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9055.87,"end":9082.99,"speaker":"Fr Stephen De Young","text":"I withstood the way the prophets did with the priests and the kings. Right. Or coming with a message to St. James in Jerusalem. Yeah, Right. Where he's not part of those structures. Right. And he's. But he's functioning outside those structures as an apostle to the nations because of this direct encounter, he said. So St. Paul is a prophet in the New Testament."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9084.35,"end":9086.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's doing all the same things that the prophets do."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9086.91,"end":9105.65,"speaker":"Fr Stephen De Young","text":"Yes. This is not a different phenomenon. This is the same. This is the same phenomenon. And so we need to have a note here because of some previous episodes and things and some potential misunderstandings and what we're saying here on Visions."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9106.05,"end":9107.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So what's."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9107.25,"end":9108.45,"speaker":"Fr Stephen De Young","text":"And even dreams."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9109.97,"end":9119.53,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I think most of the time when people think of visions, if someone said, I had a vision, they. They think, okay, you're deluded, dude. You're. You're seeing things, you know?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9119.53,"end":9120.77,"speaker":"Fr Stephen De Young","text":"Yeah. They think. Hallucination."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9120.93,"end":9123.41,"speaker":"Fr Andrew Stephen Damick","text":"Hallucination, Right, exactly. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9123.65,"end":9160.5,"speaker":"Fr Stephen De Young","text":"Right, right. Something not real, a mirage. Right. Yeah, yeah, yeah. That's not what a vision is in scripture. Right. Or even a dream, for that matter. Right. When we think of dreams, we think of dreams as just being like, well, your Sort of brain computer is still churning while you're asleep and it's processing the things from the day. Right. Or maybe if you're a little more sophisticated and into psychoanalysis, right. Then like your brain is representing things from your unconscious to you that you can't deal with while you're awake or whatever. Right. But it's still this sort of internal churning, right?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9160.58,"end":9161.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9161.86,"end":9179.7,"speaker":"Fr Stephen De Young","text":"And not real. There's no sort of reality to it. So visions, right? In the scripture, when Isaiah, right, has his vision of Yahweh, he's not saying, I saw a hallucinatory icon of Yahweh, the God of Israel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9179.94,"end":9189.12,"speaker":"Fr Andrew Stephen Damick","text":"No, right. He's saying that God appeared to him. That God appeared to him. Not, I had him, I had him, I imagined, you know."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9190,"end":9195.36,"speaker":"Fr Stephen De Young","text":"Yeah. Jacob at Bethel. Yahweh is standing on top of the ziggurat."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9196.32,"end":9219.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. And a vision doesn't necessarily have to be like, like some, you know, wavy, misty, whatever, because, I mean, most of the visions that we get in scripture, it says, and a young man was sitting at the right side of the tomb or something like that. Like that's, that's the way that visions sort of usually work is there's nothing sort of woo about them, you know?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9220.48,"end":9257.8,"speaker":"Fr Stephen De Young","text":"Well, yeah. And what do they say? They come back and they say, we've seen a vision of angels. They weren't saying the angels weren't really there. Right, Right, right, right. So vision, right. Vision is here, functioning. Gotta go back to our episode about the noose. Right. The news, right. This, this perceptive faculty for the spiritual world, right. Is most commonly right. Of our senses. It is most commonly analogized to the eyes, Right. To see it more than to hearing or smelling."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9258.03,"end":9258.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9258.75,"end":9259.47,"speaker":"Fr Stephen De Young","text":"They're taste."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9259.47,"end":9260.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9262.19,"end":9284.11,"speaker":"Fr Stephen De Young","text":"So that's, that's the analogy that's made. Right. And so, you know, when, when Gehazi has his eyes opened by Elisha and sees the hosts of the Lord. Right. The angelic hosts again, they're actually there. Right. He just did not perceive them before, but now he is."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9284.58,"end":9284.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9284.86,"end":9327.89,"speaker":"Fr Stephen De Young","text":"Right. So a vision is noetic perception, Right? Right. Which most of us who are prophets don't do all the time. Right. And even most prophets don't seem to do all the time. Right. Some of them seem to do it all of the time. Some of them just some of the times. Right. So this isn't. This isn't fake, right? This isn't something not real. This isn't the opposite of physical. Yeah, right. When St. Paul saw Christ, he saw Christ bodily, right. Christ's body. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9327.89,"end":9331.09,"speaker":"Fr Andrew Stephen Damick","text":"He saw Christ because Christ still has a body."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9331.97,"end":9338.29,"speaker":"Fr Stephen De Young","text":"Right. He is really there. When we say Christ is in our midst, we mean it, even though most of us don't see him."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9339.66,"end":9339.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9340.06,"end":9364.78,"speaker":"Fr Stephen De Young","text":"There have been occasions in the history of the church where someone has actually seen him. Right. And they're really seeing him because he's really there. We just don't perceive him directly because of the clouding of our noose, because of sin, et cetera, et cetera. Right. See that episode? But this is also true of dreams, because otherwise, what are you going to do when scripture tells us that St. Joseph the betrothed had an angel come to him in a dream?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9365.62,"end":9367.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It doesn't say he dreamed up an angel."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9368.1,"end":9378.74,"speaker":"Fr Stephen De Young","text":"Right. He hallucinated an angel who told him something and he believed it. It says an angel came to him and the place where the angel came and appeared to him was in his dream while he was asleep."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9379.54,"end":9409.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think the fact that most of us don't have that experience makes us analogized from our experience to that. Right. Like, I don't remember most of my dreams. I know people that remember all their dreams, you know, but I don't remember most of my dreams. And even the ones that I do, I are a little hazy, you know, And I think that, you know, when someone says, oh, he had a dream, that that's what they think, that it must have been just like that, Right. A little hazy, like, well, I don't know, you know, what does that mean?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9409.11,"end":9410.03,"speaker":"Fr Stephen De Young","text":"Whatever, whatever."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9410.59,"end":9416.73,"speaker":"Fr Andrew Stephen Damick","text":"Little undigested, bit of beef, spot of mustard, Right? There's a Dickens reference for the night."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9417.84,"end":9483.18,"speaker":"Fr Stephen De Young","text":"We need to consider that if the mind is the news and not a churning away computer, then dreams also involve the news, not a churning computer. And so this is why, for example, in the compline prayers, we pray, which are the prayers before going to sleep. We pray that during the night God would dispel all the dark fantasies of Satan. Just like thoughts can come from places, dreams and things in dreams can come from places. Right. And enter in and are perceived by us. Right. In dreams. So I don't think anyone would say, even though, Right. The scientific materialism kicks in and we want to say dreams are fake. I don't think if someone came to us and said they had a horribly disturbing, like sexually violent dream, we would say like, oh, it's just a dream. It doesn't mean anything. Don't worry about it. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9483.42,"end":9483.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9484.54,"end":9511.47,"speaker":"Fr Stephen De Young","text":"We would take that seriously. Right. We would say, okay, something's going on here. Right. Because we Know, deep down, dreams aren't actually fake. Right. There is something going on there. Right. Not all dreams are prophetic visions, but dreams are the activity of the noose while you're asleep. Right. Whereas what we call thoughts are the activity of the news while we're awake."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9511.63,"end":9512.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9513.07,"end":9520.35,"speaker":"Fr Stephen De Young","text":"It's just while we're awake, they're joined by the five senses in a way that they're not usually when we're asleep."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9520.35,"end":9545.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting, you know, the question that we usually ask of this, of these experiences is, was that real? Right. Whereas. Which I understand, like, why we feel like we need to go there. But the question that's asked within Christian tradition, within Scripture, is not, was that real? But rather, where did it come from? And perhaps even more importantly, what are you going to do with it?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9546.44,"end":9546.8,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9546.8,"end":9549,"speaker":"Fr Andrew Stephen Damick","text":"Are you going to. Yeah. Are you going to repent?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9549.24,"end":9549.72,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9550.09,"end":9552.25,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9552.25,"end":9552.73,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9552.97,"end":9554.57,"speaker":"Fr Andrew Stephen Damick","text":"Yep. So."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9554.65,"end":9567.21,"speaker":"Fr Stephen De Young","text":"Yeah. So. So now, all that said, right? So prophecy is firmly at the center of the New Testament as a phenomenon. So then people are gonna ask, well, where is it in the church today, then?"}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9567.21,"end":9567.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9568.33,"end":9603.5,"speaker":"Fr Stephen De Young","text":"Right. And what we're gonna say is that primarily, not entirely, because just like in the Old Testament, right. King David was a prophet. Right. Part of the whole prophet thing and the direct encounter with God thing is that God can choose to reveal himself to whomever he wants. Right. So. So, but generally, this is a function of the monastic tradition in the church."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9604.18,"end":9645.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you look at the way that they live, they live these separate lives, and, you know, the ones that are kind of the most associated with all of these behaviors tend to live pretty separately. You know, they're even separate from. From them. Right. Like, if you go to Mount Athos, for instance, most of the monks are living in the monasteries, but there are these guys who live out by themselves in caves, and there's even this tradition of the naked ascetics who suddenly appear when they're needed and then disappear when they're not. You know, like, there's all kinds of weird stuff that's Right. Along these same patterns that we've been talking about throughout this whole episode."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9645.47,"end":9664.44,"speaker":"Fr Stephen De Young","text":"Right. And so monastic communities are this sort of direct continuation of the prophetic communities, the old covenant. Right. And what is it, right. That that is given as this great gift to the people who, we would say have the gift of prophecy in this sense is the vision of Christ in his uncreated glory."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9664.76,"end":9665.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9665.56,"end":9669.64,"speaker":"Fr Stephen De Young","text":"Right. And that is not a different experience than the one that St. Paul had."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9670.12,"end":9673.24,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's literally the experience he had it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9673.24,"end":9675.32,"speaker":"Fr Stephen De Young","text":"Literally is the exact experience he had."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9675.56,"end":9675.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9676.92,"end":9744.12,"speaker":"Fr Stephen De Young","text":"And so. And we see how that functions. Right. That. That throughout the history of the Church, the. The monastics have stood, especially the. The masses have the gift of prophecy, have sort of stood outside of, you know, the established right. The emperor. Right. The patriarch. Right. Those hierarchies, they stand outside of it at various points in the history of the Church, have come and challenged the emperor, have come and challenged a bishop or two about their behavior or about what they're teaching or about how they're exercising their office. Right. And so in the same way that the prophet functioned over against the priest and king, we see that happening in the history of the church. And the saint who sort of articulated this, like, put it into so many words is really Saint Simeon, the New Theologian, Right. Who literally talks about this kind of charismatic. Charismatic is gift. Right, Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9744.12,"end":9744.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9745.72,"end":9772.56,"speaker":"Fr Stephen De Young","text":"This guy has a lot of charisma. So, you know, people follow him. Right. No, this is the gift. Right. They got the prophetic gift. He talks about the vision of Christ and the uncreated glory. Right. He talks about this experience, and he talks about how those whom God is gifted with that kind of direct authority through this prophetic gift, then have the ability to speak against the established authorities when they become corrupt."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9772.8,"end":9773.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9773.92,"end":9795.62,"speaker":"Fr Stephen De Young","text":"Or when they become. And it's important that that does not. Well, we'll get to that in a second. So we also have even sort of extreme examples within monasticism, right. Of people who have this experience of God and have sort of a more extreme reaction in how they then stand outside of society."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9795.62,"end":9811.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's the holy fools. They're kind of, again, touched. Right. They behave in these sort of insane ways, but it's insanity that leads to repentance for people, and it's not destructive."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9811.7,"end":9813.22,"speaker":"Fr Stephen De Young","text":"To them or anyone else."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9813.71,"end":9832.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's a weirdness that's even weirder than the sort of inherent weirdness of monasticism, you know, and what's interesting. It's interesting to me that the, like, particularly the Russian tradition, really has a lot of these holy fools. And I think that they seem to kind of multiply as the empire gets bigger and more powerful."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9833.07,"end":9834.75,"speaker":"Fr Stephen De Young","text":"Right. Because that's exactly it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9834.75,"end":9840.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. You need more of that kind of thing as worldly power accumulates."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9841.48,"end":9886.88,"speaker":"Fr Stephen De Young","text":"Right. And when you have St. Cyril naked, confronting Ivan the Terrible, that's not really very different than Ezekiel going around naked. Yeah, right. And calling for the repentance of the people. Right. In fact, it's the same. But so there are these sort of Extreme things or pillar saints. Right. Saint Simeon's dies. Who go and live on a pillar. Right. They've had this experience of that now, sort of sets them apart. But we always see the other part too. Right. St. Seraphim of Saurav goes out into the wilderness by himself, has this experience of the vision of Christ in uncreated glory. And ultimately he ends up opening up his cell so that people can come and receive the wisdom that he's received from God."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9887.12,"end":9887.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9888,"end":9892.08,"speaker":"Fr Stephen De Young","text":"So that he could pass it on. It's not just, oh, God makes some people weirdos."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9892.37,"end":9892.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9892.57,"end":9892.85,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9893.81,"end":9901.97,"speaker":"Fr Andrew Stephen Damick","text":"He has this relationship to the people of God, and that's his purpose is to be this kind of anchoring tension."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9903.01,"end":9905.09,"speaker":"Fr Stephen De Young","text":"Right. And to be a prophet."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9905.41,"end":9905.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9906.21,"end":9908.69,"speaker":"Fr Stephen De Young","text":"And speak to them the message that God has for them."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":9908.77,"end":10022.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that one of the things that is really important to point out about all this is that as you look at the history of prophecy in the people of God, while they call these structures of power especially to account, they don't subvert them. It's about calling people to repentance, not about destroying the community or even destroying authority. Right. And I mean, the thing is that you can sometimes see, I think, that there's this certain millenarianism that's crept into to all of Western Christianity, including Orthodox Christians that live in the west. And maybe it exists elsewhere too. But this is the culture that I'm living in that, you know, I'm an American, so I participate in American culture. Americans have a streak within our culture of let's tear it all down and start over. Like, we just kind of love that idea. You know, this is not healthy, people. It's actually not. And sometimes we can interpret this tradition of ascetical charisma and the prophetic gift of correction in those terms. You know, like, everyone disobey your priests and bishops. And, you know, just listen to this one Holy elder over here. Whereas, I mean, whatever he's saying, if he's functioning in the traditional role of prophet, then what he's doing is actually calling everybody a repentance and not saying, everyone leave your church communities. He's not destroying the community. He's actually trying to heal it. And I think that's a really important point. He's not trying to destroy the community. A true prophet doesn't do that. There are some revolutionaries out there who are okay with tearing everything down. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10023.05,"end":10032.69,"speaker":"Fr Stephen De Young","text":"So look at how the prophets function. For example, at the Davidic monarchy. Right. The Davidic monarchy produced the Messiah. That's the Whole concept of the davidic monarchy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10032.69,"end":10033.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10033.09,"end":10050.24,"speaker":"Fr Stephen De Young","text":"That's leading to the Messiah, it's leading to Christ. Okay, so the institution of the davidic monarchy was a holy thing that produced the Messiah. Right. But the men who held the kingship in Judah were most often very wicked people."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10050.4,"end":10054.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. There's very few that actually come off well in the Bible."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10055.36,"end":10081.88,"speaker":"Fr Stephen De Young","text":"God sends prophet after prophet to the kings of Judea and to the people, or kings of Judah and the people of Judah, to call them to repentance as a gift to them. Right. Because he loves them and because of the importance of the institution. Right, right. To call them to repentance, never to undermine the institution. There's never a call to, like man. People are too evil to have this much power. We need to get rid of monarchy."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10083.08,"end":10087.52,"speaker":"Fr Andrew Stephen Damick","text":"Or bishops or the priests, the high priest. Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10087.52,"end":10091.76,"speaker":"Fr Stephen De Young","text":"It was never, let's abolish the high priesthood. Let's forget this whole tabernacle temple thing."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10091.76,"end":10109.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, I mean, one of the reasons why that's important is because prophets aren't infallible either, as we saw with Balaam. Extremely fallible. Right. They're not infallible either. So you can't say, well, this is where all the authority is now, and ignore everything else."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10110.73,"end":10132.34,"speaker":"Fr Stephen De Young","text":"Right. So the prophetic institution, if we want to call it that, is there as part of God's provision to make the institutions of priest and king function properly. Yeah, they need it to function properly. It's actually a support for it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10132.5,"end":10132.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10132.82,"end":10145.7,"speaker":"Fr Stephen De Young","text":"If it weren't there, they'd collapse into tyranny and into false religion. And. Right. If God hadn't sent prophets to Israel, all you would have had was the golden calves of Jeroboam son of Nebat, and a bunch of wicked kings."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10146.1,"end":10148.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10148.5,"end":10180.69,"speaker":"Fr Stephen De Young","text":"Right. So the promise. So in the same way, right, it's a gift. And, you know, if you really want an example of that. I know we're a few weeks past it now, but you can still go back and read the life of St. Mary of Egypt and look at the way that St. Mary, who's a prophetic figure if ever there was one, right. Living in the desert, naked for years, no food. Look at the way she reacts with Elder Zosuis, who's a. A priest."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10181.01,"end":10197.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and at the end, one of the last things that she says to him is, now, look, I need you to go back to the monastery because there's. There's some problems and I need you to put them in order. And here's what the problems are. Yeah, yeah. So, I mean, she, she functions in this, in this corrective way."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10197.69,"end":10204.26,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, but, but, and she completely defers, though, to the office, the institution of the priesthood."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10204.57,"end":10206.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right, right."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10206.41,"end":10222.77,"speaker":"Fr Stephen De Young","text":"Defers to it, does not speak a negative word against it. Right, right. Against that institution. So it's not about, you shouldn't be in that monastery, you should be out here with me. Right, yeah, it's. But she's functioning how. She's trying to restore health to that monastery."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10222.77,"end":10223.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10223.53,"end":10226.65,"speaker":"Fr Stephen De Young","text":"Right. That's part of that, that prophetic role."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10226.81,"end":10550.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, well, in thinking of some of our, our final thoughts about prophets and prophecy in the scriptures and elsewhere, you know, I, you know, you just talked about this question of how does the prophet function in relation to the rest of the community. And the way that, in my mind, that works out is he's not a revolutionary, he's a renewer. Right. That's his, that's his role, is he wants to renew the community, he wants to renew the church, he wants to renew society. That's, that's his job. And he does that by standing outside of it and by having these encounters with Christ. Suffice it to say, this is not the life for everybody, and it's not even a life for most of monasticism, even though monasticism as a whole institution functions in this prophetic way. Right. But there are certain individuals that really do have this gift. And I think one of the ways that you can recognize that the prophet is a renewer and not a revolutionary, is that what he or she. Because there's some females too. We just mentioned Saint Mary of Egypt. What he or she has to say is actually not anything new with regards to the revelation from God. It's really about calling people back, helping them to remember and to obey again the Lord. Right? And that's the task. And I think that the way that my modern people tend to think about prophecy and the prophetic role is really not that it might be there, Right. I'm not saying that everybody doesn't think of that or whatever, but often what we want is a kind of special revelation, right? I need to have a special secret word, right? It becomes this kind of, we're back to divination, right? We're back to the pagan style of prophecy. I need some esoteric knowledge that I can't get into, get in some other way. Whether it's, you know, the Bible code kind of stuff or, you know, what is God's will for my life in particular, should I do this or that? Should I turn left or right. But I think that the cure for a lot of that kind of thinking is found in the parable that Christ tells of the rich man and Lazarus, right, where they both die. Lazarus is in Abraham's bosom with Abraham, and the rich man is in torment. And the rich man says, you know, Abraham, send Lazarus back from the dead to go help my brothers. And Abraham says to him, look, they have Moses and the prophets, you know, let them hear them. And, you know, the rich man says, no, no, if someone came back from the dead, then they'd believe. And Abraham says, if they're not going to believe Moses and the prophets, they wouldn't believe even if someone did come back from the dead. Which, of course, this is speaking about Christ's resurrection on certain level. But also when Abraham makes this appeal to Moses and the prophets, that's to say, in this particular context, look, they don't need some special revelation. They just need to become obedient to the revelation that we've all been given, right? There's again, you know, much of the Scripture is considered to be prophetic books within the scope of the Scripture, meaning that it is given by God as a story told by God about who we are, where we are now, where we've been, where we are now, where we're going, and most especially what we need to be obedient to. And I think that that's this notion of Moses and the prophets. We've been given that. We've been given the Scriptures, we've been given the tradition of the Church. If I want something other than that, I think that's. I have a big problem, right? I have a humility problem. I don't know, there's all kinds of ways that that's a problem. And one of my favorite writers, because he's so witty as GK Chesterton, who I don't know, I've never checked, now that I think about it, as to whether he said this or not, for sure. But a saying attributed to GK Chesterton, maybe he did say it was. Christianity has not been tried and found wanting. It has been found difficult and not tried. And I believe that one of the difficulties that we have as modern Christians is that in many cases we haven't really tried it or we've tried bits. If I'm speaking of myself, I've tried some of Christianity, but there's still a lot that I have not been obedient to. I don't know. It doesn't make sense to want special revelation if I haven't actually acted on the revelation that I have. So when we think about prophecy, that I think is our starting point and that all of these prophets that we already have, that we should receive them in the way that God sent them to call us to repentance, to bring us back to faithfulness and obedience to the Lord. And that's a compelling call. That is a compelling call. So. All right, Father Stephen."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10554.58,"end":10964.91,"speaker":"Fr Stephen De Young","text":"So it's really easy for us to sound like there's a couple of Orthodox priests here, sound like we're picking on our charismatic friends when we talk about folks who claim to be prophets and then, you know, say whatever, whatever political statement, whatever, you know, thing they hope happens, that this is a prophecy from God and to point to them as false prophets and maybe even seem like we're laughing at them. But I think, and I'm sure this is not exclusive. In fact, I know this isn't exclusive to Orthodoxy, but since we're Orthodox priests, we should probably talk about our orthodox brethren first and foremost. We've got a lot of false prophets of our own. And it's false prophets in a little bit of a different sense in that we've been very much acculturated in the United States to kind of want to see ourselves and to take on the role that prophets play over against institutions in the establishment without necessarily being called to take it. So you watch Star wars, the rebels are the good guys. We don't make TV shows and movies about an honest cop who follows all the rules, right? We make TV shows and movies about the tough cop who plays by his own set of rules. We don't want to be like a lieutenant in the gossip Gotham City Police Department. We want to be Batman working outside the system to bring justice. Right? That's sort of our whole ethos, right. I'm the one who's going to stand up and point out to all these bishops why they're wrong and they're all sellouts. I'm the one who's going to fix the church and straighten everything out. Right. I'm the new Saint Maximus the Confessor, right? Because he was a lay person and I'm a layperson. Yeah. We're going to do this right? Or, you know, pick your priest who had to oppose his bishop. I am that first. And what we're doing when we do that, and I've even been guilty of that in the past, I hope only the remote past, but maybe there's elements of myself I don't see and I'm still guilty of it. Is we're being like those prophets in Jeremiah who God didn't send. But we come running because we're eager to get at it. We're eager to sort of be Saint Maximus the Confessor in the sense that we're going to speak our truth to power. We're not so much eager to be Saint Maximus the Confessor in getting our tongue cut out and our hand cut off and actually suffering that not so much. But we want to be the ones who are going to straighten everybody else out and speak this truth to these powerful people who were totally certain are totally corrupt, unlike us. And that's not what St. Paul means when he says we should seek the gift of prophecy. That's the opposite, right? This is what that whole parable Christ tells us about the splinter in the eye and the log and the eye is about the way that one seeks the gift of prophecy is you seek the first part. You seek the experience of God. You don't try to form your own mission. You don't try to piece together your own message, which you're going to claim is from God, but you seek that first part, encounter with God, the experience of God. And we know, or at least we should know, if we're listening to the Scriptures and listening to the church, how you do that, you do that by repenting. You do that by purifying yourself. You do that by being faithful. You do that by loving others, not emotionally or mentally, but concretely showing love to others through acts of kindness and assistance and help and self sacrifice. And if we pursue that, and if we do that, then it may be at the time of God's choosing, in the way of God's choosing, to the extent of God's choosing, He may reveal himself to us. And when he reveals himself to us in whatever way, to whatever extent, he may then have some task for us that we need to do. And it may be that included in that task might be correcting someone. But to jump to that is putting the cart before the horse. It's saying that Christ said something that he didn't say. It's saying that he did. He sent us. When he didn't send us, we just came running. It's putting the cart before the horse. And so we should, as St Paul says, pursue the gift of prophecy. We should seek to come to know Christ ever more deeply, to experience him directly. We have the opportunity more than once a week in a lot of cases, but at least once a week, most of us have the opportunity to receive Christ himself into our bodies and then be sent out. We have these opportunities. We know what we need to do right? But doing it requires this long, hard work. And doing it may require a lot of suffering, may require persecution, may even require martyrdom. We may end up becoming like Saint Maximus in all the ways that we don't want to become like him in our flesh rather than in the ways we think. We want to become like him because of our pride and our vanity. But. But that's. That's what the pursuit of the gift of. Of prophecy looks like. It's never something we can demand from God. It's never something that there's a technique that will guarantee it, but it is. It is a possibility that is out there. If we're diligent about living the Christian life, and if we do that, if we purify ourselves, if we repent, if we're loving, if we're. We may never receive the gift of prophecy. We may never receive the vision of Christ in uncreated glory. That may not be what God has for us. We may never be sent to correct everyone and save the church, but we just might find salvation for ourselves, for our own souls, for our own lives. And that is what we're really after in the end, not the other."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10967.72,"end":10988.28,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Thank you very much for listening, everyone. If you didn't get to listen to us live, we'd still love to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10988.28,"end":10994.37,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":10994.53,"end":11006.13,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it, or even someone who's kind of okay into it."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":11007.17,"end":11017.37,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. And while you're there, order Father Jeremy's book on sacrament."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":11017.37,"end":11023.9,"speaker":"Fr Andrew Stephen Damick","text":"Hey, good idea. Thank you very much. Good night, everyone. God bless you. Christ is risen. He truly is risen."}
{"episode_id":"LOS - #044 - 2022-05-26 - Prophet Motive","start":11038.22,"end":11075.44,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stevenson, Stephen Damick, and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels. Round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
