{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":0.48,"end":65.11,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of prison, of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":66.47,"end":93.39,"speaker":"Fr Andrew Stephen Damick","text":"Christ is risen. He truly is risen. Good evening giant killers, dragon slayers, Chupacabra, sucker punchers. You are listening to the Lord of Spirits podcast. My co host, Father Stephen DeYoung, the chief of all chieftains, is with me straight from the swamp in Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, perched precariously atop the arcane tower of podcasting, hovering dozens, dozens, I tell you, of stories above a disused gateway to the underworld."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":93.39,"end":98.15,"speaker":"Fr Stephen De Young","text":"And we are making like a Roman Reigns reference with me there or what was that?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":98.47,"end":99.83,"speaker":"Fr Andrew Stephen Damick","text":"I'm just gonna let stuff go over."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":99.83,"end":112.87,"speaker":"Fr Stephen De Young","text":"Your head because I'm not like Samoan. So like, I don't want to be accused of cultural appropriation. Insane is all. I have not constructed my own ula fala or anything."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":114.4,"end":119.44,"speaker":"Fr Andrew Stephen Damick","text":"I mean I, I do think that a good cargo cult is in your future for sure."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":120.96,"end":121.36,"speaker":"Fr Stephen De Young","text":"Fair."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":122.8,"end":168.29,"speaker":"Fr Andrew Stephen Damick","text":"We are live here in bright week and if you're listening to us live, you can call us at 855-237-2346 and you can talk to us. We're going to get to your calls beginning in the second half. Meanwhile, Mike Spray Tan Degan will be taking those calls. Tonight we begin a three episode series on the history of Israel. Many people read the Bible or have some sense of its contents, often without a sense of the overall narrative frameworks within which the scripture operates. So one of those frameworks is the story of Israel. So with this episode we're going to set up a number of themes that will gradually pay off in subsequent episodes. Before we begin with all that though, I have to, I just have to ask Father, you know, because I know that all the kids are wondering this. How is your new career as a Twitch streamer going?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":169.1,"end":173.98,"speaker":"Fr Stephen De Young","text":"Well, all the cool kids are watching the Twitch streams, so they already know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":175.42,"end":177.5,"speaker":"Fr Andrew Stephen Damick","text":"You don't care about what anyone else thinks."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":177.66,"end":191.1,"speaker":"Fr Stephen De Young","text":"But, yeah, the channel got big enough that they monetized it, so now I'm set to rake in tens of dollars a year, potentially. But that's okay. I'm not in it for the money. I'm in it for the art."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":192.46,"end":197.47,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Nice. Well, if I knew what Twitch was, I would. I might tune in."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":199.23,"end":202.43,"speaker":"Fr Stephen De Young","text":"Yeah, Like Twitch and Rive."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":204.43,"end":205.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't even know what that is."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":206.19,"end":208.59,"speaker":"Fr Stephen De Young","text":"I really don't know. Bakshi pop hit."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":209.07,"end":217.87,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, wow, man. I mean, my Ralph Bakshi knowledge really extends to just one film, as you might imagine, and it is not the one you were about to say."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":221.8,"end":224.28,"speaker":"Fr Stephen De Young","text":"So let's move on to the old Mickey Mouse cartoon."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":224.28,"end":225.88,"speaker":"Fr Andrew Stephen Damick","text":"That's right. No doubt. Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":226.36,"end":233.88,"speaker":"Fr Stephen De Young","text":"That he did. Which also featured the Rampaging Sloth, the greatest funny animal superhero of all time."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":233.96,"end":252.79,"speaker":"Fr Andrew Stephen Damick","text":"You know, you can buy. I think they sell them. I can't remember, like, on some auction site or something. You can actually buy cells from the Bakshi Lord of the Rings film and, like, be know, get them framed or whatever. You can have your very own, you know, actual unique cell from the making of that movie."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":253.27,"end":256.23,"speaker":"Fr Stephen De Young","text":"Can you get one of the rampaging Sloth from Mighty Mouse, though?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":256.39,"end":261.91,"speaker":"Fr Andrew Stephen Damick","text":"I have not looked into that, but I can put someone right on it for you, if that's what you need."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":262.31,"end":264.63,"speaker":"Fr Stephen De Young","text":"Or as they say in Britain, the rampaging Sloth."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":265.11,"end":269.75,"speaker":"Fr Andrew Stephen Damick","text":"Sloth, yes. Orangutans. Breakfast cereals."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":270.47,"end":274.02,"speaker":"Fr Stephen De Young","text":"So not big fans of short vowels over there."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":277.7,"end":286.34,"speaker":"Fr Andrew Stephen Damick","text":"I do love a great vowel shift. Right, so where are we going to start with Israel? We're not starting with Genesis this time."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":286.5,"end":292.26,"speaker":"Fr Stephen De Young","text":"10,000 BC that was a killer segue. So where are we going to start? With Israel?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":294.02,"end":295.06,"speaker":"Fr Andrew Stephen Damick","text":"Don't even. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":295.06,"end":298.66,"speaker":"Fr Stephen De Young","text":"Like, come on, man. This is why they pay you the big bucks, is to do transitions like this."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":301.66,"end":305.82,"speaker":"Fr Andrew Stephen Damick","text":"You know, they're gonna start docking my pay. If I can think of some way to. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":306.7,"end":309.82,"speaker":"Fr Stephen De Young","text":"Yes. We are starting in Mesopotamia."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":311.82,"end":312.86,"speaker":"Fr Andrew Stephen Damick","text":"Right in the middle of things."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":313.1,"end":321.18,"speaker":"Fr Stephen De Young","text":"From the Greek mesos, meaning the middle or between, and potomos, meaning river."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":321.74,"end":325.63,"speaker":"Fr Andrew Stephen Damick","text":"That's right. The Tigris and the Euphrates. Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":326.03,"end":327.71,"speaker":"Fr Stephen De Young","text":"And with our old friend Abraham."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":329.55,"end":331.23,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Who."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":333.63,"end":368.8,"speaker":"Fr Stephen De Young","text":"We did a whole episode about at one point, and we've talked about many times. A lot of the topics. We'll set this out right now. A lot of the topics we're going to discuss tonight are we're going to be talking about things that we've talked about before, but we're going to be coming at these things from a little different angle with a little different trajectory and a little different through line. So we're not going to do a ton of review of that stuff. Some of you may be happy about that because you've listened to it all before because you're not caught up."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":368.8,"end":372.08,"speaker":"Fr Andrew Stephen Damick","text":"I say there's the freaks out there that listen to every episode two or three times."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":372.32,"end":372.8,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":373.92,"end":377.45,"speaker":"Fr Andrew Stephen Damick","text":"Those of you who's just a podcast, get a life, will ya?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":377.45,"end":384.61,"speaker":"Fr Stephen De Young","text":"Where we just refer you to the Abraham episode. Right. Those of you who haven't listened to it may have different feelings about that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":384.61,"end":386.97,"speaker":"Fr Andrew Stephen Damick","text":"But it is titled From Ur of the Chaldees."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":387.45,"end":392.41,"speaker":"Fr Stephen De Young","text":"Yes. So you can learn all about Abraham, all about the Royal Game of Ur."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":394.01,"end":398.65,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, I still need to get one of that episode. You can buy them on Amazon. Did you know that?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":398.73,"end":404.24,"speaker":"Fr Stephen De Young","text":"Oh, someone made one for our church. It's in our parish hall. The kids like to play it all the time and have tournaments."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":404.64,"end":407.2,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Of course they do."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":410.56,"end":519.83,"speaker":"Fr Stephen De Young","text":"So, yes, that is a thing at my parish, the Royal Game of Ur. So, but we're starting particularly with Abraham in terms of the promises that God made to Abraham. Because what we're going to be talking about for the next three or so episodes is we're going to be talking about this, the arc of the history of Israel through the scriptures, including the New Testament, and what Israel is, what it's about, what it's for, who's in it, who's not in it. Right. And all of those things. And so Israel really begins with the person of Abraham and with the promises that God makes to him somewhat out of the blue for the first time in Genesis chapter 12, as we've commented before on the show, in Genesis 11, we have the story of the Tower of Babel and then there's no sort of genealogy or time skip or any of that kind of thing. We just immediately get thrown into the story of this guy Abraham and God appearing to him, saying, move to the other side of the inhabited world and I'm going to do these things, give you these promises. And then really. And this is going to be part of what we're arguing in these episodes or showing, demonstrating is that the promises made to Abraham and how they are fulfilled is the theme of the whole Bible. That's what the whole Bible is about."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":520.63,"end":521.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":522.71,"end":540.64,"speaker":"Fr Stephen De Young","text":"Now there are some of you out there who are clever, who are going to say, well, wait I thought the whole Bible was about Jesus. Hit pause. Maybe Jesus is the way those promises are fulfilled. Spoilers. But anyway."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":542.96,"end":548.32,"speaker":"Fr Andrew Stephen Damick","text":"I'm pretty sure the statute of limitations is up on anything that's thousands of years old."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":548.64,"end":554.96,"speaker":"Fr Stephen De Young","text":"You never know. I've had people get mad at me and claim it's spoilers. When I told them a movie was good."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":557.12,"end":558.32,"speaker":"Fr Andrew Stephen Damick","text":"I didn't want to know that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":558.56,"end":604.37,"speaker":"Fr Stephen De Young","text":"Yes, they wanted to go into it thinking this could be horrible. And the fact that I told them it was actually good spoiled something for them. Apparently it's a part of the experience. But also, to be fair, the statement, the promises to Abraham and how they are fulfilled is a statement that's true for both Jews and Christians. Jews can say the same thing about their Bible. They would mean something different by it. I'm not saying we agree on this point. Yeah, of course they would agree to the statement while meaning something a little different. And there are people who identify at least as Christians who would not agree to that statement. I'm looking at you dispensationalists. You're not going to have a good time the next six weeks. I'm warning you in advance."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":607.17,"end":609.49,"speaker":"Fr Andrew Stephen Damick","text":"Scofield is currently whirling in his grave."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":609.89,"end":616.93,"speaker":"Fr Stephen De Young","text":"Yes, I think they staked him in, didn't they? Should have."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":616.93,"end":624.89,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, I put one of those. What do you call them, those cages that they put over graves in some cemeteries. We have them here in Pennsylvania."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":625.13,"end":627.05,"speaker":"Fr Stephen De Young","text":"Yeah, just an iron rod."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":627.05,"end":627.45,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":627.45,"end":688.03,"speaker":"Fr Stephen De Young","text":"You know, you can cold iron. Anyway, so. So what were those promises? What were those promises? Because this is something that has to be disambiguated because a lot of times these things get smushed together. They aren't clear. And if you're not clear about this, you can run into some trouble. So the promise to Abraham begins with he's going to have descendants. At the time, he had none at the time these promises are made. No sons, no daughters, no descendants. So he's going to have descendants. In fact, he's going to have numerous descendants, uncountable descendants, like the sands of the sea. Right? So that's part one. He's going to have descendants. Part two, Right. He's going to. His descendants are going to receive as an inheritance a particular piece of land in the Levant."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":688.99,"end":693.23,"speaker":"Fr Andrew Stephen Damick","text":"Now, see, this is the part where the dispensationalists are getting very excited, though."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":693.31,"end":699.03,"speaker":"Fr Stephen De Young","text":"Yes, we're going to let them down mightily. More so next episode than this one, but a little bit in this episode, too."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":699.03,"end":704.76,"speaker":"Fr Andrew Stephen Damick","text":"It'll be an even greater disappointment than the Millerites experienced in 1844."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":705.64,"end":709.2,"speaker":"Fr Stephen De Young","text":"I don't know about that. It'll be up there. It'll be up there."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":709.2,"end":711.88,"speaker":"Fr Andrew Stephen Damick","text":"A lot of that happened right here in Pennsylvania, as you well know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":712.12,"end":719.8,"speaker":"Fr Stephen De Young","text":"Yeah. So I don't know how much hope and trust those people have put in me before this time. So maybe not as disappointing."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":719.8,"end":721.88,"speaker":"Fr Andrew Stephen Damick","text":"Have a little more confidence in yourself, father."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":725,"end":756.29,"speaker":"Fr Stephen De Young","text":"So this piece of land, broadly described, right. This piece of land that reaches almost back to his home in Mesopotamia and is this huge chunk right. Of land. And as we disambiguated in that episode and for more on this, you can go to that episode that his descendants, his sons would become like the stars of heaven. And that idea was joined with the idea of camping in their enemies gates."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":756.93,"end":760.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which means, you know, you've taken the city once you've got the gates."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":760.85,"end":822.29,"speaker":"Fr Stephen De Young","text":"Right. You've taken the position. Right. Of the enemy. And so we talked about more and we fleshed this all out of that episode about how this is talking about what we now call theosis, right. That this is talking about his, his descendants through their faithfulness and their righteousness being, becoming like the stars of heaven, that is like the angels and replacing the fallen demonic powers. So see that episode for more on that. But that is sort of the ultimate promise, right? Yes. Having descendants is nice, right. Those descendants having land to live on and farm is nice, but eternal life is kind of better. Right. Than those two things."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":824.29,"end":824.69,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":826.69,"end":848.2,"speaker":"Fr Stephen De Young","text":"That'S sort of the order of these prophecies. And as with many prophecies in the Bible, this order of prophecies actually becomes a sequence of signs. So. So we've talked about this before, but just to review it quickly. Very often in scripture a prophecy is given and then it is given with a sign."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":848.84,"end":855.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's some kind of like immediate thing that happens, but it's also pointing to something that's going to happen later."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":856.04,"end":864.56,"speaker":"Fr Stephen De Young","text":"Right. And because you see the immediate thing happen, you know, and you could be confident that the bigger thing is going to happen."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":864.56,"end":868.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like, it's like a down payment, basically deposit."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":868.81,"end":873.21,"speaker":"Fr Stephen De Young","text":"So one of the easiest ones of these, right. Is in Luke chapter two."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":875.29,"end":875.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":875.69,"end":1031.76,"speaker":"Fr Stephen De Young","text":"Where the angels, angel appears, the stars sing, right. When Christ is born to the shepherds and the angel tells the shepherds, right. They tell them the Messiah has been born. And the angel then tells the shepherds. This will be assigned to you. Go over here to Bethlehem, go to this cave. You'll find a baby, a newborn baby laying in a food trough. That's not something you see Every day, right? So the idea being the shepherds could go there right then, which they did see the baby there, and they'd be like, oh, okay, well, clearly what the angel said was true. This is the Messiah, because we found this just as they said. The other related, very famous one is In Isaiah, chapter 7 with the verse that gets quoted out of context all the time. St. Matthew did not quote it out of context. But anyway, that's a longer discussion that we've already had on the show, but where the Syro Ephraimite war is going on, which is poorly named because the Syrians and the Ephraimites were on the same side, and we're attacking Judah, but the Syrio Ephraimite war is going on. King of Judah is worried, right? Isaiah comes and prophesies that the God of Israel is going to deliver Judah and Jerusalem from the hands of the Syrians and the northern kingdom of Israel, the Ephraimites, and then says that this will be a sign, this young woman will bear a child. And before the child is old enough to know the difference between good and evil, meaning while he's still a little baby, you will be delivered. So he gives this sign. And so when that baby's born and as that baby starts to grow up, everybody can say, ah, yes. And then they can be certain that the deliverance of God is coming. They can be confident. So when I say that these sort of layers of promise become a sequence of signs, this is what we're talking about. So the most immediate thing, the thing that happens in Abraham's lifetime, because him having a vast multitude of descendants doesn't happen in his lifetime. They're countable at the time of his death."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1032.16,"end":1032.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1032.64,"end":1113.11,"speaker":"Fr Stephen De Young","text":"On one hand, the him, you know, them taking possession of the land does not happen in his lifetime. It happened centuries later, right? So during his earthly life, none of his descendants become like the stars of heaven. But what does happen is he has Isaac. So Sarah's barren womb, despite being barren, despite being dead in the language of the Bible, produces this offspring, which is itself miraculous, right? And so this miraculous sign that Abraham receives during his lifetime from God is there is a sign to give Abraham the confidence to know. Well, the rest of this is surely going to happen, albeit a long, long time from now. But as I said, this is a sequence of signs. And as we said, the ultimate fulfillment of these promises is about his descendants becoming like the stars of heaven. This is what Hebrews is talking about. When Hebrews talks about Abraham looking for a heavenly promised land."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1113.99,"end":1114.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1114.71,"end":1115.07,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1115.07,"end":1129.67,"speaker":"Fr Stephen De Young","text":"That that's the ultimate fulfillment of these promises. So what does that make the land, like the physical land in the Levant that his descendants would later take possession of for a period of time? That makes it a sign."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1129.91,"end":1134.23,"speaker":"Fr Andrew Stephen Damick","text":"A sign as well. Not the goal, not the ultimate goal."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1135.16,"end":1154.12,"speaker":"Fr Stephen De Young","text":"And a sign to those who received it. God bringing them into the land and giving to them is a sign that this other, bigger promise is true. If they remain faithful, repent, do the things they need to do during their life."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1155.64,"end":1156.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1156.28,"end":1194.52,"speaker":"Fr Stephen De Young","text":"So there's this sequence of signs. We also have to. Another thing that we need to. So we're, like I said in this episode, we're going through some things that we've talked about before, but we're clarifying things. And especially this first episode of the series, we're setting the table for some things that are going to pay off later. So like Chekhov, we're loading a series of guns and setting them out in front of you. And then there'll be, I guess in this analogy, some kind of John Wick style battle in episode three."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1194.68,"end":1195.08,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1197.64,"end":1203.08,"speaker":"Fr Stephen De Young","text":"I can't promise it'll be that kind of listening experience. But maybe in some sense."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1205,"end":1205.4,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1207.88,"end":1296.6,"speaker":"Fr Stephen De Young","text":"Part of that promise, the promises to Abraham, we have to remember this is something we lose sight of. So we're really focusing here on things people maybe gloss over. So one of the things that people gloss over is the fact that the land, the promise of the land given to Abraham is there as a sign of something greater. It's not an end in itself. It's not an ultimate goal. Right. More on that next time in the second episode. Another thing, people sometimes miss this idea that Abraham is the father of many nations. Now, people who are aware of this usually interpret it. Christians, I should say, who are aware of this, usually misinterpret something St. Paul says and thereby jump to, oh, well, this is talking about how there will be people from all different nations who are Christians, who are like Abraham's sons by adoption. Right. They sort of leapfrog this. Okay, but let's pause before we start making these jumps. Okay. Because Abraham is the father of many nations in the Old Testament. He's the father of many nations in just the Hebrew scriptures, like immediately."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1297.48,"end":1306.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it's notable that it's nations, not the father of many people. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1306.36,"end":1307.88,"speaker":"Fr Stephen De Young","text":"Or peoples from many nations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1308.2,"end":1310.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's multiple people groups."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1311.16,"end":1336.91,"speaker":"Fr Stephen De Young","text":"So there's this idea again that we have that God is the God of Abraham, Isaac and Jacob. Jacob's other name is Israel. We refer to him all the time as the God of Israel, therefore, just sort of. There's this through line of Abraham to Israel. And yeah, we know about these other folks like Esau and Lot and Ishmael, but they kind of just fall out. They're sort of not important. They're just gentiles."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1337.15,"end":1337.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1339.63,"end":1349.15,"speaker":"Fr Stephen De Young","text":"But here's what I would point out. So we use the word gentiles all the time and we use it in this ethnic sense. Like there are people who are ethnically Jewish and that everybody else is ethnically a gentile."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1349.74,"end":1349.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1351.5,"end":1402.59,"speaker":"Fr Stephen De Young","text":"Excuse me, but there's no concept of ethnicity in the ancient world in that sense. Like of heredity. The Greeks in the 4th century BC discover heredity, the very idea of heredity. So that's not an idea that people have. So the nations. Right. Which is what gentiles means, the nations in the Old Testament in the Hebrew Scriptures refers to not just anybody who's not Jewish, because again, Jewish isn't even a term at this point. Anyone who's not an Israelite. The nations refers to the nations that are in the table of nations in Genesis 10."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1403.42,"end":1406.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And generally pagans."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1407.18,"end":1419.98,"speaker":"Fr Stephen De Young","text":"Right. The 70 nations. That's who it's referring to. We've commented on the show about the fact that. And it's important in various ways that Israel is not on the table of nations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1421.1,"end":1421.82,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1422.46,"end":1425.66,"speaker":"Fr Stephen De Young","text":"So when God is going to call a nation, he doesn't just pick one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1425.98,"end":1427.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't say, oh, this is the best one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1428.06,"end":1429.26,"speaker":"Fr Stephen De Young","text":"He creates a new one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1429.84,"end":1432.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. In the Exodus. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1432.72,"end":1437.2,"speaker":"Fr Stephen De Young","text":"This in and of itself is kind of a. Sorry, Calvinist, but it's low grade."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1441.12,"end":1441.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1442.16,"end":1476.43,"speaker":"Fr Stephen De Young","text":"So he. He creates one. And we're going to talk more about that creation in the second and third halves tonight. But what you may not have thought about is who else is not on the table of nations in Genesis 10, like Edom, Moab, Ammon, etc. These other nations that are nations in the Old Testament that are descended from Abraham either through Lot."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1478.27,"end":1478.67,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1479.39,"end":1484.61,"speaker":"Fr Stephen De Young","text":"Or through Isaac, in the case of Edom, through Ishmael."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1485.01,"end":1488.85,"speaker":"Fr Andrew Stephen Damick","text":"Edom is the. They're the descendants of Esau. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1489.97,"end":1496.61,"speaker":"Fr Stephen De Young","text":"So these others descended. These other nations descended from Abraham are also not part of the 70 nations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1498.21,"end":1511.89,"speaker":"Fr Andrew Stephen Damick","text":"I think probably a lot of people don't notice that because, like, number one, I mean, who has all 70 nations memorized? I mean, maybe you do, Father. I don't know. I used to know all the 50 states and their capitals, but I couldn't. I don't know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1511.89,"end":1512.33,"speaker":"Fr Stephen De Young","text":"I probably."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1512.33,"end":1513.01,"speaker":"Fr Andrew Stephen Damick","text":"I. I don't know if I can."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1513.01,"end":1517.53,"speaker":"Fr Stephen De Young","text":"Do that now, but you probably don't even know the Hivites from the Girgisites. I swear."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1521.21,"end":1531.69,"speaker":"Fr Andrew Stephen Damick","text":"There is that big list of the. That keeps showing up over and over again in the Old Testament of the various, the giant clans like it listed off, always in the same Jebusites."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1531.77,"end":1532.89,"speaker":"Fr Stephen De Young","text":"The Zamzumim."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1533.05,"end":1534.81,"speaker":"Fr Andrew Stephen Damick","text":"Zamzumim is my favorite one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1537.45,"end":1537.93,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1541.05,"end":1541.17,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1541.17,"end":1563.21,"speaker":"Fr Stephen De Young","text":"Yeah, so they're not on there either. So there are in the Old Testament these groups of non Israelite Abrahamites who aren't Israelites, but aren't really Gentiles either."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1563.78,"end":1579.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because to be, I mean, to be an Israelite, even just aside from the, you know, it's about culture and language and religion. Right, but like Israelites are descendants of not just of Abraham, but of Jacob in particular. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1579.46,"end":1587.06,"speaker":"Fr Stephen De Young","text":"And they're not. Right. And you know, Edomites aren't Moabites and Moabites aren't Edomites. Right. So saying they're not Israelites is not, you know, profound."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1587.06,"end":1588.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1588.9,"end":1611.58,"speaker":"Fr Stephen De Young","text":"But, but a lot of folks I think have been ingrained with there's Israelites and there's Gentiles. That's not the case. And that's not the case in the New Testament either, by the way. We'll talk about this more in a later episode of this series. But think about the Idumeans who are descendants of the Edomites that Herod came from."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1613.02,"end":1616.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Herod could claim to be a descendant of Abraham. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1616.82,"end":1623.18,"speaker":"Fr Stephen De Young","text":"Not a gentile, but not Jewish. Right. Or the Samaritans."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1626.38,"end":1626.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1626.86,"end":1639.58,"speaker":"Fr Stephen De Young","text":"Right. So there are non gentile, non Jews in the New Testament still. So this is, this other category is a persistent other category."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1642.79,"end":1643.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1645.43,"end":1661.11,"speaker":"Fr Stephen De Young","text":"That we have to reckon with in the Scriptures. And although, as we said, they're not Israelites and they're distinguished from Israel, we're going to talk about special things dealing with Israel."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1662.95,"end":1663.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1663.59,"end":1681.8,"speaker":"Fr Stephen De Young","text":"They aren't Gentiles. And when they're talked about, when those other groups are talked about, especially in the Torah, they're talked about in ways that are parallel to the way that the Torah talks about Israel. And probably the best example of that is in Deuteronomy, chapter two."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1683.48,"end":1764.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So here you get. We're going to start with verse 18 and go through 25. Today you are to cross the border of Moab at Ar. That's Ar. And when you approach the territory of the people of Ammon, do not harass them or contend with them, for I will not give you any of the land of the people of Ammon. As a possession, because I have given it to the sons of Lot for a possession. It is also counted as a land of Rephaim. Rephaim formerly lived there. But the Ammonites call them Zamzumim, a people great and many and tall as the Anakim. But the Lord destroyed them before the Ammonites, and they dispossessed them and settled in their place, as he did for the people of Esau who live in Seir when he destroyed the Horites before them. And they dispossessed them and settled in their place even to this day. As for the Avim who lived in villages as far as Gaza, the Kaftarim who came from Caphtor, destroyed them and settled in their place. Rise up, set out on your journey and go over the valley of the Arnon. Behold, I have given into your hand Sion, the Amorite king of Heshbon and his land. Begin to take possession and contend with him in battle. This day I will begin to put the dread and fear of you on the peoples who are under the whole heaven, who shall hear the report of you and shall tremble and be in anguish because of you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1767.98,"end":1782.6,"speaker":"Fr Stephen De Young","text":"The reason we included that last bit is noticed. All the peoples under heaven will tremble and be in anguish because of you. That's referring to the gentiles, right? The 70 nations. Ammon doesn't have to be afraid of them. They're not going to mess with Ammon."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1783.24,"end":1809.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this passage and Moab. Yeah. If you don't know who these groups of people are, it may not be apparent why God tells them, don't battle against them. And also why God tells them, oh, by the way, there were these other groups in the land before those other people. And I drove them out so that these groups could be in there. But, I mean, these are all Abrahamite groups that are taking the land."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1809.98,"end":1813.18,"speaker":"Fr Stephen De Young","text":"And we see this pattern. They drove out these giant clans."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1813.74,"end":1817.38,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Anakim, Zenithim, Amorites."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1817.38,"end":1821.42,"speaker":"Fr Stephen De Young","text":"And that God gave them the land. What's he about to do in Joshua?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1822.06,"end":1823.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, that's what Joshua."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1823.42,"end":1838.33,"speaker":"Fr Stephen De Young","text":"Drive the giant clans out of Canaan and give Israel that peace. And the land that each of these nations descended from Abraham occupies is part of that land that was promised to Abraham."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1839.29,"end":1844.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because these are the nations that he's the father of."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1844.81,"end":1869,"speaker":"Fr Stephen De Young","text":"Here's the first place where dispensationalism falls apart. Right. They will use rhetorically this argument that, look, all of this land was promised to Abraham and Israel never possessed all of that land. To which the answer is Correct. He promised him to Abraham, not to Jacob."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1869.4,"end":1871.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right. And God told him not to go."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1871.76,"end":1884.04,"speaker":"Fr Stephen De Young","text":"And mess with those people because other descendants of Abraham had that land given to them. Yeah, okay, now there's also the weird note here. Caphtar is Crete."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1885.16,"end":1886.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What's that all about?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1886.44,"end":1888.28,"speaker":"Fr Stephen De Young","text":"The Caphtarim are the Philistines."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1889.35,"end":1892.39,"speaker":"Fr Andrew Stephen Damick","text":"How can Cretans be the descendants of Abraham?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1892.71,"end":1908.15,"speaker":"Fr Stephen De Young","text":"Right. And so because of this now probably what's going on is the way it's phrased in verse 23, as for the Avim, right. It's sort of like, oh yeah, this other giant clan, well, God got rid of them and the Philistines are there."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1908.23,"end":1908.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1909.83,"end":1943.16,"speaker":"Fr Stephen De Young","text":"But, but to Israelites and to post exilic Jews, they took this pretty literally, that somehow Cretans and Greeks in general are descended from Abraham. And so when you see in one Maccabees, the newly independent Hasmodean Judea makes a peace treaty with Sparta. They refer to the Spartans as their fellow descendants of Abraham."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1945.19,"end":1946.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, what is up with that?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1947.59,"end":1949.75,"speaker":"Fr Stephen De Young","text":"That's them taking verse 23 literally."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1949.99,"end":1952.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1952.79,"end":1964.23,"speaker":"Fr Stephen De Young","text":"They are in some sense Abrahamites too. So I know there's some Greek nationalists somewhere listening to this and newly inspired, you know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1966.39,"end":1972.55,"speaker":"Fr Andrew Stephen Damick","text":"They'Re saying this is. I can't do that. Right. So this is true."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":1972.55,"end":2008.06,"speaker":"Fr Stephen De Young","text":"So this pattern, what God is doing for Israel in the book of Joshua, he did the same thing for. I mean, don't miss this. In Deuteronomy 2, God is saying he did the same thing for Moab, Ammon, Edom and even the Philistines. This is not the special part about Israel. This is just Israel qua nation that comes from Abrahamite nation, of which there are a bunch."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2008.3,"end":2018.62,"speaker":"Fr Andrew Stephen Damick","text":"I mean this theoretically should help to hearten. I'm trying to remember is this before. This is before they get to the land and say, oh no, yeah, this should hearten them."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2019.02,"end":2020.14,"speaker":"Fr Stephen De Young","text":"They're the last ones."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2020.22,"end":2024.52,"speaker":"Fr Andrew Stephen Damick","text":"I did it for these other groups, I'm going to do it for you. You know, get your weapons."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2024.76,"end":2039.24,"speaker":"Fr Stephen De Young","text":"They all have a country. Yeah. Yes. And yes, it is true. These countries are going to turn. All these nations are going to turn to paganism and eventually be judged by God and destroyed. But guess what happens to Israel later."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2039.24,"end":2042.28,"speaker":"Fr Andrew Stephen Damick","text":"In the Old Testament Spoilers kind of similar."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2042.36,"end":2049.24,"speaker":"Fr Stephen De Young","text":"They turn to paganism and God judges and destroys them. So again, that pattern, not what's unique about Israel."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2049.79,"end":2050.03,"speaker":"Thomas","text":"Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2050.11,"end":2052.19,"speaker":"Fr Stephen De Young","text":"Yeah, that pattern is common."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2052.19,"end":2052.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2052.75,"end":2063.39,"speaker":"Fr Stephen De Young","text":"But you don't see this. And again, the Philistines are this weird case. But aside from that Right. You don't see this about the Gentiles."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2065.63,"end":2067.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2067.23,"end":2069.79,"speaker":"Fr Stephen De Young","text":"This is a pattern with Abrahamite nations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2070.59,"end":2070.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2071.55,"end":2076.04,"speaker":"Fr Stephen De Young","text":"Reinforcing, again, there's this category of Abrahamites."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2076.44,"end":2076.8,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2076.8,"end":2089.32,"speaker":"Fr Stephen De Young","text":"Who are not Israelites. They get portions of the land that's promised to Abraham. They keep them for as long as they are faithful to God, which includes worshiping Yahweh."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2089.88,"end":2090.28,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2090.6,"end":2100.52,"speaker":"Fr Stephen De Young","text":"Remember, Yahweh identifies himself as the God of Abraham, Isaac and Jacob to Moses. But when you run into Jethro, Jethro is worshiping the same God."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2101.42,"end":2101.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2103.1,"end":2123.66,"speaker":"Fr Stephen De Young","text":"So for him, it might have been, you know, Abraham, Isaac and Edom. You know, for the Moabites, it might have been Abraham and Lot. But we know, especially in the case of the Edomites and the Midianites descended from Ishmael, that there was a considerable period of time there where they were still worshiping the true God. Because we have extra biblical attestation of this."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2123.98,"end":2125.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we've talked about before."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2125.82,"end":2138.76,"speaker":"Fr Stephen De Young","text":"Right. That those groups were worshiping Yahweh. In fact, we have better extra biblical evidence that the Edomites were worshiping Yahweh. That we do. That the Israelites were. We just want to talk about archaeology."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2139.88,"end":2140.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2142.52,"end":2180.26,"speaker":"Fr Stephen De Young","text":"I'm not justifying anybody's weird theories there. No, I absolutely assure you. So, yeah, so there is this group, and this group, again, of Abrahamites is not being treated historically in terms of being in the land in the future, in terms of how they're judged by God, is not being treated in a way fundamentally differently than Israel, though they are being treated in a different way than the Gentile nations proper, the actual 70 nations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2181.23,"end":2190.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's. I mean, and it's. It's not just because they're descended from Abraham. It's also because they are worshipers of the one true God."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2190.83,"end":2191.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2191.19,"end":2192.47,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2192.47,"end":2196.75,"speaker":"Fr Stephen De Young","text":"Right. And when that changes, it changes for Israel and for them."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2197.39,"end":2198.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2199.07,"end":2227.66,"speaker":"Fr Stephen De Young","text":"And for them. And this is all related to, you know, in Deuteronomy 32, right. At the tower of Babel that precedes Abraham, the 70 nations are sort of given over into the care of angelic beings. Right. Whereas God himself chooses Israel, these other groups are kind of left out in Deuteronomy 32 proper, but his choosing of Israel happens through his calling of Abraham in chapter 12 of Genesis."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2229.18,"end":2229.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2230.3,"end":2233.9,"speaker":"Fr Stephen De Young","text":"And so all of these other groups are included sort of in proximity."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2234.6,"end":2254.76,"speaker":"Fr Andrew Stephen Damick","text":"It's kind of fun to spec. I mean, we don't know. We only have the history that actually happened, but it's kind of fun to speculate, like, what if one or more of these groups had not fallen into paganism? Like, would they have been incorporated into Israel in some way or. I don't know. Clearly. If they remain faithful. Yeah, if they remain faithful, then."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2254.76,"end":2270.14,"speaker":"Fr Stephen De Young","text":"But we're going to talk about that a little more in our third half, actually. But. Yeah, yeah. Because so we're going to see when we get to the third half, they're also not called to be Israelites. They're not called to become Israelites anymore than the Gentile nations are."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2270.46,"end":2271.82,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2271.82,"end":2275.18,"speaker":"Fr Stephen De Young","text":"They're called to be who they are and be faithful to God."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2275.34,"end":2306.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. And like, exhibit A. Okay. If someone needs a clear example of this is the story of Job. So this is not in the Masoretic text of Job, but in the Greek text of Job. It says explicitly that he's a grandson of Esau, which means he's an Edomite, and he clearly worships the one true God. But he doesn't have some kind of separate priesthood. He's clearly not an Israelite. There's no tabernacle. There's no."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2306.87,"end":2309.11,"speaker":"Fr Stephen De Young","text":"He's not an Israelite because he's not descended from Jacob."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2309.43,"end":2323.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. He's not living like one. He's not descended from him. And yet he's clearly worshiping God in a way that God regards as appropriate and pleasing."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2325.2,"end":2336.32,"speaker":"Fr Stephen De Young","text":"That, by the way, is in a note for people who aren't super familiar with Greek Job compared to Masoretic Job. Greek Job has a little sort of epilogue tacked onto the end."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2336.96,"end":2337.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2338,"end":2342.64,"speaker":"Fr Stephen De Young","text":"That identifies Job with Jobab, who's in the genealogy of Esau."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2343.14,"end":2343.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2343.78,"end":2358.34,"speaker":"Fr Stephen De Young","text":"As his grandson Jobab. That says Job. That's who Job is. Job is that grandson of Esau. That's who this story is about and how he's a righteous man who will be part of the resurrection of the dead on the last day."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2361.06,"end":2367.86,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that ends this first half of this episode of the Lord of Spirits. So we're going to take a short break, and we'll be right back."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2368.43,"end":2384.43,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2390.59,"end":2420.99,"speaker":"Fr Stephen De Young","text":"Neither do men light a lamp and put it under a bushel, but on a lampstand, and it gives light unto all that are in the house. Ancient Faith's Lampstand Institute is an introductory media training forum for Orthodox Christians aged 18 to 23 who are interested in learning skills in digital media and applying them to the service of the church. Ten students will gather to learn the essentials of podcasting and video production and the why and the how of Orthodox Christian media while exploring their own digital media projects."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2420.99,"end":2423.57,"speaker":"Fr Andrew Stephen Damick","text":"The weekend will include sessions on podcasting."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2423.88,"end":2454.2,"speaker":"Fr Stephen De Young","text":"Audio production, live radio, video making, marketing and media ministry, plus open work sessions for recording radio material, refining a personal project and preparing a live radio broadcast. Lampstand Institute July 17th 20th at the Ancient Faith headquarters in Chesterton, Indiana. Less than two weeks. To apply to sign up or learn more, you can go to ancient faith.com events that is ancientfaith.com events."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2457.88,"end":2473.88,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2475.65,"end":2497.09,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for that. Voice of Steve. I was trying to remember the last time I called him Voice of Steve. Of course, I know. You know, he gets irritated when people meet him and they're like, hey, you're the voice of Steve. He's like, I'm a real person. But wow, the call board is lighting up with lots of calls people. Maybe it's a bunch of irate dispensationalists. What do you think, Father?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2497.49,"end":2498.37,"speaker":"Fr Stephen De Young","text":"I hope so."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2498.45,"end":2499.49,"speaker":"Fr Andrew Stephen Damick","text":"I hope so too."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2500.53,"end":2506.37,"speaker":"Fr Stephen De Young","text":"Although this is not a good medium to have a conversation with a dispensationalist. They can't display their wall chart."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2506.84,"end":2507.4,"speaker":"Announcer","text":"I know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2508.52,"end":2530.2,"speaker":"Fr Andrew Stephen Damick","text":"I love those Clarence Larkin illustrations. I was raised on those things. I don't know, they were just fascinating to sit there and leaf through it, you know? So great. I don't know. There's something about those charts that's shaped part of the way, I think. I can't exactly put my finger on what it is, but that and Jack chick tracks."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2530.44,"end":2534.45,"speaker":"Fr Stephen De Young","text":"So, yes, you had a abusive childhood, clearly."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2537.97,"end":2538.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2538.93,"end":2542.77,"speaker":"Fr Stephen De Young","text":"So, yeah, that to become a crime fighter. But instead this."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2543.25,"end":2560.51,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Well, I didn't fall in any. Any vats of green glowing liquid or get bitten by some radioactive thing. So, you know, of course. I mean, I guess there, there are some crime fighters that didn't have any kind of supernatural ish."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2560.51,"end":2562.87,"speaker":"Fr Stephen De Young","text":"Yeah, look at Batman. All it takes is dedication, my friend."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2562.87,"end":2563.67,"speaker":"Fr Andrew Stephen Damick","text":"Science experiment."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2563.67,"end":2565.47,"speaker":"Fr Stephen De Young","text":"Yeah, that's dedication and self discipline."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2565.71,"end":2566.79,"speaker":"Fr Andrew Stephen Damick","text":"What are his powers?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2566.79,"end":2570.11,"speaker":"Fr Stephen De Young","text":"I mean, come on, he's the world's greatest detective."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2570.19,"end":2571.55,"speaker":"Fr Andrew Stephen Damick","text":"His work is done by Alfred."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2571.55,"end":2572.99,"speaker":"Fr Stephen De Young","text":"He's smart and rich."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2574.51,"end":2576.19,"speaker":"Fr Andrew Stephen Damick","text":"That makes him better than everyone else."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2577.31,"end":2580.83,"speaker":"Fr Stephen De Young","text":"Well, at least allows him to go and punch them in the face, especially if they're mentally ill."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2583.95,"end":2622.86,"speaker":"Fr Andrew Stephen Damick","text":"So, yes, we are getting. None have actually completely lit up on the caller board yet, but there are people clearly trying to call us right now. So we are talking about Israel, the shape of Israel, the story of Israel. And just for a little recap of our first half, the place that we particularly ended is that it turns out that there are multiple Abrahamite nations that are not Israel and that initially are worshiping Yahweh, who is God's Israel. Israel's God. God's Israel. Boy, you could tell. The allergy season's really getting to me. I can't think straight."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2624.14,"end":2627.06,"speaker":"Fr Stephen De Young","text":"That pay is just getting docked and docked and docked."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2627.06,"end":2651.83,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Well, you know, here's the thing. Here's the thing. I mean, we did discuss in the first half how it is that the Bible goes straight from the whole Tower of Babel episode. Just suddenly you get Abraham showing up with no kind of transition. So I'm really just being much more Biblical, much more Genesis in my. In my style this evening. You know, you're buying that or."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2652.87,"end":2653.79,"speaker":"Fr Stephen De Young","text":"Not really, but."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2653.79,"end":2662.71,"speaker":"Fr Andrew Stephen Damick","text":"Not really. Okay, well, we do have Joseph calling from somewhere here in. In the forests of Pen. So, Joseph, welcome to the Lord of."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2662.71,"end":2667.59,"speaker":"Thomas","text":"Spirits podcast by Father's Father's blessed Christ is risen."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2667.75,"end":2668.95,"speaker":"Fr Andrew Stephen Damick","text":"He truly is risen."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2670.96,"end":2725.01,"speaker":"Thomas","text":"So I have a question about the cyclical nature of the Torah's father. Stephen has mentioned many times about the sin with, like, withholding system or the sin protection system of the Torah and how in the new covenant everything is, you know, purged. Like that's actually fixed. It's fully fixed rather than just withheld. And I guess my question was now we. We still have to re. Bless, you know, cars and houses and those kinds of things because we sin in them. In what sense do those blessings elevate over the old covenant that even though we sin, they purged us in? Was that not being done in the old covenant? What is the cyclic. What is the relationship of the cyclical nature before and after Christ's work on earth?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2726.13,"end":2731.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, see clearly, Father, they're definitely rattling the cage for you to write that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2731.69,"end":2737.01,"speaker":"Fr Stephen De Young","text":"Atonement book, obviously, which may be a thing that happens."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2737.33,"end":2740.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, there has to be goats on the COVID soon."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2740.01,"end":2740.53,"speaker":"Fr Stephen De Young","text":"Ish."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2740.69,"end":2849.67,"speaker":"Fr Andrew Stephen Damick","text":"If all. If at all possible. Yeah. Well, I mean, number one, like, the environment has changed. Like the whole cosmos has been altered. There's no area of the cosmos that now belongs to Azazel. You know, it's all been reclaimed. As Christ said, you know, all authority in heaven and earth has been given to me as he's about to ascend into heaven. And so that changes. That changes the whole ball game. I mean, I would say that, and correct me if I'm wrong here, Father, but I mean, I would say that the reason why we have to do things over and over again is simply because we are, we remain sinners. I remember there was one time when I was having a conversation with a friend of mine who's a monk, and he said. I mean, he was kind of exaggerating, but I don't know, I think that this works on some level. He says, you know, you have to say, lord, have mercy only once in your life, and the heavens can open and you can become a saint, you can become clairvoyant, you can heal the sick and raise the dead and all this stuff. But here's the catch, is you have to say it with perfect love, perfect humility, perfect faithfulness, and never go back on any of that. And if you can't get that right the first time, then maybe we need to practice a lot, right? So, I mean, that's my understanding of it is it's not that, you know, the playing field has changed, but the players are still sinners. And also I would say that the players can achieve much more now under the new covenant than they could under the old. That's my understanding of it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2850.95,"end":2868.47,"speaker":"Fr Stephen De Young","text":"What do you think the second part there is the key, and part of this is we have to get this thing out of our heads. That's come from American Reed evangelical Christianity, where there's this underlying assumption that somehow if you didn't commit any sins, you would have earned eternal life."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2871.03,"end":2871.39,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2871.39,"end":2891.04,"speaker":"Fr Stephen De Young","text":"This comes out in a lot of places. This comes out and sort of the evangelical freak out when they find out that we don't believe the Virgin Mary committed any sins you could throw in along with that. We don't think St. John the Forerunner did either, or Enoch or several other."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2891.04,"end":2895.32,"speaker":"Fr Andrew Stephen Damick","text":"People in the Bible and was raised by angels. So, I mean, pretty good parent."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2895.32,"end":2926.26,"speaker":"Fr Stephen De Young","text":"They only really freak out about the Virgin Mary for some reason, but. Right, but if you think about that for a second, it doesn't make any sense, right? That would be like, so you start a job and they give you a book. And in the book, the employee manual, there's a list of offenses that will get you fired. And so you work there for six months and you go to your boss and you say, I have not committed any of these Offenses that would get me fired, therefore I have earned a promotion."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2927.7,"end":2930.18,"speaker":"Thomas","text":"Yeah, right. That's a good analogy."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":2930.58,"end":3023.73,"speaker":"Fr Stephen De Young","text":"Or you go to the local police department, say I have not broken any laws, therefore I should be the mayor. Right? That's not how it works. That's not how anything works. Right. And so we have to understand that what's going on up until the time of Christ, not just the Old Testament prehistory, right. Humanity's history before Christ is all taking place within this deficit, within a world that's controlled primarily by hostile spiritual powers because of the sin that humanity has sunken into and it's worship of those demonic powers. When Israel comes into existence, it's like this little island in a world full of darkness, right? And even within that little island, there's this sin management system that has to constantly take place to keep it even. That island, right now we're in a place right after Christ where it's no longer just an island because Christ now owns everything. And Christ is the one who is going to judge everything. Where the ray of repentance has been open to everyone. And beyond just repenting for sin, that is a way that leads to theosis, to actual salvation, to actually being transformed into the likeness of Christ. Right. Sort of salvation in a positive sense, not just the negative sense of getting rid of the bad things I do."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3024.29,"end":3024.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3024.65,"end":3068.38,"speaker":"Fr Stephen De Young","text":"Or taking care of that deficit. Right. Getting rid of the negative balance in my account, but actually developing a positive balance in my account. Now there is, even though I just use that analogy, there is no positive balance in your account. There's no level that, that reaches where you have earned anything. Right. That is just an analogy for the gradual transformation of the human person that happens throughout their life and into eternity. Because there's no sort of stopping point to that. So Christ's resurrection opens the way to eternal life for everyone. But that way is still a road that has to be walked voluntarily."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3069.5,"end":3070.06,"speaker":"Thomas","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3070.38,"end":3098.95,"speaker":"Fr Stephen De Young","text":"And by choice. Right. So remember, Adam and Eve were not created in eternal life, Right? Eternal life was something they were going to have to work toward, right. Live their life towards. There were goals that they were put into the world to accomplish. That all got sidelined by sin. Sin made it difficult, if not impossible to accomplish those things with God. All things are possible."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3099.71,"end":3099.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3100.91,"end":3114.35,"speaker":"Fr Stephen De Young","text":"And so God did the various things he did that are all listed out in the Liturgy of St. Basil the Great's prayers after we were expelled from paradise, right? Up to. Up to Christ. So does that make sense in terms of the difference?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3114.35,"end":3114.83,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3115.47,"end":3144.02,"speaker":"Thomas","text":"Yeah, certainly. And quick follow up as well, if I may, I've been, you know, I read a lot of, especially just like world history in their eras of paganism, if they became Christian later, like Greek and lately like East Asian. And I think, I think Father Stephen, you had mentioned in the. That there was a point in the Roman Empire that they were even saying that our sacrifices are becoming impotent. As in they were working but now they're not as pagans."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3144.26,"end":3144.74,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3146.58,"end":3178.93,"speaker":"Thomas","text":"Would you say that? I mean, obviously we test that to Christ. Is there any good sources or study on that like anywhere else? Because I know that there's actually a case where a Han Chinese source even cited an eclipse occurring approximately the date of the crucifixion. I've always been fascinated by the idea that we could chart this somewhere else. If there's any other kind of cases that you know of where they're like, the sacrifices aren't working anymore, something has happened."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3179.97,"end":3216.01,"speaker":"Fr Stephen De Young","text":"Yeah, I don't, I don't have a good bibliography on that. Outside the Greco Roman world, there are a couple of really good studies. One of them is called the Last Pagan Generation and the other one I think is just titled Pagans. But I can't remember the author of either off the top of my head and I'm not broadcasting from my library, so I can't look at them. But Pagans also is dealing with the last pagan generation in the Roman Empire."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3216.89,"end":3217.45,"speaker":"Thomas","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3217.45,"end":3219.93,"speaker":"Fr Stephen De Young","text":"And those two books track a lot of that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3221.21,"end":3221.77,"speaker":"Thomas","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3222.33,"end":3231.05,"speaker":"Fr Stephen De Young","text":"And different things going on in different parts of the Roman Empire. So from that end at least, those are two good. Go to books for that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3232.01,"end":3233.53,"speaker":"Thomas","text":"All right, thank you, Father."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3234.31,"end":3248.47,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you very much for calling, Joseph. We have now a call from John, who I think has a. I don't know, a potentially kind of spicy question. So, John Christ has risen. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3249.59,"end":3251.83,"speaker":"Thomas","text":"Surely he is risen. How are you, fathers?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3252.07,"end":3252.95,"speaker":"Fr Andrew Stephen Damick","text":"Good. How are you?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3254.15,"end":3317.57,"speaker":"Thomas","text":"I'm doing well. I. Let's see here. So my wife has been trying to bring her friend to realizing that Christ is our Lord and Savior. But her friend is having a hard time with the emphasis of like the people of Israel in the Bible and the modern day atrocities and the things we're seeing on the media and everything that are coming out of the state of Israel right now. And while we're sort of on the topic of Israel as a people, I. I was just wondering if you could lend some of your maybe takeaways or wisdoms on how my wife can go away, can go like, go about approaching this topic with her friend and removing some of the. The hesitations towards accepting Christ as her Lord that are caused by this, this rather confusing worldly situation we have going on today surrounding the state of Israel and the people of Israel. Do you understand?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3318.85,"end":3547.44,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely, absolutely. You know, we've made reference several times already in this episode to dispensationalism. And one of the key bases of dispensationalist theology, one of the key kind of claims is this connection of the modern state of Israel with, you know, this identification of the modern state of Israel with Israel in the scriptures period. And so, yeah, I can imagine that your wife's friend, therefore, probably being affected by that theology, probably, you know, that's the interpretation that she has may look at the actions of the nation state of Israel and say, well, I disapprove of those actions. And so, therefore, how can I be a Christian? Because aren't Christians supposed to approve of the actions of the modern nation state of Israel? I mean, I can tell you, I mean, I was raised, I personally was raised in a Protestant tradition that was. That was dispensationalist. Now, I mean, my family moved a lot of times, and so we didn't belong to a particular denomination, but a lot of the churches we went to were very much affected by this theology. You know, the idea of, you know, you always have to stand with Israel. And that meant approving, not just in your personal opinion, but, you know, voting and all this kind of stuff in terms of backing all the actions of the modern nation state of Israel. And I could tell you that, I mean, as I became Orthodox, I not only begin to change my mind a lot about a lot of that stuff, not that I had a big commitment to it when I was younger. I just didn't know any better. This is just always what I've been told. But the thing that really, really, really changed my mind and made it explicit to me was that I married somebody who was half Palestinian and who had stories about her grandparents and their experiences in that region of the world. And my point in mentioning that is not to say, you know, okay, you need to be on this side and not this side, you know, these questions. That's not the point at all, but rather to say that the, the biblical importance, the Christian importance of the modern state of Israel is the same as the biblical importance of Finland, which is to say it's not. It's not. It's simply not. So you can have opinions about what the modern nation state of Israel does and feel free not to be bound by the Bible in any way regarding those opinions, except, you know, just is this good or is this bad? Not. I have to be on the side of these people no matter what they do, which isn't even how the Bible presents how God approaches Israel in the Old Testament. He's not on their side no matter what they do. You know, he judges them if they get out of line. But the point is, I mean, and we're going to be unpacking this, you know, so stick with us. Right. This is a three episode, at least three episode arc. I'll be happy if it goes longer. We'll see what happens. Where we're going to show what is the story of Israel. And I will tell you a spoiler alert. It does not come to fruition in 1948. It doesn't, you know, so. So your wife's friend can breathe easy and have whatever opinions she, her conscience tells her to have about the modern nation state of Israel. And that should not stand in the way of her acceptance of Jesus Christ, who is the Messiah. You know, Father, anything you want to add to any of that or that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3547.44,"end":3548.92,"speaker":"Fr Stephen De Young","text":"Won'T get us yanked off YouTube?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3551.56,"end":3552.28,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3553.64,"end":3560.97,"speaker":"Fr Stephen De Young","text":"Yeah, the number of social media strikes my wife and I have accumulated is astronomical on this issue."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3561.37,"end":3563.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, well, there you go."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3564.89,"end":3596.82,"speaker":"Fr Stephen De Young","text":"But, so, yeah, put simply, as Father Andrew said, there is no real connection between the modern nation state of Israel and the Israel of the Bible. They're not the same thing. People who say they are the same thing are Zionists. And the degree, if you are Jewish in general, the degree to which you are a Zionist is directly proportional to the degree to which you are secular."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3599.22,"end":3605.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, most of the real super religious Jews in Israel are not Zionists."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3605.78,"end":3653.19,"speaker":"Fr Stephen De Young","text":"Yes. Orthodox Jews are less Zionist. Hasidic Jews are less Zionist than that. And like ultra fundamentalists, the really Jewish sects are anti Israel. Anti modern state of Israel. Completely. Right. Sound like the loudest Palestinian activists you've ever heard. So this is not an issue of the Jewish religion is the point I'm trying to make. Yeah, this is a secular. Zionism is a secular movement and a secular phenomenon, not a religious movement and a religious phenomenon. So even from a Jewish perspective, this is pretty disconnected from religion, but especially from a Christian perspective."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3653.27,"end":3661.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and this is an issue mainly here in the United States, honestly."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3661.59,"end":3663.75,"speaker":"Fr Stephen De Young","text":"Because of the, because of dispensationalism."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3663.92,"end":3788.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because of the influence that dispensationalism has had on the broader culture. And I mean, you know, if you want to, if you're looking for some receipts if you want to look for some historical story to this. A lot of this does not really come to be popular in American culture until right around World War I. And the reason that it becomes popular around that time is that, of course, when World War I breaks out, a lot of people believe that possibly the end of the world is nigh. I mean, for good reason. You know, World War I is a big deal. And so what happens is there are certain kinds of preachers and theologians who were predicting all of this kind of thing and had their own frameworks for interpreting all of it that suddenly become very popular when you feel like the world is ending. Suddenly end of the world preachers sound more interesting to a lot of people. People. And one of them particularly is a guy named Scofield who had this Bible, the Scofield Reference Bible, which was a relatively obscure book up until that time, and then just took off like a rocket and it became hugely influential in American culture. And what was a kind of a relatively small movement of dispensationalism up until that point becomes massive and. And cross denominational, you know, and so a lot of people just take this as. As a given now because they've never heard anything different. This is what they've heard all their lives. Every preacher they've ever listened to talks this way. But, you know, there's no call for treating the citizens of the state of Israel worse than anybody else. You know, we should treat them as we would any other human being. Right. We should treat them with love and pray for them and, you know, and, you know, regard them and criticize those governments in the way that we criticize any government. So, yeah, I hope that helps, John."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3789.16,"end":3797.48,"speaker":"Fr Stephen De Young","text":"Let me also throw in, oh, we're not spicy enough yet. Oh, dispensationalists don't love the Jewish people."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3799.17,"end":3799.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, they love."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3799.89,"end":3801.89,"speaker":"Fr Stephen De Young","text":"Dispensationalists hate the Jewish people."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3802.45,"end":3803.49,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's interesting."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3803.57,"end":3809.33,"speaker":"Fr Stephen De Young","text":"Dispensationalists are some of the most anti Semitic people in the world. Here's why."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3809.65,"end":3810.29,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3811.01,"end":3812.93,"speaker":"Fr Stephen De Young","text":"They don't want to see them come to Christ."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3814.05,"end":3819.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right, yes, right. They have this idea of the separate religion that they don't want to see."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3819.13,"end":3843.96,"speaker":"Fr Stephen De Young","text":"Them come to Christ, they don't want to see them convert. When I talk about, wouldn't it be Alisha, wouldn't it be beautiful if in the future there was some mass conversion and the chief rabbit in Israel became, you know, Orthodox Christians? That would be the most horrible thing that could happen from the perspective of a dispensationalist okay. The reason they're rooting for Israel, they want Israel to be at war."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3845.64,"end":3846.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3846.44,"end":3853.37,"speaker":"Fr Stephen De Young","text":"And they want Israel to rebuild the temple because they believe that when that happens, Jesus will return."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3855.93,"end":3856.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3856.37,"end":3869.53,"speaker":"Fr Stephen De Young","text":"And yes, some of the Jews alive at that time will accept Jesus. And the ones that don't, he's going to kill them all. That's what dispensationalists believe. So dispensationalists view Jews, and especially Israelis as a tool."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3871.29,"end":3871.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3872.01,"end":3911.19,"speaker":"Fr Stephen De Young","text":"To get their Messiah to come back. They don't look at them as people. They don't look at them as people who need salvation in Christ, for sure. Okay. That is. This is. This is pure hate. Right. If you. If you look at a lot of the other political views of American Evangelical Zionists, you'll see connections. Let me just put it that way. Okay. These are not the most compassionate folks in the world toward anyone. And that's the real problem. Now, from the perspective of the Israelis, they think all that's bunkum anyway."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3911.75,"end":3912.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3912.47,"end":3916.39,"speaker":"Fr Stephen De Young","text":"They'll take these people's money. They don't care. Why should they care?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3916.55,"end":3922.39,"speaker":"Fr Andrew Stephen Damick","text":"It's very cynical. Yeah. We're very happy for that theology to be influential because it kind of helps us."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3922.47,"end":3973.38,"speaker":"Fr Stephen De Young","text":"It's helping them out. Right. They're getting bombs and guns and money from the U.S. cool. Right? So, sure, they take it. But those people are not the people who love the Jews. They always want to cast it as if they're the people who love the Jews and the rest of us are all anti Semites. It's the exact opposite. This is almost. You may have noticed if you listen to this show for very long, when you push beneath the surface, the things that people are always accusing other people of being is usually what they are. It's usually what they actually are themselves. And that's why they're accusing everyone else of it, because they see it in themselves that they don't like it. But it's better to project it onto other people than to accept what they've become. Okay. End of my spicy rant."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3973.54,"end":3982.35,"speaker":"Fr Andrew Stephen Damick","text":"That's some good rants there, John. Is that helpful? I mean, I don't know. You know, we don't know your wife or her friend, but you can talk to them."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3984.43,"end":3986.43,"speaker":"Thomas","text":"Right. I find that especially helpful."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3986.59,"end":3987.71,"speaker":"Fr Stephen De Young","text":"Very beautifully put."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3988.11,"end":3990.91,"speaker":"Thomas","text":"And it fired me up, honestly. So thank you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":3991.23,"end":4008.87,"speaker":"Fr Andrew Stephen Damick","text":"Thank God. Thank God. So, all right, we're going to take one more call before we move on into our. The content of our second half. And Thomas is calling from the very land in which I was born the very place. Not just the state, mind you, not even just the region, but the very city itself."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4008.87,"end":4015.91,"speaker":"Fr Stephen De Young","text":"The hospital is calling from the Neo. Are you calling from Riverside Hospital, Thomas, in Newport News, Virginia?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4017.27,"end":4020.47,"speaker":"Thomas","text":"No, I'm. But I'm right down the street. I'm right around the corner."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4020.95,"end":4024.43,"speaker":"Fr Andrew Stephen Damick","text":"Now, did I meet you when I was down yonder at the beginning of Lent?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4024.43,"end":4026.87,"speaker":"Thomas","text":"You. As a matter of fact, you did."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4027.35,"end":4029.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, well, nice."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4029.83,"end":4033.75,"speaker":"Thomas","text":"But I'm very un. I. You don't remember, ma'. Am. Very unmemorable."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4034,"end":4048.48,"speaker":"Fr Andrew Stephen Damick","text":"So I'm sorry. I mean, I met a lot of people that weekend, but I'm sure. I'm sure you're giving yourself short shrift, but yes. Newport News, Virginia, formerly known as Warwick River Shire. So you're in the shire, Thomas. You are in the shire."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4049.28,"end":4052.32,"speaker":"Thomas","text":"I am currently in the shire. And I'm living it up."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4052.8,"end":4060.32,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Okay. What is on your mind, Thomas, from the holy land of Newport News, Virginia?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4061.86,"end":4078.98,"speaker":"Thomas","text":"Well, I, you know, I've always. So I'm a recent convert. My wife and I and our kids joined the Orthodox Church last year. Best decision we've ever made. And we were at home, and my wife's coming from a dispensationalist, independent fundamentalist Baptist background."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4078.98,"end":4083.26,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, ifps. Yeah, sorry. I'm sorry."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4083.26,"end":4083.94,"speaker":"Fr Stephen De Young","text":"I'm getting excited."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4085.14,"end":4085.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4085.7,"end":4121.55,"speaker":"Thomas","text":"So she's really going to enjoy this podcast when she listens. She's. She has no idea that I'm calling right now, but I come from kind of a multiple backgrounds and one of them is Roman Catholic. I was baptized into the Christian faith in the Roman Catholic Church as a young adult and kind of sojourned within Protestantism for a brief period of time, a decade or so. And then my wife and I decided to join. Join the Orthodox Church. And, and as I said, we're, you know, no mistakes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4121.55,"end":4121.99,"speaker":"Fr Andrew Stephen Damick","text":"We're."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4121.99,"end":4162.18,"speaker":"Thomas","text":"We're very happy to be where we are, thanks be to God. But one of the questions that I have wrestled with, and I'm wanting to kind of put to you and Father Stephen, is this question of, you know, what is the relationship between Orthodox and the non orthodox folks that carry the banner of Christ, that want to follow him, but have some views that are a little. Well, a little skewed or very much skewed. And I've listened to your podcast. I have not read your book yet, Orthodoxy and Heterodoxy, but I found it very helpful."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4162.18,"end":4162.9,"speaker":"Fr Andrew Stephen Damick","text":"Come on, man."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4164.02,"end":4253.83,"speaker":"Thomas","text":"I know. I'm working on. I'm working on a copy of the book I bought a copy of the book and I'm going to read it. I swear I'm going to read it. But we're talking about Israel and the faithful remnant and, you know, these sorts of issues. I'm looking at the Christian era from the time of Christ. And it seems to me, and I'm glad to be corrected here, that there is a falling away of different groups, especially within the Protestant world. And, you know, the death of Pope Francis is just yet another example of, you know, how this is coming to mind in a lot of people's daily life. But how are we as Orthodox to relate with the Roman Catholics? Putting aside issues of like, validity of sacraments and things like this, what is our experience dealing with Roman Catholics? Are we supposed to assume that an individual has faith but the hierarchy is in schism? Are we to believe that they are just completely. The teachings lead them to be lost? I mean, I'm really grasping at this because I know a lot of Catholics, I love them dearly. They, you know, but I'm, I'm just really wrestling with it, so I'd love to hear your thoughts. This isn't the best podcast for it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4255.35,"end":4580.53,"speaker":"Fr Andrew Stephen Damick","text":"Some other podcast man. Well, I mean, I think, I don't know exactly where we're gonna, where we're gonna go in our future episodes in this arc. It might be interesting to do an episode on the non Orthodox or those outside of Israel. But I, I think that like here in 2025, to me, the, the, the most important question, and this is not the one that all of the online apologists to be focused on, right? Their, their question generally seems to be what should be my opinions about these other people and their teachings and their rulers and whatever. Right? And, and that's fine. But, but to me, the most important question is what you do, right? And the, the instruction on what you do is actually pretty clear. Right? So for instance, I, as an Orthodox priest, I am forbidden from con. Celebrating the Eucharist with a Roman Catholic priest. Just straight up, you know, it's very clear. It's obvious I am not supposed to do that. I don't need to have an opinion about, you know, what's going on in his services. I just simply need to be obedient to that, you know, and, and, and then in terms of like, how do you relate to other people? Like, okay, well, like I remember years ago, actually, I was on with, with the late Kevin Allen, God, God rest his Soul, where we did an episode called something like who's not a Christian? Or something like that, and you know, one of the questions is like, okay, should we as Orthodox Christians regard these other people as Christians? Right? And the question that I have is like, well, why? What is the point of asking that question? Is it so that you have the right opinion about them? So I can say, you know, good or bad or whatever? Because it's not an important question except in so far as it leads to a particular action. Right? So if the question is, can I receive communion with people who are not orthodox? Well, the answer is obviously, no, I cannot, you know, I can't do that. Can I be friends with people who are not orthodox? Yes. In fact, I would say we have an obligation to have relationships with non orthodox people because if anything, because we want them to become part of the church. And if we don't love them, if we don't have a relationship with them, how can we love them? And if we're not loving them, then how. What do we expect? You know, is it, you know, about, like, well, should, should my kids marry, you know, someone who's not Orthodox? Well, I mean, you can have a conversation about what it's like to have a mixed, a mixed religious household, you know. Right. So those relationship questions, I think, are the most important things. Now if it's a question of specific doctrines, then yeah, we could talk about those doctrines. Right? So, okay, do we agree on Christology? Do we agree on tritology? You know, what are the critiques we would have for these particular practices? Fine. All of that is perfectly acceptable to do. And if you would crack open that 400 and something page book that apparently you have a copy of, I'm just messing with you, Thomas, because you seem like a good natured dude. But seriously, I mean, that book is dedicated to all of that, to particularly saying, okay, how are we different? How are we the same? With lots and lots of other Christian groups, there's a whole chapter on Roman Catholicism. There's. So I think that rather than saying I need to come up with a particular set of opinions that I should apply to all Roman Catholics or all Presbyterians or whatever, I mean, to me it's much more important and interesting to ask, well, the person in front of me, what exactly is their deal? What do they believe? What do they practice? What do we have in common? And it's really important to point that out. What do we have that's not in common? And when is it important to point that out? It may not always be useful to point that out. Like if someone's not ready to be challenged, if I challenge them. And it's clear to me they're not ready to be challenged, then what am I doing that for? To make myself feel good. I mean, it can feel pretty good, you know, and it might even get me lots of clicks. But is that actually an act of love to that other person, to push on them when they're not ready to receive that? You know, So I think so much of it depends on the particular relationship and that that's the more important thing than all the kind of apologetics points. I think the apologetics is important and we should. We should conduct it with seriousness, with commitment, and most especially with love. But. But if we don't have friendship within which those apologetics can happen, then I don't think it's going to. It might even be damning, actually. You know, I'm not sure how that relates to the remnant of Israel and all that, but I don't know. That could be a whole episode right there, Father."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4582.05,"end":4605.82,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, I just deal with it at the level of people, because the place where that impacts me is I've got. I'm in a 70% Roman Catholic area, at least technically, right on the books, right? I mean, that would mean, like, there's a couple hundred thousand people at Mass every week in this town, and that ain't happening. So, you know, Roman Catholic in some sense. Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4606.46,"end":4606.94,"speaker":"Fr Andrew Stephen Damick","text":"That's."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4607.42,"end":4642.77,"speaker":"Fr Stephen De Young","text":"We're baptized Roman Catholic, but so I have. I have a lot of people who come into our parish from a Roman Catholic background and stuff. And so, like, I've always said about this stuff, there's not somebody who can't be saved in the world because God is the one who saves people, and nothing is impossible for God. Okay? So if God wants to save a Hindu, he can save a Hindu. If he wants to save a Buddhist, he can save a Buddhist. If he wants to save an anarcho primitivist who worships rock, he can save that guy. Right? Whatever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4642.85,"end":4643.25,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4645.5,"end":4650.94,"speaker":"Fr Stephen De Young","text":"He could certainly save Roman Catholics, he could certainly save Protestants, he could certainly save Evangelicals."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4651.18,"end":4651.58,"speaker":"Thomas","text":"Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4655.18,"end":4868.89,"speaker":"Fr Stephen De Young","text":"That's important to say, though, because that's most of this question for a lot of people. They're asking, do you accept me as a Christian? They're really saying, do you think I'm saved or not? And fundamentally, my answer to that is, I don't know, man. I just met you, right? Like, that's not my call. I'm not the one who decides that. Right? But what I do know from dealing with actual people who were Roman Catholic, grew up Roman Catholic, were raised Roman Catholic have some kind of Roman Catholic cultural background at least is they've got a lot of ideas in their head. And every time I talk about this, there's robo Catholics out there who get mad at me and insist that I'm caricaturing them. And, well, they usually say I'm straw manning them, but that's not what that means. Look up what a straw man fallacy is. You think I'm caricaturing you. That's the correct word to use. But they think I'm caricaturing them. And all this, right? It's like, well, maybe it doesn't apply to you, but there are people who resonate with it, right? Who that is what they received, even if that's not what the Roman Catholic Church was trying to convey, that's what got conveyed culturally, right? And so to them, ideas coming out of Orthodoxy like the Church is a hospital, not a courtroom, is huge, right? The difference in how we do confession is huge. The difference in how we look at guilt is huge and sort of hugely liberating. I remember at one point at a previous parish, I was talking about some things that are taught by the Roman Catholic Church that we as Orthodox disagree with. And some of the Orthodox people there did not believe me that the Roman Catholic Church taught those things. And a member of that parish who was a former Roman Catholic stood up and yelled really loudly. He was funny that way. Y' all don't know what it's like to come up under the law, indicate like he understood exactly what I was saying, right? And so to me, it's an issue of. And this is the same thing I say about Calvinism, right? Having grown up myself in Dutch Calvinist circles, right? I've seen what that does to people, right? The kind of pathologies that induces in some people. And so to me, the question is, is the place where you are. You come and tell me you're a Christian, I will say, even if you're like a Mormon, even if you were these fringe cases, you come to me and tell me you're a Christian, I will give you the benefit of the doubt that you are a person who is trying to follow Christ as best you understand him and as best you understand how, okay, the place where you're trying to do that, the community you're trying to do that in can help you do that or can make it much harder for you to do that. Sometimes that's for theological reasons, bad theological views, sometimes that's practical regions of corrupt leadership in particular places, in particular churches. And particular, you know, things that happen. There's all kinds of reasons why you could be in a bad place to be trying to follow Christ."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4869.85,"end":4870.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4870.89,"end":4917.62,"speaker":"Fr Stephen De Young","text":"And I mean, it should go without saying, I would think that as an Orthodox priest, I think the best and most conducive place to do that is in an Orthodox parish. Think that'd be obvious? But when I say it, people act like I'm being mean or weird or exclusive or whatever. But that's why I'm an Orthodox priest, because I think this is the best place to do that. Okay. So when I talk to someone from one of those groups, if I am in any way encouraging them to, to come to the Orthodox Church, I'm doing it because I think they are a person who's trying to follow Christ and I think they will better be able to do that here than where they're at. That's it. That's. That's the whole argument."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4918.34,"end":4918.98,"speaker":"Thomas","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4919.86,"end":4932.18,"speaker":"Fr Stephen De Young","text":"And by the way, before I finish, just as a note, right, if you tell me you're a completely happy, well adjusted Roman Catholic or Protestant or evangelical or what have you, I'll believe you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4932.66,"end":4933.14,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4933.3,"end":4964.67,"speaker":"Fr Stephen De Young","text":"You don't have any of those issues I'm talking about. Great. But it seems to me that when I make these kind of comments and you come and write a screed in the YouTube comments or send me a screen in the email, that maybe I triggered you a little, maybe I touched a nerve and maybe you're not as well adjusted and happy where you are as you claim to be. Kind of a self tell to think about when you're doing that. But anyway, that's the end of my response."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4966.91,"end":4969.79,"speaker":"Fr Andrew Stephen Damick","text":"Wow. We're just lining up a bunch of long rants tonight."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4970.11,"end":4970.59,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4971.25,"end":4972.21,"speaker":"Fr Andrew Stephen Damick","text":"Does that help, Thomas?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4973.17,"end":4976.37,"speaker":"Thomas","text":"It absolutely does. Thank you. I really appreciate it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":4977.09,"end":5000.7,"speaker":"Fr Andrew Stephen Damick","text":"Great. Well, thanks for calling in. All right, well, rolling on now to the second half of this episode of the Lord of Spirits podcast. We're talking about the story of Israel. So where do we go next, Father? Should we talk about. Should we talk about Egypt? There you go. There, you know, just. There's. There's your random non transition again. Yeah, Egypt. Egypt. That's what's next on the list, Egypt."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5000.7,"end":5002.5,"speaker":"Fr Stephen De Young","text":"You're just firing on no cylinders tonight."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5002.58,"end":5012.5,"speaker":"Fr Andrew Stephen Damick","text":"I know. Well, it's the, the chat on YouTube is moderately hot this evening actually, and it's actually included a couple of celebrity appearances by your wife."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5012.9,"end":5015.86,"speaker":"Fr Stephen De Young","text":"Oh, okay. So yeah, the spice must flow."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5016.02,"end":5017.3,"speaker":"Fr Andrew Stephen Damick","text":"That's right, exactly."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5018.5,"end":5026.36,"speaker":"Fr Stephen De Young","text":"So, yes, yes. So yes, we began in the land between the rivers. Now we're heading to the Red Sea."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5026.84,"end":5027.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5029.24,"end":5077.83,"speaker":"Fr Stephen De Young","text":"And so we're going to talk about now the beginning of Israel as a nation. Right? So we have the sort of the seed of Israel is planted with Abraham. Israel comes into existence as a nation. Right. First of all, in the events of Passover of Pascha, the first one. Right. And when we talk about that, when we talk about what's celebrated in the first Passover, the first Pasca, there's a couple events brought together in that. Right. Because the Passover proper, if you think about it, is the 10th plague, the death of the firstborn, and the ritual with the lamb. Right. And the lamb's blood being used to mark the doorpost."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5078.37,"end":5078.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5079.01,"end":5159.07,"speaker":"Fr Stephen De Young","text":"That's the Passover proper. But then that gets wrapped together with sort of the Exodus itself and then the crossing of the Red Sea as sort of one. One collective event. Right. Rather than as a series of events. And so that whole sort of nexus is celebrated at Passover. And we've discussed a whole bunch of different elements of that in various previous episodes of Ideas of the crossing Red Sea, things related to the 10th plague and the death of the firstborn, things related to the creation of Israel. Again, just like with the last half, we're not going to rehearse all those. We're going to touch on a few of those. But there are some other things we want to bring out that maybe we haven't brought out as much in the past that are part of. Part of this current discussion. So we have to start with the relationship between Israel, the person, AKA Jacob, the son of Isaac, the son of Abraham, and the Israelites. Right. And the nation of Israel. Right. That is. That is going to come into existence through this event."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5160.36,"end":5160.6,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5160.84,"end":5196.88,"speaker":"Fr Stephen De Young","text":"And we probably have in our heads this assumption that these are all literally his descendants. So at the end of Genesis, we have these 72 people, Jacob and his extended family, his wives and sons and their wives and kids. Right. And they all go into Egypt and then their biological descendants are then brought out of Egypt as the Israelites. And that's not the case. Right. We've talked about this a little on the show before."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5197.28,"end":5216.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, like, there's so many things that you could point to, but like, one of the obvious ones, for instance, is that there's how many people, including in Moses's own family, I mean, his. His biological family. I don't mean his adopted Egyptian family, that they have pagan Egyptian names."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5216.91,"end":5217.39,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5217.55,"end":5233.23,"speaker":"Fr Andrew Stephen Damick","text":"And it's not just like, you know now where, like, if you meet somebody named, I Don't know. I'm blanking now. You know, if you meet somebody named Aristotle, right? Which, you know, if you meet some Greek Orthodox people, you eventually meet somebody named Aristotle. You know, Aristotle is a pagan. Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5233.39,"end":5236.55,"speaker":"Fr Stephen De Young","text":"Great philosopher. Saint Aristotle. Yes, yes. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5236.55,"end":5238.83,"speaker":"Fr Andrew Stephen Damick","text":"No one's saying, oh, you've got a pagan name, you know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5239.4,"end":5239.6,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5239.6,"end":5244.64,"speaker":"Fr Andrew Stephen Damick","text":"But at that time and place, the names are very religious, right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5244.64,"end":5254.6,"speaker":"Fr Stephen De Young","text":"Moses, sister's name, Miriamne, as it's in the Hebrew is Miriam. It's. It means beloved of Amun."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5255.16,"end":5257.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's. That's an Egyptian God. Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5259.88,"end":5287.45,"speaker":"Fr Stephen De Young","text":"But there's more than that, right? There's. There's a bunch more than that. Levites with Egyptian names. We've gone through this in previous episodes, but Caleb, who's the other faithful spy log with Joshua, who ends up as one of the elders of the tribe of Judah, is a Kenizzite. He's a Canaanite. He's not Israelite at all, ethnically or genetically, to use modern terms."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5287.69,"end":5292.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So probably historically a BAAL worshiper, maybe."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5292.58,"end":5294.1,"speaker":"Fr Stephen De Young","text":"Well, his ancestry at least."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5294.1,"end":5295.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5296.66,"end":5365.01,"speaker":"Fr Stephen De Young","text":"So what we're really talking about is there's a core group of biological descendants of the person Jacob, right? And then there's a whole lot of other people, Egyptians, other Semitic peoples, this mixed multitude, right, that comes out of Egypt, who all become Israel through these events. And the same thing applies, that applies to Israel and the Israelites more broadly applies to the literal sons of Israel, the literal sons of Jacob, Reuben, Simeon, Levi, etc. I can name all 12, but I'm not going to show off. Right. Those people and the tribes that bear their names. Right. Because we just gave an example of Caleb, who's not just a member of the Tribe of Judah, he's an elder of the tribe of Judah, the head of a clan in the tribe of Judah, and is not biologically related to the person Judah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5366.53,"end":5370.21,"speaker":"Fr Andrew Stephen Damick","text":"It's almost like when we let converts become clergy. What's up with that?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5370.37,"end":5477.7,"speaker":"Fr Stephen De Young","text":"Yeah, some of them were only. Chris made it anyway. Yeah. So you get, you get. So there. There is within the tribes, in most cases, a core group of biological descendants, but then other people who have been integrated into the tribe. Right. Because you didn't just become an Israelite in this general, broad sense. Right. We kind of. Because in the modern period, Judaism is both an ethnicity and a religion. Right. There's a danger that we throw that back into the late Bronze Age, right. And think that being an Israelite was like, quote unquote, a religion. Like someone would just Decide, oh, I like the religion of the Israelites. I'm going to worship Yahweh. So I will just go get circumcised and start worshiping Yahweh and do the Passover with my family. And now I'm an Israelite. No, it's not how that worked. You couldn't do that. You literally could not do that to become an Israelite. You became a member of a clan which was a big extended family. And because you're a member of that clan, because you're a member of that family, that clan was part of a tribe. And so you were a member of that tribe and that tribe was a part of Israel, maybe depending on what we're talking about. Right. Or Judah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5477.7,"end":5478.1,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5480.11,"end":5543.78,"speaker":"Fr Stephen De Young","text":"But you had to become a member of a particular family. You couldn't just be an Israelite in a general, vague sense. You could be a Syrian like Naaman and worship Yahweh, the God of Israel. You could do that. You could be an Edomite and worship Yahweh, the God of Israel, but you couldn't just be an Israelite without being a member of a particular family in a particular clan, in a particular tribe. Now, the weird exception to this, the weird exception to there being a core group of. Of biological descendants around which there were some more people who were integrated, is probably Dan. So the tribe of Dan, and we've alluded to this before, but I'm going to go into a little more detail on it now than I have in the past of the show. Some of these things I know are going to flip people's lids. So I ease you into them."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5545.54,"end":5547.18,"speaker":"Fr Andrew Stephen Damick","text":"Be gentle, Father. Be gentle."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5547.18,"end":5547.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5549.06,"end":5550.78,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we could have some Danites listening."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5550.78,"end":5559.7,"speaker":"Fr Stephen De Young","text":"You know, the Danite, we might actually. They're cousins. At least the Danites were one of the sea peoples."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5561.22,"end":5563.09,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5564.21,"end":5647.58,"speaker":"Fr Stephen De Young","text":"And they're the same people as the. The same people group that Homer refers to as the Danae in, like, the Iliad. And so they're a group that migrated from Crete and the nearby islands, like the Philistines, who were, as a group, sort of en masse, integrated into Israel. So they are connected to. Right. The person identified in the Torah as Dan, who was one of the sons of Jacob. But the number of them who had a direct biological connection to that person seems to be very low. Now, you could directly relate this. So if you know anything about at all about Jewish interpretation of the Torah and the Deuteronomistic history in the Old Testament, you know that there's a tendency to describe all of the bad behavior in Israel to the mixed multitude."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5647.58,"end":5647.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5648.14,"end":5671.91,"speaker":"Fr Stephen De Young","text":"To the people who weren't really Israelites. Right. Who are sort of assimilated. They're the ones who did all the bad stuff. I think that's a little convenient in general, but based on what we know archaeologically and stuff about Dan and the way Dan is portrayed in the Old Testament, which is uniformly bad, it kind of checks out in this case."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5672.87,"end":5673.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5674.63,"end":5692.79,"speaker":"Fr Stephen De Young","text":"So they were kind of politically integrated, but never fully culturally integrated into Israel. In our next episode, we're going to trace some more of Dan's history and you'll see this. Right. Sort of right from the beginning, they're setting up shrines to idols and, like, paying Levites to come serve in them and things."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5693.03,"end":5693.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5693.75,"end":5698.51,"speaker":"Fr Stephen De Young","text":"Like, it's not like they fall into idolatry. It's like they just stay in idolatry."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5698.51,"end":5702.55,"speaker":"Fr Andrew Stephen Damick","text":"There's some weird stuff. Weird stuff with Dan in the Book of Judges in particular."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5702.79,"end":5710.07,"speaker":"Fr Stephen De Young","text":"Yes. And they're the farthest point north. Right. So they're up there by Mount Hermon, by Bashan. All the bad stuff."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5710.15,"end":5710.87,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5711.19,"end":5731.68,"speaker":"Fr Stephen De Young","text":"They're right in the middle of it. Yes. Remember the. I think it's the first. Is it the first Sunday of Lent? Those are the region of Zebulun and Naphtali. They don't even mention Dan, but that's the region have seen a great light because that's where Christ starts preaching in Galilee."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5732.64,"end":5733.04,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5735.84,"end":5752.41,"speaker":"Fr Stephen De Young","text":"This is the area we're talking about. Okay. So Dan seems to have been a failure of assimilation, shall we say, later on under Jeroboam. That's not that much later, but Jeroboam sets up one of the golden calves."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5752.41,"end":5752.73,"speaker":"Fr Andrew Stephen Damick","text":"There."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5754.89,"end":5756.45,"speaker":"Fr Stephen De Young","text":"At Dan's in the city of Dan."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5756.45,"end":5758.41,"speaker":"Fr Andrew Stephen Damick","text":"The sin of Jeroboam, son of Nebat."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5758.81,"end":5759.29,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5760.09,"end":5761.93,"speaker":"Fr Andrew Stephen Damick","text":"How do you have to have a sin named after you?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5762.25,"end":5768.17,"speaker":"Fr Stephen De Young","text":"Yes. That's a level of when you're wanting to say someone's evil, he has his name attached to it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5768.33,"end":5771.61,"speaker":"Fr Andrew Stephen Damick","text":"You don't want to be one of these people that's committed a truly original sin."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5771.77,"end":5793.51,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. So Dan is a little bit of a weird case. And they're this mostly, maybe entirely partially assimilated tribe. We'll talk about that more later as we'll talk about later. There's a reason why they get left out of the list of the 12 tribes in the book of Revelation."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5795.83,"end":5796.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5796.31,"end":5803.67,"speaker":"Fr Stephen De Young","text":"They sort of get de. Assimilated. They sort of get pushed back out of Israel, like spit out later on in the. In the Bible."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5806.47,"end":5806.87,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5807.11,"end":5847.31,"speaker":"Fr Stephen De Young","text":"But yeah. So there Were some Greeks around? That's the good part. Greeks. Bad part is they were kind of the worst. So do with that what you will. But so this the purpose of the Passover, remember? And by the Passover here, I'm talking about the Passover proper, right? The marking the doorposts with the blood of the lamb. God says he's doing it to make a distinction between Israel and the Egyptians."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5848.99,"end":5860.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because. And he wouldn't say that if they're really wasn't one. Like, I mean, on some level. Yes, but. But this is the distinction, Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5860.93,"end":5865.17,"speaker":"Fr Stephen De Young","text":"So he had been making a kind of distinction like that before."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5865.57,"end":5865.97,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":5866.13,"end":6023.8,"speaker":"Fr Stephen De Young","text":"Because the preceding plagues, Israel is there in the land of Goshen. Right. And so several of the preceding plagues fell on the rest of Egypt and not on that land. Right. So there was already a distinction there, right, where Egypt was the recipient of the plagues, not Israel. Egypt was the recipient of God's wrath, not Israel. Right. Meaning Israel would not need any kind of substitute to take God's wrath, because God's wrath was not against Israel. Okay? So, Billy Gabbins, there's already a kind of distinction, right? But that kind of distinction, right, is imprecise because you could be the paganist of pagan Egyptians and just happen to live in Goshen. And because your neighbors are Israelites, you luck out, right? You don't have the darkness, you don't have the frogs. Right. Or an Israelite who wasn't living in the land of Goshen with the rest of his people might have been getting hit by stuff, right? It's imprecise, right? And so what God means when he says he's going to make a distinction is he's going to be drawing the borders. He's going to draw the borders of the boundaries of the people of Israel that night based on who puts the blood on their doorpost. Anyone who puts the blood on the door post is now an Israelite. Doesn't matter who their dad, grandpa, great grandpa on who they were, doesn't matter the color of their skin, doesn't matter how much of their body is shaved in the case of the Egyptians. Right? Doesn't matter. You're now an Israelite. Boom. And it doesn't matter if you have the genealogical paperwork to show that you're descended directly from Abraham through Jacob, if you disobey and you don't put that blood on your doorpost, you are an Egyptian. Now, as far as God is concerned, you are not an Israelite. So that ritual, the Passover eating The Passover together and marking the doorpost that draws the boundaries of the nation of Israel. The edges right there. And that's what's going on in that ritual. I'm not going to belabor this as much as I want to, but again, there is no substitution, let alone penal substitution in this ritual."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6024.44,"end":6024.96,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6024.96,"end":6029.96,"speaker":"Fr Stephen De Young","text":"The wrath of God is not against the children of Israel. The children of Israel have already been murdered by the Egyptians."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6030.2,"end":6037.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They don't. God's not saying, look, I'm going to kill your firstborn unless you offer me a lamb."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6038.61,"end":6045.17,"speaker":"Fr Stephen De Young","text":"Yes. I really want to kill all the firstborn in this whole country, regardless."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6047.17,"end":6048.85,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, no, the point."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6048.85,"end":6051.89,"speaker":"Fr Stephen De Young","text":"I'll tip you off. How to do a ritual to appease me."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6052.05,"end":6052.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6052.49,"end":6053.97,"speaker":"Fr Stephen De Young","text":"So that yours won't die."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6053.97,"end":6056.45,"speaker":"Fr Andrew Stephen Damick","text":"It's. Who is Israel? That's what's going on."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6056.45,"end":6056.73,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6056.73,"end":6057.21,"speaker":"Fr Andrew Stephen Damick","text":"Who is it?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6057.21,"end":6068.46,"speaker":"Fr Stephen De Young","text":"That's what's. That's what's going on. That makes no sense. And as we've talked about before on the show, it's not like if you only had daughters, you didn't have to do it. Right?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6069.18,"end":6069.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6069.9,"end":6079.1,"speaker":"Fr Stephen De Young","text":"If your household had more than one first. If your. If your granddad and dad and son were all firstborn sons, you didn't do three lambs. Okay. There's just substitution doesn't work."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6079.66,"end":6080.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6080.1,"end":6105.99,"speaker":"Fr Stephen De Young","text":"In the way it was done. Okay. Let alone penal substitution. But anyway, moving on. That. I wish that horse was dead. Someday that psa horse will die and I will no longer have to beat it. But, yes, this is forming the boundaries of Israel. And so then newborn Israel shares this experience together of passing through the sea."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6107.27,"end":6107.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6107.59,"end":6178.99,"speaker":"Fr Stephen De Young","text":"And you can see our previous episode on this where we talked about the Sea of Reeds in Egyptian myth. Right. In Egyptian stories, how the Sea of Reeds passing through the Sea of Reeds was about passing through death itself, passing through the underworld. Right. Safely. But they share this experience. And so they are born in water. Right. As St. Paul is going to say later, they were baptized into Moses. Right. They're born in water. Right Here, newborn Israel is born in water. Previous to that, when God made the distinction, when God set the borders, it was through the blood of the lamb that was put on the doorpost. So newborn Israel, like all newborn babies, is born in water and blood. But that water and blood thing might come up again later. So pin in that for a later episode of this series if your brain isn't going there already. And so the newborn Israel, the newly formed Israel, is bound together by this event."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6180.43,"end":6181.07,"speaker":"Thomas","text":"Okay?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6181.71,"end":6316.05,"speaker":"Fr Stephen De Young","text":"So remember in the first half we were talking about how there are these parallels made between the other Abrahamite nations in Israel, these patterns that are the same patterns of treatment, relationship to God, that are fundamentally the same. This is a point that separates Israel from the other Abrahamite nations. Not the only one, but this is the first one we're going to talk about that we're talking about in this half. And that point is that Israel is a nation that is constituted by this particular shared experience. And that is so true that what is going to constitute Israel in future generations is participation in celebrating the Passover. Each generation is going to ritually experience this event when they put on the clothes, when they serve the meal, when they say, this is the night that God delivered us from Egypt. Not, this is the anniversary. Not, this is when God delivered our ancestors. This night, right now is the night that God delivered us from Egypt. So Israel is an entity constituted by shared participation in this event. The other Abrahamite groups do not have a parallel. There is not a shared event that the Edomites experience. Yeah, right. The Edomites have a culture, religion, language, stories, history, all of these things that bind them together as a nation. Same thing with the Moabites, the Ammonites, these other Abrahamite groups, the Midianite tribes, all have those things right, and Israel is going to have those things right. But at the core, what constitutes Israel is participation in this. This experience which none of the other Abrahamite groups share."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6317.25,"end":6327.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep, yep. All right, well, that wraps up this second half of this episode. Lord of Spirits. We'll be back with a third half in just a minute."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6327.97,"end":6344.22,"speaker":"Announcer","text":"Father Andrew, Stephen Dick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6349.26,"end":6358.62,"speaker":"Fr Andrew Stephen Damick","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6359.1,"end":6365.2,"speaker":"Announcer","text":"But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6365.52,"end":6371.28,"speaker":"Fr Andrew Stephen Damick","text":"In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6371.28,"end":6374.16,"speaker":"Announcer","text":"Paul's life and writings, interpreting them within."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6374.16,"end":6376.88,"speaker":"Fr Andrew Stephen Damick","text":"The holy tradition of the Orthodox Church."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6377.04,"end":6379.48,"speaker":"Announcer","text":"This survey is followed by De Young's."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6379.48,"end":6382.4,"speaker":"Fr Andrew Stephen Damick","text":"Interpretive translation of St. Paul's epistles, which."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6382.4,"end":6385.28,"speaker":"Announcer","text":"Deliberately avoids overly familiar terminology."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6386,"end":6405.14,"speaker":"Fr Andrew Stephen Damick","text":"By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancient faith.com Again, that is store.ancient faith.com."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6405.86,"end":6421.89,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6424.53,"end":6438.69,"speaker":"Fr Andrew Stephen Damick","text":"You've wasted another perfectly good hour and 47 minutes of your life listening to the Lord of Spirits podcast. But we're still here. I can't believe it's not even 9 o' clock here on the eastern east coast. And we're into the third half. How did that happen?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6440.7,"end":6441.5,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6441.9,"end":6442.7,"speaker":"Fr Andrew Stephen Damick","text":"I don't know either."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6442.94,"end":6445.02,"speaker":"Fr Stephen De Young","text":"This is supposed to be a one hour show, my friend."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6445.5,"end":6451.34,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Oh, 2020. We were so young and innocent."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6452.78,"end":6457.02,"speaker":"Fr Stephen De Young","text":"I never actually agreed to that, but I rarely agree to anything. I'm disagreeable."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6459.26,"end":6494.9,"speaker":"Fr Andrew Stephen Damick","text":"I agree with that. Yes, we are talking about Israel. And remember everybody, this is going to be at least a three episode arc. So lots more to come. We've already had some, some great calls, some great questions. A lot going on in, in the chat on YouTube right now. It's funny actually. Somebody commented on Facebook, they're like, man, where's all this chat happening? And the truth is, is like Facebook right now, right this moment, it says that eight people are tuning in via Facebook. And now I'm clicking over. There's 183 currently live on, on the YouTube."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6494.9,"end":6497.28,"speaker":"Fr Stephen De Young","text":"So on the tubes, obviously we could."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6497.28,"end":6500.04,"speaker":"Fr Andrew Stephen Damick","text":"See that the YouTubes is where the popular kids are."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6501.56,"end":6503.76,"speaker":"Fr Stephen De Young","text":"So the kids under 60 at least."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6503.76,"end":6520.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, and we had a, we had a request, by the way, I don't think you're gonna take this one seriously. I don't know. But we had a request in the YouTube's chat that we, we have a, a Mormon listener who wants a whole sorry Mormons episode. And someone responded. It'll just be two and a half hours of you and me drinking coffee."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6522.13,"end":6528.21,"speaker":"Fr Stephen De Young","text":"I drink coffee throughout every episode. So does that make them all sorry Mormons. Sorry Mormons. I had tea."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6528.21,"end":6530.05,"speaker":"Fr Andrew Stephen Damick","text":"I'm having tea. Earl Grey, hot actually."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6531.49,"end":6536.05,"speaker":"Fr Stephen De Young","text":"So I think I did do a Sorry Mormons the time we talked about baptism for the dead."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6536.53,"end":6538.53,"speaker":"Fr Andrew Stephen Damick","text":"Oh yes, that seems likely."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6538.93,"end":6539.97,"speaker":"Fr Stephen De Young","text":"I think I did."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6540.61,"end":6558.7,"speaker":"Fr Andrew Stephen Damick","text":"That seems likely. So yeah, yeah. Well, the Mormon we have is so nice in the chat I'm gonna actually tell the story. Even though this is not totally relevant to this episode. I'm gonna tell the story that I promised I would tell. So do you mind, Father Stephen, if I tell A little anecdote."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6558.78,"end":6560.14,"speaker":"Fr Stephen De Young","text":"Feel free. I could use a nap."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6560.38,"end":6793.06,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right. Go rest for a little while. I mean, you monologue way too much on this show as it is. So there was. I've been to many, many Mormon historical sites. I'm just sort of like, I don't know, I'm interested in Mormonism as a religious movement. It's. It's interesting to me. And I'm also interested just in religious history in general, and especially American religious history. So I've been to lots and lots of Mormon historical sites. And as I actually said in the chat, when I'm talking with some of the local LDS missionaries, when I go to these sites, often I'll tell them, you know, I've been to this place and this place and this place and this place. And usually, like, they. Their. Their face lights up. Because often, I mean, obviously, it's usually these young people, and they'll say, wow, number one, they'll say, you are so blessed. You know, because they're a little. Often they're a little bit envious because they haven't been to many of those places. And then the next thing I can tell, because I can watch the thought coming into their eyes, is the next thing they say, they think. They're thinking is, this guy wants to become a Mormon. And then they just start trying to put their moves on me, which, you know, I respect that. I respect that. I appreciate that. They love their things so much. They want me to be a part of it. That's cool. Okay, so here's my anecdote. So. So there was one time that we were visiting one of these sites. I think it was. I think it was the Liberty Jail. I think it was the Liberty Jail. And. And Mormon listeners, you guys know exactly where I'm talking about. You have all these places memorized. You know exactly where they're on the map. We were at the Liberty Jail, and I was traveling through the region with my family, and we were passing right by this one spot, and I said to my wife, hey, can we stop so I could check this place out? And, you know, father, you've met my wife. You can imagine her response, right? It was like, oh, you know, you could hear her eyes roll into the back of her head. My husband wants to stop. That's yet another historical site or whatever. And she's like, yeah, fine, fine. And it was hot. So I go in, I said, okay, I'm going to go take the tour. I want to take the tour. And I think maybe one of my Kids went with me. I'm not sure, but she said, okay, well, I and the other kids, we're going to stay. And we have four kids. We're going to stay in the lobby while you go take your tour. Right. So she's being very patient and loving and kind with her husband. And so I go off taking the tour and I'm getting all the lowdown on the Mormon history that happened there. You know, Joseph Smith being held there at the Liberty Jail for a while. Little do I know. And my wife tells me this story when I came out and my kids were really, like, enthusiastic as she told this story too. So she tells me that as I was in there taking the tour that a couple of Mormon missionaries approach her and the kids and they want to show like Mormon cartoons to my children. And at that point, my wife, at that moment, she began to, as she refers to it, she got Lebanese. Now she is, you know, not to confuse people, but you can be both Palestinian and Lebanese at the same time. She is. And. And she says to them, as they're trying to show these cartoons to my kids, she says, my husband is an orthodox Christian priest. We are all orthodox Christians. We are only here so he can take your tour. We intend to stay orthodox for the rest of our lives. Thank you. And apparently these nice young people just suddenly, like, backed away from her because they were not ready for Palestinian, Lebanese woman in her full. Her full fury."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6793.22,"end":6794.66,"speaker":"Fr Stephen De Young","text":"Caffeine will do that to you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6796.1,"end":6809.86,"speaker":"Fr Andrew Stephen Damick","text":"That's what it is. It's all that Arabic coffee. So anyway, so there you go, Daniel, in the chat. Yes, he's very enthusiastic that I was at the Liberty Jail."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6809.86,"end":6813.18,"speaker":"Fr Stephen De Young","text":"Yeah, in the proverbial lion's den of our church."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6813.18,"end":6840.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed, indeed. I've also been to the Carthage jail, Daniel. I've been. I mean, I'm not going to list them all off, but I've even been to Adam on the Amen, which is right in that same region actually, too. So. So there we are. There we are. Not relevant to this episode, but a shout out for our lovely, faithful LDS listeners. God bless you guys for listening to this show."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6842.36,"end":6846.6,"speaker":"Fr Stephen De Young","text":"I see some people can listen to people, disagree with them and not lose their minds."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6847,"end":6859.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, that is true. That is true. So, okay, so we. We just left off with Israel being newly formed, they're going to take a bit of a journey."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6859.68,"end":6860.68,"speaker":"Fr Stephen De Young","text":"No calls, huh?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6863.32,"end":6865.6,"speaker":"Fr Andrew Stephen Damick","text":"No, there's currently no calls on the board, so."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6865.6,"end":6866,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6866,"end":6869.64,"speaker":"Fr Andrew Stephen Damick","text":"I don't. We'll see if anybody comes in. Maybe we scared them all. Scared them all off. I don't know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6869.64,"end":6871.16,"speaker":"Fr Stephen De Young","text":"People need to step up their phone game."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6871.16,"end":6878.62,"speaker":"Fr Andrew Stephen Damick","text":"I'll see if anything comes in and we'll see. See what happens. But it's got to be on topic, people. You can't just randomly throw whatever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6878.86,"end":6879.22,"speaker":"Thomas","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6879.22,"end":6880.22,"speaker":"Fr Andrew Stephen Damick","text":"It's got to be connected."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6880.3,"end":6883.82,"speaker":"Fr Stephen De Young","text":"Yeah. No, that has to wait for my Twitch stream. My Twitch stream. You can throw whatever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6883.82,"end":6885.9,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's what the Twitch stream is for."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6885.9,"end":6888.54,"speaker":"Fr Stephen De Young","text":"You can literally Zoomer movie recommendations."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6888.62,"end":6895.7,"speaker":"Fr Andrew Stephen Damick","text":"Father Stephen, what he feeds his heathen dogs or whatever, you know, plans for the shelf. Ziggurat. In the kitchen. Whatever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6895.7,"end":6897.94,"speaker":"Fr Stephen De Young","text":"Not in the kitchen. It's in the library in the kitchen."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6897.94,"end":6899.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, excuse me. Whatever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6904.95,"end":6912.87,"speaker":"Fr Stephen De Young","text":"So, yeah, we. We now, we were between the rivers, we went to the sea, now we are in the mountains."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6913.11,"end":6916.23,"speaker":"Fr Andrew Stephen Damick","text":"That's right, mountain."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6916.47,"end":6923.47,"speaker":"Fr Stephen De Young","text":"Specifically Mount Sinai. No, we're not going to talk about where that is ever."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6923.47,"end":6925.19,"speaker":"Fr Andrew Stephen Damick","text":"Go tell it. Go tell it. On the mountain."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6925.51,"end":6936.21,"speaker":"Fr Stephen De Young","text":"But so we talked about the first Pascha. Now we're going to talk about the first Pentecost. Almost like we're between the two right now."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6937.89,"end":6938.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6939.25,"end":6958.38,"speaker":"Fr Stephen De Young","text":"And the first Pentecost, of course, is when the Torah was given to Moses at Sinai. Right? God gives the Torah to Moses at Sinai. That's one plank of Judaism we all agree with, I hope. If not, sorry, Marcionites, but."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6961.26,"end":6965.66,"speaker":"Fr Andrew Stephen Damick","text":"If you are a Marcionite, you probably don't want to call in. It's not going to go well for you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":6969.9,"end":7016.16,"speaker":"Fr Stephen De Young","text":"Now, obviously, we've talked a lot about the Torah. We have series just on the Torah. We've had bunch of other episodes. We've even had stuff like we talked Book of Jubilees. We did an episode on about the giving of the Torah to Moses in particular. But now we're talking about it tonight, specifically vis a vis. Again, this. This through line that we've been following tonight. Right? And so the Torah, right, Among all the other things we've talked about the Torah doing, the Torah sets out and defines what Israel should be. This newborn Israel. Yeah, this newborn nation that just came into existence."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7016.72,"end":7017.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7018.56,"end":7248.84,"speaker":"Fr Stephen De Young","text":"So right now, as we said at the end of the last half, unlike the Edomites or the Moabites or the Ammonites. Right. Just talking about the other Abrahamites, not the other nations world. They don't have a shared history yet. They were just born. They don't have a shared culture yet. They're just born. They don't have a shared language even yet. They're just born. All of that is going to develop as they live their lives together as A nation. And the Torah, one of its purposes is to set the trajectory for that, to give the shape of. Here is what the nation of Israel should look like in all of its dimensions. Because the Torah covers the economic life of Israel, the dress, diet, right. Farming practices, commerce, the whole shebang. Right. Political structures, all of it. Right. And so all that's described. And so this is why when later on, Torah got translated into Greek as nomosis, this was the perspective from which they adopted that translation. Because as we've talked about before on the show, nomos in Greek is talking about the whole way of life of a people. Right? So the, from a Greek perspective, the Torah was to be the nomos of the Israelite people. It was to be. It sets out what was to be their, their way of life. Right. And again, this is not something that happened with the other Abrahamite groups. Right. Edom was not given the Torah or a Torah of its own. Right. Moab was not given the Torah or a Torah of its own. Certainly this doesn't happen to the gentiles proper. The 70 nations, right. Aren't given the Torah. So the giving of the Torah is unique to Israel among Abrahamites, let alone among nations. And the reason that Israel alone is given the Torah is that Israel, as we talked about in the Israel I choose you episode, the election episode, Israel is chosen. But what it means to be chosen is to be chosen for a particular purpose, to play a particular role. Yeah, yeah, particular role vis a vis the nations and also vis a vis the other Abrahamite nations. Their relationship to the other Abrahamite nations was not to be exactly identical as we saw in Deuteronomy, as their relationship to the pagan nations, the Gentile nations, but they're to play this role. And so the way of life that's set out in the Torah is the way of life that Israel would need to follow in order to accomplish that task to which she was called, in order to play the role that she was created to play in relationship to those other nations, Abrahamite and otherwise. And if Israel did not, as spoilers, they did not keep Torah, then they would fail to fulfill that role."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7250.16,"end":7256.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it seems like there are some times when some aspects of the Torah are being kept by some people."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7258.8,"end":7278.03,"speaker":"Fr Stephen De Young","text":"But yes, there's always a faithful remnant. There's always some. Right. But as a whole, as a community. Right. See, we modern people, we come at this individualistically. Right. Well, which people were. Well, the problem is the collective wasn't."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7280.83,"end":7281.23,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7281.55,"end":7285.63,"speaker":"Fr Stephen De Young","text":"You'll notice the prophets of the old Testament never take that individualist approach."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7287.23,"end":7287.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7288.19,"end":7303.55,"speaker":"Fr Stephen De Young","text":"They're never like, you know. Well, let me be clear. I'm generalizing. Not literally every one of you is wicked. Like, there's this one guy here who doesn't engage in extortion. But I mean, it's 97% of you are bad people. Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7303.79,"end":7305.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Gary here is doing very well."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7305.95,"end":7365.17,"speaker":"Fr Stephen De Young","text":"Yeah. Like, not you, Gary. Gary, you're fine. Yeah. Like, God's not mad at you, Gary. Because guess what? When the exile happens, Gary's going to Babylon too. Right? We don't like to think that way. In fact, we think that's generally unfair. People be dealt with as collectives is unfair. Right. But that's the reality. That's how these things are thought about. And we've made the point, right, that obviously Israel was never called upon to sort of enforce the Torah on the Gentile nations. Right. There was never. You need to go invade Tyre and Sidon and make them stop eating pigs or stop wearing mixed fabrics. They weren't even supposed to go invade and try and stop them from committing idolatry by force."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7365.97,"end":7369.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is like sin number one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7370.37,"end":7392.48,"speaker":"Fr Stephen De Young","text":"Yes. Or sexual immorality. If they came to visit, they couldn't do it inside Israel. Right. But they were never called to invade and try to enforce the Torah on anybody else. Right. But it's worth noting here in terms of what we talked about back in the first half, that they were also not called to enforce it or even share it with the other Abrahamites."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7394.8,"end":7395.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7396,"end":7401.68,"speaker":"Fr Stephen De Young","text":"Jethro, even Moses, father in law, does not become an Israelite."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7403.04,"end":7404.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, he hangs around with them for a while."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7405.28,"end":7424.57,"speaker":"Fr Stephen De Young","text":"He comes and visits several times over the course of the Torah, but he doesn't become one. He's still a Midianite. Right. And God doesn't tell them there in Deuteronomy, by the way. Share all that, I told you, at Sinai with the Edomites on your way through. Or the Moabites. They need to do these things too."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7429.53,"end":7429.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7430.73,"end":7435.77,"speaker":"Fr Stephen De Young","text":"It was perfectly fine for them to worship Yahweh."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7436.41,"end":7436.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7437.7,"end":7478.51,"speaker":"Fr Stephen De Young","text":"And to not commit sexual immorality. They didn't have to follow the other stuff because that other stuff was given as commandments to Israel in particular, not just over against the Gentiles, but over against even other Abrahamites. This is an exclusive thing just to the Israelites. Now, this opens a question that's going to sound like a silly question at first, but we got to pause and think about it in a second. So did ancient Israel ever really exist? Sounds like a Silly question at first."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7478.75,"end":7479.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7479.55,"end":7493.4,"speaker":"Fr Stephen De Young","text":"Because even your most skeptical Old Testament scholar in the world, and there's plenty of them to choose from, is going to agree that at some point there'll be a different. But at some point there was an ancient Israel."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7494.2,"end":7497.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's some stuff they found in the ground."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7497.88,"end":7501.84,"speaker":"Fr Stephen De Young","text":"Yes. Archaeologically, at some point there's an ancient."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7501.84,"end":7504.12,"speaker":"Fr Andrew Stephen Damick","text":"Israel and there's records. There's records."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7506.44,"end":7526.31,"speaker":"Fr Stephen De Young","text":"So historically, yes, obviously there was an ancient nation of Israel. But if what we mean by that question, did ancient Israel exist is did the nation described in the Torah prescriptively ever actually come into existence in this world?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7526.87,"end":7529.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Was anyone actually living that way?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7530.39,"end":7535.19,"speaker":"Fr Stephen De Young","text":"Not any individual. Did anyone collectively live that way ever?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7535.59,"end":7537.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7538.23,"end":7541.75,"speaker":"Fr Stephen De Young","text":"Right. Not was anyone faithful to God of the ancient world? That's a yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7542.35,"end":7542.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7542.75,"end":7549.47,"speaker":"Fr Stephen De Young","text":"Was there an ancient Israel that looked like the Israel described in the Torah? The answer is pretty much no."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7550.51,"end":7566.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why it's dangerous when people will sometimes, and I think they mostly carelessly say this or they didn't think it through or whatever. I don't know. But let's say this is what ancient Israel did and they'll just cite some verse from Leviticus. It's like, well, okay, that's what God told them to do."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7567.07,"end":7572.28,"speaker":"Fr Stephen De Young","text":"Yes. That's what they were supposed to do. Yes. But we could give examples."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7572.76,"end":7573.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7573.08,"end":7583,"speaker":"Fr Stephen De Young","text":"We know from the book of Jeremiah that they never practice the Sabbath year. And if they never practice the Sabbath year, that means they never practice the jubilee year."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7583.88,"end":7587.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which would have been transformative for a society."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7587.64,"end":7588.12,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7589.32,"end":7589.8,"speaker":"Fr Andrew Stephen Damick","text":"Huge."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7590.68,"end":7619.91,"speaker":"Fr Stephen De Young","text":"But never happened. Okay. God tells us in scripture, in Jeremiah, God says to the Israelites through Jeremiah, you never celebrated it. You've been in the land 490 years. You owe me 70 years. I'm sending you into exile for 70 years. It's pretty clear cut, Right? So that never happened. Which means the economic life as it touches on things like slavery."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7621.84,"end":7622.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7622.64,"end":7630.72,"speaker":"Fr Stephen De Young","text":"And debt and ownership of the land. Right. None of that was the way it was supposed to be. According to the Torah. We know."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7631.36,"end":7632,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7632.96,"end":7644.16,"speaker":"Fr Stephen De Young","text":"When King Josiah comes along, he burns the chariot of the Sun God that Solomon put in the temple courts. Meaning idolatry was going on the whole time."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7644.48,"end":7647.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Shemesh worship. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7647.33,"end":7667.01,"speaker":"Fr Stephen De Young","text":"Idolatry was going on the whole time. So there was never a period of time in ancient Israel's history where they were collectively. Again, collectively. I'm not talking about individuals collectively, all worshiping no God, but Yahweh."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7669.01,"end":7669.41,"speaker":"Fr Andrew Stephen Damick","text":"Which is."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7669.41,"end":7672.41,"speaker":"Fr Stephen De Young","text":"Why you write off the whole history of the Northern Kingdom right off the bat."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7672.41,"end":7705.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yeah. I mean, they're the worst. The sin of Jeroboam, sin of Nabat. I mean, which is why it's so goofy. I mean, we've said this a bunch of times, but I think it's worth saying at this point, again, which is why it's so goofy when you get some modern biblical scholars who will say things like, well, you know, the Bible claims Israel was quote unquote, monotheist, but all these archaeological finds show that they were worshiping these other gods. And once again, it's like, okay, have you read the Bible? Because it agrees with that, says that they did that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7706.09,"end":7714.57,"speaker":"Fr Stephen De Young","text":"The answer to that is no. They've never just sat down and read it. They're all chopping it up and doing things with it. Yeah, they don't just read it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7714.65,"end":7715.53,"speaker":"Fr Andrew Stephen Damick","text":"Dissected."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7716.81,"end":7718.57,"speaker":"Fr Stephen De Young","text":"When you dissect something, you kill it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7720.73,"end":7721.77,"speaker":"Fr Andrew Stephen Damick","text":"It's very pithy."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7722.41,"end":7758.05,"speaker":"Fr Stephen De Young","text":"But I'm renowned for my pith, mostly my pith helmet that I wear inappropriate times and vinegar. But I will go no further down that road. So, yeah, so none of that happened. And also, yeah, as Father Andrew points out with that archaeology, it's important to remember, once again, the question is not what did Israel do? The question is, what was Israel supposed to do in terms of what Israel did? You could do archaeology."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7759.25,"end":7759.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7760.03,"end":7780.83,"speaker":"Fr Stephen De Young","text":"And guess what, what the Bible says Israel did, the wickedness, the sin, the idolatry, all that stuff is borne out by the archaeology. But if the question is what was Israel supposed to do, Archaeology can't help you with that. Yeah, archaeology can't tell you if what they did was right or wrong."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7781.79,"end":7782.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7782.15,"end":7783.23,"speaker":"Fr Stephen De Young","text":"It's for good or bad."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7783.55,"end":7785.59,"speaker":"Fr Andrew Stephen Damick","text":"These are some artifacts of things that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7785.59,"end":7793.04,"speaker":"Fr Stephen De Young","text":"They did or things that are good or evil. Right. So archaeology is not the right tool for that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7793.44,"end":7793.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7794.16,"end":7832.57,"speaker":"Fr Stephen De Young","text":"You're trying to use science to do something science isn't made for. Right. Yeah, but so the picture of Israel that we're given this is important in the Torah is not something that ever really came to exist in the real world. It was an idea, it was a goal. Right. It was what the faithful Israelites were striving for and trying to create within their families and sub communities within Israel and Judah. But it was never actually there."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7834.97,"end":7835.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7835.77,"end":7864.42,"speaker":"Fr Stephen De Young","text":"It never actually arrived there. This is really important to remember when we get to, say, St. Paul talking about things that the Torah was powerless to do, not because there was something wrong with the Torah, but because there was something wrong with people. Right. This is important to remember this is what he was talking about."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7866.16,"end":7866.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7868.08,"end":7898.21,"speaker":"Fr Stephen De Young","text":"He's not talking about it's impossible to follow the Torah. The Torah would get. Following the Torah perfectly, would get you to heaven, would earn you salvation, but people just can't do it. That's not what he's talking about at all. He's talking about, yes, the Torah is beautiful and perfect and he loved it. And the people of Israel historically tried to do it, and they failed miserably. And that failure is not the fault of the Torah. That failure is the fault of the people."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7901.01,"end":7901.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7901.49,"end":7957.42,"speaker":"Fr Stephen De Young","text":"That's what he's talking about. So that isn't a thing that existed. So when we talk about the. Why are we talking about this in this context? When we talk about the Torah, receiving the Torah through Moses from God being a defining feature of Israel, we're talking about receiving it being a defining feature, not keeping it perfectly being a defining feature, because that didn't happen. Very important category for understanding this series is moving toward talking about how St. Paul. I mean, spoilers, but how St. Paul talks about Israel. So this is crucially important. The people who received the Torah, receiving the Torah is not nothing."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7958.78,"end":7959.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7959.22,"end":7966.94,"speaker":"Fr Stephen De Young","text":"It's something. But receiving it and not keeping it. You can see already there's a problem there right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7971.75,"end":7971.87,"speaker":"Fr Andrew Stephen Damick","text":"Now."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7971.87,"end":7987.19,"speaker":"Fr Stephen De Young","text":"Another note tying this back into something we talked about with the promises of Abraham. The Torah, of course, includes blessings and curses. We talked about this a little bit last time we were talking about the curse of the law. The curse of the Torah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7987.19,"end":7990.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well. And we had a whole episode called blessings and curses."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7990.71,"end":7991.11,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7991.75,"end":7992.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":7993.04,"end":8002.8,"speaker":"Fr Stephen De Young","text":"But it's worth noting here again, in terms of what we're talking about, that the blessings and curses, whether you're talking about Leviticus, chapter 26, or you're talking about Deuteronomy, chapters 28, 30."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8003.84,"end":8004.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8004.24,"end":8038.33,"speaker":"Fr Stephen De Young","text":"In those chapters, the blessings and curses all have to do with the land as a sign. Right. Meaning the Torah is very deliberately not aimed at that ultimate fulfillment. The Torah does not set itself out as a means by which humans become like the stars of heaven."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8040.25,"end":8044.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It doesn't. It doesn't say that you can achieve that by doing these things."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8045.42,"end":8057.34,"speaker":"Fr Stephen De Young","text":"Yes. At all. And in fact, that doesn't make sense for any number of reasons, but one of them being God is not only the God of Israel, he's the God of the whole world."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8058.94,"end":8060.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, so if you had."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8060.74,"end":8069.26,"speaker":"Fr Stephen De Young","text":"To do those things to inherit eternal life, that would mean no one could inherit eternal life except for tiny group of faithful Jews."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8070.47,"end":8093.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And this is another. This is another thing that's a big Problem with dispensationalism is there's this idea that the Torah system is the means by which Israel, although usually it's. It's described as Jewish people. But hey, everybody, Jewish and Israel are not synonyms."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8095.43,"end":8095.91,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8098.36,"end":8119.92,"speaker":"Fr Andrew Stephen Damick","text":"But it's the idea that the Torah is the system by which Jewish people can be saved. But it never says that. It never says that. Even though this is like, this is again, another foundation stone of dispensationalism. You know, the idea that there's this system of salvation that exists at one."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8119.92,"end":8125.98,"speaker":"Fr Stephen De Young","text":"Point is the foundation stone of most probably Protestantism, that if you kept the Torah perfectly, you would earn salvation."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8126.3,"end":8127.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8127.18,"end":8128.38,"speaker":"Fr Stephen De Young","text":"You would earn eternal life."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8128.78,"end":8129.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8129.14,"end":8133.74,"speaker":"Fr Stephen De Young","text":"But it literally has made this extra move of, well, only if you're Jewish."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8135.02,"end":8144.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, but. But it literally does not. It just. It's not an interpretive thing, everybody. It simply does not say that anywhere in the Scriptures."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8144.86,"end":8147.58,"speaker":"Fr Stephen De Young","text":"Yes. And Jewish people don't believe that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8148.79,"end":8149.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8152.55,"end":8156.87,"speaker":"Fr Stephen De Young","text":"I think some of the early dispensationalists thought. Jewish people believed that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8157.75,"end":8163.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they thought that Judaism is like Christianity. I mean, these are the people that basically."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8163.83,"end":8168.23,"speaker":"Fr Stephen De Young","text":"No, they think Judaism is the way Luther. Martin Luther presented it in the 16th century."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8168.23,"end":8171.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, this is."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8171.19,"end":8173.51,"speaker":"Fr Stephen De Young","text":"He's not an expert on Judaism, shall we say."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8173.59,"end":8174.81,"speaker":"Fr Andrew Stephen Damick","text":"No, Martin Luther. Mean, this is."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8174.81,"end":8176.25,"speaker":"Fr Stephen De Young","text":"Or even a pathetic reader."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8176.65,"end":8193.53,"speaker":"Fr Andrew Stephen Damick","text":"This is the basis on which everybody, you know, a lot of people say things like, well, every. Every religion, you know, is trying to find salvation in. With its own ways. It's like. Well, actually, no. In fact, not every religion is looking for something called salvation. And those that are. Might define it very differently."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8194.17,"end":8194.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8194.57,"end":8210.02,"speaker":"Fr Andrew Stephen Damick","text":"You know, like, if you are a Hindu yogin and you're seeking salvation, then what you're trying to do is to escape from individuality and be absorbed into Brahman. That's what salvation is in that context."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8211.38,"end":8211.86,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8212.18,"end":8215.14,"speaker":"Fr Andrew Stephen Damick","text":"It's not the same goal as Christianity at all."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8215.38,"end":8225.38,"speaker":"Fr Stephen De Young","text":"So this, again, this is not. Go and find an Orthodox Jew, ask them, do you believe that if you keep the Torah perfectly, you will have earned eternal life in heaven?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8225.8,"end":8226.04,"speaker":"Fr Andrew Stephen Damick","text":"Or."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8226.6,"end":8237.48,"speaker":"Fr Stephen De Young","text":"That's not even Christianity. But they don't believe in that or the resurrection or the new heavens of the new earth, that none of that's not a thing because it's not there in the text."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8238.76,"end":8240.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8240.36,"end":8270.82,"speaker":"Fr Stephen De Young","text":"This is a. This is a weird concoction of Martin Luther, right, where he basically tried to turn the Pharisees of the first century into the Roman Catholics he was dealing with in Germany in the 16th century. And a caricature of them at that. That's not. It's just not a thing, folks. All of those blessed curses have to do with the land as a sign. So your life will be long in the land that the Lord your God has given to you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8272.1,"end":8272.5,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8275.14,"end":8276.74,"speaker":"Fr Stephen De Young","text":"So that being the case."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8278.58,"end":8278.98,"speaker":"Thomas","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8279.06,"end":8430.65,"speaker":"Fr Stephen De Young","text":"That being the case, there are these promises to Abraham, second Temple period, probably before that. But I mean, we only have texts and documents from the second Temple period. Second Temple period. The Jewish readers of the scriptures are aware of this, Right? They're aware that just, you know, perfectly keeping the Torah doesn't get you there. And it doesn't have anything to do with that. So how is that final tier, how is that final sort of valence of the promises to Abraham, kind of like the stars? How is that going to be fulfilled? And so you get the beginning of a sequence of ideas emerging in the latter part of the Hebrew scriptures, the latter part of the Christian Old Testament ideas of the Messiah once David is around to sort of set the benchmark for what a Messiah looks like. We'll talk about that more in the next episode when we're talking about the history of Israel proper, the idea of the resurrection. See Daniel 12, verse 3, right. Where it talks about the righteous shining like stars in the resurrection. The idea of the end of days, or the day of Yahweh, the day of the Lord. Right. And all of that, all of those ideas are all interrelated together in the idea that God is going to eventually intervene in the world, the whole world for Israel, for the other Abrahamites, for the Gentiles, God is going to intervene in the world in a powerful way at a particular point. And the Messiah, the resurrection, the end of days judgment. Right. Justice being established, all of these ideas are interrelated. Okay. That's going to happen number one. And then number two, that this major intervention, this nexus events, this is going to happen and is going to come into the world through Israel. Right. That is, through Israel, that this is going to happen. So this was our setup episode."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8431.45,"end":8431.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8432.25,"end":8447.14,"speaker":"Fr Stephen De Young","text":"Next episode we're gonna. We're gonna trace through the subsequent history of Israel episode. After that, we're planning to get into the New Testament. That's the broad strokes of where we're going. And then we'll see where we go from there. If there ends up being. Maybe we'll get into church history after that, who knows?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8448.42,"end":8451.74,"speaker":"Fr Andrew Stephen Damick","text":"But only up to the 4th century, as we know, because after that you."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8451.74,"end":8452.98,"speaker":"Fr Stephen De Young","text":"Can handle the rest of it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8453.14,"end":8454.66,"speaker":"Fr Andrew Stephen Damick","text":"Your calendar just stops."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8455.06,"end":8457.78,"speaker":"Fr Stephen De Young","text":"Yeah. So just after 400, you take over."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8460.66,"end":8461.38,"speaker":"Fr Andrew Stephen Damick","text":"I'm on it."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8461.86,"end":8463.14,"speaker":"Fr Stephen De Young","text":"We'll do SP English."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8465.94,"end":8468.34,"speaker":"Fr Andrew Stephen Damick","text":"Everyone will get introduced to Alfric of Ainsum."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8468.9,"end":8483.46,"speaker":"Fr Stephen De Young","text":"There we go. We could attract a whole new audience and we could lose our old one. But anyway. But, yeah, so that's where we're going. But this episode, we needed to kind of lay some groundwork and some ideas."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8483.78,"end":8484.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8484.34,"end":8495.3,"speaker":"Fr Stephen De Young","text":"And have those out there. And to get those ideas out there and seed them, we had to blow away some sort of presuppositions. That won't help when we get into the other stuff going forward."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8495.79,"end":8516.51,"speaker":"Fr Andrew Stephen Damick","text":"I. I don't have a lot. I don't have a lot to say here at the end, but I. I think the one thing I just want to say in terms of a summary is that if you're going to understand the scriptures, it's. It is really critical to have a sense of who is Israel? What were they supposed to do? What did they do?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8517.23,"end":8517.63,"speaker":"Fr Stephen De Young","text":"What."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8517.63,"end":8759.24,"speaker":"Fr Andrew Stephen Damick","text":"You know, and as we're going to just discuss, you know, cover in the next couple episodes, what does it all mean and what does that have to do with the church? Right. I mean, it's funny. We did not actually. I mean, you can attest to this, Father. We did not, in our briefings, say, okay, we're going to say, sorry, dispensationalists, like, a hundred times. But it turns out that, you know, worked out that way because this is. Those ideas are so rampant in our modern society that there's so much kind of deprogramming that we need to do. But this story is our story, everybody. As Christians, this story is our story. You know, St. Paul can tell converts from paganism, ethnically Greek or whatever, Converts from paganism, that these are their fathers. Right. So it was their story. So it's definitely our story then, if it can be the story of people that, you know, were worshiping Zeus the year before St. Paul wrote to them. And so, you know, we made mention earlier about, you know, if there's any Marcionites listening, you know, don't bother calling. And I mean, that could be like the secondary tagline of this whole show, I think, because part of what we've been trying to. What we're working on, trying to accomplish in the five years now almost that we've been doing this podcast. I mean, lots of things. But one of the things we've been working on has been that the Old Testament in particular really needs to be known and understood by Christians, not as prologue to the New Testament. Because it's not. It's not just okay, well, we've got all that, and now here's the real story, the only part that we really need to bother with. Thanks Old Testament for producing Jesus. We can take it from here. No, no, no, no. That's not what's going on at all. This is our story. These are our fathers, these are our prophets, and these are our failures as well. Right? It's all there. Orthodox Christianity is everywhere in the Old Testament. So this story should shape who we are. It should be the way that we talk. We should understand who these people are. The events of their lives should be the mythology. And I mean that in the best possible way. They should be the mythology. That is, that is what defines us as a people. And by using that word, I don't mean that it didn't happen. That's not what I mean. I mean that it's that it's this core, this myth that forms the core of our story, of what defines who we are and, and tells us how to live. Right. So I, I, you know, I, I requested that we do this, this series because I think it's, it's, we've talked about, you know, about a lot of these subjects, but never kind of in this particular focused way, because I think that if we have this framework, then a lot of what else is going on in the scriptures, but not just in the scriptures, in all of orthodox Christian tradition makes so much more sense, even if it's just on the beginning level of, like, if you go to matins and you hear lines about the three holy children being sung, which you will hear, but you have no idea who those three holy children are, then you at least need to gain some biblical literacy and God willing, a lot more than just that basic literacy of kind of knowing who the people are and what they did, but understanding what's going on with all that. So that's the purpose of what we're doing here. Any final comments, Father, before we roll credits?"}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8760.68,"end":8849.86,"speaker":"Fr Stephen De Young","text":"Yeah. I just want to say, since we had a few examples tonight, that one of the things I've kind of realized that I've been indirectly calling upon people to do throughout this podcast and throughout pretty much all my published stuff and everything is embrace messiness. We don't like messiness. I see this in a lot of questions I get asked. We like things to be very clear cut. We like things to be categorized and in a neat order. We want our theology to be systematic, where it all fits together and everything is nicely in its place, and all kinds of work kind of works and everything and the problem is, especially when we're dealing with anything related to God, that doesn't work, that dog don't hunt, things get really messy. But even things human history is messy. Actually, reading the Bible in detail, things get really messy. Just tonight, you know, the tribe of Dan, not actually being a bunch of biological descendants of a person named Dan who was the son of a person named Jacob, but actually being a bunch of weird displaced Greek raiders. That's. That's weird. That's messy. Right. I realize that."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8850.74,"end":8851.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":8851.06,"end":9079.65,"speaker":"Fr Stephen De Young","text":"That's part of why I introduced that idea slowly on the podcast. Finding out the rest of Moses family who was not part of Pharaoh's household also had Egyptian names is messy. Finding out that Israel isn't biological, a biological entity originally is messy. Finding out that the category Jew gentile, or Israelite gentile that we all thought was really clear cut maybe isn't because there's these other Abrahamites in this zone in between is messy. It's all messy. It's all messy. It's all way more like poetry than prosecution. It's all way more like art than math or science. And we don't have a choice but to get more comfortable with that. Because if we don't get comfortable with that, then either we're just going to live a very uncomfortable life where there's this kind of dissonance between how we want the world to be and how it is, or we're going to try to force the world and history and life and ultimately God into some kind of box that doesn't trigger our OCD so badly and pretend it's clear cut. And when we pretend it's clear cut and we start coming up with these theories, they inevitably lead bad places. A lot of the bad theology we critique on this show, whether it's something like penal substitutionary atonement, or whether it's dispensationalism tonight that we focused on more on and on other things we've talked about. At the core of the issue is somebody came up with a system. Somebody came up with a way to systematize this, to try to make sense of all of it. And in so doing, they did violence to it and they ended up mangling it. And our response to that can't be, okay, well, give me the systematization that works, that doesn't mangle it, because there isn't one. There isn't one we have to live with. God is who he is. The world is what it is. Our life is what it is. We can't wake up every morning and go to war with existence because we want it to be something other than what it is. We have to live our life within the world we find ourselves in, among the people we find ourselves among and move forward to do the things we're called to do and remain faithful to God and follow him and just accept that a lot of it is really messy and it's gonna stay that way and we're not gonna get it all in order anytime soon. Someday God will get it all back in order and hopefully we'll see it, but we're probably gonna die and get resurrected in between. So yeah, as we're done with Lent, so I'm done reading Nietzsche for the year. But as Nietzsche said, the will to a system is degenerate. He was talking about Hegel. But there's a little bit of truth to that. There's a little bit of truth to that. There's sort of a life denying aspect to trying to make everything into just a big spreadsheet, a system of boxes. So that's what I have to say."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9079.81,"end":9120.03,"speaker":"Fr Andrew Stephen Damick","text":"Who knew? There's nothing Nietzsche couldn't teach you. Well, that's our show for today. Yes, about the raising of the wrist. That's our show for tonight. Thanks everyone for listening. If you didn't happen to get through to us live this time, we would still like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page. You can also leave a voicemail@speakpipe.com Lord, Lord of Spirits. And if you have basic questions about Orthodox Christianity or you need help to find a parish because that's where you do this thing in 3D. Head over to OrthodoxIntro.org and join us."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9120.03,"end":9127.83,"speaker":"Fr Stephen De Young","text":"For our live broadcast of the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. It's like the latest fashion, like a spreading disease."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9130.63,"end":9143.12,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook you can follow our page and join our discussion discussion group. Leave those ratings, those reviews, subscribe, notify, whatever. Most importantly though, share this show with one of your friends."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9143.68,"end":9152.08,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. Because by the time you hear the siren, it's already too late."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9153.44,"end":9157.36,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night. God bless you. Christ is risen."}
{"episode_id":"LOS - #115 - 2025-04-24 - I Will Make a Distinction","start":9158.8,"end":9196.06,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian faith priests Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient faith radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
