{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":0.64,"end":65.3,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, ancient angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation. The the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":66.26,"end":106.39,"speaker":"Fr Andrew Stephen Damick","text":"Hey, good evening giant killers, dragon slayers. Christ is risen. He truly is risen. You are listening to the Lord of Spirits podcast. As you should be doing. This is the only thing you should be doing right now. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And we are live. And if you are listening to us live, you can call us at 855-237-2346 and you can talk to us. We're listening. We're going to get to your calls in the second half of the show. And our very own Matuska Trudy, who assures me that her name is not a nickname, will be taking your calls."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":106.79,"end":131.09,"speaker":"Fr Stephen De Young","text":"We have to, we have to make a quick programming note here. Oh yeah, so like people, I know people will hear this recording later. This isn't directed to you, but to those of you who have been listening to the feed and who just spent the last hour listening to the commercial for Father Andrew's new show. And now we're gonna have to listen to who knows, upward of three hours more of him."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":132.77,"end":133.33,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":133.65,"end":141.38,"speaker":"Fr Stephen De Young","text":"Well, here's an opportunity for you to apologize to those people. Father Andrew, I'm not even a little bit sorry, okay?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":141.46,"end":143.22,"speaker":"Fr Andrew Stephen Damick","text":"I could turn their friggin radio off."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":143.54,"end":150.42,"speaker":"Fr Stephen De Young","text":"I also do have a technical question since I also had to listen to that commercial again. Oh, and may yet again before the show is over."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":150.9,"end":152.82,"speaker":"Fr Andrew Stephen Damick","text":"No, no, they're not gonna play that one again."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":154.74,"end":164.23,"speaker":"Fr Stephen De Young","text":"You said on this, you know, video podcast you're going to read the stories like are you gonna have some kind of graphics going on during that or are they just gonna, like, there and watch you read?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":164.71,"end":170.55,"speaker":"Fr Andrew Stephen Damick","text":"There will be, in fact, some visual elements. Okay. That will not just be us reading. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":170.79,"end":182.47,"speaker":"Fr Stephen De Young","text":"Because that's a good thing to clarify for people. Because if you tell people like Father Steven, you're going to sit on YouTube and watch me put on my reading glasses and read for like 20 minutes, like, that's not going to sell it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":184.23,"end":185.75,"speaker":"Fr Andrew Stephen Damick","text":"There are people that would watch you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":185.75,"end":192.13,"speaker":"Fr Stephen De Young","text":"Do that maybe because they never know what I was going to say or do. Like during."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":192.21,"end":192.73,"speaker":"Fr Andrew Stephen Damick","text":"Make something."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":192.73,"end":194.29,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":194.45,"end":197.73,"speaker":"Fr Andrew Stephen Damick","text":"And you, you put your reading glasses on so dramatically too. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":198.21,"end":200.85,"speaker":"Fr Stephen De Young","text":"Yeah, well, you have to put them on and take them off dramatically."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":202.61,"end":203.17,"speaker":"Fr Andrew Stephen Damick","text":"I understand."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":204.37,"end":206.29,"speaker":"Fr Stephen De Young","text":"That's part of selling the whole thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":206.29,"end":251.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Anyway, for years, years, because this show is almost 4 years old, you, the listener, have been waiting for us to do an episode or three on the book of Enoch, whether it's the 450 foot tall giants or the vagaries of the solar calendar. We know you get excited pondering it, and who wouldn't? But that's not what we're talking about. Tonight we are going to start a series on the Apocrypha. The Apocrypha, it's a scary word for some folks suggesting secret, esoteric, weird tomes from the ancient world. Some say that the apocrypha are dangerous, full of forbidden knowledge. So, Father, that's what they actually are, right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":253.54,"end":254.02,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":255.38,"end":258.5,"speaker":"Fr Andrew Stephen Damick","text":"Yay. That means I can go home tonight."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":258.66,"end":297.04,"speaker":"Fr Stephen De Young","text":"Yeah. But actually, no, no, none of them were actually banned from the Bible, despite what the History Channel would tell you. Suppressed by the Vatican. Yes. None of them were taken and burned. Yeah. So, yeah, apocrypha. Well, we have to start by disambiguating. So a lot of people, as I found out when I published a certain book, a lot of people now when they hear the word apocrypha, think of the Old Testament books, right? The six or so Old Testament books."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":297.04,"end":299.32,"speaker":"Fr Andrew Stephen Damick","text":"Like Maccabees and Tobit and whatever that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":299.32,"end":304.11,"speaker":"Fr Stephen De Young","text":"Are in the Roman Catholic Old Testament and not in most Protestant Old Testament Testaments."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":304.19,"end":304.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":305.31,"end":313.71,"speaker":"Fr Stephen De Young","text":"And they call those books the Apocrypha. That is completely incorrect. That is a completely incorrect usage of the term."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":315.87,"end":316.75,"speaker":"Fr Andrew Stephen Damick","text":"Amen and share."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":317.23,"end":352.75,"speaker":"Fr Stephen De Young","text":"So that is. That is not what we're talking about. When we use the word apocrypha, we use it correctly. The. The word apocrypha, like the dictionary definition of the Greek word, refers to something. Usually you will see it translated as hidden or secret because that makes it Sound really fascinating and interesting. Right. Like someone is hiding this from you. Someone is keeping this secret. But in actuality, it's used to refer to private, which you can tell is a related idea."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":352.91,"end":354.03,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":354.03,"end":388.74,"speaker":"Fr Stephen De Young","text":"Something you do in private rather than in public is hidden or secret in a certain sense. Right, yeah. And so apocrypha are works that fall into a sort of middle category throughout church history, particularly in the East. That's why it's still a Greek word. There have been sort of three categories of texts. There are books that are read publicly or books that are read in the churches."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":389.06,"end":390.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's canon."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":390.98,"end":412.58,"speaker":"Fr Stephen De Young","text":"That's the Bible. Yes. That's Scriptures. Right. That category of Scriptures, there's. And then on the other end of the spectrum, there are books not to be read. That's heretical stuff. Right. That's heretical nonsense. And then in between, there is this middle category of apocrypha, of books that are to be read in private."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":414.37,"end":414.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":415.65,"end":430.01,"speaker":"Fr Stephen De Young","text":"And that distinction between public reading and private reading is kind of less intuitive now in our modern age because of literacy rates."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":430.01,"end":432.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, most reading is private reading."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":432.93,"end":580.32,"speaker":"Fr Stephen De Young","text":"Yeah. And so the difference between someone reading something at home or someone hearing it read in church seems less of a difference to us. But until very, very recently, Very, very recently, even in the quote unquote, Western world, we won't get into all that. But literacy rates were ridiculously low. So the example I like to give on this is in World War I. World War I, if you were drafted into the US military to fight in World War I, you were considered literate. If you could sign your name. Right. Rather than making an X. Right. Like a fixing your mark with a witness. This is why they had to have notaries. Like, people didn't have a signature, they would just make an X and they'd have to have a witness there that saw them do it in case there was an issue later. Um, so being able to actually sign your name made you literate. And 40% of the US army was literate by that standard. Okay. And so this is in the 19 teens. This is like a little over 100 years ago. So for the vast majority of human history, and still in very many parts of the world, the literate people are the educated class, which is a minority. Right. In a given society. Why this is important in understanding this distinction is something that was read publicly, was read to everyone. So anyone who was attending worship services in the church would hear the texts from the Old Testament, the gospels, things from St. Paul's epistles, the other New Testament epistles. Right. These things were read publicly, which meant they were made available. They were read to everyone. That doesn't mean everything in them was easy and clear to understand for everyone. That's why there was, you know, preaching."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":580.8,"end":581.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":582.32,"end":609.09,"speaker":"Fr Stephen De Young","text":"To sort of frame things and explain them. But they were read publicly, they were put out there and made available to everyone. So. But then there are other texts, right, which for a variety of reasons other than being purely heretical. Right. Those purely heretical texts is like, well, nobody should read that. There's nothing worth reading there. Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":609.09,"end":609.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":610.17,"end":633.27,"speaker":"Fr Stephen De Young","text":"But there are other texts that had valuable things to say that were related in some way to the Jewish or Christian traditions, which had value to them, but also had other elements. So there might be things that were erroneous in them. There might be things which could be very easily taken in a weird way. Right, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":633.59,"end":655.34,"speaker":"Fr Andrew Stephen Damick","text":"Which is why sometimes when this subject comes up, because, I mean, we've talked about this before on the show, when the subject comes up, sometimes people ask things about a particular book and say, is this book safe? Because there's this idea that there's problematic bits. But it's not like if you read some ancient text, it's going to cast some sort of weird spell on you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":655.74,"end":657.02,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":657.66,"end":668.46,"speaker":"Fr Andrew Stephen Damick","text":"The question is just, do you have discernment? And if something seems weird to you, are you going to go off and do something weird or are you just going to kind of go, oh, that's weird, and move on?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":668.94,"end":684.39,"speaker":"Fr Stephen De Young","text":"Yeah. And this is by restricting that category of books to being privately read, you are restricting them to a certain type of person being able to read them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":684.71,"end":686.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the literate, basically."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":686.79,"end":716.87,"speaker":"Fr Stephen De Young","text":"Right, the literate, which would be the educated classes, which were usually, like, in Christian history, we're usually talking about clergy, churchmen, other people of the educated classes who would be equipped to read them and sort of weed out the good and the bad. Right. And those kind of things. And so, for example, in the east in particular, the Book of Revelation still kind of hovers between the publicly and privately read categories."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":717.19,"end":718.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":718.31,"end":746.52,"speaker":"Fr Stephen De Young","text":"It's been affirmed as canonical, but it's still not publicly read 99.9% of the time in places, certain very specific situations and places, but outside of that, it's not really. And you know, it's because I don't know if our listeners will believe this, but some people, when they hear stuff from the Book of Revelation go off on weird tangents with it. What I know, hard to imagine, but true."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":748.04,"end":749.8,"speaker":"Fr Andrew Stephen Damick","text":"My childhood has just been rewritten."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":750.04,"end":756.84,"speaker":"Fr Stephen De Young","text":"Yeah. This by the way is also what happened with Origin. I'll get everybody worked up again."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":756.92,"end":757.32,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":759.96,"end":781.16,"speaker":"Fr Stephen De Young","text":"When the only people who were reading Origin were people like St. Gregory of Nyssa and St. Basil the Great, St. Gregory the Theologian and St. Jerome. Right. No one felt the need to condemn him because there were, There were problems there. But all the people who were equipped to read Origen and could weed that out."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":781.32,"end":782.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, just the nerds."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":782.36,"end":821.1,"speaker":"Fr Stephen De Young","text":"Right. They could take the good and drop the bad. Right. But as Origin started being more widely read and quoted and as people showed up like Methodius of Olympus who like went all in with some of the worst parts of Origin and publicly taught them, that's when there arose a need in the church to condemn Origin because the stuff was now getting thrown out to people who weren't equipped to deal with it correctly. And so the church responded by saying, you know what? Don't, don't read this stuff."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":821.66,"end":822.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":823.18,"end":829.98,"speaker":"Fr Stephen De Young","text":"Because people are going off in weird soul destroying directions with it, like thinking we're going to turn into spheres."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":833.5,"end":835.66,"speaker":"Fr Andrew Stephen Damick","text":"You don't want to be spherical. But not religious."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":836.22,"end":843.5,"speaker":"Fr Stephen De Young","text":"Yeah, they were kind of religious, though. I mean, I see what you're trying to do there, but that's when an."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":843.5,"end":845.14,"speaker":"Fr Andrew Stephen Damick","text":"Originist doesn't go to church anymore."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":845.38,"end":872.26,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So all that said, right, that sort of background tonight, we're actually going to be talking about one particular piece or one collection of pieces, I guess, of apocryphal texts. Apocryphal Jewish texts from the Second Temple period. And that's the testaments of the 12 patriarchs."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":874.42,"end":876.34,"speaker":"Fr Andrew Stephen Damick","text":"Buckle in, everybody. There's 12 of them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":877.38,"end":911.35,"speaker":"Fr Stephen De Young","text":"Yes, 12 patriarchs and 12 testaments, one for each. And this is for a bunch of reasons. The reason why this is the first text that we're. We're devoting an episode to of the show is that this is for a bunch of reasons. I think the most important Second Temple, Jewish or other apocryphal text for Christians to get a handle on. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":911.35,"end":929.4,"speaker":"Fr Andrew Stephen Damick","text":"And. And we should say that while the one that we're gonna. The edition we're gonna be referring to probably the most is the Charles Worth collection, which we recommend. And we don't get any kickback for this. So it's usually the cheapest if you get The Charles with two volumes. Pseudepigrapha, usually cheapest at Christian Book Distributors."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":929.88,"end":931.56,"speaker":"Fr Stephen De Young","text":"Yeah. Christianbook.com."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":931.88,"end":948.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. You can also read that. You can also read these texts, another translation of these texts on the Internet. So if you just look up testaments of the twelve Patriarchs, you can sit there and read them yourself, you know, so this is immediately available to everybody. If you can hear this, you can look it up."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":948.67,"end":954.91,"speaker":"Fr Stephen De Young","text":"Yes. But you know, if you buy actual paper books, then the man can't steal your knowledge while you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":955.63,"end":956.35,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":959.55,"end":1023.76,"speaker":"Fr Stephen De Young","text":"So and, and might as well just say a few of those reasons. This is a text that gets. It's a Jewish text. It's a pre Christian Jewish text that gets preserved orthodox monastic settlements. It's an important link between Jewish wisdom literature and Christian monastic literature. It's an important link in ideas in terms of how the New Testament, maybe especially St. Paul, but also St. John interpret the Old Testament. There's a whole bunch of reasons why this is probably the most important one. And it's part of. The testaments of the twelve patriarchs are part of a broader genre of testaments that exist within Second Temple Jewish literature. This is testament as in last will and testament."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1023.92,"end":1034.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's like a guy's final words before he, you know, reposes like, you know, calls all the family together and says, now listen up, this is what I have to say to everybody."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1034.94,"end":1175.51,"speaker":"Fr Stephen De Young","text":"Yeah. This is not testament as in like Old Testament, New Testament, where that English word is being used to mean covenant. So these are not covenants made by the. Or with the, the 12 patriarchs. This is their last, their last words to their descendants, to their immediate descendants, and then from their, their future and even distant future descendants. And this genre follows the model of what we see in Genesis 48 and 49, especially 49. But there's a little bit in 48 with Joseph's sons where Jacob calls together his 12 sons and, and gives these sort of parting words, in some cases parting shots to his various sons. And it's from what happens there in Genesis 49 that the genre really takes form. Because what Jacob says to them is not there in Genesis 49, is not primarily directed to them as an individual historical person. It's directed towards their descendants and more broadly to the tribe that will later be named after them later in the Torah. So there is this sort of prophetic element to what is said there. And that means that this genre, because of that prophetic element, this genre becomes a way for Jewish writers in the Second Temple period to sort of comment on then present events, but from like behind a veil a little bit. So rather than just saying, oh, here's my hot take on the current Hasmonean king, right. It's, you know, you frame it within the context of a biblical figure making a Prophecy about the future that's talking about that Hasmonean king."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1175.59,"end":1193.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And I mean, we should say like this is, this is very self consciously and very obviously pseudepigrapha, meaning that no one is actually claiming that these are from the, the men who they're said to be from in the text."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1193.36,"end":1193.68,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1193.68,"end":1198.32,"speaker":"Fr Andrew Stephen Damick","text":"This is understood to be basically a kind of fiction of sorts, you know?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1198.48,"end":1209.84,"speaker":"Fr Stephen De Young","text":"Right, yeah. Right. And there's not even a fast one in these in particular the testaments of 12 patriarchs. There's not even a pretense that the patriarchs themselves are writing it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1210.4,"end":1211.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1211.6,"end":1334.9,"speaker":"Fr Stephen De Young","text":"It's recorded as words that they are speaking before they die. It never says who's writing it down. Right. Like, so there's not even a pretense that like, of someone saying, oh, I was there and I wrote this down. Right. So there's not even sort of a fictional writer interposed. But so. Yeah. And interestingly. So there, there are a couple places where the Testaments, 12 patriarchs tap into sort of Enochic traditions that exist during the second Temple period. And the main way, there's another way, but the main way is that it will actually quote first Enoch, book of Enoch is quoted in two of the two of the testaments as what was written by their forefather Enoch. Now given within the frame of these are the twelve patriarchs. The twelve patriarchs, by the way, just to clarify for anybody who might have been clear, the 12 patriarchs are the 12 sons of Jacob. Right, right, right. So in Genesis 49, we had the testament of Jacob where he talked to them. These are presented as each of them, when each of them died talking to their descendants. Right. So of course there was no currently existing scripture in existence at that time. These are people living within the pages of Genesis. The Torah hadn't been written yet and wouldn't be written for centuries. So the only thing they could quote, if you accepted that the Book of Enoch was written by actual Enoch from Genesis, would be the Book of Enoch. That would be the only thing that was around at that time that they could quote from."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1335.06,"end":1336.98,"speaker":"Fr Andrew Stephen Damick","text":"Otherwise it'd be kind of anachronistic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1337.22,"end":1367.51,"speaker":"Fr Stephen De Young","text":"Right. So this, this does test. And again, that's not like, oh, they're trying to cheat by only quoting from it. It more reflects the fact that it was broadly accepted in the second Temple period that Enoch wrote the Book of Enoch and for a long time thereafter. We've mentioned on the show before, I know Tertullian, for example, completely believed that Enoch had written every word of The Book of Enoch."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1367.67,"end":1368.15,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1368.39,"end":1400.94,"speaker":"Fr Stephen De Young","text":"But more interestingly, St. Augustine, who rejected the teaching of the Book of Enoch, still believed that Enoch had written something. He just thought that the Book of Enoch had become corrupted. Right. So even he didn't throw the whole thing out, despite not liking parts of it. He just said that the parts he didn't like were the corrupt parts. But he believed that parts of this text went back to Enoch. It had been on the ark."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1402.23,"end":1402.55,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1402.79,"end":1464.66,"speaker":"Fr Stephen De Young","text":"Preserved through the flood. That's at the beginning of the fifth century. Right. So people firmly did believe that the Book of Enoch went back to Enoch. And that's. That, I think, is more what that reflects than an idea that, you know, oh, this is how we'll trick them. Right. Well, we'll make sure not to quote anything because there are certainly plenty of illusions within these two. Things that happen in the Torah and things that happen subsequently in the Hebrew Scriptures all the way up to the time of writing. Right. They allude to those events all the time. Right. So it's not that they were, you know, exclusive of those things. It's just only. The only quotes are for meaning. So there's actually a pile of these. It's not just the testament of the twelve Patriarchs. Testaments of the twelve Patriarchs are, I think, the most important ones. But there's a testament of Adam, there's a testament of Abraham, there's a Testament of Isaac. Yeah, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1464.66,"end":1465.82,"speaker":"Fr Andrew Stephen Damick","text":"Like a genre."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1466.14,"end":1594.94,"speaker":"Fr Stephen De Young","text":"Yeah. There's. There's piles of these within Second Temple Jewish literature, and they all follow this same frame of presenting the last words of whoever the biblical figure is with this prophetic kind of import. And in the case of some, but not all of them, but including at least a couple of the testaments of the twelve Patriarchs, that prophetic element also forms an apocalyptic element, meaning there are apocalyptic journeys taken into the heavens where things are revealed sort of from a divine perspective. Apocalyptic does not mean about the end of the world. Apocalyptic means revelation, meaning specifically that the spiritual reality underlying historical events is revealed by someone being taken and given a heavenly perspective. And so that's going to happen a couple of times in a couple of the Testaments. So we keep referring to them in the plural. So the testaments of twelve Patriarchs as a document has kind of a weird nature and history. And I said there as a document. And that's part of what causes the issue with the kind of weird history is that it's very clear that at least some of them circulated separately. Right. So we've got the testaments of the twelve patriarchs. As we said, that means we've got a Testament of Reuben, a testament of Simeon, a testament of Levi, a testament of Judah. Right on down the line. Right. And as I said, it's very clear that some of those circulated separately. So we've got, like, separate copies of the Testament of Levi and the Testament of Naftali. Right. With that aren't part of the collection."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1595.42,"end":1600.22,"speaker":"Fr Andrew Stephen Damick","text":"Is there some kind of stylistic difference between them and the others?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1601.9,"end":1602.94,"speaker":"Fr Stephen De Young","text":"No, not really."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1603.98,"end":1604.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1604.42,"end":1608.7,"speaker":"Fr Stephen De Young","text":"So it's entirely possible that all 12 of these circulated separately."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1609.82,"end":1610.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1610.26,"end":1656.98,"speaker":"Fr Stephen De Young","text":"On the other hand, some of them, the themes are so closely tied together from one to the next that those particular ones circulating separately would seem weird. Right. It would seem a weird coincidence that they ended up fitting together that well. Right. And we don't have actual evidence, like copies of those that were separate. Right. So likely, the most likely explanation, I mean, we can't prove this, but the most likely explanation is that probably some of these were composed independently and were separate testaments, because, like we said, there's lots of these."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1657.62,"end":1658.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1658.06,"end":1669.65,"speaker":"Fr Stephen De Young","text":"And then at some point, because these were brothers, these were the 12 brothers, someone brought together the ones that already existed and then wrote the other ones."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1670.61,"end":1672.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To make a. A set."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1672.37,"end":1684.93,"speaker":"Fr Stephen De Young","text":"Yeah. To kind of produce a whole set as the testaments of the twelve patriarchs. Right. There's also a weird language issue in."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1684.93,"end":1685.25,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1688.69,"end":1735.75,"speaker":"Fr Stephen De Young","text":"There are clear signs that in places throughout that they were written Hebrew originally, but we only have tiny fragments of the Hebrew, mostly from the Dead Sea Scrolls. So we don't have any Hebrew copies, whole copies of a single one. We just have little fragments in Hebrew from different parts, enough to tell us that it existed in Hebrew. And there are things that. In the Aramaic and Greek versions, which we do have whole testaments in Aramaic and Old Testaments in Greek, even those show signs of being translation from Hebrew in places."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1736.15,"end":1736.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1736.95,"end":1746.63,"speaker":"Fr Stephen De Young","text":"So you will get folks who say, well, these were originally written in Hebrew. You can't really prove that because we don't have it. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1747.44,"end":1748.72,"speaker":"Fr Andrew Stephen Damick","text":"But it seems possible."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1749.2,"end":1823.4,"speaker":"Fr Stephen De Young","text":"But it seems possible. And we know it was in Hebrew, but the other thing is the Aramaic and Greek have this weird relationship to each other. And when we start talking about the particular ones, the particular testaments will flesh this out. Right. But so there's. There's like Greek version and Aramaic version, and in some cases we have them, or at least have detailed notes on both versions and the nature of both versions, it is extremely unclear which one came first. Right. So it's. It's not as simple as, like, oh, well, it went from Hebrew to Aramaic to Greek, or even that it went from Aramaic to Greek. There's just as much evidence that it went from Greek to Aramaic as vice versa. And that being the case, that makes it very difficult to tell where the Hebrew fits in. Like if it went from Aramaic to Greek, people would probably say, okay, well, it was part. Maybe it was like the Book of Daniel in the Old test, that's in the canonical Old Testament that was sort of part Hebrew and part Aramaic originally and then got translated into Greek."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1823.64,"end":1829.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but we don't have enough of the Hebrew around to be able to even make those comparisons."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1829.32,"end":1861.29,"speaker":"Fr Stephen De Young","text":"Yeah. And there are other indicators that say parts of it could been originally written in Greek. Right. So we could have a situation where it's really nebulous. We could have a situation where, for example, if it's true that some pre existed and then it was compiled, that the pre existing pieces were in Aramaic and. Or Hebrew, and then it was collected and translated and filled out in Greek and then the new Greek parts got translated back into Aramaic. Right. There's. There's probably never know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1861.53,"end":1862.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1864.09,"end":1950.72,"speaker":"Fr Stephen De Young","text":"It'd be very difficult for any individual text discovery to ever prove that one way or another. So we've got copies from two different places. One place is the Dead Sea Scrolls at Qumran, where they were buried from the first century ad. Now they aren't texts from the first century AD necessarily, they're mostly from the first and second centuries bc but they were buried there in the first century AD when the Romans came through and recovered in the mid 20th century. Mid to late 20th century. And we've got copies from Mount Athos and Saint Catherine's monasteries. The earliest copy we have from Mount Athos is a Greek version from the 10th century, which is from Kutlumusiu monastery. And interestingly, while that text is all in Greek, when you get to the Testament in Levi, he has these copious margin notes about the Aramaic copy. So whoever the monk was who copied it could read Aramaic and had the Aramaic copy there as well. And he sort of notes all the Differences in the 10th century, in the 900-00 AD 10th century."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1950.72,"end":1952.08,"speaker":"Fr Andrew Stephen Damick","text":"Athena. Textual critic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1952.24,"end":1955.36,"speaker":"Fr Stephen De Young","text":"Yeah, which means he was probably from Syria since he knew Aramaic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1955.44,"end":1956.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":1958.48,"end":2007.67,"speaker":"Fr Stephen De Young","text":"And so, yeah, that's from the 10th century is the earliest copy. There are other copies there from later, but that's the earliest one. We also. The earliest copy we have, there are several copies at St. Catherine's Monastery at Mount Sinai, but the earliest one is from the 17th century. And it's important to note that Christians preserved those texts. Right. Qumran was a Jewish community, but the other place where we have this text are Orthodox Christian monasteries, meaning Rabbinic Judaism did not continue to keep and preserve and copy and hand down the testaments of the twelve Patriarchs, but Christians did."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2007.83,"end":2024.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The only reason we have these texts is because. And it wasn't some random, out of the way, weird village of Christians that did some strange thing. I mean, Athos, Mount Sinai. I mean, these are the. These are the most established."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2025.17,"end":2025.53,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2025.53,"end":2030.13,"speaker":"Fr Andrew Stephen Damick","text":"You know, central Orthodox, you know, monastic communities."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2030.93,"end":2037.41,"speaker":"Fr Stephen De Young","text":"Yeah. And. And Saint Nikephoros, the confessor of Constantinople, mentions the testaments of the twelve patriarchs."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2037.57,"end":2038.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2038.53,"end":2045.57,"speaker":"Fr Stephen De Young","text":"In his list of books to be read privately in the 9th century. So it was in the library of Constantinople, too. So it's not just monastics."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2046.27,"end":2047.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2048.99,"end":2051.79,"speaker":"Fr Stephen De Young","text":"It's also so the Imperial church, as it were."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2052.11,"end":2090.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and this will probably become clear as we go along tonight, but some people might be asking themselves right now, like, well, if this stuff was being copied and preserved and used at such central places like the, you know, the Patriarch of Constantinople and Mount Anthosis, why have I never heard of this? And I would say that probably. Well, number one, I mean, there's a huge amount of Orthodox literature that most people have never heard of or literature that the Orthodox Church has preserved and kept. Whatever. But also, as you'll see, a lot of what's really important for us about these texts is just fully absorbed into our tradition."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2090.58,"end":2118.11,"speaker":"Fr Stephen De Young","text":"Right, right. This is sort of a link in the chain of our. Of our tradition. Right. So even if you never read any of these texts, so much of what's in these texts made its way into the New Testament and then into monastic literature and other forms of orthodox literature and the Fathers and this kind of thing. You get the content even without having read it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2118.27,"end":2119.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2119.15,"end":2119.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2119.43,"end":2136.18,"speaker":"Fr Andrew Stephen Damick","text":"So. So if you pick up this stuff and read it and. And you're. And, you know, you've been formed in Orthodox Christianity for a while, probably very little will be surprising to you, except for maybe the basic details of, like, the story and stuff, but the principles will all be very, very familiar."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2136.18,"end":2139.94,"speaker":"Fr Stephen De Young","text":"Yeah. Maybe you might be surprised that these principles are pre Christian."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2140.5,"end":2147.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, because they're pre Christian, boys and girls, but."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2147.3,"end":2210.85,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Other than that. Right. It's not going to be anything like, weird, you know, nothing, nothing rewrites Christianity, but it gives you sort of the link of the. In the chain of provenance, of the development of these ideas. And these ideas being handed down. So the sort of major themes that run through the 12 of them, as I mentioned already, this is there. They form an important connector between Old Testament wisdom literature, Hebrew wisdom literature, monastic literature, which helps explain why they were so important in Christian monastic settlements. Lots of meditations on particular virtues, particular passions or vices. Right. Particular sins and forms of sinfulness. The kind of thing that you're used to seeing in orthodox monastic literature, if you've read any of it, like St. John Cashin's Institutes and conferences or."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2211.57,"end":2211.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2214.85,"end":2230.93,"speaker":"Fr Stephen De Young","text":"And specifically the form that takes is that in many, not all, but most even of these testaments, the individual patriarch is taken to be sort of an exemplar of some passion or some virtue."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2231.41,"end":2262.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, you know, if you've ever been present for the chanting of the great canon of St. Andrew of Crete in the first week of Lent or, you know, in the fifth week of Lent, that form should be very familiar to you. St. Andrew of Creed does exactly that kind of thing. The one, probably the most memorable one from a particular translation is when he's talking about Esau, you know, also called Edom, which means red. Right. He says, because it means a red hot sin loving soul. Yeah, stick with that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2263.89,"end":2272.21,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that mode of reading, if you just recently, in the last few weeks, heard the great canon, will be familiar to you in particular."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2272.85,"end":2273.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2275.25,"end":2317.93,"speaker":"Fr Stephen De Young","text":"And then, of course, as we mentioned, there are apocalyptic visions of this future generation, of the coming of the Messiah that are the product of sort of the original context in which this was written. Text was written, by the way. I guess we didn't mention that the text of the whole. The whole thing put together, the collection we know existed from the first half of the second century BC so between 20150 BC. But it's important that none of it is sort of exegetical in the sense that it's like reading and interpreting the book of Genesis or even later parts of the Hebrew Bible."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2318.25,"end":2320.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which again, would be weirdly anachronistic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2320.81,"end":2351.06,"speaker":"Fr Stephen De Young","text":"Right. And this is. This is why it was sort of left behind by Rabbinic Judaism. Rabbinic Judaism chose to focus on the Midrashim, the. The Targumim, a kind of exegetical approach of the Hebrew text going forward. And this is a very different mode of reading and interpreting those scriptures that became the basis for a lot of Christian interpretation. But obviously those interpretations went in different directions."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2354.5,"end":2363.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I mean, this might be a shock to some of you only 39 minutes into the show, but we're going to go ahead and take our first break. So we'll be right back with the second half of Lord of the Spirits."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2363.38,"end":2379.71,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2384.35,"end":2422.44,"speaker":"Podcast Advertisement Voice","text":"Ancient Faith Radio is brought to you by our listeners with help from Byzantine Coffee. Enjoy a great cup of Byzantine coffee while tithing to your parish. A non profit organization. Byzantine coffee is the the product of prayer, reflection and the work of a few Orthodox Christians. When purchasing our small family co op sourced and air roasted coffees, add your parish discount code at checkout to tithe 10% of your purchase price. We also offer a fine grind for your Greek or Arabic coffees. Subscribe and save 5% on every purchase. Visit us at byzantinecoffee.com to learn more."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2422.89,"end":2423.21,"speaker":"Fr Andrew Stephen Damick","text":"Foreign."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2425.61,"end":2441.77,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2443.05,"end":2477.94,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. It's Lord of Spirits podcast. We're talking apocrypha, specifically the testaments of the twelve patriarchs. And you know, the thing that I kind of had on my mind as I was listening to that commercial is, you know, did the Byzantine Empire. Yes, yes, I know it was the Eastern Roman Empire. Did the Byzantine Empire even have coffee? I think it's anachronistic. I'm just throwing that out there. Look it up, kids. Let me know. A quick googling suggests that what we now call Greek coffee is maybe only early 19th century."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2478.43,"end":2478.67,"speaker":"Fr Stephen De Young","text":"Ah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2480.99,"end":2547.16,"speaker":"Fr Andrew Stephen Damick","text":"But that doesn't mean you shouldn't buy anachronistic coffee. I'm okay with anachronistic coffee because coffee is coffee. So. Yes, welcome back. All right. You have nothing to say about that, Father? I was, I was hoping for some kind of remark or. Oh, maybe not. The question is now, where has he gone? Has he stepped out for a long, long. Well, he doesn't smoke. Yeah, no smoke breaks. When I was the stagehand, we used to refer to it as checking for an eclipse, but we just had the eclipse, so there's no more eclipses available. So anyway. Right. That said, it does look like we actually are getting a call coming in. I don't know if Trudy's actually got this one piped through yet. Who could it be? Someone from Washington State. Hello, do we have Anthony from Washington?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2549.16,"end":2550.12,"speaker":"Audience Member","text":"Yes. Thank you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2550.12,"end":2558.21,"speaker":"Fr Andrew Stephen Damick","text":"Hey, Anthony. Welcome to the Lord of Spirits podcast. I don't know if Father Stephen's out taking a stroll around Lafayette, Louisiana right now, but. But you're talking to me, at least."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2558.29,"end":2559.49,"speaker":"Fr Stephen De Young","text":"I was solving crime."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2559.49,"end":2565.49,"speaker":"Audience Member","text":"Yeah. Thank you so much for this opportunity."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2565.81,"end":2568.77,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. You're welcome. Welcome to the podcast."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2569.89,"end":2606.18,"speaker":"Audience Member","text":"My question is about sabbatical years. So I'm running a company making Christian video games. And one of the big selling points I'm giving to employees is the idea of the Sabbath year from the Torah and was finding, or having a hard time finding any details about whether or not Christianity still practiced the. Practiced the sabbatical year, and if so, if it was the same year or a different year or if there are any other differences. I know I miss the Torah time."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2606.18,"end":2619.74,"speaker":"Fr Andrew Stephen Damick","text":"By a little bit, but I'm trying to figure out if, like, you're planning to make this an employee policy. Like, okay, you get a year off, but the question is, does everybody have to take a year off all at once? Is that what you're saying? Or."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2620.7,"end":2629.58,"speaker":"Audience Member","text":"Yeah, the goal would, as far as my reading and my interpretation would be, would be to give everyone the same year off, all paid holiday for the year."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2630.54,"end":2647.24,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I mean, God bless you. If you've got the resources to do that. That's amazing. Now everybody's like, wait, what's his company? Everyone's going to be applying for your company. Now, of course, the drawback, like, what, once every 25 years or something, right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2648.44,"end":2649.32,"speaker":"Fr Stephen De Young","text":"Once every seven."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2650.04,"end":2650.52,"speaker":"Fr Andrew Stephen Damick","text":"Every seven."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2650.52,"end":2651,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2651,"end":2653.96,"speaker":"Fr Andrew Stephen Damick","text":"I'm think I. I was merging with a jubilee in my head. I think that was."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2653.96,"end":2655.56,"speaker":"Fr Stephen De Young","text":"That's. That's the 50th year."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2655.88,"end":2661.96,"speaker":"Fr Andrew Stephen Damick","text":"Oh, the 50th year. Yeah. So if you have any slaves, Anthony, you have to set them free after that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2662.04,"end":2662.84,"speaker":"Audience Member","text":"I sure hope not."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2664.92,"end":2671.82,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if you don't, then you don't have to worry about it. Is that a thing, Father? Like a whole year off?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2672.38,"end":2678.74,"speaker":"Fr Stephen De Young","text":"Well, so I mean, technically, if you're talking about practicing it, Israel never practiced it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2678.74,"end":2679.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they never happened."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2680.22,"end":2682.7,"speaker":"Audience Member","text":"Yeah, I'm familiar with that. You mentioned that A couple."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2682.7,"end":2701.59,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Jeremiah points that out that they never actually did it. So I, I don't know of a widespread Christian practice of doing it every seven."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2702.95,"end":2712.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it would be hard to. Hard to imagine how that would work. Like, if everybody took a year off, like, how would a society survive?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2714.55,"end":2761.01,"speaker":"Fr Stephen De Young","text":"Well, the idea was you'd rely on God. Right? Like, okay, but. And you left your, like you left your field for that year. But like the poor could come and glean from the field during that year. So I, I mean, I do know there have been various points where there have been various sort of jubilee period proclaimed by Christians that involve the forgiveness of debts and doing all those things. But I don't know of any widespread practice now. That doesn't mean it would be wrong for you to do with your own business. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2761.01,"end":2761.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2763.53,"end":2766.01,"speaker":"Fr Stephen De Young","text":"That might be a very good thing to do."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2766.57,"end":2769.29,"speaker":"Fr Andrew Stephen Damick","text":"Again, you would never lack for employees, I think."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2770.25,"end":2835.86,"speaker":"Fr Stephen De Young","text":"And there's those commandments in the Torah are laying out a system of economic justice. Right. Deuteronomy, it's particularly clear in the Greek, says at one point, there shall be no poor among you. And I get reminded of that every time I read. See, we just read this last week in Holy Week, Christ saying to his disciples, when Judas is trying to philip some more money, the poor you will always have with you. That's really a stinging indictment if you know the Torah. Right. Sort of the. You will never live up to this. Right. But it seems to me if you're, if you're going to try to fashion some concept of economic justice, the place where you would go would be the scriptures and specifically the Torah. And therefore aspiring to that, I think would be a good thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2836.74,"end":2838.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, more power to you, man."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2841.14,"end":2850.12,"speaker":"Audience Member","text":"Do you have any suggestions about timeline? If I should just follow the Jewish year or it should be like seven years of my business or anything like."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2850.12,"end":2861.44,"speaker":"Fr Stephen De Young","text":"That, I would, I mean, I would just do. Because it's not sort of a. A culture wide thing. I would just do. Yeah. Based on years of your business."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2863.36,"end":2881.63,"speaker":"Fr Andrew Stephen Damick","text":"Okay. There you go. All right, well, thanks for calling. That's. That's one I've never heard before. It's pretty great though. I hope that, I hope that really works. I'm not saying I'm doubting it, whether it'll work. I mean, I really hope he can do that. That would be awesome."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2881.87,"end":2882.67,"speaker":"Fr Stephen De Young","text":"Yeah. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2883.07,"end":2897.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Yeah. All right. Well, I, I can see we've got another call coming in, but I don't know if it's quite all the way through yet. Like this is these, these emergent calls, you know, that are just sort of on their way. This one is actually. It looks like it's coming from Florida or at least are they calling by."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2897.55,"end":2899.03,"speaker":"Fr Stephen De Young","text":"Phone or through the astral plane?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2899.03,"end":2927.57,"speaker":"Fr Andrew Stephen Damick","text":"Like I'm getting something. I'm getting. No, yeah. I'm not a medium. So you're at least a lot. Yeah, yeah. I'm generally an extra large. So all Right. Do we have Florida there? Not yet. All right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2927.73,"end":2929.09,"speaker":"Fr Stephen De Young","text":"Florida still in?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2929.09,"end":2944.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Just. Just. We're going to gamble, Trudy. Just let them. Let them through. Okay. It's apparently John calling from. From Florida. So, John, welcome to the Lord of Spirits podcast. We're. We're glad to have you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2945.74,"end":2946.94,"speaker":"Audience Member","text":"Hello, can you hear me?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2947.1,"end":2948.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we hear you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2948.3,"end":2948.86,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2949.9,"end":2952.78,"speaker":"Audience Member","text":"Awesome. Christ is risen, first of all."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2952.94,"end":2954.22,"speaker":"Fr Andrew Stephen Damick","text":"He truly is risen."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2954.78,"end":2985.32,"speaker":"Audience Member","text":"Yeah. So I had a question. So at various points on your show, you've discussed the Nephilim and how when the Israelites would war against them, they were prohibited from taking anything that belonged to them. But there are other contexts in which they were allowed to do so. So, you know, like plundering the Egyptians, for instance. Is there a way to understand that, to, like, apply it to our current lives? That's my question. Thank you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":2986.24,"end":3069.55,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Well, I mean, number one, probably you're not being asked to go to warfare against the Nephilim or hardly anyone. So the literal level would be hard to apply. I mean, there is this classic understanding of plundering the Egyptians, which is. I mean, this is an old, old idea, which is basically the idea of taking everything good from even pagan culture and bringing it into the service of Christ, Right? So, like, that's why you get, for instance, Byzantine era commentaries on the Iliad and the Odyssey, which, I mean, those texts were written in totally pagan contexts, and if you read them closely, are totally pagan. And yet people like St. Basil the Great could look at them and say, okay, there's some good stuff that we can take away here. Not everything, but there's some good stuff that we can take away here. And so, I mean, that is one of the classic ways of. Of quote, unquote, plundering the Egyptians. Now, that's a metaphorical sense. You know, we're not being called upon to take anybody's stuff, like, literally take their stuff. You know, I mean, we have to remember that the people of Israel were functioning under direct commands from God to do certain things. Like, it wasn't. They were saying, how do we interpret this? You know, it was, go do this thing now. I don't know. Father, you got any comments on any of that?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3070.43,"end":3121.36,"speaker":"Fr Stephen De Young","text":"I think that sort of key to understanding that is that they were called upon to do something that was wrong. Like killing other humans is never good. It's never good. It is sometimes a necessary evil, Right? And so they were being called upon to commit this necessary evil. And so not being allowed to take anything was part of God telling them, like, you don't do this like to enrich yourself. This isn't about you getting rich or you getting slaves or you getting extra wives and concubines, right? This is this necessary thing that you have to do."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3123.36,"end":3124.24,"speaker":"Fr Andrew Stephen Damick","text":"And no more."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3124.48,"end":3160.89,"speaker":"Fr Stephen De Young","text":"And so. Right. And no more. And so you do it solemnly, right? You do it as a duty, right. Because you know, the reason why everyone else in the history of humanity has gone to war has been to enrich themselves, to gain power, to gain wealth, right. Literally everybody, right? So God is. Is kind of excluding that, right. As part of a way of teaching. No, this isn't good. You militarily dominating your neighbors is not a good thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3162.01,"end":3162.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3162.37,"end":3227.42,"speaker":"Fr Stephen De Young","text":"You seizing their riches and plundering them and making them your slaves is not a good thing. Right. It is something that occasionally, because of the wickedness of that group becomes necessary. And so the way I would take that into our lives is there are some times where there are things that we have to do that we take no delight in in life. Right. There's sometimes in life where we're called upon to do hard things, make hard choices. Right. Do our duty, even though it's objectionable or wrong, and we wish it didn't have to be done. And the way when those times come, right. We should look at those not as opportunities to advance ourselves or enrich ourselves or to get something over on someone else. We should not approach them with our own ego. We should approach them as sort of grim and solemn duties that we have to perform because it's the right thing to do."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3231.82,"end":3233.1,"speaker":"Fr Andrew Stephen Damick","text":"That answer your question there, John?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3234.38,"end":3236.3,"speaker":"Audience Member","text":"Yep. That does pretty well. Thank you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3236.54,"end":3241.34,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you very much for calling. I mean, nephilim are always on topic, so."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3241.74,"end":3242.94,"speaker":"Audience Member","text":"Yeah, absolutely."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3243.34,"end":3252.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you. Okay. Well, we've got 12 testaments to get through, so where are we going to start?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3254.1,"end":3258.1,"speaker":"Fr Stephen De Young","text":"Well, speaking of Nephilim, we're starting with the Testament of Reuben."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3258.9,"end":3259.46,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3259.86,"end":3261.06,"speaker":"Fr Stephen De Young","text":"Which talks about them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3262.42,"end":3263.3,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3263.62,"end":3275.94,"speaker":"Fr Stephen De Young","text":"So that's not the main focus, but it comes up because. Yeah, yeah. Because of what Reuben is most known for in Genesis. So Reuben is. Reuben is the oldest brother."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3276.27,"end":3276.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3276.43,"end":3304.25,"speaker":"Fr Stephen De Young","text":"That's why we're starting with him. That the testaments kind of go in birth order in terms of how they're arranged in the collection. Reuben was the oldest brother. Reuben would have had the firstborn status to inherit from Jacob. Probably part of the tension in the story of Jacob and his sons is that, you know, Reuben is his firstborn son, period. But he's the firstborn son from Leia. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3304.33,"end":3306.57,"speaker":"Fr Andrew Stephen Damick","text":"And not. Not the preferred Wife."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3306.73,"end":3328.41,"speaker":"Fr Stephen De Young","text":"Jacob is concerned. Yeah. Rachel's the preferred wife, and Joseph is the firstborn of her. So that's part of the tension that goes on. But he, in normal circumstances, would have inherited. He gets disinherited because of what happens in Genesis 35, verse 22, which is he commits an act of family usurpation, which I think we've talked about on the show before."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3328.65,"end":3332.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we have. Yeah. He sleeps with Jacob's concubine, Bilhah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3332.88,"end":3360.64,"speaker":"Fr Stephen De Young","text":"Right. Bilhah, one of his father's wives. And he does this not only out of lust, obviously, but he does this. The reason why. And this happened several times in Genesis, happens later in the Hebrew Bible with Absalom and David's wives. The reason for doing this is that this is a way that a son would try to take control of the family."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3361.51,"end":3361.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3361.83,"end":3362.87,"speaker":"Fr Stephen De Young","text":"From his father."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3363.11,"end":3367.99,"speaker":"Fr Andrew Stephen Damick","text":"Because if you sort of control the fertility, then you control the future."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3368.39,"end":3374.31,"speaker":"Fr Stephen De Young","text":"Right. And also, if you do this publicly, you sort of humiliate your father."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3374.55,"end":3381.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right. So, like. So in this. In this text, now, this is not what's. And the scripture does tell us he does this, right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3381.99,"end":3383.35,"speaker":"Fr Stephen De Young","text":"Yes, but there's some."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3383.35,"end":3408.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah. There's some details in this text that are sort of added. And one of them, for instance, is that he waits until Bilhah is drunk and asleep, and he goes into her, to use the biblical language, he goes into her and then leaves before she's even awake. So it's clearly like this is rape. This is clearly him having with her, in our context."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3408.22,"end":3408.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3408.58,"end":3409.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3410.22,"end":3412.3,"speaker":"Fr Stephen De Young","text":"In the sense that she is not a consenting partner."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3412.61,"end":3413.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3413.49,"end":3415.73,"speaker":"Fr Stephen De Young","text":"Of consent at this time. But she is not a willing partner."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3415.81,"end":3419.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's no sense in which she's deliberately involved."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3419.49,"end":3443.41,"speaker":"Fr Stephen De Young","text":"But it's narrated that way because again, as we said, each of the brothers will represent sort of a passion or a. Or. And. Or a virtue. And Reuben is clearly lust. Right. And so he kind of gives a breakdown of the whole incident, which is aimed at very clearly taking responsibility for it himself."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3443.81,"end":3446.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is repentant language on his part."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3446.09,"end":3572.53,"speaker":"Fr Stephen De Young","text":"So. Yeah, he wants to make it clear. He doesn't present it as, oh, she seduced him or did this or that. Right. Or even was a willing partner. This was all him. Right. In his presentation of it, he talks about having. And there are clear parallels to the story of David and Bathsheba here that are, I'm sure, deliberate, where he sees her bathing, and that puts some thoughts in his head, and then he sort of stalks her and then ends up, right, as Father Andrew said, having sex with her while she's asleep. And in the context of this also, this is why the nephilim come up. Right? The nephilim come up because they're sort of another example, on the surface, just another example of lust gone awry. Right. But it's also important that in both of these instances where we can't forget about the family usurpation part and we can't forget about. With the nephilim, the kings part, in the sense that there's not just sort of lust in the sense of sexuality, but lust for power also. Right. There's like a power dynamic involved here. Right. This isn't. We're going to see in a later testament is going to talk about the importance of keeping sexuality and reproduction together. Right. In. In this sexual act that Reuben commits. There's no aspect of like, procreation or anything like that. This is purely a power issue. Right. That he's trying to take power from his father, likely in the context of Genesis, because he didn't think he was actually going to get the firstborn status. And so since he wouldn't have inherited that way, he decides to try to take over."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3573.21,"end":3573.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3573.49,"end":3591.29,"speaker":"Fr Stephen De Young","text":"The family. But so another, another. Some other added information that we get in this testament of Reuben is that he embarked on an actual period of repentance after he did this and after he was disinherited."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3591.77,"end":3617.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And it's. I mean, this is really important to note because repentance, I think this is really, really. We have to say this a lot because I think. I think a lot of people don't know how to repent. Repentance is not just him saying, hey, guys, I messed up. I'm really sorry. He has to. He does something. And in this case, it's fasting for seven years from meat and from wine."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3618.06,"end":3627.75,"speaker":"Fr Stephen De Young","text":"Yeah. He eats no meat and drinks no wine for seven years. And that's his repentance because he was, of course, liable to the death penalty for what he had done."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3627.91,"end":3638.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's what. Now, there's no Torah yet, but that's the principle within the scriptures, you know, that you could. You could die for that. So you don't have to die. You can also repent."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3639.11,"end":3639.51,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3639.51,"end":3640.63,"speaker":"Fr Andrew Stephen Damick","text":"You know, good news, everybody."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3640.63,"end":3642.47,"speaker":"Fr Stephen De Young","text":"Repentance took this concrete form."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3643.03,"end":3643.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3643.47,"end":3649.51,"speaker":"Fr Stephen De Young","text":"Yeah, right. Of fasting for seven years. Not just, oops, did a whoopsie."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3649.75,"end":3683.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And notice from the work out, like I hoped it would, and like the relationship between fasting from. Particularly from meat and from, from wine or alcoholic drink. Like, these are things that directly feed into lust if you, if you eat too much of it and drink too much of it, you know, like it's, it's long known that these things are connected. Right. So it's, it's not just, oh, here's this arbitrary thing I'm going to do because I'm sorry and want to prove that I'm sorry. Like, this is about reforming who he is as a human. This changes who he is when he engages in this."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3684.73,"end":3689.85,"speaker":"Fr Stephen De Young","text":"Right. He had been chasing his appetites and so now he refrains from his appetites."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3690.09,"end":3691.37,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3692.25,"end":3803.23,"speaker":"Fr Stephen De Young","text":"Yeah. And so, and within the context of that. Right. That, that understanding of appetites, there's this interesting breakdown in the testament of Reuben of the seven parts of the human spirit, which doesn't, interestingly, does not match anything you really find in Greek philosophy. So this isn't. A lot of times people really want to give these like weird Platonic and Greek philosophical readings to second Temple Jewish literature. And unless we're talking about Philo of Alexandria, it doesn't work out so well most of the time. So the seven parts of the spirit as they're laid out in the Testament of Reuben, part one, the most basic part is the soul. So he's making a certain kind of distinction here between soul and spirit. The author, whoever the author is in that for him the soul is part of the spirit. And the soul is here very clearly the Jewish idea, it's the life of the body. Right. That's the first part of the spirit. It's what makes your body alive. And then the next four parts are sight, hearing, smell and taste. Right. Which are four of the five senses, those capacities. Right. But then the sixth is the capacity for speech, which is part of the human spirit, to be able to frame words and communicate. But then the seventh part you may be waiting for touch the other sense, this is the closest you get to it. The seventh part is sex."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3804.99,"end":3814.35,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting, especially like there's no Gnostic sense of the spirit here. Like these are all, you know, these are mostly pretty bodily things."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3815.56,"end":3820.52,"speaker":"Fr Stephen De Young","text":"Yeah. Well, it begins with the soul that gives life to the body and ends with sex for procreation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3820.84,"end":3825.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is how the testament of Reuben divines the spirit."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3826.28,"end":3851.12,"speaker":"Fr Stephen De Young","text":"Right. And so there is an idea here that gets developed further in the Fathers and in Christian monastic literature. The idea of blameless passions, the idea that there are appetites that are basic to being a human being, that are not innately sinful when they're Properly directed and indulged within proper limits."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3852.08,"end":3852.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3853.28,"end":3888.65,"speaker":"Fr Stephen De Young","text":"Right. And so that's the take on sexuality here, right? Is that sex is this good thing. It's part of the human spirit, which means for the testament of Reuben, it's part of the image of God. But that it is good when it functions within the context of marriage and within the context of procreation. When it's divorced from that, then it can run into sinfulness very quickly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3889.37,"end":3889.85,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3891.29,"end":3902.2,"speaker":"Fr Stephen De Young","text":"So there's one particularly controversial bit about the testament of Reuben and it's not the bit about the nephilim, it's that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3902.2,"end":3902.6,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3904.36,"end":3921.48,"speaker":"Fr Stephen De Young","text":"Testament of Reuben 5, 1 and this and all of the other numbers we're going to give the like section and verse numbers that we're going to give are from the Charlesworth edition. A lot of the public domain editions online divvy things up differently and there's no like standard."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3921.8,"end":3924.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The versification is not the same everywhere."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3924.48,"end":3926.44,"speaker":"Fr Stephen De Young","text":"Because the versification isn't in the original."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3927.94,"end":3928.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3930.74,"end":3943.3,"speaker":"Fr Stephen De Young","text":"But so five verse one, he says women are evil. Now, I thought that was self explanatory, but Father Andrew said people might get upset if we just leave it at that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3943.62,"end":3945.3,"speaker":"Fr Andrew Stephen Damick","text":"Might need to unpack that a little."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3945.3,"end":3960.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, you know, so immediately, like the first thing, right, we, we jump to when we hear that is, oh, this guy's a misogynist. He hates women."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3960.84,"end":3961.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3961.8,"end":3977.16,"speaker":"Fr Stephen De Young","text":"Right. But let's press pause. Right? Let's press pause. Let's think back to like all the way to three minutes ago when we pointed out how when he presented his sexual sin, he presented it as completely his fault and not the woman's fault at all."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3977.4,"end":3980.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that's the context in which he then says this line."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3981.25,"end":3981.45,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3981.45,"end":3984.53,"speaker":"Fr Andrew Stephen Damick","text":"And then also talks about women seducing and so forth."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":3984.85,"end":4042.93,"speaker":"Fr Stephen De Young","text":"Right. And so he says Bill, he already said Bill had nothing wrong. Right. And but now he's saying this and he's talking about women seducing men and leading men astray in this. Right. So how do those things even fit together? Right. Well, you have to understand in order to understand speech, you have to understand the context into which speech is spoken. Right. You have to understand the audience. We talked about this back when we talked about how and how not to read the Bible. The idea of the ear, Right. Recreating the ear of the first hearers. Right. And so when you read this in context, right. There was culturally an impression, right, that women did not have problems with lust."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4045.49,"end":4050.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They were basically passive within this. That's how they were understood to be within this culture is that they're."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4051.73,"end":4066.46,"speaker":"Fr Stephen De Young","text":"That men had problems with lust. Right. And you could even. Even within the text of Scripture. Right. You look at Leviticus 18 and the laws about sexual immorality, the commandments, they're all directed at men."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4067.5,"end":4073.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because again, culturally, in that time and place, men have. Have the power."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4074.3,"end":4076.78,"speaker":"Fr Stephen De Young","text":"Right. And made the choices. Right? Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4078.22,"end":4079.7,"speaker":"Fr Andrew Stephen Damick","text":"Not saying that that's correct or how."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4079.7,"end":4081.42,"speaker":"Fr Stephen De Young","text":"It should be, but that's the way it was."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4081.58,"end":4082.54,"speaker":"Fr Andrew Stephen Damick","text":"The way that it was."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4082.54,"end":4152.85,"speaker":"Fr Stephen De Young","text":"Yeah, that's the way that it was. Right. And so the dynamic, the sexual dynamic as it was seen by average Jewish person in the second century BC was men wanted to indulge themselves sexually pretty much all the time, in any way they could. And women were the sort of gatekeepers of chastity. Right. Women would sort of, sort of shut that down and. And keep it within its limits as best they could. Right. Because they didn't particularly want to indulge themselves sexually. Right. So what is being reflected here in the testament of Reuben in chapter five is Reuben is trying to explain to his male descendants, hey, guess what? In reality, women have problems with lust too. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4152.85,"end":4161.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, in a kind of, I don't want to say backwards, way sideways way, it's really saying that women have agency also."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4162.05,"end":4165.66,"speaker":"Fr Stephen De Young","text":"Yes. Women are not innately good and pure and innocent. All of them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4166.14,"end":4170.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Men and women both have problems with this."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4170.86,"end":4195.57,"speaker":"Fr Stephen De Young","text":"And so that means since he's trying to talk to them, the whole frame of the testament of Reuben is, don't do what I did. Don't give in to lust like I did. Don't hand yourself over to lust like I did. And so what he's saying here is you can't just blanket trust women to help you do that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4195.97,"end":4198.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. You're gonna have to conquer this yourself, dude."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4198.77,"end":4201.97,"speaker":"Fr Stephen De Young","text":"Right. There are women out there who will be more than happy."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4202.61,"end":4203.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4203.65,"end":4220.54,"speaker":"Fr Stephen De Young","text":"To engage in all kinds of sexual immorality with you. You can find them. Okay. So you can't count on them to shut this down. Right. He doesn't say women are evil and men are good. He says women are evil also."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4221.66,"end":4223.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's where the word comes down to."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4223.74,"end":4249.13,"speaker":"Fr Stephen De Young","text":"And therefore, a man has to exercise self control. A man has to keep himself to the commandments of God. Right. And the form this takes culturally, then. And this, you find this all over, like Proverbs all over the Hebrew Bible and Jewish wisdom literature, but reflected here too, in the testament of Reuben is you find love, you find happiness with the wife of your youth."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4250.01,"end":4251.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The woman you Married when you were."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4251.61,"end":4259.05,"speaker":"Fr Stephen De Young","text":"Young, when you were 13, and you were married off to some woman you might have never met before."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4259.69,"end":4260.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4261.37,"end":4262.65,"speaker":"Fr Stephen De Young","text":"Right. Her."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4263.29,"end":4269.69,"speaker":"Fr Andrew Stephen Damick","text":"And now you're however many years old, and neither you nor she are in the shape you were in back in the day."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4270.17,"end":4270.57,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4271.05,"end":4272.09,"speaker":"Fr Andrew Stephen Damick","text":"That's still the one."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4272.77,"end":4289.73,"speaker":"Fr Stephen De Young","text":"Yeah. And so you find love and you find happiness with her. Right. And you don't go outside looking for sexual gratification. You don't try to use sexuality for power. You don't do any of those things."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4291.49,"end":4291.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4291.81,"end":4300.05,"speaker":"Fr Stephen De Young","text":"You find happiness with her because that's the proper place for sexuality, which is part of who you are as a human being. But this is the place for it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4302,"end":4302.24,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4302.88,"end":4307.92,"speaker":"Fr Stephen De Young","text":"That's the overall. Right. Theme. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4308.24,"end":4309.44,"speaker":"Fr Andrew Stephen Damick","text":"All right, who's up next?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4309.84,"end":4320.72,"speaker":"Fr Stephen De Young","text":"Just in general, when you're reading ancient literature, you can't be easily triggered. Read something like, women are evil. And you go, ah, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4321.36,"end":4340.85,"speaker":"Fr Andrew Stephen Damick","text":"Or like, assume that. That. Yeah. You got as much as you can. Try to set aside your modern assumptions about stuff. So you can. Even if you are going to evaluate a text from a modern point of view, at least try to understand what it's saying first by setting aside your modern point of view for a few minutes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4341.49,"end":4341.89,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4342.37,"end":4342.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4342.81,"end":4346.13,"speaker":"Fr Stephen De Young","text":"Right. And then it may be saying something that's objectionable."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4346.37,"end":4347.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it might."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4348.93,"end":4357.12,"speaker":"Fr Stephen De Young","text":"Right. I mean, you read Aristotle about some people who are just fit by nature to be enslaved, and you ultimately say, no, I think he was wrong on that one."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4357.12,"end":4358.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we've gotten."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4358.52,"end":4361.28,"speaker":"Fr Stephen De Young","text":"Right. But first you have to understand what he's saying and what he means."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4361.6,"end":4362,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4362.24,"end":4363.28,"speaker":"Fr Stephen De Young","text":"Before you do that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4363.36,"end":4366.88,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, yep. Okay. We got 11 more brothers to go."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4367.44,"end":4368,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4368.8,"end":4369.6,"speaker":"Fr Andrew Stephen Damick","text":"So who's next?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4370.72,"end":4372.32,"speaker":"Fr Stephen De Young","text":"Next is a testament of Simeon."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4372.72,"end":4373.28,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4373.6,"end":4404.68,"speaker":"Fr Stephen De Young","text":"Simeon being the second born. So Simeon is the first one that goes to a particular place. So you may be thinking, if you're tracking with this, you may be like, okay, well, yeah, so like, Reuben did this thing and, you know, there's Judah did some stuff and Levi did some stuff, and Joseph. There's lots of stuff you may be wondering, like, well, what about, like, Asher, you know, or Issachar. Right. Some of these guys who there's very little about, like, in the actual book of Genesis."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4404.92,"end":4405.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4405.24,"end":4422.14,"speaker":"Fr Stephen De Young","text":"Where are they going to go most of the time? As we read through these, if there's not an obvious place to go in the book of Genesis about that particular brother, that particular patriarch, they're going to go to the episode where they sold Joseph into slavery."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4422.7,"end":4429.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. The main function of these guys is what is their relationship to Joseph."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4431.34,"end":4478.54,"speaker":"Fr Stephen De Young","text":"Right. So where they were, some of them at least were wanting to kill him. They end up selling him into slavery. Right. So if we've got nowhere else to go with a particular brother, we're mostly going to end up going there. But we're going to see even that one event being looked at from a number of different angles because of that. And the sort of particular angle with Simeon in his testament is that he wanted. The reason he wanted to kill Joseph and had this murderous intent toward him was out of envy. So envy or jealousy is sort of the passion. Right. That that Simeon sort of embodies."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4478.86,"end":4487.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's envy for the way that Jacob loved Joseph best, but also frankly that Joseph is awesome."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4488.77,"end":4510.37,"speaker":"Fr Stephen De Young","text":"In the testament of Simeon, it's even like Joseph was better looking than Simeon. Joseph just like everything about. He's just like a full on hater. Like everything about Joseph was superior to him. And then it boils down to. But it's boiled down and very deliberately to ultimately that Joseph was good."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4511.71,"end":4512.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4513.87,"end":4533.27,"speaker":"Fr Stephen De Young","text":"And that Simeon as a person who was not always so good. Right. The fact that this person who was so good was around him galled him. And there are deliberate shades of Cain and Abel here."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4533.27,"end":4544.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even of frankly, the devil and Adam. Right. You know, there's the sense that the evil one, you know, afflicts mankind out of envy."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4544.55,"end":4563.11,"speaker":"Fr Stephen De Young","text":"Right, right. And that Cain and Abel interpretation, by the way, this is one of the places where some of this surfaces in, in the Johannine literature. In First John. Right. When St. John says why Cain killed Abel, ultimately it's because Abel's works were good and Cain's were evil."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4564.24,"end":4564.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4564.8,"end":4571.12,"speaker":"Fr Stephen De Young","text":"And Cain couldn't stand it. Right. That just brought this hate out of him."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4572.32,"end":4572.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4574.72,"end":4580,"speaker":"Fr Stephen De Young","text":"Another interesting sort of interpretation here is."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4581.52,"end":4581.92,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4585.6,"end":4785.32,"speaker":"Fr Stephen De Young","text":"The, the whole story when. Well, it's a long. It goes for a couple chapters in Genesis when. When the brothers finally come to Egypt during the famine to get fam. Food and they're talking to Joseph and don't realize it's Joseph because he looks like an Egyptian now and they thought he was dead. And he sends them back and forth and he hides the cup and oh, you stole it. All the stuff he does. Right. That could be read in a number of ways. Right. You could read it as just trolling, you can read as a bunch of other things. But the way it's read in the Testament of Simeon is Simeon sees it as sort of a penance. Right. Simeon sees having gone through all that as sort of a corrective to that jealousy and Envy he had. Because if you read it closely in Genesis, the way Joseph set it up, the whole thing was set up to see how his brothers looked at, had been treating, viewed Benjamin, because Joseph knew that with him gone, Benjamin was going to be the favorite, right? That Jacob was going to be doting on him, maybe even more so because he's now the only son of Rachel and he reckoned that that would cause similar problems with the other brothers. And so if you read what Joseph does, the reason he hides the cup in Benjamin's stuff and everything, and he says, oh, I'm going to keep Benjamin here, right? Like as you know, while you go get your father this. And they're freaking out, right? His. He's kind of making them all display what he hoped would happen, their love and concern for Benjamin, their brother, even though they were jealous, Right. And so within the Testament of Simeon, Simeon got that message in the sense that him working through his willingness to do whatever he had to do to save and protect Benjamin taught him and showed him and transformed him from the envy that had become murderous in the case of Joseph. So it's kind of an interesting and deep meditation on the Scripture there. Right. That's not what I would call exegesis, but. But it's an understanding derived from that again of repentance. Of repentance as transformation, and particularly transformation of the passion that was afflicting him, of the sin that had taken control of him. The Testament of Simeon is also where we find our first prophetic piece that seems very clearly messianic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4785.72,"end":4837.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is so cool and kind of unexpected unless you, you know, know that you should be looking for this kind of thing. Yeah. So this is from the. And again, this is the Charlesworth Versification, chapter 6, verses 5 through 7. It says this. Then Shem will be glorified because God the Lord, who is great in Israel, will appear upon earth as a man by himself, he will save Adam. Then all the spirits of error will be handed over to be trampled upon and men will have command over evil spirits. Then will I arise in gladness and I will bless the Most High for his wonders. Because God has taken a body to eat with human beings and to save human beings. Remember, this is BC, folks. This is bc yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4837.9,"end":4853.7,"speaker":"Fr Stephen De Young","text":"Now, of course, right. Some scholars, those most influenced by our 19th century German friends argue just de facto. Oh, this was added by Christians."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4854.42,"end":4854.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4857.63,"end":4931.84,"speaker":"Fr Stephen De Young","text":"Right. Why? Because it's too on the nose, right? It's too on the nose. This has to be sort of a Christian thing. But you Know, given that they have no actual evidence or basis for that. Right. Let's pause and think about it a little bit. Okay. Look at, say Baruch, the Book of Baruch, which is one of the books that's in the Orthodox and Roman Catholic Old Testaments, not in the Protestant Old Testament, but incontrovertibly a pre Christian Jewish book. Right. Jewish text which says in it God has appeared upon earth and dwelt among men. Right. Now, of course, Christians take that and interpret it Christologically. Right. Just as Christians reading this would take it interpret Christologically. But that doesn't mean it's a Christian interpolation. It doesn't mean it's a post Christian text."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4932.16,"end":4932.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4932.8,"end":4934.08,"speaker":"Fr Stephen De Young","text":"Just because it's read that way."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4935.53,"end":4935.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4936.65,"end":4945.77,"speaker":"Fr Stephen De Young","text":"And you know, you don't even get out of the book of Genesis before you see God taking a body and eating with human beings."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4946.33,"end":4948.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4949.05,"end":4959.93,"speaker":"Fr Stephen De Young","text":"And it happens again in Exodus. Right. And if this is a Christian interpolation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4962.01,"end":4967.41,"speaker":"Fr Andrew Stephen Damick","text":"Why the exorcism stuff, trampling upon spirits and so forth."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4967.41,"end":4970.17,"speaker":"Fr Stephen De Young","text":"And what man will have command over evil spirits?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4970.49,"end":4970.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4972.17,"end":4990.34,"speaker":"Fr Stephen De Young","text":"Like this is big time second temple Jewish stuff, exorcism stuff. Right. But like second third century A.D. christian literature. How much of that do you see? Yeah, answer. Not tons."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4990.74,"end":4996.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is, this is completely of a piece with pre Christian literature."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4996.14,"end":4999.62,"speaker":"Fr Stephen De Young","text":"Yeah, there's. There's stuff like this all over pre Christian Jewish literature."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":4999.62,"end":5000.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lots of press."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5000.62,"end":5005.86,"speaker":"Fr Stephen De Young","text":"This is the stuff the Christians picked up on. Yeah, yeah, absolutely."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5005.94,"end":5011.46,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, I mean, it would make sense also why Rabbinic Judaism was kind of like not interested in reading this stuff anymore."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5011.46,"end":5076.5,"speaker":"Fr Stephen De Young","text":"Yeah, but that doesn't mean. Right. That doesn't mean that it somehow has to be post Christians. Right. The early Christians from the apostles on were reading the Hebrew scriptures and other Jewish literature. That's where they developed their religious understanding from. They were Jewish. Right. But there were things that they found there that they were applying to Jesus of Nazareth as the Messiah. That shaped their understanding of Jesus of Nazareth as the Messiah that were actually there before Jesus was born. Yeah, that's how that works. Right? Yeah. So we're going to see. I'm belaboring it now. I'm going to belabor it less. There's going to be more examples of this. Yes, I'll belabor it less then. Not zero, but less."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5076.74,"end":5089.14,"speaker":"Fr Andrew Stephen Damick","text":"And this is probably one of the reasons why this is a good intro text if you're going to start reading some of these apocrypha, because a Christian will see all kinds of linkages yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5089.46,"end":5094.07,"speaker":"Fr Stephen De Young","text":"If you're going to go around and yank out everything that sounds Christian, you're going to have to get rid of half the Hebrew Bible."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5096.14,"end":5096.94,"speaker":"Fr Andrew Stephen Damick","text":"True facts."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5097.66,"end":5099.42,"speaker":"Fr Stephen De Young","text":"Like, it doesn't make sense."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5099.74,"end":5100.38,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5100.54,"end":5101.98,"speaker":"Fr Stephen De Young","text":"Dog don't hunt. Anyway."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5102.14,"end":5105.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Testament of Simeon. All right, so who's up next?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5105.42,"end":5126.67,"speaker":"Fr Stephen De Young","text":"Thus suffice it for the Testament. So the Testament of Levi, next up. This is one of the ones that we know circulated independently because we have that Qumran, for example, a separate copy of it, like just by itself, without the collection."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5126.83,"end":5127.11,"speaker":"Fr Andrew Stephen Damick","text":"Just."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5127.11,"end":5158.32,"speaker":"Fr Stephen De Young","text":"Here's the Testament of Levi. This is one we know was originally a separate independent document. Further testimony to that is this is the text that we have at the copy at Mount Athos, as we mentioned in the first half. That is in Greek, but the copyist had the Aramaic version."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5158.8,"end":5159.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5159.68,"end":5223.47,"speaker":"Fr Stephen De Young","text":"And annotated the Greek version, put in margin notes all the places where the Aramaic version was different or a little different or could be read differently. So we have an incredibly high level of detail in terms of the text of this one. And it's also. It's also important to note in terms of the whole collection because we're just talking about stuff that seems kind of on the nose Christian. Right. There's also elements of this, like one of the main elements of the whole text that really gets brought out, starting with the Testament of Levi that was completely abandoned by Christianity. Right. We'll talk about that in a minute. So it's not that this whole text reads like a Christian text. There's a reason why this is in the Apocrypha category. Right. This is a conglomeration of a whole bunch of Second Temple Jewish traditions, some of which are part of the inheritance of Christianity and some of which Christianity left behind."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5224.03,"end":5225.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Stuff gets sifted."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5225.79,"end":5267.7,"speaker":"Fr Stephen De Young","text":"Right. This isn't scripture. Right. So, but so Levi, as you might expect, Right. The Levites are, you know, the priesthood. Aaron is a Levite, Moses is a Levite, and the Levites at all assist the priests. So you might imagine the Testament of Levi would have something to do with the priesthood. There's a problem there, though, in that Levi himself. Right. Like the person Levi, the son of Jacob in Genesis, not really a priest in any special sense."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5269.22,"end":5270.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5270.62,"end":5280.9,"speaker":"Fr Stephen De Young","text":"So, I mean, he was a priest in his household. He was a priest in the extended family. Sure. All those priestly roles. Yeah. But he wasn't a priest in a special sense that his brothers weren't."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5281.48,"end":5283.56,"speaker":"Fr Andrew Stephen Damick","text":"Levi was not a Levitical priest."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5285.72,"end":5314.14,"speaker":"Fr Stephen De Young","text":"Right. So all that happens later in the Torah. Right. We've talked about that on the show with Aaron and Phinehas and the Levites at the episode of the Golden Calf, where the priesthood is kind of taken away from the other tribes and given to them in a special way. But that didn't happen with Levi. And so the information we have in Genesis about Levi is sort of recast in the Testament of Levi. To kind of make him one."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5315.58,"end":5316.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5316.38,"end":5335.18,"speaker":"Fr Stephen De Young","text":"To kind of make him the archetypal sort of priest. And so the way that that's done is what we have in Genesis about Levi. Probably the most notable thing that Levi, the person does in Genesis is leading the massacre of all the men of Shechem."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5336.46,"end":5340.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To prevent intermarriage with."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5340.69,"end":5341.81,"speaker":"Fr Stephen De Young","text":"Well, not in Genesis."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5341.81,"end":5345.13,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, sorry. So sorry. Yeah, yeah. Oh, yeah, sorry. In this text, that's what it is."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5345.13,"end":5346.93,"speaker":"Fr Stephen De Young","text":"Yeah. So it gets changed a little. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5346.93,"end":5348.21,"speaker":"Fr Andrew Stephen Damick","text":"I'm getting it mixed up now."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5348.21,"end":5351.57,"speaker":"Fr Stephen De Young","text":"Yeah. So in the text of Genesis."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5353.33,"end":5353.73,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5353.73,"end":5363.89,"speaker":"Fr Stephen De Young","text":"Sister of these 12 brothers, Dinah, is sexually attacked by. That's right, the men of the city of Shechem."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5364.47,"end":5364.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5365.83,"end":5391.19,"speaker":"Fr Stephen De Young","text":"And the brother. The village of Shechem, I should say. And the brothers want revenge for what was done to their sister. And so Levi leads them and going and talking to them and convincing them all to get circumcised. And while they're recovering from having been circumcised, he leads the brothers, they go through and they massacre all the men of the town."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5393,"end":5393.32,"speaker":"Audience Member","text":"Wow."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5393.72,"end":5460.15,"speaker":"Fr Stephen De Young","text":"While they're trying to recover. And then Jacob, of course, gets very angry because he's like, word of this is going to get around. People will come after us. Right. Like you've started this cycle of revenge. Right. This is seen as a bad thing in the text of Genesis. Okay. But now, Testament of Levi, we have a goal. We want to make Levi the archetypal priest. And so this whole incident gets sort of recast in a different way. Right. And so we have this massacre at Shechem, and we have an author who is familiar with the rest of the Torah and the rest of the Hebrew Scriptures, who. Who says, well, you know what? There's a whole bunch of people later on in the Hebrew Scriptures who receive the priesthood based on killing a lot of people. Right. To stop incidents of, like, idolatry and sexual immorality and that kind of thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5460.39,"end":5460.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5460.95,"end":5485.69,"speaker":"Fr Stephen De Young","text":"They take this kind of violent action and are rewarded with the priesthood. So. Right, let's. Let's massage this a little bit. And so in the Testament of Levi, it is not that Dinah gets sort of sexually assaulted, it's that Jacob is going to Marry Dinah to a Canaanite."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5486.17,"end":5490.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which would make her the wife of an idolater from this family."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5490.57,"end":5526.76,"speaker":"Fr Stephen De Young","text":"Right. And. Yes. And so Levi and the brothers are right to think that this is horrible and Jacob is in the wrong. And so Levi goes and gets up circus eyes and then massacres them all in order to sort of restore justice and correct this and prevent that intermarriage from taking place. Right. So that's an interesting sort of massage that doesn't entirely work."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5527.08,"end":5527.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5527.48,"end":5562.16,"speaker":"Fr Stephen De Young","text":"But then in the Testament of Levi, we kind of quickly move past that to now, Levi's reward. He makes this sort of mystical, apocalyptic ascent into heaven. Right. And once he's been brought up into the heavens, he is vested with the high priest vestments, even though those aren't going to be made until later in the Book of Exodus, long after he's dead. But that is done in that way because this text is attempting to present the Levitical priesthood as eternal."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5563.2,"end":5568.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And therefore including Levi as the fountainhead of that priesthood."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5568.64,"end":5623.08,"speaker":"Fr Stephen De Young","text":"Right, right. Levi is this sort of eternal archetype of the priesthood. And so we've talked before when we talked about messiahs, that there were a number of Jewish groups looking for more than one messiah. Right. The Testament of the twelve Patriarchs is one of those texts that talks about two. One of them is a priestly Messiah, and then we're going to see in the next Testament a kingly Davidic Messiah, the Messiah we're more used to talking about and thinking about. But the priestly Messiah here is explicitly going to restore the Levitical priesthood, which is seen as eternal. So this is one current in Second Temple Judaism."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5623.88,"end":5639.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And again, this is one of these things that as Christians, we look at and say, okay, well, that's not quite right. There's one Messiah who has both these roles. It's not the Levitical priesthood, his own. You know, like, that's why you sort of sift these things. That's why it's not scripture, you know?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5639.86,"end":5673.19,"speaker":"Fr Stephen De Young","text":"Yeah. And there are other currents like we've talked about before in the Melchizedek episode. Right. And we'll talk about more as we talk about some of these texts. There's also this current that sees the priesthood of Melchizedek Psalm 110. Right. As the paradigm for a new priesthood in the New Covenant. So it's not a restoration of the Levitical priesthood. It's the Levitical priesthood is superseded by this other priesthood and Christianity. See, the Book of Hebrews picks up that other current."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5673.67,"end":5675.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. It says this is correct."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5675.59,"end":5699.97,"speaker":"Fr Stephen De Young","text":"Right. But so this has this idea of this priestly Messiah and the restoration of the Levitical priesthood. What everybody agrees about is that by like the 1st century BC, the 1st century AD the Levitical priesthood was a mess and in disrepair. The Sadducees stunk. Everyone except the Sadducees was on that page. Right. But what the solution was going to be, there were different ideas."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5700.29,"end":5700.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5702.93,"end":5738.46,"speaker":"Fr Stephen De Young","text":"So the testament of Levi also directly quotes First Enoch for the first time, says Enoch. Our forefathers said it's a quote from First Enoch. But another important distinction, and this is going to carry through for the whole rest of the testaments of the twelve patriarchs, is that not only are they there, these two figures, the priestly Messiah and the royal or kingly Messiah as two figures, but the priestly Messiah and the testament of the twelve patriarchs is the one that's on top, is the most important one."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5741.19,"end":5741.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5742.23,"end":5883.42,"speaker":"Fr Stephen De Young","text":"So if what we see in the Hebrew Scriptures is that we see king and high priest more in. This is anachronistic, but more in the Byzantine mold of emperor and patriarch. Right. The idea that there's this kind of symphonia, right. There's these two spheres. Yeah, right. There's sort of a civil sphere over which the king is in charge and there's a sacrificial sphere of worship over which the high priest is in charge. Right. In terms of what we see in, in the Hebrew Bible in the Old Testament, this is arguing that in, in the restoration of all this, when the messiahs in this case come, that the priesthood is going to be elevated above the kingship, that that relationship is going to change. Right. Now, again, the Christian tradition picked up the stream that they're going to be merged in the figure of the Messiah. Again, see Hebrews, but this is a different kind of anticipation, right, where, where the priesthood is going to be elevated over it. And so that is likely picking up on sort of the ambivalence about kingship in First Samuel and that kind of thing. Right. The idea being that, well, clearly based on Deuteronomy, based on the Torah, there was going to be a king. But maybe the problem was that it should have stayed kind of a theocracy with the king as a player in it. Right. This is sort of early, early Jewish political theory in terms of what we would call the relationship between church and state, but reflects one of the primary things that Second Temple Jewish groups were reflecting on was what went wrong and why did it go wrong? Because it's very clear that the Hebrew Bible, the Old Testament is a story of things going wrong."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5884.22,"end":5892.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It is not the tale of a glorious civilization and its glorious leaders. Like, this is not pagan story."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5893.58,"end":5952.97,"speaker":"Fr Stephen De Young","text":"Right. They were anticipating the restoration being permanent. Right. Part of it being a true restoration would be it's not going to all fall apart again. And so you find a lot of ideas being cast in terms of, well, how is this going to be different than the last time? So that this doesn't all repeat itself. Right. This cycle doesn't just repeat. And so testimony of Levi advances one possible answer that didn't end up being correct. There may be, I don't know, there may be some groups out there in rabbinic Judaism who have something similar to this, who think there's going to be a restoration of the priesthood and that it's going to be. That it is going to take power over the civil government. I don't know. But if you're part of such a group, call in now and let us know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5953.21,"end":5954.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5954.81,"end":5972.33,"speaker":"Fr Stephen De Young","text":"No fakes. So then next up, fourth brother Testament of Judah. And so this is. Now we're going to talk about the Messiah we're more familiar with. Right. Because Judah is the tribe that David comes from."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5972.65,"end":5983.06,"speaker":"Fr Andrew Stephen Damick","text":"That's right. I mean, this is the one where Jacob, in his. In the biblical testament of Jacob, you know, he says the scepter will not depart from Judah. Right, right, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":5983.06,"end":6001.42,"speaker":"Fr Stephen De Young","text":"Right. Talks about him tying up his colt next to a vine and his milky teeth and bloody wine and all that stuff. I mean, we. We just heard this like two weeks ago Saturday."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6001.5,"end":6002.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6005.11,"end":6021.67,"speaker":"Fr Stephen De Young","text":"But, yeah, so this is. This is sort of our. Our thing. We have a slight similar issue to what we had with Levi in that Judah himself, the person, the son of Jacob, wasn't really the king of anything."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6022.31,"end":6035.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So again, you got to kind of project it backwards onto him, which Jacob, you know, kind of gives us the key to do anyway. Right. He. He says that. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6035.13,"end":6061.22,"speaker":"Fr Stephen De Young","text":"So, right. About the descendants. But also the thing with Judah is you also can't sort of do what you did with Levi. The sense that you can't have him being taken up into heaven and being made the archetypal king, because it doesn't really work the same way. So we've got to come at this in a little different direction. And the way to do that is we just portray Judah as like the ultimate warrior. Right, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6061.94,"end":6069.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's what a king is back in the day. He's the one who goes in and comes, you know, goes out and comes in as it. As it says in the Bible."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6069.3,"end":6086.34,"speaker":"Fr Stephen De Young","text":"Yeah. So we just get the daring exploits. Right. And a lot of these daring exploits are kind of stolen from other figures of the Hebrew Bible. Right. So like he rips a lion in half with his bare hands. When he defeats it, he goes and."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6086.34,"end":6086.66,"speaker":"Audience Member","text":"He."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6088.9,"end":6129.88,"speaker":"Fr Stephen De Young","text":"Kills a giant by throwing a rock at it. You're kind of like, where did that? I read that somewhere else. So there's a lot of that kind of thing. We get all these exploits of Judah going out and kicking butt and taking names. But we also have this stuff though, from Genesis about Judah, like the whole Judah and Tamar thing and the fact that Judah himself married a foreign wife, which we've just established with the Levi thing is very bad."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6130.52,"end":6130.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6132.52,"end":6145.17,"speaker":"Fr Stephen De Young","text":"So we've got to mesh these two things together. Right. How do you mesh that together? Well, if we've already portrayed Judah as being hard living, so now we just also have him being hard. Drinking."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6148.05,"end":6149.25,"speaker":"Fr Andrew Stephen Damick","text":"Drink hard, play hard."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6149.49,"end":6161.25,"speaker":"Fr Stephen De Young","text":"Yeah. So the Testament of Judah takes the perspective that all that bad stuff that Judah did, he did that while he was drunk. He did too much partying."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6162.05,"end":6169.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which then sets up this question of being ruled by, you know, a bad spirit. Pun fully intended."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6170.42,"end":6179.46,"speaker":"Fr Stephen De Young","text":"Right, right. So he, he takes the passions as being spirits, as being unclean spirits. Very literally."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6180.1,"end":6180.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6180.98,"end":6260.25,"speaker":"Fr Stephen De Young","text":"And it talking to his descendants, he says, you could be led by the spirit of God or you could be led by these other spirits. Right, right. Of the passions and spirits that come in a bottle. Related usage. But so, and this. Right. Reflects his descendants in a particular way. Right. Because what did, where did David go wrong? Women. Yeah, yeah, right. Started multiplying wives. Where did Solomon go wrong? Also women, same place. Right. So he's speaking to his descendants, saying, look, you know, I'm this awesome dude doing all this awesome stuff, but you've gotta, you've gotta still exercise self control. Right. And alcohol, alcohol here, drunkenness becomes sort of the, the, the label or heading under which all forms of self control. Right. Take place. And it's kind of inappropriate one because, you know, as you become drunk, you lose your inhibitions."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6263.37,"end":6263.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6264.65,"end":6314.71,"speaker":"Fr Stephen De Young","text":"They knew that back then. They saw it happen. Right. So even if you are a relatively self controlled person, drunkenness is going to erode that self control. So within the Testament of Judah, again, we get an idea of when everything is restored, when everything is fixed, when the Messiahs, the multiple Messiahs come, that the tribes are going to be put back in order, Israel is going to be put back together and put back in order. And when it's put back in Order. There's going to be an order of the tribes, like an order of inheritance among the sons. But it's not birth order."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6315.11,"end":6318.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a different precedence. Order of precedence."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6318.87,"end":6348.81,"speaker":"Fr Stephen De Young","text":"Right. And as we mentioned, in the testament of Levi, Levi becomes number one. Levi becomes the first tribe, becomes the one in charge. Then Judah, who you have the messianic king coming from. Then, interestingly, Joseph, meaning particularly Ephraim. Ephraim being the tribe from which most of the kings of the northern kingdom came. The capital, Samaria, wasn't all that. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6348.81,"end":6360.18,"speaker":"Fr Andrew Stephen Damick","text":"Okay, go ahead. I was just saying just to remind everybody in case you're like, wait, tribe of Joseph? There's no tribe of Joseph. That's because there's these, as scripture calls them, the two half tribes, you know, Ephraim and Manasseh."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6360.42,"end":6377.22,"speaker":"Fr Stephen De Young","text":"Right. And Ephraim is the Main 1. Genesis 48. Ephraim is treated as his firstborn and was the largest of the 12 tribes. Well, I was going to say, you know, you may be thinking, wait a minute, they don't exist anymore."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6378.66,"end":6379.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6379.56,"end":6385.08,"speaker":"Fr Stephen De Young","text":"At the time this is being written. Yeah, Put a pin in that. Put a pin in that. We'll come back to that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6385.32,"end":6385.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6385.96,"end":6398.6,"speaker":"Fr Stephen De Young","text":"In later testaments. And then fourth is Benjamin, the other son of Rachel, but also Benjamin, Remember what tribes actually were still around when this was being written?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6398.76,"end":6403.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Basically Judah, Benjamin, Levi, Judah, Benjamin. Yeah. Yep."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6404.2,"end":6426.7,"speaker":"Fr Stephen De Young","text":"Because Benjamin stayed. Stayed loyal to Judah and didn't join the northern kingdom. But then there's. There's Joseph in there. We'll come back to it. Yeah. And so we see here, reflected again, the idea that there's these two messiahs, one priestly and one kingly. So number five, the testament of Issachar."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6426.94,"end":6431.91,"speaker":"Fr Andrew Stephen Damick","text":"Issachar, coolest name in my opinion. Of the 12 brothers, he's got."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6431.91,"end":6432.59,"speaker":"Fr Stephen De Young","text":"Fails to deliver."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6433.15,"end":6433.71,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6433.79,"end":6435.71,"speaker":"Fr Stephen De Young","text":"In terms of actual content of Bible."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6436.03,"end":6439.31,"speaker":"Fr Andrew Stephen Damick","text":"I know. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6441.31,"end":6463.23,"speaker":"Fr Stephen De Young","text":"So, yeah. So Issachar, there's not much about in. In Genesis, but there is actually something about the circumstances of his conception. And so that's where this Testament goes. We probably should have put a parental advisory at the beginning of this episode."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6463.95,"end":6464.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6464.39,"end":6487.33,"speaker":"Fr Stephen De Young","text":"Oh, well, too late now. Yeah. So in Genesis, again, a story in Genesis. A lot of these stories in Genesis we've been talking about tonight are not the ones they based your Sunday school lessons on when you were seven, for obvious reasons."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6487.41,"end":6488.21,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. No."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6490.61,"end":6519.26,"speaker":"Fr Stephen De Young","text":"So there is this episode in Genesis that's recounted where Leia has a bunch of mandrakes. Leia, the wife of Jacob, and Rachel, the other wife of Jacob, her sister Wants some of the mandrakes. Leia agrees to give Rachel some of the mandrakes if Rachel will give up one of her turns sleeping with Jacob."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6521.34,"end":6524.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, just a lot of layers there."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6524.38,"end":6601.11,"speaker":"Fr Stephen De Young","text":"Yeah. And so this is a. This is an odd story. Now, the mandrakes, the whole issue of the mandrakes is that they believed at the time that, I don't know, maybe it's true if you're a doctor or an herbalist, call in, but they believed at the time that mandrakes aided with female fertility. So the idea here is that Rachel, remember, was having trouble conceiving children. Leia already had a bunch of sons, bunch of kids with Jacob, Rachel was having trouble conceiving. She wanted to conceive. That's why she wants the mandrakes. Right. To help her get pregnant so she can have babies. And so Leah exchanging those to Rachel in order to sleep extra with Jacob is interpreted by the testament of Issachar as Leah wanting to sleep with Jacob for pleasure rather than procreation. Whereas Rachel was focused on procreation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6601.83,"end":6602.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6602.95,"end":6639.82,"speaker":"Fr Stephen De Young","text":"On having a baby. And within this, Rachel is seen to be the one who is choosing the better path. So the idea here is about marital chastity, what we would now call marital chastity, meaning, which does not mean celibacy within marriage. Right. There is no form of Judaism."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6642.54,"end":6642.9,"speaker":"Fr Andrew Stephen Damick","text":"Past."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6642.9,"end":6648.86,"speaker":"Fr Stephen De Young","text":"Or present and probably future, that saw celibacy within marriage as a good."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6650.62,"end":6652.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6652.86,"end":6669.26,"speaker":"Fr Stephen De Young","text":"The New Testament, which was written by a bunch of Jewish people, does not see celibacy within marriage as a good. I will leave it at that because we have Roman Catholic friends listening."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6673.26,"end":6674.78,"speaker":"Fr Andrew Stephen Damick","text":"And some other friends too."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6674.86,"end":6732.2,"speaker":"Fr Stephen De Young","text":"But chastity within marriage is a different thing. Yeah, right, yeah. Chastity within marriage has to do with the way in which sexual desire functions between a married couple. And, sorry, St. Augustine, as St. Paul said, the marriage bed is holy and undefiled. Not all sexual expression, especially within marriage. Right. Between a husband and a wife, is tainted by lust. It simply isn't. Right. But the sin of lust can certainly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6732.2,"end":6732.52,"speaker":"Audience Member","text":"Happen."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6734.55,"end":6736.31,"speaker":"Fr Stephen De Young","text":"Within and between a married couple."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6736.55,"end":6737.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6738.23,"end":6767.57,"speaker":"Fr Stephen De Young","text":"Right. And the. The key, as the Testament of Issachar sees it, the key to maintaining chastity within marriage, within. With the marriage wedding remaining holy and undefiled, is that sexual expression always remain coupled with the idea of procreation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6768.37,"end":6768.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6769.17,"end":6799.42,"speaker":"Fr Stephen De Young","text":"The idea of bringing new life into the world. Not that it happens every single time. Right. Or should happen every single time, etc. Etc. Right. There are multiple purposes to sexual expression within marriage. But whenever procreation is excluded from the picture. Right. Things go to bad places very quickly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6799.9,"end":6801.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6802.14,"end":6829.74,"speaker":"Fr Stephen De Young","text":"Whenever that's removed. Beyond that. So that. That all had to do with the circumstances of Issachar's conception. Right. So that's. That's here. Issachar. You know, I find it odd that a dying man wanted to tell his sons about how he was conceived by their grandparents. But, hey, that's what happens here."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6831.02,"end":6831.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6833.1,"end":6841.03,"speaker":"Fr Stephen De Young","text":"And. But then beyond that about him as a person, he is sort of. He's presented as a farmer."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6841.83,"end":6842.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6842.47,"end":6862.79,"speaker":"Fr Stephen De Young","text":"He devoted his life to farming. And so there's an expression here of sort of agrarianism, the life of the farmer working the ground, bringing forth food to provide for himself and his family as virtuous. Right. The sort of virtue of his labor."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6863.38,"end":6870.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, kind of analogously linked to the whole fertility, procreation thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6870.18,"end":6889.15,"speaker":"Fr Stephen De Young","text":"Right, right. To present this overall picture of. So this is sort of. We had the negative picture. Right. Of here's where things went wrong. Find love with the wife of your youth. This is more a picture of what that looks like in a positive sense. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6889.55,"end":6890.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6890.43,"end":6939.97,"speaker":"Fr Stephen De Young","text":"You marry, you have kids, you work hard, you support yourself and your family. Right. He sort of, as St. Paul would later put it in terms of what we should aspire to. He lived a quiet and peaceful life. Right. In godliness and sanctity. And the text of the Testament of Issachar really wants to point out that sort of. That life that Issachar led is just as heroic and just as noble as Judah with all his exploits. Right. And all the excitement, all the action and adventure going on over there. Right. This quiet life that Issachar leads is just as noble and heroic as that. Right. Sort of a central concern. So then, Number Six."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6940.69,"end":6941.25,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6941.41,"end":6944.26,"speaker":"Fr Stephen De Young","text":"To round out second half, also the."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6944.26,"end":6952.46,"speaker":"Fr Andrew Stephen Damick","text":"Name of a town in North Carolina, The Number Six. Yes. Well, not Number Six, but the content of Number Six."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6952.7,"end":6953.66,"speaker":"Fr Stephen De Young","text":"Oh, okay, okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6953.66,"end":6954.38,"speaker":"Fr Andrew Stephen Damick","text":"Zebulun."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6954.7,"end":6957.02,"speaker":"Fr Stephen De Young","text":"Oh, okay. The Testament of Zebulun. Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6957.02,"end":6957.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6958.86,"end":6964.26,"speaker":"Fr Stephen De Young","text":"That would be cool if there's a town called Number Six. I'm from Number Six, North Carolina. Everybody be like, what?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6964.26,"end":6972.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Zebulun. It's near Raleigh. It's on the east side of Raleigh. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6976.95,"end":6979.99,"speaker":"Fr Stephen De Young","text":"Zebulun presents himself, interestingly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6983.03,"end":6983.43,"speaker":"Audience Member","text":"Right at."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":6983.43,"end":7020.77,"speaker":"Fr Stephen De Young","text":"The beginning as only having committed sins of thought and sins of ignorance in his whole life. So he's dying and talking to his sons. And that may just sound weird, Right. But the point of. Point of it is that he's making two important distinctions here about sin. They're kind of advanced distinctions that again will play out in Christian monastic literature and other places. One, of course, is between sins of thought and action."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7024.22,"end":7024.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7025.9,"end":7030.62,"speaker":"Fr Stephen De Young","text":"Namely that the. That you can sin in thought even if you don't do something."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7031.98,"end":7032.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7032.86,"end":7037.18,"speaker":"Fr Stephen De Young","text":"And this idea is, of course, one of Christ's major themes in the Sermon on the Mount."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7037.74,"end":7039.42,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7039.42,"end":7045.1,"speaker":"Fr Stephen De Young","text":"You look at a woman lustfully, you've already committed adultery in your heart, even if you haven't gone and taken any action."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7045.58,"end":7045.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7046.38,"end":7053.68,"speaker":"Fr Stephen De Young","text":"If you hate your brother in your heart, you've already killed him. Even if you've already broken the commandment about murder, even if you don't go and actually harm him. Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7053.68,"end":7057,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is. This is not something new in the Gospels."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7059.72,"end":7066.68,"speaker":"Fr Stephen De Young","text":"And then secondly, he says he's committed sins of ignorance. Right. And that's the distinction between sins of knowledge and sins of ignorance."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7067.48,"end":7067.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7067.88,"end":7076.6,"speaker":"Fr Stephen De Young","text":"That you don't have to sort of be consciously deciding to do something bad in order to have sinned."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7078.85,"end":7078.97,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7078.97,"end":7152.95,"speaker":"Fr Stephen De Young","text":"That you could sin unthinkingly. Right. That. That your intent is not the only thing that matters. Right. And the Testament of Zebulun is arguing really that not only are these things sin. Right. Are there sins of thought and sins of ignorance that are truly sin, but it really wants to argue that they're just as bad. Right. That even though he starts out by saying, these are the only kinds of sins I've committed, he's not saying that to say, therefore I'm better than most of you. He's saying that to say, even though that's true, I'm still a sinner. Right. And again, as we've seen in a couple, and we'll see in a couple more, he goes back to the attempted murder of Joseph, his brother. And if you go read that story in Genesis, Zebulun isn't mentioned in it. The sense that, like, he didn't weigh in, he didn't say anything on either side. He didn't say we should kill him. He didn't say, no, we shouldn't. He didn't say anything. And that's what the Testament plays off of."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7153.03,"end":7159.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So here's. There's a kind of a sense of like, you let it happen and that means you're responsible as well."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7159.9,"end":7240.83,"speaker":"Fr Stephen De Young","text":"Right. That he's an accomplice. Right. Like he wasn't the one motivating it, but he didn't do anything to stop it either. Right. And so he participated in it just as much as the brothers who were there and were talking and were making the decisions, because he was there and went along with it and did nothing. And so this is a very nuanced and developed view of sin and of participating in the sins of others. And you could see how, again, not only does a lot of monastic literature and even examples in the New Testament sort of grow out of these kind of ideas, but you could see how further meditations on sin and the understanding of sin and the Fathers. Right. How this is sort of a link between the Hebrew Scriptures and those kinds of understandings in terms of how Zebulun spent his life in a positive sense, he's kind of paired off with Issachar in a certain way in that he's presented as a fisherman. He actually claims to have invented the boat, the sail and the rudder, which is a little. A little fishy, pardon the pun, given that, you know, Noah's Ark had already happened."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7240.99,"end":7244.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is, you know, no sail and no rudder, but definitely a boat."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7244.94,"end":7253.74,"speaker":"Fr Stephen De Young","text":"Definitely a boat. But he. He's. This is not for the purposes of travel. This is for the purposes of fishing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7254.14,"end":7254.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7254.58,"end":7273.7,"speaker":"Fr Stephen De Young","text":"And so he's kind of presented parallel to Issachar, like he's a farmer of the sea. Instead of going to the ground and bringing food out of the ground, he's going and bringing food out of the sea and using the fish he catches to provide not only for himself and his family, but it makes the point to also provide for the poor and those in need."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7274.65,"end":7274.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7277.77,"end":7326.06,"speaker":"Fr Stephen De Young","text":"So that's sort of an emphasis on. So again, right, if. And that. That's parallel to the earlier part. Right. So if on the one hand, we want to make the point that these sort of sins of ignorance, sins of thought, participating the sins of others is also serious sin. Right. Then the contrast to that, Right. The repentance of that is then that you not only provide for yourself and your family, but you also then go and provide for others in a positive way. Right. You participate in doing good for others. And so we see sort of with Issachar and Zebulun, a presentation of the kind of life that should be pursued, not just the kinds of sins that should be avoided."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7326.78,"end":7337.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, we've done half the brothers, so we've got six more to go. And we'll handle those six when we get right back on this episode of."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7337.5,"end":7354.7,"speaker":"Announcer","text":"The Lord of Spirits, Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8-855-AF-RADIO."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7367.82,"end":7409.59,"speaker":"Podcast Advertisement Voice","text":"We venerate your immaculate icon, O good Lord, and entreat you to forgive our offenses, O Christ, our God. By your own choice, you were pleased to ascend the cross and to deliver us whom you created from our slavery to the foe. Therefore, we cry to you with gratitude. You have filled all things with joy, O our Savior, by coming to save the world. AthoniteUSA.com offers holy icons for those wishing to plant something spiritual in their souls. Immaculate 22 karat gold leaf, hand applied on solid wood. Use the code Faith for free shipping. Come and see athaniteusa.com."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7413.03,"end":7429.11,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7430.16,"end":7459.45,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third and probably final half of this episode of the Lord of Spirits. We're talking about the testaments of the twelve Patriarchs, an apocryphal text from a century or two before Christ. And before we move on with the final six of these testaments, we're going to take a couple calls. So we've got our old friend Samuel from Virginia, who I don't know. I think, Samuel, you might be the most frequent caller we've had. What do you think? Have you counted how many times you've been on the show?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7460.09,"end":7460.65,"speaker":"Audience Member","text":"A few."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7461.21,"end":7463.85,"speaker":"Fr Andrew Stephen Damick","text":"A few. That seems about right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7466.01,"end":7468.01,"speaker":"Audience Member","text":"It feels good to say that he."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7468.01,"end":7470.49,"speaker":"Fr Stephen De Young","text":"Truly is a number, a sufficient number."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7473.13,"end":7480.49,"speaker":"Fr Andrew Stephen Damick","text":"A certain number. So what is on your mind tonight, Samuel from the Holy Land of Virginia?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7481.13,"end":7506.87,"speaker":"Audience Member","text":"I was wondering, it occurred to me last week actually that, well, Judah was one of the things he's famous for is betraying his brother. And in the New Testament, there's someone with the same name who's also famous as a betrayer. How much did the early church discuss that coincidence of names?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7509.2,"end":7535.28,"speaker":"Fr Andrew Stephen Damick","text":"I, I don't know. But I'll, before I hand it over to Father, I will at least say that there's another Judah, Jude, Judas in the 12. Right. Who didn't betray Christ, which is why, you know, it occasionally says Judas, not Iscariot said, or Judas, who would betray him said. So we have to remember this is a really common name. Is there any comparison made between the two? Father?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7537.81,"end":7540.21,"speaker":"Fr Stephen De Young","text":"Yeah, not, not that I know of."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7542.61,"end":7551.81,"speaker":"Fr Andrew Stephen Damick","text":"Not that. Yeah. I mean, like we, you know, we think of Judas and we have this one idea about Judas, he's the betrayer. But it's a really common name."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7552.29,"end":7552.69,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7552.69,"end":7553.09,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7553.09,"end":7556.13,"speaker":"Fr Stephen De Young","text":"Oh, yeah, no, no. I mean, it's just Judah. Yeah. So I mean."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7556.13,"end":7560.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, one of the books of the New Testament is one of Christ's brothers."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7560.33,"end":7568.45,"speaker":"Fr Stephen De Young","text":"Yes. Right, dude. Yeah. I'm really trying to think if there's any."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7568.93,"end":7572.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't think there's definitely not anything in the New Testament that goes in that direction."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7572.45,"end":7573.65,"speaker":"Fr Stephen De Young","text":"No, no. But you get."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7573.97,"end":7574.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7574.37,"end":7586.37,"speaker":"Fr Stephen De Young","text":"Most of what you get that's focused on Judah, the person is more about the Judah and Tamar episode, especially since Tamar shows up in Christ's genealogy."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7587.5,"end":7587.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7590.14,"end":7624.31,"speaker":"Fr Stephen De Young","text":"So you, you, you get, you get more about that. And that stuff is usually the typical. Well, when they talk about his foreign wife, you get the typical gentile stuff. Do you know what I mean by that? Like one of the go tos of the church fathers in interpretation is anytime somebody marries a foreigner, that's typological of Christ being betrothed, betrothing the gentile church to himself."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7624.63,"end":7636.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. I'm gonna have to say I don't think there's really much for that dog to hunt, Samuel. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7636.39,"end":7646.89,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, I'm even trying to think like in bridegroom matins where we talk about Joseph and talk about Ed, Joseph is portrayed as sort of like Christ. Right. And."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7648.57,"end":7649.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7650.65,"end":7654.97,"speaker":"Fr Stephen De Young","text":"The betrayal there. And I can't think of anything that draws that out, that comparison."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7654.97,"end":7662.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, it was an idea, so thanks for calling. Samuel, always good to speak with you."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7662.49,"end":7664.89,"speaker":"Audience Member","text":"Okay. Or Ty Lavino."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7665.93,"end":7682.06,"speaker":"Fr Andrew Stephen Damick","text":"I don't remember the proper response. Oh, well, truly, he has risen. All right, we're going to take another call. We have from the other end of the country, Alexander from San Diego. So, Alexander, welcome to Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7688.06,"end":7737.56,"speaker":"Audience Member","text":"So my question, you know, being with Passover on my mind after Posca, here is what role Passover had in the worship cult of ancient Israel or Judah? Because I've heard it said how, how it used to be that the elders would be sort of that take that priestly role, but then that was taken away from them and given to the priests. But it seems from Passover, my naive understanding is that it was performed by heads of families, it was practiced within families. So is that kind of understood is still part of the worship cult? Like is the Passover lamb, Lamb considered part of sacrificial worship and what the understanding of that is and how that carries over? Because obviously in the Christian context, it's our sort of the central defining act of worship. So if you could answer that, that'd be great."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7738.2,"end":7744.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Father, what's the liturgical shape of Passover. How would you celebrate that prior to the coming of Christ?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7745.72,"end":7746.2,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7746.28,"end":7746.68,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7748.6,"end":7751.91,"speaker":"Fr Stephen De Young","text":"That was done still by the head of the household. And."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7752.79,"end":7753.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7754.07,"end":7773.19,"speaker":"Fr Stephen De Young","text":"So there's a question as to in what sense the Paschal lamb actually is a sacrifice in that the family eats the whole thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7774.39,"end":7776.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no part that's burnt up."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7776.47,"end":7828.3,"speaker":"Fr Stephen De Young","text":"There's not a part that's actually offered to God. And so it's a little bit of a different. Of a different situation. I think it is still sacrificial. Right? I think it is. I would say it is still sacrificial in the ritual sense. Right. That, that the ritual surrounding it is a type of sacrificial ritual, even though there's that big distinction there that separates it from like sin offerings, guilt offerings, peace offerings. Right. And that, of course, is why they still do it. Right. Jewish families still do it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7828.46,"end":7830.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even though they don't have a temple anymore."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7830.7,"end":7897.75,"speaker":"Fr Stephen De Young","text":"Yeah. So there, there, there are elements that. And a certain type of thank offering that they will still do because those were not temple restricted. If somebody were to, I don't know, write a commentary on St. John's Gospel, the whole thesis of which was dependent upon the idea that the high priest sacrificed lambs at Passover, that would kind of all fall apart based on, you know, what's in the Torah. Let the listener understand if you do. But yeah, so it's, it's a little bit different, and that's why it is still a family and identitarian. Right. So it, the Passover functions very much in a way parallel to the Passover itself. Very much in a way similar to circumcision. Right. Like circumcision wasn't done at the temple."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7898.71,"end":7904.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, traditionally, wasn't it done by the father, but only later do you get the figure of the moil."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7904.79,"end":7975.85,"speaker":"Fr Stephen De Young","text":"You get a moil. Yeah, yeah. Who would be one of the elders of the community. Right. Who just did it for everybody. Right. So it was considered more. It was more at that. It remained at that level and was not really part of the temple cult. Now. They did for practical reasons. So, for example, if you lived in Jerusalem or you were going to Jerusalem in the Passover, they did physically kill a lot of lambs in the temple complex. Right. But that was for logistical and practical reasons of having to have draining blood and all those kind of things. Right. Like they were set up to slaughter animals there. Right. Whereas if you're living in a city, on an average city block, Right. Trying to slaughter a lamb and Prepare yourself there. Kind of tough, right? So for logistical reasons, but if it's not like people who didn't go to Jerusalem for the Passover didn't celebrate the Passover. Right. And. And they didn't have priests functioning."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7976.25,"end":7976.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7979.37,"end":7993.27,"speaker":"Fr Stephen De Young","text":"So, yeah, Passover is a little different. And that's why. So we've talked about this on the show before, but what really generates the debate in Acts 15, what really generates the issue with."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7995.11,"end":7995.51,"speaker":"Fr Andrew Stephen Damick","text":"Whether."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":7998.07,"end":8075.67,"speaker":"Fr Stephen De Young","text":"Non Jewish Christians need to be circumcised was the continuity drawn between the Eucharist and the Passover. So there's definitely continuity there. Right? There's continuity there because of course, Christ institutes the Eucharist at the Passover, Right. Not at what comes to be called the Seder, but at a meal related to the Passover. At the time of the Passover, it's a participation in Christ's sacrifice. Christ's sacrifice, his self offering takes place at the Passover. There are all these connections between the Eucharist and the Passover. While there were Jewish Christians who said, well, wait a minute, right, Read the Torah, it's all fine for these Gentiles to come and live among us and worship our God. Great, we're cool with that. But if they're going to eat the Passover, if they're going to receive the Eucharist, they need to be circumcised. That's what it says. Read the book. Right. The other side, right. St. Paul's side, St. Peter's side, beyond just what they had witnessed with the Holy Spirit and non Jewish Christians was there are also discontinuities between the Eucharist and the Passover. Like it's not once a year."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8077.59,"end":8078.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8078.47,"end":8090.23,"speaker":"Fr Stephen De Young","text":"Hear what I say. Orthodox people receiving the Eucharist is not once a year. Right. It's. It started out weekly and became daily."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8091.11,"end":8091.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8094.39,"end":8145.55,"speaker":"Fr Stephen De Young","text":"So that's a discontinuity. Right. And it was for very early on called the Eucharist, which was connecting it to thank offerings. And the type of thank offering normally done at the beginning of the Sabbath was done weekly. Right. That was one type of weekly thank offering. So there's a continuity there that represents a discontinuity with. With the Passover. And so that was involved in that argument too. And the ultimate settlement was no, the Eucharist is not eating. The Eucharist is not directly comparable to eating the Passover. That it is. It is a separate thing. So. And a type of thank offering and a newly instituted sacrifice by Christ as his memorial. So all that is to say."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8147.55,"end":8147.83,"speaker":"Fr Andrew Stephen Damick","text":"I."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8147.83,"end":8149.63,"speaker":"Fr Stephen De Young","text":"Hope that Answered your question about the Passover."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8151.95,"end":8178.57,"speaker":"Audience Member","text":"For what it's worth. Exodus 12, Exodus, chapter 12, 27, both in the King James and orthodox study Bible will say like that, you shall say, you know, this is the possible sacrifice of the Lord. So I mean, it seems like. Yeah, it is referred to as a sacrifice and maybe it's also connected. I mean, where the firstborn were that weren't under the blood were sacrificed. I don't know. So I don't know. It seems like there is a. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8178.57,"end":8228.28,"speaker":"Fr Stephen De Young","text":"Well, there's the separate dedication of the firstborn, which involved a sacrifice also. Right. Where when you had a firstborn child or a firstborn animal, you went and offered a sacrifice at the temple. And that was very clearly a traditional sacrifice. You're taking it to the temple, it's butchered, parts are offered to God, parts are eaten. Right. Etc. Yeah. So the Passover is just sort of, like I said, I believe it's a sacrifice, but it's in. It's. It's different than it's distinguished from those others. And that's why it never sort of gets. Becomes completely part of the temple cult. Right, using cult in the broad original sense."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8228.28,"end":8229.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8229.52,"end":8238.08,"speaker":"Fr Stephen De Young","text":"You know, yeah. Of the. Of the temple worship, but remains sort of diffused and at the family and household level."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8239.52,"end":8241.92,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, Alexander, thank you very much for calling."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8241.92,"end":8243.76,"speaker":"Audience Member","text":"Yeah, thank you. Christ is risen."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8243.76,"end":8250.6,"speaker":"Fr Andrew Stephen Damick","text":"He truly is risen. Okay, we have six more brothers to go, and we're gonna start with."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8250.6,"end":8254.64,"speaker":"Fr Stephen De Young","text":"Yes, we have brides for them, actually."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8254.64,"end":8258.48,"speaker":"Fr Andrew Stephen Damick","text":"It's nice. Thank you very much for that musical theater reference."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8260.41,"end":8261.53,"speaker":"Fr Stephen De Young","text":"I know the way to your heart."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8261.85,"end":8266.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, true. Yeah. Okay, so Testament of Dan."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8267.85,"end":8268.33,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8268.49,"end":8269.93,"speaker":"Fr Andrew Stephen Damick","text":"Not short for Daniel either."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8270.57,"end":8271.77,"speaker":"Fr Stephen De Young","text":"No, it's Dan."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8271.93,"end":8273.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the infamous Dan."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8274.89,"end":8293.86,"speaker":"Fr Stephen De Young","text":"Yeah. So as. As we've mentioned before, the scriptures have nothing good to say about Dan or anyone descended from him, which is kind of sad given, you know, I mean, the actual person instead of Jacob might have been fine, but."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8297.38,"end":8298.1,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8298.58,"end":8314.46,"speaker":"Fr Stephen De Young","text":"But yeah, as you said, it's all go south. And. And like I said, nothing good to say about anyone descended from him. Anyone from that tribe. There's. There's a bunch of people right now, like on social media going crazy again, like, how dare you?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8316.78,"end":8318.22,"speaker":"Fr Andrew Stephen Damick","text":"But how dare you, sir?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8318.46,"end":8361.62,"speaker":"Fr Stephen De Young","text":"Yeah, cry more. I don't care. Stay mad. The Dan is therefore rather appropriately taken, again, to be an example of a passion. And again, we go back to when Joseph is sold into slavery. Dan, though, is clearly one of the ones who wants to murder him. But in this case, rather than jealousy or that Kind of thing. It's sort of anger and wrath, sort of violent hatred. He's just kind of a bestial dude."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8361.94,"end":8362.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8363.38,"end":8378.81,"speaker":"Fr Stephen De Young","text":"And that caused him to want to. To kill Joseph. Just sort of straight evil. And he gives this interesting quote about why he didn't get to murder his brother."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8379.37,"end":8402.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. So he says, but the God of my fathers did not suffer him to fall into my hands, so that I should find him alone and slay him and cause a second tribe to be destroyed in Israel. So second tribe. I mean, this is a reference to his own tribe basically getting wiped out of Israel."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8403.34,"end":8407.58,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Because of course, Dan isn't there in the book of Revelation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8408.06,"end":8416.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's the one who's not listed. So the second tribe in this case, you know, under the subjunctive sense. Right. Would be Joseph, you know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8418.22,"end":8432.72,"speaker":"Fr Stephen De Young","text":"Yeah. Would have been Joseph's. Would be if he had managed to get a hold of him. I noticed that. Find him alone. Right. So Dan is saying he wanted to go full cane, but, like, didn't manage to pull it off. Darn it. God didn't let him."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8432.8,"end":8437.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Didn't. Didn't even need, like, to make it a conspiracy with the other brothers. He's like, I'm just gonna take care of him myself."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8438.16,"end":8461.03,"speaker":"Fr Stephen De Young","text":"Yeah. And, you know, because the other brothers were around, he didn't get to kill him. Right. Yeah. And this then talks about that he was sort of moved and motivated by the spirit of hatred and violence, which is here described poetically in the testament of Dan as the right hand of Satan."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8462.71,"end":8463.19,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8466.47,"end":8492.04,"speaker":"Fr Stephen De Young","text":"And he goes on to then quote the Book of Enoch about his descendants in the tribe of Daniel to say that their prince. Right. Their prince in the sense that, like, St. Michael was the prince of Israel. The prince of the tribe of Dan would be Satan, and they would be given to every kind of evil."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8492.2,"end":8495.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No one has anything good to say about the tribe of Dan."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8495.48,"end":8497.64,"speaker":"Fr Stephen De Young","text":"Yes. Or anyone from it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8498.04,"end":8502.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8502.77,"end":8535.22,"speaker":"Fr Stephen De Young","text":"Yes. So Testament of Dan fits right in with that. With evil. Dude. But notice here. Right. Remember, I know we had the break and we had a couple calls, but we're coming off of Issachar at Zebulun. Right. The farmer and the fisherman. That kind of way of life. Right. That quiet, peaceful life, working hard. Right. What's the exact opposite of that? The spirit of hatred and violence and."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8535.22,"end":8535.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8536.02,"end":8537.1,"speaker":"Fr Stephen De Young","text":"And murder. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8537.1,"end":8538.26,"speaker":"Fr Andrew Stephen Damick","text":"Devouring your brother."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8538.82,"end":8552.42,"speaker":"Fr Stephen De Young","text":"Yeah. So then after Dan, Naphtali. The testament of Naphtali, everyone's favorite brother, all heard about him, thought so much about him."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8554.3,"end":8556.3,"speaker":"Fr Andrew Stephen Damick","text":"It's Not a name that gets used too often these days."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8556.78,"end":8686.6,"speaker":"Fr Stephen De Young","text":"Yeah. So this is another piece of the text, interestingly, that we know circulated independently because we have a separate copy of just the Testament of Naphtali from Qumran. Now, Testament of Levi, you might have expected Levi, major figure, priestly figure, priesthood, lots of things to say about that. You could see why someone would just write a Testament of Levi. Right. Apparently someone also just wrote a Testament of Naphtali. But Naphtali, there's like, nothing about him in. In Genesis, right. And. And not even very much about his descendants in the Torah and stuff. And so this one goes in a real different direction. This is another testament that involves apocalyptic. Right. An apocalyptic journey that actually Joseph is going to take. Not Naphtali himself, but Joseph, even though Naphtali is in the text, narrating it to his sons. And Naphtali is here taken to be sort of emblematic. His tribe is one of the tribes that made up the Northern Kingdom of Israel under Ephraim, the descendants of Joseph. Right. Where the kings came from, it was part of that. And so his tribe is here taken to sort of be a representative. And this testament is used as a representative statement to talk about those 10 northern tribes. Right. And they do try to incorporate the little tiny bit about Naftali that is in. In the scriptures, specifically in the Testament of Jacob, in Genesis 49, when he talks about Naftali, he compares him to a deer."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8688.29,"end":8688.69,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8689.09,"end":8762.87,"speaker":"Fr Stephen De Young","text":"So there's like sort of this deer motif, stuff about deer running through the Testament of Naphtali. But it's like that's all they got. Right. We talked. I know we talked about before. I think it was back when we talked about Jewish astrology that we talked about the fact that in the. The Testament of Jacob, you see a lot of animals like the lion with Judah and the deer here and serpent with Benjamin. Right. There's these animal motifs that pop up. And we talked about then that those were connected to 12 constellations which were connected to the 12 tribes. And the symbols on the 12 stones for the 12 tribes that were on the Ephod or the breastplate of the high priest had the constellations on them. That's what was engraved on them. If that makes you super uncomfortable, go back and listen to our Jewish astrology episode. I'm not saying that'll make you more comfortable, just you should go listen to it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8762.87,"end":8763.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8764.99,"end":8819.52,"speaker":"Fr Stephen De Young","text":"For more of this discomfort. So there's again, a quotation from the Book of Enoch, the Testament of Naphtali, that's talking about the destruction of the northern kingdom of Israel. Because in. Within the Hebrew scriptures there is this tension because of course, these tribes are gone. But within the prophetic tradition, you read Ezekiel, you read Isaiah, you read Jeremiah, the promises about the new covenant and about the restoration of Israel are very directly about the restoration of all 12 tribes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8822.59,"end":8822.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8822.71,"end":8827.55,"speaker":"Fr Stephen De Young","text":"It's about Judah and Ephraim being bound back together. Right. And being restored."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8828.03,"end":8831.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And Ephraim being the symbol of the ten northern tribes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8832.11,"end":8832.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8832.47,"end":8833.51,"speaker":"Fr Andrew Stephen Damick","text":"Altogether. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8833.51,"end":8844.75,"speaker":"Fr Stephen De Young","text":"And so we have to. A lot of Second Temple Jewish literature is struggling with like, okay, what does that look like? How can that be? How would that work?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8846.52,"end":8846.72,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8846.72,"end":8924.61,"speaker":"Fr Stephen De Young","text":"How is that possible? Right. What do we do about that? And so the, the central part of the Testament of Naphtali is really trying to. To envision that quite literally. So Naphtali has this vision at the Mount of Olives where he's standing with his brothers. And of course, this is a little anachronistic too, that he's hanging out at the Mount of Olives next to Jerusalem, which isn't Jerusalem yet, it's this Jebusite city. But that's what happens. So he has this vision at the Mount of Olives, and in it, sort of, he and his brothers are all represented. Levi is. Becomes the sun, Judah becomes the moon. Right. You can see again this idea of the two messiahs and of the Levitical, the priestly Messiah being the greater one of the two. And then the bull of Heaven appears. What? Yes. A wild bull of heaven appears is effective. Which is a giant bull with wings."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8926.93,"end":8927.33,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8929.01,"end":8936.61,"speaker":"Fr Stephen De Young","text":"And this scares all the brothers, except for Joseph, who jumps on it and rides it up into the heavens."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8940.61,"end":8941.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8942.45,"end":8988.25,"speaker":"Fr Stephen De Young","text":"And so first of all, what. But then after he has ascended into heaven on the back of the Bull of Heaven, this giant scroll comes down and unrolls for Naphtali to read. And amongst other things, it says, and this is in testament of Naphtali 5, 8, that thus the Assyrians, the Medes, the Persians, the Elamites, the Galachians, the Chaldeans and Syrians will gain a share in the 12 tribes of Israel through captivity. Literally says the 12 staves of Israel. But the word for staff and tribe is the same in Hebrew. So no one knows who the Galachians are."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8990.25,"end":8990.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8990.65,"end":8992.33,"speaker":"Fr Stephen De Young","text":"You're looking for a dissertation topic."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8992.65,"end":8992.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8992.97,"end":8994.93,"speaker":"Fr Stephen De Young","text":"I mean, there you go. Who are the Galapians?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":8994.93,"end":9003.29,"speaker":"Fr Andrew Stephen Damick","text":"If you search on that word, G E L A C H I A N S, the only references you will find to it is the Testament of Naphtali."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9003.85,"end":9004.13,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9004.13,"end":9007.45,"speaker":"Fr Andrew Stephen Damick","text":"That is no other that we know of."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9008.17,"end":9101.95,"speaker":"Fr Stephen De Young","text":"Yeah. But everyone else who we do know of, the Assyrians, the Medes, the Persians, the Elamites, the Chaldeans, the Syrians, these are all Mesopotamians. Right. Or people who ruled Mesopotamia at various points post exile. Right. So the Assyrians destroy the northern kingdom. Right. Take. Take all of the Israelites, relocate them, they marry in over there. And then the Chaldeans, the Medes, the Persians. Right. The Syrians, that's. That's where Israel is in. Is in exile. And so. And that's why the bull of heaven is used. Right. The bull of Heaven is this symbol of Mesopotamia. Right. So what's being shown in the vision? What is the fate of Joseph representing here, the Ephraimites representing here, the northern kingdom, they are not destroyed by the Chaldeans by the Mesopotamians. They are actually taken up into heaven by and with the Chaldeans. Right. And so what the text of the scroll then is making plain is that through them having gone into captivity, what is actually going to happen is that those Gentile nations are going to, through them, find salvation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9102.75,"end":9107,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's this integration through the tribes by."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9107,"end":9109.24,"speaker":"Fr Stephen De Young","text":"Becoming part of those tribes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9109.56,"end":9110.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9111.24,"end":9205.21,"speaker":"Fr Stephen De Young","text":"And this is. This is playing off of in Genesis 48, when Joseph brings his two sons, Manasseh and Ephraim, to be blessed by Jacob. Manasseh is actually the older son, but this is Genesis. So Jacob crosses his hands and puts his right hand on Ephraim and Joseph tries to correct him and he's like, no. And Ephraim is told how great he's going to be and how many descendants he's going to have in kings and all this. And then he says, and you will become the fullness of the Gentiles. And there's only one other place in the Bible where that phrase occurs. That's Romans 11, where St. Paul says that once the fullness of the Gentiles has come in to be added to Judah, then all of Israel will be saved. So this is a current of thought that we see reflected here in the Testament of Naphtali. Right. Where in the Testament of Naphtali, these Gentiles come into union with the head, with Levi and Judah, with the Messiah, in this case, the Messiahs, but with the Messiah, and through that become part of Israel and find salvation. Right. This is a way of thinking about this restoration. That is exactly what St. Paul does."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9205.93,"end":9206.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9206.89,"end":9208.17,"speaker":"Fr Stephen De Young","text":"In Romans and elsewhere."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9208.49,"end":9210.73,"speaker":"Fr Andrew Stephen Damick","text":"Again, not making this up."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9210.97,"end":9213.77,"speaker":"Fr Stephen De Young","text":"This is a current of thought. Right. This is pre Christian."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9215.03,"end":9215.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9216.15,"end":9235.83,"speaker":"Fr Stephen De Young","text":"But this is part of the tradition that St. Paul receives, right. And that he keys in on in terms of the particular mission that Christ sends him on to the nations and what it's going to mean and how it's working that through the Messiah, the Gentiles are becoming part of Israel."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9237.35,"end":9237.75,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9240.48,"end":9242.64,"speaker":"Fr Stephen De Young","text":"So that was all exciting. Now, the testament of Gad."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9246,"end":9246.96,"speaker":"Fr Andrew Stephen Damick","text":"Good old Gad."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9247.28,"end":9251.76,"speaker":"Fr Stephen De Young","text":"It can't all be hits, guys. Come on, you got some deep album cuts too."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9252,"end":9255.04,"speaker":"Fr Andrew Stephen Damick","text":"Another name that doesn't get used very often these days. Gad."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9257.36,"end":9271.65,"speaker":"Fr Stephen De Young","text":"Yeah, there's Josh Gad, but that's his last name. Yeah. So Gad. Right. Another figure we don't have a lot."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9271.65,"end":9272.01,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9275.61,"end":9339.3,"speaker":"Fr Stephen De Young","text":"In the Hebrew Bible or in Genesis or the Torah or any place, really. And so again, we go to the attempt to kill Joseph, but what's done here? And as I said way back with the testament of Simeon, when I said they were going to come back to this episode over and over again, they come at it from different angles, right? And so the particular angle here is wanting to make a contrast between hatred of your brother and love for your brother. And it wants to do that not in order in this case to focus on the hatred or the attempted murder, but to focus on sort of defining the opposite. Right? Meaning the opposite of not hating and wanting to murder your brother is not just being meh. Towards your brother. Yeah, he's cool, whatever. Right. Like the opposite of that is loving your brother."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9339.78,"end":9347.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Actually giving yourself, you know, in self sacrifice for another person, caring for someone else."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9347.19,"end":9353.19,"speaker":"Fr Stephen De Young","text":"And that has an actual concrete. It's not like a feeling or an emote, man, I love that guy."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9354.47,"end":9354.83,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9354.83,"end":9409.35,"speaker":"Fr Stephen De Young","text":"I love you, man. But it's actually doing things. And in this case, right. It's particularly this contrast between, well, they wanted to murder Joseph. What's the opposite of wanting to murder someone? Wanting them to have a long and full and rich life. Right. And again, it's not just the feeling of wanting that for them or wishing it to them, but actually doing things for others that help them have a more full, more rich, longer, better life. Right. That's sort of the concrete nature of what love is. And, and that sort of concrete love for your brother, right. Is taken to the extent even of, well, what do you do when that's not returned?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9409.67,"end":9410.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9413.03,"end":9441.21,"speaker":"Fr Stephen De Young","text":"What do you do when you're doing all this for your brother and your brother hates you, right. And is not being the same toward you? Right. Well, Joseph, again, Joseph's story is a good place to go with this, right. And the Testament of Gad wants us to Remember that vengeance belongs to the Lord. Right? Where vengeance needs to be taken, where something is unjust and needs to be sorted out. God is going to sort that out."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9441.77,"end":9456.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, especially when it's about you. Right. You don't, like, take vengeance for yourself. Now, if you can, bring justice for someone else, if you can, in a good and righteous way. Right. That's. That's cool. That's good."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9457.46,"end":9458.9,"speaker":"Fr Stephen De Young","text":"That's part of showing love for them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9459.14,"end":9481.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. But, but yeah, you don't. You don't revenge for yourself. You don't because. Because, you know, number one, it belongs to God. But number two, like, you don't even know everything that's going to go on. Like, what if you know that person might repent at some point? Right. You know, there's all kinds of possibilities. You just don't know enough to be competent to do that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9481.72,"end":9524.29,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so this idea of love for your neighbor, love being concrete. Right. Loving even your enemies and those who treat you poorly. Pre Christian idea. Right? Pre Christian idea. This is something that's already around for Christ then to refer to when he's preaching. Right. And teaching. So then number 10, the shortest one of them all, the Testament of Asher."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9525.81,"end":9526.45,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9527.49,"end":9537.87,"speaker":"Fr Stephen De Young","text":"Again, not someone we have a ton of material about. Probably why this is the shortest one. Asher is actually a fairly common Jewish first name lately."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9538.27,"end":9538.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9539.63,"end":9551.07,"speaker":"Fr Stephen De Young","text":"Especially among millennials. I don't know why, but even Jewish communities apparently have these phases where people get certain names."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9552.43,"end":9557.51,"speaker":"Fr Andrew Stephen Damick","text":"The brothers of Joseph in the Bible are kind of like the dwarves in the Hobbit."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9557.51,"end":9557.71,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9557.71,"end":9560.91,"speaker":"Fr Andrew Stephen Damick","text":"Like, you got a list of names, but there's not really a lot about most of them."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9562.05,"end":9570.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And I mean, the dwarves in Snow White. How much do we really know about most."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9572.61,"end":9574.37,"speaker":"Fr Andrew Stephen Damick","text":"Vague personality descriptions."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9574.93,"end":9577.17,"speaker":"Fr Stephen De Young","text":"Like bashful. Why is he so shy? Come on."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9577.33,"end":9581.09,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And Doc. What is up with that? Like, why is one called Doc?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9582.13,"end":9587.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. All the other ones are character traits. Right. What do they call a normal story? Got the degree."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9587.97,"end":9589.57,"speaker":"Fr Andrew Stephen Damick","text":"Can't he have a normal name? Like Diffidence?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9593.17,"end":9601.25,"speaker":"Fr Stephen De Young","text":"He must have been called something before he got the degree. That's all I'm saying. Yeah, maybe he was ennui before that. I don't know."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9602.45,"end":9603.89,"speaker":"Fr Andrew Stephen Damick","text":"What is his doctorate even in?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9604.85,"end":9609.57,"speaker":"Fr Stephen De Young","text":"Yeah, that's a good question, too. I would assume some kind of geology because they're miners."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9611.49,"end":9612.77,"speaker":"Fr Andrew Stephen Damick","text":"Colorado School of Mines."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9612.93,"end":9617.57,"speaker":"Fr Stephen De Young","text":"Now assume something applicable. Yeah, could be a medical doctor."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9618.85,"end":9621.53,"speaker":"Fr Andrew Stephen Damick","text":"Well, as we all know, medical doctors aren't real doctors."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9621.53,"end":9624.61,"speaker":"Fr Stephen De Young","text":"Right. It could be patching up. Patching up the others. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9627.49,"end":9628.37,"speaker":"Fr Andrew Stephen Damick","text":"Unless they teach."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9628.93,"end":9630.73,"speaker":"Fr Stephen De Young","text":"Yeah, okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9630.73,"end":9631.73,"speaker":"Fr Andrew Stephen Damick","text":"Testament of Asher."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9632.05,"end":9724.67,"speaker":"Fr Stephen De Young","text":"Yeah, sleepy. Just needed some. Some caffeine, man. Anyway, so, yeah, Testament of Asher, shortest one and also kind of the most general because of that, it's really picking up on what is commonplace in Jewish wisdom literature, this idea that there are two ways or two roads, two paths that you could follow. You could follow one that leads to good, one that leads to evil. The one that leads to good is hard. The one that leads to evil is easy. But you find this in proverbs. You find this in other Jewish wisdom literature. You find this in early Christian literature like the Didache. It's all over the place. The sort of angle of the Testament of Asher that's a little bit interesting is that it kind of addresses Thrasymachus from Plato's Republic in that it talks about how, faced with those two ways of living their life, what most people actually want to do and tend to do is they want to pursue evil, but they want to look good. They want to look like they're a good person while they're pursuing evil. Have their cake and eat it too. Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9724.67,"end":9725.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Hypocrisy."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9726.11,"end":9735.87,"speaker":"Fr Stephen De Young","text":"Yeah, of course. Big problem with that, as Testament Vacher points out, is that you can trick people with that. You can't trick God with that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9736.43,"end":9736.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9737.55,"end":9782.81,"speaker":"Fr Stephen De Young","text":"Because God knows what's in your heart. And so that duplicity isn't going to. Isn't going to work. Isn't going to work. And he also talks a little bit about how. How goodness always has to be or is always open and genuine in the sense that someone can lie and hide. People will try to lie and hide evil."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9783.69,"end":9784.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9785.13,"end":9863.72,"speaker":"Fr Stephen De Young","text":"Right. So they'll do evil and pretend to be good, but you don't see anyone doing good and pretending to be evil. Right. And so you shouldn't be looking for. There is nowhere down the evil path where you will find anything good or true. Right. You may trying to walk the good path, end up falling into error. Right. Falling into sin. Right. Because of your struggles in following that path. But the opposite isn't true. Therefore there is no reason to ever go down that road. He's advising his sons and his descendants. It's not like going down the path of evil and sin is a mixed bag. You could maybe find something interesting over there. Right, Right. So, yeah. And so that's the short little Testament of Asher. And then you come to the testament of Joseph."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9864.04,"end":9866.44,"speaker":"Fr Andrew Stephen Damick","text":"All right, now we're getting something really good."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9867.88,"end":9877.24,"speaker":"Fr Stephen De Young","text":"And Joseph is of course, an interesting figure. We've already alluded to this because of course, a third of the book of Genesis is the story of Joseph."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9878.28,"end":9883.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's probably one of the longest, if not the longest biographies we get in the scripture, I think."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9883.91,"end":9946.08,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, maybe David. But yeah, but yeah. So Joseph. Right. Massive a third of the book of Genesis. Right. And if you're starting at the beginning of the Bible or even just the beginning of the Torah and reading through it, you would assume coming off the last page of Genesis that because you kind of have the person you're following is like the line of the Promise. Right. You go from Abraham to Isaac to Jacob. Right. And then you kind of go to Joseph for a third of the book of Genesis. But then as you go forward into the Hebrew, the rest of the Torah, the Hebrew Bible. Right. Like Ephraim, Manasseh, not a lot good going on there. And then like they just disappear to the Assyrians."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9946.08,"end":9953.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Joseph doesn't end up being. He's not an ancestor of the Messiah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9953.48,"end":9960.88,"speaker":"Fr Stephen De Young","text":"Right. Judah, Levi. Right. These become the important tribe. But Judah and Levi, the people are not the focus of a third of the book of Genesis."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9960.88,"end":9961.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9962.64,"end":9974.96,"speaker":"Fr Stephen De Young","text":"This to me is one of the best arguments and I have heard no good counter argument for the antiquity of the book of Genesis, at least within the Torah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9976.56,"end":9988.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because if you're a later writer trying to establish the glory of your line, you don't spend a third of your primary book focusing on a guy that you're not even descended from."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":9989.29,"end":10006.25,"speaker":"Fr Stephen De Young","text":"Right. And conversely, and conversely, if Ephraim was essentially already gone. Right. Why would you have and be preserving and presenting as so important these Joseph traditions?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10007.05,"end":10010.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10010.13,"end":10095.17,"speaker":"Fr Stephen De Young","text":"Right. So to me that's kind of a good strong argument that I've never heard a good counter argument to that Genesis has to be older than the divided kingdom in something like its current form, which may not sound like, like a big deal, but trust me, well deserved studies that. That's a wild claim. But again, give me a good counter argument to that. But so Joseph, obviously very important in the Torah, the Torah, very important to the author of the Testament of the twelve Patriarchs. But at the same time he's writing at the beginning of the 2nd century BC where Ephraim is long gone. Right. And we've seen in the Testament of Naphtali, which may not be written by the same person who wrote the Testament of Joseph, may very well not be that he does have it, but the text as a whole has a destiny in mind for the Ephraimites in the rest of the Northern Kingdom. It's it's still. Joseph is not the. The lead figure in that. Right. Even within that vision, in the Testament of Naphtali, it's Levi and Judah who are the heads. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10096.05,"end":10096.45,"speaker":"Fr Andrew Stephen Damick","text":"Who?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10096.45,"end":10108.11,"speaker":"Fr Stephen De Young","text":"Joseph and the rest of the Northern kingdom, their gentile quote unquote, descendants come into fellowship with that brings about their salvation, not Joseph himself."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10108.83,"end":10109.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10109.71,"end":10138.15,"speaker":"Fr Stephen De Young","text":"Joseph isn't the key figure. So Joseph here in the Testament is primarily. Well, first of all, there's sort of two pieces to it. The first piece is Joseph is used to represent the virtue of chastity. Right. Not just chastity within marriage, but chastity in the broader sense. And that's by focusing on the episode between him and Potiphar's wife."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10138.47,"end":10138.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10139.51,"end":10148.55,"speaker":"Fr Stephen De Young","text":"Who attempted to seduce him in the book of Genesis and he resisted, ended up thrown in prison because of it. After she claimed he raped her."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10148.79,"end":10157.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I didn't put it in the notes, but it actually gives a name for her in this text, which of course in Genesis, she's not named, she's just called Potter."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10158.77,"end":10159.09,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10159.73,"end":10160.69,"speaker":"Fr Andrew Stephen Damick","text":"Or something like that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10160.93,"end":10236.97,"speaker":"Fr Stephen De Young","text":"It's also dramatized here, the Testament of Joseph, where she's doing all this stuff, threatening to kill herself and doing all this stuff to try to get him to sleep with her, but won't do it. So there's that element of chastity preserving chastity. And, you know, Father Andrew referenced the Great Canon of St. Andrew earlier. You could see this emphasis on the episode with Joseph and Potiphar's wife there. You could see it in some of the hymns about Joseph and Bridegroom Matins in Holy Week. Still fresh in my brain because we did it so recently. This whole idea of Joseph as this representative of chastity. In that case, there's also another reminder about seeking revenge, which Joseph, of course, famously did not do. But the. Probably the other and more major, more interesting to a lot of people, part of the Testament of Joseph is there's another apocalyptic section. Instead of a vision with him, it's a dream that he has, which is kind of appropriate because, remember, Joseph is all about interpreting dreams."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10237.13,"end":10237.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10237.41,"end":10291.98,"speaker":"Fr Stephen De Young","text":"He's the big dreamer in Genesis. So he has this dream. And this is a dream about the Messiah. Right. Who is going to come. Now, this is one of those interesting textual places because there's an Aramaic version and there's a Greek version that we have. We have both the whole text for the Testament of Joseph and the dream in particular. So this dream we're going to see, there's a bunch more on the nose sounding kind of things about the messiah that scholars are going to want to say are Christian interpolations. Right. But here's the problem. The Aramaic version in particular of the dream is longer than the Greek version."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10292.86,"end":10293.42,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10294.62,"end":10307.74,"speaker":"Fr Stephen De Young","text":"The Greek version is shorter. So when the Greek version is shorter and they're arguing that the Greek version is the Christian version, where they added things, your antennae should go up."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10309.1,"end":10309.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10310.14,"end":10360.39,"speaker":"Fr Stephen De Young","text":"You say, wait a second, added things, it's shorter. Right. And so you might ask that. Okay, so if your hypothesis is the Greek version is the Christian version and it's way shorter, then let's look at the stuff that gets left out. Is there a reason why Christians would have left out that stuff that gets left out? Right. Because certainly if the stuff that got left out was stuff that didn't match up with Christianity. Right. And then the Greek version just kept the stuff that did match up with Christianity, you might have a case. But guess what? It done. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10360.47,"end":10364.71,"speaker":"Fr Andrew Stephen Damick","text":"So it's not an easy. Just doesn't work out."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10365.03,"end":10380.66,"speaker":"Fr Stephen De Young","text":"Yes. The stuff in the Aramaic version that gets left out in the Greek version not only doesn't have any relationship to Christianity detectable whatsoever, but is also stuff that's found in the other testaments. Yeah. In the Greek versions."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10381.54,"end":10381.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10381.9,"end":10391.14,"speaker":"Fr Stephen De Young","text":"Like it's the same kind of material. Right. So if you're going to say the Greek version is the Christian version, why would they cut it out here and not cut it out in those other places?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10393.62,"end":10394.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10394.51,"end":10401.55,"speaker":"Fr Stephen De Young","text":"So it's very clear that the Greek version is not a Christian version per se. It's just a Greek translation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10403.55,"end":10403.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10403.91,"end":10442.58,"speaker":"Fr Stephen De Young","text":"It's just a Greek version. So that already is a strike against a shorter Greek version, which is a strike against the idea that Christians added things that's not a particularly Christian version. But we'll get to the particulars here in a minute. Most of the dreams is similar to something in the Book of Enoch that we'll talk about at some future point in more detail. But there's a section of the book of Enoch, of first Enoch that has what's called the animal apocalypse, which is not what used to happen. When I would go to the Popeyes buffet here in Lafayette, Louisiana, I was going to say, I think it would."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10442.58,"end":10445.94,"speaker":"Fr Andrew Stephen Damick","text":"Make a great title for a limited run comic book series."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10447.15,"end":10490.18,"speaker":"Fr Stephen De Young","text":"Oh, I was thinking just a buffet, the animal apocalypse, some kind of carnivore diet buffet, but the animal apocalypse. Again, this is apocalypse in the sense of revelation. It's called the animal apocalypse because in the book of Enoch it sort of retells the history of Israel, but with all of the biblical characters portrayed as different animals. Right. So CS Lewis, not an original idea in his life, but anyway, I mean, so that's."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10490.18,"end":10490.98,"speaker":"Fr Andrew Stephen Damick","text":"That a writer's."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10491.62,"end":10495.06,"speaker":"Fr Stephen De Young","text":"That's just like your opinion, man. Yeah, right, exactly."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10496.18,"end":10498.34,"speaker":"Fr Andrew Stephen Damick","text":"It's just like a Leguminon, man."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10499.85,"end":10504.81,"speaker":"Fr Stephen De Young","text":"So, so you have something like that. This, this dream that Joseph has."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10507.29,"end":10507.69,"speaker":"Fr Andrew Stephen Damick","text":"Where."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10510.57,"end":10544.88,"speaker":"Fr Stephen De Young","text":"He, he gives sort of a brief history with people presented as animals. But this one just runs from the exile to the Hasmoneans, meaning the king's post Maccabean revolt to his day. So just covering a couple hundred years there, which is one of the, and this is one of the ways we pegged down when it was written because it kind of goes up to the then current day. Right, but the more interesting parts."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10547.52,"end":10547.8,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10547.8,"end":10559.77,"speaker":"Fr Stephen De Young","text":"Are included here, which again are thought to be Christian interpretations, the first one is of course it says that the Messiah is going to be born of a virgin from the tribe of Judah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10560.89,"end":10561.29,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10562.41,"end":10624.09,"speaker":"Fr Stephen De Young","text":"Right. So immediately people say, oh, Christians added that. Christians added that. That could be in a pre Christian text, virgin birth. Right. It's not like that exact same word was used in Isaiah 7. Oh wait, it was, right, it was. Never mind, never mind. Right. So yeah, but this is what we're dealing with here, people. This is what we're dealing with here, people. This is why when people come out and say, well, Father Stephen says this, but Old Testament scholarship says xyz. As if they could speak for Old Testament scholarship. But anyway, you know, like I laugh them to scorn, right? Because this is, this is the level of thing we're dealing with. This says that the Messiah is going to be born of a virgin. That's a Christian idea that must have been added even though it's just using the exact same Greek as Isaiah 7."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10624.33,"end":10626.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, man."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10630.58,"end":10632.02,"speaker":"Fr Stephen De Young","text":"Which they would agree is pre Christian."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10632.02,"end":10632.58,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10633.14,"end":10720.09,"speaker":"Fr Stephen De Young","text":"This is why in order to get a PhD in this country or any other, you should have to take a logic course. Just one, one. It could be an undergrad level logic course. I don't care. You need to take one in, in sort of the, the, the drama, right. Of the Messiah coming. Right. So it goes up to the then present day and then talks about the Messiah coming. Messiah is presented as a lamb and who does battle with and defeats a bunch of reptiles and creeping things. And it's important that he doesn't do battle with. He doesn't do battle with the animals that represent the other nations. It's not the Messiah versus the Gentiles. It's the Messiah versus the reptiles and Creeping things that represent the evil spirits. Right. Who are motivating and provoking the nations. And then ultimately those nations again, once again, in keeping with what we've already seen, find salvation through Levi and, and Judah. But now, are you ready for the most on the nose piece?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10720.97,"end":10721.69,"speaker":"Fr Andrew Stephen Damick","text":"I'm ready."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10722.25,"end":10734.33,"speaker":"Fr Stephen De Young","text":"The Greek of Testament of Joseph 19:11 says, refers to the Messiah as the Lamb of God who will take away the sins of the world."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10734.81,"end":10736.89,"speaker":"Fr Andrew Stephen Damick","text":"What? That's got to be an interpolation."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10736.89,"end":10744.26,"speaker":"Fr Stephen De Young","text":"That's got to be. That's got to be. But that's straight out of St. John's Gospel of John. Yes."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10744.82,"end":10745.62,"speaker":"Fr Andrew Stephen Damick","text":"Or is it?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10746.1,"end":10776.35,"speaker":"Fr Stephen De Young","text":"Yes, that's got to be. Right? Right. Unless we think about this for a second because we had a logic class once in our life. Okay. When St. John the Baptist says that in St. John's gospel, he says, behold the Lamb of God who takes away the sins of the world. What is he doing? He's identifying Jesus as the Messiah. He points at Jesus, he says that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10777.31,"end":10777.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10778.59,"end":10783.95,"speaker":"Fr Stephen De Young","text":"Everyone understands, everyone who hears that understands that he's identifying Jesus as the Messiah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10784.35,"end":10795,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in, in that line, right, The Lamb of God, okay, that's Passover stuff. Takes away the sin of the world. That's Day of Atonement stuff."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10795.32,"end":10796.44,"speaker":"Fr Stephen De Young","text":"Right. Smushed together."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10797.16,"end":10801.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean he's just, he's just using stuff from the Old Testament."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10801.12,"end":10805.24,"speaker":"Fr Stephen De Young","text":"Right, Right. But so he says that they understand that means he's the Messiah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10805.8,"end":10806.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10807.88,"end":10811.16,"speaker":"Fr Stephen De Young","text":"Would they have all understood that if he just made it up on the spot?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10812.04,"end":10815.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, he's making reference."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10815.24,"end":10822.28,"speaker":"Fr Stephen De Young","text":"Would they? Especially since he's mishmashing Passover and day of Atonement stuff."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10824.76,"end":10825.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. These are pretty."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10825.72,"end":10842.08,"speaker":"Fr Stephen De Young","text":"He points at this person, says, behold the Lamb of God who takes away the sins of the world. And they don't all stand there and go, wait, what? Right. He's the Lamb of God, in what sense? What does that mean? Something about Passover? He's going to take away the sins of the world."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10842.08,"end":10842.32,"speaker":"Fr Andrew Stephen Damick","text":"How?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10842.32,"end":10903.93,"speaker":"Fr Stephen De Young","text":"What does that, what does that mean? Why do they all immediately know? That means the Messiah could be. Let me just throw this out here. Occam's razor. That was symbolism that had already been applied to the Jewish Messiah in different places. One of them being here, Right. In the Testament of Joseph. And if there were already texts like this that were doing things with animal symbolism and that kind of thing. Right. Let's suppose that this was originally there in the pre Christian document, the Testament of the twelve Patriarchs. Right. So this was symbolism that people use. This was a way that people had talked about the Messiah before, then as soon as St. John did that, what everyone would go, oh, he's saying that person is the Messiah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10907.21,"end":10911.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It wouldn't be effective rhetoric if no one knew what he meant."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10911.05,"end":10911.45,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10912.33,"end":10920.49,"speaker":"Fr Stephen De Young","text":"And lo and behold, what we would expect if this was original and pre Christian is exactly what happens in St. John's gospel."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10923.78,"end":10924.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10925.38,"end":10953.5,"speaker":"Fr Stephen De Young","text":"So again, right, why would you want to argue that this is pre Christian? Right. It's just proceeding from a presupposition. It's proceeding from this presupposition that Christianity is this whole new set of ideas that came from nowhere, fell out of the sky, yet still isn't true."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10955.5,"end":10955.78,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":10955.78,"end":11020.83,"speaker":"Fr Stephen De Young","text":"The first century with no connection to any pre existing religion. Which makes no sense. If you wanted to argue it literally fell out of the sky in the first century and had no precedence in human religion and you believed it was true and came directly from God, that would at least make sense. Right. But it both evolved and didn't evolve for pre existing religious traditions. Right. And is both not supernatural at all, but also completely disconnected and. Right. And you find yourself in this bizarre position. You don't have to be, even if you're an atheist, you don't have to do that much work, man. Just say like, yeah, that was a Jewish way of talking about the Messiah. Yeah. It shows up in the New Testament and you know, maybe you don't believe it's true. Is that so hard? Is that really so rough? Do we have to contort history? Do we have to do all this ledger domain about texts and dividing them up and which line is from when?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11022.03,"end":11022.91,"speaker":"Fr Andrew Stephen Damick","text":"No, you don't."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11022.91,"end":11036.74,"speaker":"Fr Stephen De Young","text":"You can say, you know, just say you don't believe it. End of that rant. Okay. Last but not least, the Testament of Benjamin."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11038.82,"end":11041.7,"speaker":"Fr Andrew Stephen Damick","text":"All right, number 12, the caboose."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11042.9,"end":11057.23,"speaker":"Fr Stephen De Young","text":"And so one thing that's unique about the Testament of Benjamin is that as we've seen, right, most of these are sort of directly connecting the person, the son of Jacob and their descendants in various ways."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11057.31,"end":11057.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11057.79,"end":11085.21,"speaker":"Fr Stephen De Young","text":"Right. So like Dan's descendants are all rotten. So Dan is presented as rotten. Right. The Testament of Benjamin, on the other hand, actually wants to disambiguate between the person Benjamin, the son of Jacob and his descendants. And that's because there's a certain ambivalence about his descendants."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11087.2,"end":11089.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, one of them being Saul. Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11089.28,"end":11112.54,"speaker":"Fr Stephen De Young","text":"Yeah. So there's an ambivalence about his descendants. So it's not as clear cut as his descendants are all bad. Right. And so he's going to be presented as having a bunch of bad descendants, but also some other descendants who are good descendants. And those good descendants are going to be seen to be the ones who actually take after Benjamin, their father."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11114.93,"end":11115.17,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11116.29,"end":11129.21,"speaker":"Fr Stephen De Young","text":"So you see this ambivalence in the way Benjamin, the person is treated in Genesis, right? Where he's sort of this good kid who everybody loves, right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11129.21,"end":11129.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11130.45,"end":11281.12,"speaker":"Fr Stephen De Young","text":"Especially his father. Maybe a little too much at the expense of his brothers, but, right, he is this good kid. But then in Genesis 49, in the testament of Jacob, you know, he's like this ravening wolf, right? You're like, oh, timeout. Right. Like this is weird, right? And that's describing, right? The, the Benjamites are going to cause a civil war in Israel. In the book of Judges, Saul is going to be from the tribe of Benjamin, right? And it's going to be Judah that ends up with the kingship, right? So you've got these problematic element of the Benjamites, plus they're all left handed, which is sinister. Then on the other hand, Benjamin as a tribe stays with Judah. When the other tribes break away, it sort of remains faithful and survives, goes into exile with Judah, comes back with Judah, right? So there's this ambivalence and there's. Within the text of the Testament of Benjamin, there's sort of this analogy made between Benjamin's relationship with Joseph, brothers of the same mother, right. Their relationship and the kingdom being taken from Israel. Right. Because it's sort of when Joseph is separated from Benjamin, he goes off and becomes a king. And in the same way, at the time of the exile, the kingdom was taken away from Judah. Yeah, right. But with the hope then that just like Benjamin and Joseph were reunited, that there is this restoration and reunion coming. And like the last couple testaments we talked about, then at the end of the Testament of Benjamin, there's this sort of final prophecy element, this one, interestingly, the Greek is longer and the Aramaic is shorter. So it's the opposite of the Testament of Joseph. Yeah, right. So this goes back to what I was saying at the beginning. There's not a clear rhyme or reason to the languages. Right. If the Aramaic was across the board shorter, everybody would say, oh, well, it came first and then the Greek, right?"}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11281.12,"end":11281.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11281.48,"end":11292.84,"speaker":"Fr Stephen De Young","text":"Or vice versa. But it's not, it's weirder than that. It's more complicated than that. But in this prophecy, right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11294.61,"end":11294.85,"speaker":"Fr Andrew Stephen Damick","text":"Here we."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11294.85,"end":11316.53,"speaker":"Fr Stephen De Young","text":"Go again, it talks about the Messiah, who's referred to as spotless, about him being seized by lawless men, about him dying for impious men. Right. Even crazier. Right. In the Greek version, they use the phrase Lamb of God and savior of the world."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11317.81,"end":11329.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which just as a point, savior of the world is not. I mean it gets used of course in the gospels, but Caesar Augustus uses it to refer to himself."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11330.51,"end":11330.99,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11331.39,"end":11334.79,"speaker":"Fr Andrew Stephen Damick","text":"This is not some uniquely Christian or even uniquely biblical title."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11334.79,"end":11362.8,"speaker":"Fr Stephen De Young","text":"Yes, yes. And of course we talked about Lamb of God just now already and it talks about how the blood of the New covenant is going to save Israel and the nations by purifying them of the works of Belial. We've talked about Belial before. The yoke is the one, the lawless one. Right. The devil, the blood is going to purify, purge away the works of the devil, set them free. Oh, blood of the new covenant."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11362.8,"end":11363.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11363.72,"end":11373.56,"speaker":"Fr Stephen De Young","text":"So again, clearly all this is stuff that Christians added in the Greek. And look, the Greek's longer this time. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11374.52,"end":11375.16,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11379.16,"end":11387,"speaker":"Fr Stephen De Young","text":"Right. So we've already had in the previous Testament the Messiah depicted as a passover lamb. Right."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11387.56,"end":11388.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11388.52,"end":11393.48,"speaker":"Fr Stephen De Young","text":"What was one of the qualities that the lamb had to have to be the passover lamb? It had to be spotless."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11393.72,"end":11394.76,"speaker":"Fr Andrew Stephen Damick","text":"Spotless, yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11395,"end":11418.2,"speaker":"Fr Stephen De Young","text":"So referring to the Messiah as spotless, just a continuation of that symbolism. Right. Seized by lawless men, dying for impious men. This whole testament has been a meditation on the relationship between Benjamin and Joseph. What happened to Joseph? Lawless men seized him, tried to kill him, sold him into slavery."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11418.52,"end":11419.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11419.16,"end":11423.88,"speaker":"Fr Stephen De Young","text":"Okay, so this is just taking part of the story of Joseph and applying it to the Messiah."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11424.92,"end":11425.56,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11425.72,"end":11569.26,"speaker":"Fr Stephen De Young","text":"Again, nothing weird or particularly Christian about that. Right. The blood of the New Covenant. There's blood of the Old Covenant. Right. Why wouldn't there be blood of the New Covenant? Why is that only a Christian idea? Right. And the idea of blood purifying things, again, day of atonement. Right. Torah idea, not a, not a purely Christian idea per se. And the idea of being purified for the works of Belial. Got bad news for you. That's all over the book of Enoch and second Enoch and the Apocalypse of Abraham and about five other second Temple Jewish texts. Right. You're not going to be able to argue that all of those are Christian interpolations because we have copies of those texts from Qumran and stuff that never touched Christian hands. Right. So no, none of this stuff is Christian interpolations. And for all the reasons I said in the previous rant, it's ridiculous to try and argue so. Right. Just say yes, Christians made use of pre existing Jewish ideas that they applied them to Jesus of Nazareth, who they believed to be the Messiah because they believed he rose from the dead. Right. You don't believe that, so you disagree. Fine, whatever. Right. Move on with your life. Yeah. So, yeah. The ultimate, the ultimate kind of message then of the Testament of Benjamin is. And this, this kind of sets it up as the, the antipode to the Testament of Simeon, remember, who was envious of all these things about Joseph. Right. And that led to hatred. Whereas Benjamin, like, loves everything about his brother Joseph and so is arguing rather than hating someone for those, you should seek to emulate those qualities to be more like Joseph. And this is an important example of holding up a saint and their life as something for emulation and devotion, which of course is going to become a commonplace of Christian literature."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11571.18,"end":11643.34,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Well, we made it through all 12. Good job. So some of my takeaways from this little walk through the testaments of the twelve patriarchs, obviously there's a lot more that could be said. There's a lot of other details that are in those texts. It's worth reading them. None of them are really long. I mean, we mentioned some are longer, some are shorter, but none of them are really long. Like, you could read the whole thing within, I don't know, maybe an hour probably. I think if you read all of it. But the details that you picked, Father, I think serve a really important purpose, which is that they show this continuity between the religion of ancient Israel and the religion of the followers of Jesus Christ, and that really they are not two separate religions. Even. So maybe continuity isn't even really the right word. Like it's just simply the same religion. It's simply the same one thing."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11645.11,"end":11645.35,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":11646.39,"end":12154.66,"speaker":"Fr Andrew Stephen Damick","text":"But that certain events happen, namely that the Messiah comes, he dies and rises from the dead. And so then what was always believed about the Messianic age now has been inaugurated, right? So it's not some other religion with some other theology and whatever. It's. It's simply that, oh, this has happened now. So, okay, now is what we do, right? And I think that this is important for a bunch of reasons. One of the reasons is that the only way to really understand the New Testament correctly and Christian theology correctly is within the context of everything that has come before it, right? And we have this idea sometimes that, okay, there was all that Old Testament stuff and now Jesus came and he liberated for us from all of that, right? I've had people literally say that to me, especially when we talk about the Old Testament at all. People are like, but didn't Christ come to save us from that? I'm like, wait a minute, hold on a second. He's the lawgiver, he's the one who gave the Torah. Why would he set that whole thing up and then say ha, psych. Some new religion. Now that's not at all what he came to do. And of course we talked about that in some detail when we talked about this question of fulfilling the law rather than abolishing it a few episodes ago. So there's that a correct understanding of Christianity requires a full understanding of the Torah and of all the Old Testament, but also on a very practical level, not that I don't think anything I just said was not practical, but to bring it down to even an even finer level, right. Is that I think that the way that we think about the New Testament and its relationship to the Old Testament and often the way that we disconnect them, right? And maybe you don't believe you should do that, but at least English speaking culture is, is saturated with that idea, right? Like out with the old, in with the new. This creates a habit of thought and a habit of speech, of discussion in which we look at things in isolation from their pretty obvious context, right? And I mean, you know, we've mentioned that a bunch of times in terms of scholarly mistakes in this episode, right? Like, oh, saying the Messiah will be born of a virgin, like that's crazy, it must be some kind of Christian interpolation. But it's right there in Isaiah. It's right there, right? Like the Bible. Have you read it? You know, the problem there is to look at stuff in isolation and then with a whole bunch of assumptions like these are Christian things to say, these are Jewish things to say, and never the twain shall meet. Sorry, that's not how this thing works. But even apart from the question of, from explicitly theological issues like this, right? This habit of mind that we have of decontextualizing everything, right? There are certain cases in which that is, that can be useful to isolate a thing and to focus only on that one thing, fine, but for most things in life, it's not. It's not. And I don't mean it just in terms of our theological understanding, but I also mean it in terms of practical day to day living. I'll give you a great example. We just went through Lent and Holy Week and so forth, and there are people that will take on, say, fasting for instance, in some way, but then don't also increase or alter their private prayer and then their corporate prayer together with the church, right? So they do this one thing in fasting and say, I'm doing Lent. Well, if you can't, you know, if you don't have the ability to increase your prayer for some reason, or especially corporate prayer, maybe your parish doesn't have those services or you live a long ways away, whatever, fine. But there are people who do it in a kind of a legalistic way, like, I'm doing it and this is correct, but they're doing it in isolation from the whole context of what it means to be Christian, right? Or let's say they're working on various ministries of taking care of things in the church, but they're not engaging in any kind of almsgiving, they're not being charitable. These things go together. They form part of a seamless garment, right? But also, even just like interpersonal relationships, think about how many times when you have an argument with someone that you love, I hope you have an argument where you fixate on what that person said or what you didn't say. Like I read recently, if you really want to have a three or four hour argument in which nothing good is accomplished and everybody goes to bed really angry at each other, just say these magic words, that's not what I said. And you're sure to get there, you know, take you right there. But what is that habit of thought all about? It's all about isolating what you said or what the other person said and trying to render judgment on its correctness or, you know, falsity or whatever and missing the point of the whole thing, which is that other person and the love that you supposedly have for them, right? When you seek to justify yourself in isolation from trying to have a justified situation, a justified relationship, then you just destroy it, right? Just as you look at different parts of scripture in isolation or elements of orthodox tradition in isolation, you, you destroy it. You rip apart the seamless garment. It's got to all go together, right? Even, you know, humans are whole persons. You can't just fixate on this one thing or this one other thing, or like, you don't love me if you do X, Y and Z. Meanwhile, the person is slaving and self sacrificing in so many other ways. But you don't do X, Y and Z, therefore you don't love me. Like, well, hello, you're the one supposed to be loving. Let God take care of that other person and what they're supposed to be doing. You do what you're supposed to be doing, right? And so when these things are brought together and they're no longer handled in isolation, then there's not just the whole picture that emerges so you can see clearly. But definitely that. But also there is a wholeness of life and there is the ability to give each other slack. And there is wisdom that we have. Like the wisdom that comes from almsgiving helps us to correctly administer the property of our homes and of our churches. If you're not engaged in almsgiving, you're not going to have the wisdom to do that stuff. Well, right. You know, a good example is, you know, there are parish councils that basically function like building maintenance societies. And they're not engaged in ministry. They just take care of a building. I mean, it's important to take care of the building. But if there's not this alms giving wisdom that comes, that is required, then it's not gonna, it's not gonna work. Well. Right. Or if, let's say those, the people taking care of the building are not really engaged in worship, like they're taking care of a building that they themselves don't even use for its purpose. Right. So, I mean, you can, you can imagine a hundred different ways that this gets applied. And I think, I'm not going to say that like this sort of sola scriptura mentality and even this kind of law versus gospel mentality, you know, however you want to split it apart, people that, that's the origin of all those habits of thought, but they sure do go together. And so I think that one of the things that sets up texts like the testaments of the twelve patriarchs does for us is it makes us."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12156.43,"end":12156.59,"speaker":"Fr Stephen De Young","text":"Set."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12156.59,"end":12241.79,"speaker":"Fr Andrew Stephen Damick","text":"Aside a lot of our assumptions and categories that are not really applicable. And see, like, wait a minute, wait a minute. This all connects. It's really one thing that even though texts like this, we don't treat it as scripture, we don't regard it as being inspired in the same way that, you know, that the Torah and the prophets and the apostles and so on and so forth are nonetheless, it shows like, this is what the people of this time and place believed. And wow, it connects in both directions. That's my biggest takeaway from all of that. And not just to learn this thing. Right. And to be amazed at how amazing it is that it all sticks together. Although that's cool. I mean, that's great. That's, you know, beginning with that sense of wonder is a great place to start. But to apply it within our own lives and not to treat things in isolation, to realize that they're all related. I'm related to my family, to my friends, to my community, I'm related to all of them and they together. The relationship that we have with each other is who we are and that we can't dissect because when you dissect than you kill. So that's, that's what I have to say about all that."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12246.91,"end":12830.65,"speaker":"Fr Stephen De Young","text":"So Christianity is a religion, not a relationship. It is true that the church is the bride of Christ. It is true that often the life of the world to come is portrayed in scripture as the wedding supper of the lamb. That does not mean that our Lord and God and Savior, Jesus Christ is your boyfriend. What that concretely means is that Christianity as a religion has a history. It constitutes a tradition. There's a way of living contained within it. There is a way of being in the world contained within it. There are teachings that are contained within it, traditions and ways of doing things that are contained within it. And these are not sort of individually up for grabs. And I know we have a lot of listeners who at various points in their life were taught, maybe even taught that it was mandatory that they build their own Christianity, that what was really important was their relationship, was that they love Jesus. And it's good, I want everyone to love Jesus, it's good to love Jesus. But that, that's what's really important. And then everything else, it is your duty to sort of figure out yourself. So you look at all these individual issues, what is and isn't a sin, this or that theological point, this or that practice. You read some Bible verses, you listen to some people speaking, you read some books maybe, and you make your decision, oh, here's where I stand on this, here's where I stand on this. This is what I'm going to do. And so you sort of shape your own way of life with some input from some Christian people and some Christian texts and some input from the Scriptures. You choose all these things. You try to keep out of your head the fact that stakes are kind of high. And if you, if you don't do this right, could end up going to hell or something, depending on where you come down on the existence of hell. And you form this thing that you just assert as Christianity. But here's the thing, that thing you made can't do what Christianity does, because what Christianity does by existing in this full orbed way is a full tradition as a way of life and a way of being, a way of seeing things. What it does is it changes and transforms people. And if I mold Christianity around myself, around my own thoughts and feelings and ideas and what I accept and what I'm persuaded by, if I mold it around me, then it can't mold me in return, and it is ideally suited to me remaining the same. That's not salvation remaining the same. In order to be molded and shaped, we need to be scraped at, bent, even maybe broken, and put back together. That's how you get changed and transformed. The most important parts of the Christian tradition, the most important parts of Christianity are the ones that seem the most wrong to you. The most important scriptures for you to read and meditate upon are the ones you don't like, are the ones that you find confusing and upsetting, are the ones that tell you that something you don't want to think is a sin is a sin, are the ones that tell you that you need to do something that you don't want to do. Those are the most important ones, and those are the first ones out the door. If we don't accept the Christian tradition as it has historically existed, as it has come down to us, the whole body, all the writings, not just the scriptures, not just the things we want to decide, are scriptures, all of the teachings, all of the ideas, all of the thoughts, the whole tradition, and that is expressed, again, not just in this intellectual sense either. This is an actual living thing of actually living your life and actually living your life publicly and in a community somewhere. Because a community, an actual community, an actual parish, an actual church, has a very important role in this, in you being shaped and you being changed and you being transformed. And the most important people to that, again, are the people in that parish who you like the least, who you get along with, the worst, who you most don't want to spend time with. Because they're the ones who are going to scrape at you. They're the ones who are going to make you bend. They're the ones who may break you at a certain point and you have to be put back together. They're the ones that are hardest to love, so they'll teach you what love is. They're the ones who are hardest to be joyful around, so they'll teach you what joy is. They're the ones who it's hardest to have peace around, so they'll teach you what peace is. That means. That means not only do you don't get to pick your Christianity, you really shouldn't even try to pick your parish, you should go to the closest one, even if they do everything in a foreign language, even if the people there aren't welcoming and don't roll out a red carpet for you right. I don't see anywhere in the Scriptures or anywhere in our tradition that says that a Christian is entitled to have everyone in their parish be nice to them or like them at all. That's certainly not St. Paul's experience when he traveled around going to different Christian communities, everyone just rolled out the red carpet and loved him and thought he was the best. Right? He didn't say, well, you guys are lousy Christians. I'm going to go someplace where I'm welcome and where they like me. St. Paul understood that he needed to be transformed, and he understood that all the hardships he went through helped do that. So all this is to say when we're talking about texts like this, texts that are part of the Christian tradition, important parts, in the case of the text we talked about tonight, very important parts of the Christian tradition. The fact that not so much the fact that people don't know about them, but that there's so many people out there who don't care about them, who would want to argue that they're irrelevant. We want to argue that they're not important because they form for themselves. A Christianity in which that's true shows the danger, the danger that we're in of a world where you can completely divorce yourself from the Christian tradition and think and claim and insist that you're a Christian nonetheless, how dangerous that is for people, how easily that can lead you down the road you don't want to go down, not the road that leads to Christ. So I want to encourage everyone listening as we approach Christianity, the Christian religion, which is the way in which we approach Christ himself, the Jesus who we love. It's not a question of what we can or want to or feel like we can't or won't accept about the Christian tradition. It's a question of how do I locate myself within it, how do I interface with it, where do I find it? Where do I plug into it so that I can be changed in such a way that maybe even some of those parts that I didn't like or hated before, I now love because I have a better understanding of who Christ is and that allows me to love Jesus even more."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12833.13,"end":12860.45,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that's our show for tonight. Thank you very much, everyone, for listening. If you didn't happen to call us and call into us live, we'd still like to hear from you. You can can email us lordofspiritsancientfaith.com you can send us a message at our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help to find a parish, head over to orthodoxintro.org."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12861.17,"end":12875.82,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Except this month when it'll be the fifth Thursday instead of the fourth. But there's something called coming on the fourth too. It'll be interesting. And you know, life was looking up for me when I left home. Seems like yesterday."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12876.22,"end":12884.54,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, join our discussion group, leave reviews and ratings in all the appropriate places and share the show with your friends who are going to benefit from it."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12885.26,"end":12895.86,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. Now I'll never go back there again. Here's where I'll stay."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12896.74,"end":12900.74,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. Christ is risen. God bless you all."}
{"episode_id":"LOS - #092 - 2024-05-09 - Testaments of the Twelve Patriarchs","start":12906.9,"end":12944.11,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of man angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
