{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":0.48,"end":65.11,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":68.79,"end":114.8,"speaker":"Fr Andrew Stephen Damick","text":"To the Lord of Spirits podcast. Christ is risen. He truly is risen. On this podcast, we laugh in the face of secular materialism, even though it's not very funny. I'm Father Andrew Stephen Damick in the bright and beautiful Emmaus, Pennsylvania. And my co host, Father Stephen DeYoung is with me from one of the tastiest places on earth, Lafayette, Louisiana, right in the middle of Cajun country. And if you are listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. And Matryska Trudy will be taking your calls tonight. And this episode is all questions all the time. This is our first ever dedicated Q and A episode. So we want your cues. You can call right now while we wait for that call board to fill up."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":114.8,"end":115.68,"speaker":"Fr Stephen De Young","text":"Before that. Before that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":115.68,"end":117.48,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, go ahead, Father Stephen. Yeah, yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":118.36,"end":121.48,"speaker":"Fr Stephen De Young","text":"Let me say I'm somewhat disappointed that you didn't do a monologue."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":121.64,"end":122.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":124.44,"end":127.88,"speaker":"Fr Stephen De Young","text":"Questions. The OED defines a question."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":128.28,"end":134.12,"speaker":"Fr Andrew Stephen Damick","text":"No, I never. I never started anything with the oed. Yeah, I don't start that way. I don't."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":134.12,"end":137.08,"speaker":"Fr Stephen De Young","text":"But you didn't write anything, so now you get this pedantry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":137.5,"end":138.86,"speaker":"Fr Andrew Stephen Damick","text":"That's good. Now go for it. Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":139.5,"end":151.26,"speaker":"Fr Stephen De Young","text":"No, or you could. You could have done the K Sunstrider monologue. You know, the power by People crave it, right? I mean, there's all kinds of ways you could have gone, but it's just like, hey, questions."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":151.34,"end":160.5,"speaker":"Fr Andrew Stephen Damick","text":"I could have read something in. In. I could have read Cadman's Hymn, which I'm starting to memorize from my old English class, which I'm taking with Father Anthony Cook. Hey, Father Anthony, watch."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":160.5,"end":166.55,"speaker":"Fr Stephen De Young","text":"Watch this transition. You're really phoning it in tonight. And you should phone in your questions."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":168.63,"end":254.49,"speaker":"Fr Andrew Stephen Damick","text":"So you can talk to a couple of phonies. All right, all that being said, while we wait for the call board to fill up, number one, do you have a copy of Father Steven's book yet? If you don't, go to store.ancient faith.com and get one. But while we wait for the call board to fill up, I wanted to read an email question that we got from our listener, Celia. And I want to put this one in because it's probably the only one that I have a really good chance at being the authority on. So this is what Celia had to say. How do you talk to your kids? I am cradle orthodox and have learned more by listening to your podcast than I did in all my Sunday school years. I'm starting to undo the materialistic view of the world and slowly trying to see the spiritual world. It's easier for me since I'm cradle orthodox and to understand that it is there. But my American upbringing and education did some serious damage for the past 40 years. In any case, I'm afraid that I have already started the corrupting of my 12, 9 and 6 year olds with the materialistic American perspective. I'm just wondering how you talk with your kids daily in order to overcome this. Of course, we talk about our guardian angels and pray to family saints daily, but I'm wondering if I can do more. So before I go off into my lengthy rant or, you know, discursus about this, Father, is there anything you wanted to say first?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":254.89,"end":258.17,"speaker":"Fr Stephen De Young","text":"I, you know, as far as you know, I don't talk to your kids."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":259.21,"end":259.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":259.53,"end":260.17,"speaker":"Fr Stephen De Young","text":"And it's probably."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":260.17,"end":262.41,"speaker":"Fr Andrew Stephen Damick","text":"And I wouldn't. You may not talk to my children."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":262.73,"end":267.85,"speaker":"Fr Stephen De Young","text":"It's probably best we keep it that way. So we'll just, we'll just let you go ahead and take this one."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":268.49,"end":612.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So. Right. This is a question that we actually get in our Facebook group every so often. And it's interesting to me because I think that a lot of people feel like that the Lord of Spirits is, you know, advanced theology or advanced biblical exegesis or something like that. And that is one of the things that we are precisely saying is actually not true, that we're not talking about weird esoterics. We're talking about stuff that's simply mainly right there in the Bible and that the people who received those texts initially would have understood to be part of their normal context and would have certainly talked to their kids. About and participated in these rituals with their kids. Right. So, you know, so. So I just want to set aside that idea that this is sort of like advanced knowledge that's only for really, really, you know, super academic people or whatever, because it's just not true. If it were true, then the church would not have embedded it so deeply in all the church services, for one thing, which are meant to be attended by everybody. Right. So all that being said, the question, of course, is how do you talk to your kids at home? And I have experienced that children often are actually much more prepared to understand the spiritual life in the kinds of mythic terms that we talk about it on this show than adults often are. Actually, you know, as adults, we spend years trying to convince myself that. Convince ourselves that, you know, that these are just metaphors or they can't possibly be true or, you know, I don't. I don't know what to do about that or, you know, that kind of thing yet. Like we often say on this show, you know, it's not just a metaphor. Right. So. So all that said, I just wanted to point out that kids have a better time connecting with this stuff. And I do talk with my kids, and the way that I talk about it is in these clear kind of mythic terms. Right. Okay. So is there such a thing as a dragon? Yes, there are dragons. Do they look exactly like you see in picture books for kids? Probably not. I mean, we don't know. No one's taken any photos of them. Are there demonic presences that ancient peoples experienced as being like dragons? Yes, absolutely, there are. There are those experiences, you know. You know, for instance, we, in our last episode, we talked about Christ's invasion of Hades. When I tell my kids, like, okay, there's this depiction of something called a hell mouth that swallows the dead. And Christ comes in, he pulls people up out of that. Like, they immediately can connect with that, especially if you show them a picture. And you know what? There's a lot of pictures of these things. If you show them a picture, they can connect with that very immediately and have an understanding of it. And, you know, yes, I may say to them, especially the older ones, like, look, this picture is the best. It's the best that people can do in terms of trying to explain what's happening. But we don't know exactly what this experience was like. But this is. These are the testimonies that we have, Right. So we could either discount those testimonies because it's hard for us to believe that stuff, or we could Simply say, well, man, people keep having this experience and they keep describing it in basically these terms, right? So, yeah, I mean, my kids, my oldest is 14 and we have three more. We have an 11 year old and a nine year old and a four year old. And this is the way they experience the spiritual life. You know, when I describe to them about when we go outside for Pascha and bang on the doors, this is what this means. This is what's happening. This is what we're connecting with. They're like, yeah, I'm participating in that, you know, so really, I mean, that's one of the things that I would say, but also like, I would say, don't neglect to bring your children to church and to have them participate in as much as possible, as much as possible. You know, I mean, I know that some people have a barrier to connecting with, with church life and you know, it can be. It can be hard, but I would say bring them as much as you possibly can to everything. That's what I do with my kids. They don't come to every single service. They can't. You know, for one thing, their mother is tired. But I try to bring them to as much as possible and especially during Holy Week and all that kind of thing, and certainly to surround them in the home with. With icons to pray together as a family. All these things, you know, to the. The biggest thing really is to incorporate it into your own way of being. And they're going to see that. They're going to see that. So, Celia, I hope that you're listening and I hope that that helps. And you know, God bless your kids, you know, pray for them that they would be able to see and to experience all the glory of God because, you know, they, they're just as capable of it and more than capable in many cases of it as, as. As you are probably. So it's a good question and definitely one that's close to my heart and."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":613.27,"end":639.17,"speaker":"Fr Stephen De Young","text":"Part and parcel of all these things. Like when you read the Torah, this becomes really clear. There's a concern all through the Torah. It's not just, well, here are some intellectual truths we want to communicate to inf adults. Here are some things we want to tell you how to do and how to live your life. Over and over. It says, when you teach your children, right, Future generations, right. The most obvious example being being Passover, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":639.17,"end":639.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":639.45,"end":648.65,"speaker":"Fr Stephen De Young","text":"When your son asks you, how is this night different than all other nights? You say, this is the night on which. Right. The Lord delivers us."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":649.37,"end":651.21,"speaker":"Fr Andrew Stephen Damick","text":"Tell the stories, tell the stories."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":651.97,"end":671.97,"speaker":"Fr Stephen De Young","text":"So part of, part of the adult reception and experience of these events built into the ritual of experiencing and re presenting these things is the traditioning of them, is the handing of them on to the next generation."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":672.21,"end":672.93,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":673.09,"end":678.37,"speaker":"Fr Stephen De Young","text":"You can't. You can't. You're not completing the ritual if you aren't passing it on."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":678.96,"end":679.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":679.28,"end":681.04,"speaker":"Fr Stephen De Young","text":"To the next generation in the process."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":681.44,"end":695.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. All right, well, I see that we have a full board of calls. This is good. God willing, it's going to be wall to wall call. So our first caller is. Is James. James, are you there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":696.48,"end":698.16,"speaker":"Jordan","text":"I am here. Fathers, can you hear me?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":698.4,"end":699.6,"speaker":"Fr Andrew Stephen Damick","text":"Christ is risen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":700.24,"end":701.52,"speaker":"Jordan","text":"He is risen indeed."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":701.84,"end":704.16,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. Well, welcome, James. We're glad to have you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":704.32,"end":704.59,"speaker":"Jordan","text":"Welcome."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":704.66,"end":711.14,"speaker":"Fr Andrew Stephen Damick","text":"What is your question comment, weird poltergeist experience that you want to share with us tonight on Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":712.18,"end":719.54,"speaker":"Jordan","text":"And I first have to say I did that completely out of instinct. I should have said truly he is risen, as he truly is risen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":721.22,"end":721.86,"speaker":"Fr Andrew Stephen Damick","text":"Don't get."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":721.86,"end":723.38,"speaker":"Fr Stephen De Young","text":"Father Andrew, don't get me started."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":723.38,"end":730.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true. I have a whole canned rant. I'm just ready to pull out. He truly is risen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":730.75,"end":732.99,"speaker":"Jordan","text":"I would love to hear that. I would enjoy."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":735.95,"end":737.79,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what's your deal, James?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":738.27,"end":867.47,"speaker":"Jordan","text":"Okay, so I have little questions for you guys, but I narrowed it down to one set of questions revolving around ritual and spiritual identity of nationhood because I've heard, I've been reading through the book by Father Stephen and I've read through all of Father Stephen's blog posts, fun project and listening to a lot of stuff. And so I'm clear that there isn't just a permanent number of 70 nations or, you know, 70 plus one Israel, etc. Because that's metaphorical in Revelations and all that kind of stuff. And that number changes. And we also see like in Israel, right, when it's split into two and God's judged those nations separately in a sense because you didn't have all of them going to exile at the same time. He was judging them separately in a sense. So there's that. And then I also remember from Father Andrew, you talking about at the Dr. Moot about how storytelling and language creates nations, in a sense, about the Kalavala with Finland. And I connected that back to how Luther in his translation of the German Bible effectively created Germany out of a mess of tribes, creating one national identity out of them via language. And then also, of course, God divided them by languages of the Tower of Babel. So there's a connection there. So I'm trying to figure out what specifically, though, ritually identifies a nation. Israel was called out of Egypt, as you've discussed, and created. That included, you know, genetically included Egyptians and Abrahamites and so on. And it's very clear, made very clear that it's not genetic, it's not ethnic. It's a ritual defining of a nation. But how does that work? What specifically? Can you just like go create a new nation ritual, like you create a new family ritually or a new church ritually? Can you just go create a new nation in that same sense? And then I have some follow up questions for now. I'll start with that, though."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":868.99,"end":870.99,"speaker":"Fr Andrew Stephen Damick","text":"Define the universe. Give three examples."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":872.83,"end":873.31,"speaker":"Fr Stephen De Young","text":"Sorry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":874.43,"end":932.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so I'll just address the thing that I said. I'm glad to hear that you went to Doxamut. I'll address the thing that I said there. So I was echoing something that J.R.R. tolkien said, which is that he regards peoples as basically being defined mainly by their language. Right. And for him, that doesn't just mean the words that they. That they say, that also means the stories that they tell in those words. Exactly. Right, exactly. Because he's a philologist, so. And you know that I'm not a philologist. I'm sort of like a wannabe BE philologist, but I just like being near those people. But I think that there's something true about that. And even while language is not itself sort of by itself, ritual, there's something ritualistic to it, and especially when you're telling stories to each other, that increases that character."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":932.99,"end":941.51,"speaker":"Jordan","text":"I would say you're just saying about the sacramental imagination. It's like that, that traditioning of an imaginative set of stories."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":941.75,"end":1056.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. Exactly, exactly. And then the other thing that I would add, because I want to leave, I know that Father Stephen has things to say about nations here, but the other thing that I would add is that one of the things that struck me liturgically over the last almost 25 years of being an Orthodox Christian is how often the phrase the race of Christians, and then also the phrase a new nation, which is called by thy name, how often that gets used on our liturgical services. Right, so there's in a sense, then, and this is not to denigrate any cultures or whatever that exist. I have love for lots of cultures. I'm getting to know cultures that I'm descended from, but it didn't receive anything from, you know that. But that the nation now is the Christian race. That's the nation that every single person is called into. And clearly it's ritual participation that Makes that what it is. It doesn't matter what color you are, what language you speak, what your accent is, like, what your background is. Everyone is called into this. Everyone can be part of it. And, you know, thus it. You know, it's. That's why it's a new exodus, right? It's a new Passover. You know, it's the Christian, the ultimate Passover in the sense of being final. Not just in the sense of being the very best, but final, like the ultimate. That's always a thing. You know, that. There's that. That game called Final Fantasy, but there was like 16 of them. How does that work? But anyway, we stopped to throw out some. Some pop culture and Ultimate. Right, right, right. Exactly. Exactly. Like it's not the last. Why are you calling it ultimate? But, but, but, yeah, so that's. That's what I would have to say about those. So, Father. Father Stephen, what would you add or. Correct. Adjust or whatever?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1057.25,"end":1218.88,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, I. I think the term people, as in a people, people being used as a collective noun, sort of functions a little better in conveying the idea. And, you know, we've. We've talked on the. On this show before about how there. There's four main ways that we interface and interact with and shape our world as humans, and those are language, music, art, and ritual. And so I think you find those four things constituting any given people, right? And in most cases, that occurs sort of naturally. It's a shared thing within a people who are living in community. And so that then develops into a people. But. And this usually ends up being very dark. There have been, especially in the postmodern era, I don't want to go all GI to board on everybody, but, you know, you can try to do that from the top down, right? You can create this sort of. Rather than it being people interfacing with the world and reality as it is, you can, from the outside, pipe into people. Here is the world sort of as a spectacle, right? So this. This mix of propaganda and advertising and all of these other things to create this sort of collective hallucination that you then impose upon people that include. That uses art and music and twists and shapes the language and even rituals, Right? And you've seen totalitarian governments, you know, do this, you know, so that can happen. You can decide, I'm going to create or reshape this people through these kind of. Through these kind of means. And when that's happening. And this is sort of what, you know, even though there weren't sort of the totalitarian states that we think of today. When you hear in the New Testament, the New Testament authors talking about the. The world. Right. That negative sense. Right. Of the world, the flesh and the devil."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1218.88,"end":1219.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1220.92,"end":1286.16,"speaker":"Fr Stephen De Young","text":"When they talk about the world, that is in part what that is. Right. The world says the world. Right. The, the world out there, they're not talking about created reality. They're talking about this system that is trying to be sort of imposed. And so Christian iconography, Christian liturgical music, Christian use of language, even though there are a lot of different languages used in the church, we also have sort of our own language. There are words we use that don't mean anything to anybody else or that mean something totally different. And obviously, most obviously, Christian ritual are all a way of fighting back against, against that encroachment of that kind of imposition of a people, an identity as a people or an identity as a community that's trying to be thrust from outside, that's trying to say humanity is one thing, this is what it means to be human. And we're saying no, this. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1286.32,"end":1286.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1286.72,"end":1287.52,"speaker":"Fr Stephen De Young","text":"In response."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1288.56,"end":1294.72,"speaker":"Fr Andrew Stephen Damick","text":"So. All right, I know you said you had like a whole set of questions, James, but you do have to let the other kids have a chance."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1295.22,"end":1295.42,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1295.42,"end":1296.82,"speaker":"Jordan","text":"Can I ask one follow up question?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1297.06,"end":1298.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay, you get one follow up."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1300.9,"end":1384.16,"speaker":"Jordan","text":"Because I was thinking about that in connection of like having the different patron saints of different nations as maybe like provinces under that maybe. But so in Scripture we have the idea of the land being defiled, like specifically the shedding of innocent blood. But of all the different horrible sins that Leviticus 17, 18 around there talking about, you know, the land spews out, the nations that are before you don't do these things or you also get spewed out. Right. And so you have this idea of the guilt, the sin contaminating the land, and that's tied to a national guilt in a sense. So I was wondering, like, is it possible because it says we can't cleanse it, but by the blood of those who shed it. Nothing else specifically says in that. And would it be possible, like, say, well, we're. We're this community inside of this nation and it's. The land is defiled. We don't agree with it, but they're not listening to us. Can we just like go say, all right, we're going to go be our own nation over here because we don't agree with all the horrible stuff they're doing, like, like, you know, a tribe basically that has their own identity saying we don't want to be Part of this, we want to go know, be a Christian province effectively and not that. Can you escape the. Because now the land that is owned by those people is now no longer being the land of that other nation."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1384.24,"end":1450.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, I, I think I get what you're asking. And, and so I would say this. I mean, in the first century and the second century, this was Christianity, Right. There was not Christian. And I mean, like if you ever read the Epistle to Diagnosis, for instance, one of the things, things it says is Christians are not distinguished from other people by the way that they dress, the way they talk, what they eat, whatever. They live among everyone else. They're citizens, but they're also citizens. They are truly citizens of this other world at the same time. So you don't see Christian separatist movements in the early church, even though they had way more reason to do that than we do in the 21st century. I mean, think about, talk about defile the land. Like, come on, it was a vile, awful, pagan, debauched place. It was the worst. Right. So, yeah, I don't know if that responds to what you were saying, but that's what I would say."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1451.52,"end":1455.92,"speaker":"Fr Stephen De Young","text":"St. Paul was conducting his missionary journeys under Caligula, for example."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1455.92,"end":1456.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1456.88,"end":1461.16,"speaker":"Fr Stephen De Young","text":"You know, and Nero obviously wasn't Caligula."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1461.16,"end":1463.36,"speaker":"Fr Andrew Stephen Damick","text":"The one that deified his horse? I'm trying to remember."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1463.52,"end":1465.28,"speaker":"Fr Stephen De Young","text":"Yeah, well, he made his horse a senator."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1465.68,"end":1466.48,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1469.44,"end":1477.52,"speaker":"Fr Stephen De Young","text":"And yeah, the. But in addition, in addition to secession being the wrong way to go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1479.62,"end":1479.78,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1479.78,"end":1503.3,"speaker":"Fr Stephen De Young","text":"Whole time that Israel was going wrong, which was pretty much the whole time. Right. We know from the Old Testament there were faithful priests who were going every day and serving the sacrifices and offering the incense for the sins and the ignorances of the people."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1503.54,"end":1504.83,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1504.99,"end":1540.6,"speaker":"Fr Stephen De Young","text":"They were atoning to purify a space within that contaminated land for God to continue to dwell. And we talked about this in one of the very early episodes, the role which Christians have in. Since that's where I am, we'll say the United States. The role of Christians with respect to. Respect to the United States is the same as. Is directly parallel to the role that a priest has with respect to his parish."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1543.72,"end":1547.64,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I hope that's useful for you and gives you something to chew on, James."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1548.04,"end":1549.24,"speaker":"Jordan","text":"Yeah, appreciate it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1549.4,"end":1562.88,"speaker":"Fr Andrew Stephen Damick","text":"Thanks very much for calling. Okay, well, we're going wall to wall calls now. We have a call from Greg. So Greg, are you there? Yes, welcome, Greg, to the Lord of Spirits. Excellent. Good to hear your voice."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1564.48,"end":1566.32,"speaker":"Jordan","text":"Okay, I guess my question is a."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1566.32,"end":1569.92,"speaker":"Fr Andrew Stephen Damick","text":"Little odd, but you are. You come to the right place."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1571.12,"end":1589.6,"speaker":"Jordan","text":"Okay. I've talked to Mormons, and they basically tell you that. That their version of heaven will be a paradise where you get. You'll get your. Your body back, but you'll be. It'll be when it was in perfect health and you were young and fit, and you will. You will get to have. Of course, they also promise multiple wives, too."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1590.4,"end":1597.44,"speaker":"Fr Stephen De Young","text":"But when you were. I was gonna say when you were young and your heart was an open book."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1598.8,"end":1600.08,"speaker":"Jordan","text":"Yeah, something like that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1600.08,"end":1600.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1600.6,"end":1637.19,"speaker":"Jordan","text":"Okay. You're perfectly fit and. And I don't know, probably like 21 or something. Smart enough to. But I guess my. I've heard. I saw a couple evangelical books on pets, and they try to say there's a case that you'll be reunited with your pets in heaven if you really want them, because that would be paradise. And would God give you. Give you that? And I guess if you had hobbies with. With pets, like horseback riding and things like that, would you be able to do that in heaven? Or is it just a spiritual realm?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1639.35,"end":1646.31,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I'm gonna let you take that one first, Father Stephen, but, I mean, I have some things to say, but let me ponder that first."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1646.87,"end":1650.55,"speaker":"Fr Stephen De Young","text":"Right. So the question isn't, do all dogs go to heaven? It's do some dogs."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1650.63,"end":1651.95,"speaker":"Fr Andrew Stephen Damick","text":"Does my dog go to heaven?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1651.95,"end":1656.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Mine are all heathens. We've established this. But."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1656.71,"end":1658.15,"speaker":"Fr Andrew Stephen Damick","text":"And you can't baptize them."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1658.63,"end":1663.19,"speaker":"Fr Stephen De Young","text":"Yes. Well, yeah, they run like crazy anytime I bless the house and throw holy water."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1663.88,"end":1664,"speaker":"Jordan","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1664,"end":1672.04,"speaker":"Fr Stephen De Young","text":"So try to get away from it. Kind of proves my whole thesis. So here we go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1672.44,"end":1672.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1672.84,"end":1679.16,"speaker":"Fr Stephen De Young","text":"Maybe the most controversial thing I've ever said on this podcast, and that is maybe."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1680.52,"end":1685,"speaker":"Fr Andrew Stephen Damick","text":"And everybody loves your yes or no answers."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1685.48,"end":1689.97,"speaker":"Fr Stephen De Young","text":"No, that's why this is the most controversial one, because I said maybe."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1691.33,"end":1692.37,"speaker":"Fr Andrew Stephen Damick","text":"Are you going to be the one that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1693.97,"end":1801.62,"speaker":"Fr Stephen De Young","text":"A couple of things on why I say maybe. St. Gregory Palomas actually has a work on this, on the souls of animals, because he affirms, as pretty much everyone did in the ancient world, that plants and animals, like humans, have souls. It's just a different type of soul. Right. It's not the same type of soul. And that's because soul basically means life. That's what the word means. Right. So when you're reading in. In Genesis, chapter one, and. And God creates the fish and the birds, right? It literally says he created all the souls that swim in the sea and fly in the air. So soul just means it's alive. The. The Latin word for soul is anima, and that's where we get animate as opposed to inanimate. So they do have souls, but not human souls. And so that's why St. Gregory says, well, you know, animals don't, you know, go to heaven or hell or any of that because it's a different type of soul. It's not a human soul. However, here's the other piece. The other piece is, and I've used this before to illustrate what theosis means as a common illustration. If you take one of my dogs, even one of my heathen dogs, and you compare it, like you take my dog Shelby, named after Commander Shelby, and you could compare her. Yes, how about that? You didn't know that. Anyway, that's fun."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1803.06,"end":1803.46,"speaker":"Fr Andrew Stephen Damick","text":"She."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1804.5,"end":1820.43,"speaker":"Fr Stephen De Young","text":"And you compare her to a wolf or a dingo or a wild dog in general, right? You would not think they're the same species. They don't behave the same way. They don't act in the same. Interact the same way."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1820.51,"end":1824.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we had dogs like that on Guam. Like, they were awful."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1824.19,"end":1900.2,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Scavenger. They're scavengers. And, yeah, they're gross. So she makes facial expressions, right? Not because she experiences human emotions, but because she's learned that, you know, we think it's cute and reward her with treats. Right. And she has come up with these ingenious solutions to problems. Like. Like she will, literally, if someone has food and they're sitting there eating it, go and run to the front door and start barking like there's someone there to get you to come look so she can loop around and get at your food. This is what I mean by heathenism. But so what's the difference? Well, there's no genetic difference, right, Between. Between wild dogs and domesticated dogs. Right. But she's spent her whole life living with humans and interacting with humans and in a human house and not with wild dogs. And so she has, in a certain way been humanized, Right. She has become different because of that relationship with a higher sort of level of. Of being."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1901,"end":1901.4,"speaker":"Jordan","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1901.48,"end":1953.82,"speaker":"Fr Stephen De Young","text":"And I've used that, as I said before, as an illustration of sort of part of how theosis works, that. That when we are spending our time not with sort of the wild humans that we start out as and could very easily become, but with God, in the presence of God, we also become more like a. A higher state of being. So that, to me, opens up the possibility that potentially some of these somewhat humanized animals we know there are going to be animals. The world to come is this creation transfigured that includes plants and animals and all the things that God created. So that to me, opens up the possibility. I'm not going to say yes, right. I'm not saying this is a fact. Say this is a possibility. It's like what St. Paul says, you know, I have not heard from the Lord on this."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1953.82,"end":1955.14,"speaker":"Fr Andrew Stephen Damick","text":"This is. But there you go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1955.14,"end":1967.38,"speaker":"Fr Stephen De Young","text":"This is my speculation that there is a possibility that perhaps some of these animals who have become somewhat humanized might still be around in the age to come."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1968.34,"end":1992.59,"speaker":"Fr Andrew Stephen Damick","text":"So the thing that I would add to that is I've heard people say things about paradise that. That are like this, except maybe like in other categories. Like, well, you know, it wouldn't be paradise unless they have. Have lasagna there. You know, something like that. Bacon. Bacon, yeah, right. Bacon, lasagna. Bacon, lasagna."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1993.15,"end":1993.55,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":1997.23,"end":2117.44,"speaker":"Fr Andrew Stephen Damick","text":"But I. I think that the key thing that people have to understand is that the life of the age to come, if you're with Christ and it's paradise and you're the kingdom of God, it is not going to be disappointing in any way. Like, there's nothing about it that you're going to be like, oh, man, this is paradise. They don't have, you know, Milky Way bars, you know, whatever. It's not going to be like that. So whatever it is that you love about this world that, you know. And by that I'm not talking about addictions or whatever, you know, I mentioned food, but. But, you know, the things that are genuine joy, right, Whatever it is that you love about this world, that same. The joy is going to be there, but multiplied times an infinity, you know, it's not going to be a bummer no matter. No matter what you encounter, you know, whether or not your dog is there with you. And I think, I mean, I like the point that you made, Father, because about the. About it being a potential being within relationship. Because we tend, at least within the west, we tend to think in terms of categories like, again, all dogs go to heaven, right? Well, I mean, having encountered some feral dogs in my time, I would prefer that they not be present there, you know, so. But if it is possible, then out of relationship with human beings who are in relationship with Christ, makes the most sense to me. But at the same time, it would be hard, especially to say to a kid who's just lost their favorite pet, well, your dog doesn't have a soul, so. Doesn't have the kind of soul you have, and Jesus didn't die to save your dog. So the way I often approach that is, I'll just say, look, I mean, Whatever it's like paradise is going to be awesome. Whatever it's like, you know, because I think that. Because. Because that is true. Everything that we know about it is true. So I don't know if that answers your question, Greg."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2117.52,"end":2118.84,"speaker":"Fr Stephen De Young","text":"And there's this."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2118.84,"end":2123.76,"speaker":"Fr Andrew Stephen Damick","text":"This is part of a good. Greg. Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2123.92,"end":2132.88,"speaker":"Jordan","text":"I thought about. Because I know some of this stuff because I lived for a short period of time, I lived in Evanston, Wyoming, right on the Utah border. So I got to know a lot of Mormons."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2133.12,"end":2133.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2133.84,"end":2155.74,"speaker":"Jordan","text":"They believe that you get married for eternity. And then I saw in the Bible where it says somebody asked Jesus if a woman was married and two of her first husbands died. She gets married to a third guy and he dies and they both die or whatever, then whose wife will she be in heaven? And Christ said, well, there won't be any marriage in heaven."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2158.22,"end":2204.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He says, you err knowing neither the scriptures nor the power of God. And you know that God is the God of the living and not of the dead. Because they were trying to disprove the resurrection is what that. That conversation was particularly about. But, yeah, I mean, I think, you know, the point being that a kind of like paradise is not simply a really great version of this. You know, it's. It's. We don't know exactly all the ways it's going to be different, but it's going to be different for sure. It's not going to be simply like a permanent resort, you know, that's for sure. Which. Which to me is Fantasy Island. Yeah. Right. Well, yes. Yeah. I will not do my Ricardo Montalban impression. I promise I will not."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2205.38,"end":2208.42,"speaker":"Fr Stephen De Young","text":"But if you do, if you do, I'll yell con. Really?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2208.42,"end":2233.62,"speaker":"Fr Andrew Stephen Damick","text":"Well, Right. See, that would be required. But. But yeah, so. So, like, I mean, I'm not an expert in the. The LDS approach to paradise, but. But my sense is that it is much more materialist. And by that I don't mean that they don't believe in spiritual reality, but that theirs is a much fleshier kind of paradise is kind of my understanding of it. So. I don't know. Father Steven. Anything you want to."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2234.9,"end":2245.45,"speaker":"Jordan","text":"Yeah. They promise you your own planet, you'll be able to have multiple wives. So believe it or not, they never actually change the doctrine. They just don't talk about it when they come to your door with the white shirts and."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2246.48,"end":2247.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2247.52,"end":2248,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2248.08,"end":2256.88,"speaker":"Fr Andrew Stephen Damick","text":"I've never gotten one of them to sing for me. If you could hide to Kolob, even though that's really a lovely, A lovely hymn. Father Stephen, what'd you want to say on that?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2256.88,"end":2273.32,"speaker":"Fr Stephen De Young","text":"Well, I was just gonna say, yeah. And, and beyond just this particular thing with pets or spouses. But it is true that the, the. The. The Creator and the material order is not sort of abandoned. Right. We don't want to go in the other direction."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2273.4,"end":2273.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2273.88,"end":2275.72,"speaker":"Fr Stephen De Young","text":"Of having a bodiless."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2275.96,"end":2276.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2276.36,"end":2344.34,"speaker":"Fr Stephen De Young","text":"A a or a ethereal kind of eternity that gets rid of the created order. Right. But it's that the created order finds its fullness and is transfigured through humanity. Right, through humanity. That's part of humanity's role, but it's through the relationship of humanity to the created order and then humanity to Christ. Right. So humanity is, again, same as we said with the last question, has this priestly role of taking the material order and through humanity, bringing it into union with Christ so that the whole creation is transfigured so it's not done away with. And on the marriage thing in particular, right, so Christ is countering the idea that there's sort of sexuality in heaven. Right. Because the question is, whose wife is she? Right, Meaning who has her is literally the language, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2344.34,"end":2344.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2345.22,"end":2348.82,"speaker":"Fr Stephen De Young","text":"And Christ is saying, well, you're not going to be having each other."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2349.2,"end":2349.44,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2349.68,"end":2393.63,"speaker":"Fr Stephen De Young","text":"Like, that's not how this works. That's not how any of this works. That, that doesn't mean that, like, you and your spouse are just gonna be strangers, right, or something, or that that the, the intimacy and the relationship that you've. That you've built on this earth is just gonna vanish and you're just gonna be like, hey, two people who are. Who are good pals, but you're gonna be pals with everybody because it's heaven, right? So we all love each other, right? That's not what it's saying, but it's saying that that relationship too is going to be transfigured and exalted and lifted up and is going to lose all of those elements of possession, jealousy, any other things that might taint that relationship on this earth."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2393.71,"end":2397.63,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right, well, hopefully that answers your question, Greg."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2398.83,"end":2400.11,"speaker":"Jordan","text":"Okay, thank you. Thank you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2400.11,"end":2413.21,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Thanks for calling. Okay, we're going to take one more call before we go to our first break. And that call is from our friend Photini up in the frozen tundra. Fotini. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2413.45,"end":2416.41,"speaker":"Fr Stephen De Young","text":"It is May. Hi, Abuna."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2416.57,"end":2427.77,"speaker":"Kristen","text":"Yes, I am from the twin cities of Ankh Morpork, and in the second episode I was known as Ashley until a few wise and the ways of Caller ID called me out on it and told Me not to make up fake names when I called in."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2428.16,"end":2428.72,"speaker":"Fr Stephen De Young","text":"That's true."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2429.04,"end":2434,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, now you're. Now that. Now you've cleaned your slate now by coming out with your. With your true name."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2435.28,"end":2444.48,"speaker":"Kristen","text":"That's true. That's true. So people found out I was in queue and sent me their questions. So I'm gonna be nice. I've got two questions that are related that you can answer together."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2445.92,"end":2448.48,"speaker":"Fr Andrew Stephen Damick","text":"Oh, thanks. Thank you for that permission. That's good."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2450.32,"end":2500.66,"speaker":"Kristen","text":"I'm just saying they're like, related. Like, so they're both about space and like occult activity. So one question is, like, a friend of mine, like, their neighbor is apparently engaging in, like, rituals and seances and psychic activity, like next door. And this makes them very nervous and they don't quite know what to do about it and. Or what they should do about it, but it makes them uncomfortable. The second question is kind of related. This person says, I'm just going to read this. My dad confronted me recently about dnd. I know by experience that it isn't inherently demonic, but in his opinion, it is ritual participation in magic which makes it so. He says all Satan needs is an inch to get in and invade your home. And in his opinion, I might as well have a Ouija board in the house."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2501.14,"end":2501.58,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2501.58,"end":2507.06,"speaker":"Kristen","text":"So these people were hoping for some insights from our. From our giggling fathers."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2508.02,"end":2522.02,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's. Giggling is only laughing that you don't want. All right? That's what I. That's. That is the truth. So all of you, all of you hate listeners out there right now who are complaining about quote unquote, giggling. It's just laughing you don't want."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2522.02,"end":2523.3,"speaker":"Fr Stephen De Young","text":"Yeah, don't let start."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2524.82,"end":2686.64,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. So see, that was a they Might Be Giants reference I caught. Yeah, well, that's because it's from Flood, isn't it? I think that's the only album I actually know. Yeah, that's the only one I know. It's true. Right. Okay. So the next door neighbor that's doing. Doing bad stuff over on the other side of the fence and DND as the. The devil's funnel into your life. Right. I mean, my temptation, obviously, with the neighbor would be like to go all Jericho on him, you know, now you just march around your own house. Okay. Blowing the trumpets and, you know. But no, no, I mean, so obviously that's a real problem. And I would simply say that the key then is to just, you know, really to increase your prayer life in your own home and pray specifically for those people because they're not the enemy. It's the, it's the garbage they're cavorting with. That's the enemy. Right? They're not the enemy. They've been fooled. They've been, they've been enslaved. They're not the enemy. You know, so, so, you know, increase prayer life at home. Find ways to be kind to them, especially without them knowing it. You know, love them anonymously in some way or another. And I don't just mean, like, feel a happy feeling in your heart about them, but like, do kind things for them. You know, that's, that's what spiritual warfare consists of. I mean, the devil can't, can't deal with humility and love and self sacrifice because that's not what he's. That's not his deal. So that's what I would say to that one. And with regards to role playing games, you know, there are, there are bad ways to do role playing games, that's for sure. But if you're talking about what essentially amounts to cooperative storytelling, which is what a role playing game is at its basis, where one person is kind of managing the story and other people participating it in terms of playing roles and that sort of thing, then, then that makes the theater just as demonic. Now, some people might argue that it was, but, but I think anyone who would say that role playing games are inherently demonic, most of them are doing things like watching television and they might go to plays, you know, other kinds of cooperative storytelling that they themselves are just, you know, watching rather than participating in. And there's nothing inherently evil about that. That's not, that does not constitute ritual participation in a demonic world. Definitely does not. So that's what I would say to those two things. So, Father Stephen, I know you have opinions."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2688.48,"end":2689.92,"speaker":"Fr Stephen De Young","text":"In general, but also."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2690,"end":2691.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, on this particular."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2691.72,"end":2722.15,"speaker":"Fr Stephen De Young","text":"Yeah, also on this. Yeah. So, yeah, I mean, what Father Andrew said about the first cases is, is basically right. You don't have to get actually done. But. Yeah, because what they may find is that if they do those things in terms of intensifying their own prayer life and prayer life as a family and those kind of things, is that the stuff they're trying to do next door will stop working."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2723.59,"end":2724.07,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2725.9,"end":2754.27,"speaker":"Fr Stephen De Young","text":"That we, we have actually, it's interesting, we have some writings from the third century where pagans at the time were trying to figure out, like, why the oracles had stopped working in some of the smaller towns as Christianity was spreading. Stuff just stopped working the way it used to. And they come up with all these bizarre theories. Like one of them was that, well, Maybe Damon just get old and die and we need to find a new one. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2755.71,"end":2756.83,"speaker":"Fr Andrew Stephen Damick","text":"Maybe they're on vacation."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2756.83,"end":2759.95,"speaker":"Fr Stephen De Young","text":"Like they live. Yeah, they're in the bathroom."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2759.95,"end":2762.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I've heard this one before. I know."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2762.07,"end":2762.39,"speaker":"Announcer","text":"This one."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2762.39,"end":2765.27,"speaker":"Fr Stephen De Young","text":"I know live longer than us, but maybe not forever."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2765.27,"end":2765.87,"speaker":"Fr Andrew Stephen Damick","text":"Who knows?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2767.71,"end":2811.25,"speaker":"Fr Stephen De Young","text":"And so there are reports up to this very day of that kind of thing happening. Right. Where it will just stop working. I. I've also had a case where I advise someone to pray for the people and to do those things. And they literally moved. They just up and moved like something happened that where they just decided we can't live here anymore and moved. So, you know, we, we. The important thing is that you don't fall into a mode of we need to be afraid of what's going on over there and find some way to protect ourselves."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2811.81,"end":2812.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2813.17,"end":2855.74,"speaker":"Fr Stephen De Young","text":"We're not as Christians, on the defensive. Spiritually, we're on the offensive. We're on the winning team. Right. D day's already happened. We're in mop up time. Right. So they don't have anything to fear from their neighbor. Their neighbor actually has something to interfere from from them that all of this that they're doing is gonna, is gonna stop working and, and they're gonna have to confront some things. And that then relates to the D and D thing. Right. In this case, I do have to actually, Father Andrew, a little bit that theater was a bad example to bring up because Greek tragedy was very much derived from pagans."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2855.74,"end":2861.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Greek tragedy, but I'm talking about like modern. Yeah, I'm talking about, you know, going to Phantom of the Opera on Broadway."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2861.45,"end":2902.65,"speaker":"Fr Stephen De Young","text":"Okay, well, how, how many steps are there between Greek tragedy and Shakespearean tragedy anyway, so. But. So just not the best example. But yeah, so. So yes, obviously if, if you're playing a role playing game and you're playing characters who are evil and you're doing human sacrifices and other horrible things that you're fantasizing about doing. That's bad. Right. But a bunch of nerds like me, when I was a teenager getting together and drinking Mountain Dew and doing math is not evil or sinister in any way."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2902.81,"end":2904.73,"speaker":"Fr Andrew Stephen Damick","text":"Right. I don't know enough Mountain Dew, though."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2905.61,"end":2910.57,"speaker":"Fr Stephen De Young","text":"We get a little wired, we'd get a little beat up, but. But it was okay. We'd get to sleep eventually."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2913.13,"end":2913.37,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":2914.25,"end":3035.48,"speaker":"Fr Stephen De Young","text":"So the bigger issue is that again, that's falling into this defensive thing, right? This is like, well, the devil's gonna find some way into our house and it's gonna be like a Harry Potter book or you Know, watching the Witcher on Netflix or something. That's not how the devil gets into your house. It's not that difficult. He. He doesn't have to trick you into buying the wrong novel. Right. He gets in there because you're proud and you're angry and you're envious and you're lazy. And through, you know, the pipeline of lust that you have coming in through the Internet to your PC. Right. That's how he gets into your house. Yeah, right. But we don't want to deal with those. Dealing with those things is very hard and again, forces us to confront things that we don't want to confront. It's much easier to sort of go for these sort of obvious cultural things, like, oh, that has magic or a wizard in it, so it's evil. So I get that out of my house, and now we have a nice, pure house. Right. And you're whitewashing the tomb. Right. You're washing the outside of the. The bowl, to use Christ's terminology. Right. To the Pharisees. And the problem isn't that you're cleaning the outside. The problem is you're not doing anything about the inside. Right. So we shouldn't be sitting around being afraid that we might watch or read or bring into our house the wrong object. We should be actively, again, proactively on the offense, inspecting our own life for the places where the devil's already there and already has a hold of us and through repentance, getting rid of them. Because the saints could get together and play a game of D and D and it wouldn't be a problem. They have better things to do, but hypothetically."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3035.88,"end":3040.36,"speaker":"Fr Andrew Stephen Damick","text":"Right? All right. Does that answer your question for Tini?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3041.35,"end":3058.47,"speaker":"Kristen","text":"That absolutely does. Thank you so much, Fathers. You know, time after time, I find myself referencing things that I have learned on this podcast. Sometimes I wish I could turn back time to sound orthodox in my youth, but I figure time is on my side. I've had the time of my life participating the Facebook group. I pray the Abuna stay forever young, because I will still be listening when I'm 64. Father's blessed. Have a good evening."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3058.71,"end":3062.87,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. All right, we're gonna go ahead and go. Oh, go ahead. Go ahead, Father."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3064.39,"end":3072.17,"speaker":"Fr Stephen De Young","text":"She said she was 64, but I think she was really 28. I see your references, and I counter."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3072.65,"end":3075.77,"speaker":"Fr Andrew Stephen Damick","text":"And with that, we are going to go to our first break."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3076.73,"end":3094.06,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits, give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3094.92,"end":3137.68,"speaker":"Announcer","text":"St. Ignatius, first century bishop of Antioch, called the God Bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess. Possess in bearing God. Fr. Andrew Damick recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he martyrdom, salvation in Christ, the bishop, the unity of the church, and the Eucharist."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3137.84,"end":3157.88,"speaker":"Jordan","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense, which that can be challenging for us because number one, he doesn't seem to have any reticence at all about going to martyrdom. Like, there's no sense of, well, this is what I have to do. You know, I wish I didn't have to, but this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3158.12,"end":3170.2,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3170.2,"end":3185.18,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3187.02,"end":3192.62,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. That was probably my favorite commercial we've ever done. It was a really good one."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3192.7,"end":3198.54,"speaker":"Fr Stephen De Young","text":"It was a good commercial. But did they, did they seal that quote from you in a coffee can? What was up with the audio?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3199.02,"end":3216.29,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I think, I feel like I didn't even know they were going to play that commercial. So thank you for that little surprise, Trudy. But no, I think that that was from when I did a little interview after that book came out. And I think that that was before. Like, I think I did it over the phone or something like that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3216.29,"end":3220.65,"speaker":"Fr Stephen De Young","text":"Okay, so you were talking into a can on the end of a string and they were recording it at the end, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3220.81,"end":3245.81,"speaker":"Fr Andrew Stephen Damick","text":"Long before I had been. I'm perched in the great tower of podcasting where I currently am. So, yeah. Okay, so this is our Q and A show. We're taking all calls, all the time. We want to hear from you. If you call and you're not able to get through, just, you know, call back. The, the lines are full. This is really awesome. So, okay, so our next Caller is David. David, are you there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3247.17,"end":3248.29,"speaker":"Jordan","text":"Yes, I am here."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3248.69,"end":3250.61,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, David, to the Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3251.65,"end":3307.29,"speaker":"Jordan","text":"Thank you very much, Fathers. My question is about the Book of Enoch and whether we should be cautious of, about incorporating doctrines derived from a book that's not accepted by the Chalcedonian Church and sort of, I mean, if the doctrines that we are talking about in the Lord of Spirits are not necessarily derived from the Book of Enoch, but also just also happen to be present in that book as well, what should we be cautious about in reading the Book of Enoch so that we don't incorporate anything that isn't scriptural into our, into our lives? My second question is for my. It's from my 5 year old and he wants to know why do the demons try to drag the people off of the ladder of divine ascent?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3308.17,"end":3326.11,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. So I think we should answer that one first. Yeah, yeah. Because they hate us. That's what it is. They misery loves company. They're in rebellion against God. They're trying to snatch us away from God. That's why they're doing that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3327.15,"end":3334.35,"speaker":"Fr Stephen De Young","text":"So they're not powerful enough to do anything to God. Yeah, yeah, but they can attack us."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3334.67,"end":3334.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3334.95,"end":3335.79,"speaker":"Fr Stephen De Young","text":"And God loves us."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3336.51,"end":3449.82,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So as the first one, you might think this is something that I have nothing to say about and it should all be punted of Father Stephen. But before he goes into a 20 minute, you know, thesis about this, I wanted to say that, so the things that we talk about on this show and then frankly the things that are embedded in canonical scripture and in liturgical tradition are not derived from the Book of Enoch in the sense that no one knew about this and here's this book and they discover it and they say, and hey, hey, is that the five year old and three year old, actually. Oh, hi, three year old. These are sounds at my house too. So it's not that, you know, they're uncovered from this book and like, okay, now let's put this in our church services. Right? It's, that's not what's going on. It's not the way that this works. Rather, what we're looking at is multiple witnesses to the same tradition. That is the faith of the people of God. Right. So of course it's going to appear in lots of different places. And that's because the Orthodox Church does not look at any text the way that, for instance, Sola Scriptura Protestantism treats the Bible, which is largely that it's a book and you derive things from it and that's your religion. Right, that, that, that Christianity is derived from interpreting that. That book and using that book. Well, right. I know I'm simplifying a little bit, but. But that's, that's generally the way it's seen. Right. So it's not like we're pulling stuff out of there in order to try to incorporate it into our faith. Our faith is what it is, and that book witnesses to some elements of it. Right. So then as to the second part, like what in reading that book, should we say, okay, we're going to just leave that to the side. I will definitely punt that one over to Father Stephen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3451.5,"end":3456.9,"speaker":"Fr Stephen De Young","text":"Right, well, yeah, so there's. I mean, agreed with what Father Andrew said."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3456.9,"end":3457.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3457.14,"end":3675.35,"speaker":"Fr Stephen De Young","text":"We don't derive doctrines from Scripture and then construct Christian theology in that way. That is the conservative Protestant approach to doctrine. But that's. That's not how we approach it. It's. As I said, there's. There Christ. When he talks about the truth going forward in St. John's Gospel, he talks about there being two witnesses. Right. You establish any truth through two witnesses in the Torah, he says the two witnesses are the apostles and the Holy Spirit. And so we have, in the. In the first and second centuries, it's very common for the Fathers to refer to the New Testament as the memoirs of the apostles. Right. That this is the account of their experience. So we've got. In the New Testament Scriptures, we've got the one witness. And we could say in the Scriptures as a whole, we have the one witness, and then the other witness is the Holy Spirit, who is alive and active in the church. So we have the record, the inspired record. Inspired, inspired by the Holy Spirit, of the experiences of people in ages past. And then we have the Holy Spirit, who causes the saints in every generation to share in that experience, as our two witnesses. So what we're trying to do on the show, when we talk about things in First Enoch or Jubilees or the Testament of the twelve patriarchs or any of these texts which the Church has preserved in her monastic settlements in most cases is not to say these. These should really be Scripture. What is canonical and what isn't is an objective thing. You literally can't argue about it, because to be canonical means that a text is read and has authority in your community. So a text is does or it doesn't. Right. So my parish, we don't read First Enoch in the liturgical services. It does not have that authority. So me arguing that it should is kind of nonsensical. It's. It's not. It's an objective thing. It's objectively not part of the canon. That said though, when we're reading say Second Peter or Jude, and Jude quotes Enoch and we say, well, wait, where did Enoch say that? I don't see that in the Old Testament or when in Second Peter it refers to the angels who sinned. When these things are referenced, when the lake of fire comes up in St. Matthew's Gospel and in the Book of Revelation, and we haven't heard that terminology before, and we're trying to understand what is meant by that in the New Testament. Well, then it helps a lot to know about the religious and spiritual life of the people who wrote the New Testament. And part of that life was reading a whole lot of texts that aren't part of the Bible. Just like for us in our spiritual life, we read a whole lot of books other than the Bible. I mean, I think most of us should read the Bible more than we do. But we also read the Fathers and we read other spiritual books and we read other spiritual things by doing that and even by quoting them. Sometimes we're not saying they're part of scripture or they're the same thing as Scripture, but they're valuable. And very often they're the context we use to help us understand the Scriptures. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3677.22,"end":3708.19,"speaker":"Jordan","text":"Those things are not claimed by others as scripture. So why that all makes sense to me what the difference with the Book of Enoch and other, you know, apocryphal or Pseudepigrapha, those are not claimed by other groups to be scripture like these are. And so to me there is most likely it makes sense to me that there would be something in them that we should caution ourselves in reading them because they were sort of actively chosen not to be Scripture."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3710.27,"end":3770.52,"speaker":"Fr Stephen De Young","text":"I disagree that they were actively chosen not to be scripture. There was never a vote taken. That's a myth. The reason why the Ethiopian church considers First Enoch canonical is that Ethiopian Jews considered first Enoch to be canonical. And so when the Christian church began in Ethiopia, they took the canon of the Ethiopian Jews as their Old Testament. They just received it. They didn't argue about it, they didn't discuss it. They just received that. Right. That was different than the Palestinian Jewish canon and the Alexandrian Greek Jewish canon. And so in the Orthodox Church we have different. So for example, I can't go to one of my Russian Orthodox brothers and say, hey look, the, the, the Greek speaking church rejected 4th Maccabees actively as part of the Old Testament. Why do you have it in there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3772.2,"end":3772.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3772.6,"end":3835.52,"speaker":"Fr Stephen De Young","text":"Or for Ezra. Right. Like I, I can't do because that. That's not what happened historically. Right. It's functioning differently in different churches. But so basically what I'm arguing for is in terms of the caution. Right? Yeah. Just like when I read a spiritual book or even when I read one of the Fathers, I don't assume that every single word is absolutely true. Right. The Fathers disagree sometimes. I can't say that both of them are 100% literally accurate. They disagree. Right. So I might try to understand why they disagree and that kind of thing. But. But I'm not. I don't elevate them to the level of Scripture where I think every word that St. John Chrysostom ever spoke is inspired by God. Right. The. The way that St. Paul's epistles are inspired. Right. The church has never said that. Right. And so the same thing with, like, first Enoch. Right. There's. There's. I mean, at least the parts that get quoted and referenced in the New Testament are true. Right. The rest of it, there's probably some things that are true and some things that aren't."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3835.52,"end":3835.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3836.96,"end":3905.72,"speaker":"Fr Stephen De Young","text":"Just like any other book that isn't part of Scripture. Right. And so you have to read it in that same sense. You take what's helpful and useful and you just discard the rest. Right? Yeah. And in the east, it's also important to add that, that in the east, traditionally, when you look at the Eastern Fathers and you look at the canon discussions in the east, and this is a difference with the west. In the west, canon was seen very much as a binary thing. 1 or 0. Right. It's either canonical and it's true and good, or it's not canonical and set it aside. Right. Get rid of it. In the east, there were always three categories. There were books to be read in the churches, which is what we call canonical. Right. They used in the liturgical worship books to be read in the home. Right. And books not to be read. So your heretical stuff is the books not to be read. The Gospel of Thomas. Right. But I would compare these Old Testament books that are in some canons and not others. Right. Or that were preserved in a monastery like Mount Athos. They copied and recopied for centuries the Testament of the twelve Patriarchs. They never read it in the liturgical services, but they kept it and they copied it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3905.72,"end":3906.12,"speaker":"Jordan","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3906.6,"end":3966.87,"speaker":"Fr Stephen De Young","text":"I would put a book like that in the same place that I'd put like, the Epistle of Barnabas or the shepherd of Hermas or First Clement, the Apostolic Fathers. Right. Not part of the New Testament. We're all we're clear that's not part of the New Testament. Right there. You can find people in the early church who thought they were part of the New Testament, who argued for them being part of the New Testament. We're clear they're not. But we still read them, and they're still helpful to us and useful to us. We just. We don't treat them like they're the Bible. They're in that second category. And so the disagreements between the Greek church and the Slavic church and the Ethiopian church and the Coptic church over the Old Testament is really a disagreement about whether certain books are in the canonical category to be read in the church or if they're in the category. These are books that shouldn't be read in the church but are fine to read in the home. That's our disagreement, not whether they're canonical or heretical. Right, yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3966.87,"end":3967.83,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3968.79,"end":3971.71,"speaker":"Jordan","text":"That does. Yeah. That. That. That really helps a lot."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3971.71,"end":3985.59,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. Excellent. Excellent. Well, thank you very much for calling. Before we take our next caller, I got an. I got a message over Facebook messenger with a question that I actually thought was a really good question, and I just thought I would bring it out. We've kind of addressed this a little bit in the past."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3986.95,"end":3989.99,"speaker":"Fr Stephen De Young","text":"You realize now everyone is going to Facebook message."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3989.99,"end":3990.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3990.67,"end":3992.51,"speaker":"Fr Stephen De Young","text":"Don't do it. Just open the can of words."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":3992.51,"end":4112.49,"speaker":"Fr Andrew Stephen Damick","text":"I know. Oh, man. This is the last one. Okay. No, so. All right. So this is from John. And John says this. This program has opened my eyes and my heart to the powerful reality, not only of the spiritual realm, which I always knew in some way was there all along, but also to the importance and truth of the Old Testament. I'm loving the ability to read the stories of the Old Testament and understand that they are not just important stories, but that they tell a true story that is the foundation of our faith. Faith. But. And this is a big but. I am struggling with some of the assertions made about the mindset of the ancient world. When you say that the ancients weren't referring to the sun, moon, and stars themselves, but to the gods which controlled them. This is difficult to accept considering the fact that to them they were simply bright lights in the sky. They didn't have telescopes. They couldn't tell. They were huge balls of burning gas and nuclear reactions. My point is that there are at least some things in the Old Testament and in the ancient worldview that have been proved utterly wrong by scientific inquiry in the last few centuries. So the question is, what do we do with that? And I would. The way that I would begin getting into this question, because I think it's a good question, is I like to point out to people that ancient people believed both that the world was flat and that underneath it was water and the underworld and the heavens were above and that the world was round at the same time. And they didn't try to make those two images reconcile with each other. Like there was a sense that there were different ways of looking at it. Right. And I think the problem comes when we attempt to say, okay, so this is the material model that we all need to be using and let's try to figure out how to make all these elements come together and reconcile, you know, so I don't know. That's, that's where I would, I would begin this. So it's a good question, I think. What would you say to that, Father?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4112.73,"end":4140.38,"speaker":"Fr Stephen De Young","text":"Yeah, well, I mean, I think we have to get it out of our head that ancient people were unfrozen. Caveman, lawyer, right? Where it was like, you're modern ways frighten and confuse me, you know, because that, that's kind of in there in the question, right? Oh, these are just bright lights in the sky. We don't have a telescope. What is it? And now we know better, right? Now we have a telescope. And so now we know better what they are."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4140.46,"end":4144.34,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's. And it's an honest qu. It's an honest question. Like, I get it, I get it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4144.34,"end":4144.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4144.62,"end":4145.74,"speaker":"Fr Andrew Stephen Damick","text":"You know? Right, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4145.98,"end":4182.13,"speaker":"Fr Stephen De Young","text":"But so this is, this is part of what we're trying to attack is that the, the ancients were less sophisticated. Right. Than us. That they were somehow different than us. Right. In that regard. Right. Not a difference in approach, but like a difference in cognitive level or something. That, and this is, this is what leads to, you know, not that the person who asked this question thinks any of this, I'm not imputing this to them, but this is what leads to stuff like ancient aliens, right? Like there's no way ancient people could have built the pyramids."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4182.13,"end":4183.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4183.69,"end":4211.45,"speaker":"Fr Stephen De Young","text":"You know, they're, they're a bunch of primitive screw heads, right. They don't know anything. Right. And that's, that's simply not true. Right. So they understood, for example, the sun and moon to be the Bo. One of the bodies of gods. Right. So the sun, we'll talk about Egyptians. Right. The sun is one of the bodies of Rey."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4212.41,"end":4212.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4212.73,"end":4230.82,"speaker":"Fr Stephen De Young","text":"Okay. We may have a more developed view of what that body of Rey is made out of. Right. But that has nothing to do with their belief."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4232.42,"end":4232.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4233.06,"end":4245.62,"speaker":"Fr Stephen De Young","text":"A modern pagan could say, yes, the sun is a mass of incandescent gas or a miasma of incandescent plasma, if they're using the new version of the song. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4247.38,"end":4247.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4247.86,"end":4252.42,"speaker":"Fr Stephen De Young","text":"But it's the body of the God the I worship."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4252.82,"end":4253.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4253.78,"end":4290.15,"speaker":"Fr Stephen De Young","text":"Right. Just like they believed that a quartz statue was one of the bodies of the God they worshiped. They crafted this statue and then they did the ritual of the opening of the mouth. And they said, this is now one of the bodies, one of the localizations, one of the places to interact with our God. Right. We can come in now with our more sophisticated science. With an electron microscope. We can tell you all about the quartz, we can tell you all about the molecular structure. They didn't know about any of that. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4290.15,"end":4290.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4290.75,"end":4295.99,"speaker":"Fr Stephen De Young","text":"But that has nothing. They could know all that and still believe the same thing. Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4295.99,"end":4320.38,"speaker":"Fr Andrew Stephen Damick","text":"And. Well, and think about it, like, don't we already accept that with regards to the human body, like, we know way more about sort of how the human body works, and yet we still believe it's our bodies. We still believe that it belongs to this person. Right. We don't say, well, we know so much about it now that there's no way that there could be a soul in there, that there's no, you know, like. Like. Yeah. So I. Yeah, yeah, yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4320.38,"end":4334.11,"speaker":"Fr Stephen De Young","text":"And so that's. That, I think, is the key. Right. Is that the myths, the stories, the religion is not a primitive form of science that science has replaced."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4334.11,"end":4335.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4335.47,"end":4341.07,"speaker":"Fr Stephen De Young","text":"It is not trying to do the same thing. It is doing a different thing that science doesn't do."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4341.39,"end":4350.75,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. So, yeah, it's a good question. I'm glad we had an opportunity to bring that up. Okay, so we're going to take a call now from Brett. So, Brett, are you there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4351.79,"end":4420.26,"speaker":"Jordan","text":"Yes, thank you, fathers, for taking my call. All I've got the question. It's actually back from the Christmas episode, so had some time to mull it over. And I guess I'm just kind of after that episode. I'm curious. You know, obviously talked about, you know, some of the different constellations, all of. All of that kind of stuff. I guess I'm just kind of left with, what do we do with astrology nowadays? Is there really anything that could be looked at still and be like, oh, you know, this thing points to Christ? Or I don't know if I'm really making sense. And now that I'm asking it, but I guess just like, you know, what about modern astrology? If there is anything that could be good or beneficial that we could glean from. Does that make sense?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4420.5,"end":4479.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that makes sense. That makes sense. I mean, I would say, number one, first we have to realize that there's Christian astrology and then there's what you refer to as modern astrology, which is this kind of new age store, you know, like, I don't know, newspaper, whatever, this sort of future predicting thing. Right? And the big difference, the biggest difference between those two is that Christian astrology, biblical astrology, is a way of understanding God's creation and his salvation and his plan for mankind all as being one great thing that is evidencing in numerous places in numerous ways. Right? Whereas what, what, you know, people who are trying to read their sign and predict the future and this is what your day is going to be like and all this kind of thing, it's really about, it's a kind of divination on some level. Now most people don't take it very seriously, but there certainly are people that do. So I don't know. Father, do you want to add anything to that?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4480.41,"end":4521.95,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, I think the key is that we as Christians, especially orthodox Christians, believe that God is constantly. Right. I mean, the psalm that we spent so much time with in that episode, right, Day after day the heavens pour forth speech, right? God is speaking to us and communicating to us and communicating his grace to us and acting in our lives through the whole created order, not just the sky, but everything. And there is, I think the important element to take from it is."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4523.87,"end":4524.15,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4524.15,"end":4627.38,"speaker":"Fr Stephen De Young","text":"Be attentive to what God is saying to us and how God is communicating to us, even if that's just at the level of going out at night in a place where there's not a lot of ambient light and beholding the beauty of God's creation in the heavens, right? The, the, the problem, as Father Andrew was pointing to, is that ancient divination in astrology, whether you were looking at the stars or you were looking at the entrails of a goat, right? That, that you're, you're, you're using technique, right? You're using a technique, right? You're using an art, right, to try to divine and foretell the future in order to be able to control it, right? Or you're looking for omens because you believe that the omens the stars control in a fatalistic way, right? The, the course of your human life and you're trying to be sort of forewarned and, and forearmed about it. And neither of those is sort of valid. Most of the Places where. Where astrology shows up in the scriptures, it's either to use the stars and the sun and the moon as symbolic of the reality of angelic beings and therefore of the destiny of humanity, or it's being used to actively invoke pagan and especially Babylonian astrology to say that actually Yahweh, the God of Israel, is the lord over the stars of the heavens, not vice versa."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4627.78,"end":4631.62,"speaker":"Jordan","text":"Yeah, gotcha. Yeah, sorry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4631.7,"end":4632.06,"speaker":"John","text":"Sorry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4632.06,"end":4635.86,"speaker":"Jordan","text":"I don't want to ask a ton of questions or anything, but you can."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4635.86,"end":4637.06,"speaker":"Fr Andrew Stephen Damick","text":"You can do a follow up if you want."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4637.62,"end":4638.58,"speaker":"Jordan","text":"Okay, thank you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4639.14,"end":4639.94,"speaker":"Fr Stephen De Young","text":"We'll allow it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4640.58,"end":4690.81,"speaker":"Jordan","text":"Stephen, appreciate it. You mentioned about the. Oh, I'm forgetting exactly how you worded it now, but basically just that whole idea that the stars determine your future kind of a deal. And a brother of mine had mentioned to me while he was actually visiting for Christmas, and so that Christmas episode was fresh on my mind about how he's started looking into star charting and all of that kind of stuff and how it deals with people's personalities and. And so I. I mean, I guess, you know, I wonder if that is a modern way of trying to be maybe a little fatalistic about, you know, oh, these constellations were around when you were born, and so that makes you this kind of person. Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4692.09,"end":4695.29,"speaker":"Fr Stephen De Young","text":"Yeah. Our. Our faults are not in our stars. They're in ourselves."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4695.63,"end":4696.27,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4697.47,"end":4698.67,"speaker":"Fr Stephen De Young","text":"I came up with that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4699.15,"end":4700.55,"speaker":"Fr Andrew Stephen Damick","text":"Did you? Did you?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4700.55,"end":4702.27,"speaker":"Fr Stephen De Young","text":"I came up with that all on my own."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4706.03,"end":4710.03,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling. It's great to talk to you tonight."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4710.35,"end":4711.23,"speaker":"Jordan","text":"Thank you, Father."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4711.71,"end":4716.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, next we have John calling, so, John, are you there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4718.67,"end":4719.39,"speaker":"John","text":"Am I there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4719.87,"end":4722.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. You made it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4723.49,"end":4724.29,"speaker":"Jordan","text":"Hurrah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4725.17,"end":4796.6,"speaker":"John","text":"All right, so I have a simple question about seraphim and serpents, but it's probably best if I come at it the long way around like a serpent, I guess. In one of the first episodes, you talked about the serpent in Eden being related to the seraphim, since the seraphim are, you know, one of the hybrid sort of hybrid throne guardians, like the, you know, like the serpent of Edith, you know, the royal serpent. And then you have this. The serpent in Eden is in a sort of inverse role. Instead of guarding the. Guarding the throne, guarding the holy place in the garden, guarding the center. He's trying to lure Adam and Eve into the center before they're ready for. Luring them into the holy place before they're ready for it. And so then you have imagination, you know, you have this fallen serpent. You have, you know, this ultimate hybrid monster. The dragon at the bottom of the world, but then on the. At the top of the world, you also. You also have those. You have ultimate hybrid with their four faces. And I know the church has found so much, so much meaning in that, you know, from the evangelists."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4798.04,"end":4808.1,"speaker":"Fr Andrew Stephen Damick","text":"So, John, John, if I could. John, if I can interrupt you there for just a second, you're kind of breaking in and out a lot, so if you could just go ahead and kind of cut chase that way. We can. We can."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4808.18,"end":4842.5,"speaker":"John","text":"Yeah, yeah, I'm getting there. So the, you know, cherubim are depicted in our iconography often with the four faces and the six wings, and the seraphim are depicted in almost the same way, just with one face and the six wings, sometimes also hands holding signs saying, holy, holy, holy. And so here, Here. Here's a question, because the seraphim in the iconography are. They're with all face and wing, which is the opposite of a serpent. So do seraphim have anything to do with serpents really? And how or why?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4844.82,"end":4848.74,"speaker":"Fr Andrew Stephen Damick","text":"Okay, that's a good question, Father Stephen. I'm definitely gonna let you jump on that one."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4849.14,"end":4851.74,"speaker":"Fr Stephen De Young","text":"Yes, yes, yes. Okay."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4851.74,"end":4853.14,"speaker":"Fr Andrew Stephen Damick","text":"I knew we get at least one of those."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":4854.5,"end":5054.87,"speaker":"Fr Stephen De Young","text":"No, they do. So there's. Yeah. So there's an interesting shift. Well, interesting to me, at least shift that happens here when. When this is carried over from the Egyptian context to the Israelite context. And so in the Egyptian context, when they talk about the throne guardians being winged serpents, the wings they're talking about are not like flying around wings. Their wings is in the cobra's hood. Right. Which is. Which is what you see, like, if you look at. Probably most famous example would be King Tutankhamun's burial mask, right. Where not only does he have the cobra on his forehead, but his sort of pharaonic headdress is like the hood of a. Of a cobra. Right? That's what they're talking about with the wings. And the other element. Of course, the other interpretation of seraphim, Seraphim would be burning ones, and that burning was not referring to a fire, but was referring to the venom of. Of a cobra. Right. So the, the direct serpentine imagery is. Is what's brought to the fore in Egypt. But what's interesting is when this gets brought over into the Israelite context, it gets brought together with the old Canaanite word for serpent, which is nakash. And we talked about this, I know before on the show that nakash, those consonants, depending on whether it's an adjective or a participle, or a regular noun can mean different things. Right. It can mean serpent, it can mean shining one, or it can mean clever or deceitful one. And you can see how those ideas are related kind of with serpents, other than maybe the shining one part. And so if you look at the earliest seraphim iconography that we have in ancient Israel, which is actually coins from the Northern kingdom in the 8th century, near the collapse of the Northern Kingdom, they depict. There's. There's sort of a depiction that everybody thinks is supposed to be Yahweh, the God of Israel. Right. And it's like, wait, you're not supposed to depict him. We're talking about the Northern Kingdom. We're likely fortunate that it's not a calf, but what it is, it just looks like a round disc. Right. Which most people assume it's supposed to be a solar disk, but it's not totally clear, but it's. It's like a round disc. And that could relate to Solomon having brought back sun worship to the Jerusalem Temple is how that could connect. But more importantly for these purposes is that on either side of this depiction of the God of Israel, enthroned are two serpents. But the serpents now have actual wings."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5056.46,"end":5056.86,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5056.94,"end":5174.7,"speaker":"Fr Stephen De Young","text":"They have sets of actual wings. Right. And so this would have been around the time Isaiah was having his vision. So there is a transformation of the iconography of seraphims from the sort of Egyptian pattern, which is what we see referenced in Genesis 3, which is what we would expect if the Torah goes back to people who left Egypt. Right, right. From that Egyptian pattern, it, over time, becomes the depiction that we now still have in the church, but it becomes that depiction we now have in the church before probably in the Persian period. So we're talking about the beginning of the Second Temple period. It's already taken on sort of the human face with the wings where you can't see what the. What the body looks like. Yeah. And I. I think this is most likely because the iconography of any kind of serpentine being became associated with the devil, essentially. Yeah. So you still see that when you see descriptions of a zazel and Second Temple Jewish literature. He's usually scaly. Now sometimes he ends up turning into kind of a raven creature. But you still get. You get the scales, you get some of that applied to him. So that's a transformation that happens in order to iconographically distinguish the seraphim who still guard the throne of God. Right. And remember, seraphim and cherubim are two different forms forms of the same kind of being in the ancient world. Right. So if you're gonna make a change to your iconography of seraphim to distinguish them from fallen demon demonic beings, how would you do that? Well, you'd make them look more like cherubim."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5175.34,"end":5175.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5176.22,"end":5187.51,"speaker":"Fr Stephen De Young","text":"Right. The ones who didn't fall would look more like the cherubim who. Who didn't fall. Right. So that's sort of how that happens and develops iconographically as, as best we can understand it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5187.91,"end":5196.79,"speaker":"Fr Andrew Stephen Damick","text":"Cool. All right. Well, it seems that John's unfortunate connection got the best of him, but hopefully he was able to hear the response there."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5196.87,"end":5198.87,"speaker":"Fr Stephen De Young","text":"We'll just assume that I nailed it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5198.87,"end":5206.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There you go. So thank you very much. All right. Well, before we go to our next call, we're going to go ahead and take a break. So we'll be right back."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5206.95,"end":5223.3,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5228.5,"end":5231.46,"speaker":"Announcer","text":"Here is Mother Alexandra of blessed memory."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5231.7,"end":5234.26,"speaker":"Kristen","text":"It seemed to me that in this."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5234.26,"end":5240.63,"speaker":"Jordan","text":"Modern life of ours, where everything has become so frightfully materialistic, there is a."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5240.63,"end":5244.39,"speaker":"Kristen","text":"Very great need of transfiguration, of a."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5244.39,"end":5247.99,"speaker":"Jordan","text":"Change of our attitude, of our way."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5247.99,"end":5250.83,"speaker":"Kristen","text":"Of thinking, our way of behaving, our."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5250.83,"end":5260.03,"speaker":"Jordan","text":"Way of holding ourselves. Everything needs a new Christianization. We must become more aware of the Christ within us."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5260.59,"end":5315.95,"speaker":"Announcer","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the church as expressed in her theology, hymnography and iconography. For those who long to become better acquainted with these holy servants of God and to understand their role in our lives, this book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com we're."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5315.95,"end":5331.74,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5333.26,"end":5367.37,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of the Lord of Spirits here on Ancient Faith Radio, and we're doing a Q and A episode. And I've just seen some comments in our Facebook group because I've been keeping my eye on that, you know, people saying it's really hard to get through. Yeah. So if you call, you know, and you hear something that says, you know, please leave a message, don't leave a message, call back, and God willing, we'll get through. But a lot of people are calling, so it's not super easy to get through right now. But we do have someone who has successfully gotten through, and that is Kavya. Are you there, Kavya?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5367.93,"end":5368.37,"speaker":"Jordan","text":"Hi."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5368.37,"end":5370.81,"speaker":"Kristen","text":"I'm here. Thank you so much for having me on the show."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5371.13,"end":5372.33,"speaker":"Fr Andrew Stephen Damick","text":"Welcome. You made it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5373.22,"end":5374.34,"speaker":"Kristen","text":"I made it. I know."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5376.26,"end":5380.34,"speaker":"Fr Andrew Stephen Damick","text":"All right, what's your question or comment or weird thing bumping in your closet?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5382.58,"end":5400.04,"speaker":"Kristen","text":"Nothing weird bumping in my closet. Luckily, before I ask my question, all of the people on Discord who are on the Divine Council podcast Discord have asked me to give them a shout out. People are having a lot of fun. People are discussing this episode, and it's a lively group, so. So shout out to the Discord."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5400.76,"end":5404.4,"speaker":"Fr Andrew Stephen Damick","text":"I've heard of Discord. It's a thing that the kids do these days."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5404.4,"end":5411.16,"speaker":"Fr Stephen De Young","text":"Yeah, it is. One of the young kids, Father Andrew, actually, is unfrozen caveman lawyer."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5414.68,"end":5415.4,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5416.28,"end":5417,"speaker":"Kristen","text":"Oh, man."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5417.64,"end":5422.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what's on your mind there, Kavya? There's like a thousand people behind you in line."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5422.6,"end":5484.13,"speaker":"Kristen","text":"Oh, dear. Okay, no pressure, no pressure. Got it. Okay. So the question that I've had since the Hell episode, and I've been saving it until this episode because the voice of Steve told me to, is how do you all understand keep your mind in hell, but despair not the thing that God said to Saint Siloam and the Athena. Because I've always been confused about this. And I can see how, on the one hand, you know, meditating upon our own sinfulness and keeping our minds in hell, so to speak, I guess, or meditating on the day of judgment all day long, which is also a thing that, you know, many orthodox resources say to do. I could see how, on the one hand, that could lead to useful, fruitful repentance. On the other hand, I could also see how it could be, you know, it could be a thing that leads us to become fearful, obsessive about our sins in a way that is not productive or helpful. And so I'm kind of wondering how you all interpret keep your mind in hell, but despair not. And the place that that know, does or doesn't have in our spiritual lives."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5484.53,"end":5619.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a great question. So the first thing that I would say in response to that is something that was said by St. Silouan's own disciple, St. Sophrony Sakharov, Elder Sophrony of Essex. And someone came to him and asked him essentially this question, like, you know, what happens when you're like, in the depths of almost despair, you know, and, you know, you feel like you're about to be cast down into hell. And he says, he said, stand at the brink until you can take it no longer and then step back and have a cup of tea. And I love that because it expresses a lot about what orthodox spirituality is about. It's not about being hardcore. Like, there's some people, there is this horrible. I've seen this online. I don't know if it's a real bumper sticker. I hope not. Which says Orthodoxy, it's Christianity, only tougher. That is utter nonsense. It's garbage. That is not what orthodox Christianity is. But, you know, so St. Silouan, okay, he was practicing a very intense kind of spirituality. And I think that, like, what he says is true. Keep your mind in hell. And that's really. It's not about think that you're about to be damned. Because he talks a lot about the love of Christ, the mercy of Christ. He's not saying, you know, think that you're damned. Right. Rather, it's genuinely about humility and a kind of intensity of repentance is what it comes down to. And frankly, you know, most people, even though that's good what he said, most people are not ready to live the kind of asceticism that he did. I think a lot of people would be driven to despair if they attempted to imitate him in the particulars of what he was doing. And that's why God gives us our own pastors and confessors to lead us into what's appropriate for us. And I think it's really interesting that his own disciple, St. Sophrony, who knew him better than anyone and wrote his biography, he's the one who wrote Saint Silo and the Athena. He's the one who gave that what seems like a contradictory kind of saying, but actually it's within the same. The same thing. You know, he's kind of emphasizing the do not despair side. Right. Everyone always wants to know about the keep thy mind in hell part."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5620.13,"end":5624.09,"speaker":"Fr Stephen De Young","text":"But don't forget, he also said, do not despair. So that's."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5624.09,"end":5627.49,"speaker":"Fr Andrew Stephen Damick","text":"That's what. That's what I would say to that. So, Father, do you have anything you wanted to add to that?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5627.73,"end":5630.85,"speaker":"Fr Stephen De Young","text":"Well, I'm not gonna actually. Saint Sophrony."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5630.93,"end":5632.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5632.53,"end":5683.15,"speaker":"Fr Stephen De Young","text":"Talk about front loading. Anyway, but, but yeah, I think in general, one of the issues we have in Anglophone orthodoxy is that almost everything we have translated into English is monastic literature. And most of it, if you read the parts that we usually skim over to get to the meat, like, say, for example, the introduction to the Ladder of divine ascent, St. John Climicus basically says, yeah, I don't tell married people to do any of this stuff, right? He basically tells, he says there what he tells married people to do. And he says, now the rest of this book is for monks. And we all skim over that, go straight into the stuff for monks, and then tie ourselves in knots."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5683.15,"end":5684.43,"speaker":"Fr Andrew Stephen Damick","text":"Like, how do I do this in."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5684.43,"end":5731.81,"speaker":"Fr Stephen De Young","text":"My own home with my kids, these monks in the prison who are, you know, doing these? How do I reconcile this with the grace of God and all that, right? And, and we're reading stuff that we can't directly apply to ourselves, right. So I try to always encourage people to read less monastic literature and more like homilies from the fathers, right? Because St. Jack Rosaster preached his homilies to people like you and me who showed up to church, right? So they're sort of aimed right, at us, including, you know, the kind of much more basic stuff we need than the people who. Monastics are writing 2D. They're in the advanced tradition track, right. They're playing advanced D and D. We're on like the basic set where we could only get to level three if we work really hard, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5733.09,"end":5733.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5733.89,"end":5807.54,"speaker":"Fr Stephen De Young","text":"And so you have to, you have to, you have to start. You have to, you have to start somewhere like that, right? And I think there, there, there's a similar idea to what St. Silan is expressing that's expressed to us in a lot of ways. It's in the prayer of St. Ephraim the Syrian, it's in some of the other sayings for the fathers, right? Where consider everyone else to be a saint and yourself to be the worst of sinners. Right, right. That idea, you know, that that's the beginning of keep your mind in hell and despair not. That's just keep a real view of who you are, right. And not look at other people. That's a place to begin, right? That maybe is a place to begin. And, and maybe someday when we're more advanced, we could get to the full on. I'm going to walk into hell Part. But for now, let's just keep in mind that I'm a sinner. And stop when we say during the liturgy, Christ came to save sinners, of whom I am chief, actually thinking in our head, well, of whom my cousin is chief, but I'm pretty bad, too. Right. You know. Right. That. That if we could really come to that, I think that's a first step toward what ST. Siloan and St. Sophrony is talking about."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5807.78,"end":5808.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5808.22,"end":5810.58,"speaker":"Fr Stephen De Young","text":"And we'll get there at some point. Lord will."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5811.14,"end":5813.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. Does that. Does that help out Kavya?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5814.1,"end":5816.02,"speaker":"Kristen","text":"That very much does. Thank you so much."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5816.34,"end":5823.54,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much for calling. Okay, let's just keep going. Next, we have Jesse calling. Jesse, you called 40 times. You made it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5824.74,"end":5825.38,"speaker":"Kristen","text":"I did."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5828.1,"end":5830.58,"speaker":"Fr Stephen De Young","text":"That was very biblical to call 40 times."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5830.87,"end":5833.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I'm sure she marked it down for each call."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5835.83,"end":5840.23,"speaker":"Kristen","text":"I figured that I had to do something like that in order to get in. So, you know."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5840.47,"end":5844.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. So, Jesse, what is on your mind this evening?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5845.67,"end":5889.69,"speaker":"Kristen","text":"I have a question that is actually from my husband, but we were talking about this, and it's about blood and ritual purity as it was kind of discussed in the sacrifice episode. You explain that blood is used to purify things like altars and. But why is blood also seen as having something that can make something unclean? So, like a woman who's menstruating or who has given birth. And this is also connected to, you know, why is it so significant that when Christ was born, you know, not only was it painless, but it was bloodless? When we see blood as being this purifying element, it's a good question."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5890.33,"end":5896.73,"speaker":"Fr Andrew Stephen Damick","text":"And I know that anything I might say about it would be much better said in the mouth of Father Stephen, so."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5897.21,"end":5901.69,"speaker":"Fr Stephen De Young","text":"So I'm. I'm. I'm gonna be the one who gets this kicked off the air for what I'm about to talk about."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5901.77,"end":5902.41,"speaker":"Fr Andrew Stephen Damick","text":"Here we go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5902.81,"end":5903.61,"speaker":"Fr Stephen De Young","text":"Here we go."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5905.05,"end":5909.6,"speaker":"Fr Andrew Stephen Damick","text":"Hey, you know, this is my job, by the way, so, like, don't ruin my job, dude."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5910.08,"end":5913.84,"speaker":"Fr Stephen De Young","text":"I have to honestly answer the questions I've asked. It's true."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5913.84,"end":5914.32,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5914.32,"end":5929.2,"speaker":"Fr Stephen De Young","text":"All right, so there's. There's two pieces here. So there's two pieces here. One is the. The safe one that we're going to talk about first, and then the second one relates to bodily fluids, and that's where we're going to get into trouble. So we'll start with the safe one."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5929.36,"end":5930.96,"speaker":"Fr Andrew Stephen Damick","text":"Everybody put your kids to bed."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5932.48,"end":5954.73,"speaker":"Fr Stephen De Young","text":"The safe one. I'll try to use technical terms. The first one is that something that is holy or sacred in. In Old Testament ritual that is taken out of its appropriate context becomes something which makes things unclean."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5957.45,"end":5961.21,"speaker":"Fr Andrew Stephen Damick","text":"Right? Like the Torah scrolls, right? Handle those, that makes you unclean."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5961.38,"end":5996.19,"speaker":"Fr Stephen De Young","text":"When you handle the Torah scrolls, your hands become unclean. But also a very pertinent example, what do you do with the blood from sacrifices? Right? You're using this blood. It's one of the interesting things about the the Day of Atonement rituals. Again, interesting to nerds like me. You're using the blood, right. To purify all of these material objects in the Holy of Holies of the Tabernacle. But if, while you're doing that, that blood gets onto your garment, right? Which is also a material object."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5996.51,"end":5996.91,"speaker":"Jordan","text":"Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":5997.39,"end":6014.42,"speaker":"Fr Stephen De Young","text":"But if it gets onto your garment, that's not where it's supposed to be. And so your garment has to be burned because your garment is now unclean. The purifying agent makes your garment unclean because it's outside of its proper place and in context, Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6014.5,"end":6020.78,"speaker":"Kristen","text":"Like the same as you would have with communion. If, like communion gets on something, you'd."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6020.78,"end":6022.02,"speaker":"Jordan","text":"Have to burn it, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6022.02,"end":6022.42,"speaker":"Kristen","text":"If."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6022.5,"end":6023.02,"speaker":"Jordan","text":"If it's."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6023.02,"end":6023.3,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6023.3,"end":6024.02,"speaker":"Kristen","text":"Supposed to be."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6024.34,"end":6024.98,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6024.98,"end":6025.7,"speaker":"Jordan","text":"Okay, Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6026.02,"end":6133.66,"speaker":"Fr Stephen De Young","text":"And so this also applies blood, because the something's blood is. Its life is seen to be sacred, especially human blood in the Old Testament. And so when it is out of his context, when it's outside of the human body, it becomes unclean and makes things unclean. Right? So when, when you're bleeding, that blood is making things unclean. When your blood is in your body, giving life to your body, it's not unclean, Right. And it doesn't make your body unclean. So that's part one. That's the non controversial part. Okay, here comes the fun. So I know it is a big issue currently and for good reason that concerns and sometimes even rules in the contemporary Orthodox Church relating to menstruation. Right. And childbirth and the uncleanness. Okay. So the same rules apply both in the scriptures and in the canons of the Church to male omissions. For whatever reason, in our modern American culture, we are much more comfortable talking about women's menstruation than we are about male emissions. I think it's related to the same reason why you can show female nudity and not male nudity in movies. But I don't know why that is. I just know that it's a cultural thing we have."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6133.98,"end":6134.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6137.1,"end":6266.85,"speaker":"Fr Stephen De Young","text":"So we don't want to talk about male emissions. We don't talk about nocturnal emissions, I'm using the most technical terms I can. We don't want to talk about that at all. And so since we don't talk about that, women especially feel like they're being singled out with their issues. But those same things apply to men. The same rules about menstruation and receiving the Eucharist also apply to men who have had nocturnal admissions. This is why men are to refrain from marital activities with their wives, priests, for example, before serving the liturgy, all of those things are related. And so we talk about one, we don't talk about the others. And the reason for that, the idea behind that, before presenting yourself at the church, coming into the presence of God, was not that there was something gross or unclean about sex or about femininity or masculinity. It was that when you've had one of those emissions or expulsions of bodily fluid, when you give birth and there's the placenta and everything that you were seen in the Torah as being depleted, you were not in your fullness, you were not whole. And so when we come before God and come into his presence, we are to present ourselves to him whole and not. And not depleted. And so those things applied to both men and women. It's just in our modern practice, we talk about one and not the other. Sometimes people try to enforce one and still don't talk about the other, so they don't try to enforce it. But those things are. Are closely linked both in scripture and in our tradition. When you go back into past centuries. So do you think we're canceled or."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6266.85,"end":6271.77,"speaker":"Fr Andrew Stephen Damick","text":"Did I. I think dodge the bullet. I think I still have a job, probably. Okay. Okay."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6273.13,"end":6274.73,"speaker":"Fr Stephen De Young","text":"I could get John to weigh in."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6274.89,"end":6280.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Does that, does that answer your question, Jesse?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6281.46,"end":6282.74,"speaker":"Kristen","text":"Yes. Thank you so much."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6283.46,"end":6285.38,"speaker":"Fr Stephen De Young","text":"Careful. Be careful with follow ups."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6285.7,"end":6286.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, let's."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6286.7,"end":6288.26,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. Let's go to the next talk."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6289.38,"end":6297.14,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you very much. Okay. Next we are going to hear from Brett. Brett, welcome to the Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6297.38,"end":6300.7,"speaker":"Fr Stephen De Young","text":"I hope this is a different Brett. It is."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6300.7,"end":6305.54,"speaker":"Jordan","text":"But ironically, I also have a question back for my Christmas episode. Speak pipe."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6306.35,"end":6308.03,"speaker":"Fr Stephen De Young","text":"Yes, I recognize this brat."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6309.63,"end":6310.67,"speaker":"Jordan","text":"Hello, fathers."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6312.03,"end":6313.07,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, welcome."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6314.03,"end":6351.8,"speaker":"Jordan","text":"My question relates to going back to the episode about astrology, the Akkadian, Babylonian, Mesopotamian and general gods of Shamash and sin, Shamash being the sun God and sin being the God governing astrology and the night. How do we relate that to a modern day or Christian theological concept of sin and particularly, I guess a Jewish theological concept of. Particularly with Hanukkah, the Shamash candle and Shamash being kind of turned into a helper of sorts from a Hebrew standpoint."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6353.08,"end":6364.71,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. Yeah. And you did send this to us earlier and it was recorded and we kept it and we actually had it as a backup for tonight. So believe it or not, that was."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6364.71,"end":6365.87,"speaker":"Fr Stephen De Young","text":"One of the questions we were going."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6365.87,"end":6414.77,"speaker":"Fr Andrew Stephen Damick","text":"To answer, was one of the questions, right. If we got no calls. So here you are asking questions. But I remember, so in your recording you asked this question, like, what is that? How does that connect with the word sin? Right. Well, number one. So this is the part that I can answer. So the English word sin has nothing to do etymologically with the God that you were referring to. It actually comes from a Latin word that refers to guilt. So that's etymologically where it is now, all of you out there who are saying, see, I knew sin meant guilt. I knew it. Just because something etymologically connects to a former word does not mean that that's what it means now or what it means theologically. All right, so the rest of all that complex of ancient Semitic deity I will leave to Father Stephen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6415.58,"end":6493.01,"speaker":"Fr Stephen De Young","text":"Right, Right. Well, I mean, Chemash, of course, is also the, the, the main, the primary Moabite deity, the, the moon deity, Chemash, and then Shemesh as the, the sun in Canaanite religion. But that comes out of Akkadian religion, you know, and, and proto Semitic. But so I mean, that, that sort of subsumed within our general understanding of the, of the sun and the moon. Right. And what we see is that while on the one hand we have the worship of the sun and the moon still going on in the, the pagan context of those gods, we also see in early Christian literature and even Second Temple Jewish literature, we see spirits associated with the sun and moon who are also portrayed as being sort of unfallen or positive spirits. Now, sometimes it's, sometimes it's hard to know for sure because even if something is a demonic fallen spirit, it's still under God's control. So it may be acting in certain ways by compulsion."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6493.49,"end":6493.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6494.21,"end":6548.94,"speaker":"Fr Stephen De Young","text":"Not by, not by its own, not by its own will. But for example, since we just got done with Holy Week, all that stuff about the sun and the moon hiding their faces and all of that isn't just poetry and allegory. That is referring to, you know, and when, when they're depicted in iconography with faces like the iconography of the crucifixion, that's very literal thing. That's from the perspective of the church and our hymnography and the Bible at no point shies away from that. The Bible at no point demythologizes the sun and the moon. So when you get to the fourth day of creation, in Genesis 1, it literally says that Yahweh created Shemesh and Chemos."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6551.5,"end":6552.22,"speaker":"Fr Andrew Stephen Damick","text":"There you are."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6552.38,"end":6566.78,"speaker":"Fr Stephen De Young","text":"Right. It doesn't say he created their bodies. It doesn't say it says he created Shemesh and Chemosh and appointed one to rule the day and one to rule the night. Right. Which rocks and miasmas of plasmas can't do."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6570.22,"end":6575.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, does that answer your question, Brett? I know it probably sprouted 10 more for most of us, but."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6576.3,"end":6580.6,"speaker":"Jordan","text":"Yeah, I think it opens more than it answered, but it did answ my question. Yes. Thank you, Father."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6580.84,"end":6583.56,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much, Brett. Good to hear from you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6583.8,"end":6586.4,"speaker":"Fr Stephen De Young","text":"We got to keep people coming back for future episodes."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6586.4,"end":6587.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6587.24,"end":6587.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6587.56,"end":6588.6,"speaker":"Fr Andrew Stephen Damick","text":"On a future episode."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6590.12,"end":6590.4,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6590.4,"end":6596.2,"speaker":"Fr Andrew Stephen Damick","text":"Okay, next we have someone with one of the greatest names ever. So welcome, Andrew, to the Lord of Spirits podcast."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6597.32,"end":6600.84,"speaker":"Jordan","text":"Hi. I have a question on giants, actually."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6601.32,"end":6604.12,"speaker":"Fr Stephen De Young","text":"Yeah, about time. Yes."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6606.39,"end":6630.63,"speaker":"Jordan","text":"In Matthew 25, it says the rulers of the Gentiles lord it over them, and the great ones are tyrants over them. And yet I've heard a couple times, and I think it's in the book, too, about the demons not having hierarchy or bureaucracy, but just bringing things to chaos."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6631.6,"end":6632.12,"speaker":"Fr Andrew Stephen Damick","text":"So. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6632.12,"end":6638.64,"speaker":"Jordan","text":"It seems kind of a paradox where they use rulership to bring chaos in my. Am I following this or."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6641.12,"end":6647.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay. Well, I have some ideas, but, Father Steve, why don't you go ahead and take a crack of this first?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6648.56,"end":6750.14,"speaker":"Fr Stephen De Young","text":"Right. So two things. First thing is, right, where we're interpreting what Christ said, and I think you're right to do that in this case context, we're talking about the relationship that those spirits would have with the people. So if we're talking about the gods of Rome and the people of Rome, the gods of Egypt and the people of Egypt. Right. That's the tyranny and the lording it over them. Right. To bring about their. Their destruction. So there's this interplay we talked about when we were talking about the beginnings of Neolithic religion and how that pans out. We talked about how there are these two principles that correspond to Behemoth or Behemoth and Lotan or Leviathan. Right. In. In the Old Testament. And the Baheimot, the bull of Heaven. Right. This is sort of the. The who becomes the. The beast from the earth in the Book of Revelation is associated with Tyranny It's a source. It's associated with sort of that kind of tyranny and domination, right? Which. What does tyranny and domination produce? I mean, ultimately it produces destruction and chaos, right? It's not order in the sense of God's divine order, right? It's not sort of like goodness gone too far, right? It's, it's, it's this, this kind of false order, right? This false order that's imposed that sort of grinds humanity in its. In its gears, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6751.26,"end":6769.27,"speaker":"Fr Andrew Stephen Damick","text":"And then, I mean, and I would say. I would add to that if I. And sorry for to interrupt, but I would add to that that no created thing can be truly perfectly chaotic, right? Because it's been put into order by God, even if it's functioning in a very distorted way, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6769.27,"end":6770.07,"speaker":"Fr Stephen De Young","text":"Wouldn't exist."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6770.23,"end":6802.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. So a drunk man in a bar who's, you know, who's. Who's like the Hulk and going around and smashing stuff and hurting people. He is functioning in a certain. In a certain orderly way. You know, like his brain is sending signals through his nerves to his muscles to do things like. It's very orderly, like on a certain level, but it's against the order of God, Right? So that's just what I would add to interrupt there. I'm sorry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6803.16,"end":6928.78,"speaker":"Fr Stephen De Young","text":"Right, right. And then Leviathan would be the principle of sort of abject chaos, right? But both are evil, right? Both of them are aimed at destruction, right? So you can, I mean, you look at the, the Holocaust in Germany. IBM made punch cards. They manufactured punch cards for the death camps, indicating this person is a Jew, this person is a gypsy, this person is a homosexual, this person is a quote unquote defective, right? Why they were there to schedule the execution. There's plenty of order there, right? You've got your IBM punch cards, you've got your bureaucracy, you've got your system, right? It's bringing about destruction, right? And then you've got just abject, you know, chaos of war out on the battlefield of men and women and children being killed and cut down and, and hit by shrapnel and. Right. Which is producing the same result. You could produce the same result either way. And in fact, the two tend to go together in this. In this kind of dialectic, right? The beast from the earth and the beast from the sea, Behemoth and Leviathan, they, they go together and they, they have this interplay with each other, right? Livy famously said about the Roman Empire, you know, they've made a wasteland and called it Peace, Right. They go out and destroy and create this wasteland and then say, oh, look how peaceful and perfect and beautiful it is. And orderly, you know, so those two. There's an interplay there in evil between sort of order and chaos. It's not order in the sense of the divine order, the order that comes from God, the hierarchy that God establishes right in the universe. And in terms of being right, it's order in the sense of regimentation and tyranny and bureaucracy in the modern age, even."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6928.86,"end":6931.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Does that make sense, Andrew?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6932.22,"end":6936.38,"speaker":"Jordan","text":"Yeah. So it's kind of like the chaos that Sauron's order brought."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6937.18,"end":6953.93,"speaker":"Fr Andrew Stephen Damick","text":"There you go. No, I wasn't the one who meant. Who brought Tolkien up, but there you are. All right, well, thank you very much for calling, Andrew. That's a good question. Okay, so next we have Kristen on the line. So, Kristen, are you there?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6955.61,"end":6956.65,"speaker":"Kristen","text":"Yes, sir, I'm here."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6957.13,"end":6960.33,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, Kristen. The Lord of Spirits. What is your deal?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6962.17,"end":6973.05,"speaker":"Kristen","text":"Well, I'm just going to say thank you for even giving a maybe on the all dogs might go to heaven. No one is ever given me such a good excuse to adopt random stray animals in my life."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6973.85,"end":6985.61,"speaker":"Fr Stephen De Young","text":"Let me tell you, my dogs are all he did. But my mom's dog is such a holy dog. She once ran away and literally spent 40 days living in the wilderness and then returned."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6986.81,"end":6988.97,"speaker":"Fr Andrew Stephen Damick","text":"Wow. To the promised land."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6989.93,"end":6997.42,"speaker":"Kristen","text":"I literally spent 35 minutes prying a cat out of my engine this afternoon. Now in my house. And I'm like, okay, why not?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6997.58,"end":6998.86,"speaker":"Fr Andrew Stephen Damick","text":"So why not?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":6998.86,"end":7002.3,"speaker":"Kristen","text":"Anyway, to my actual question, you can't."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7002.3,"end":7004.14,"speaker":"Fr Andrew Stephen Damick","text":"Eat them, might as well feed them. Sorry."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7007.02,"end":7010.54,"speaker":"Fr Stephen De Young","text":"Sorry, Kristen. He's not a pet. He's not a pet person."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7010.62,"end":7014.54,"speaker":"Fr Andrew Stephen Damick","text":"I'm not. No, no. I'm not a pet eater either. So, I mean, I'm not going to eat your."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7014.7,"end":7015.26,"speaker":"Fr Stephen De Young","text":"You know."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7015.42,"end":7016.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay, go ahead."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7016.22,"end":7018.3,"speaker":"Fr Stephen De Young","text":"His wife will cook your guinea pigs."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7019.5,"end":7020.62,"speaker":"Fr Andrew Stephen Damick","text":"That seems likely."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7022.35,"end":7099.1,"speaker":"Kristen","text":"Okay, then. And pivot. All right. I had about 15 questions, but I'm going to just pick. So the story you've mentioned in several episodes where. No, actually, no, that's not it. All right, so the Nephilim being the unclean spirit in the New Testament. So, you know, I've looked at. I've, like, read your whole council blog post on it about how, you know, we got some of that from Jubilee, and some of that was kind of inferred from, you know, they're described as unclean spirits. They're not described as demons specifically, but unclean spirits. And based on that, that means they're mixed, which in the Taurus So I'm just curious, is there other, like scriptural, like in our canon, holy scriptures, evidence for that, or is this one that you just kind of have to go, okay, well this is what the church has traditionally taught and you know, it's consistent with these inferences in the Old Testament."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7100.87,"end":7112.63,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. So Father, you want to expand on that? Yeah, yeah. I mean, unclean spirits do show up at other parts of the New Testament. I don't know if that's what you were asking, at least part of it, but they do, like."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7112.95,"end":7116.39,"speaker":"Fr Stephen De Young","text":"Yeah, no, I think she means particularly their origin. Their origin."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7116.39,"end":7117.23,"speaker":"Fr Andrew Stephen Damick","text":"The origin question."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7117.23,"end":7162.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So to a certain extent, right? To a certain extent that are a whole bunch of things that when we get to the New Testament, they just kind of pop up, right. And they're not. There's not really much of it in the Old Testament, Right. You know, all of a sudden there's Pharisees and Sadducees, right. All of a sudden, right. There's a bunch of things that have cropped up, but one of those is there seem to be demon possessed people running around all over the place. Right. When you get into the Gospels, Christ is doing these exorcisms all the time, all over the place. And, and you see some unclean spirits coming upon people in the Old, like Saul in the Old Testament. And there's, there's the possession in Tobit, Right. If you're using the longer Old Testament canon, you've got Tobit there."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7163.45,"end":7163.93,"speaker":"Jordan","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7164.25,"end":7185.7,"speaker":"Fr Stephen De Young","text":"But there's not a ton, Right. And, and you, you don't even get a lot of stuff in the Old Testament. Well, you definitely don't get a lot of stuff in the Old Testament that talks about, oh, the Messiah. When he shows up, he's going to exorcise all these demons. Right. So we're not sort of ever directly told in the pages of Scripture. Well, here's where they come from, right. All of a sudden."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7186.02,"end":7186.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7186.58,"end":7273.84,"speaker":"Fr Stephen De Young","text":"And here's why Jesus is so concerned with casting them out. That's why exorcist. Now that's interestingly St. John's gospel. He doesn't do any exorcisms. But in the Synoptic Gospels, major emphasis on Christ doing these exorcisms. So we have to look at, well, if it's not spelled out right here in the pages of Scripture, what explanations are there from the Jewish world, Right. In the second Temple period, where did they think they came from? And when you do that, that's where you come to the Nephilim explanation. And in fact, that's the only explanation you come to. There weren't sort of like competing stories, at least that we still have. Right. So which means that either that was just what everyone believed or that if there were other competing stories, the one that we still have is the one that everyone accepted, and that's why those texts were passed down and the other ones worked. Right. And it's not just a question of, well, this is the only explanation we have, so I guess we should just go with it. But the details of that explanation are referred to in places. I mean, it's oblique, it's not spelled out, but are referred to in places in those exorcism stories. So the demons who Christ cast into the pigs say, have you come to torment us before the time? Right, right, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7274,"end":7276.16,"speaker":"Kristen","text":"Yes. Consistent with the Jubilees."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7276.32,"end":7321.53,"speaker":"Fr Stephen De Young","text":"Right. So it's sort of like, well, what's that referring to? Well, if you've read Jubilee, you say, well, that. That is. That is then consistent with that version of the story. That makes sense. And so these are inference type evidence, not deductive type evidence. Right. And the fact that, you know, they talk about being cast into the abyss. Right. Is consistent. Right. So. So we have this one explanation for the ancient world. All of the evidence that we do have in the scriptures is consistent with it. If you want to read more about this, a fellow named Archibald Leach wrote a book called the Origin of Evil Spirits, which is, I believe, developed from his doctoral dissertation and put into a slight."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7321.53,"end":7323.21,"speaker":"Kristen","text":"That is a fantastic name."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7323.45,"end":7378,"speaker":"Fr Stephen De Young","text":"Yeah. That is just like the most amazing. Archie Leach is like the most amazing British name ever. But yeah, his book the Origin of Evil Spirits, which is based, I believe, on his doctoral dissertation, might be based on a monograph, but he's the guy on that. I mean, he goes all the way to Archie. Right. Sorry. W, W, R. Yeah, I was thinking of Cary Grant. Anyway, that'll make sense to, like, five people, but yeah, Archie Wright, sorry, Archibald Wright. He goes all the way in on this. So he goes into all of the sources, all of the details. Right. Exhaustively. Just on the origin of the demons in the synoptic gospels. So that's the place to go if you really want to do a deep dive and go all the way down the rabbit hole on that."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7378.72,"end":7379.76,"speaker":"Kristen","text":"Well, of course I do."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7380.08,"end":7380.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7380.8,"end":7381.36,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7381.52,"end":7382.8,"speaker":"Fr Stephen De Young","text":"Why wouldn't you? Yeah."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7383.2,"end":7389.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, okay. Well, thank you very much for calling and nice to talk to you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7390.01,"end":7391.85,"speaker":"Kristen","text":"Thank you so much. Fathers, have a good evening."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7392.01,"end":7396.89,"speaker":"Fr Andrew Stephen Damick","text":"You too. Okay, we've got Vince up next. So, Vince, welcome To the Lord of Spirits."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7398.25,"end":7401.93,"speaker":"Vince","text":"Thanks, fathers. My name is Vince and I'm a recovering Calvinist."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7402.97,"end":7403.93,"speaker":"Fr Andrew Stephen Damick","text":"God bless you."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7406.09,"end":7408.41,"speaker":"Fr Stephen De Young","text":"It can be overcome. There is hope."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7408.65,"end":7410.49,"speaker":"Jordan","text":"Okay. Amen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7411.85,"end":7458.2,"speaker":"Vince","text":"So because of going too deep into the reformed rabbit hole, I'm trying to wrap my mind around different views of atonement. So I haven't re. Listened to your episode yet, but my question is about cosmic geography and the atonement after the cross. And there's sort of two related questions. I hope so is Christ dying for the sins of the world more kind of cosmic geographical language with reclaiming the nations rather than specific individual sins in a kind of works contract Lutheran failure kind of atonement because we become sacred space. So Christ died for the nations."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7458.6,"end":7459,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7459,"end":7465.25,"speaker":"Vince","text":"He also died for, for us to become sacred space where God's presence could dwell. Well, like in Eden."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7466.53,"end":7475.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Okay, next. I mean it's great when people got stuff figured out for themselves. It's good."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7476.61,"end":7481.49,"speaker":"Fr Stephen De Young","text":"Yeah, you've got it. No, I mean that's, that's, that's, that's exactly it. That's exactly it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7481.49,"end":7487.77,"speaker":"Vince","text":"Like so did do we say though that and sorry, this isn't the second follow up question, but just."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7487.77,"end":7488.37,"speaker":"Fr Stephen De Young","text":"That's okay."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7488.53,"end":7489.21,"speaker":"Vince","text":"Yes, so I have."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7489.21,"end":7490.21,"speaker":"Fr Stephen De Young","text":"That was a short answer."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7490.43,"end":7509.39,"speaker":"Vince","text":"So yeah, okay, so but Christ, he died for the sins of all of humanity because he took upon death the wages of sin. Well, not like every sin I ever committed as in some individual tallying system."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7509.87,"end":7531.16,"speaker":"Fr Stephen De Young","text":"Well, where are you getting the sins of all of humanity? So this is part of the translating 1 John 2:2 correctly, which is. It says he died not only for our sins, but for the whole world. There is no. Those of your English Bible may tack that in. Right. So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7531.48,"end":7539.64,"speaker":"Fr Andrew Stephen Damick","text":"And this is Father Stevens doctoral dissertation that he wrote a thousand pages on like the last eighth of a verse. I'm slightly exaggerating."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7539.88,"end":7547.33,"speaker":"Vince","text":"Find it online. But it's not. I use people's dissertations for free online, but I couldn't sleuth that out."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7549.01,"end":7589.11,"speaker":"Fr Stephen De Young","text":"But, but yeah, so it's, it's, it's translating that correct. So this is, this is understanding the, the element of salvation that is universal and the element of salvation that isn't. Right. And part of the problem with atonement in the west is that this isn't clearly distinguished. And so you end up trying to say that one thing is both universal and not at the same time. And that's where you get sufficiency and efficiency. That's where you get redemption accomplished and redemption applied. You know what I'm talking about? Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7590.63,"end":7596.32,"speaker":"Vince","text":"And that's where you destroy your assurance because how can you ever really know your elect then, Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7596.56,"end":7695.5,"speaker":"Fr Stephen De Young","text":"Right. So the two elements are two separate elements, right? So Christ defeats death on behalf of all humanity. Right? In the, the resurrection icon, Christ is grabbing Adam and Eve, right? All of humanity. Death no longer has a claim on every human being is going to rise on the last day to be judged by Christ and, and no one else. Because Christ is now the Lord of the living and the dead. Right? That part is universal. The sin part is not universal. There is no icon of Christ redeeming Cain. There is no icon of Christ redeeming Judas. So that part is not universal. Right? It's not that the whole thing is somehow universal and then not universally applied, it's that there's two elements of it, right? And then there is actually a third element that's also universal, that's Christ's defeat of the devil, right? And the, the hostile powers which affects everyone. Right? But this is why St. Paul can say Christ is the Savior of all men, but especially those who are faithful, right? Because two out of three affect everybody, but the third one is only the faithful. Right? The sin is about the faithfulness. It's about the repentance and salvation from sin, purification in Christ's blood. All of that takes place within Christ's church."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7698.95,"end":7699.07,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7699.07,"end":7699.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7699.23,"end":7704.35,"speaker":"Vince","text":"And that's because those who don't repent don't receive atonement, right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7704.35,"end":7707.03,"speaker":"Fr Stephen De Young","text":"Don't receive the purification that comes from."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7707.11,"end":7708.71,"speaker":"Vince","text":"Christ's blood, the cleansing."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7709.43,"end":7709.83,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7709.99,"end":7715.91,"speaker":"Vince","text":"Okay. Praise God. If I have time, I have a sort of related fast follow up question about."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7715.99,"end":7717.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay, you got a quick one?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7717.67,"end":7718.55,"speaker":"Fr Stephen De Young","text":"We'll allow it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7718.63,"end":7773.75,"speaker":"Vince","text":"Okay, so with cosmic geography and the reclaiming of the nations, when a nation like for example, Turkey was Christianized and later, you know, Constantinople Falls in 1453, there's sort of a legend, I don't know whether it's historically true, but I've heard it from Muslim sources that, you know, lightning struck the Hagia Sophia and there were sort of portents in the sky when the city fell. So, you know, that area has sort of been almost like reconquered by a fallen, you know, one of the fallen gods, the one of the other Elohim. And so does that mean that territory has now sort of become unclean in a sense and like we have to go reconquer it for the Great Commission to have covered that territory."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7774.72,"end":7784.88,"speaker":"Fr Andrew Stephen Damick","text":"I was hoping you were going to ask about the Marble King. Well, if you don't know what that is, Vince, Go look it up. Yeah. If you don't know what that is, go look it up."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7785.92,"end":7795.6,"speaker":"Fr Stephen De Young","text":"If it were to happen, of course, we would reconsecrate the Hagia Sophia. We would go in and purify it and reconsecrate it. As a Christian."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7796.24,"end":7813.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a kind of tension where the whole world belongs to the Lord and he's made it clean. But at the same time, there is the way that people in particular areas are participating or rebelling against that. Right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7813.13,"end":7838.85,"speaker":"Vince","text":"You see that with Israel in a way that it's almost like a power changeover, where if the church is in the ascendancy or in the majority, we've sort of restrained evil and cleansed that space by our presence. But then when we get kind of conquered, you know, does the demonic influence increase and pollute it in a way that we have to, like, reconquer it again?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7841.65,"end":7851.03,"speaker":"Fr Andrew Stephen Damick","text":"Yes. But I would emphasize, like, I. Sometimes people have these wonderful fan. And I'm not saying you're saying this, but sometimes people have these wonderful fantasies. They're like, we need to retake Constantinople."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7851.98,"end":7852.54,"speaker":"Fr Stephen De Young","text":"Like, great."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7852.54,"end":7863.78,"speaker":"Fr Andrew Stephen Damick","text":"It's a great idea. Job number one, learn Turkish. Job number two, come to my missionary training school, because that's how you retake Constantinople."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7863.78,"end":7864.7,"speaker":"Jordan","text":"I know a little bit."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7865.18,"end":7882.74,"speaker":"Fr Stephen De Young","text":"Right? Yeah. And think about it in terms of the Old Testament. Right. Why did the Assyrians and the Babylonians, these pagans, come in and take back the land from Israel and Judah? Right. God allowed it as a judgment."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7883.14,"end":7883.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7884.66,"end":7895.86,"speaker":"Fr Stephen De Young","text":"Right. God allowed it as a judgment. And if you read the monastics and the spiritual writers writing at the time of fall of Constantinople, they're very clear that it fell as a judgment from God."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7896.34,"end":7916.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's what people then said. All right, well, thank you very much, Vince, for calling in. We are going to take one more caller before we call it a night. And that's Jordan. Jordan, you are the fortunate person who made it in at the right before the wire. Welcome, Jordan."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7917.48,"end":7918.68,"speaker":"Jordan","text":"Thank you. Fathers."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7921.64,"end":7930.69,"speaker":"Fr Andrew Stephen Damick","text":"What'S your question or concern or odd knocking at the door? Accusations, insinuations."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":7932.05,"end":8019.88,"speaker":"Jordan","text":"Well, it may be something knocking at my door with this question. When I was in high school, I was just learning about the more liturgical aspects of Christianity, such as Catholicism and then later Orthodoxy. I grew up a Protestant, and in that I found, quote, unquote, Christian witchcraft. And for some reason, that really connected with me, dare I say that. And I started practicing it on a minor scale, although I don't think any witchcraft is minor, but such as putting a cross within a pentagram and Writing spells. I hate to use that term now, directed toward God. And I have a friend on Facebook who identifies as a Christian shaman, using native and a lot of Nordic traditions mixed in with Christianity. So I was wondering just how that would end up within the Christian scheme of things and how to explain the difference between liturgical worship and daily prayer versus witchcraft to Protestants who are very adverse to repeated prayer, like the Jesus prayer or making the sign of the cross. And that is witchcraft."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8020.52,"end":8312.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's an awesome question. I'm so happy it's our last one. Right. Okay. So not to. Not to puff you up, but. Okay, so. So lots of things going on here. Number one, you know, what fellowship hath Christ with Belial. Right. You don't mix these things. So obviously it's a big no, but. So then the question is, like, what about people who can't tell the difference between liturgical worship and witchcraft and just say that's. That's dark and evil and pagan, demonic, whatever. I mean, I've heard that many times. So. So here's the difference. And this kind of goes to one of the things that we've talked about a lot, which is that in some sense, Christianity and paganism are not two different games. They're two different teams playing the same game. Yeah. So ritual participation in the worship of your God is how you worship your God for the vast majority of the history of the world, no matter where you are. Right. And the difference between the worshipers of the one true God, the God of Israel, and everyone else is largely based in who they're aiming their worship towards, who they are worshiping. You know, who are they offering their sacrifices to and having that communion with. Right. That's the biggest difference. Now, there is also a qualitative difference that comes in as well. I mean, there's all kinds of qualitative differences. One is morality. I mean, pagan morality is way different from the morality of the God of Israel. But also, the other thing about witchcraft in particular is that it is about manipulation. It's about control. Right. And I mean, often. I mean, it depends on what exactly you're talking about. Like, there's something called, you know, Christopaganism, Christian Wicca. There's even a book called the Path of a Christian Witch. Like, this is all this kind of stuff you can. You can find. And in some cases, it's about invoking other spiritual beings. Right. So literally, it's a kind of. Literally, it's syncretism where you're worshiping, you know, more than. More than one thing at a Time, you know, in some ways it's a kind of exploitation of Christianity. Like, oh, the cross is a powerful thing. I'm going to use it, you know, in my magical spells, you know. Boy, I just can't help but think of that. The ending of Indiana Jones. Sorry. The Raiders of the Lost Ark, where they want to take the Ark of the Covenant and use it for their own stuff. What a bad idea that was, you know, so, so, so, yeah, I mean, I think the thing to do is because, I mean, I come from evangelical Protestant background before I became orthodox, and ritual often in certain evangelical circles is looked at as being this dark and terrible thing kind of in and of itself, right? And so when I talk with people like that, I say, look, I get what you're saying, but the truth is that you engage in rituals all the time. You do things that are gestures and actions that don't sort of accomplish anything utilitarian in themselves. Like, why shake hands? That doesn't do anything. Why shake hands? It's an action that ritually indicates a meeting or a friendship or trust or whatever. But you can have those things without the shaking of hand. Hands. But why do you do it? You do it because that's the ritual you do and that's the way that you participate in this relationship, right? Or why, when you're in a cemetery, are you quiet? Why are you respectful? Why do you maybe light a candle? Why do you maybe leave a flower? Why do you do that? Again, it's not utilitarian in any way. It's not like the dead are, you know, going to be mad at you if you're running around and yelling in the cemetery. I mean, maybe they would probably not, you know, that's. That's not what's going on. So people act ritually all the time. They often. They just don't see it. Or like anytime someone gets married, right, do they just go down to the courthouse and just sign a thing and then that's it. Even the people who are the most sort of atheistic and secular want at least some kind of. I do. Before they do that, there's still a need for some kind of ritual. Or when someone graduates, or when we inaugurate a president of the United States, boom, out comes the ritual. So we do rituals. It's just that we've reduced what the number that we do and the way that we do it and so forth. And of course, again, if ritual is bad, what is the deal with all that ritual that God directly commands? In the Old Testament, you Know, it can't be inherently bad, or else God would never have commanded it. It's not like suddenly it became evil, you know? So, I mean, that's what I would say. I think about worship a lot, and especially since, as I said, I have an evangelical background and people have been asking me these questions for the last 25 years. So, Father Stephen, you get the last word."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8313.72,"end":8314.92,"speaker":"Fr Stephen De Young","text":"Okay, well."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8315.16,"end":8316.92,"speaker":"Fr Andrew Stephen Damick","text":"And your dogs, Your heathen dogs."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8316.92,"end":8579.64,"speaker":"Fr Stephen De Young","text":"Yeah, my heathen. This, this. That's Emmett in particular, for the record. So, yeah, the problem with witchcraft is the same as the problem with priestcraft. And that's the craft part, right? That's the, The. The technique again. The. The fact that it's trying to get God or the gods or spiritual forces or nature or what have you to do what you want them to do. You're trying to change God. Right. And Christians are perfectly capable of doing this, too, without resorting to any of that. Right. If your prayers are mostly you reading your list of demands to God, if that's how you think about prayer, if that's how you think about getting people to join you in prayer, well, if we get enough people praying for it, God will have to do it. Any of those kind of things where you're trying to change God or get God to do something and you're trying to figure out how to do it, then there's a basic problem. Because the reality is ritual doesn't change God. Whether you're trying to or not. It doesn't. It changes you. So when you do ritual, it changes you and your world. When your community does ritual, it changes your community and its world. That's what it does. Whether you're trying to do something more, less, nothing, it doesn't matter. That's what gets. That's what gets changed. And so when we're engaging in the Divine Liturgy, when we're praying with our families, when we're praying alone, right? That's to change ourselves and our world in which we are living every day. That's what's being transformed through it. God isn't doing something different or becoming something different toward us or looking at us differently or however else we want to think about it. God's perfect. He doesn't need to change. Right? Whereas we're being transformed. And so the problem is when you're doing another kind of ritual other than the rituals God laid out for us that are going to lead us deeper and more fully into our humanity, that's why he laid those rituals out for us and established them for us, is for Our salvation. If you're doing other rituals that you've come up with to try and do other things, those are also changing you and also changing your world, the world you live in every day. They're changing your community and your community, community's world and your community's life together. And they're changing it in ways that are drawing you away from the fullness of your humanity, that are making your world less human, less filled with God's grace and goodness. They're leading you in the wrong direction. So that's the key problem with it, right, is, is the destructive nature. And this was, this was the big temptation for Israel all through the Old Testament, right? It wasn't that they were going to reject Yahweh, the God of Israel. It's just that they were going to kind of put him in a corner, you know, keep doing the sacrifices to keep him happy, quote, unquote, and then also serve these other gods and do these other things and sort of COVID all their bases and just sort of mix it all together to try to get what they wanted out of the world and out of life. And that led them in very bad directions. And it wasn't just a question of, oh, God was mad at them, but it actually transformed their world in their communal life, right? When God comes to them and talks about the results of what they've done, he doesn't just say, well, I'm mad at you and you did bad things. He talks about the corruption within Israel and how that plays out, the oppression of the poor and the weak and the needy, right? The, the, the hatred between brothers, divisions and families, the division within the state. Every two kings in the Northern Kingdom, there was an assassination in a new dynasty. There's complete political turmoil. They were losing wars and losing territory. They were being conquered by other people, right? All these things had these effects because they were changing themselves and their world in this way by trying to mix and match and do these things. So that, that I think is, is just as real today as it was in the Old Testament."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8579.88,"end":8582.52,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Does that answer your question, Jordan?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8583.08,"end":8584.68,"speaker":"Jordan","text":"Yes. Fathers, thank you so much."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8585,"end":8608.55,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. Well, thank you very much for calling and thanks to all of our callers. Tonight. We planned for the possibility that we would only get like one or two calls, but, but boy, you guys really jammed it up. I'm really, really happy with all of you. So I think probably, I don't know, Father, we didn't talk about this, but I think maybe in the, at some point down the road we'll do this Again, what do you think?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8609.51,"end":8610.07,"speaker":"Fr Stephen De Young","text":"Maybe."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8610.31,"end":8610.83,"speaker":"Fr Andrew Stephen Damick","text":"Maybe."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8610.83,"end":8615.75,"speaker":"Fr Stephen De Young","text":"Okay, Maybe we'll set some kind of goal and use this as a reward."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8616.87,"end":8644.65,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Exactly. So. All right, well, since it was just kind of a free for all this evening, there's not really any. I don't have any closing kind of statement to make connected with all that, but it sure was a lot of fun. I will say this though, before we go into our credits, and that is, if for some weird reason you haven't yet bought a copy of Father Stephen's book, the Religion of the Apostles, what's wrong with you?"}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8645.85,"end":8649.69,"speaker":"Fr Stephen De Young","text":"Well, here's. Here's the thing. It's about to sell out."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8650.25,"end":8650.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8650.85,"end":8661.78,"speaker":"Fr Stephen De Young","text":"That's right. If that happens. So you need to order now because once they're gone, you're gonna have to wait and you're gonna have to contact Father Andrew directly to pre order the sale. Second printing."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8661.86,"end":8662.5,"speaker":"Fr Andrew Stephen Damick","text":"Nope."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8662.98,"end":8667.78,"speaker":"Fr Stephen De Young","text":"So order now before that happens because you don't want to have to deal with him on the pre orders."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8668.34,"end":8672.02,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Because you'll get nothing. I'll take your money, but you'll get nothing."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8672.58,"end":8672.9,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8672.9,"end":8699.85,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that is our show for tonight. Thank you everyone for listening. If you didn't get a chance to call in during this live broadcast, we still want to hear from you. You can send us an email at Lord ofspiritsancientfaith.com. you can message us at our Lord of Spirits podcast Facebook page. We do read everything. We listen to every message you send, but unfortunately we can't respond to everything or include everything. But we do try to save some of it for future episodes."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8700.57,"end":8706.89,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8707.37,"end":8718.5,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page and join our discussion group. Leave repeat reviews ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8719.3,"end":8727.3,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go on ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8727.62,"end":8731.22,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. God bless you. And Christ is risen."}
{"episode_id":"LOS - #019 - 2021-05-14 - Pantheon and Pandemonium - Live Q&A May 2021","start":8742.27,"end":8779.32,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,005 thousands of thousands, saying with a loud voice, worthy is the lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
