{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":0.24,"end":64.82,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":64.98,"end":75.94,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, giant killers, dragon slayers, angels of the apocalypse. You are listening to the Lord of Spirits podcast. My co host, Father Stephen DeYoung, the bane of the banshee, is with me, straight from Swamp City and here."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":76.02,"end":77.18,"speaker":"Fr Stephen De Young","text":"Oh, sorry, not, not that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":77.18,"end":95.83,"speaker":"Fr Andrew Stephen Damick","text":"In Lafayette, Louisiana. And I'm Father Edge Stephen Damick in Emmaus, Pennsylvania, perched precariously atop the arcane tower of podcasting, hovering tens, if not dozens or thousands of stories about a disused gateway to the underworld. We're not live this time."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":96.15,"end":97.11,"speaker":"Fr Stephen De Young","text":"Or are we?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":97.99,"end":101.15,"speaker":"Fr Andrew Stephen Damick","text":"You never know. I mean, how about what happened last."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":101.15,"end":107.27,"speaker":"Fr Stephen De Young","text":"Week when nobody wants to talk about that. They're sick of hearing about that big news story last week."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":107.27,"end":147.98,"speaker":"Fr Andrew Stephen Damick","text":"I know. Denmark, California invasion. I mean, who could have seen that coming? Yeah, Vikings on the loose once again. But we're not going to be taking any calls this time because this is probably a prerecorded episode. We'll get to those next time, God willing. So last time we talked about demonic possession, the action of demons generally in the world, and this time we're flipping the script, talking about the action of angels in the world. This is very retro 2020 era Lord of Spirits. So maybe this episode is going to be a little bit less creepy. So just will it, Father? I mean, I'm not saying you have to make promises."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":148.06,"end":149.98,"speaker":"Fr Stephen De Young","text":"All the angels are wheels with eyes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":150.54,"end":153.82,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is that creepy? I mean, a little startling maybe."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":154.38,"end":157.1,"speaker":"Fr Stephen De Young","text":"I mean a little bit. A little weird."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":158.14,"end":164.02,"speaker":"Fr Andrew Stephen Damick","text":"I know. It's funny that the quote unquote biblically accurate angels, they never do the wheel bit. It's always just lots and lots of."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":164.02,"end":171.72,"speaker":"Fr Stephen De Young","text":"Feathers and they Try sometimes there's, like. But it just. It looks like, you know, arm bands or something. Like, it doesn't really look like a wheel."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":172.2,"end":177.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. I'm disappointed in all the memesters. Come on, you can do better."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":177.6,"end":179.8,"speaker":"Fr Stephen De Young","text":"Not like a wheel in the sky that keeps on turning."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":181.48,"end":202.75,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for that. I was having a very 80s morning, actually. I saw someone did a trailer for Legends of Zelda as if it were like, every 80s T teen movie, which apparently someone made this, like, like 15 years ago. And I came across it again. It was very, very amusing. So look it up."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":202.75,"end":205.83,"speaker":"Fr Stephen De Young","text":"You're just, like, 15 years behind on the Internet is what you're saying."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":208.47,"end":211.99,"speaker":"Fr Andrew Stephen Damick","text":"I did live on Guam for five years, and that set me 15 years behind."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":212.79,"end":216.63,"speaker":"Fr Stephen De Young","text":"Did you see that Chocolate Rain video? Oh, did you see that one?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":216.71,"end":218.03,"speaker":"Fr Andrew Stephen Damick","text":"I have seen that one. Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":218.03,"end":219.92,"speaker":"Fr Stephen De Young","text":"Okay. Yep. Yep."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":220.8,"end":223.36,"speaker":"Fr Andrew Stephen Damick","text":"So angels. What's."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":223.92,"end":249.44,"speaker":"Fr Stephen De Young","text":"What's up with angels? Yeah. What's their deal? Yeah. So, yeah, we are going to be talking about angels and related things. And, yes, like last time, some of this is going to be pulling together threads from previous episodes. And by previous episodes, I mean very early episodes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":249.89,"end":250.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":251.33,"end":304.44,"speaker":"Fr Stephen De Young","text":"Episodes fraught with all manner of technical difficulties. So maybe this will help. But. And so we need to start by again, doing a little bit of. A little bit of review, a little bit of some of that material, which we're not going to belabor, but we do need to sort of touch on it. Refresher. Right. So the first thing, of course, is classically, you know, if there's one orthodox thing about angels that an orthodox person is aware of, it's the idea of the ranks of angels. Saint Dionysus, the Areopagite. Right. Those nine ranks being in order. Seraphim, Cherubim, thrones, dominions, virtues, powers, principalities, Archangels, and angels."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":305.51,"end":309.59,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Did you rattle that off from memory? Probably not, no."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":309.75,"end":312.87,"speaker":"Fr Stephen De Young","text":"I can't do Sleepy, Happy, Grumpy, Dopey, Sneezy, Bashful, and Doc."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":313.11,"end":318.55,"speaker":"Fr Andrew Stephen Damick","text":"Oh, nice. My wife used to have all of that. Twas the Night Before Christmas memorized, actually."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":319.51,"end":322.15,"speaker":"Fr Stephen De Young","text":"Which I probably do accidentally."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":322.47,"end":322.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":322.87,"end":329.75,"speaker":"Fr Stephen De Young","text":"But I'm not gonna try. I'm not gonna check. We memorize Luke 2 every year for her. Yes, that was the."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":330.15,"end":337.41,"speaker":"Fr Andrew Stephen Damick","text":"Now that I said this podcast people are gonna approach my wife and be like, okay, tell me that. You know they're gonna make her do that. I'm sorry."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":337.65,"end":339.41,"speaker":"Fr Stephen De Young","text":"When you get home, just say, you're welcome."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":339.57,"end":342.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. She'll be like, what?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":343.49,"end":348.65,"speaker":"Fr Stephen De Young","text":"This is definitely the day to give her such a gift. But anyway, not to let on when we're recording."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":348.65,"end":355.33,"speaker":"Fr Andrew Stephen Damick","text":"But actually she doesn't care about this day. Like, she literally actively opposes it."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":356.37,"end":357.57,"speaker":"Fr Stephen De Young","text":"It's a saint's day."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":357.73,"end":362.64,"speaker":"Fr Andrew Stephen Damick","text":"It is a saint's day. Saint Auxentius. Yes. Because everyone knows."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":362.96,"end":365.12,"speaker":"Fr Stephen De Young","text":"What if she got against Saint Auxentius?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":365.28,"end":366.56,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":367.92,"end":374.64,"speaker":"Fr Stephen De Young","text":"These people who war against the saints. I don't get it. Don't understand."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":375.12,"end":380.08,"speaker":"Fr Andrew Stephen Damick","text":"Deep cut there, Father Stephen. Deep cut, yeah. So there's those nine ranks."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":380.24,"end":390.96,"speaker":"Fr Stephen De Young","text":"Yes. And so now. But again, we have to. There are ways of understanding this that are less helpful. So one way of understanding this is that these are sort of species of angel."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":391.5,"end":398.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because especially because they're depicted differently. There's this idea of like, oh, it's this kind or it's that kind. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":399.26,"end":406.14,"speaker":"Fr Stephen De Young","text":"And so angels don't have species. There's a very good reason why they don't have species. They don't reproduce."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":407.02,"end":412.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. That's kind of the definition of species is a group that can reproduce with each other."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":413.1,"end":430.64,"speaker":"Fr Stephen De Young","text":"Right. So species kind of doesn't work. In fact, since they don't reproduce and they don't have material bodies, technically speaking, every angel is sui generis. Right. It's its own genera, meaning it's unique."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":431.36,"end":431.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":432.08,"end":544.14,"speaker":"Fr Stephen De Young","text":"Each angelic being is unique. So then what are these ranks? Right. It's also not ranks in the sense that, like, well, you start out as an angel, you get your wings, now you're an angel, and then you kind of work your way up. Right. You put in 15 years and they make you an archangel. And then, you know, you keep working hard and, you know, maybe you could be a throne someday, kid. No, that's not right. How it works. This is. These are essentially roles or jobs that they have that these beings are entrusted with. That's what puts them in a particular rank. And then related to that job description, they are nearer or farther from God. What that means is not literal space, obviously, but it refers. It's a reference to the amount in which they participate in the glory of God. So there is a hierarchy. There are levels to this. There are levels to which they participate in God's grace, allowing them to perform the job, the tasks that are assigned to them by God. And we talked last time about the fact that God is doing this out of love. But we'll talk more about that later today. But this is, and this is obviously Saint Dionysius, if you understand how the celestial hierarchies, his text works, it works. It functions along with alongside, parallel to his ecclesiastical hierarchies. He's making a deliberate comparison."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":544.38,"end":544.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":545.9,"end":555.24,"speaker":"Fr Stephen De Young","text":"And a bishop is not a different species than a layperson. A bishop and a layperson are both humans."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":555.64,"end":556.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":557.72,"end":573.4,"speaker":"Fr Stephen De Young","text":"They just have a different role and a different task that God has called them to carry out. Right. And just like with the angelic beings, the idea is they are to be faithful in carrying out that role and those tasks."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":573.48,"end":580.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there is a hierarchy. Like it's, you know, some are first, some are second, some are. That's just the way that it is."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":580.77,"end":582.53,"speaker":"Fr Stephen De Young","text":"It doesn't mean my bishop is the boss of me."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":582.85,"end":586.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It doesn't mean your bishop is necessarily a better person than you now."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":586.41,"end":589.57,"speaker":"Fr Stephen De Young","text":"Probably, but yes, in my case. Yes. But yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":591.01,"end":592.57,"speaker":"Fr Andrew Stephen Damick","text":"But, you know, it, it's."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":592.57,"end":595.89,"speaker":"Fr Stephen De Young","text":"Or holier sub deacons who are better people than me. I mean, this is not."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":595.89,"end":603.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So it's, it's not about. It's not about who's considered to be, you know, more holy or anything like that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":604.79,"end":670.79,"speaker":"Fr Stephen De Young","text":"You're right. The other issue related to this that sometimes causes confusion is so there is this second lowest quote unquote, lowest rank archangels. Right. And then there are the seven archangels. And sometimes people get confused about this. So they assume that those seven archangels. We're not going to talk about them a lot tonight. We've talked. But past episodes we have Saints Michael and Gabriel, Raphael, Uriel and then others, depending on which list you're looking at for which father. But those seven are in this second lowest rank. Some folks assume, or some folks assume that that second lowest rank only has seven members. Even though, for example, the liturgy, at one point in one of the prayers, we talk about there being thousands of archangels and ten thousands of angels."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":671.91,"end":672.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":672.47,"end":721.21,"speaker":"Fr Stephen De Young","text":"You're like, well, wait a minute, I thought there were seven archangels. Right. So we have to remember how ark or arch works as a title. It just means first, literally. Or chief. Right. Ranking. So, like there are archbishops and arch priests. Right. And so that could be used to indicate this rank of which there are thousands of members. But it could also be used, as it is with the seven to say these are the seven chief angels out of all the angels of all the ranks. And if you pay close attention to the church's tradition, this is borne out. For example, the synaxaria of the feasts of St. Michael say that he's a seraphim."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":722.49,"end":729.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Well, and, you know, there's the reference, of course, in Revelation to these seven spirits who stand before the throne of God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":730.57,"end":736.01,"speaker":"Fr Stephen De Young","text":"Right. Which is part of how Raphael introduces Himself in Tobit that we talked about last time."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":736.01,"end":737.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":739.93,"end":756.49,"speaker":"Fr Stephen De Young","text":"Yeah. So the seven archangels don't necessarily belong to the rank archangels, and the rank of archangels includes a lot more than just seven. Those. Than just seven. So those. That term archangel is being used in different ways."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":756.89,"end":757.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":760.81,"end":871.91,"speaker":"Fr Stephen De Young","text":"So we understand. And it's pretty clear when we read the Old Testament. Right. We see lots of angels doing things. Right. And we kind of see this sort of authority structure. God sends angels to do things. Angels are sort of intermediaries for various things. Second Temple tradition, for example, there's sort of an angelic intermediary or angelic intermediaries in terms of the giving of the Torah on Mount Sinai, etc. Angels get sent with messages. Archangels get sent with messages. St Raphael and Tobit, we're not going to rehearse every example of angels of the Old Testament now, but that God sort of administers things and sends his messengers, administers the creation through these angelic beings. Often, however, when we get to the New Testament, we have this particular mode of thinking that comes from a particular Protestant tradition that we've all kind of inherited in the United States where we act as if all of that kind of drops out. Right. Because now we don't get a lot of talk about in the common sort of Christian world parlance in the United States. I'm talking about now, you don't hear anyone saying, I prayed to be healed and God sent an angel to heal me."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":873.09,"end":875.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":875.57,"end":877.17,"speaker":"Fr Stephen De Young","text":"Like that's just not a way of speaking."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":878.13,"end":878.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":878.69,"end":888.21,"speaker":"Fr Stephen De Young","text":"But used to be, commonly used to be. But it's not. Right. Everything is sort of God directly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":889.57,"end":894.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This kind of flattened hierarchy that just has God above and then everybody else."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":894.77,"end":904.94,"speaker":"Fr Stephen De Young","text":"Yeah. And so as if. Right. You know. Well, yes, these angels had all these jobs and had all these tasks and did all these things before Christ."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":905.42,"end":906.94,"speaker":"Fr Andrew Stephen Damick","text":"There's a big reduction in force."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":907.42,"end":992.42,"speaker":"Fr Stephen De Young","text":"Yes. There were just massive layoffs to the heavenly deep state at Christ's ascension. Right. And now I guess they're just out of work. But of course, there's no reason to believe that. Right. Rather, what we see happening in Christ's incarnation and ascension, and look at the hymns of the feasts of the ascension. And now that what they say in terms of angels, what has changed is that through the incarnation, through Christ becoming man, and then through him taking our humanity and elevating it to the throne of God, humanity has sort of ascended that hierarchy, ascended that authority structure. Hebrews gets into this a lot. So that now there's depending on whether you want to count the nine ranks down, with seraphim being rank one, or you want to count the other way with angels being rank one, there's either a new rank one or 10, or rank zero or rank zero, zero through nine, if you want to go that way. That is glorified humanity."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":994.82,"end":995.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":995.78,"end":1006.1,"speaker":"Fr Stephen De Young","text":"Saints and glory. And also for this, see Hymns to the Theotokos. Right. More honorable than the cherubim, more glorious than the seraphim."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1006.5,"end":1012.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. Those are the highest ranks of angels. So if she's above that, that's a higher rank."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1012.42,"end":1075.48,"speaker":"Fr Stephen De Young","text":"Right. And a word here about the Theotokos, because I know we have non Orthodox listeners and non Roman Catholic listeners who probably involuntarily, even if they don't want to get a little bit of heebie jeebies when we start talking about the Theotokos. Okay. But on this point and on all these points, Right. You have to remember that for the Orthodox Church, the Theotokos is the greatest human saint. Right. And so when we're talking about human saints, we're talking about redeemed humanity, glorified humanity. We use her as the primary example because she is the prime example of a glorified human, of a human who has dedicated their life to God. Now, some of you may be thinking, why don't we use Jesus? Because Jesus is God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1075.96,"end":1077.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He didn't have to repent."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1078.2,"end":1101.58,"speaker":"Fr Stephen De Young","text":"And I'm not. But I am a human like the Theotokos. Right. But the things we say about the Theotokos in this regard are true of glorified humanity in general in many cases. Right. She's just being used as an exemplar."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1101.98,"end":1107.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The difference between her and other saints is really a difference of degree."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1108.22,"end":1110.14,"speaker":"Fr Stephen De Young","text":"Not in quantitative, not qualitative."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1110.5,"end":1117.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In this particular case, obviously there are certain unique things about her. She gives birth to God himself, which."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1117.78,"end":1118.66,"speaker":"Fr Stephen De Young","text":"No one else does."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1119.22,"end":1119.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1120.58,"end":1120.94,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1120.94,"end":1121.22,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1121.22,"end":1128.9,"speaker":"Fr Stephen De Young","text":"But there are other things we say about her that give people the heebie jeebies. Like that she didn't actually commit sins that we also say about, like St. John the Forerunner."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1129.14,"end":1131.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1131.7,"end":1234.77,"speaker":"Fr Stephen De Young","text":"We were saying about St. John the Forerunner. People might give you a weird look, but they don't get the heebie jeebies the same way. And so if you're one of those folks, you should think about that for a minute. And what is it that's really giving you the heebie jeebies about the Theotokos? Is it just you've had some kind of homophobia hammered into you from childhood? Right. I say this as a Dutch person. That happens to people sometimes. So, yeah, so she's the exemplar. But she is an example of humanity has been glorified in Christ and therefore has ascended this angelic hierarchy. And what we mean by that, again, is not that now she's like part of the Trinity or a goddess or something like this in those kind of senses. What we mean by that is, again, redeemed humanity, glorified humanity is like another rank meaning. Has tasks. Right. Has things that they do on behalf of God. Right. Things that God has them do. Right. And this is something that I think everybody of any even vaguely Christian stripe agrees on in terms of the world to come. When we're talking about the life of the world to come, we're talking about the resurrection, we're talking about eternal life. Oh, yeah, we're going to have all these jobs, we're going to have things. We're not just going to be sitting around doing things. Unless you're a stare at the orb type."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1236.77,"end":1238.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's explicit in the Scriptures."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1238.93,"end":1239.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1239.33,"end":1246.77,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, the age to come is subject. It's not to angels that the age to come is subject, as St. Paul says. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1247.98,"end":1263.34,"speaker":"Fr Stephen De Young","text":"But it seems like for a large segment of folks, especially American evangelicals, they think the glorified saints just sort of twiddle their thumbs until then. Right. Like they're not doing anything. They don't."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1263.34,"end":1263.5,"speaker":"Fr Andrew Stephen Damick","text":"They."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1263.5,"end":1276.3,"speaker":"Fr Stephen De Young","text":"They reject soul sleep. So they're asleep, they're conscious, they're in heaven or with Christ or, you know, however it wants to be phrased. But they're not doing anything."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1276.62,"end":1277.5,"speaker":"Fr Andrew Stephen Damick","text":"Playing harps."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1278.38,"end":1289.34,"speaker":"Fr Stephen De Young","text":"Yeah, well, on clouds. And see, you can see how this is part and parcel of the same problem we mentioned earlier, because the angels also aren't really doing anything in the New Testament."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1289.5,"end":1290.86,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1291.02,"end":1325.59,"speaker":"Fr Stephen De Young","text":"For a lot of those folks. Right. There's just sort of these. They're just enjoying life, I guess, or enjoying being angels, I don't know, singing. I don't know what they're doing all the time, but. Right. But this sense of having a role in a task sort of gets bracketed off for this New Testament era and some kind of weird celestial dispensationalism. Right, that. Oh, yeah. In the Old Testament. Yes. And in the world to come. Yes. But not now. Right. Right now it's just God doing everything directly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1326.08,"end":1326.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1328.4,"end":1384.79,"speaker":"Fr Stephen De Young","text":"But this idea, this understanding. Right. When you, when you take the understanding of angels and their roles. Right. That's clearly in the Old Testament scriptures. When you take the idea we've talked about before on the show about replacing fallen angelic beings, about glorified humans replacing full angelic beings. And then you add in the New Testament teaching of the incarnation of Christ that transcends even replacing angels to man was made a little lower than the angels, but exalted with glory and honor, first of all in Christ, and then Christ gives that benefit to us. Right. That's where the whole concept of saints comes from."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1385.43,"end":1385.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1386.63,"end":1388.71,"speaker":"Fr Stephen De Young","text":"In the church. Yeah. From the early days."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1389.35,"end":1391.19,"speaker":"Fr Andrew Stephen Damick","text":"Add on, you know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1391.75,"end":1403.35,"speaker":"Fr Stephen De Young","text":"Yeah. It's part and parcel of. Yes. They assume the kind of duties and do the kind of things that we see angels doing in the Old Testament."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1403.83,"end":1437.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you just kind of list it off, like delivering messages, protecting people, hearing prayers, passing them on to God, you know. Yeah. And especially if you, like, include all of church history, you see them doing things, you know, like being present at, like, alterations of the landscape, you know, stuff like this. Right. There's, you know, all the kind of stuff that you see angels doing in the Old Testament human saints are doing under the new covenant. Right, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1437.41,"end":1442.17,"speaker":"Fr Stephen De Young","text":"And that will then continue in the life of the world to come. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1442.17,"end":1449.85,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is why Jesus describes sons of the Resurrection as equal to the angels in Luke 20:36."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1451.29,"end":1462.01,"speaker":"Fr Stephen De Young","text":"Right. And the idea of venerating them, meaning showing them honor, is just the opposite of the biblical warnings we get in the New Testament against slandering angels."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1465.04,"end":1465.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1465.28,"end":1477.52,"speaker":"Fr Stephen De Young","text":"Ever wonder what those are about? You ever just accidentally slander an angel? I don't get that a lot in confession. Yeah. I was talking trash on my guardian angel."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1478.88,"end":1486,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, don't do that. Your guardian angel might be. Might switch sides on you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1486.16,"end":1528.31,"speaker":"Fr Stephen De Young","text":"That's a big no. Yeah, no for me, dog. So what that also means is, and we talked last time about, or we reviewed sort of last time about what a spirit is. Right. Is that as being sort of a level of consciousness above human consciousness that can sort of animate and motivate human consciences. Right. On a collective level. Well, that means when someone becomes a saint, they become a spirit in that sense."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1530.47,"end":1531.99,"speaker":"Fr Andrew Stephen Damick","text":"See, our spirit episodes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1532.47,"end":1555.24,"speaker":"Fr Stephen De Young","text":"Yeah. They exist in the noetic world, in the world of thoughts, the world of the mind, and they are able to. Then both angels and glorified humans are able to then function in that way. Right. And what is that way? What is the goal? Well, it's the opposite of what the demons do."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1555.72,"end":1563.88,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's influencing and directing and guiding and shepherding, but towards God rather than towards destruction."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1564.36,"end":1591.06,"speaker":"Fr Stephen De Young","text":"Right. And so the demons have an end in themselves. Just destroying people. Right. They have no greater purpose. They're not trying to get you to go where. Worship Satan. Right, Right. They don't care. They'll destroy you however they can. Right. And they could do that through sort of casual, boring, depressive atheism. Right. And if that's the way to destroy you, that's how they'll do it. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1591.06,"end":1591.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Whatever it takes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1592.02,"end":1640.07,"speaker":"Fr Stephen De Young","text":"They don't care. Right. But angels have this very specific. And the saints have this very specific purpose of guiding people toward God. And Saint Dionysius and others say this was the purpose of the angels who God put over the nations, was to guide them back to God. Right. After God had to distance himself from them because of their sin at Babel. So this idea of guiding and shepherding is what they do. And again, this is what's going on with. With the Theotokos and why she's using it as an example. She always directs and leads people to her son."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1640.79,"end":1643.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In fact, in many icons, she's literally pointing at him."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1644.31,"end":1647.03,"speaker":"Fr Stephen De Young","text":"Yes, yeah. And she's always depicted with him."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1648.55,"end":1650.27,"speaker":"Fr Andrew Stephen Damick","text":"Not always. Always. Well, not always."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1650.27,"end":1652.63,"speaker":"Fr Stephen De Young","text":"Always. She's supposed to be always depicted."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1653.19,"end":1654.23,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, there is a."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1654.31,"end":1657.03,"speaker":"Fr Stephen De Young","text":"That is a rule, but like every other rule of the Orthodox Church."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1657.27,"end":1661.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but there is a tradition of icons of her at the moment of the Annunciation in particular."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1662.29,"end":1668.93,"speaker":"Fr Stephen De Young","text":"Well, but even there. There's the beam. Right. Where Jesus sometimes. So he's. He's in the picture."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1669.01,"end":1677.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. But. But yes, overall true. I just had to get in my chance to. I'm actually. You, you know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1677.49,"end":1681.89,"speaker":"Fr Stephen De Young","text":"No, no, you better shot. See if you're gonna. Actually, you should have brought up the icons of her birth."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1682.69,"end":1688.56,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there's that too. Or stuff like her as. As the abbess of Mount Athos."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1688.56,"end":1688.96,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1688.96,"end":1691.52,"speaker":"Fr Andrew Stephen Damick","text":"This kind of thing. Right. You know, holy protection."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1691.68,"end":1694.64,"speaker":"Fr Stephen De Young","text":"Like every rule of the Orthodox Church, there's exceptions. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1694.72,"end":1695.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Yep."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1695.68,"end":1729.8,"speaker":"Fr Stephen De Young","text":"But when you're just depicting her. Right. So you could have a depiction of St. John the Forerunner or St. Nicholas, just an icon of them that doesn't have Jesus in it. Yeah, but you don't have an icon of the. You're not supposed to have an icon of the Theotokos like that without Jesus in it. And of course, as soon as you refer. One of the reasons why we refer to her all the time as the Theotokos is that keeps Christ in the picture."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1730.28,"end":1732.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Birth giver to God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1732.6,"end":1781.36,"speaker":"Fr Stephen De Young","text":"Yeah, but so that's. That's again, she's pointing Christ, but St. John the Forerunner. Right. A lot of icons Especially icons that are going to go next to an icon of Christ or where Christ is in the icon, he's bowing toward him, gesturing toward him, pointing at him. Right. And this is the case of all of the saints. Right. They're pointing you, leading you, directing you to Christ. So one could ask the question, why doesn't God just come to humanity directly? Why the administrative state?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1781.52,"end":1782.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Wouldn't that be more efficient?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1786.48,"end":1802.12,"speaker":"Fr Stephen De Young","text":"Doesn't God need to cut the waste? That whole bureaucratic layoffs again at the Ascension? Yeah. So there's a couple things we have to say about that. Number one, sometimes God does."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1803.08,"end":1803.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1803.88,"end":1805.96,"speaker":"Fr Stephen De Young","text":"So see, Abraham, Isaac and Jacob."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1806.04,"end":1808.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes. He does talk directly to people sometimes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1808.92,"end":1812.84,"speaker":"Fr Stephen De Young","text":"He appears directly. He shows that he eats with them. Right. He wrestles with them. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1813,"end":1815.44,"speaker":"Fr Andrew Stephen Damick","text":"I'm more Adam and Eve. I mean, for crying out loud. Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1815.44,"end":1857.3,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, very directly. So God does that sometimes. And of course, see Christ in the New Testament. Right. But he doesn't always do that. Right. And there's something important to say, as we've said, as we just alluded to, with the Tower of Babel and with the flood, the presence of God, the direct presence of God is highly dangerous to sinful humanity. Right. And so there's that. That sort of approach can end up, you know, causing a flood and wiping out humanity."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1858.82,"end":1860.1,"speaker":"Fr Andrew Stephen Damick","text":"And no one wants that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1860.26,"end":1871.94,"speaker":"Fr Stephen De Young","text":"No one wants that. But there's something more important than that. Right. Because it's clear from him appearing to Abraham and Isaac and especially Jacob, who are not exactly sinless, that God can do that without killing someone if he wants to."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1872.53,"end":1873.37,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1873.37,"end":1890.05,"speaker":"Fr Stephen De Young","text":"Right. So it's not that it's beyond God, but the more important thing that we alluded to a little bit ago is that is the whole reason why God create, created anything. And that's love."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1891.65,"end":1894.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is not exactly efficient."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1894.93,"end":1917.61,"speaker":"Fr Stephen De Young","text":"Why is there anything rather than nothing? Right. Because of God's love. And so he created beings like us and like angels and other critters. Right. To share his love and his life with. Out of his love. And so a big part of love is sharing. We've now turned into Mr. Rogers."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1920.73,"end":1921.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1921.09,"end":1926.09,"speaker":"Fr Stephen De Young","text":"And also, like I've said it before, and I'll say it again, Fred Rogers is the one saint produced by Presbyterianism."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1926.71,"end":1927.11,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1927.35,"end":1928.23,"speaker":"Fr Stephen De Young","text":"They got one."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1929.75,"end":1930.23,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1930.23,"end":1931.67,"speaker":"Fr Stephen De Young","text":"Only one. But they got one."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1932.23,"end":1938.95,"speaker":"Fr Andrew Stephen Damick","text":"I do hope that they will dedicate a church to him or something, or at least some kind of building. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1938.95,"end":1941.07,"speaker":"Fr Stephen De Young","text":"I mean, the other thing is they ought to have something dedicated to Him."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1941.07,"end":1990.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. A Pittsburgh shrine. You know, like a lot of this particular critique, like, you know, is based on this idea of efficiency. Like God. Can't God just directly go, you know, whatever. Why through saints, why through angels? But like efficiency, while a significant component of day to day human life and, you know, communal life and government, whatever, whatever, whatever is completely irrelevant to an omnipotent being. Like, in what sense does efficiency matter when there's no limits? Right? Just think about it for a second, boys and girls. It doesn't matter if you're God. It doesn't matter."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1992.95,"end":1994.23,"speaker":"Fr Stephen De Young","text":"Have you seen the Sound of Music?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1995.11,"end":1996.83,"speaker":"Fr Andrew Stephen Damick","text":"I have seen the Sound of Music."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":1996.83,"end":2022.77,"speaker":"Fr Stephen De Young","text":"Right. Are you going to try and run your family with ruthless efficiency? Have we learned nothing from Rogers at Hammerstein? You gotta open up to love if you want to escape the Nazis. But anyway, yes, but, yeah, right, and so, yes, God doesn't need angels, he doesn't need us. He doesn't need me. No, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2022.85,"end":2024.69,"speaker":"Fr Andrew Stephen Damick","text":"He can do anything he likes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2025.09,"end":2093.65,"speaker":"Fr Stephen De Young","text":"He doesn't need me to celebrate liturgy in order to work in the lives of my parishioners. No, no, he doesn't. He can work directly in their lives if he wants to. Yeah, right. But he's given me that privilege out of love, right? And him giving me that privilege out of love, that way of him using that way of working in the lives through the Eucharist, through the sacraments of my parishioners also has created this community of parishioners that's a community of love, people who love each other and God help them, even love me for some reason. Right? That's all created by the way that God does this. That's what we're talking about when we say that God is doing this out of love, right? And for the purpose of love. And so, yes, he doesn't need to send the Archangel Gabriel to the Theotokos. Yeah, he could have just told the Theotokos directly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2094.21,"end":2094.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2098.61,"end":2139.49,"speaker":"Fr Stephen De Young","text":"But he gives this mission to the Archangel Gabriel, who. Read our hypnography, right? Read the biblical text. This archangel, this highest ranking angelic being, is like honored and awed by this task he's been given, right? That's a gift that God gave him. Right. And so, I mean, that's really what I meant by try running your family, try operating, functioning in your marriage based on efficiency, right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2140.85,"end":2144.29,"speaker":"Fr Andrew Stephen Damick","text":"Look, I told you last month that I love you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2144.74,"end":2145.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2145.02,"end":2146.02,"speaker":"Fr Andrew Stephen Damick","text":"Hasn't changed."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2146.42,"end":2164.74,"speaker":"Fr Stephen De Young","text":"No time for this discussion, honey. I have work to do. Yeah, right, like that dog don't hunt, Right. Or try racing your kids based on ruthless efficiency. Watch what happens. I can tell you, I can warn you in advance. They'll all go crazy the second they get out from under your thumb."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2166.18,"end":2166.82,"speaker":"Fr Andrew Stephen Damick","text":"If not."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2169.22,"end":2206.52,"speaker":"Fr Stephen De Young","text":"That'S so. Yeah. And so that's not how God operates. Right. That's not how God operates. That's not really how we want him to operate. Do you want your relationship to God to be marked by ruthless efficiency? Created You. Yeah. You are not necessary to the equation. So maybe not. Right. Yeah. Now, again, I want to make very clear, we're not saying that there's something God can't do. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2206.52,"end":2210.28,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he could also use fear and surprise in addition to ruthless efficiency."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2210.28,"end":2217.64,"speaker":"Fr Stephen De Young","text":"Yes. And a fanatical devotion to the Pope, which I do not have, by the way."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2219.72,"end":2220.6,"speaker":"Fr Andrew Stephen Damick","text":"I was going to ask."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2221.88,"end":2224.04,"speaker":"Fr Stephen De Young","text":"Fanatical or even non fanatical."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2224.44,"end":2225.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2225.73,"end":2241.41,"speaker":"Fr Stephen De Young","text":"But. But yeah, we're not, we're not saying that there's something God can't do. As we said before on the show, anytime you see any theological principle or theological point being made that's premised on there being something God can't do."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2243.57,"end":2243.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2244.37,"end":2259.55,"speaker":"Fr Stephen De Young","text":"You know, you should reject it. You know, this is nonsense saying God can't do blank. Right. Even if they say something to you like God can't sin."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2261.71,"end":2262.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2262.19,"end":2264.59,"speaker":"Fr Stephen De Young","text":"That's time to interrogate what they mean by sin."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2264.75,"end":2266.11,"speaker":"Fr Andrew Stephen Damick","text":"Mean. But yeah, exactly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2267.47,"end":2273.39,"speaker":"Fr Stephen De Young","text":"And what's going on there? Right. Something that seems like, whoa, okay, that sounds right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2273.47,"end":2273.87,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2279.32,"end":2360.58,"speaker":"Fr Stephen De Young","text":"Nonetheless. Right. God can do anything he wants. Nonetheless. What we see, what's revealed to us in the world, what we know of God is His working in the world, his operations, his activities. And we observe that God works in certain ways based on love, based on sharing, based on. Right. These are ways that we observe him working. Right. And that's how we know who he is. And so we don't base our discourse on God on what we think he can and can't do. We base our discourse on God on how we see him working and what we see him doing. And what we see him doing in the Scriptures. Right. All through the Scriptures is operating through agents working through means in the world. The way he usually expresses his love for people is not like directly beaming it into their soul or their heart. Honestly, it isn't. It's through other people."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2361.46,"end":2361.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2363.46,"end":2407.17,"speaker":"Fr Stephen De Young","text":"That's the most common way God shows His love. And this is all of these things. All of these things. This is why the Book of Acts is so important. The Book of Acts gets treated like it's just sort of an epilogue to the gospels. Right. And St. Luke's gospel in particular. But the Book of Acts is Very important for a bunch of reasons. But some of those reasons are what we're getting at right here. So, for example, we see angels coming and doing things in the Book of Acts just like they did in the Old Testament. That seems to imply that there's not a change in the role of angels after Christ's ascension."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2407.89,"end":2408.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2408.77,"end":2453.34,"speaker":"Fr Stephen De Young","text":"If they're still doing the same things, like letting St. Peter out of prison. Right. So there's not. We see there's not a big shift there. Also importantly. Right. If we're, if someone were motivated to make the point that, like, well, okay, no, now there's Jesus. Right. So we have these Old Testament figures. Yeah, those old figures. Testament figures were important because they're sort of types of Christ. They sort of point us to who Jesus will be. But now we have Jesus. So, like, none of that's important anymore. We just focus on Jesus. Except the Book of Acts is in the New Testament and is mostly about St. Paul."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2453.9,"end":2454.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2454.22,"end":2457.02,"speaker":"Fr Stephen De Young","text":"I mean, and also St. Philip, St. Stephen, St. Peter."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2457.18,"end":2471.59,"speaker":"Fr Andrew Stephen Damick","text":"And here's the fun bit. At the very beginning, St. Luke writes, you know, in, in my, in the previous, in my former treatise, O Theophilus. I love that translation. But, you know, referring to his gospel."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2472.39,"end":2475.19,"speaker":"Fr Stephen De Young","text":"He says, volume one in our last episode."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2475.27,"end":2496.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Volume one. This is, you know, Acts as volume two. You know, I, I wrote about all the things that Jesus began to do and to preach, meaning that the Book of Acts, which is basically, frankly, the earliest collection of saints lives, Christian saints lives, but mostly St. Paul, is Jesus continuing to do and to preach. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2496.45,"end":2504.73,"speaker":"Fr Stephen De Young","text":"But he's doing that through human agents, through his disciples and apostles. His apostles being the ones he sent out to do these things."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2505.05,"end":2506.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2506.49,"end":2527.3,"speaker":"Fr Stephen De Young","text":"And assign these tasks. So even in the New Testament. Right. God is administering his creation, working in his creation through means, which includes glorified human saints, includes the angels, as it always has, and it includes humans here on earth."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2528.02,"end":2536.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So. All right. Well, that's our first half for this episode. We're talking about angels. And we'll be right back."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2536.74,"end":2628.63,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality. But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world. In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by De Young's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology. By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancient faith.com Again, that is store.ancient faith.com. we're back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-8523-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2630.95,"end":2639.11,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're back. It's the second half of this pre recorded episode of the Lord of Spirits podcast. So if you call, we will not answer. Someone else."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2639.11,"end":2640.71,"speaker":"Fr Stephen De Young","text":"Someone might, though, so see what happens."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2640.71,"end":2644.79,"speaker":"Fr Andrew Stephen Damick","text":"Probably not. Don't bug Trudy. We gave her the night off."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2645.91,"end":2647.87,"speaker":"Fr Stephen De Young","text":"Well, then she won't answer the phone, will she?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2647.87,"end":2648.31,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2648.31,"end":2649.23,"speaker":"Fr Stephen De Young","text":"Won't be there. Exactly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2649.23,"end":2652.15,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Someone else could be working late. Like, oh, I wonder who's calling?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2652.15,"end":2656.69,"speaker":"Fr Stephen De Young","text":"That's what I'm saying. Maybe they'd. Some telephonic company. It could be."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2656.77,"end":2657.25,"speaker":"Fr Andrew Stephen Damick","text":"Could be."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2657.25,"end":2658.53,"speaker":"Fr Stephen De Young","text":"They're burning the midnight oil."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2658.77,"end":2691.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're talking about angels. Last time we talked about demons and their activity in the world, and this time we're talking about angels and their activity in the world. And we just did a kind of review, actually, of a lot of stuff that we've discussed in previous episodes. Who are angels? What are angels? What do they do in the scriptures? And then also the fact that God works through agents, you know, that are not always directly. And that's okay because he doesn't need to be efficient because he's God and he loves us and wants to share. How about that?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2692.75,"end":2694.55,"speaker":"Fr Stephen De Young","text":"Let's go watch the Sound of Music. Seriously."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2694.55,"end":2706.36,"speaker":"Fr Andrew Stephen Damick","text":"I know. I kind of wonder sometimes, like, what people's view of God is that they think that efficiency is this really important thing. Like, how do they understand who God is? Is he God?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2707.64,"end":2710.6,"speaker":"Fr Stephen De Young","text":"Well, he's definitely a capitalist. I mean, we know that for sure."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2715,"end":2715.72,"speaker":"Fr Andrew Stephen Damick","text":"He's definitely a."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2715.72,"end":2718.28,"speaker":"Fr Stephen De Young","text":"Whenever he blesses a preacher, it's by giving them a lot of money."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2718.68,"end":2759.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, clearly. Yeah. Like he's sitting on top of some big machine that works in a particular way that he set up. I feel like that's the notion of God that says that he has to be efficient, that saints and angels are not really, you know, do you have to go through them? You know, we'll talk more about that, of course, as we go. So. All right, so let's. Let's talk a little bit more about angels as they actually. As we experience them, as they're actually acting in the world in a more experiential level and not just the sort of theoretical level we've been talking about."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2759.22,"end":2799.46,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, yeah, as we said, angels have jobs. Right. They have assignments. They have roles that they play is actually the better term. And because job, we don't want to get too little. Again, God not a capitalist per se. We don't want to get too literal about the jobs thing. There's no promotions, as we talked about. Right. This is. But the tasks and assignments of angels can change. Right. If you. Right. So the archangel Gabriel, when he appears in Scripture, is doing different things."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2800.42,"end":2800.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2801.3,"end":2861.43,"speaker":"Fr Stephen De Young","text":"So like, what he's doing in Daniel, for example, and what he's doing when he comes to the Theotokos are two different missions, tasks, roles, jobs. Right. So there are different things. Right. And of course, those could be taken away because as we talked about under the heading of demons, there are angels who fell. There are other reasons why God takes things away. The angels who were placed over the nations didn't fulfill their task. And as we've talked about before the show, see Psalm 82, which is the judgment they receive for that. And then see Matthew, the end of Matthew 28, and Christ saying, right before his ascension, all authority in heaven and on earth has been given to me. Therefore, go make disciples of all nations."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2861.59,"end":2866.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, could it be said that when they walked off the job that they. That they ghosted?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2869.3,"end":2869.7,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2870.02,"end":2870.66,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2870.66,"end":2872.34,"speaker":"Fr Stephen De Young","text":"Because they didn't actually walk off the job."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2872.66,"end":2873.14,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2873.54,"end":2875.06,"speaker":"Fr Stephen De Young","text":"They had to be escorted out by security."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2875.38,"end":2876.9,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's. Yeah, that's true."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2877.62,"end":2881.14,"speaker":"Fr Stephen De Young","text":"So, okay, I thought I had a."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2881.14,"end":2882.74,"speaker":"Fr Andrew Stephen Damick","text":"Decent little joke there, but no."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2882.82,"end":2884.58,"speaker":"Fr Stephen De Young","text":"Yeah, you're trying. I'm all about."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2884.82,"end":2887.54,"speaker":"Fr Andrew Stephen Damick","text":"It's some new material. I gotta try it out."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2887.7,"end":2906.35,"speaker":"Fr Stephen De Young","text":"You're still working it out on the road. Yeah, that's right. But yeah. And for anyone who still doubts that interpretation we just quickly gave, I would note to you that in the Holy Saturday liturgy, we sing Psalm 82 and then we read the end of Matthew 28."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2906.75,"end":2909.95,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, they're directly connected."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2909.95,"end":2914.67,"speaker":"Fr Stephen De Young","text":"And Psalm 82 is sung as the gospel hymn. As the introduction to that gospel reading."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2914.67,"end":2923.66,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. It's not just. It replaces the alleluia so, like, it's literally connected to the gospel. It's not just the thing that comes before for it. Yes, it's directly connected. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2923.74,"end":2930.58,"speaker":"Fr Stephen De Young","text":"That. Yes. Singing. Somebody who introduces that gospel reading. So the church has ruled on this liturgically, folks."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2930.58,"end":2931.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2932.78,"end":2941.74,"speaker":"Fr Stephen De Young","text":"You know, so take your. Your passel of half fake patristic quotes you got from chat GPT and go pound sand. Thank you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2943.74,"end":2944.94,"speaker":"Fr Andrew Stephen Damick","text":"Sadly, a real thing."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":2947.88,"end":3022.04,"speaker":"Fr Stephen De Young","text":"I know. But yeah. So probably the assignment when we're thinking about different roles and tasks that angels are assigned, probably the one that's most, as Father Andrew said at the beginning of this half that's most experientially relevant to us is our guardian angel. Right. The one that's assigned to me. Right. Because I'm a narcissist. That's the most important one. So. And so again, this is something we get questions about because we've talked about this other show, and I know this is affliction. I know folks can't help it. Right. And they're trying to get over it. But we still have this spreadsheet thing where we're trying to fill in our boxes. And so one of the questions we get an awful lot is, right, because of course, there is this tradition, and it's in the prayers that a guardian angel is assigned to someone when they're baptized. And this over time has gotten us a legion of questions about, well, what if I was Chrismated?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3023.24,"end":3023.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3025.09,"end":3080.15,"speaker":"Fr Stephen De Young","text":"Does that mean anybody who's not in the Orthodox Church doesn't have a guardian angel? Does the baby not have a guardian angel until it gets baptized? Does. You know, what about later on in the liturgy, in the litanies where we ask for an angel of peace, a faithful guide, a guardian for our souls and bodies? Why do we have to ask for one if we got assigned one at baptism? Right. When we say the prayers for someone who's traveling, why do we ask God to send an angel like Saint Raphael with Tobit if you already have one? Right. And people get very confused. That's because you're trying to put these things in boxes, Right. They don't have to be in boxes. Let them breathe. Poetry is okay. It doesn't all have to be prose."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3081.91,"end":3082.55,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3085.19,"end":3124.75,"speaker":"Fr Stephen De Young","text":"And so, yes, it is true on the one hand, that there is a tradition. We believe that a person who is baptized or a person who becomes a Christian, they have an angel assigned to watch over them and spiritually protect them and most importantly, do what we were talking about in the last half, guide them in their life toward God. Toward Christ. Right. That is the guardian angel's most important task to help guide. Right. But we also pray all the time for that angel to watch over us and protect us. Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3124.75,"end":3125.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3125.23,"end":3148.68,"speaker":"Fr Stephen De Young","text":"And because, as we just said, assignments can change. Some of those prayers have as their subtext. Man, I've been doing a lot of rotten stuff that my guardian angel, being holy, doesn't want to know about and doesn't want to see. Don't take him away. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3148.92,"end":3150.36,"speaker":"Fr Andrew Stephen Damick","text":"And then there's also, you know, I."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3150.36,"end":3151.24,"speaker":"Fr Stephen De Young","text":"Still need his help."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3151.88,"end":3155.02,"speaker":"Fr Andrew Stephen Damick","text":"That 1983 Scorpion song, Send me an angel."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3157.09,"end":3184.05,"speaker":"Fr Stephen De Young","text":"Right now. Yeah. That was for our European listeners. So. Yeah. So we don't have to totally nail this down. Right. But yes. Oh, man, that Amy Grant song just came into my head. Nightmare fuel. Okay, moving on."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3185.57,"end":3187.17,"speaker":"Fr Andrew Stephen Damick","text":"Do you need to take a moment, Father?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3187.89,"end":3216.61,"speaker":"Fr Stephen De Young","text":"I need. Well, I need a stiff drink, but I don't think I should take one on the air. So. But so angels, Right. Also, it's important to recognize, just like demons, angels have their own agency. Right. Angels are not just like sock puppets God uses. Right. Like."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3216.69,"end":3217.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3218.21,"end":3251.34,"speaker":"Fr Stephen De Young","text":"Or inanimate tools. Right. They have a will. But the reason it's important to make this point is our weird, distorted view of free will. Right? Our weird, this is a very modern thing, distorted version of free will is, well, demons have free will because demons do what they want, but angels don't. Because angels just do whatever God tells them. Right. Well, first of all, if they don't have free will, how did there end up being demons? That's."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3251.34,"end":3251.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3254.22,"end":3254.62,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3256.06,"end":3256.94,"speaker":"Fr Andrew Stephen Damick","text":"Checkmate."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3257.42,"end":3280.09,"speaker":"Fr Stephen De Young","text":"Yeah, take that. But no, angels have their own agency. The fact that you voluntarily align your will and your activity with God's will and God's activity, like we were talking about in the last episode, the fact that you choose to do that does not mean you don't have free will. It means you have freely done that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3281.45,"end":3297.47,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is one of the things that sometimes people, skeptics of religion, quote unquote, will sometimes say, like, well, you only think that or do that because your. Your priest or your pastor, your bishop told you to. You know, I'm like, that one's making me be here."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3297.95,"end":3319.2,"speaker":"Fr Stephen De Young","text":"Yeah. You know, I am on my own recognizance. Yeah, yeah, yeah, that's. And even. And this is. This is important, an important principle in orthodox life. Right. When we. And we've talked about this on the show before, we're talking about, like, the concept of obedience. Right. For obedience to be obedience, it has to be freely given."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3319.52,"end":3324.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a Voluntary aligning. I mean, literally voluntary. That means according to the will."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3325.84,"end":3414.8,"speaker":"Fr Stephen De Young","text":"Yeah. If you're enslaved, right, you are not being obedient, you are being threatened and punished and forced to do things. Right. Like, that's not the same thing as someone in authority telling you to do something and you voluntarily obeying that command. Those are two different things. So. Yeah. So angels are the same way, right? They have their own agency as spirits. They're spirits. They're not ideas. They're not sock puppets. They're not drones. They have their own agents and they. Right. As we just alluded to, how did there get to be demons? Okay, a little more detail because we talk about this, we've talked about, you know, we talk about all the time, angels falling. And we've talked about that with a little more nuance, I think, on this show than a lot of places. But what does that concretely mean? And how concretely does that happen? Right? And we've even used some terminology where if you press it, like, what does that mean? So, like, when we've talked about the angels who are set over the nations, we've talked about the, you know, the, the, the humans of that nation start worshiping them as gods. And we've used language like, well, they accept it."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3415.68,"end":3421.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What does that mean? What does that mean behind some altar somewhere? And, and yes, Give me, give me, give me, give me. That, that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3423.71,"end":3426.87,"speaker":"Fr Stephen De Young","text":"Yes. Thank you for the smoke. Thank you for burning those bones. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3426.87,"end":3431.87,"speaker":"Fr Andrew Stephen Damick","text":"Is it like in the Iliad, you know, where they're up there going, smells great, I'm going to give you favor and war."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3432.35,"end":3447.79,"speaker":"Fr Stephen De Young","text":"Yeah, Right. So what that means is, what we're talking about is we're talking about an angelic being aligning its will with a human will."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3449.16,"end":3449.56,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3452.92,"end":3469,"speaker":"Fr Stephen De Young","text":"So it, this is why in each of the Angelic Falls, all 5ish of them that we reiterated last time, there is this human component, right. It is commensurate with some group of humans also falling."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3469.24,"end":3474.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not this separate event that we sort of hear about objectively."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3475.5,"end":3475.74,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3476.14,"end":3489.34,"speaker":"Fr Stephen De Young","text":"And so in each of those cases, every time that happens, there is some angelic being and some human being or beings, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3489.42,"end":3489.82,"speaker":"Fr Andrew Stephen Damick","text":"Who."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3491.74,"end":3497.18,"speaker":"Fr Stephen De Young","text":"Who align their wills with each other over against aligning themselves with God's."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3501.03,"end":3501.27,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3501.43,"end":3508.23,"speaker":"Fr Stephen De Young","text":"So angelic falls happen in communion with humanity."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3509.03,"end":3522.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is, I mean, this is why St. Paul says, don't eat pagan sacrifices, because that's basically don't do communion with demons because it's going to drag you down."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3523.03,"end":3630.91,"speaker":"Fr Stephen De Young","text":"Right. And this is. I mean, they understood this St. Paul understands this. The passage in 1 Corinthians you're talking about reflects that. But this is how the pagans understood it. They were in communion with their gods. They were part of a community with their gods. Right. And there was this relationship. Right. Of give and take. Right. And of being shaped. Right. And you can see Plato talking about the age of Cronus, where the gods were first assigned and they were all sort of peaceful and merciful shepherds. And then something happened. And now not so much for Plato. Right. Yeah. And so that sort of concretely, if you want the how that happens, that's how that happens. And by the way, that is the answer to the whole puzzling question. People roll over and over again all the time of like, well, wait, how can angels be mutable if they don't have physical bodies? Why can't they repent? Why can't be beautiful? Right. Because this happens. Right. In terms of humans who do have physical bodies that are mutable, that has happened through communion with humans. And you know those Minority Report of weird stories where you do see a demon, something happens akin to repentance. They become an angel again. There's a few stories, the Desert Fathers, where that happens. In every one of those stories, it's through communion with a human, a particularly holy human."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3631.15,"end":3631.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3631.47,"end":3634.68,"speaker":"Fr Stephen De Young","text":"Which kind of suggests a human saint."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3635.08,"end":3636.92,"speaker":"Fr Andrew Stephen Damick","text":"Humans have power over angels."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3637.32,"end":3641.24,"speaker":"Fr Stephen De Young","text":"Yes. That's through whom. They're almost like we're going to judge them someday."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3641.8,"end":3643.64,"speaker":"Fr Andrew Stephen Damick","text":"Huh. I feel like I read that somewhere."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3643.8,"end":3691.73,"speaker":"Fr Stephen De Young","text":"Yeah. Like we're in the hierarchy above them. Glorified humans are in the hierarchy above them. It's almost like that. Yeah. A lot of what St. Paul says in this regard assumes the Incarnation. Right. Even though he never straight comes out and says, and this is why, again, somebody like Bart Ehrman even thinks. He now roughly thinks that St. Paul was an Arian. He doesn't think. He isn't fully there yet, but he has moved from the position that St. Paul didn't think Jesus was divine to. Oh, no, there is some kind of incarnation thing happening here in the background that's fundamental to his logic."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3692.21,"end":3694.29,"speaker":"Fr Andrew Stephen Damick","text":"Come on over. Bart Ehrman for the show."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3694.53,"end":3695.73,"speaker":"Fr Stephen De Young","text":"So almost there."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3696.29,"end":3697.57,"speaker":"Fr Andrew Stephen Damick","text":"Keep going, Keep going."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3697.57,"end":3700.77,"speaker":"Fr Stephen De Young","text":"Don't call in tonight. Next live show, call in and we'll talk about it."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3700.77,"end":3703.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, absolutely. We'll just clear everything off the."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3705.09,"end":3813.44,"speaker":"Fr Stephen De Young","text":"Well, I will. I will clear the decks and just talk to Bart Urban for three hours. If he wants to talk for three hours. I doubt he wants to talk to me for three hours. I don't know that he wants to talk to me for five minutes, but I really doubt. Three hours, but open invitation, but I would if you wanted to. And yeah, so, but so what that's showing is, again, we talked about this last time, humans have a noose, have a mind, right. We are the type of being that overlaps the spiritual world, the world of thoughts, the noetic world, and the physical material world. Right. And we experience all of that together. Again, that's kind of the theme of this show. The overarching theme of the show is that humans experience all of that, even if they want to deny part of it, they still experience it and participate in it. Angelic beings are in that noetic layer of the created world. My dogs are in the physical, material part of that creation. Human beings overlap it. And so that's why there is, in the same way that humanity has a certain relationship to the rest of the material creation vis a vis, representing it to God. Right. Humanity also has a role, especially in light of the incarnation, in terms of."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3813.44,"end":3813.76,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3815.6,"end":3881.58,"speaker":"Fr Stephen De Young","text":"Noetic realm, the realm of angels and demons. And that's what St. Paul is getting at there with the, with the judging angels. But so that world, that world of thoughts, that noetic world, that world of the noose. Right. That we perceive through our mind, that's where angels, not just demons, but also angels, operate primarily when you're not seeing them, which is most of the time. Right. And in that world of thoughts, just as demons come and throw thoughts at us, sometimes described as darts, that whole reshef analogy that comes through the psalms, angels come with positive thoughts, with godly thoughts, thoughts of God. And those likewise are thoughts that we could choose to focus on. As St. Paul says, whatever is good, whatever is pure, whatever is noble, think on these things."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3882.06,"end":3896.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and we all have this experience too, right? Like you'd be just doing something, and then something very good will occur to you. And if you're like me, you kind of go, that's nice, and move on most of the time. But actually, how."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3896.46,"end":3899.1,"speaker":"Fr Stephen De Young","text":"Back to this social media post that's making me angry."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3899.34,"end":3912.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. But you know, just, hey, hey, pay attention to those thoughts a little bit more. If you can, you know, and think, wait, could I do that? Usually the answer is yes. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3912.64,"end":3917.84,"speaker":"Fr Stephen De Young","text":"And the, the. And as we talked about last time, those are the thoughts that we need to be building into ideas."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3918.56,"end":3918.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3918.92,"end":3939.2,"speaker":"Fr Stephen De Young","text":"Like work with that and ideas that we then act upon. Right. That we then put to work in our lives. Yeah, yeah, right, yeah. Rather than the other thoughts. Right, yeah. This is Part of what we're talking about last time with replacing the negative with the pot. Right. The idea is these things, these good things, we take those, focus on those and build those."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3939.2,"end":3962.25,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, yeah. Like, I mean, a thought comes into your head, it's good to ask this question of this, of the thought. Is this thought going to help my salvation or harm it? And, you know, usually the answer to that question is pretty straightforward and easy. And then, you know, based on that, you can focus on the thought or tell it to take a hike."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3963.37,"end":3999.22,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Now we have to make a note here because there's another place where sort of Calvinist Puritan Protestant tradition rears its ugly head in American evangelicalism. And that's that this stuff we're talking about with angels and thoughts, if you're used to hearing anything like that in the American Christian world, it's probably all attributed to the Holy Spirit."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":3999.38,"end":4001.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the Holy Spirit told me."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4001.94,"end":4003.94,"speaker":"Fr Stephen De Young","text":"Yeah, the Holy Spirit told me this."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4004.34,"end":4007.95,"speaker":"Fr Andrew Stephen Damick","text":"Often it's the Holy Spirit told me to tell you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4008.67,"end":4013.23,"speaker":"Fr Stephen De Young","text":"Yeah. You know, the Holy Spirit gave me this. Or, you know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4013.71,"end":4014.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4014.95,"end":4027.23,"speaker":"Fr Stephen De Young","text":"The thing that always ground my gears when I'd hear somebody. I was going to talk about something totally different, but the Holy Spirit really laid it on my heart to say this. Then they say something that's just absolutely incorrect about the Bible."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4027.47,"end":4027.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4027.91,"end":4031.47,"speaker":"Fr Stephen De Young","text":"Like verifiably, factually incorrect. And I'm like, that wasn't the Holy Spirit, bro."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4032.81,"end":4035.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, God laid it on my heart. That's something you hear a lot."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4035.77,"end":4041.01,"speaker":"Fr Stephen De Young","text":"Technically, you just blasphemed. No, that is. That's blasphemy."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4041.01,"end":4041.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, I know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4041.61,"end":4043.77,"speaker":"Fr Stephen De Young","text":"Taking your own words and claiming they're the words of God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4044.09,"end":4044.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4044.89,"end":4048.41,"speaker":"Fr Stephen De Young","text":"Okay. Claiming God told you something that isn't true. That's blasphemy."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4048.41,"end":4064.52,"speaker":"Fr Andrew Stephen Damick","text":"I think. Yeah. I think it's because, you know, people, for whatever reason, people have been trained that a strong feeling or a good feeling or something making sense to them equals the action of God directly on them."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4064.92,"end":4065.24,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4065.24,"end":4065.48,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4065.48,"end":4067.32,"speaker":"Fr Stephen De Young","text":"And you can, you can weaponize this."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4067.64,"end":4068.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4068.08,"end":4106.97,"speaker":"Fr Stephen De Young","text":"And people, I'll give you a recent example that I found fascinating. So, prominent Protestant Internet apologist, okay. But my personal favorite Roman Catholic apologist, I'm not going to name any names here, but my personal favorite Roman Catholic apologist, for various reasons, makes a video just like, logically, point by point, annihilating this whole talk given by this Protestant. Right. Apologist."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4107.29,"end":4107.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4110.81,"end":4130.97,"speaker":"Fr Stephen De Young","text":"So, of course, people, both people on the Roman Catholic side and people on the Protestant apologist side want the Protestant apologist to Respond to this. Okay, so Deluge thinks, hey, are you going to respond to this? Are you going to respond to this, man? Like, it really sounds like you kind of wrecked. Wrecked your battleship. Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4130.97,"end":4132.45,"speaker":"Fr Andrew Stephen Damick","text":"Like you're totally pwned."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4132.85,"end":4141.73,"speaker":"Fr Stephen De Young","text":"Yeah. Like, are you. When are you going to respond to this? Are you ready for the response they got from all sides? God, in terms of, will he address this?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4142.02,"end":4143.38,"speaker":"Fr Andrew Stephen Damick","text":"Sitting on the edge of my seat here?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4145.14,"end":4154.1,"speaker":"Fr Stephen De Young","text":"Do you want person's name to spend time on this rather than the things God has given him to talk about?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4154.58,"end":4164.5,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow. Amazing."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4165.14,"end":4172.83,"speaker":"Fr Stephen De Young","text":"So, yeah. Talk about weaponization. Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4172.83,"end":4173.39,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4173.79,"end":4187.71,"speaker":"Fr Stephen De Young","text":"And what is buried in there? The claim that every video this Guy releases on YouTube is coming from God. Right, Right. This isn't a charismatic guy who would call himself a prophet, but he's basically claiming to be a prophet when he says that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4187.71,"end":4255.85,"speaker":"Fr Andrew Stephen Damick","text":"I know it's. And it's, you know, it's obviously wrong on its face. Right. Because. Because the problem is the people who make these claims for themselves or about the guy that they're simping for, you know, what about the fact that other people who are making those exact same claims say things that contradict what, you know, prophet number one is saying? Then you have to pick between them, and then it's like, well, why should you pick this guy and not this guy? You know, why is this set of opinions, though? This is the set of opinions from the Holy Spirit. This one guy has it, which, I mean, okay, yes, that's theoretically possible, but that's not Christianity, you know. Right. This is not the Messiah. Right. I actually read someone. Someone the other day on. On the tweeters said, you know, if you dislike so and so. Speaking of a. Of an orthodox figure online, if you dislike so and so, then you oppose the church. Father. Whatever. I'm like your buddy there is not Jesus, you know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4256.17,"end":4259.29,"speaker":"Fr Stephen De Young","text":"Yeah. You know, he is not the church fathers, even."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4259.29,"end":4261.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's also not. Yeah, exactly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4261.53,"end":4265.69,"speaker":"Fr Stephen De Young","text":"Like, you know, he's not even one of the church fathers."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4266.73,"end":4269.45,"speaker":"Fr Andrew Stephen Damick","text":"I'm like, oops, you kind of did an idolatry there."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4269.53,"end":4271.21,"speaker":"Fr Stephen De Young","text":"Yeah. He's not even a saint yet."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4271.69,"end":4273.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4273.29,"end":4274.61,"speaker":"Fr Stephen De Young","text":"Maybe someday, but."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4274.61,"end":4277.14,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Simply easy."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4279.62,"end":4296.82,"speaker":"Fr Stephen De Young","text":"Oh, stops it, everyone. Like, if you are an adult man, okay, there are ways you should never talk to another adult man. But I get emails anyway. Just stop. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4298.1,"end":4298.5,"speaker":"Fr Andrew Stephen Damick","text":"Email."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4299.78,"end":4308.31,"speaker":"Fr Stephen De Young","text":"But. So here's what we're suggesting. We're not just, hey, let's pick on the way evangelicals talk. That's not. That's honestly not what we're trying to do."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4308.31,"end":4309.23,"speaker":"Fr Andrew Stephen Damick","text":"Right? No, no."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4309.23,"end":4321.87,"speaker":"Fr Stephen De Young","text":"What we're trying to say is. And the reason I gave. The example I gave is that's where that just. Oh, way of talk. Well, yeah, that's just a way of talking. It got kind of weaponized in a weird way. Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4323.31,"end":4323.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4325.31,"end":4330.5,"speaker":"Fr Stephen De Young","text":"Like to shut down discussion, to not have to be accountable, have some restraint."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4330.5,"end":4331.9,"speaker":"Fr Andrew Stephen Damick","text":"Like. Like, it's like say."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4331.9,"end":4347.3,"speaker":"Fr Stephen De Young","text":"No, no. Just here, you say this. You say this because this is what we're saying. The truth is. Right. You say a thought occurred to me. Right. And I think it's a good one. And here's my idea based on that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4347.86,"end":4348.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4348.74,"end":4358.24,"speaker":"Fr Stephen De Young","text":"Here's my fallible idea. Right. Because as we talked about when you move last time, when you move from a thought to an idea, your subjectivity comes into it. My subjectivity comes into it."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4358.24,"end":4358.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4358.44,"end":4359.88,"speaker":"Fr Stephen De Young","text":"You're engaged, therefore it's fallible."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4360.52,"end":4362.92,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4363.08,"end":4367.16,"speaker":"Fr Stephen De Young","text":"That thought did come from God through an angel. I might get it wrong."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4367.48,"end":4374.2,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. I think there should just be a whole lot more, a whole lot less of God laid it on my heart and a whole lot more, it seems to me."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4374.28,"end":4376.04,"speaker":"Fr Stephen De Young","text":"Yeah. This is coming from me."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4376.6,"end":4377,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4377,"end":4384.69,"speaker":"Fr Stephen De Young","text":"Like, this is coming from me. Not directly from God. Not even directly from an angel. It's coming from me. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4385.17,"end":4385.73,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4387.17,"end":4393.97,"speaker":"Fr Stephen De Young","text":"But I think this is. Right. That's. You know. Yeah. And that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4396.29,"end":4398.05,"speaker":"Fr Andrew Stephen Damick","text":"You don't get as many clicks that way, Father."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4398.13,"end":4428.76,"speaker":"Fr Stephen De Young","text":"None of my books. Yeah. I had a really disappointed parishioner because I pointed out to them that if I went back and read Religion of the Apostles right now. Right. That I wrote. I technically I wrote it like six years ago. Yeah. Right. That I would probably think that some of it is not correct. Right. Because I've learned things. I've changed my opinions on things. There are at least things that I probably word differently."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4429.24,"end":4429.96,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4429.96,"end":4432.6,"speaker":"Fr Stephen De Young","text":"Or explain more or whatever that I would change. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4433.48,"end":4437.28,"speaker":"Fr Andrew Stephen Damick","text":"The editing could just never stop. That's always the problem of being in a writer."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4437.28,"end":4479.78,"speaker":"Fr Stephen De Young","text":"You're like, oh, wait, I can't believe I read. Especially after years. Right. Like, go back to it. You're like, oh, yeah, no, you know, that was cringe. Really be more like this. Yeah. Right. But this kind of upset him because he's like, well, wait, should I read it or not? Right. Like you're telling me it's. Right. And I had to say, like, at any time I talk to you, I'm doing my best. Sure. Right. I'm giving you my best case. My best understanding in that moment. Right. But I hope that a few years from now my understanding of these things will be better, which means I'll think that my understanding today was, to some degree, wrong."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4482.42,"end":4483.14,"speaker":"Fr Andrew Stephen Damick","text":"Unbelievable."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4484.42,"end":4487.46,"speaker":"Fr Stephen De Young","text":"But I am very aware of my own subjectivity and fallibility."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4489.71,"end":4489.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4490.11,"end":4506.43,"speaker":"Fr Stephen De Young","text":"And. Yeah. And so I'm sorry if that bothers people. Right. Like, this parishioner wanted me to present it as if, like, no, I stand by every word of this. And I'm like, if I read it, I probably don't. Right. Like, you know, not every word. No."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4507.95,"end":4510.03,"speaker":"Fr Andrew Stephen Damick","text":"And that's okay. It's all right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4510.03,"end":4512.59,"speaker":"Fr Stephen De Young","text":"It's the world we live in of human communications. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4512.91,"end":4516.6,"speaker":"Fr Andrew Stephen Damick","text":"That's why most of what's on our bookshelves is Apocrypha."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4517.8,"end":4522.2,"speaker":"Fr Stephen De Young","text":"Yes. Yes. Extra biblical literature is everything except the Bible."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4524.2,"end":4528.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So. Yes. Good digression. Good digression. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4528.68,"end":4531.8,"speaker":"Fr Stephen De Young","text":"Yeah. Well, no, it is important to disambiguate that, though, right? It really is."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4531.8,"end":4532.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4532.12,"end":4532.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4532.36,"end":4532.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4533.16,"end":4575.24,"speaker":"Fr Stephen De Young","text":"That there is not. When St. Paul talks about the indwelling of the Holy Spirit. Right. Read his epistles. Show me where he talks about it as the Holy Spirit feeding us information. Right. About people, about the future, about their future. Any of that. The comparison he's always making is to the presence of God in the temple, in the tabernacle, and the Holy Spirit is the presence of God in us. That's the comparison he makes over and over again. And the presence of God in the tabernacle, in the temple was not like whispering prophecies to the priests while they served."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4575.48,"end":4576.68,"speaker":"Fr Andrew Stephen Damick","text":"It wasn't oracular."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4577.08,"end":4578.88,"speaker":"Fr Stephen De Young","text":"That wasn't a thing. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4578.88,"end":4579.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4580.2,"end":4596.55,"speaker":"Fr Stephen De Young","text":"So I know that a lot of groups in America today, they think that's what the Holy Spirit does, but frankly, that's not in the Bible, man. And especially if you're one of our Protestant friends, it being not in the Bible should be super important to you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4596.71,"end":4605.03,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he's going to give you utterance, bro. It's just going to occur to you. He's going to, like, you know, the words are just going to appear in your brain and, you know."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4606.31,"end":4606.87,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4606.87,"end":4607.43,"speaker":"Fr Andrew Stephen Damick","text":"Or not."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4607.43,"end":4615.99,"speaker":"Fr Stephen De Young","text":"Well, we won't go down that rabbit trail anymore. Another. We already have, I think back in our prophecy, our episode on prophets and prophecy."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4616.23,"end":4623.29,"speaker":"Fr Andrew Stephen Damick","text":"So what else are angels doing? So angels are kind of. They're hanging out in the world of thoughts. What else?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4623.29,"end":4625.21,"speaker":"Fr Stephen De Young","text":"Well, they're not hanging out. They have jobs."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4625.53,"end":4625.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4625.93,"end":4630.97,"speaker":"Fr Stephen De Young","text":"You know what I mean? That is where they are. No angelic unemployment after the Ascension."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4631.45,"end":4632.41,"speaker":"Fr Andrew Stephen Damick","text":"No loafers."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4634.49,"end":4711.32,"speaker":"Fr Stephen De Young","text":"But so the kind of thoughts. What are the kind of thoughts? Right. Well, positive. Right. We don't just mean positive, like wholesome or think good thoughts, pretty or nice. Right. That's not what we're talking about. We're talking about reminders and guidance. Right. They're guiding us to God. So reminders of sin and repentance. Right. Reminders of God's forgiveness of us and the forgiveness that's available to us when we repent. Reminders of God himself. Right. Reminders that the good things we have come from him. Right. Reminder. These are the kind of thoughts we're talking about. Right. That would be the ones that angels are throwing our way as opposed to the ones that demons are throwing our way. Yeah, Right. But we also want to, because we talked about how humans. Right. Bridge these two sort of layers of created reality. The sort of angelic or noetic or the world of thoughts and the physical and material world. Again, as we've said since literally the very beginning of the show, since the first episode, these are not two different realities. Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4711.48,"end":4718.44,"speaker":"Fr Andrew Stephen Damick","text":"These are not split natural, supernatural. That's not an orthodox Christian thing."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4718.92,"end":4730.53,"speaker":"Fr Stephen De Young","text":"No, there's not some barrier between the two. You don't, like, astrally project to get into the other one. Sorry. Dr. Strange and Professor."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4730.61,"end":4731.09,"speaker":"Fr Andrew Stephen Damick","text":"Sorry."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4731.17,"end":4737.29,"speaker":"Fr Stephen De Young","text":"A lot of astral projection in Marvel comics. I'm just realizing that. I know, right. Sorry."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4737.29,"end":4738.29,"speaker":"Fr Andrew Stephen Damick","text":"Dr. Strange."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4741.81,"end":4812.54,"speaker":"Fr Stephen De Young","text":"Well, he is the sorcerer supreme, which I assume means he has all the toppings. But anyway, so these aren't two different realities. Right. This is one created world, one creation of God that has these different elements and aspects to it. Right. That we can distinguish between. And so angels aren't sort of restricted to this world of thoughts. Right. And we see this in scripture, obviously. Right. And they're associated with places and with things. Right. There are the angels who govern Philo Quote, which we won't read again. Right. The sun, moon and stars. Right. And different parts of material creation. The nations, as we mentioned. Right. And so there's not this barrier sort of between them, like. Oh, though they're just restricted to this thought world. They can't, like, sort of appear in the physical or material world. They can't act within the physical, material world. They're not related in any way to it. No, they are."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4812.62,"end":4813.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4813.42,"end":4813.98,"speaker":"Fr Stephen De Young","text":"That's."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4813.98,"end":4814.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4815.42,"end":4822.22,"speaker":"Fr Stephen De Young","text":"But they don't live in both the way we do because they don't have material bodies like us."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4822.46,"end":4824.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4824.42,"end":4829.98,"speaker":"Fr Stephen De Young","text":"They live in one, but it's not separated from the other part. The other."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4830.78,"end":4837.75,"speaker":"Fr Andrew Stephen Damick","text":"They function as spirits. As spirits. That's their main function is this sort of influencing, you know, thing."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4837.75,"end":4839.43,"speaker":"Fr Stephen De Young","text":"They're influencers. That's what we're saying."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4839.59,"end":4849.71,"speaker":"Fr Andrew Stephen Damick","text":"There we go. So make sure you like and subscribe. Click the little notification button, click the."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4849.71,"end":4854.71,"speaker":"Fr Stephen De Young","text":"Bell, you know, every time a new thought appears."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4854.87,"end":4865.32,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. All right. Well, that's the second half of this episode of Lord of Spirits Talking about Angels. We'll be right back with the third and final half. See you soon."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4866.04,"end":4953.37,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8555-AF-RADIO. People often complain that the Divine Liturgy is always the same week after week. But every ritual phrase and action in the service has meaning and purpose, drawing in worshippers with its hymns and prayers and allowing ordinary people to leave the world and enter heaven for a short time. In the new book Blessed Is the Kingdom, Father Stavros Akrotirianakis, a longtime parish priest, offers reflections on the text of the Divine Liturgy of Saint John Chrysostom to help readers learn to pray the liturgy and to understand and appreciate the mystery that unfolds each time it is celebrated. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits, the Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":4954.81,"end":5007.28,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the third half of this episode of the Lord of Spirits podcast. Once again, we're pre recorded, so we're not taking any calls. We don't know what will happen if you call that number, but we're not taking any calls. Exactly. Most of you don't listen live anyway, so. Yeah, so, you know, it's the same experience as always. Anyway, we're talking about angels and we just finished up our second half where we were talking about the sort of the nitty gritty of angelic activity in the world. So what else is there? I mean, we, yeah, I mean, there's more to say about their ministry, but there's some, some interesting things about what angels have to do with humans. Exactly. I think that we could talk about here."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5007.36,"end":5048.65,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. So we talked about, in the first half we talked about sort of how God administers creation through angels. And then the second half we talked a little bit about how angels interact with us within the created world. And now this third half, not to show our hand too much, but you might detect some madness to our method. We're going to talk about how angelic beings function in terms of our relationship upwards toward God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5049.55,"end":5049.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5050.91,"end":5057.39,"speaker":"Fr Stephen De Young","text":"And so one window we get into that is the reference that Christ makes to guardian angels."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5058.03,"end":5058.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5058.99,"end":5093.95,"speaker":"Fr Stephen De Young","text":"When he talks about the little ones who we are not to offend because their angels are always before the throne of the Father in heaven. Right. They're angels. Right. So they have angels, hence the reference to guardian angels. But it's not just that, oh, they have a guardian angel and he's going to come smite you. Right. If you offend them. But that angel is always right, is standing before the throne of the Father in heaven. So what's it doing?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5094.83,"end":5095.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5095.63,"end":5098.43,"speaker":"Fr Stephen De Young","text":"Isn't it supposed to be guarding them? Why is it hanging out?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5098.99,"end":5100.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What are you doing there?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5102.13,"end":5104.89,"speaker":"Fr Stephen De Young","text":"The space doesn't work the same in."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5104.89,"end":5106.37,"speaker":"Fr Andrew Stephen Damick","text":"The noetic realm as it does."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5108.61,"end":5148.87,"speaker":"Fr Stephen De Young","text":"So if in the first half we were coming at it sort of top down, right. God toward creation, now we're sort of coming at it sort of bottom up. Right. And in that sense we see this angel clearly that Christ is talking about. These angels are functioning as sort of intermediaries, Right. They're interceding with, speaking to, praying to God, communicating to God about what is going on with their charges, these little ones on earth who are being abused in some way. Right. And Christ is saying, you should be aware of that before you mistreat."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5149.35,"end":5149.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5149.71,"end":5170.58,"speaker":"Fr Stephen De Young","text":"One of these, that, Right. This is what you're doing is being reported to God. Now again, does that mean God wouldn't know otherwise? Right. Why doesn't Christ just say, hey, God sees what you do and he sees how you treat people."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5170.98,"end":5173.54,"speaker":"Fr Andrew Stephen Damick","text":"He knows when you're sleeping, he knows when you're awake."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5174.02,"end":5176.38,"speaker":"Fr Stephen De Young","text":"I mean, he does. That would be a true statement, right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5176.38,"end":5177.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5178.34,"end":5274.85,"speaker":"Fr Stephen De Young","text":"We're not saying God doesn't. Right. Like that would be a true statement. Right. But this points to a reality that again, right, out of love, God has given these angelic beings this intermediary role. Right. That they are participants in and share in this relationship of love between God and this human person he's created. Right. So hard to imagine being my guardian angel would be any kind of privilege as opposed to being someone else's. Maybe not, but in this sense it is, right? In this sense it is this, by the way, right? When we talk about, and we mentioned this, we mentioned this in terms of the quote we've mentioned several times from St. Andrew of Crete. But the idea of the devil falling through envy, right. This, of course, is understood to be talking about envy, of the sort of special relationship between God and humanity that isn't shared in the same sense by God and angels. See, Hebrews, right? Because of the incarnation. About which of the angels did God ever say? Right, yeah. And he responded to that with envy, right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5275.25,"end":5275.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5276.21,"end":5456.91,"speaker":"Fr Stephen De Young","text":"But the correct response, right? And what we see with the angels who didn't fall out of envy or anything else, right. Is that they were given a role within that relationship. That relationship between humans and God is shared with the angelic beings. They are participants in that. Right. And we see them participating in that. The angels and the stars. Well, yeah, same thing. But who are. Who are singing in Luke 2 when Christ is born, right. It's not that they're this third thing who are cut out of, you know, like God, you know, they were the first draft and then humans. And God likes humans better, Right? Like someone's family. I don't know whose I could be talking about where, you know, the mom just loves the second child more. Right. I mean, it just. It's a thing, you know, that happens sometimes. Right. But that's not what we're talking about with God. Yes, Right, right. God loves angels, just the angels he created just as much as the humans he created. Right? That's not. It's not like. But again, different roles, different purposes, right? But angels are part of that community. They're not cut out from it. They're not separated from it unless they separate themselves from it. Right? So the devil falls through envy, meaning the devil wasn't happy with that role that he was given by God. And this is the story of rebellion, sort of all through the scriptures, right? And the story of sin as rebellion as a whole is God gives us a role to play. He makes us who we are and places us where he places us in history, in time, in space, and the family we're born into, Right. Gives us gifts, different gifts, right? Different places, different times, different. Right. All these things are different. And all these things are kind of given to us without our say so. And the core of sinful rebellion is being unhappy with that and wanting something else, wanting to be someone or something. We're not wanting to have some gift from God that He hasn't given us, not wanting the ones he has given us, not wanting to be where he has put us, wanting to be somewhere else. That's the core of rebellion."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5458.27,"end":5458.67,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5459.31,"end":5471.56,"speaker":"Fr Stephen De Young","text":"But so angels are a part of that. And having this intermediary function is how they're part of that love and part of that relationship."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5472.36,"end":5472.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5473.48,"end":5475.72,"speaker":"Fr Stephen De Young","text":"So again, they're not necessary in there."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5475.72,"end":5476.04,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5476.04,"end":5478.52,"speaker":"Fr Stephen De Young","text":"God knows he doesn't need an angel to tell him."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5479.08,"end":5479.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5480.04,"end":5505.65,"speaker":"Fr Stephen De Young","text":"To report to him. Right, Yep. Nonetheless, read your Bible, read Job. Okay. It's very clear. Angels come and report things going on on earth to go all the way to. All the way to Revelation. Right. That's there. We see angels bringing the prayers of the saints to God in Revelation post ascension."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5505.81,"end":5507.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5508.77,"end":5591.96,"speaker":"Fr Stephen De Young","text":"Do they need to. Does God not know about the prayers of the saints unless they get brought to him in a bowl by an angel? Of course he does. Yeah. But the angels are given this role and it's very clear, I mean abundantly clear in Second Temple Jewish literature that angels have this intercessory role. And in Second Temple literature, I'm including the Book of Revelation. These purposes, though it is canonical. Right. It is also technically part of Second Temple literature. I mean, maybe technically not, because the temple was destroyed 25 years before it was written. Sorry, preterists, but you know what I mean. Now, within pre Christian Judaism and ongoing in Christianity, it's important that this idea that there are these intermediaries involved with prayer, with intercession. Right. With speaking to God on behalf of people in the world and what's going on in the world. This is in addition to. Not in place of the other. Right. So it's not that the angels prayed for people, so they didn't have to."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5592.92,"end":5608.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Or like they don't get in the way. That's a frequent criticism from some Protestants is like angels, you know, get, get. If you talk to an angel, it gets in the way between you and God as though there is. That's even a possibility."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5609.86,"end":5670.36,"speaker":"Fr Stephen De Young","text":"Right. And this is. And the problem with asking the question. Right, well, wait, right. So I pray. God hears my prayer. God knows I pray. Right. Why does some angel or some glorified saint have to come and offer my prayer to God or double down on it or pray with me again? There's no have to. There's no have to. And if you're going to ask that question, you might as well ask, well, why pray at all? God already knows what I'm thinking and feeling. Why do I have to vocalize it? And why should I confess my sins to God or anybody else? God knows what I did. He knows about sins I didn't notice and forgot about or don't realize. God already knows, so why bother?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5670.36,"end":5677.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the same argument can be used against prayer entirely. Like why pray at all between you and God?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5677.56,"end":5679.64,"speaker":"Fr Stephen De Young","text":"Why pray at all? Why confess sin at all?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5679.64,"end":5681.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5681.45,"end":5684.01,"speaker":"Fr Stephen De Young","text":"Even confessing it directly to God, why? He already knows."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5684.57,"end":5685.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5686.49,"end":5750.91,"speaker":"Fr Stephen De Young","text":"Right. Yep. Doesn't make a whole lot of sense. Right. But this idea, you know, I was having a discussion with, with an Orthodox Jewish person and they were trying to minimize. Because really, honestly, even in post Christian Jewish tradition, there's intercession of angels and saints, but he was trying to sort of minimize that part of the tradition and said to me, give me one example. He said, can you give me one example of Second Temple literature of saints and angels interceding for people? And I said, man, I can't think of a single Second Temple Jewish interpreter, or even later Jewish interpreter for that matter, who understands Rachel weeping for her children when Israel went into exile or when Judah went into exile as anything other than Rachel weeping for her children."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5752.51,"end":5753.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Not some weird."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5753.59,"end":5789.75,"speaker":"Fr Stephen De Young","text":"Who didn't take it literally. They all took that literally, that the spirit of Rachel, the Old Testament saint, was weeping, seeing her right before God, crying out to God over what was happening. Right. And then St. Matthew, of course, applies that to the slaughter of the innocents. And I would therefore see no reason why Anyone would understand St. Matthew to be interpreting that any less literally than all the other Jewish interpreters living at the time. He did."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5790.63,"end":5791.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5791.99,"end":5839.72,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, this is just a thing. Right. Not because it's quote unquote necessary. But now when we talk about this, when we talk about angels are glorified saints interceding, the most common thing, the most common thing that people who oppose that idea or practice or just get the heebie jeebies from it. Right. The most common verse that you hear in response is first Timothy 2, verse 5. And we're now going to tell you why you need to stop that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5841,"end":5841.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5841.4,"end":5853.8,"speaker":"Fr Stephen De Young","text":"Okay. 1 Timothy 2, 5, which is depending on your translation, roughly, for there is one mediator between God and man, the man Christ Jesus."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5854.68,"end":5856.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It gets thrown out of."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5856.36,"end":5867.81,"speaker":"Fr Stephen De Young","text":"See, there's one mediator, nobody else. You don't need any of these people praying for you. There's. That's never applied, by the way, to asking people in your church to pray for you."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5869.41,"end":5871.97,"speaker":"Fr Andrew Stephen Damick","text":"Hey, there's one meter between God and man, you guys."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5872.29,"end":5943.7,"speaker":"Fr Stephen De Young","text":"Yeah. Why are you asking me to pray for you? Why don't you pray directly to God? Right. You never hear that, but yeah, that's the verse you hear. Okay. So there should be a tip off to you because that word for in the translation at the beginning basically means because. So if you Have a sentence here that begins with. Because it's not even really a sentence. It's a clause within a sentence. It's part of a sentence. Right. So there's something, something, something, right. In First Timothy 2, 1, 4, something, something, something. Because there is one meteor between God and man, the man Christ Jesus. And the way it's quoted, you would think that the something, something, something in the first four verses is you don't need anyone to intercede for you. Right. But lo and behold, when you go to 1 Timothy 2, verse 1, context, 1st Timothy 2, verse 1, to see the beginning of the sentence, the beginning of the sentences, St. Paul saying, I desire that intercessions be made for all men."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5948.43,"end":5949.39,"speaker":"Fr Andrew Stephen Damick","text":"Wait, that can't be right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5949.95,"end":5985.8,"speaker":"Fr Stephen De Young","text":"Yes. And he enumerates your kings, rulers, princes. You should pray for everyone. Pray for everyone. Intercede for everyone before God. Because there is one mediator between God and man, the man Christ Jesus. So folks who quote that against the idea of intercession are abusing Scripture. You are abusing St. Paul. You are quoting St. Paul out of context. You are quoting the Bible, the scriptures out of context to say the exact opposite of what they are saying. That's why you need to stop it."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5985.88,"end":5989.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's because there's one mediator that you should do this. Interesting."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5989.84,"end":5990.28,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5990.52,"end":5990.84,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5990.84,"end":5995.88,"speaker":"Fr Stephen De Young","text":"So you are literally trying to make the opposite point by quoting the Bible out of context."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":5995.88,"end":6000.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Obviously the mediation that Jesus is doing is not."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6001.18,"end":6004.46,"speaker":"Fr Stephen De Young","text":"Is a different kind of mediation than intercessory prayer."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6004.62,"end":6012.7,"speaker":"Fr Andrew Stephen Damick","text":"Because mediation, the word mediation, it just means being in the middle between, you know, but it shouldn't be taken in an utterly literal way, right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6013.26,"end":6017.02,"speaker":"Fr Stephen De Young","text":"Well, I think it is in a literal. Literal might not be the right word there."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6017.26,"end":6038.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But like, you know, like, you shouldn't take the. You shouldn't take the image and push it to every possibility. So, like, if I, If I pray for you, I'm being a mediator, but that doesn't. And in that sense, I'm between you and God. But not in the sense of like, don't get me between me and. Me and God. You know, like, I'm not cutting off access, just Jesus is not cutting off."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6038.46,"end":6046.14,"speaker":"Fr Stephen De Young","text":"It's in addition, not in place of. Yeah, yeah, yeah, like just. Yes, just like Christ. Does it cut off your access to the Father?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6047.34,"end":6047.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6049.26,"end":6077.77,"speaker":"Fr Stephen De Young","text":"Quite the opposite. But so, no, what St. Paul is talking about there with a mediation and then how that because works in this sentence. Okay. Any of those people who want to quote it the other way, explain to me how the. Because Works in that sentence. Okay. Because I can explain how that because works in that sentence. In that St. Paul's talking about the Incarnation. Christ mediates between God and man in his person."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6079.09,"end":6080.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's both."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6081.25,"end":6181,"speaker":"Fr Stephen De Young","text":"Right. And that's why it says there's one meteor between God and man, the man Christ Jesus. And so St. Paul has received this tradition of angelic intercession. He's a Jewish person in the first century A.D. they believe in this. Okay. And he's saying because of who Christ is, because of the incarnation and the ascension. Now, human prayers and human intercessions are as powerful, if not more powerful, than angelic intercessions. That's the argument here. That's the. Because. Because of the Incarnation and the ascension and humanity being seated at the right hand of God. That's why St. Paul wants humans to pray and intercede for the whole world, for everyone in it, for all kinds of people. And the incarnation lies behind. As we were saying earlier. Call in Barderman. Incarnation lies behind so much of St. Paul's theology. Just referring to Christians now as holy ones. Remember holy ones. That gets translated, saints in the New Testament and often not in the Old Testament. Holy ones is what's used to refer to angels in the Old Testament."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6181.32,"end":6181.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6184.05,"end":6233.18,"speaker":"Fr Stephen De Young","text":"And he refers to humans in the church by that title. Right. So this is a connection between humans and angels that's being made and here that's being applied to intercessions. And the reason there's a parallel there between humans and angels is because of the incarnation of Christ through which humanity has been exalted even above angels, such that as St. Paul also said and we talked about earlier, we're going to judge them one day. Right. So again, this intercession is not only is it not in place of right, it's in addition to, right, I ask someone to pray for me while I also pray. Right. And the someone I ask to pray for me can be anyone who's alive, which includes the saints, right?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6233.66,"end":6234.14,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6234.14,"end":6271.59,"speaker":"Fr Stephen De Young","text":"And angels. That's. Is it necessary? Okay, we're not saying necessary. Here's that efficiency thing. Rearing its ugly head again. I've used that. Rearing its ugly head. Rearing its hoary head again. Gotta vary it up a little. Right? That, that. And no one is saying that. Right. We all understand this. We all understand that. Like, you don't convince God by reaching a certain number of people praying for something."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6271.99,"end":6273.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6273.75,"end":6355.9,"speaker":"Fr Stephen De Young","text":"Right. Like we had one too few Facebook likes. So the kid died. Right. We know that doesn't happen. Right. God's not like, counting. Okay, well, we've got 87 people praying for this now. If it hits 100, I guess I'll do it. Right. Like, that's not how this works. Right. None of us thinks that you're going to, like, convince God by getting someone important or influential or a particular saint to pray for you. Okay. Like, well, if I could just get, you know, the Patriarch of Constantinople to pray for this for me or celebrity pastor or whomever. Right. I think has God's favor this week or St. Oxentius to. If I could just get them to pray for this, then God will do it. Right? We don't think that. Right. None of us think that. Right. Hopefully it's an expression of love for one another. It's an expression of love. It's a communion with each other. Right. My parishes pray for each other. Right. Not because they think that, oh, well, you know, if they just pray themselves, God won't do it. But if we all pray, then God will. We don't think that."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6356.7,"end":6357.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6357.74,"end":6365.83,"speaker":"Fr Stephen De Young","text":"But that coming together and praying for each other and praying for the same things together is an expression of our love for each other."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6367.19,"end":6367.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6368.23,"end":6470.8,"speaker":"Fr Stephen De Young","text":"In fact, praying for someone really, sincerely praying for someone with some effort is one of the highest forms of love for that person. There's been this demeaning lately of, you know, thoughts and prayers and demean thoughts all you want. Like, sure, you know, you were always on my mind, you know, nice Willie Nelson song, but who cares, Right. Just, you know, thinking it makes you cry at the, you know, animal shelter commercial. But anyway, right. So. So no, prayers do have values for the highest forms of love. But it is also true, some of the pushback against that thoughts and prayers thing does have a correct point in that that doesn't replace other forms of love. Right. Oh, this person needs help. Right. This person needs a ride to the emergency room. I'm going to pray for him. I'm going to pray for him real hard tonight. That someone helps them. Right. No, obviously. Right. You also help the person. Right. Again, there's no reason to separate those two things. Right. Oh, I don't just pray about things. I actually go and do them and help people and make them happen. Or on the other side. Well, I pray for people. That's the most important. No, you do both. Por que de los dos? But actual intercessory prayer for someone is a beautiful expression of your love for them and will change how you view them and will change your relationship with them."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6472.24,"end":6473.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6473.84,"end":6476.24,"speaker":"Fr Stephen De Young","text":"Won't necessarily get God to do what you want?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6476.48,"end":6476.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6476.84,"end":6479.04,"speaker":"Fr Stephen De Young","text":"I mean, that's not what prayer is anyway, Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6479.2,"end":6502.98,"speaker":"Fr Andrew Stephen Damick","text":"I mean, one of the things I tell people a lot is especially if they're having a relationship problem with somebody, which, I mean, that's a lot of what confession is about. Right. Is, you know, are you earnestly, consistently praying for that person? Because if you're not, then you're like cutting your legs out from underneath yourself. You know, it's not gonna get better. Probably."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6504.66,"end":6518.5,"speaker":"Fr Stephen De Young","text":"Yep. So in summary of the last two episodes, what has all this been about? Where has all this been going? Kind of nowhere, but I'm gonna try and put a bow on it anyway."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6519.56,"end":6520.2,"speaker":"Fr Andrew Stephen Damick","text":"What's all this?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6521.16,"end":6534.84,"speaker":"Fr Stephen De Young","text":"What's all this then? And that's if we take all these things we've been talking about in the last two episodes and think about what does it mean for angels and demons to fight."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6535.64,"end":6556.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We actually got a question in the Facebook group. I think it just came in through this morning, actually. Someone was saying that they had heard this idea that when natural disasters happen, you know, that earthquakes or big storms or hurricanes, whatever, that that's war in the heavenly realms, you know, Titan."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6556.64,"end":6558.72,"speaker":"Fr Stephen De Young","text":"I thought thunder was angels bowling, but."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6563.68,"end":6566.48,"speaker":"Fr Andrew Stephen Damick","text":"We should have an episode titled Angels bowling. That's an idea."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6566.8,"end":6598.58,"speaker":"Fr Stephen De Young","text":"There we go. So, yeah, so sorry. Frank Peretti fans, he had the sort of Highlander version of. Of angel demon fights, right? Lots of big, heavy sword swinging and trying to decapitate each other. Because there could be only one, which is cool. I mean, cool."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6598.58,"end":6601.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, but who wants to live forever?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6601.78,"end":6613.7,"speaker":"Fr Stephen De Young","text":"Fun read. But, yeah. And Harry, your Cavill, you can't do everything, man. But again, not what we're. Not what we're talking about."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6614.18,"end":6614.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6618.42,"end":6689.99,"speaker":"Fr Stephen De Young","text":"What we're talking about, honestly, right, Is what we've been talking about with the world of thoughts, right? The battle is really the battle for the mind. The battle is about what thoughts am I going to nurture and turn into ideas and what kind of ideas am I going to come up with and how am I going to try and implement them and use them in the world and what am I going to bring about? What direction am I going to go, right? Because the whole game for the demonic, whether we're talking about the devil himself or demons or whatever kind of demons or whatever that we talked about last episode, the whole end game for them is to destroy as much of humanity as they possibly can, right? Because as we talked about early on when we were talking about the fall of Satan in our very early episodes, right, the fall of the devil, this whole Miltonian thing of, oh, he's going to overthrow God and make himself God. And I'm like, oh, okay, what's step one to do that?"}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6690.15,"end":6690.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6691.75,"end":6693.27,"speaker":"Fr Stephen De Young","text":"You can't do. That's not a thing."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6693.59,"end":6694.87,"speaker":"Fr Andrew Stephen Damick","text":"This is not paganism."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6695.51,"end":6768.46,"speaker":"Fr Stephen De Young","text":"There's not a way to do that. Right. It's not like God has God powers that you can seize with a cosmic siphon or something. That's Galactus and Dr. Doom. Right. Totally different thing. Right. That's not how any of this works. Right. You can't do that. The devil can't do that. Right. The devil fell out of envy, envy of humanity. He can try and destroy humanity. He can try to destroy humans who God loves. That's his shot. Right. And a great part of the story of scripture is that the lengths that God goes to, to redeem and save humanity from that fate. So the battlefield between angels and demons is your mind, your heart, your thoughts. That's where spiritual warfare is happening. It's in terms of sin. It's in terms of your enslavement or your freedom regarding sin. It's in terms of how much you will yield to the demons or how much you will align your will and your work in the world with God."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6769.1,"end":6769.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6769.42,"end":6821.95,"speaker":"Fr Stephen De Young","text":"All of these things we've been talking about, this is what spiritual warfare is. This is where angels and demons are fighting. This is where you have to pick which side you're going to follow. Right. And the stakes are whether you live eternally or you perish. That's honestly it. And so in that regard, talking about demons in the last episode and angels in this episode, it's like Deuteronomy, right? Here is life and death, blessings and curses. Each of us has a choice to make, not just once, but over and over again through our lives as to which. Which one of those directions we're going to go and which of those we're going to receive. And those are pretty much my final thoughts."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":6822.35,"end":7051.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh, see what I did there? That's great. I will add just a little bit. Yeah. I think, you know, in. In one of the things that's, that's said a lot these days and I think is true, I mean, based on my, my personal experiences with people, is that there is a growing sense of isolation and loneliness. And I'm not going to draw a straight dotted line from that back to this kind of flattening of the spiritual world that happens with the Reformation, where all the angels and saints are kind of pushed off to the side and it's just God up there. And then Us directly underneath him. But I do think that that theological outlook isn't helping and maybe is the context for some of this sense of isolation. You know, we've said since 2020 on this show that it's a crowded spiritual world. It's crowded out there. There's this whole, well, as scripture says, great cloud of witnesses, right? The angels, the saints who are present with us all the time. This is why someone like St. Anthony the Great or the other hermits and anchorites and ascetics, they go off to be alone. And indeed, you know the Greek word for them, Mona Chos, you know, monk, it refers to being alone. But they actually have a very strong sense of not being alone. So they're alone as far as the world is concerned, but they're not really alone because they are engaging with the spiritual world, the noetic world, to use the technical term. And so I, I believe very much that one of the things that can help us in this time of isolation and loneliness is to renew our sense, or maybe for many of us, begin having a sense of this, this crowded spiritual world, to engage with the angels and the saints by asking for their prayers, by asking for their help. And again, it's not instead of God, it's. It's in addition to your prayers to God. As Orthodox Christians, if you were to, like, add up all of the prayers that we say in terms of, like our private prayer, our liturgical prayers, or whatever the vast majority of them are, are directed, you know, directly towards God himself, Father, Son and Holy Spirit. And then we also have our prayers to the saints, to the angels, right? Just like for most Christians, the vast majority of your prayer is to God directly. And you also ask for your friends to pray for you. When you ask for something, by the way, that is literally what prayer is. I mean, that's just what the English word prayer means in its most basic sense. And so it's for our spiritual health and in many cases, for our mental health, connecting with this larger community, the community in Christ that is both the seen and the unseen at the same time. I think it's just absolutely so, so vital for us. So that wraps up this episode of the Lord of Spirits podcast. Thank you very much for listening. Listening, everybody. This was not a live episode. We didn't. We pre recorded it, so we didn't take any calls. But we'd like to hear from you. You can email us at lordofspirits ancient faith dot com. You can message us at our Facebook page. You can leave us a voicemail@speakpipe.com lordofspirits and if you have basic questions about Orthodox Christianity or you need help in finding a parish, because that's critical, head over to orthodoxintro.org and join us for."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":7051.05,"end":7060.01,"speaker":"Fr Stephen De Young","text":"Our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. It's fine. It's cool. You can say that we're nothing, but you know the truth."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":7060.97,"end":7071.21,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, you can join our discussion group Super Active. Leave reviews and ratings everywhere and share this show with a friend or family member."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":7072.01,"end":7082.01,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com stroke support and help make sure we and lots of other ancient AFR podcasters stay on the air. I guess I'm the fool with her arms out like an angel through the car sunroof."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":7083.45,"end":7085.85,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you all."}
{"episode_id":"LOS - #111 - 2025-02-26 - Your Skin Makes Me Cry","start":7089.13,"end":7126.42,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
