{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":0.4,"end":65.05,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":68.17,"end":142.69,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, voice of Steve. Well, it's Goat Week on the Lord of Spirits podcast. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And joining me tonight is my co Host, Father Stephen DeYoung from Lafayette, Louisiana. And if you're listening to us live, you can call in at 8:55, AF radio. That's 8, 5. And we will get to your calls in the second part of today's show. Well, like I said, it is goat week. And here at Goat Week, we've got you covered. And the rest of the show will be explaining that joke. So tonight we're wrapping up this three part series on sacrifice by talking about atonement. It's a word that is core to our understanding of Christianity and yet there are about as many theories of atonement as there are Christian groups. But where did this word come from? What does it mean? What is being atoned for? Do Orthodox Christians have any teaching on atonement? Well, again, we've got you covered and no, I will not get tired of that joke. But first, and this is where the English language nerd in me comes leaping out. Let's talk about this English word, atonement. Okay, so Father Stephen, where is that word from? Name that word."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":143.57,"end":145.34,"speaker":"Fr Stephen De Young","text":"It's made up."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":145.74,"end":146.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":147.02,"end":153.74,"speaker":"Fr Stephen De Young","text":"Not just in the way that all words are made up. Right. It's very deliberately made up."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":154.46,"end":154.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":155.26,"end":164.54,"speaker":"Fr Stephen De Young","text":"Very deliberately invented to describe something that there wasn't really another good word in the English language for."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":164.78,"end":192.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was created for English Bibles to translate a couple of words, one from Hebrew, one from Greek. And what's, what's fun about it is. It actually is. So, you know, sometimes it gets explained as at one meant and that is correct. Like that is not a false etymology. Although usually etymologies that go like that are like, they're just, they're just nonsense."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":192.71,"end":195.27,"speaker":"Fr Stephen De Young","text":"Butterflies aren't hurled dairy products."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":195.92,"end":336.31,"speaker":"Fr Andrew Stephen Damick","text":"They are not. They are not. And most people who have breakfast are not breaking a fast. But. Right, so atonement at 1 ment. I looked this up. So I have on my desk a gigantic dictionary called the Oxford English Dictionary. For those of you who know what that is, you know who you are, and I looked this up. What is the earliest use of this word? And it turns out that before it ever got into the Bible, there was occasionally this contraction of the word at and the word one. So you get at one, you know, or however it would have been pronounced back in like the 14th century. And then. So, so Wycliffe, who, who translates the very earliest English Bible? Well, I should say the, the very earliest complete English Bible because, you know, tip of the hat to Alfred the Great for translating portions of the Gospels into Old English. But he, he does his complete English Bible and he uses that phrase to one or one meant. And then even one point he uses at one. Right? And then it was in the 16th century in the Tyndale Bible in 1526, that he actually standardizes this word to create this new word atone for both as both a verb and also a noun. So you get that at one meant atone comes into being as an English word specifically for translation of the Bible. And so that's the idea that they meant at the time was, you know, putting man and God together at one. That was the intention. So now we're going to talk about how, number one, they actually didn't quite get it right. But what is the concept that that word is attempting to point to? What are the actual original words? Right. So, you know, in the Orthodox Church, Greek is kind of our base language for theology and liturgy and so forth. So where does that word, what is the word, the Greek word that's translated by atone or atonement, and where does that actually first show up?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":336.79,"end":405.26,"speaker":"Fr Stephen De Young","text":"Yeah, so this gets sort of double interesting because not only do we have the made up English word, right, that is primarily reflecting, as you just described, an English concept more than it is trying to reflect an original word. The reason for that is that the Greek word ilasthyreion doesn't occur anywhere that we still possess until Jewish folks start using it meaning the Greek Old Testament, and then works Like Philo Josephus, et cetera. There are sort of a handful, I think four or five uses of it in the first century AD and later. And, like, half of those are by Plutarch, by one author. But all of the earliest usages are of that word in this context having anything to do with this. Are Jewish writers using it to translate the Hebrew concept?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":405.9,"end":406.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":406.86,"end":413.66,"speaker":"Fr Stephen De Young","text":"Which. Which partially explains why when the English translators got to the Greek word, they didn't really know what to do with it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":413.98,"end":428.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, Because. Yeah, right. So they just kind of perpetuated what had been done before. Like. Well, they. There is no context for this. What do we think this means in context?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":428.46,"end":470.84,"speaker":"Fr Stephen De Young","text":"Right. Through theology that had developed in Latin, they had an idea of what that was supposed to mean. Right. Or what it had come to mean theologically. And so they were really translating that. So you have to go back past. Past the Greek a little bit. And by the way, those. Those handful of later Greek usages seem to be based on the Jewish use of it. Meaning it's used in contexts where someone is making some kind of offering to a supernatural being, to a spiritual being. And I say spiritual being because it includes, in a couple cases, it's gods, and in a couple cases, it's dead people."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":471.24,"end":471.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":472.04,"end":521.77,"speaker":"Fr Stephen De Young","text":"It's of. Of deceased people where there has been some issue between them and a living person. And so some sort of offering is made to mend a peace offering. Right. To mend that relationship. But so if we go back then to the Semitic root that's behind all this, you end up with what are called kefir verbs, Semitic words, Semitic lexems have what are called triliteral roots, meaning they're based on three consonants. And you give the. Give the verb meaning, or the noun meaning, by the way, it's inflected, meaning literally the way it's pronounced, because they didn't write the vowels at all."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":522.09,"end":536.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And most Semitic languages work this way. So, you know, if any of our listeners are Arabic speakers, which I know some are, you know, it's. Again, those three consonants make up pretty much every word in Arabic."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":536.82,"end":556.45,"speaker":"Fr Stephen De Young","text":"Right. And then you could add prefixes and suffixes and that kind of thing, but you have a root that is. That is three letters. And so the kefirot is usually transliterated as KFR is a group of words that primarily means to cover the verb forms."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":556.93,"end":562.69,"speaker":"Fr Andrew Stephen Damick","text":"So it's not like the Slavic word that has to do with a gross tasting, bubbling beverage."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":563.09,"end":564.85,"speaker":"Fr Stephen De Young","text":"No, it has nothing to do with that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":564.85,"end":565.73,"speaker":"Fr Andrew Stephen Damick","text":"Nothing, Nothing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":566.61,"end":569.49,"speaker":"Fr Stephen De Young","text":"Nothing to do as far as I know, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":570.29,"end":580.37,"speaker":"Fr Andrew Stephen Damick","text":"Actually, we looked this up and we could find no link, but who knows? Richard Roland, I'm going to give you this job. So look this up, Richard. He's our staff philologist."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":580.53,"end":588.67,"speaker":"Fr Stephen De Young","text":"Maybe it was once used to cover something. I don't know. To cover the taste of bad food. I don't know. But."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":590.75,"end":593.79,"speaker":"Fr Andrew Stephen Damick","text":"So nothing against you kefir drinkers. Sorry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":593.95,"end":602.23,"speaker":"Fr Stephen De Young","text":"No, no, no, no. Enjoy what you like. Some people like New Coke, you know, which now, it turns out was all a conspiracy, but I won't."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":602.23,"end":606.11,"speaker":"Fr Andrew Stephen Damick","text":"It was here that was. Wow, we're really dating ourselves with that reference."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":606.11,"end":647.9,"speaker":"Fr Stephen De Young","text":"Yeah. So the sort of subsidiary meanings of COVID then if definition number one of kefa verbs is cover, then your secondary ones would be like wipe or smear if you're covering something with something else. Right. If you're gonna cover your roof with pitch or what have you, Right. You would wipe it or smear it in order to cover it. Cover a wall with paint. Right. And so then logically enough, when you find this in its noun form, right, these same roots are used for both verbs and nouns and also for adjectives."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":648.06,"end":648.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":650.7,"end":655.98,"speaker":"Fr Stephen De Young","text":"When it's a noun, it means a cover or a covering, like a lid. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":655.98,"end":657.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. At the top."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":657.82,"end":664.94,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Which brings it to, you know, I give and I take away. And I gave you your oed."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":665.74,"end":666.38,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":666.38,"end":668.78,"speaker":"Fr Stephen De Young","text":"And now I'm going to take away your kjv."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":670.62,"end":671.26,"speaker":"Fr Andrew Stephen Damick","text":"Brutal."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":672.3,"end":678.5,"speaker":"Fr Stephen De Young","text":"Yes. I think that's a net loss to you, frankly. Yeah, probably."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":678.5,"end":689.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I will say I acknowledge the King James Bible has some errors in it, translation errors, and we just lost all of our KJV only listeners."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":689.82,"end":705.5,"speaker":"Fr Stephen De Young","text":"The one just Baptists across the south have just, you know, retuned their car radios away from AFR and are listening to that Mexican radio station that used to come through on my microphone."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":705.66,"end":723.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So, right, so here's the thing, right, that. That the King James Bible, translate, Translates this word when it's used for. In the noun form. Right. When it's used for the thing that is on the top of the Ark of the Covenant as mercy seat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":723.68,"end":724.16,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":724.32,"end":727.84,"speaker":"Fr Andrew Stephen Damick","text":"Which is lovely. You know, like, it's lovely. It's a very nice idea."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":728.72,"end":729.2,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":729.52,"end":731.36,"speaker":"Fr Andrew Stephen Damick","text":"But completely wrong."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":731.6,"end":741.04,"speaker":"Fr Stephen De Young","text":"And you see it in. You'll see it in even orthodox translations because a lot of our early orthodox translations were either utilizing or aping the King James Version."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":741.2,"end":741.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":741.68,"end":791.72,"speaker":"Fr Stephen De Young","text":"Language. And so you could kind of see how you get there, like if you go from a very developed theological idea, right, where you don't really know what the Hebrew word means. And so you're thinking, well, okay, God is enthroned behind the Ark of the Covenant. Right. Between the cherubim and the Ark of the Covenant is his footstool. So there's like a throne involved there. And we're thinking of atonement as at one men and peace and mercy. So you come up with this mercy seat thing. Yeah, but the much simpler way to read it is just. It means cover. So it's talking about the COVID the lid of the Ark of the Covenant that has the cherubim on it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":791.72,"end":798.8,"speaker":"Fr Andrew Stephen Damick","text":"Alas, Another. Another fun thing from Sunday School ruined by father Stephen DeYoung."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":799.2,"end":802.19,"speaker":"Fr Stephen De Young","text":"So that was kind of over translated. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":802.27,"end":802.83,"speaker":"Fr Andrew Stephen Damick","text":"That was."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":803.15,"end":816.03,"speaker":"Fr Stephen De Young","text":"A lot of more advanced theological concepts were packed back into the word cover. In light of this, though, I would like to propose that from now on, we refer to cover bands."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":816.43,"end":817.07,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":817.07,"end":823.95,"speaker":"Fr Stephen De Young","text":"Like. Like Brass against and Cybertronic Spree. We refer to cover bands as Atonement bands. Yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":824.99,"end":826.51,"speaker":"Fr Andrew Stephen Damick","text":"I'm in order."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":826.67,"end":830.27,"speaker":"Fr Stephen De Young","text":"Or even Mercy Seat bands if we want to be really old school. That's right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":830.59,"end":834.49,"speaker":"Fr Andrew Stephen Damick","text":"You could just call your band Mercy Seat and like. Well, we're a cover band, like the title says."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":834.57,"end":845.69,"speaker":"Fr Stephen De Young","text":"That would be like an inception. Yeah. So. Yeah. So that. That's. That's the word itself."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":846.09,"end":846.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":848.65,"end":910.94,"speaker":"Fr Stephen De Young","text":"It's. It's important to cover that because reading a lot of things back into that word did not stop with the King James translator doing their best and sort of didn't know any better. It is very common for all kinds of, shall we say, advanced theological ideas that have come into being over time through a long history of development to all be read back into, usually the Greek word in the New Testament in a study. Because. Because of this sort of schism in the way we bizarrely separate scholarship of the New Testament from the Old Testament. Right. So Greek words in the New Testament are treated as these sort of independent entities without reference to what they're. They're translating. And then that allows you to pack a whole bunch of things in. But we'll. We'll see more of that as. As we go on."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":910.94,"end":912.34,"speaker":"Fr Andrew Stephen Damick","text":"But as we go. Yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":912.34,"end":924.67,"speaker":"Fr Stephen De Young","text":"To reiterate here that. That this is not, in its biblical usage, any kind of specialized technical theological term."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":925.23,"end":926.59,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":927.23,"end":942.77,"speaker":"Fr Stephen De Young","text":"This is just. In Hebrew especially, it's just the word that means what it says that, you know, means cover. And the. The Greek word that's being used is being used to pick up that meaning within a ritual context."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":943.57,"end":944.21,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":944.29,"end":944.69,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":945.33,"end":1000.9,"speaker":"Fr Andrew Stephen Damick","text":"So. All right, so speaking of that ritual context, then the Rest of what we're going to be talking about is the ritual of atonement, the day of atonement. So in Hebrew, that's Yom Kippur. Right. Which is this annual commemoration that's made by the people of God in ancient Israel. And you know, but it's in addition. Right. To the regular sin offerings that are being done every day. So, I mean, like, why does this need to be added on? I mean, don't the daily offerings cover it? Sorry, I will not get tired. I will not. Yeah, don't the daily offerings cover it? Yeah. So why, what do we need this for? Right. If. I mean, we're doing daily offerings, you know, for sin in ancient Israel. What's the deal with this super big day of offering, you know?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1001.54,"end":1008.34,"speaker":"Fr Stephen De Young","text":"Right. And, and as a quick note, because you said it quickly, Yom Kippur, the Kapoor comes from Keffer."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1008.42,"end":1010.1,"speaker":"Fr Andrew Stephen Damick","text":"There you go. The day."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1010.1,"end":1073.33,"speaker":"Fr Stephen De Young","text":"That's the COVID Yeah. When. When a pay gets doubled, it gets pronounced like a P instead of an F. Oh, God. It's usually written with two P's. So, yeah, it's literally the day of. It's literally the day of covering is. Is very little. And. And if you read a lot of recent Old Testament scholarship because of how loaded the word atonement has become, they try to call it something else. It's never going to catch on. Like, no one's going to call it the day of purgation. Right. Like, it just doesn't have a ring to it. So Toad is here to stay. But yeah, so we have, we talk as we talked about last time. The sin offerings that are being offered every day are not transactional. Right, right, right. It's not like the priests are sitting there waiting. You know, like I get to the end of vespers and sit and wait to see if anybody's going to come to confession. They weren't like that. Right. They were sitting there with the knife and, you know, keep the fire going in the burn offering altar because somebody might show up with them."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1073.41,"end":1077.37,"speaker":"Fr Andrew Stephen Damick","text":"Someone comes in. So what did you do, pal? Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1077.37,"end":1080.25,"speaker":"Fr Stephen De Young","text":"I hope you've got a pigeon, a lamb and a young."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1080.33,"end":1090.65,"speaker":"Fr Andrew Stephen Damick","text":"Which is not the way confession works either, by the way, in case anyone's thinking that, like. Wait, what? Yeah, no, it does. No, in fact, there's a wonderful parallel actually in some ways between these things."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1091.13,"end":1097.13,"speaker":"Fr Stephen De Young","text":"Yeah, right. And you especially don't need to bring any livestock to the church. Let's be clear on that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1097.29,"end":1098.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes, please."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1098.33,"end":1101.61,"speaker":"Fr Stephen De Young","text":"In fact, it's canonically forbidden to bring Livestock into the church."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1103.02,"end":1103.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1104.7,"end":1135.88,"speaker":"Fr Stephen De Young","text":"So this isn't transactional. So it's not an issue of like, oh, well, maybe there were some sins that got missed during the year. So we're gonna do this sort of catch all Day of Atonement, like, to pick up those ones that were missed. Those were being done perpetually to cover all of the sinning that was going on that everyone knew was going on in Israel. So when we look at the Day of Atonement, we have to start with the fact that it is doing something different than the sin offerings are doing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1136.36,"end":1174.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because there is not just the problem of the sins of the people. Right. There's the effect that those sins have on not just the people. Right. And I think this is. And this is a great thing for us to mention, especially here, because our next couple of episodes are going to be on sacred geography. So we're going to be talking. Talking about space in particular. There's an effect on the space on the place. Sin messes up the place where you are. Right. So that's what this is about. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1174.9,"end":1200.13,"speaker":"Fr Stephen De Young","text":"Ed, briefly, since you brought up the next two episodes about geography, I know Maps is going to end up on the playlist, so let's make sure it's the yeah, yeah yeahs and not Maroon 5 special request. You know who you are. So. Right. So it has to do with when the ritual is Described in Leviticus 16. I know everyone knew that off the top of their head because."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1200.13,"end":1200.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1200.61,"end":1202.61,"speaker":"Fr Stephen De Young","text":"I mean, people just keep read Leviticus."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1202.93,"end":1206.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's like everyone's evening devotional reading."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1206.17,"end":1240.41,"speaker":"Fr Stephen De Young","text":"Right there on the tip of everyone's tongue at all times is the structure of Leviticus, but It's in Leviticus 16. And the purpose of it, we often think of it in terms of, well, this is atoning for people or for Israel and the bad stuff they did. Right. But the. The ritual is explicitly stated to be atoning for the altar of incense, atoning for the Ark of the Covenant, atoning for the space within the tabernacle."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1240.83,"end":1298.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which makes no sense. If you think atone means like, make up for or pay off or, you know, whatever, or kind of some kind of satisfaction theology. Like, what did the altar do that it has to atone? Yeah, yeah, right. Like the altar has to be reconciled to God, you know, like. Like it makes no sense. But if we understand it as. As covering and, you know, which is. Which is the perfect word because we're about to talk about what this actually does. But the concept is based on this idea that There is sacred space that has been set aside and for the holiness of God to be presence present there with the people. But that the people's sins interfere with that. Right. That they actually stain the place and."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1299.09,"end":1307.37,"speaker":"Fr Stephen De Young","text":"Sin leaves a taint. Yeah, yeah, we've talked about that. There's kind of an anti theosis. Right, that happens."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1307.37,"end":1307.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1307.81,"end":1336.02,"speaker":"Fr Stephen De Young","text":"Demonosis, through our sin, where that actually changes us. And it not only leaves that residue and that taint within us, but within the people around us and in the, The. The actual physical creation itself. And so when the tabernacle is first consecrated, all of those objects are built, so they're. They're taken out of the world. Right. It's not like magic wood that they went and found in the enchanted forest."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1336.1,"end":1336.5,"speaker":"Fr Photius","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1336.98,"end":1337.7,"speaker":"Fr Stephen De Young","text":"It's not."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1338.5,"end":1342.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that would have been a great quest line. Sorry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1342.5,"end":1368.54,"speaker":"Fr Stephen De Young","text":"It's not. And it's not, you know, some kind of sacred gold mined from the holy mountain. It's just regular. I mean, the, the, the tent covering of the tabernacle was made from goat hair. Okay. These weren't special magic goats. So it's just these common things that they had in the camp. But then they're taken and they're consecrated and they're set aside."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1368.86,"end":1369.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1369.26,"end":1381.99,"speaker":"Fr Stephen De Young","text":"By being sprinkled with blood. And then through the sinning that's going on around them and even within them, they develop this taint where they're made common again."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1382.87,"end":1446.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And there's this, this, this distinction then that is made. I mean, this comes into the creation, Right. Where you've got the whole sort of world of chaos versus the, the ordered space that God sets up. Right. So, you know, at the beginning, that's, that's Eden or paradise, but then everything outside of it in comparison. Right. And then you just said the camp, and then there's the wilderness out there. Right. But then. And then when, when eventually Israel makes its way to the promised land, it's Israel. And then the nations are out there. So there's this, you know, this orderly, beautiful, purified, sacred space where God dwells with his people. And then chaos is what's on the outside. And so sin brings the chaos in, or it. Or you could say turns what has been made. Orderly and beautiful, chaotic again. You know, it's sort of spiritual entropy, so to speak. You know."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1448.61,"end":1449.01,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1449.33,"end":1450.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so this is about that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1451.03,"end":1456.07,"speaker":"Fr Stephen De Young","text":"And it's. And it's not just sort of chaos in the sense of disorder."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1456.39,"end":1457.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1457.19,"end":1502.75,"speaker":"Fr Stephen De Young","text":"Right. This, this is corruption and evil, and this corruption means. And brings these things under the power of the hostile power. Hostile powers that, that dwell out in the wilderness or that rule over the nations. Right. That, that are at work outside, they come into that power in the same way that our sin brings us under the power, brings us into bondage under those, those hostile powers. And so it intrudes, right. Into, into the camp or into Israel or into, you know, sort of a renewed antitypal Eden."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1503.86,"end":1504.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1505.54,"end":1530.34,"speaker":"Fr Stephen De Young","text":"And so the, that space we talked last time when we were talking about the other offerings, about this idea that they're sort of concentric circles. Yeah, right. And, and that the closer you get to where God is dwelling. Right, so God is dwelling in the holy of holies, in the tabernacle. So that is the place where the threat is. Most of this corruption is most dire."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1531.16,"end":1531.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1531.56,"end":1568,"speaker":"Fr Stephen De Young","text":"Right. And then as you go out to the holy place and then to where the Levites are dwelling. Right. The Levites and the priests have to maintain this higher level of discipline and holiness. And then you get to the Israelites who have to do this even higher level or this higher level than the nations. So the place where it's the most threat inside the sanctuary, that's the place that the Day of Atonement is concerned and focused on purifying and cleansing from this taint. That is the place where it is most key that this happens within the sanctuary."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1568.72,"end":1580.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. All right, so, so then what is the actual ritual itself look like? How does that begin? Right, so annual thing. So it must be a really big deal."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1580.48,"end":1588.4,"speaker":"Fr Stephen De Young","text":"Right, right. So that we have, we have again in Leviticus 16, a fair amount of detail."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1589.36,"end":1589.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1589.84,"end":1617.61,"speaker":"Fr Stephen De Young","text":"Describing exactly what's going on. So it starts with, as we talked about last time, the idea of sin offerings. It starts with a sin offering by the high priest and his immediate sons who are going to be serving with him. It's the high priest and only the high priest and only on this day who is going to actually go into what we now call the Holy of Holies or the sanctum sanctorum."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1617.93,"end":1618.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1618.29,"end":1658.93,"speaker":"Fr Stephen De Young","text":"You're a doctor Strange fan to go actually go in there to purify that space. And so to prepare for that, he has to offer a special sin offering for himself because he needs to be, because he's going to go all the way in. He has to be at this state of purity and holiness that is, that is unsurpassed. And people may have heard of that. The, the mostly later tradition where they tie a rope to the person, to the high priest in case he wasn't so pure and he dropped dead and they had to."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1658.93,"end":1661.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. That's not in there, right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1661.85,"end":1663.61,"speaker":"Fr Stephen De Young","text":"Right, yeah, that's not actually in there."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1663.77,"end":1671.37,"speaker":"Fr Andrew Stephen Damick","text":"I know. That was another thing that I was disappointed to discover was actually not in the Bible. I'm like, the rope thing is awesome."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1671.37,"end":1676.05,"speaker":"Fr Stephen De Young","text":"Why is that so? Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1676.05,"end":1678.65,"speaker":"Fr Andrew Stephen Damick","text":"All this disillusioning, it makes you wonder."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1678.65,"end":1689.25,"speaker":"Fr Stephen De Young","text":"If that was a practicality, like if a high priest dropped dead at some point and everybody was kind of like, well, what do we do? And how do we prevent this from happening in the future? Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1689.25,"end":1692.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, how do they fish. Fish him out? Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1696.6,"end":1719.48,"speaker":"Fr Stephen De Young","text":"But so he does this sin offering, and then sort of the Day of Atonement ritual proper begins. And so the first covering that happens is the reason this is done on this day, as we mentioned in one of the previous episodes, is that this is the day that Yahweh chose to appear visibly in the holy of holies."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1719.88,"end":1720.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1721.08,"end":1728.74,"speaker":"Fr Stephen De Young","text":"And so all of this is being done on this day because of his appearance. That's why this is the day when everything has to be purified."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1729.14,"end":1735.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's why it's a response. He's coming. We have to. We have to get ready."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1735.66,"end":1751.38,"speaker":"Fr Stephen De Young","text":"Right. We have to have it perfect because he's going to appear. And if he appears and it's imperfect, then this is going to get bad for us, for Israel. Not because God's going to get angry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1752.7,"end":1752.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1752.86,"end":1773.74,"speaker":"Fr Stephen De Young","text":"It's not like I said, no green M M's, Right. It's. It's because. It's because of his holiness and his purity. Right. That is dangerous to sinful people, to sinful humanity. And he, God, does not want his people, when he comes to visit them, to be destroyed with their sins."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1774.22,"end":1774.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1775.02,"end":1795.88,"speaker":"Fr Stephen De Young","text":"He wants them to repent of those sins and to be purified by his coming. Yeah. Yeah. So the first thing the high priest has to do is he has to. In order to prepare to enter the space, he has to offer a whole ton of incense. Yeah. Not a little. Not one scoop."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1796.52,"end":1796.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1797.64,"end":1808.17,"speaker":"Fr Stephen De Young","text":"Doesn't matter if someone in the back was complaining. Doesn't matter about fake coughing. He had to do a lot of incense because the incense was covering. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1808.17,"end":1808.77,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1809.09,"end":1813.73,"speaker":"Fr Stephen De Young","text":"Making this cloud so that he wouldn't actually see Yahweh when he appeared."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1814.29,"end":1816.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's this veiling that happens."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1816.29,"end":1822.53,"speaker":"Fr Stephen De Young","text":"Right. Because if he saw him directly, he die. And again, this is all about not dying. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1822.61,"end":1823.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1824.85,"end":1830.65,"speaker":"Fr Stephen De Young","text":"So that's sort of the first covering that takes place is through that incense offering."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1831.52,"end":1836.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And then. And here's the part everyone's waiting for the goats."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1836.96,"end":1838.36,"speaker":"Fr Stephen De Young","text":"The goats, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1838.36,"end":1870.68,"speaker":"Fr Andrew Stephen Damick","text":"So you have two goats. I. I heard. You know, I was like. I was like. I. I suddenly remember that joke, you know, that goes around on Facebook. You know, you have two cows and then it has all this list of economic systems. I'm like, oh, yes, it's. You have two goats, see? Yeah. And now there's gonna be all these rumors. Like, see, they're. They're claiming some kind of, you know, economic theory of atonement here. Yeah. No, so there's two goats, right? I mean, is a good. Good goat and a bad goat, Is it? Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1870.76,"end":1872.48,"speaker":"Fr Stephen De Young","text":"Three Billy Goats gruff. Is it?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1872.48,"end":1880.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. No, they've got to both be great. They have to be the best goats. Both of them are the best goats."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1880.4,"end":1883.48,"speaker":"Fr Stephen De Young","text":"They have to be goat goats. They have to be the greatest goats of all time."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1883.64,"end":1885.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the goatiest. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1887.36,"end":1897.52,"speaker":"Fr Stephen De Young","text":"So, yeah, both of them have to be perfect and unblemished because they're going to be used for two different purposes. But which one is used for which purpose is decided by lot."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1898.24,"end":1901.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which means it's just a random toss, basically."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1901.4,"end":1920.3,"speaker":"Fr Stephen De Young","text":"Yeah. They're gonna. They're gonna cast lots and one's gonna go for one person, one's gonna go for the other. So that means the one that's going to be used for the more positive and holy purpose. Right. Has to be pure, unblemished, no broken bones, not a runt, etc. Yeah. But since it could be either, they both have to be that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1920.94,"end":1921.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1921.58,"end":1930.78,"speaker":"Fr Stephen De Young","text":"Right. And so when the lots are cast, one of these two goats is designated as the goat for Yahweh."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1931.58,"end":1932.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1932.62,"end":1936.7,"speaker":"Fr Stephen De Young","text":"And the other goat is designated as the goat for Azazel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1937.18,"end":1944.39,"speaker":"Fr Andrew Stephen Damick","text":"There we go. There's, like, cheering going up across the country now because we mentioned Azazel, but we're going to talk about the goat for Yahweh first."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1944.79,"end":1945.27,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1945.27,"end":1945.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1946.15,"end":1962.23,"speaker":"Fr Stephen De Young","text":"But this is. This is the biblical actual Azazel. So Denzel Washington and John Goodman cannot help you. So that's a reference you probably didn't get, but you laughed anyway, I suspect now."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1962.23,"end":1962.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1962.59,"end":1968.58,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Okay. So thank you for the courtesy laugh. For the golf clap of laughter."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1968.66,"end":1969.94,"speaker":"Fr Andrew Stephen Damick","text":"I'm looking it up right now."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1972.98,"end":1978.1,"speaker":"Fr Stephen De Young","text":"So we'll start with the good goat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1978.34,"end":1984.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Just in case anyone wonders, I have not seen the film Fallen. Okay. All right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1986.18,"end":1988.26,"speaker":"Fr Stephen De Young","text":"So it's really creepy. You wouldn't like it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":1988.42,"end":2000.16,"speaker":"Fr Andrew Stephen Damick","text":"No, I'm not into that kind of thing at all. Okay. So the goat for Yahweh has to be perfect blame, you know, without blemish, pure no broken bones. What do you do with it?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2000.56,"end":2004.72,"speaker":"Fr Stephen De Young","text":"Right. Basically, you extract its blood."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2006.08,"end":2006.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2007.6,"end":2014.72,"speaker":"Fr Stephen De Young","text":"So the. The whole thing is burned. The whole goat is burned after the blood is extracted."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2015.36,"end":2020.88,"speaker":"Fr Andrew Stephen Damick","text":"So this is not. This is not a sacrifice in the meal sense that we've been talking about."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2021.18,"end":2023.18,"speaker":"Fr Stephen De Young","text":"Right. And taken outside the camp."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2024.3,"end":2024.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2024.86,"end":2046.22,"speaker":"Fr Stephen De Young","text":"Right. Now, a couple notes right there. There is literally no information. Now, this ritual, when you read Leviticus 16, there's a lot of detail here where we've already started with some of it. We're going to have more detail as we go about exactly what's to be done. There is no detail on how this goat is to be killed."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2047.75,"end":2048.15,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2048.23,"end":2054.87,"speaker":"Fr Stephen De Young","text":"The killing of this goat is not ritualized in any way. And when we feel like that could."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2054.87,"end":2057.43,"speaker":"Fr Andrew Stephen Damick","text":"Be on a T shirt, like we've."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2057.43,"end":2058.07,"speaker":"Fr Stephen De Young","text":"Said how many times?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2058.07,"end":2061.51,"speaker":"Fr Andrew Stephen Damick","text":"We said, now, the killing is not ritualized in any way."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2061.75,"end":2062.95,"speaker":"Fr Stephen De Young","text":"In any way."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2063.27,"end":2063.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2063.71,"end":2080.24,"speaker":"Fr Stephen De Young","text":"Sounds like we're FBI profilers. So we don't know how it was killed. We don't know that there were any prayers said when it was killed. No sins are put on this goat that is being killed. We'll talk about that more in a minute."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2080.4,"end":2081.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2081.52,"end":2087.36,"speaker":"Fr Stephen De Young","text":"The important thing is just you have to get the blood out of it, and one way or another, that's gonna kill the goat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2087.92,"end":2090.24,"speaker":"Fr Andrew Stephen Damick","text":"So the blood is drained, the body is burnt."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2090.64,"end":2094.32,"speaker":"Fr Stephen De Young","text":"Let me. Let me add a couple other things. The goat is not caused to suffer."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2095.44,"end":2095.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2096.64,"end":2124.75,"speaker":"Fr Stephen De Young","text":"The goat is not. This goat is not punished or abused in any way. This. Go. We don't know nothing. And in a ritual, if something is not ritualized, when you have a detailed ritual. Right. And it says, before the ritual, wash your hands, for example. Right. And it doesn't say, here's the prayer when you wash your hands. Here's the. That means the hand washing isn't ritualized. And it means. It doesn't mean anything."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2125.39,"end":2126.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2126.19,"end":2127.53,"speaker":"Fr Stephen De Young","text":"It's just a practical thing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2128.08,"end":2139.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like, you know, when we're serving liturgy, we turn the page in the book. Someone could stand there and say, he's turning the page. What does that mean when he turns three pages? Oh, man. What's that. What's happening here? You know?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2139.52,"end":2139.92,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2139.92,"end":2141.76,"speaker":"Fr Andrew Stephen Damick","text":"I just need to read this word. Sorry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2141.76,"end":2144.4,"speaker":"Fr Stephen De Young","text":"Yeah. It's a practicality. Right. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2144.4,"end":2145.04,"speaker":"Fr Andrew Stephen Damick","text":"So. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2145.2,"end":2150.4,"speaker":"Fr Stephen De Young","text":"So the death of the goat for Yahweh has no theological meaning."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2150.72,"end":2177.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And probably some people. Some people out there are probably like, why are they emphasizing this? And. And the reason is that a lot of Reformation theology kind of hangs on the idea that the goat is being punished that the goat does have. You know, but if, again, look at what it says. Look, just read the passage and you can see that that stuff is just simply not there."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2177.54,"end":2219.74,"speaker":"Fr Stephen De Young","text":"Yeah. So what's important here is just we need this blood from this goat. From this pure and blameless goat. Right? We need the blood because we're going to use the blood to do something. The blood is used. The blood is smeared, wiped, used to cover, boom, the altar, the Ark of the Covenant, the other fixtures of the tabernacle, in order to purify them, in order to remove that taint that's been left there, that's gathered there because of the sins of the people, because of the sins of the community over the course of the year to purify it again, it was dedicated with blood. Now it's purified again and made holy again with blood."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2220.3,"end":2241.37,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so a question that suddenly occurs to me is. I mean, there's a kind of a general. Now maybe I'm wrong about this, but I thought there was kind of a general rule of, you know, don't touch the Ark of the Covenant. And of course, I've seen Raiders of the Lost Ark. I know what happens if you open it. But is this like the one time you can touch it when. When this ritual is being performed, or is it just sprinkled from afar or."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2241.37,"end":2249.01,"speaker":"Fr Stephen De Young","text":"It was. It was sprinkled with the finger. So the. The high priest would have a bowl in which the blood was collected."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2249.41,"end":2249.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2250.05,"end":2265.57,"speaker":"Fr Stephen De Young","text":"And he smears it with his finger on pretty much everything but the ark. Oh, and the ark, he would dip his, like, his index finger in and then sort of whip it in order to sprinkle the blood there you go onto the. Onto the Ark itself."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2266.13,"end":2266.73,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2266.73,"end":2273.97,"speaker":"Fr Stephen De Young","text":"Yeah. And without going down the whole rabbit trail of when you can and can't touch the ark, because that's a whole separate thing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2273.97,"end":2276.53,"speaker":"Fr Andrew Stephen Damick","text":"Maybe we'll deal with that Covenant future episode."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2276.77,"end":2283.97,"speaker":"Fr Stephen De Young","text":"Yes, we'll do an Ark of the Covenant episode. Just about that. And all the Ethiopians will rejoice because they'll be like, we've got it. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2286.17,"end":2287.13,"speaker":"Fr Andrew Stephen Damick","text":"They'Ve got that covered."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2287.69,"end":2300.97,"speaker":"Fr Stephen De Young","text":"So. So that is. That is what is done with the goat for Yahweh in the ritual. That is that part of the ritual. The blood of that goat is used to purify the sanctuary, to purify sacred space."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2301.45,"end":2304.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But we have two goats."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2304.97,"end":2305.37,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2305.61,"end":2332.9,"speaker":"Fr Andrew Stephen Damick","text":"So. Right. So the other goat is for Azazel. You know, we'll say what gets done with it first, then we'll talk A little bit about Azazel. It has nothing to Denzel Washington, probably John Goodman, but yeah. So the goat for Azazel actually has sins placed upon it in contrast with the goat for Yahweh. How do you, I mean, how do you do that? How do you put sins on a goat?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2333.78,"end":2357.88,"speaker":"Fr Stephen De Young","text":"The high priest would, would place his hands on the goat on its head to designate it for this purpose. And he would. It's what it says is he would recite the sins of Israel. Now this doesn't mean, like he was Santa keeping a list all year. Like the high priest was going around spying on people, like seeing all the stuff they did and writing it down."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2358.28,"end":2361.4,"speaker":"Fr Andrew Stephen Damick","text":"So that would be a long, long list."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2361.72,"end":2369.86,"speaker":"Fr Stephen De Young","text":"Right, Right. So it was covering all of the commandments that had been broken, which was pretty much all of them. Right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2369.86,"end":2372.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just list off all the commandments you could print."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2372.46,"end":2374.78,"speaker":"Fr Stephen De Young","text":"Yeah. You could pretty safely use the same list every year."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2375.26,"end":2375.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2375.66,"end":2404.94,"speaker":"Fr Stephen De Young","text":"Because all of that had happened again. But those, those were then publicly pronounced over that goat. And now that the goat has these sins on it. Right. Has the, the t. The ontological taint. Right. From the, from the people. Right. It sort of is sort of absorbed. Right. By this goat. That goat can't be sacrificed and can't be brought anywhere near the tabernacle."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2405.42,"end":2405.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2406.22,"end":2408.86,"speaker":"Fr Stephen De Young","text":"Because now it's totally unclean."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2409.58,"end":2422.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Another, like, another super important point that the goat that gets the sins is not killed and cannot be killed as a sacrifice."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2422.84,"end":2433.32,"speaker":"Fr Stephen De Young","text":"Right. And this is the only sacrificial ritual of any kind in the Torah in which sins are placed on an animal."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2433.72,"end":2434.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2434.6,"end":2438.44,"speaker":"Fr Stephen De Young","text":"The only time it happens is this. And that animal is not sacrificed."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2438.76,"end":2439.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2439.48,"end":2448.47,"speaker":"Fr Stephen De Young","text":"I have people who don't believe me about that. But you can, you can look it up, read it. You can read for yourself. Don't trust me? Read the Torah for yourself."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2448.63,"end":2474.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know it's funny. You know, sometimes we get. People will ask us questions like, well, which Bible scholar says this? I'm like, well, why don't we start with what does the Bible say? Like, just read the. I mean, yes, sometimes some passages are very difficult, require a lot of interpretation. But when the question is, what is ritually done with a goat? You could just open up Leviticus and read it. You know, it's not. Yeah, it's not a big mystery."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2475.58,"end":2481.9,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, you may have to deal with this mercy seat stuff, but now you know how that works. So you're all set for Leviticus."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2483.9,"end":2484.3,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2486.54,"end":2502.93,"speaker":"Fr Stephen De Young","text":"So instead now this goat, this completely corrupt goat has to go Outside the camp, the city. Right. Outside. Back out into the bad place. And it's going to Azazel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2503.33,"end":2513.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. So the idea is to take the sins of the people and get them out of the place where sin does not belong. Send it out. Get. Get that goat out of here."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2514.37,"end":2515.69,"speaker":"Fr Stephen De Young","text":"Right. And so."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2515.69,"end":2516.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2516.05,"end":2536.29,"speaker":"Fr Stephen De Young","text":"And this goat is so unclean, by the way, that the goat would be led out by a designated person and tied to a bush or a shrub out in the wilderness. And the person who did that was rendered unclean by it from just, like being around that goat, the sin goat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2536.29,"end":2538.53,"speaker":"Fr Andrew Stephen Damick","text":"So he. He had to do some kind of ritual purification."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2538.53,"end":2543.65,"speaker":"Fr Stephen De Young","text":"He had to purify himself before he could come back into the. Into the camp."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2545.41,"end":2548.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay, but I haven't. I heard that the goat actually got thrown off a cliff."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2550.37,"end":2566.84,"speaker":"Fr Stephen De Young","text":"Right. That was later. That's another one of those things, like the rope that happened later. And the reason they pushed him off a cliff or a crag was a very practical problem of, well, what do you do if the goat gets loose and wanders back into town?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2567.32,"end":2569.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the sin goat. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2570.6,"end":2577.16,"speaker":"Fr Stephen De Young","text":"Oh, our sins came back to us. Right. So. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2577.32,"end":2578.76,"speaker":"Fr Andrew Stephen Damick","text":"Ominous. Very ominous."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2579.14,"end":2583.54,"speaker":"Fr Stephen De Young","text":"Easy way to prevent that. Right. Push him off a cliff, dump him in a hole. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2583.94,"end":2584.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2584.42,"end":2589.94,"speaker":"Fr Stephen De Young","text":"Not so great for the goat, but keeps it. Keeps that from happening."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2590.5,"end":2592.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so the goat is."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2592.14,"end":2593.14,"speaker":"Fr Stephen De Young","text":"Awkward moment."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2593.14,"end":2597.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Goat is sent to Azazel right now. Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2597.7,"end":2603.38,"speaker":"Fr Stephen De Young","text":"A couple of key things there. One is that he is not sacrificed to Azazel. He's not sacrificed to anybody."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2603.62,"end":2611.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because again, what would. What is sacrifice? It's sharing a meal with your God. They are not sitting down and having hors d' oeuvres with Azel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2611.68,"end":2620.56,"speaker":"Fr Stephen De Young","text":"Right. So he's not sacrificed to Azazel. There are also some folks who want to suggest that Azazel isn't a being."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2621.36,"end":2625.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because doesn't the name, like, literally mean. Have something to do with goats?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2626,"end":2627.36,"speaker":"Fr Stephen De Young","text":"Oz is a goat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2627.68,"end":2628.32,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2628.96,"end":2640.33,"speaker":"Fr Stephen De Young","text":"So some people will try to. Will want to translate Azazel, instead of seeing it as a name, as a proper name, will want to translate it as something like the goat who goes away."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2640.97,"end":2641.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2641.69,"end":2644.41,"speaker":"Fr Stephen De Young","text":"This is where scapegoat comes from."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2644.97,"end":2646.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2646.17,"end":2669.16,"speaker":"Fr Stephen De Young","text":"Escape. Right. Like escape. Right. Escape is go away. The goat that goes away. So, in fact, you'll see some. I'm trying to remember if the King James does this. A lot of older English biblical translations. Instead of saying they will choose a goat for a Zazel says it's one for Yahweh and one for a Scapegoat. And this is what they're doing. They're."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2669.16,"end":2669.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2669.76,"end":2672,"speaker":"Fr Stephen De Young","text":"Translating it rather than taking as a name."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2672.32,"end":2697.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right, exactly. And. And you know, when we were talking about this, you know, you mentioned that, that in terms of the actual construction of the language there, it's a parallel construction, that Yahweh and Azazel are being used in parallel. And so if you were to translate Azazel as the goat that goes away, then the other one becomes the goat. That is who he is and comes. Makes things come into being. Like, it doesn't."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2697.24,"end":2700,"speaker":"Fr Stephen De Young","text":"Yeah. The goat who exists or the goat who creates."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2700.64,"end":2704.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, it just doesn't. Doesn't work."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2704.88,"end":2719.91,"speaker":"Fr Stephen De Young","text":"Yeah. And. And this is. Was very clearly understood by the earliest readers because every extra biblical source we have from the Jewish world treats Azazel as a spiritual being."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2720.47,"end":2721.27,"speaker":"Fr Andrew Stephen Damick","text":"A demon."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2721.43,"end":2764.86,"speaker":"Fr Stephen De Young","text":"A demon, right. What we would call a demon who is the one who has power out there in the wilderness. Right. He's this. This desert spirit. And supporting that within. Within. The Bible is also in Leviticus 17, verse 7, which is the very next chapter. And remember, the chapter breaks weren't there originally. So this is just a couple paragraphs later. After the end of the ritual for the Day of Atonement, there's the commandment that the Israelites are not to continue worshiping the goat spirits of the wilderness."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2765.5,"end":2768.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2769.99,"end":2777.43,"speaker":"Fr Stephen De Young","text":"So it seems to me that you know where Azazel is most likely one of those. Right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2777.83,"end":2796.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And it probably should be noted that that doesn't contradict what came before. Like when there's. When God says, don't worship the goat spirits, he's not saying, now don't do the ritual I just gave you to do. Right. That. That's not worshiping the goat spirits. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2796.46,"end":2812.46,"speaker":"Fr Stephen De Young","text":"He's clarifying. He's clarifying. He's making it abundantly clear. We're not. This is not a sacrifice to Azazel. Right. You're not sacrificing a goat to Yahweh and then sacrificing another goat to a Zazel. In case you misconstrued everything I just said."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2812.78,"end":2813.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2813.22,"end":2819.1,"speaker":"Fr Stephen De Young","text":"You're not worshiping Azazel. Right. Repeat after me."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2819.26,"end":2831.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because if there's. Yeah. If there's one thing that God does not want you to do, it's worship. Anything. Anything else. I mean, that is. That is just a overarching commandment of the whole scripture."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2832.1,"end":2832.98,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2833.3,"end":2834.26,"speaker":"Fr Andrew Stephen Damick","text":"No idolatry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2834.58,"end":2846.1,"speaker":"Fr Stephen De Young","text":"And so we're going to talk about this more in the second half, but Azazel this spirit is seen as sort of the source of the sin and corruption that has come into the camp. And so it's basically being sent back."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2846.1,"end":2848.02,"speaker":"Fr Andrew Stephen Damick","text":"To him, back to where it belongs."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2848.02,"end":2849.86,"speaker":"Fr Stephen De Young","text":"Right. We don't want any."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2850.53,"end":2850.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2851.09,"end":2873.73,"speaker":"Fr Stephen De Young","text":"Go back where you came from. You take it back. This, this goat spirit of the wilderness is then picked up in a lot of later imagery, probably the most famous being Baphomet, this sort of Satan figure or devil."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2873.73,"end":2877.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. With a goat head and big leathery wings."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2878.73,"end":2889.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And he's often associated with other symbols like the Caduceus of Enlightenment and that kind of thing. But we'll talk about that more here in the the second half."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2889.93,"end":2907.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right. So we've covered the basics of the Day of Atonement ritual and the two goats here on Goat Week on the Lord of Spirits. And we're going to get back in just a moment, but first we're going to take a short break. So we'll be right back."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2907.93,"end":2924.09,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2929.21,"end":2931.13,"speaker":"Fr Stephen De Young","text":"Are you struggling in your walk with Christ?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2931.45,"end":2933.41,"speaker":"Fr Andrew Stephen Damick","text":"Do you want to rediscover your reason."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2933.41,"end":2940.96,"speaker":"Fr Stephen De Young","text":"For living, the person you were created to be? Renewing you, a priest, a psychologist and a plan gives you the keys to."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2940.96,"end":2942.68,"speaker":"Announcer","text":"Unlock areas of your life that hold."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2942.68,"end":2952.92,"speaker":"Fr Stephen De Young","text":"You back from fully experiencing the renewal and transformation God has in mind for you. Co authored by a priest and a psychologist, Father Nicholas and Dr. Roxanne Lowe."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2953,"end":2955.8,"speaker":"Fr Andrew Stephen Damick","text":"Renewing youg combines principles of spiritual growth."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2956.04,"end":2969.9,"speaker":"Fr Stephen De Young","text":"With psychological tools to help you become your best self, fully connected with God's purpose. To purchase this book, please go to store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2974.14,"end":2990.31,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":2992.55,"end":3064.38,"speaker":"Fr Andrew Stephen Damick","text":"All right. Welcome to the second half of the show here on Goat Week at the Lord of Spirits podcast. So we just walked through the Day of Atonement ritual, the goat for Yahweh, the goat for Azazel, and what those things mean. And now we're going to turn towards the New Testament. But before we get there, a couple of things we have to say at the very outset all references to the atonement in the New Testament are explicitly about the Day of Atonement ritual. That's just a good guiding principle here. Super, super important. Makes all these references to atonement in the New Testament make a lot more sense. So I'm just gonna. We're gonna say that at the outset, it's not about some abstract concept or mechanism of salvation. It's about the ritual that everyone, you know, that the people who are receiving this gospel would have known. Right. Or if they were coming in from, you know, the nations, they would have been told about this as part. It was part of their inheritance now because they're becoming part of Israel. But Israel knows the Day of Atonement ritual. It's a huge, huge deal. Super, super important. Okay, but before we get to the."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3064.38,"end":3068.42,"speaker":"Fr Stephen De Young","text":"New Testament, let me throw you one quick correction here."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3068.75,"end":3069.27,"speaker":"Fr Andrew Stephen Damick","text":"Okay? Go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3069.27,"end":3072.11,"speaker":"Fr Stephen De Young","text":"Go for it. I know you really want Goat Week to be a thing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3072.43,"end":3072.91,"speaker":"Fr Andrew Stephen Damick","text":"I do."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3072.91,"end":3077.23,"speaker":"Fr Stephen De Young","text":"But due to the frequency of the show, is it not actually goat Fortnite?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3079.39,"end":3084.19,"speaker":"Fr Andrew Stephen Damick","text":"That is true, but it's not like you can't have the parallel with Shark Week then. You know what I'm saying?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3084.43,"end":3087.47,"speaker":"Fr Stephen De Young","text":"Right. And then that opens up Fortnite sub references."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3087.71,"end":3088.43,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3088.51,"end":3089.63,"speaker":"Fr Stephen De Young","text":"A whole new world."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3090.11,"end":3131.74,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I love that word. It's just a good, good word for one thing. But. Yeah, yeah, I hear you, I hear you. But we did just have, you know, or we're going to talk about Matthew chapter 25 in a second here. We had the Sunday of the Last Judgment, so we've had goats on our minds, but we'll get to that. Okay, but before we get to the actual New Testament, there's some stuff. Surprise, surprise, Lord of Spirits listeners. There's other literature that surrounds the New Testament that informs what's going on in the New Testament. So we're going to talk about some Second Temple literature. Right? Like that mentions a Zazel, doesn't it?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3132.46,"end":3136.62,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And, and, And a solid 80% of kidding aside."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3139.02,"end":3139.42,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3139.82,"end":3154.46,"speaker":"Fr Stephen De Young","text":"The point you made about it being references to the Day of Atonement is, again, important. I know we've said this several times already. Right. But when, when atonement is talked about in the New Testament, it's not referring to some abstract theological idea of atonement."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3155.16,"end":3155.56,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3155.56,"end":3164.2,"speaker":"Fr Stephen De Young","text":"It's referring to what happened on the Day of Atonement and comparing specifically, as we're going to see, what Christ does to that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3164.92,"end":3179.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Well, related. So related to that, actually, we have a caller, we have Dan from New York, and he has A question specifically about the Day of Atonement ritual. So. Dan, are you there?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3181.01,"end":3182.21,"speaker":"Fr Photius","text":"Yeah, I'm here. How are you doing?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3182.21,"end":3185.81,"speaker":"Fr Andrew Stephen Damick","text":"Hey, Dan. Welcome. Welcome to the Lord of Spirits podcast. All right, what's your question?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3186.77,"end":3233.01,"speaker":"Fr Photius","text":"All right, so. So I have two questions, if that's okay. I don't think they're so such long questions. So the first question, I mean, I'll start by saying I haven't read the book of Leviticus, so that's. So excuse my ignorance on this, but I. I have read. You know, actually, after hearing the last. The last podcast you guys did, I was doing a little bit of reading and I read that, like, the priests would lay hands on both goats, like, on the goat for Yahweh as well. Is that first. Like, is that, is that true or would they not lay hands on the goat for Yahweh? And if they did, what was that signifying when they laid hands on it? Because I know the Protestants like to interpret that as, you know, putting, placing and shifting their sins onto the animals so that it works with their, like, penal substitution model."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3234.44,"end":3311.21,"speaker":"Fr Stephen De Young","text":"Right. Well, we can't. We can't hang that on all Protestants, you know, but yeah, sometimes. No, I know what you're saying. I know what you're saying. Sometimes, yeah, that's interpreted. At any time someone puts their hands on an animal, that's interpreted as meaning that they're putting sins on it. Right. And I mean, there are basic problems with that. For example, that's how people are ordained in the New Testament is by the laying on hands. So I don't think they were putting their sins on, like, presbyters, but when, when hands were laid in sacrificial rituals, Right. It's the go for Azazel, where it says he lays hands on it and then pronounces the sins. Other sacrificial rituals where you see the laying on of heads, that's to designate the animal as a sacrifice. The laying hands on someone or something is setting them apart, right? Which means making them holy, sanctifying them to a purpose, for a purpose. Right? So we've got. I go out to my sheep, right? I've got all these sheep. One of them I'm going to sacrifice. So that one we go and we lay hands on it to say, this is the sheep that we're going to offer to God."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3312.33,"end":3312.81,"speaker":"Fr Photius","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3312.81,"end":3320.14,"speaker":"Fr Stephen De Young","text":"And so it's the same thing in terms of ordination. There's a lot of people standing around. This is the person who we're setting apart for this purpose."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3321.58,"end":3375.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if you look, if you look at Leviticus, I mean, you know, you don't have to read the whole book of Leviticus, but if you look at Leviticus 16, which is the chapter that has this ritual in it, you can just read it, you know, and it shows. Like I'm looking at it right now, and it says, aaron must then present the goat which has been designated by lot for the Lord, and he's to make it a sin offering. But the goat, which has been designated by lot for Azazel has been stood alive. And then later on it makes the reference to him putting his hands on the goat for Azazel and sends it out. But there's not, unless I'm missing it, it doesn't actually say anything about putting his hands on the other go. I mean, obviously he has to touch it. But there's not this ritualized laying on of hands that's going on that I'm seeing here. Unless I'm just missing it, Father. I don't know."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3375.54,"end":3396.07,"speaker":"Fr Stephen De Young","text":"There's. There's a tendency, and this is not an indictment of anybody because I read, I've heard scholars who I greatly respect publicly talk about, when they're talking about sacrifices of the Old Testament, say, oh yeah, the priest would put the sins on the animal and then kill it. And I'm like, that's, it's, it's just not there. But."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3396.15,"end":3396.55,"speaker":"Fr Photius","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3396.87,"end":3403.03,"speaker":"Fr Stephen De Young","text":"People have sort of imbibed this idea and so they sort of project."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3403.75,"end":3404.23,"speaker":"Fr Photius","text":"Sorry."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3405.19,"end":3422.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And I mean, people do that all the time. Like they say there's three wise men. Well, text doesn't actually say how many. There were. There were three gifts. Right, right. So there's a whole bunch of things like that where we've just, we've picked it up and we assume it's there in the text and it actually isn't, you know, when you go check."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3422.45,"end":3425.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so does that, that, does that help you, Dan?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3426.45,"end":3429.73,"speaker":"Fr Photius","text":"Yeah, yeah, yeah, that, that's really helpful. That makes perfect sense."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3430.13,"end":3432.73,"speaker":"Fr Andrew Stephen Damick","text":"Did you, have you had a second question? Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3432.73,"end":3449.99,"speaker":"Fr Photius","text":"The second question was like, what, what was it about their understanding of the goat's blood that was understood to have like a cleansing or sanctifying effect over the, you know, over the various parts of the, of the holy of Holies in the temple that you guys discussed?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3450.79,"end":3460.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What is it about that blood that actually has that purifying effect? Is it because it's being offered to God? What's, what's going on there?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3461.51,"end":3506.07,"speaker":"Fr Stephen De Young","text":"Yeah. So I don't want to get too gray about this. There's Actually, when you get into literature about this, I did my dissertation related to this, so I read all the literature on this and there's actually. I mean, people debate exactly how the blood dealt with the taint. Right. Like, did it absorb it, did it eradicate it? Right. I mean, so you could get super through the weeds. Right. But the basic idea is that as Leviticus says elsewhere, that blood is life, the blood of an animal is its life. And so. Right. Sin, Right. This taint of sin and corruption is death. It's sort of like death stuff."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3506.63,"end":3507.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3507.27,"end":3515.43,"speaker":"Fr Stephen De Young","text":"And so you use life stuff to purify from death stuff."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3517.27,"end":3517.99,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3517.99,"end":3518.71,"speaker":"Fr Photius","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3519.11,"end":3519.63,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3519.63,"end":3522.47,"speaker":"Fr Photius","text":"That makes, you know, that makes. That makes total sense. All right, thank you."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3522.47,"end":3522.95,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3522.95,"end":3523.67,"speaker":"Fr Photius","text":"I appreciate it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3523.91,"end":3540.15,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much for calling in, Dan. We, we appreciate hearing from you. All right. Okay, so. No, it's good. It's good. We talk a little bit about that. All right, so Azazel and Second Temple literature, what does that stuff say about him?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3540.71,"end":3554.15,"speaker":"Fr Stephen De Young","text":"Right. So as I mentioned, all of our earliest sort of interpreters within the Jewish world who talk about Azazel have him as this being, this actual demonic being."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3554.96,"end":3555.36,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3555.76,"end":3571.92,"speaker":"Fr Stephen De Young","text":"And the most prominent places where he's discussed in terms of what Second Temple literature we're focusing on are First Enoch, what's called Second Enoch or Slavonic Enoch and the Apocalypse of Abraham."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3572.4,"end":3573.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3574.8,"end":3601.01,"speaker":"Fr Stephen De Young","text":"And just to. Just to send a shit, the latter two of those are preserved for us in Slavonic. We don't have them in the original language or even in Greek. They're preserved for us in Slavonic and were being copied in monasteries in the Orthodox world right up into the 16th century when the printing press was invented."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3601.25,"end":3601.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3601.73,"end":3635.13,"speaker":"Fr Stephen De Young","text":"So they were being deliberately preserved for us within the church. Not just accidentally. We found them in the desert somewhere. And I was going to say, I want to give a shout out. The Scholar on Slavonic Pseudepigrapha. So if you. If you want to get into Slavonic Pseudepigrapha, and who doesn't is Andrei Orlov. And he's written a ton and a lot of it's available for free on the Internet if you want to read scholarly journal articles."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3635.29,"end":3636.01,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3636.25,"end":3641.85,"speaker":"Fr Stephen De Young","text":"And now I've preempted the. Where can I read more about this? Messages we, we get after most episodes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3643.85,"end":3644.49,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3644.89,"end":3646.21,"speaker":"Fr Stephen De Young","text":"So bless you. We."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3646.21,"end":3652.97,"speaker":"Fr Andrew Stephen Damick","text":"We understand your hunger and your thirst to know more. And we, we appreciate and laud that it is good."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3653.05,"end":3688.5,"speaker":"Fr Stephen De Young","text":"Yes. So allow me to feed that a little bit. There you Go. So he's seen in First Enoch when. When. Or the Book of Enoch, when Zazel appears. Zazel is sort of the leader of the bad guys, the leader of the rebellious Watchers who are responsible for corrupting the line of Cain and leading them to destruction that results in the Flood. So he's sort of the main motivator of the."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3688.73,"end":3688.97,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3689.53,"end":3712.57,"speaker":"Fr Stephen De Young","text":"And when The Book of Enoch lists what the different rebellious angelic beings taught to. To humans, what Azazel is listed as having taught is. Are the same things that Tubal came in. Genesis 4, verse 2."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3713.45,"end":3713.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3714.51,"end":3730.99,"speaker":"Fr Stephen De Young","text":"Because if there's anything people love more than Slavonic Pseudepigrapha, it's genealogies. Where. Where it describes what Tubal K. Creates. So. So it's. He's being directly connected."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3731.47,"end":3734.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although those technological advancements."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3734.67,"end":3753.96,"speaker":"Fr Stephen De Young","text":"Yes, yes. Involving metallurgy for weapons of war and. And those kind of things. And so, you know, of course, as we mentioned before in a previous episode, this is over. Against the Apkallu myth and other similar stories. Prometheus in Greek tradition."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3754.12,"end":3764.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where that's where that stuff is depicted as being good. Like, this spirit came and gave us this wonderful, beautiful knowledge. And the Bible is saying, no, that was bad for you."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3765.08,"end":3766.16,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3766.16,"end":3769.29,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, yeah, yeah. And so Azazel is caught up in all this."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3769.92,"end":3775.76,"speaker":"Fr Stephen De Young","text":"Right. And that enlightenment imagery like the Caduceus and those kind of things that are attached to Baphomet is the same kind of thing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3776,"end":3777.48,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3777.48,"end":3788.08,"speaker":"Fr Stephen De Young","text":"This idea of, you know, hey, maybe the serpent in Eden was telling the truth. Right. Maybe he was. You know, so that's that pro devil propaganda stuff again."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3788.96,"end":3789.6,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3790.48,"end":3815.32,"speaker":"Fr Stephen De Young","text":"So. And what this results in, in all three of those texts I mentioned, the Book of Enoch, Slavonic Enoch, and the Apocalypse of Abraham, is that there's going to be this eschatological day of atonement, meaning we've got this annual Day of atonement that we do every year that's sort of managing things. Right. Because every year we go and we sin a bunch more and then we have to do it again."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3815.56,"end":3816.6,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3817,"end":3839.25,"speaker":"Fr Stephen De Young","text":"This vicious cycle of purifying this limited sacred space. And so sort of prophetically, it said that there's going to be this. This eschatological day of atonement that's going to take care of Azazel and take care of this sin and corruption and take care of sacred space sort of once and for all."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3839.89,"end":3922.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So this is really cool. And it's a really. I mean, this is a major kind of transitional thing happening here. Right. Where you know, as you've mentioned a number of times, that the sacrificial system of the Old Testament is basically kind of a management system, managing sin, managing corruption, managing taint and death. And yet. And so that what we get in this Second Temple literature is, as you said once and for all, that there's going to be a great day of atonement to end them all, so to speak. You know, the ultimate, the fulfillment of all of them. Now the thing that has been done in part now is being done totally in full. And I think this is really important to note this because we say that Christ is the fulfillment of all things in the Old Testament. And here you have this Second Temple Jewish literature, a lot of it preceding, some of it kind of being at the same time as the New Testament, essentially pointing to this. There's this big eschatological version of this that's going to be happening. Right. And you know, there's this, the figure of the angel of the Lord is the one who's going to do this. He's going to be the high priest. Right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3922.48,"end":3952.67,"speaker":"Fr Stephen De Young","text":"Right. There's built in an understanding beforehand. This isn't just Christians kind of coming up with allegorical ways to read the Old Testament, to read Jesus into it. This is before Christ's birth, an awareness that, you know, we're managing the problem, we're dealing with the problem, but we're not solving the problem. And so the Torah and its rituals, including the day of atonement, can't be like an end in themselves."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3953.23,"end":3954.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they don't lead to salvation."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3955.87,"end":3989.46,"speaker":"Fr Stephen De Young","text":"And so, yes, there's this, the, the figure, especially the apocalypse of Abraham. He's named Yehoel, this angel of the Lord figure who serves as the high priest for this eschatological day of atonement. And what's interesting there is, you know, people may know that these angelic names that end in El, El is God. Right. So Gabriel is Gibbor El, the mighty man of God. Michael is Michael, who is like God and yahooel. The Yaho is Yahweh."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3991.3,"end":3992.9,"speaker":"Fr Andrew Stephen Damick","text":"So it's Yahweh is God."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3993.14,"end":3996.82,"speaker":"Fr Stephen De Young","text":"The name of this angel is Yahweh. No, Yahweh. God."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":3997.06,"end":3999.54,"speaker":"Fr Andrew Stephen Damick","text":"Yahweh God. There you go."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4000.34,"end":4035.1,"speaker":"Fr Stephen De Young","text":"Because of how it's, how it's conjugated. So that's why we say this is an angel of the Lord figure in the technical sense of the Old Testament, the Son of man, the angel of the Lord, this second person of Yahweh that This is going to be the person who does this eschatological day of atonement. And then the whole idea, not just in general terms, but in its specifics, is picked up Wholesale by St. John the Evangelist in the Johannine literature."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4035.34,"end":4081,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is so cool. I'm getting a little giddy here because, like, when we were going over this in our preparation, I mean, it was just stunning to me. Like, once you have clarity about especially what the Old Testament says, there's all kinds of bits of the New Testament that just light up left and right. So that's what we're going to do now. Right. So let's talk about what St. John says about this. So he picks up this idea of the eschatological day of atonement, and he says, it's Christ. Christ is the high priest who does this final day of atonement, the one that ends them all. And he takes that over from the Second Temple literature, right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4081.24,"end":4111.69,"speaker":"Fr Stephen De Young","text":"Yeah. And St. John's gonna say, this has happened. Right. When we say the Johannine literature, we're talking about St. John's gospel, but also first, second and third John and the Apocalypse, the Book of Revelation. And it's found all of us. Now, most people, when they think of atonement in the New Testament. Right. If I came to someone just at random and said, hey, where would I go in the New Testament to read about atonement?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4112.49,"end":4112.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4113.21,"end":4116.68,"speaker":"Fr Stephen De Young","text":"They would probably not immediately say, first John."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4117.48,"end":4159.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I think sometimes, you know, I think sometimes people take first, second, and Third John as being like these little bonus bits towards the end of the New Testament, before you get to the big crazy dream vision at the end, you know, like, oh, it's nice that he wrote some letters. Right. But the church read these out loud in liturgy and preserved them and theologized on the basis of them. And this is from the beloved apostle who leaned on Christ's breast at the Last Supper. So actually, there is really important theology and teaching and doctrine that's in these three letters."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4159.97,"end":4170.02,"speaker":"Fr Stephen De Young","text":"Yeah. And historically, it's. Historically, especially with First John, it's important to note that the general epistles. Right. Which is all those letters that St. Paul didn't write."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4170.02,"end":4170.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4171.5,"end":4200.63,"speaker":"Fr Stephen De Young","text":"The general or Catholic epistles, the ones written by other people out of all of those. All of those in the very early history of the church were being utilized by some churches and not others. And so this is sometimes expressed as there were arguments about them. In reality, it was just some communities had them and used them and some other ones didn't have Them and therefore didn't. But the one that everyone agreed on out of all of the general epistles or Catholic epistles was First John."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4201.67,"end":4202.27,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4202.27,"end":4204.87,"speaker":"Fr Stephen De Young","text":"They would all say the Gospel of John and the Epistle."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4205.43,"end":4205.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4205.75,"end":4269.14,"speaker":"Fr Stephen De Young","text":"A lot of them who didn't even know Second and Third John existed accepted First John. So it had this prominence beyond those, those other books. But First John is actually the book of the New Testament that uses the actual word illustrion, atonement most frequently. So there are other. Certainly Hebrews has a very detailed. And we're gonna pay. Hebrews is going to be peppered throughout this half of the show, but has a very detailed description and connection between Christ and the day of atonement ritual as we're going to see. But in terms of using the term and talking about it as a concept. Right. First John is the place and he is picking up from this basically Anakic literature, this Second Temple literature, a certain understanding of the cosmic aspects of the day of atonement and of this eschatological day of atonement."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4269.14,"end":4288.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So we have in our notes, because everyone loves it when we read From Enochic Literature First Enoch 10 8, it says, and the whole earth has been corrupted by the teaching of the works of Azazel. To him ascribe all sin."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4290.27,"end":4299.4,"speaker":"Fr Stephen De Young","text":"That's the indictment that sort of read over Azazel before he. At this eschatological day of atonement."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4299.4,"end":4299.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4299.72,"end":4303.12,"speaker":"Fr Stephen De Young","text":"That's his indictment. Those are the. That's the charge against him."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4303.52,"end":4304,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4304,"end":4330.01,"speaker":"Fr Stephen De Young","text":"And St. John picks up pieces of this verse. Right. Elements of this idea form part of the structure of the book of First John. So you see, for example, the teaching of the works of Azazel. Right. So there's this idea that the works of A were being taught and handed down. Well, who would have been doing this? As we talked about the Book of E. This would be Cain's line."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4330.09,"end":4332.17,"speaker":"Fr Andrew Stephen Damick","text":"The Cain. Yeah, exactly, exactly."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4332.73,"end":4364.1,"speaker":"Fr Stephen De Young","text":"And we don't. Normally we don't think about Cain a lot, but when we do, we think about the story of Cain and Abel and oh yeah, he was a murderer, he's a bad guy. But he was particularly significant in the understanding of both Judaism of the Second Temple period and early Christianity as not only the first sinner, as we've already talked about a little bit, but also as a teacher of sin. He is regarded as, by Josephus, for example, as the first heretic."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4364.66,"end":4408.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's interesting. Which is funny because like, you wouldn't think of, like, at what point do we see Cain teaching Something. And, you know, it's like, you know, I have this crazy new doctrine of God I want everyone to follow me on. But yeah, there's this reference in 1 John 3:12 which makes reference of Cain being of the wicked one who murders his brother. Right. And if he's. Of Azazel, this one who's teaching this forbidden knowledge, then he's doing the works of his father, so to speak. Right. He's imaging. Yeah, yeah. Which we talked about before a few episodes back."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4409.17,"end":4433.4,"speaker":"Fr Stephen De Young","text":"And the Next verse in First John, verse 13 says that the reason he killed Abel is that Abel's works were good and Cain's works were evil. So that works is brought in there, that he's doing the works of his father, the evil one. You also find in First John 5:19, the whole world lies under the power of the evil one."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4433.88,"end":4439.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's that sense of the domination of demons in the world, especially Azazel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4440.6,"end":4443.44,"speaker":"Fr Stephen De Young","text":"The corruption of the. Of the earth, of the."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4443.44,"end":4448.44,"speaker":"Fr Andrew Stephen Damick","text":"Of the whole world, and freedom being given by Christ from that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4448.92,"end":4456.54,"speaker":"Fr Stephen De Young","text":"Right. And the way he's said to do that in First John 3. 8 is that Christ appears to destroy the works of the devil."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4456.94,"end":4475.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which I love that verse because if you ask people sometimes, why did Jesus come to earth, there's all kinds of things that they might say, some true and some not so much. But I love that he comes to destroy the works of the devil. Like he comes specifically to do combat with the evil one."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4476.14,"end":4482.9,"speaker":"Fr Stephen De Young","text":"Right. And these things that the evil one has wrought in the world are here in the world and need to be put. Purged out."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4483.3,"end":4483.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4483.7,"end":4489.06,"speaker":"Fr Stephen De Young","text":"Need to be purified, need to be atoned for in that sense. Need to be removed, wiped away, blotted out."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4490.1,"end":4492.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Atoned."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4493.06,"end":4528.79,"speaker":"Fr Stephen De Young","text":"And so what you see after that indictment is read in First Enoch and in Slavonic Enoch and in the apocalypse of Abraham, the same thing happens to Azazel in all of them. Them Azazel gets bound and chained up and thrown into a hole in the ground and imprisoned there until the end of days, until the day of the Lord, at which point he will be released briefly and then thrown into the lake of fire."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4531.75,"end":4532.31,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4532.71,"end":4572.53,"speaker":"Fr Stephen De Young","text":"That might sound familiar to some folks who have read the book of Revelation. Right. Because this is exactly what happens to the dragon. He's seized by an angel. He's bound, he's thrown into a pit, he's kept there. And then on the last day, he's released briefly and then thrown into the lake of fire. The. The lake of fire. That gets mentioned in St. Matthew's Gospel and in the Book of Revelation has no Old Testament precedent, but the lake of fire prepared for the devil and his angels, as St. Matthew's gospel says is taken directly from the anarchic literature."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4573.25,"end":4573.81,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4576.21,"end":4614.67,"speaker":"Fr Stephen De Young","text":"It's a. It's a direct, direct reference. And so this element of the eschatological day of atonement that Azazel is finally defeated, it's not just sending him back his sin while he continues to control the rest of the world out there, but he's done away with and disposed of, is, as we said, Hebrews is going to be peppered all through here in Hebrews 2:14 says, Inasmuch then as the children have partaken of flesh and blood, he himself likewise shared in the same. Right. So this is talking about why Christ became incarnate again. Why did Christ become incarnate?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4615.07,"end":4615.47,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4616.03,"end":4639.64,"speaker":"Fr Stephen De Young","text":"So that through death, he might destroy him who had the power of death, that is the devil. Namely the devil. Right. Destroy the devil. Yeah. And so that's one significant element of this eschatological day of atonement. And this is the one that's particularly emphasized. It's all in Hebrews, but this is particularly emphasized in the. The Johannian literature."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4639.96,"end":4658.68,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. All right, okay. Well, let's talk about St. Matthew. And for those of us in the Byzantine rite of the Orthodox Church, which is most Orthodox Christians, this last Sunday was the Sunday of the Last Judgment, in which we heard Matthew chapter 25, where we heard that sheep go to heaven and goats go to hell."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4660.92,"end":4665.97,"speaker":"Fr Stephen De Young","text":"This is why we eat ceremonial cakes on me Fair Sunday."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4666.37,"end":4693.59,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Exactly. Yeah. But okay, okay. So it doesn't quite map. Right. You know, with the Day of Atonement ritual, there's two goats. A goat for a goat for Yahweh and a gopher that's sent off to Azazel. But I thought In Matthew chapter 25, it said that goats go to hell. Yeah. Not all goats are the same in every reference of Scripture."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4693.59,"end":4694.39,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4694.47,"end":4696.63,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, yeah, but what happened."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4696.63,"end":4714.71,"speaker":"Fr Stephen De Young","text":"What happens in. Is in. In sort of the. The symbolic mind. Hi, Jonathan. Of. Of the. The. Of the Jewish people. Sheep and lambs become associated with Passover."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4715.35,"end":4715.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4716.32,"end":4759.45,"speaker":"Fr Stephen De Young","text":"And as we talked about last time, at a fair amount of length, Passover representing this. This manumission, this freedom from slavery. Slavery to sin. Freedom from slavery. The house of powers. So this is sort of has positive connotations. Right. And then. And then. So the Israelites are referred to as sheep sort of all through the. The Old Testament and their leaders as shepherds, because they're these sheep who are now set free from Egypt and brought out into this new pasture, all of that symbolism. And then goats get associated with the Day of Atonement, which means they're associated with sin, blood, death. Right, Azazel? Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4759.45,"end":4772.77,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, so there is some over. There is some overlap there. But. But yeah, it's not. It's not a perfect total categorical overlap. You have to learn to think symbolically. Yeah, yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4772.77,"end":4774.68,"speaker":"Fr Stephen De Young","text":"Do you have to pay royalties now that you said that?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4775.31,"end":4776.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't think so, but."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4776.83,"end":4777.31,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4777.31,"end":4800.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay. But yes, hello, all of you Jonathan Pageau fans out there. We understand there's a kind of a pipeline from there to here. We welcome you. We are happy to have you. Yeah. Yes. Okay. So St. Matthew, he talks about Christ as being the goat that gets sent off to Azazel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4801.02,"end":4808.3,"speaker":"Fr Stephen De Young","text":"Right, right, right. We're gonna see, to tip our hats, spoilers that in the New Testament, Christ is both goats."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4810.54,"end":4811.26,"speaker":"Fr Andrew Stephen Damick","text":"Two goats."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4811.74,"end":4890.11,"speaker":"Fr Stephen De Young","text":"St. Matthew's gospel in particular, we see a lot of this connection to. To Christ as. As the scapegoat. Right. And one of the places where we really see that is. Now, this requires you reading some outside the New Testament literature, but the Epistle of Barnabas gives a little bit more detailed description of how the Day of Atonement ritual was being performed sort of in some of the small details that had accrued over time in the first century A.D. okay. That's where. So their accommodations have been made. They're not out in the wilderness. Right. They're not in camping. Intense. Right. You've got Jerusalem. It's an established city. So he gives some of these details. And so some of the details we get from that are a scarlet cord being tied around the goat's head. And that when they. After the sins had been placed on the goat, the people would sort of gather in the streets and they would get reeds and they'd strike the goat and hit it to sort of drive it out."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4890.75,"end":4891.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4891.87,"end":4907.23,"speaker":"Fr Stephen De Young","text":"And while they were driving the goat out, they would sort of mock the goat and spit at the goat as a sign of them rejecting their sins. Right, right, right. I know people are being moved to sympathy for the goat."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4907.95,"end":4908.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4909.1,"end":4911.02,"speaker":"Fr Stephen De Young","text":"The poor goat. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4911.02,"end":4940.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay. But these three things, right, Wrapped around with a scarlet cord, being beaten with a reed to drive it out, mocked and spit upon. Does that sound like anything to anybody? Yeah. So St. Matthew uses this language to describe it, to describe exactly what happens to Christ at the crucifixion. Right. And he's Wrapped about with."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4940.33,"end":4950.89,"speaker":"Fr Stephen De Young","text":"At the end of his trial, he says he's. They wrap a scarlet robe about him, which is kind of a weird way to describe putting a robe on."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4951.61,"end":4952.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4952.53,"end":4955.85,"speaker":"Fr Stephen De Young","text":"I don't say, I got up this morning and wrapped my clothes around me."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":4956.17,"end":5023.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so. So it's an interesting point because. Because what is St Matthew doing? Is he just. Is he saying, okay, I'm going to come into this, I'm going to describe this. I have all these details from the Day of Atonement ritual, and I'm just going to ascribe that to what's happening with Christ. I'm just going to make it look like that. No, what he's doing is he's describing what actually happens to Christ, but he's using language that should remind you of the Day of Atonement ritual in order for you to make that connection. The connection that actually does exist, but he's appropriately describing it to help you make that connection. Because what are the gospels? They are not just a narrative, they're narrative theology. Like, it's, you know, they are teaching you and giving you the proclamation of Christ. They're not just saying, and this is what happened next. You know, it includes that. But the way that they tell the story is designed to teach you how Christ in this case is the fulfillment of. Of. Of what, you know, what was given in the Old Covenant."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5023.65,"end":5028.73,"speaker":"Fr Stephen De Young","text":"Awesome stuff. And this, this doesn't mean it's not historical, right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5028.73,"end":5029.05,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5029.05,"end":5073.46,"speaker":"Fr Stephen De Young","text":"Any historian has to choose details to include in details to omit and write about things and describe things in certain ways. That doesn't make it not historical. St. John himself said, you can't write down every single thing Jesus ever did and said there's not enough in the world. So they're choosing how to describe things and what details to include in order to convey this. Right. So using the, the color scarlet, using this wrapped around language, he says that they put a reed in his hand. It's the exact same word for reed. And then they took the reed from him and struck him with it. He could have used a word for stick. Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5074.58,"end":5077.3,"speaker":"Fr Andrew Stephen Damick","text":"He's driven outside of the city. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5077.3,"end":5099.71,"speaker":"Fr Stephen De Young","text":"And the people. And they mock him and they spit on him. Yeah, Right. And this is, this is very important because in our modern era, a lot of people will take these descriptions of what happens at Christ's death and the hymns about them that we're going to sing in Holy Week in a few weeks and, and label them as anti Semitic."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5100.27,"end":5166.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is. Which we're actually about to show you how it's the opposite. It's the opposite. It's not anti Semitic. Right. So, okay, perfect example. This is maybe the classic example, Matthew chapter 27, verse 25, where the people say in response to Pilate, his blood be upon us and upon our children. Now, given everything we just said about the blood of the goat and given everything, you should know, if you're a Christian about what the blood of Christ does. If his blood is upon you, that's actually good. Right. I mean, St. Matthew is himself a Jew. I mean, he's not going to. Right. Anti Semitic. I mean, he's writing the most Jewish of the Gospels. Right. You know, the most Hebraized of the Gospels. When he says that Christ's blood is going to be upon them and upon their children, that's a blessing. That's absolutely a blessing."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5167.61,"end":5216.84,"speaker":"Fr Stephen De Young","text":"Right. And what St. Matthew conveys there with his blood be on us and upon our children. In narrative theology, Hebrews just comes out and says in Hebrews 9, 18, 22, that says they were sprinkled with the blood. They and their children were sprinkled with the blood at the beginning of the Old Covenant. And now we have been sprinkled and purified with the blood of Christ. Right. So that's the non narrative theology way to say it. But. So yes, this is. St. Matthew is deliberately subverting a potential anti Semitic reading of this. Right. This is, this is like Joseph in Genesis. They meant it to him for evil, but he meant it for good. Right. They're cursing him. He's taking away their sins."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5218.76,"end":5220.6,"speaker":"Fr Andrew Stephen Damick","text":"Father, forgive them. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5221,"end":5235.24,"speaker":"Fr Stephen De Young","text":"And note, note that it's not just Jews who are doing these day of atonement things things. It's also the Roman soldiers who are doing these day of atonement things in St. Matthew's gospel."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5236.2,"end":5240.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're now participating in the eschatological day of atonement."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5240.32,"end":5242.52,"speaker":"Fr Stephen De Young","text":"Right. It's everybody's sins."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5244.2,"end":5245.24,"speaker":"Fr Andrew Stephen Damick","text":"This is so cool."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5245.4,"end":5254.13,"speaker":"Fr Stephen De Young","text":"And then, and then, as Hebrews again sort of makes plain, in Hebrews 13, 11 and 12, Christ dies outside the camp."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5254.37,"end":5363.13,"speaker":"Fr Andrew Stephen Damick","text":"Outside the camp, yeah. Yeah. Okay. So Christ is both goats. We're about to talk now about how he's also the goat for Yahweh. But I just wanted to link these two things together actually from a very familiar bit of hypnography for orthodox Christians. And that's from the doxology, whether the little doxology or the great doxology, if I remember correctly, this line is in both where we sing O Lord God, Lamb of God, son of the Father, who takest away the sin of the world. Have mercy on us, O thou who takest away the sins of the world. Okay, so he takes away the sin of the world and the sins of the world. This is not just redundancy. And you just happen to pluralize the word the next time. Taking away the sin of the world is to remove the taint, the corruption, the impurity of the whole world. Right. Which is what the goat for Zazel does is he takes the impurity out. Out of the. Out of the camp and out into the wilderness. Although in this case, it's the whole world. The whole world becomes the camp now. And then he also takes away the sins of the world, meaning the sins that the people commit. He takes away their sins. Right. And, you know, he purifies even them. Right. So it's. I don't know, it's cool. Christ is both goats. So. All right, well, let's talk about St. Luke's gospel and, of course, Acts, which, I mean, these two kind of form a single narrative together, you know, with just the. You know, in the former treatise, O Theophilus, at the beginning of. I think that's the King James Version at the beginning of Acts. So, okay, so how does. So St. Luke uses the day of Atonement imagery to describe Christ as being the goat that is sent to Yahweh."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5363.53,"end":5372.33,"speaker":"Fr Stephen De Young","text":"Right, Right. The goat. The goat for Yahweh, which, remember, the means the blood of this goat is used to purify sacred space."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5372.57,"end":5372.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5372.93,"end":5464.26,"speaker":"Fr Stephen De Young","text":"And so start with a verse near and dear to my heart because I spent a chunk of my life with it. And that's First John 2, verse 2. And First John 2, verse 1 talks about. First John 2. 1. 2 is talking about the Day of Atonement. First John 2, verse 1 talks About Christ as the high priest who intercedes in prayer. And then two, verse two says that Christ is the atonement, not only for our sins, but also for the whole world. And what he's doing here is he's taking this idea of the purification of sacred space. So if we imagine, right, that there's sort of this layer of darkness over the whole world, and then there's sort of this dome. It's like dome of light over Israel, over the camp, in the wilderness, or over. Over Israel as a nation, over Judah, Judea. And that's being purified, sort of under the dome, right? Yeah, it's being cleansed and purified, being kept pure. Now that dome is expanded to encompass the whole world. Because Christ, not only does he not just send the stuff back to Azazel, he gets rid of Azazel, he then has broken Azazel's hold over the world. And so now the whole cosmos, the whole creation can become sacred. Space."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5466.02,"end":5466.82,"speaker":"Fr Andrew Stephen Damick","text":"Can be purified."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5467.54,"end":5509.17,"speaker":"Fr Stephen De Young","text":"So not only for our sins, right, which are taken away, but for the whole world, which is now purified and made. Made holy and sacred in. First. In potency. Right. First, as with everything eschatological, Right. This is happening in real time, like we talked about in our Halloween episode. But this will ultimately come to fruition than in the new heavens and the new Earth. Just as right now, the evil one is bound and in a hole and he'll be chucked in the lake of fire then at that latter point."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5509.81,"end":5575.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay, now we get to talk about one of my favorite places, Emmaus. Although not Pennsylvania, but the Emmaus that my Emmaus is named after. So in Luke chapter 24, you get Christ on the road to Emmaus. And then there's this weird. And then it's, you know, at the end of Luke, they worshiped him, returned to Jerusalem with great joy, and were continually in the temple praising and blessing God. Amen. Which is kind of a weird way to end the Gospel. Like, you know, why is that mentioned? Well, okay, so there's a little bit of backstory here. And again, Luke using this detail about Christ being on the road to Emmaus. He's actually on the road to Emmaus. But everyone knows what Emmaus is famous for. You guys know, right? Does it. Everyone does it. Everyone as they well should."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5575.03,"end":5575.31,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5575.31,"end":5616.93,"speaker":"Fr Andrew Stephen Damick","text":"So there's the Battle of Emmaus. And again, not Emmaus, but Pennsylvania. But yeah. So. So, okay, to give a little bit of background here to make it bring it home for Pennsylvanians, it'd be like saying I was on the road to Gettysburg. Well, Gettysburg is a town and it has, like, a Lutheran seminary there. But that's not what everyone remembers Gettysburg for. It's remembered as being the decisive battle of the American late Unpleasantness. That's for all of. All of my Southern friends out there. You know, it has this sort of importance as a major battle site. Well, in. For Judeans, that is the place of the Battle of Emmaus. And that is related to the Maccabees."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5617.01,"end":5620.69,"speaker":"Fr Stephen De Young","text":"Right there is this Battle of Maccabees. Talks about the Battle of Emmaus."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5620.69,"end":5622.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5622.61,"end":5643.19,"speaker":"Fr Stephen De Young","text":"That's the crucial battle where the Judean army, led by the Maccabee brothers, defeated the Greek forces. Was at the Battle of Emmaus, this is. And again, this isn't just a random connection. Emmaus isn't mentioned anywhere else in the Bible."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5643.83,"end":5644.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5644.71,"end":5649.35,"speaker":"Fr Stephen De Young","text":"Except first Maccabees and St. Luke's gospel. Right here."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5649.75,"end":5666.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, you know, the reason why this battle is so important is because the temple had been desecrated by anti. It wasn't Antiochus Epiphanies. Right. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5667.76,"end":5670.08,"speaker":"Fr Stephen De Young","text":"It was Antiochus iv. Epiphanies. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5670.08,"end":5682.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he goes in and. And he doesn't see an idol in there and is like, well, what the heck, you know? You know, he actually busts his way into the Holy of Holies, and so the temple has to be reconsecrated."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5682.16,"end":5686,"speaker":"Fr Stephen De Young","text":"Well, he actually. He actually. I think you're mixing him with Pompey, the Roman general."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5686.08,"end":5686.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, am I?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5686.88,"end":5688.84,"speaker":"Fr Stephen De Young","text":"Okay, I'm actually you in real time."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5688.84,"end":5692.23,"speaker":"Fr Andrew Stephen Damick","text":"That's fine. Both blaspheming pagans."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5692.55,"end":5697.19,"speaker":"Fr Stephen De Young","text":"Yeah. Antiochus Epiphanes was not his last name. Yes, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5698.47,"end":5699.51,"speaker":"Fr Andrew Stephen Damick","text":"Mr. Epiphanies."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5700.31,"end":5716.15,"speaker":"Fr Stephen De Young","text":"Antioche. Antiochus was obviously as a family name of the Seleucid dynasty, and they all took these titles. So one of them was Antiochus, I believe was. The third was Sotir the Savior."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5716.31,"end":5717.51,"speaker":"Fr Andrew Stephen Damick","text":"The Savior, yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5717.51,"end":5725.42,"speaker":"Fr Stephen De Young","text":"Yes. And so as if Antiochus iv. Epiphanes. Epiphanies meant he was the manifestation of a God on earth."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5725.66,"end":5725.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5725.98,"end":5733.66,"speaker":"Fr Stephen De Young","text":"That's what he named himself. And he. He actually went into the temple in Jerusalem and sacrificed pigs on the altar to Zeus."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5734.06,"end":5734.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5735.9,"end":5744.06,"speaker":"Fr Stephen De Young","text":"So. Yeah, you don't get much worse than that. So that. That's what's described as in Daniel, as the abomination of desolation."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5744.54,"end":5746.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5746.25,"end":5752.85,"speaker":"Fr Stephen De Young","text":"Because it rendered. Yeah. They couldn't use the temple anymore after that. It fell into disrepair. Yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5752.85,"end":5787.35,"speaker":"Fr Andrew Stephen Damick","text":"So the temple has to be reconsecrated. It has to be purified, it has to be made holy, set apart again for the use of God alone. What happens next? They're continually in the temple praising and blessing God. Amen. And then what happens next? Acts, the Book of Acts. You've got the coming of the Holy Spirit filling the creation on the day of Pentecost. And the day of Pentecost, it's, you know, the. The feast of the giving of the law. But isn't also. There's a. Isn't there a consecration of the temple associated with that as well? Or am I mixing stuff up?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5787.35,"end":5815.92,"speaker":"Fr Stephen De Young","text":"Well, this is. This is. So Hanukkah is the rededication of the temple. That's where the feast comes from. Right, right. The feast of Light. So they rededicate the temple. And although it didn't happen that time when the tabernacle was dedicated, when the temple was dedicated by Solomon, after everything is dedicated, after the blood is used to purify everything and consecrate everything, then the presence of God enters in as this. This fiery cloud."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5815.92,"end":5817.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Right, yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5817.2,"end":5848.8,"speaker":"Fr Stephen De Young","text":"And so you see this same dynamic. The end of Luke. Luke ends with Emmaus, and then they're in the temple, and then you pick up Acts, and they're not hanging around in the temple for some reason, because St. Luke's uses this imagery of now rededication of the temple being the whole creation. And then now that it's been rededicated, the presence of God, the Holy Spirit can come and dwell in sons, daughters, everyone because of this. This purification that has happened."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5849.2,"end":5852.96,"speaker":"Fr Andrew Stephen Damick","text":"Don't you know that Yalls body is the temple of the Holy Spirit?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5853.28,"end":5858.82,"speaker":"Fr Stephen De Young","text":"Right. And so this then plays out through the early chapters of the Book of Acts."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5858.98,"end":5859.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5859.38,"end":5886.71,"speaker":"Fr Stephen De Young","text":"The idea that everything has now been cleansed. So when St. Peter is called to go see Cornelius the centurion, who's a Roman, who's a Gentile, who's from one of the nation, pagan nations. Right. He sees this vision of the animals, the formerly unclean animals, being lowered in this cloth, and he isn't told, don't call unclean what I've created, or don't call unclean what I tell you is clean, but do not call unclean what I have made clean."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5887.11,"end":5888.55,"speaker":"Fr Andrew Stephen Damick","text":"Purification has happened."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5888.79,"end":5918.01,"speaker":"Fr Stephen De Young","text":"Right. So this purification has happened. So those animals are no longer unclean from outside the camp, and therefore, not metaphorically, but literally, Cornelius, this Roman is now also clean, just as clean as any Judean, and therefore able to receive the Holy Spirit as he does after St. Peter preaches the gospel to him. And then this triggers everything. This triggers St. Paul's mission now out to the nations to go and sort of retake them."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5918.41,"end":5918.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5918.89,"end":5923.05,"speaker":"Fr Stephen De Young","text":"And so cool. This stuff, consecrate them as sacred space."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5923.77,"end":5953.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. All right, well. Well, then again, like, we'll dip back into Hebrews, which references all of this. Right. So Hebrews chapter 9. Likewise, he sprinkled both the tent and all the vessels used in the worship with the blood. Indeed, under the law, almost everything is purified with blood. And without the shedding of blood, there's no forgiveness of sins. That last part, of course, often gets quoted out of context. The context is the purification of the space that's happening."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5953.37,"end":5955.89,"speaker":"Fr Stephen De Young","text":"Yes. Of material objects and physical space."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5956.13,"end":5985.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. By the blood. Blood, right. Right. Yeah. And then again, you know, Hebrews 10, how much worse punishment do you think will be deserved by the one who has trampled underfoot the Son of God? And here's the important part here, for our purposes, and it's profaned, the blood of the covenant by which he was sanctified and has outraged the spirit of grace. So again, the blood of the covenant does this sanctification, this is Christ as being the goat for Yahweh."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5985.84,"end":5989.8,"speaker":"Fr Stephen De Young","text":"The blood comes and purifies, and then the Holy Spirit comes to dwell there."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5990.35,"end":5990.91,"speaker":"Fr Andrew Stephen Damick","text":"Look at that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":5991.39,"end":6047.19,"speaker":"Fr Stephen De Young","text":"Yeah. And the pivot point when we go from the end of St. Luke's gospel to the beginning of Acts is the story he tells twice, and that's Christ's ascension into heaven, which he tells at the end of his Gospel. And then again, at the beginning of Acts, he narrates Christ's ascension again. And what Hebrews 9, verses 11 through 14 says that the key event that made this transition between the purification of just this small sacred space to the whole creation is when Christ enters into the heavenly sanctuary as high priest. Right. Which is describing his ascension into heaven. So St. Luke is doing this narratively, and Hebrews is just giving it to us, theologically explaining it to us."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6047.59,"end":6058.23,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. All right, well, before we go to break, we actually do have a call, and this is our friend Father Photius in Texas. So, Father Photius, are you there?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6059.35,"end":6061.03,"speaker":"Fr Photius","text":"I am. Can you hear me?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6061.43,"end":6063.75,"speaker":"Fr Andrew Stephen Damick","text":"I can hear you. Can you hear us?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6064.79,"end":6065.59,"speaker":"Fr Photius","text":"Yes, sir."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6066.31,"end":6070.55,"speaker":"Fr Andrew Stephen Damick","text":"All right, Father Photius, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6071.37,"end":6078.81,"speaker":"Fr Stephen De Young","text":"Can you hear me? Was your. Can you hear me? Was your one question for tonight, unfortunately. So it was good talking with you. Good night."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6082.25,"end":6107.57,"speaker":"Fr Photius","text":"Again. This has just not been my day. What can I say? Yes, Yes, I do have a question, and it pertains to First John, chapter two, verse two. Father Stephen, I. I know how dear this is to you. I read your dissertation, and it's magnificent."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6108.05,"end":6110.57,"speaker":"Fr Andrew Stephen Damick","text":"Now everyone's gonna want to read it. Don't mention that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6110.57,"end":6112.69,"speaker":"Fr Stephen De Young","text":"Yeah. You're rubbing it into a bunch of people."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6114.13,"end":6117.57,"speaker":"Fr Photius","text":"I'm sorry. Just so you all know, it's really good."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6119.73,"end":6120.21,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6121.81,"end":6125.21,"speaker":"Fr Photius","text":"Yeah. So I can. I'll catch the hate for that one."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6125.21,"end":6125.49,"speaker":"Fr Stephen De Young","text":"That's."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6125.64,"end":6153.48,"speaker":"Fr Photius","text":"That's okay. It says that Christ is the atonement or the propitiation for our sins, not for ours only, but also for the whole world. In what manner is the atoning work of Christ mediated to the world? Or could we say that it is mediated to the world by the way?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6153.71,"end":6159.95,"speaker":"Fr Stephen De Young","text":"Church. Yeah, here's where I have to say, that's a mistranslation."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6160.75,"end":6162.43,"speaker":"Fr Photius","text":"Yes, sir. Okay. By all means."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6163.23,"end":6168.19,"speaker":"Fr Stephen De Young","text":"Right. So. Yeah. How granular do I want to go?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6168.99,"end":6169.87,"speaker":"Fr Photius","text":"It's okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6169.95,"end":6198.47,"speaker":"Fr Stephen De Young","text":"This is like 25 pages of dissertation. I could just refer you back there. No, but there's literally a text variant there. This is how granular this gets. There's a text variant. There's. As to whether it says monon or monon, but that's how granular we get. But so it's. It's the only is is an adverb, not an adjective."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6199.35,"end":6199.75,"speaker":"Fr Photius","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6199.75,"end":6214.94,"speaker":"Fr Stephen De Young","text":"What they're translating as ours should actually be translated as our sins. There's a whole bunch of lexical stuff about that. So the correct translation is not only for our sins, but for the whole world. There is the words those of do not occur."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6217.34,"end":6219.42,"speaker":"Fr Photius","text":"In the Greek. That's myself."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6219.82,"end":6318.9,"speaker":"Fr Stephen De Young","text":"Yeah. So. Yeah, but that understanding of it is responsible for a lot of Western Christianity. Yes, because exactly the question you just asked. If it read that way, then you're asking the natural question, which is, what mediates between. Right. Because obviously, if you interpret it purely as related to sins and the forgiveness of sins, then not everyone in the world has their sins forgiven. But. And so you have to. And that's where Peter Lombard in the 11th century comes up with the idea of sufficiency and efficiency, that Christ sacrifice is sufficient for the world, but not efficient for the right, and on and on and on. But, yeah, that's all based on a mistranslation. The only other place where the phrase for the whole world, or the phrase the whole world to Olu Kosmo occurs in First John is in chapter five, the verse we read. The whole world lies under the power of the evil one. 1. So if you want to interpret the whole world in First John 2, verse 2, as referring to the people in the world, then St. John is saying that all the people in the world lie under the power of the evil one, which would include himself and the Church. And that makes no sense in the context of the Epistle where he's clearly distinguishing between two groups of people."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6319.53,"end":6320.25,"speaker":"Fr Photius","text":"So, yes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6320.65,"end":6328.01,"speaker":"Fr Stephen De Young","text":"Yeah, I'm actually not answering your question. I'm just pointing out that you asked a perfectly logical question based on a bad translation."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6330.01,"end":6331.21,"speaker":"Fr Photius","text":"It's quite all right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6331.69,"end":6332.25,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6333.21,"end":6333.77,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6335.61,"end":6336.73,"speaker":"Fr Photius","text":"Thank you so much."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6337.21,"end":6345.77,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you for calling, Father. Okay, we're gonna go ahead and take our second break. And we'll be back with the third half of the Lord of Spirits, Father."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6345.77,"end":6440.94,"speaker":"Announcer","text":"Andrew, Stephen Damick and Father Stephen DeYoung. Will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, Prayer, Fasting and Almsgiving books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless. We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6442.94,"end":6498.49,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, welcome back to the third half of the Lord of Spirits. We're talking about atonement and we've just taken a really whirlwind trip through the New Testament. Just, I don't know, astonishingly beautiful stuff looking at how Christ is both goats in the day of Atonement ritual. He's also the high priest who is performing the eschatological day of Atonement. All right, well, let's, you know, we're just kind of mop up now, right. We've got a few things that we sort of need to mention. And it's interesting actually. One of the first thing that's on our list, which is in our notes was something actually someone sent to me saying, hey, you guys going to mention this? And that's the image of what's called the suffering servant in Isaiah chapter 53. So, okay, so how is that related to what we've been talking about?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6500.41,"end":6502.93,"speaker":"Fr Stephen De Young","text":"Right. If at all, if at all."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6502.93,"end":6503.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6504.98,"end":6540.51,"speaker":"Fr Stephen De Young","text":"When the subject of atonement comes up in most Western theological circles, this is where they go right is to is to Isaiah, specifically Isaiah 53, verses 4 and 5, which has those famous lines about he was wounded for our transgressions by his stripes we are healed all of that language, you know, he took these. He took our infirmities upon himself. And as you can imagine, that's then taken in a certain direction."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6541.47,"end":6542.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6542.83,"end":6553.31,"speaker":"Fr Stephen De Young","text":"Here's the thing, though. We have a text in the New Testament that says that those very verses were fulfilled."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6553.95,"end":6635.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Okay. Matthew, chapter eight. I mean, it's, it's amazing. This is from an apostle letting us know how to interpret that Isaiah passage. Matthew, chapter 8, verses 14 through 17. Just to summarize, this is where Christ heals the mother in law of Peter, and then also after that, lots of people are brought to him who are demon possessed and sick people. And he heals them. He drives out the spirits. He says he cast them out of the word. And then chapter in verse 17, that it might be fulfilled, which was spoken by Isaiah the prophet, saying he himself took our infirmities and bore our sicknesses. So Matthew is saying this is now fulfilled. What was the suffering servant passage of Isaiah by Jesus healing, ministry of sickness and demon possession. Right. It doesn't say that it was fulfilled by Jesus absorbing their diseases and becoming sick or absorbing their demons and becoming possessed himself. He doesn't take it on himself in that way. He heals them. And that's where, that's how Matthew interprets that passage from Isaiah, chapter 53. And you know, when an apostle interprets the Old Testament for you, we go by that."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6636.69,"end":6641.23,"speaker":"Fr Stephen De Young","text":"Yeah, but, but, but we're not just, we're not just playing the. Nope. Card, right?"}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6641.23,"end":6642.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, no, no, no."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6642.15,"end":6642.27,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6642.27,"end":6644.79,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no. Right. There's. There's more. Yeah. There's more to it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6644.79,"end":6668.8,"speaker":"Fr Stephen De Young","text":"Right. Because, because that kind of response kind of begs the question, right, yeah. Where it's sort of like, well, okay, what is St. Matthew talking about? Right? Like how, how, how does him healing diseases fulfill that? Right. And. And to get it that from some of the church fathers."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6669.04,"end":6669.6,"speaker":"Fr Andrew Stephen Damick","text":"Yay."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6670.16,"end":6674.08,"speaker":"Fr Stephen De Young","text":"Who, who get what St. Matthew is doing here."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6674.64,"end":6675.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6675.04,"end":6712.49,"speaker":"Fr Stephen De Young","text":"And not only do they get what St. Matthew is doing here, but they talk about this in terms of atonement. Right. They see this as a kind or type of atonement. So it does end up being germane to our, to our topic this evening. So probably the most, the most famous church father to talk about this in terms of atonement explicitly is Saint Athanasius. Saint Athanasius, the great Saint Athanasius of Alexandria in his work on the Incarnation."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6713.13,"end":6716.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. His single most popular and famous work."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6716.01,"end":6717.99,"speaker":"Fr Stephen De Young","text":"Yes, well, his most well known work."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6718.54,"end":6718.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6719.58,"end":6749.03,"speaker":"Fr Stephen De Young","text":"And it's interesting, I recently heard a certain. He. He identifies as a Protestant. But most Protestants would not identify him as a Protestant biblical scholar talking about atonement and who tried to read Saint Athanasius on the Incarnation. And he just said, I can't tell what he's doing in terms of his quote, unquote. I'm trying to address it in terms of atonement theory. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6749.11,"end":6749.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6750.23,"end":6839.6,"speaker":"Fr Stephen De Young","text":"And from that perspective, it just doesn't make sense. But what he's on to is what St. Matthew is talking about. So, in short, because our first two halves were already more than half of our time this evening, so we're not going to go through the whole work. Saint Athanasius talks about in tone atonement as happening through the Incarnation, that, that by God becoming man, he by virtue of his holiness as God, that same holiness that they couldn't see and live right on the day of atonement, the Old Testament. By becoming man, he purifies humanity not just in terms of, like, we tend to think of this in quasi spatial terms. Right. Like almost like the, the human body seen as a physical thing. Yeah. We might go a little further if we understand that the body is this nexus of, of powers or potentialities to say, well, all of the human powers and all of the human capacities. But for Saint Athanasius and St. Irenaeus does something very similar. Before him by a couple of centuries, he means spatio temporally. Right. That Christ not only sanctifies humanity in its parts and in its powers, but the moments of a human life."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6841.92,"end":6842.48,"speaker":"Fr Andrew Stephen Damick","text":"Birth."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6842.88,"end":6849.68,"speaker":"Fr Stephen De Young","text":"Childhood, young adulthood, adulthood, up to and including a human death."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6850.97,"end":6851.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6851.45,"end":6865.77,"speaker":"Fr Stephen De Young","text":"And that by living through those, not just, again, spatially, but temporally, those things are sanctified and purified by the union of Christ's divinity and humanity in his person."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6866.17,"end":6866.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6866.81,"end":6881.78,"speaker":"Fr Stephen De Young","text":"That perfect union thereby sanctifies, makes holy, purifies humanity in our basic composition. Right. And so he's using atonement in this biblical sense we've been talking about, of purification."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6882.34,"end":6882.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6883.3,"end":6907.31,"speaker":"Fr Stephen De Young","text":"But Christ does it by living it. And so this is what St. Matthew is seeing too, in the prophet Isaiah, that by Christ becoming man and living in this world and suffering and experiencing human weakness voluntarily, etc. Etc. That by doing that he is healing our humanity."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6907.87,"end":6987.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's cool. And that just sort of beautifully anticipates St. Gregory the Theologian, where. And now he's speaking in the context of Christology, although, I mean, if you understand Christology in this full sense, it really just lights up. You know, where St. Gregory says, what is not assumed is not healed. And now he's talking about Christ has to be fully human, but within this context of atonement, that Christ assumes the whole human experience and therefore heals it all. He purifies and atones, covers it by virtue of being here, by virtue of becoming human and going. It's. I don't know, It's. It's really cool. It's really, really cool. I've said that about 20 times tonight, but this is. I, I don't know. I, I love it when this, the fundamental unity between the old and New covenants is shown. Yeah, it's, it's, you know, the, the, the unity of it all and including also the teaching the church fathers and what's in the divine services and so forth. It's, it's, it's so impossibly unified. It's so impossibly one. Right. But of course, what is impossible for man is possible for God. Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6987.99,"end":6989.51,"speaker":"Fr Stephen De Young","text":"I love it when a plan comes together."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":6989.91,"end":7005.52,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Yeah. The A team. Yeah. All right. Yeah. Okay. So there. But there was something else also a connection from John 17. Right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7007.12,"end":7011.2,"speaker":"Fr Stephen De Young","text":"You know, John 17, 18 and 19 also talks about the same idea."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7011.68,"end":7012.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7012.12,"end":7027.68,"speaker":"Fr Stephen De Young","text":"Where. Where Christ. This is in the context. This is part of the long reading on Holy Thursday evening. Where, Where Christ. Is this sometimes referred to as Christ's high priestly prayer? Appropriately enough."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7028.32,"end":7028.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7029.6,"end":7054.2,"speaker":"Fr Stephen De Young","text":"And Christ says in verses 8, 18 and 19, as you sent me into the world, I also have sent them into the world, and for their sakes, I sanctify myself that they also may be sanctified by the truth. And of course, the truth in St. John's gospel is Christ himself. When Christ says he's sanctifying himself, it's not as if he was unholy before and he's doing some action."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7054.84,"end":7055.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7056.12,"end":7077.94,"speaker":"Fr Stephen De Young","text":"That him sanctifying himself is talking about his incarnation, his earthly life, and his coming, his coming death, in which he has sanctified himself, his person, in order that his disciples in all ages would be sanctified, would be made holy."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7078.82,"end":7413.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's cool. All right, well, the third half is going to be the shortest half, but, but. Yeah. Okay, so to, to wrap up then, just some. Some final thoughts. You know, I mean, the nature of this podcast is not. The purpose of it, I should say, is not to be apologetical. Like, we're not, you know, we're not here to say this is why Catholics and Protestants and various other kinds of religious people are wrong. Right. But in, in, in this particular case, even though this episode is not primarily apologetical, as the whole podcast is not, there is a Disconnect that happens for people when they read the scriptures and as we've seen, bring a lot of assumptions into the scriptures. They think that sins are put on animals and then the animal is sacrificed to God. That never happens in the scripture anywhere. And so I think it's really critical that we understand that atonement as the scripture depicts it is not some kind of system, right, where, like, this is how you get saved. And it works like this. Sins get, you know, for instance, in one version, sins get transferred from you to Christ, you know, and he has to suffer now and be killed and sacrificed. You know, like that's not what the scripture actually depicts. And here's the problem, here's the problem with that. Not only is that I think just incorrect, but it also makes it so that all the other ways that as we've now seen so many of them, that the ritual of the Day of Atonement is expressed in the New Testament and in the work of Christ, you miss a lot of that because it's been reduced to a system. And our purpose is as St. John's purpose. You know, these are written that you may believe that Jesus is the Christ and that believing you may have life in his name. That's the purpose of this podcast, right? So I mention all that because as we read scripture more and as we live the Christian life more, if we understand what it is that Christ is doing and how the scripture tells us what he's doing, then that gives meaning to so much of our lives, right? Like if, if you go through something, for instance, and you experience it as a kind of harrowing, right, A purification, a cleansing, a cleaning out, you know, as we're now, right, we're about to enter into great Lent, it is a process of purification. I mean, that is what great, among other things, that is what great Lent is. But if we understand purification just in this kind of reduced sense, without all of this atonement imagery from the Atonement Day of Atonement ritual and then the eschatological day of Atonement, right? Then we can tend to look at Christian life as a kind of self help program. Okay? I'm just trying to get better, you know, like, I'm like I'm doing a diet, a spiritual diet, you know, and that can lead to a lot of despair. I mean, I, you know, if you're a pastor and you're hearing confessions and you hear people struggle with all of the disciplines of the church that are intended, for instance, to purify us, to help us participate in purification, then there's a lot of discouragement that can come from that. And I think a lot of that comes because of a kind of reduced vision of what this is about. Right. And the other problem with seeing atonement as a kind of system is that it actually, it disconnects it from the actual Christian life. It becomes this mechanism that I sort of get benefited, get, you know, that benefits me rather than something that I ritually participate in. Right. You know, one of the big questions that Father Stephen often asks is not just what does this mean, but what does this do? Right. And. And that is the most important question to ask when you're looking at ritual in Scripture. And then, of course, as ritual gets repeated and reused and all of this kind of stuff in the rest of Scripture and in the church fathers and the divine services and so forth. What does this actually do? Well, we've looked at this one particular ritual, and we now we know what it does. And it does the same thing in us, for us, around us, throughout the whole cosmos. And that is so. So heartrendingly beautiful. Right. And it should inspire us to cry out to the Lord for mercy and with gratitude and thankful, you know, thankfulness for all that he has done. Right. And then that we then would enter into that and to participate in it ourselves. So those are some of my takeaways from our conversation this evening, Father Stephen."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7415.57,"end":7421.49,"speaker":"Fr Stephen De Young","text":"Yeah, we've covered a lot and a lot of big stuff, so this one is kind of the hardest button to button."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7421.49,"end":7421.81,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7424.21,"end":7805.05,"speaker":"Fr Stephen De Young","text":"The. The problem, and we already talked about this a little bit with Father Photius. A lot of the problems we run into theologically and then that end up directly affecting our life in Christ come from not giving the wrong answers per se, but from asking the wrong questions. And I think we've seen tonight how a lot of discussions of atonement are based on reading backwards. So you start with a developed theological idea, read it back into the New Testament, and then from there back into the Old Testament, instead of what we hopefully did with reasonable success tonight, which is started the Old Testament and read forward and. And see how things unfold. But also that there's a fundamental question that gets asked in the west, and it comes under the banner of atonement, despite the fact that there's not a whiff of it in. In what we've seen in our survey tonight. And that's not just how does salvation work, but how does salvation work from God's end. It's not a question of how does salvation work in the sense of what must I do to be saved? Which is a salutary question, pardon the pun, but it is. How does it work from God's end? How does God see it working? How does God make it happen? And a very well known biblical scholar, and a very good biblical scholar, Simon Gathercole, who wrote the magisterial material on the Gospel of Thomas, for example, amongst many other great things, did a book a few years ago on atonement, trying to defend the particular quote, unquote atonement theory of penal substitutionary atonement. You get these atonement theories that are then theories of how it works from God's end, how God does it. And he argued, one of his most prominent arguments that he repeated again and again was that penal substitutionary atonement is the only theory of how it works that has a mechanism for how it works. That's his work. The idea there's a presupposition there that it's somehow mechanical, that God saving us is like an elaborate Rube Goldberg machine in an okay, go video or something where he puts things in motion and at the end somebody gets saved. And not only is that a bizarre assumption that there's no reason to believe is true, even if it were true, there's no reason to believe that we as humans could understand how it works from God's side. But the dangerous thing is, again, not just being wrong, but how this affects our life in Christ. I am the biggest nerd anyone will ever meet. I am an omni nerd. I can describe to you the inner workings of countless fictional univers, right? I could tell you all about Arrakis, the desert planet. I could tell you all about Gallifrey. I can tell you all about Nimbus 5, the planet of galactic peace. I can understand all that. And that's fun, figuring out all the details, the systems, all the lore. This kind of thing is fun. And it can become very easy when exposed to theology, especially theology of this kind, kind that's trying to explain how everything works and everything fits together and see things from God's perspective, to approach our Christian life from that perspective, that it's about me figuring things out. It's about me piecing things together. It's about this sort of intellectual construct that I want to form in my mind where I have the perfect theology and I understand everything. Strictly speaking, that's not Christianity, it's Gnostic mysticism. The reality is more like what we were talking about tonight that we see unfold in the scriptures with atonement and everything else that there are these cosmic realities of spiritual warfare, of Christ defeating the powers of evil, of Christ setting us free and purifying us, making us holy and setting us apart and bringing us into his kingdom that are cosmic realities that each of us has been given the gift of being able to participate in. In time, from moment to moment, day to day, we come to experience these realities ever more fully. We experience them in worship, we experience them in our interactions with other people. When we show the love of God to them, we experience them in the peace we receive from God, the actual forgiveness and healing we receive for our actual sins on a day to day basis. This isn't just an intellectual maneuver. This is something we can experience and participate in in real time. And that's what Lent and Holy Week and Pascha are going to be all about. So it's not about me or me and Father Andrew or the Orthodox Church or anyone else coming and just bashing on Western churches and saying haha, you guys are all wrong. You guys are all asking the wrong questions. It's about the reality of when the rubber meets the road and how each of us approaches our Christian life. What we want is not just to understand salvation, but to experience salvation. And understanding the cosmic realities and how we come to participate them ritually and every other way is the way that that experience becomes real to us. So I think that's the, hopefully the important takeaway beyond all the fun stuff and interesting Bible tidbits, that this isn't just about knowing the right interpretation, thinking the right thing, but it's about experiencing the reality of Christ."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7807.21,"end":7838.54,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Thank you very much for listening everybody. On our next episode we're going to be starting a two part series on sacred geography. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but can't respond to everything you send. So much we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7839.1,"end":7856.06,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. If you have a Facebook account you should probably delete it. But if you can't like our Facebook page and join our Facebook discussion group where we'll be your oasis amongst the evils of social media."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7856.54,"end":7861.27,"speaker":"Fr Andrew Stephen Damick","text":"Leave reviews and ratings, but most importantly share the stream with a friend whom you know is going to love it."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7861.91,"end":7869.11,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7869.51,"end":7871.83,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you all."}
{"episode_id":"LOS - #015 - 2021-03-11 - The Priest Shall Make Atonement","start":7880.63,"end":7917.89,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
