{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":0.64,"end":65.3,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":68.26,"end":195.67,"speaker":"Fr Andrew Stephen Damick","text":"Good evening everyone and welcome to the Lord of Spirits podcast. I am Fr. Andrew Stephen Damick in Emmaus, Pennsylvania. And with me from the almost the Gulf coast is Fr. Steven DeYoung from Lafayette, Louisiana. And if you're listening to us live, you can call into this program at 8-55-AF-RADIO. That's 855-237-2346. And we're going to get to your calls in the second part of today's show. So one of the historical movements that has shaped Christian culture in the west profoundly is the Protestant Reformation. And one of its products was the focus on this question, how am I saved? How am I saved? Now, even though this question is the sort of perennial Protestant question, it has actually affected Orthodox and Roman Catholic Christians as well. Now, it's not an unorthodox thing to ask, to be sure, but the way that it gets asked and the way that has become embedded in the individualistic culture of the modern west has brought us to what I believe are some misleading conclusions about what salvation is. So tonight we're going to be talking about theoses and I think you'll see what I mean about this problem as we go. So for our Orthodox listeners, I hope that we'll be giving you a fuller picture of what theosis means and you know, for our non Orthodox listeners. Well, enjoy the ride. So to start us off this evening, let's discuss how salvation gets talked about both by all kinds of Christians and also by Orthodox Christians in the English speaking world. I mean, do we Orthodox really have a problem in the way that we're talking about it? And you know, especially for those who May not, may not know this word theosis. What is the sort of quick definition of what that means? So why don't you give, you know, the elevator speech, although you're not really known for your elevator speeches. Father Stephen, why don't you give us the elevator speech on what theoses is? Someone says, what is that word you keep using?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":197.07,"end":274.61,"speaker":"Fr Stephen De Young","text":"Yeah, well, and I think part of the problem we have in this area is that we don't go much beyond the elevator speech. There's sort of an orthodox meme about theosis, which is we'll talk about theosis. We usually reference St. Peter's comment that we become partakers of the divine nature, sometimes called divinization. Someone will quote Saint Athanasius saying that God became man so that men might become gods. Everybody gets scared and thinks we're Mormons. So. But part of the, part of the issue, I think is that that hasn't really been integrated into a lot of the way we think. We sort of tack that on as an adjunct. And then when we, even as Orthodox Christians start talking about salvation and soteriology, which is the fancy word for talking about salvation, we sort of lapsed into a kind of amalgam of Protestant and Roman Catholic views of salvation. Usually slightly the opposite of whoever we're talking to about it."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":274.93,"end":275.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":275.29,"end":277.33,"speaker":"Fr Stephen De Young","text":"If it's a Protestant or a Roman Catholic."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":277.41,"end":559.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a kind of apologetical point. And yeah, you know, it's interesting to me. I mean, certainly there is a difference between the way that English speaking Orthodox Christians talk about salvation and the way that Roman Catholic or Protestant Christians talk about salvation. We're not saying that it's kind of, kind of all the same, but there is kind of an issue with at least the way that English speaking Orthodox Christians tend to talk about salvation, even when we talk about theoses. Right. And part of what we're going to try to accomplish this evening is to integrate that into what we've been discussing for our last several episodes and hopefully to show its connections to all parts of orthodox tradition, which is what this whole show is all about. But, you know, so the elevator speech version of theoses is that. So it comes from the Greek word theos, which means God. So the elevator speech version is that we become like God. Right. And that's what salvation is, is that we become like God. And there's that line from St. Peter becoming partakers of the divine nature. And the reason why, I think that the way that we tend to talk about it is problematic is this, as I said, you know, in the Protestant Reformation there was this focus on this question, how am I saved? How do I get saved? How am I? How do I be saved? And certainly Protestant, Catholic answers to that question are different. But if you think about the question itself, the question itself focuses in, on an individual human person realizes he has some kind of problem and that that problem needs to be fixed. Right? And you know, we won't get super deep into this because this is, the show is not about apologetics. This show is simply about trying to talk about the orthodox tradition. But at least for the sake of comparison, we should note that most Protestant and Catholic understandings of what salvation is about is ultimately about satisfying God's divine justice. Right? Now how you satisfy God's justice varies between Protestant and Catholic presentations. And certainly there are multiple Protestant presentations and there's even some variation sometimes within Roman Catholicism. But basically that's the problem is that, you know, there is a justice problem and you know, someone has committed a crime and so that needs to be dealt with. Now I'm simplifying. So if you are Catholic or you're Protestant, please don't think that I'm trying to summarize every single thing that you believe about this. I'm not. I know there's way more to it, okay? But nonetheless, that's still kind of the problem is that God's divine justice needs to be satisfied. And so then there's the focus on, well, where do I stand? On which side of the line am I on? Right? And you know, for the orthodox Christian in the English speaking world, the way that it often gets talked about, and again, we're not necessarily talking about official theology. We're certainly not talking about what you hear in the church services. We're talking about maybe what you hear in homilies or the way that people talk about it on the Internet. You know, so it's that kind of discussion level question, right? Is that we sort of, sometimes, sometimes we'll kind of agree that there's this problem that I need to get on the other side of that justice line, satisfy God. And oh, by the way, what happens when I do is that I become like God. So theoses is kind of somewhere downstream of salvation in some sense or that, well, we'll say, yes, theosis is salvation and it's a kind of personal improvement, right? A personal experience. And that to me is the problem is that it's become individualized. And now sometimes you'll hear, people will say, well, you know, we're damned alone, but we're Saved together. So they'll kind of, you know, make this sort of nod to ecclesiology, right, that salvation is, it happens, but it's kind of a group of us doing it together. But the thing that I've come to believe is that that is not enough. You know, like it's not, it's not entirely wrong, but it's not enough. And it doesn't really, it doesn't do justice, no pun intended, to orthodox tradition. Right. What do you think? Am I getting the analysis of the problem right here, Father, from your point of view?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":559.75,"end":623.12,"speaker":"Fr Stephen De Young","text":"I think so. And I think in large part it stems from the fact that I think for too long we've sort of looked at it as an approach or a metaphor where, you know, well, the, the west takes approaches that are, you know, they use courtroom metaphors and, and banking metaphors and these other kind of metaphors. And the east tends to use more, you know, ontological metaphors, talks more about healing and transformation. And these are different perspectives and these are different. Right. And so when, when someone says, when one of our orthodox fathers and forefathers says, you know, that, that theosis is the orthodox view of salvation, we all sort of nod our heads and we say, oh yeah, I guess that's sort of our perspective. We see it more that way. And that's not what's being said by our fathers and forefathers. They're making a claim about what the apostles taught us, that they were taught by Christ, that salvation is."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":624,"end":624.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":625.2,"end":671.21,"speaker":"Fr Stephen De Young","text":"And that it is. It is not. And, and, and not to spoil, but to tease. As we go forward tonight, we're going to see that this, this represents a fundamentally different way to read. For example, St. Paul, who talks about salvation a great deal, that this isn't just a different perspective, this is a completely different way of understanding him. Looking at the words and terms he uses and how he describes it that I think a lot of times we even as orthodox Christians have glossed over because we've been sucked into sort of internecine Western debates about soteriology. And it's right, whose side are you on?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":671.45,"end":739.2,"speaker":"Fr Andrew Stephen Damick","text":"And there's also just kind of a cultural problem. You know, culturally we're individualists. So when I conceive of Christianity, I conceive of what is my problem and what do I need to do to solve it, you know, that, that's the way that we tend to, to think about it. So as a result, you know, looking at salvation as a, as a kind of religious version of a self help program or of a Workout program. I mean, I'm saying that people are trying to reduce it or that they're functioning in bad faith, right? They're not. I mean, maybe some are, but I don't think most are. But the problem is that it is fundamentally individualistic, right? That even if you read salvation as being theosis, you know, deification, divinization, whatever translation you want to give to that word, it's still often conceived of in a kind of individual way, like, okay, now work on your theoses. You know, this is my, put it."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":739.2,"end":745.96,"speaker":"Fr Stephen De Young","text":"That way, spiritual program to become more virtuous and more peaceful and more successful. Right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":746.2,"end":808.24,"speaker":"Fr Andrew Stephen Damick","text":"What does it mean to become more like God? And often then the answer is given in moral terms. Or maybe, like, if you get really advanced, then you can have what we might think of as supernatural powers, you know, because look at what some of the saints are capable of, right? You know, it's a kind of enhancement. Right. I think, you know, I think that maybe that's one of the best ways to understand what kind of the problem is. And again, we're not saying that Orthodoxy has gotten this wrong. What we're saying is that a lot of orthodox people don't quite understand the fullness of the Orthodox tradition of what salvation is, of what theosis is. And so we're going to try to deal with that. We're not going to claim to get it all from this, but we're going to talk about this, particularly from the angle that we discuss things and God willing, give a much fuller picture. And I hope that it's going to be a more hopeful picture, actually something that's more doable in a lot of ways. I think it is."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":809.28,"end":831.49,"speaker":"Fr Stephen De Young","text":"Yeah. And what's opposed to. We've been saying what it isn't, what's opposed to that kind of individual view and what we're going to be saying and what we're going to see tonight that the scriptures are saying is that this is about the purpose for which the world was created. This is about the purpose for which human beings were created."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":831.81,"end":832.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":832.45,"end":843.89,"speaker":"Fr Stephen De Young","text":"And the destiny of humanity. So it's something much bigger than just, you know, am I going to be able to keep my patients better when I'm stuck in traffic?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":844.37,"end":850.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's not just that something broke and it needs to be fixed. Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":850.65,"end":865.41,"speaker":"Fr Stephen De Young","text":"This isn't plan B. Like, God had a Plan A, people sinned, and so now here's plan B. Right? This is plan A, Right. And it runs, as we're going to see tonight, from Genesis to Revelation, literally in The Scriptures."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":865.73,"end":936.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So let's start that there. And I think that especially for those of you who maybe who haven't heard of theosis before and you're wondering like, is this, what is this, is this even Christian talking about people being divinized or deified, you know, because again, because Father Stephen is a biblical scholar and because as a former pastor myself, I strongly have emphasized and will always for my whole life emphasize that the main element of orthodox tradition that orthodox Christians need to know is the Bible. We're going to focus especially on the Bible. We are going to talk about some stuff from the church fathers as well. We're going to especially focus on the Bible. And so we're going to begin by showing how theoses is right there in the Bible. And you don't even have to wait until you get to the New Testament. It's in the Old Testament. It's right there at the beginning. So let's start especially with the promises to Abraham. God talks to Abraham and says, this is what I'm going to give you. This is what your destiny is. So let's talk about that. Take us on in. Father Stephen, everybody got your Bibles so."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":936.82,"end":1041.56,"speaker":"Fr Stephen De Young","text":"Well, if, you know, hopefully folks have and if they haven't, hopefully they'll go back and listen to the last couple episodes. Also the last episode we talked about the fall of the, the demonic and hostile powers, all 5ish of them. And other than that 5th ish 1 other than that 5th ish one, all of those are described within Genesis 1 through 11, the first 11 chapters of the first book of the Bible. And then so this happens culminating in the Tower of Babel. And then the beginning of the response to that comes in Genesis 12 with Abraham. And so this is really the beginning of, of that response. So we talked about how at the Tower of Babel event that, that God had distanced himself from humanity. Humanity had tried to control God and manipulate him and God and response had stepped back and put sort of lesser spiritual powers in charge to govern the nations. And so now when he comes to Abraham and appears to Abraham that Abraham sees him and talks to him, by the way, he makes these promises to Abraham over against what's happened. So and these promises are reiterated three times during the story of Abraham using similar language. So the, the first of those is in Genesis 15, verse 5. And he that being God brought him being Abram outside and said, look toward heaven and number the stars if you are able to number them. Then he said to him, so shall your offspring be Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1041.56,"end":1054.62,"speaker":"Fr Andrew Stephen Damick","text":"And probably most people, when they hear that, they think, okay, God is saying, abram, you're going to have a lot of descendants. Look how many stars there are. You're going to have. That's going to be your descendants. Right, okay."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1056.62,"end":1065.82,"speaker":"Fr Stephen De Young","text":"Right. Which already, I mean, it's going to become more clear as we go. But already notice he doesn't say so many shall your offspring be."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1066.94,"end":1067.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1069.1,"end":1080.94,"speaker":"Fr Stephen De Young","text":"The word there, that's translated, so shall your offspring be, meaning your offspring are going to be like them. Now, that can include quantity, but it's not necessarily limited to quantity."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1081.34,"end":1145.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it actually reminds me of, you know, John 3:16, God so loved the world. Right. Which a lot of people take as meaning. God loved the world very much, but it actually means God loved the world in this way. Right. And so it's the same idea, you know, in this way, your offspring shall be, you know, they're going to be like the stars. So that's a really suggestive thing. Let's continue on. There's more. There's more references to stars. So seven chapters later, right? Seven chapters later, Genesis 22:17. This is God speaking again. I will surely bless you, speaking to Abram. And I will surely multiply your offspring as the stars of heaven and as the sand that is on the seashore, and your seed shall possess the gate of his enemies. So this is similar. Right now, there's going on here."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1147.05,"end":1188.03,"speaker":"Fr Stephen De Young","text":"There's a parallelism here that you don't necessarily see in English translations. Okay, that's there, the original Hebrew. So he's saying God is saying to Abraham two things. He's going to bless him and he's going to multiply him. Those are two things he's going to do. And then he says his offspring are going to be as the stars of heaven and as the sand of the seashore. So the his offspring being as the stars of heaven corresponds to God blessing him. His offspring being as the sand on the seashore corresponds to God multiplying him."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1188.9,"end":1193.06,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. So is. So is this sort of set up grammatically in Hebrew so that this is obvious?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1194.02,"end":1205.7,"speaker":"Fr Stephen De Young","text":"Yes, that's why there's a parallelism there in the structure of the phrase. So they're going to be many. The quantity is going to be like the sand of the seashore."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1206.18,"end":1206.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1206.54,"end":1266.87,"speaker":"Fr Stephen De Young","text":"And then the quality, the way in which they're going to be as the stars of heaven. And this adds this additional element of his seed possessing the gate of his enemies. And that's an image, the gate of a city. If you have A walled city. The gate of that city is the center of power, both in terms of the defense of the city, obviously, but also in the social custom of the ancient near east and of Israel. That is where the men of the city would go. That's where cases would be judged, the equivalent of trials would be held. That's where business contracts would be ratified. So this is the center power of power. So this is talking about his, his seed basically taking the position, taking the position of power of his enemies, which is part of them becoming like the stars of heaven."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1267.11,"end":1326.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, and that's, that's interesting that you mentioned that all those things happen at the gate. You know, it's this kind of liminal spot between civilization and what's out there, you know, the chaos, the wilderness and so forth. And, you know, there's a lot about authority and power that are specifically about standing at that place, that border place. You know, you think about if you, let's say you hire a security guard for your home, you're not going to have him in, you know, the basement. You're going to have him at the door. You know, you're going to have him at those, that, that entrance, you know, So I, I think that that's a really interesting, interesting thing. As well as we kind of build this. Okay, so we've got one more line from Genesis that's about God's promises to Abraham. And is he Abraham by this point? I, I can't remember exactly which chapter that happens in."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1326.47,"end":1328.23,"speaker":"Fr Stephen De Young","text":"By 26, he's Abraham."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1328.8,"end":1397.76,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, so it goes Abram to Abraham. All right, maybe we could talk about that some other time. But yeah, so in chapter 26, God makes again, very similar promise to Abraham. He says, Chapter 26, verse 4, I will multiply your offspring as the stars of heaven and will give to your offspring all these lands, and in your offspring all the nations of the earth shall be blessed. So you get, it's interesting in that one. You get not only the sense of multiplication, lots of them, but again, they're as the stars of heaven. And then also building on the previous one, there's this notion that they're going to take the lands, right? That the lands are going to belong to his offspring. And in your offspring all the nations of the earth shall be blessed. So you've got now on an additional, I mean, this is the way I'm reading anyway, that there's this additional sense that the whole earth now is going to partake of the blessing that is in, in these promises given to Abraham, right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1397.76,"end":1459.48,"speaker":"Fr Stephen De Young","text":"That the, the, the offspring of Abraham becoming the seed of Abraham becoming as the stars of heaven is going to have this beneficial effect for the nations, the nations who had just been scattered at Babel, the nations who had just been assigned to these other powers. And then also this gives us the relationship to the land because this is a typical kind of prophetic promise that we find in the Old Testament. And this is important because this is a section that's a lot of our Christian friends misinterpret in terms of the relationship of the land to the promises to Abraham. When God gave promises and gave prophecies all through the Old Testament, and even there are examples in the New Testament, there was a sign attached to that prophecy. There was some immediate fulfillment. There was something that happened immediately in the short term that they could see and that served as the guarantee that the greater prophecy was going to come true."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1460.28,"end":1462.99,"speaker":"Fr Andrew Stephen Damick","text":"Kind of down payment, so to speak, right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1462.99,"end":1497.28,"speaker":"Fr Stephen De Young","text":"If you want a real quick example, you can see this in Luke 2 with the shepherds, right? The angel comes to the shepherd, shepherds and says, you know, unto you is born this day in the same day, but a savior who is Christ the Lord, right? So the Messiah has been born. And then they say this will be assigned to you. If you go over here, you'll find this baby laying in a food trough, right? Which you wouldn't expect to find. And so when you go over there and you see the baby in the food trough, you'll know that, yeah, that's the Messiah. Because that's an odd thing you don't expect to see, right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1497.6,"end":1502.64,"speaker":"Fr Andrew Stephen Damick","text":"Not to mention angels talking to you, right? Also a little odd."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1503.92,"end":1532.4,"speaker":"Fr Stephen De Young","text":"Well, so the strip of land in Palestine, right? Canaan is not the promise to Abraham. It is the sign or the down payment. And so at the end of Joshua, when, at the end of Joshua, they're emphasizing that God had given all the land that he promised to Israel, right? That's not the end of the Bible. It's not like, okay, promise fulfilled, we're."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1532.4,"end":1534,"speaker":"Fr Andrew Stephen Damick","text":"Done, good job God."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1534.88,"end":1563.14,"speaker":"Fr Stephen De Young","text":"But it's establishing that, yes, God did this, and so we can be confident that the rest is going to happen. And so, for example, when Hebrews says that Abraham was looking for a heavenly promised land, that's not some kind of weird allegory. That's Abraham was actually looking for that, right? And the, the land was the sign that he would truly receive it."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1564.02,"end":1749,"speaker":"Fr Andrew Stephen Damick","text":"Huh? Yeah, well, okay, so it's, it's clear. I mean, you know, the idea that Abraham is going to have a lot of descendants, that's pretty straightforward. The idea that his descendants are going to receive the land of Canaan as. And you know, as a kind of down payment, that's pretty straightforward. So let's talk about what it means that they're going to be as the stars. And unless you're brand new to this show, you probably kind of know where we're going with this. But for those who are brand new and maybe for a little review for everybody else. So let's talk about what it means to be as the stars. Right. As we talked about in our second episode where we discussed the angelic hierarchies, we mentioned specifically, for instance, that there's one of the angelic ranks that are called the virtues in English translation anyway, and that their task is to help God to govern the creation, you know, that they're kind of in everything, you know, And I mean, if you have to sort of. And this is not all there is to it, but if you. If you need an image, you know, you can. You can ask yourself, well, what does. What makes the wind blow and the stars shine and the oceans move and whatever, you know, certainly you could say, well, there's these, you know, gravitational forces and these, you know, those kinds of things. But that doesn't answer the question as to why. Why it is that creation even works the way that it does. Right. You know, science can just sort of observe this stuff. But ancient peoples understood that there were spiritual beings who were engaged in the, you know, the maintenance, so to speak, the working, the functioning of creation. And that that includes the stars, includes the sun and the moon, includes, you know, everything. And of course, that's the reason, for instance, that, you know, ancient pagans would associate their gods with these particular elements of creation is because they understood that creation had spiritual beings helping to make it go. They didn't come up with spiritual beings as an explanation for the things that they couldn't understand, which is kind of the modern materialistic interpretation of ancient religion. Excuse me, but rather they had. Had experience with these beings. And eventually, of course, you know, some of them fall and they start to worship them, which is not good. But nonetheless, there is this sense that they have this association. And so, you know, when God is talking about the stars to Abraham, he doesn't mean that your descendants aren't going to be like big, blazing, you know, balls of gas. Right? That's not what he means. What exactly does he mean? Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1749,"end":1777.23,"speaker":"Fr Stephen De Young","text":"Well, he's. We have to remember, of course, that that Abram himself comes from Ur of the Chaldees. He is a Chaldean. He is a Sumerian, technically, of the Earth 3, what's called the UR3 period. And so Abram had an understanding of the stars. That's commensurate with. With what you were just describing."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1778.99,"end":1779.39,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1781.55,"end":1871.26,"speaker":"Fr Stephen De Young","text":"We talked about the Tower of Babel and again, how this is coming immediately afterwards. And as you said, unless this is your first time listening, you've heard us refer to Deuteronomy 32, 8, which talks about the Tower of Babel event. When the Most High divided the nations, he numbered them according to the number of the sons of God. And we've talked about how that's another name for the angelic beings. And then in a corresponding passage in Deuteronomy 4:19, God talks about the. That the people are not to worship. The people of Israel are not to worship the sun, moon and stars, to whom God has allotted all the nations under the earth. So sons of the sons of God and the sun, moon and stars are here sort of made equivalent as divine beings. And this isn't just something that's an ancient Mesopotamian religion that God used as a metaphor for Abraham and then got lost to time. This is a view, the view of the sun, moon and stars and the divine beings related to them that existed at the time of the apostles and at the time of the writing of the New Testament. It was a constant throughout. And the fact that it existed at the time is attested to. I don't think we should probably read this whole quote."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1871.78,"end":1872.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1873.46,"end":1874.82,"speaker":"Fr Stephen De Young","text":"I could read part of it."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1875.14,"end":1887.7,"speaker":"Fr Andrew Stephen Damick","text":"We've got a big quote here in our notes. We need to go to break in just a minute so we can start taking some of your calls. But, yeah, why don't you read a little bit, Father Stephen, and maybe summarize what Philo of Alexandria is talking about."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":1887.78,"end":2030.94,"speaker":"Fr Stephen De Young","text":"Sure. This is Philo of Alexandria, who was a member of the Jewish community in Alexandria. It's from Textivitz called on the special laws. And he's in this. He's commenting on that. Deuteronomy 4, verse 19, passage, passage. And this is his explanation. So he says some persons have conceived that the sun and the moon and the other stars are independent gods to whom they have attributed the causes of all things that exist. But Moses was well aware that the world was created and was like a very large city having rulers and subjects in it. The rulers being all the bodies which are in heaven, such as planets and fixed stars, and the subjects being all the natures beneath the moon and hovering in the air. And adjacent to the earth, but that the rulers aforesaid are not independent and absolute, but are the viceroys of one supreme Being, the Father of all, in imitation of whom they administer with propriety and success the charge committed to their care, as he also presides over all created things in strict accordance with justice and with law. And I'll skip to sort of the end of the quote. He talks about how these subsidiary gods, with a small G, these spiritual beings who govern the sun, moon and stars, are worshiped by the pagans as if they were these independent gods themselves and an independent power. But what Philo says, rather, we must therefore look on all those bodies in the heaven which the outward sense regards as gods, not as independent rulers, since they are signed the work of lieutenants, being by their intrinsic nature responsible to a higher power, but by reason of their virtue, not actually called to render in an account of their doings. So that transcending all visible essence by means of our reason, let us press forward to the honor of that everlasting and invisible being who can be comprehended and appreciated by the mind alone, who is not only the God of all gods, whether appreciable only by the intellect or visible to the outward senses, but is also the Creator of them all. Right, so he says, there they are, these subsidiary beings who serve Yahweh, the God of Israel, the one God of all. And we should rather, in seeing their governance of the universe, ascend beyond them to contemplate and honor and worship their Creator."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2031.26,"end":2096.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. So in other words, when God says to Abraham that his offspring are going to be as the stars, this is what he means, that they are going to be as these angelic beings who govern creation, including the stars, that they're going to be like that, they're going to function like that, they're going to serve like that. And so this is embedded from the very, very beginning of what we could think of as being sort of the salvation story, when God speaks to Abraham and says, now look, come out of this horrible civilization of Cain that you live in now and go to a place I'm going to show you. And this is the story that we're now telling, that your offspring are going to be as the stars. So that's where we're going to wrap up the first part of our show this evening. And we're going to go ahead and go to a break, and when we come back, please give us a ring. We'd love to talk to you. And we're going to continue telling this story."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2097.84,"end":2115.44,"speaker":"Announcer","text":"Father Andrew Stephen Damick and Fr. Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2120.24,"end":2173.41,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado and and the host of the Ancient Faith Radio Sunday Night Call in show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice. Prayer, Fasting and Almsgiving books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2177.41,"end":2193.5,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8:55, AF radio."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2196.62,"end":2413.48,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back and thank you for that voiceover. Steve. So this is the second part of our show and it's where we begin to take your calls. You can reach us at 855 AF radio. That's 855-237-2346. And we would love to hear from you. We'd love to talk to you. We're going to continue to talk about these promises to Abraham and what exactly they mean and especially as they start to play out in the New Testament. All right. Well, Father Stephen, I see that you've got in our notes here that this promise to Abraham that his offspring will be as the stars, that they're going to be like the stars, gets reiterated a couple of different times, at least maybe multiple times in the New Testament. Actually, I'm seeing lots of times, you wouldn't believe people how many times this gets reiterated in the New Testament. But you know, before we kind of get into that too deeply, you know, just to try to reconnect this back to all the things that we've been talking about for this whole show. Okay. Now this is just to reiterate. So for those who've been on this journey with us, the Whole time, you know, probably what I'm about to say, but, you know, God's divine counsel, his hosts, right? His armies of angelic beings who assist him in creation, who obey his will, who help to govern creation, who are not only messengers to us and help to protect us, but also that they are these vast cosmic intelligences who do the will of God and surround him and are always present with him. This is what the promises to Abraham are about, that Abraham's offspring are going to be like that, that they're going to function like the angels. Right? And, you know, this is why, for instance, we've titled this particular episode Sons of God Equal to the Angels. Now, that is a quote from Jesus Christ himself in Luke, chapter 20, verse 36. And he says there that the sons of the resurrection. And that's us, right? You know, God willing, the sons of the resurrection are become sons of God and equal to the angels. That's what's going on here. So Jesus himself is repeating essentially what the promises to Abraham are and being very explicit about it. That's really explicit. Become equal to the angels. It's funny. I mean, I don't think I've ever heard people talk about salvation and then mention that verse. It's almost like, oh, yes, that's what happens kind of after salvation, maybe. But clearly, in terms of these promises given to Abraham, becoming a son of the resurrection means becoming one of the sons of God. We talk about that. It's a rank of angels, and as Jesus says, equal to the angels. Right, Equal to the angels. So we've got a call coming in, and it's not. Not quite. Exactly on what we've been talking about, but I think it's an important one because we've gotten a lot of questions about the role of demons. Right. And so we have Cody, who is on the line from Looks like North Carolina, and he has a question, or he or she. Forgive me, I'm not sure what we'll find out in just a second. Is questioning about the role of demons in mental illness. So, Cody, are you there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2415.2,"end":2416.16,"speaker":"Fr Christopher","text":"Yes. Can you hear me?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2416.4,"end":2417.6,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I hear you."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2418.64,"end":2430.4,"speaker":"Fr Christopher","text":"Okay, cool. Yes. So actually, the. The guy that was calling in from the first podcast, Raphael. Me and my wife are actually catechumens at the same church."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2431.52,"end":2441.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh, great, great. And you definitely sound like you're from North Carolina, by the way. I have to say, I lived there for. I lived there for 11 years. And you are definitely from North Carolina."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2443.39,"end":2473.95,"speaker":"Fr Christopher","text":"I appreciate that. But anyways, my question is I don't really. I don't really hear it discussed very much. At least I don't. But, like, demons. Do you have any, like, particular parts to play in mental health? Like, like in schizophrenia or in. Or even something like clinical depression? Like, I don't hear it discussed very much that I was. I was wondering what you guys. Professional theological opinion would be on that."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2474.67,"end":2629.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, that's a great question. And I know it's something on some people's minds. And. And I think one of the reasons for that is there have been many cases throughout history where people said, well, this person is insane, therefore there is a demon. And now in the modern world, it's kind of like, well, we've outgrown that idea, and we know that mental illness is. Is just a chemical imbalance or, you know, that kind of thing. And I think the problem with that modern approach is that it assumes that there is a kind of spiritually neutral ground. Okay. And the other problem is, of course, that mental illness. And I mean, I am, again, I'm not a psychologist, I'm not a psychiatrist, I'm not a doctor of any kind of. But mental illness is a vast category that includes a whole lot of different kinds of things, right? And so it can be everything from clinical depression to schizophrenia, which itself. Schizophrenia is a vast category that includes a whole lot of different things. There's all kinds of things that are classified as mental illness. And I think that to say that there is no spiritual influence involved when someone is mentally ill, I think is irresponsible. If we believe that there are spiritual beings around us, I think it would also be irresponsible to say, oh, I see a problem with this person, therefore they must be demon possessed. Right? We don't know that. I'm not qualified to say whether someone is demon possessed, even though I believe that demon possession is real. You know, I'm not qualified to say what a certain, you know, mental illness on a person that you might see in a person, what that exactly is, even though I believe that mental illness is real. And I would also say that I don't think that these things are necessarily mutually exclusive. Right? They're not. You know. You know, I mean, I feel depressed if I haven't had enough protein today. Does that mean that my spiritual life is in no way involved? It absolutely is involved. You know, it always is involved. And, you know, we have spiritual beings around us. So I mean, my answer would be that it's possible and kind of. It depends and, you know, it depends a lot on the. Given the particular circumstance. So I don't know. Father Stephen, is there anything you wanted to add to that or correct or whatever?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2630.69,"end":2638.23,"speaker":"Fr Stephen De Young","text":"Well, I think it's important to say that mental illness and demonic possession are two different things."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2638.63,"end":2639.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2640.15,"end":2643.83,"speaker":"Fr Stephen De Young","text":"Demonic possession is a different phenomenon than mental illness."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2644.31,"end":2659.89,"speaker":"Fr Andrew Stephen Damick","text":"All right. Although. Although it might look like mental illness to people who don't believe in demonic possession. Right. Hello? Hello?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2659.89,"end":2660.97,"speaker":"Fr Christopher","text":"Oh, was that to me?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2661.29,"end":2669.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I guess. Father Stephen, are you still there? Oh, I think we lost Father Stephen for just a second there."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2669.93,"end":2670.57,"speaker":"Fr Christopher","text":"Oh, man."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2672.17,"end":2799.72,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, yeah, I don't know what he was about to say, but. Father Stephen, do we have you back yet? All right, well, we're going to try to get him back, but if I had to try to finish his sentence. Demon possession, of course, is where someone is surrendered to a demon and they kind of take control of them. Right. That there's this kind of occupation going on there. Whereas, you know, someone who's behaving, who has mental illness, they're affected by something, and they may well be affected by demonic temptation maybe because they've fallen prey to it over and over again. So, yeah, hopefully we'll get Father Stephen back here and we can hear the rest of his sentence, but maybe not. All right. Anyway, well, that's how, you know, it's live radio, everybody. Because anything can happen. Yeah, definitely. But I think the thing that we have to try to avoid is this. Is this idea of saying it's kind of that any weird thing we say can. Any. Any, you know, that. That any weird behavior we see in a person must be a demon or. Or that it must be a. You know. Oh, they're just. You know, they're just mentally ill or whatever. So. All right, well, I hope that's helpful. I'm. I'm getting. I gotta. Just got a note here from Father Stephen that his. His power went out, but we're gonna try to reconnect with him, and hopefully we can do that. So we have Bobby as our engineer this evening. So, Bobby, can you go ahead and take us to a break? And we're going to try to reconnect with Father Stephen. This is the general rule of this show is don't bring Bobby in. And you're doing it. I'm sorry. It's fine. Okay, I'll take you to break. Thank you, Bobby."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2799.88,"end":2818.54,"speaker":"Announcer","text":"All right, Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-2372. 3, 4, 6 that's 855 AF radio."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2823.42,"end":2865.37,"speaker":"Announcer","text":"Now available on Ancient Faith Publishing the Shield of Psalmic Prayer Reflections on Translating, Interpreting, and Praying the Psalter in this posthumous collection of poet and teacher Donald Sheehan's reflections on Psalms and Psalmic prayer, culled from his journals and teaching notes, you will find two quite different kinds of writing working in poetic and personal journaling by a man of faith, a scholar, a linguist, and in the deepest sense, a teacher. Alongside scholarly linguistic and poetic analysis by a man steeped in poetry who thought like a poet. Here's what Father Stephen Freeman has to."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2865.37,"end":2905.29,"speaker":"Fr Andrew Stephen Damick","text":"Say on the book. In the spiritual life, two things are essential what we do and how we do it. In this wonderful collection of the late Donald Sheehan's thoughts on the Psalms, we see both. He takes us into what the Psalms are in depth, that is the Word of God. But he also demonstrates time and again how those deaths shape his life in the world in which he lives. Thus we are given two things, the Word of God and a life in which the Word has given shape. It's a path we all should walk."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2906.18,"end":2919.7,"speaker":"Announcer","text":"You can find this book and others like it@store.ancientfaith.com Again, that is store.ancientfaith.com Here is mother Alexandra of blessed memory."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2919.94,"end":2928.86,"speaker":"Fr Andrew Stephen Damick","text":"It seemed to me that in this modern life of ours, where everything has become so frightfully materialistic, there is a."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2928.86,"end":2940.54,"speaker":"Kathy De Young","text":"Very great need of transfiguration, of a change of our attitude, our way of thinking, our way of behaving, our way of holding ourselves."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2940.94,"end":2944.14,"speaker":"Fr Christopher","text":"Everything needs a new Christianization."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2944.38,"end":2948.3,"speaker":"Kathy De Young","text":"We must become more aware of the Christ within us."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":2948.86,"end":3002.95,"speaker":"Announcer","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the church as expressed in her theology, hymnography, and iconography. For those who long to become better a acquainted with these holy servants of God and to understand their role in our lives, this book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancient faith.com."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3003.59,"end":3019.68,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3022.64,"end":3039.93,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're back. Father Stephen, are you there? All right, I'm not hearing him yet, so. Welcome back, everybody. It's Father Andrew from Ancient. From ancient faith Radio, Emmaus, Pennsylvania. Father Stephen, you there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3040.72,"end":3041.36,"speaker":"Fr Stephen De Young","text":"I am here."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3041.76,"end":3044.16,"speaker":"Fr Andrew Stephen Damick","text":"Yay. So what happened?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3045.68,"end":3054.08,"speaker":"Fr Stephen De Young","text":"There's a storm here in Louisiana, as happens all too frequently, and my power went out, but we can continue."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3054.88,"end":3058.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, you're connecting through your tablet, right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3059.04,"end":3063.44,"speaker":"Fr Stephen De Young","text":"Yeah. I apologize to Cody for dropping out in the middle of my response."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3064,"end":3113.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you know, it's funny, the other day someone said to me, and, I mean, I. But again, I don't know what, you know, I can't read demons and angels. I'm not an expert on this. Right. We're just talking about it and trying to live it as best as we can. But someone said to me, you know, you know, you guys talking about these things, you're inviting. You're inviting problems. And, you know, God willing, we'll be able to get to have an episode where we don't have a technical issue that we can't possibly foretell coming in, but here we are, and that's okay. So, hi everybody out there in ancient faith radio land, it's live radio. So, Father Stephen, why don't you finish out? Hopefully Cody is still listening. He's not connected now, but why don't you finish out what you were saying and correct whatever wrong thing I said to him."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3114.74,"end":3117.7,"speaker":"Fr Stephen De Young","text":"No, I was not correcting you in this case. Oh, great."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3119.46,"end":3120.1,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3121.06,"end":3156.91,"speaker":"Fr Stephen De Young","text":"I was just saying that once we distinguish between. If we distinguish demonic possession is a phenomenon and on one hand, and between mental illness on the other, then you need to understand that the same relationship to mental illness that they do to physical illness, you know, there's nothing differences that are involved between, you know, a disease of the liver and a disease of the brain."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3157.55,"end":3157.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3158.99,"end":3165.71,"speaker":"Fr Stephen De Young","text":"It's the same kind of issues and the same kind of way we should understand and deal with it."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3166.27,"end":3174.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I should probably note for our listeners that you are now connected over your data connection through a mobile tower. Is that right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3177.88,"end":3178.28,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3178.6,"end":3219.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there we go. All right. So just expect a little weirdness. It's just the way it is. But we are going to continue to do this show anyway. All right, well, Cody, I hope that's helpful to you. Let's continue talking about these promises to Abraham that were given and what they. Exactly they have to do with Theosis. So, Father Stephen, why don't you continue us on and talk about especially, you know, I mentioned that verse from Luke 20:36, and where the Lord says that the sons of the resurrection become sons of God and equal to the angels. And, you know, let's continue talking about this. So these promises get reiterated. What happens there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3221.05,"end":3335.11,"speaker":"Fr Stephen De Young","text":"Right. Well, we're going to talk about a few different places where they get. Where they get reiterated. Then we're going to take sort of a deep dive into St. Paul, as I teased earlier, because there's a very important to how St. Paul sees the whole pattern of salvation, but in terms of a few places where elements of what we've been talking about get reiterated. So, for example, in Matthew 19, verse 28, there's a verse that gets glossed over a lot where the disciples, soon to be apostles, ask Christ, you know, well, what about us? We've given up all these things, you know, to follow you. What promises will we receive in return? And Christ tells them that they will sit on 12 thrones and judge the 12 tribes of Israel. Of course, judge in this context is like the Old Testament concept of a judge. It's not sort of you're going to hear cases or it's not just about the last judgment, but this is about sharing in Christ's reign and his rule over the world. And of course, the same thing gets reiterated in Revelation, chapter 20, verse 4. Talks about the saints and the martyrs who come to life and rule and reign with Christ for the period between their deaths and his return, which is figuratively sort of represented there as a thousand years. And then in terms of the element of camping in the gates. And we're gonna, as another tease, talk about this a lot more in our Halloween special just next week, one week from today."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3335.59,"end":3337.19,"speaker":"Fr Andrew Stephen Damick","text":"There we go. There's a promo."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3337.99,"end":3358.43,"speaker":"Fr Stephen De Young","text":"Yeah, so more of this then. But one of the things that we notice in St. John's book of Revelation is that he encounters with the heavenly host and the angels who are worshiping and praising God. He encounters 24 elders, 24 human elders who are there."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3358.43,"end":3358.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3359.63,"end":3379.95,"speaker":"Fr Stephen De Young","text":"Presbyters. And there's a lot of different ways of understanding that number. Right. The 12 tribes of Israel and the 12 apostles, or how we do it. But they are particularly elders. And of course, starting with Moses in the Old Testament, there were 72 elders of Israel."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3380.59,"end":3380.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3381.07,"end":3383.87,"speaker":"Fr Stephen De Young","text":"And so 24 is 1/3."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3384.91,"end":3385.87,"speaker":"Fr Andrew Stephen Damick","text":"That's interesting."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3386.83,"end":3398.02,"speaker":"Fr Stephen De Young","text":"It's just a few chapters later that when we read about Satan being cast down from heaven, that with him he takes a third of the stars."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3399.14,"end":3400.66,"speaker":"Fr Andrew Stephen Damick","text":"So there's the stars again."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3401.38,"end":3427.42,"speaker":"Fr Stephen De Young","text":"This. This isn't about sort of an Exact number of the angels who fell, or even exact proportion. But it's to give us this sense that, oh, look, a third of the elders are these humans who have been glorified. A third of the angelic beings fell to give us this replacement idea, this camping in the gates of the enemy, taking their position of power and authority."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3427.82,"end":3428.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3428.86,"end":3437.98,"speaker":"Fr Stephen De Young","text":"So those are just some examples before we get into the deeper dive, at least on St. Paul."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3438.46,"end":3446.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, well, let's get out on the diving board and take a deep dive into St. Paul."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3446.7,"end":3447.74,"speaker":"Fr Stephen De Young","text":"Take a couple bounces."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3447.82,"end":3466.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Thank God. And everyone out there, please pray right now that Father Stephen's data connection stays strong and also pray that his power comes back on. But as long as we're able, we're going to keep doing this because this is what we're supposed to be doing tonight."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3467.05,"end":3468.89,"speaker":"Fr Stephen De Young","text":"No one can say we're not dedicated."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3469.21,"end":3479.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. I know. I feel bad here in my wonderful studio where everything is nice and the power is on, the lights are on. That's okay."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3480.89,"end":3564.25,"speaker":"Fr Stephen De Young","text":"And I'm here rubbing two sticks together to try and send smoke signal. But so a couple of things with St. Paul. First of all, we tend to think about, as contemporary Western people, to think about St. Paul sort of the wrong way. We sort of picture him because he was a teacher and because he's Jewish. Right. We think of him as sort of like a modern rabbi. And so we picture St. Paul sort of sitting and studying these musty scrolls of the Torah and these. These other ancient Jewish traditions, and he sits there and he reads them and he thinks about them and he sort of comes up with this theology then, you know, portions of which then end up in the Bible. And that's not only not how the scriptures see St. Paul, that's not even how St. Paul sees himself. The picture we get of St. Paul from the book of Acts and from St. Paul's own writings. For example, what we normally call his conversion on the road to Damascus is kind of anachronistic to call it a conversion, because it's not as if there was this religion, Judaism, and then this other religion, Christianity, and St. Paul left one and went to the other in 35 AD."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3564.77,"end":3566.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3566.37,"end":3647.85,"speaker":"Fr Stephen De Young","text":"That didn't happen. Rather, the way St. Paul describes it himself, he actually borrows language directly from the book of Jeremiah in Galatians when he describes it is as sort of a prophetic call. The way Isaiah had this vision of God seated in the temple, or Ezekiel had this vision of the divine throne, or Jeremiah experienced this call. So St. Paul saw himself as called to be a prophet. And that's not the only time he sees and interacts with Christ. If you read the Book of Acts closely, it's actually three times in the Book of Acts where Christ appears personally to St. Paul and they interact. And in addition to that, we have St. Paul's description of his sort of visionary experience of going to the third heaven. So St. Paul is really more like the seers, the prophets, the mystics of the Old Testament than like a modern Jewish rabbi slash theologian. Right, right, right. And so, and we could go in all kinds of detail about his personal prayer practices and all that, but for our purposes tonight, this obviously affects how he viewed salvation. This isn't just a question of theology and how does it work and what's a good metaphor? Yeah, this is. This is talking about his own personal experience of salvation, his own experience with Christ. That's what he's writing about."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3648.48,"end":3724.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So he's having visions. You know, he's a mystic, he's a seer. He's like Moses. He's like one of the prophets. You know, it's interesting. One of the things I've always thought was kind of cool, you know, serving in the Antiochian Church, especially up here in the Northeast, means that you're going to bump into people of Middle Eastern background, including ones that are actually from the Middle East. And so you're going to hear people speaking Arabic. And one of the things that's interesting to me is that the, the Arabic word for prophet, which, forgive me, Arabic speakers, if I'm mispronouncing this, I think is al rasul, is that same word is used to refer to apostles, actually. So, like, for instance, is the Apostle Paul. Right. So it's interesting that in Arabic, at least, a kind of colloquial way of describing apostles and prophets is with the same word, interestingly enough, even though they're not, you know, it's not literally this, like, it's not the same word in Greek. And I don't know if that's the word that's used in the Arabic Bible. I don't have an Arabic speaker sitting here with me, but I thought that was kind of interesting, is that apostles are looked at as being prophets of another kind, you know, of another time."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3725.8,"end":3730.48,"speaker":"Fr Stephen De Young","text":"Every one of them saw God, whether it was Christ in his earthly light."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3730.48,"end":3774.32,"speaker":"Fr Andrew Stephen Damick","text":"Christ is God and they speak on behalf of God. Just. I mean, that's what prophets do. So. Yeah. Okay, well, let's, you know, before we, before we get too deep into Paul, we actually got a question that came over email from Father David Subu. And forgive me, Father David, if I'm mispronouncing your last name, but he asked about something we talked about in the first part, and he said this. Can you talk about possessing the gates and how it connects to the harrowing of Hades and so forth. Is he on the right track? I mean, it seems to me like he's suggesting that, you know, we talk about Abraham's offspring possessing the gates. I mean, does that apply to the gates of Hades as well?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3776.16,"end":3781.04,"speaker":"Fr Stephen De Young","text":"Yes. I'm going to partially punt on this just because I don't want to steal our own thunder next week."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3781.36,"end":3782.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3782.8,"end":3815.76,"speaker":"Fr Stephen De Young","text":"Because this is going to be a major focus. So the answer is yes, yes, yes. And to further tease, next week, we're going to be talking about how Christ conquers all of the enemies and then shares that victory with humanity. And that's what becoming a saint is all about. It's going to tie up a lot of what we're talking about here, but we need to kind of lay a little more ground work here first, I think, before we."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3816.07,"end":3820.15,"speaker":"Fr Andrew Stephen Damick","text":"I know this is the show where we keep saying, tune in next time."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3822.15,"end":3823.35,"speaker":"Fr Stephen De Young","text":"It's coming. Yes."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3823.35,"end":3831.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's coming. Don't worry, everybody. All right. Okay, so where should we start out here? Should we start out with this quote from Galatians, chapter three?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3832.55,"end":3863.18,"speaker":"Fr Stephen De Young","text":"Well, right, before we do that, I want to call back before all of my electrical chicanery took place, sort of the. The big. The big sort of themes and terms we saw in terms of the promises to Abraham about. Right. The sons of God, the seed of Abraham, who are the heirs to the promise. Right. To the inheritance that he's been. That he's been promised."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3863.58,"end":3864.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3864.7,"end":3892.35,"speaker":"Fr Stephen De Young","text":"And so these are sort of the key terms related to theosis as it's originally laid out way back in Genesis. Right. And then is. Is being pursued going forward. And so now when we have those terms in mind and know where they come from, when we read St. Paul talking about salvation, it's important to see how he now is going to use those terms in relationship to Christ."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3892.91,"end":3893.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3893.55,"end":3946.14,"speaker":"Fr Stephen De Young","text":"And we're actually going to be focusing on. We're going to be reading. We're not going to go through the whole chapters, but we're going to be talking about texts from Galatians 3 and 4 and Romans 8. And for any of our listeners who have an awareness or connection to Protestantism, you'll know that these are some of the basic chapters that are used to lay out sort of the Western and particularly Protestant view of salvation. And I think we're going to see, once we have these terms in mind and this understanding of what theosis is in mind, that these texts actually mean something very different than we may have been brought up or heard that they teach. Because in some cases, we've been focusing on the wrong terms and the wrong words."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3946.86,"end":3954.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which just then continues the tradition of this podcast where we. We try to blow everybody's minds with things that have been staring you in the face."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3957.9,"end":3958.42,"speaker":"Fr Stephen De Young","text":"So, but."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3958.42,"end":3971.34,"speaker":"Fr Andrew Stephen Damick","text":"So. So here we are. Oh, we kind of lost you a little bit there, Father Stephen, you still there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3972.22,"end":3976.46,"speaker":"Fr Stephen De Young","text":"Yeah, I think. I think Galatians 3, that first is a good place to start."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":3977.29,"end":4034.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. So, okay, so Galatians, chapter 3, verses 26, 29. For in Christ Jesus, you are all sons of God through faith. For as many of you as were baptized into Christ have put on Christ, there is neither Jew nor Greek, there is neither slave nor free. There is no male and female, for you are all one in Christ Jesus. And if you are Christ's, then you are Abraham's offspring, heirs according to promise. So there it is. There it is. The promise to Abraham described as being, we were sons of God. And it's. How does it happen? Baptism. It comes through baptism because we've put on Christ. And of course, I mean, that line, right. For as many of you as were baptized into Christ have put on Christ, that is sung at the orthodox baptismal service, right? Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4035.05,"end":4057.78,"speaker":"Fr Stephen De Young","text":"That text has been kind of atomized. We've pulled the pieces out and quoted them separately so much that we kind of lose the flow. We have been baptized into Christ of God through faith. Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4061.06,"end":4061.46,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4063.86,"end":4100.99,"speaker":"Fr Stephen De Young","text":"That as many have been baptized into Christ have put on Christ is saying that that takes place through baptism, and that by being baptized, we are therefore Christ. And in being sons of God, we are also Abraham's seed and heirs to those promises to Abraham. So this is all tied together for St. Paul with baptism. And so the receipt of those promises is not in the larger argument of Galatians, from circumcision to be a romantic. By being in Christ, which happens through baptism."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4101.55,"end":4355.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Okay. So, yeah, it's just amazing when you start to look at all these things in this larger context and connect these parts of the scripture to each other. So moving forward then, to Galatians, chapter four, if we look at verses five through seven, we get this from St. Paul so that we might receive adoption as sons. And because you are sons, God has sent the spirit of his son into our hearts, crying abba, Father, so you are no longer a slave, but a son. And if a son, then an heir through God. And, you know, I think that often when people see this, of course, you know, the idea of being adopted into God's family makes sense. But if we recall that the sons of God are this kind of angelic rank, and we recall that, what, you know, what does it mean to be part of this royal family? Well, you know, if you're in a royal family, you have a job to do, you have something that you're supposed to be doing. And by virtue of being close to the king and father, you share in his authority, in his glory, in his work, in his ministry, Right? And this happens because God has sent his spirit into our hearts that we have become sons of God. And sometimes, of course, it gets translated as children rather than sons, but, you know, it's not that. That's sort of totally wrong, but it obscures this idea of the sons of God that, you know, this image from the Old Testament that gets then carried forward into the New Testament. Right. And I think it's really important that we. We emphasize this idea of adoption. We're adopted as sons. And I just wanted to mention, and maybe, and hopefully we'll have time to talk about this a little bit more, but I just wanted to mention, especially I was reading today a paper from my friend, the late Father Matthew Baker, and Father Matthew and I were in seminary together. And he was just a brilliant, brilliant, brilliant person, but also just a deeply Christian man. And he died in an accident some years ago. But anyway, he wrote a paper called Deification and Sonship According to Saint Athanasius of Alexandria. And I could just talk about this paper for hours. But one of the things that he mentions, of course, is that Saint Athanasius talks about adoption a lot when he's talking about theoses and the term that's used for adoption. And this is actually an ancient Greek term. It's not something that Athanasius came up with, but it long predates him. But the term that it's used for adoption is. And I'm sure I'm going to mispronounce this, I don't know, Wiothesia. Did I get that right? Close enough, yeah. Okay, so it's a wios, which means sun, you know, and theseia, which means kind of a setting or placing upon. Not that you can always take a Greek word apart and get the meaning of it, but in this case, it kind of works being made A son, being made a son. Right. Rather than being born one is sort of the idea you're being made a son, you know. And you know that Athanasius, that's part of the key thing for him in terms of theoses. And he also connects it with this term theopiesis, which means God making, being made a God. Right. And you know, there's that classic line from Athanasius, you know, God became man so that we might become gods or might be made gods. And you know, that all of this is tied together, that being adopted in Christ as sons of God, being made gods. This is all together theosis. It's all the same thing, you know, so it's really something. So, yeah, this idea of we're adopted as sons, that's right there in Galatians, chapter 4, verse 5. So did you want to add anything else to that on this part from St. Paul, Father?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4356.5,"end":4415.4,"speaker":"Fr Stephen De Young","text":"No, I think we can go on to Romans 8. All right. And take us to Romans 8 and go through some of these quotes now a little more quickly because we're going to see a lot of the same thing. So this is a lot of sort of piling on. We can see how central this is to St. Paul's thinking every time he talks about salvation in Romans 8, 14, 17. For all who are led by the Spirit of God are sons of God. For you did not receive the spirit of slavery to fall back into fear, but you have received the spirit of adoption as sons by whom we cry Abba, Father. The Spirit himself bears witness with our Spirit that we are children of God. And if children, then heirs, heirs of God and fellow heirs with Christ, provided we suffer with him in order that we may also be glorified with him. And you may have noticed it switches from sons to children there. That's because the Greek switches from sons to children."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4416.11,"end":4416.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there you go."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4416.79,"end":4456.78,"speaker":"Fr Stephen De Young","text":"Both the phrase sons of God and children of God occur in the Scriptures in the Greek, unfortunately, because we want to be gender sensitive. A lot of modern translations translate both as children of God, so you can't tell which the original says when you read in English. But sons of God, of course, has this important weight that we've been talking about of referring to the angelic beings, whereas children of God refers to other elements, elements of that. But we have this element of adoption here. It's connected to being heirs again of the promises, fellow heirs with Christ and also with, of course, glorification."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4457.5,"end":4457.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4457.9,"end":4464.38,"speaker":"Fr Stephen De Young","text":"Another element of theosis coming to share in Christ's glory, the glory of the Resurrected and reigning."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4465.9,"end":4471.26,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So there it is again, over and over. Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4471.26,"end":4472.58,"speaker":"Fr Stephen De Young","text":"Do you want to do the next one?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4472.9,"end":4473.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4473.66,"end":4475.38,"speaker":"Fr Stephen De Young","text":"We'll just pile these on a little bit."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4475.7,"end":4479.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right, right. So this is continuing in Romans 8, right?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4480.58,"end":4481.06,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4481.62,"end":4554.61,"speaker":"Fr Andrew Stephen Damick","text":"So Romans 8, starting with verse 19 and going through 23. For the creation waits with eager longing for the revealing of the sons of God. For the creation was subjected to futility, not willingly, but because of him who subjected it, in hope that the creation itself will be set free from its bondage to corruption and obtain the freedom of the glory of the children of God. For we know that the whole creation has been groaning together in the pains of childbirth until now. And not only the creation, but we ourselves, who have the first fruits of the Spirit, groan inwardly as we wait eagerly for adoption as sons, the redemption of our bodies. So this connects us then to this idea that creation itself is participating in this, which, I mean, if we understand that these sons of God, that the, you know, these angelic beings are governing creation and participating in the government of creation, and that our job is to do the same thing, and if we're in Christ, we begin to do that, then it makes sense that the creation will be bound up in human destiny. Right. And that can't be what it's supposed to be, in a sense, without our participation as sons of God."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4555.72,"end":4577.88,"speaker":"Fr Stephen De Young","text":"This isn't humanity over against creation. The whole purpose of creation. For St. Paul, the reason God created everything he created, including us, was so that he could share his divine and eternal life with us humans, to bring forth the sons of God. That's the purpose of everything and of all this."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4578.68,"end":4579,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4579,"end":4594.35,"speaker":"Fr Stephen De Young","text":"And this takes place at the redemption of our bodies, known as our physicality. So this is not redemption from our bodies, from the world, but it's in and with the world. So theosis has nothing to do with Gnosticism. This is the opposite of Gnosticism."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4594.43,"end":4595.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4596.27,"end":4648.02,"speaker":"Fr Stephen De Young","text":"And also notice that language that St. Paul uses fairly frequently of the first fruits of the Spirit, whereas we were talking about, with a sign and a deposit, we have received the Spirit, which is the sign of the truth, of the promise of the redemption of our bodies at the resurrection. Right? It's the sign and the beginning point. And then just real quickly, Romans 8:29, to pile one more on, this gets quoted a lot, especially by our Calvinist friends, because it talks about predestination. But let's just for a second, don't get triggered by the word predestined and listen to the rest of the verse. Right. That for those whom he foreknew, he also predestined to be conformed to the image of his Son in order that he might be the firstborn among many brothers."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4649.06,"end":4649.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4650.74,"end":4657.94,"speaker":"Fr Stephen De Young","text":"So the what God and the word there that's translated predestined really means to set an order in advance."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4658.58,"end":4658.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4659.06,"end":4683.94,"speaker":"Fr Stephen De Young","text":"So following off of what we just read about creation, God created all these things and put them in place and set them all in order for the purpose that we would be conformed to the image of Christ. We become like Christ, another element of theosis become like God so that Christ would be the firstborn. He's the begotten son, the unique son, and then we become the sons of God through him."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4684.5,"end":4711.85,"speaker":"Fr Andrew Stephen Damick","text":"Adoption. Yeah, in Christ. So. Right. Well, we could probably talk about lots more stuff from St. Paul, but let's go ahead. And because this kind of wraps up this part of our show for this evening, let's go ahead and go to a break. And when we come back, we have a call that we're going to take, God willing, and we'll continue to talk. So let's go ahead and go to break."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4712.33,"end":4730.1,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4735.06,"end":4788.18,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodox. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, prayer, fasting and almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4794.34,"end":4799.6,"speaker":"Fr Stephen De Young","text":"The ancient faith for the modern world. This is Ancient Faith Radio."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4802.16,"end":4818.24,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4821.12,"end":4854.38,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of the show as. As we stumble along amidst storms and power outages and Father Stephen on his data stream. Yeah, so. All right, well, before we. Before we continue. I'm sorry, I'm just laughing over here. What else can you do? Before we continue, we have a call, and this is Father Christopher who is calling, and he's calling about the scriptural understanding of demons. So. Father Christopher, are you there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4856.22,"end":4858.78,"speaker":"Fr Christopher","text":"I am here, Father. Good to hear your voice."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4859.1,"end":4863.18,"speaker":"Fr Andrew Stephen Damick","text":"Oh, it is good to hear yours, too. So welcome to the Lord of Spirits, Father."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4863.74,"end":4876.7,"speaker":"Fr Christopher","text":"Well, thank you. And actually, that's a little bit. Quite a bit different than what I wanted to ask. But first, if I could, I wanted to make a comment to both of you."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4877.02,"end":4891.24,"speaker":"Fr Andrew Stephen Damick","text":"Comment away. And I should tell our audience, by the way, that Father Christopher and I are old friends, and Father Christopher and I were in seminary together at St. Tikon Seminary. So I'm ready for anything."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4891.24,"end":4892.32,"speaker":"Fr Christopher","text":"And we were texting today."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4893.52,"end":4894.8,"speaker":"Fr Andrew Stephen Damick","text":"We were texting today."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4896.32,"end":4947.03,"speaker":"Fr Christopher","text":"And Father knows I'm going to embarrass my wife because she was a classmate of his and she's the brightest star in our family. And she made a comment about when she became Orthodox. She was a Biblical studies major in college, and she said when she became Orthodox Orthodox, it just really opened her mind to the depth and the breadth of the scripture. And when we were listening to your episodes last week, she said the same thing. She said, I feel like it's a very similar thing. Listening to this podcast and this teaching is just opening up my mind to the depth and the breadth of the scripture. So I just wanted to thank you first and foremost for. From all of us who are listening to this wonderful work that you're doing. So thank you, Fathers, very much."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4947.59,"end":4948.83,"speaker":"Fr Andrew Stephen Damick","text":"Thank God. Thank God."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4948.83,"end":4949.43,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4951.27,"end":4953.11,"speaker":"Fr Andrew Stephen Damick","text":"So what's your question, Father Christopher?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4953.11,"end":4987.84,"speaker":"Fr Christopher","text":"My question would be, you know, we see some of the authors that we love, like. Like Tolkien and. And some of the other inklings, a hints of a vision of the counsel of God. I guess my question is, when did we lose this teaching? When. When was this lost to us? Was it. Was it between. Between them and. And where we are now? Did they kind of rediscover it through the love of mythology and scripture? When do we lose this?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4989.04,"end":4994.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's a good question, Father Stephen, why don't you go ahead and start us off with this one?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":4995.63,"end":4999.63,"speaker":"Fr Stephen De Young","text":"Well, it depends on who the we is and the question."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5000.27,"end":5000.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5001.47,"end":5002.03,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5002.91,"end":5004.27,"speaker":"Fr Andrew Stephen Damick","text":"In what way? Maybe."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5005.15,"end":5124.36,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, part of it is that if we is the Orthodox Church, I don't think it was lost, but I don't know that recent generations have fully been able to appropriate it. Yeah, because it's, it's contained in our, our liturgics. It's contained in the writings of the Fathers, too many of which are still untranslated into English. It's contained in texts, ancient Jewish texts that were preserved not by Jewish communities, but by Orthodox Christian communities. If you get the two volume Old Testament Pseudepigrapha, which is sort of the biggest repository of Second Temple literature out there, and you read the prefaces to the books where the manuscripts come from, it's Marsaba, it's St. Catherine's it's Mount Athos. You know, there are a number of Second Temple Jewish texts that we only have preserved in Slavonic because they were preserved at monastic settlements in the Slavic world. So these have been preserved for us by the Church. And they were continually copied and recopied right up into the 15th and 16th centuries. And then the printing press came along. And so I don't know so much that it's lost. It's just that we haven't laid hold of it. We haven't fully, as a generation, laid hold of our inheritance. In the west, it's a lot more complicated. I think in the west. Other issues started to take precedence, though. There are Protestant Bible scholars who are trying to reappropriate this in an evangelical Protestant context. I think if they really follow it through, they'll be drawn ineluctably into the Orthodox Church."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5126.2,"end":5127.56,"speaker":"Fr Andrew Stephen Damick","text":"It's our secret weapon."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5128.33,"end":5169.44,"speaker":"Fr Stephen De Young","text":"Yeah, but so they are kind of rediscovering it over there. But it's by going back as scholars, going back to this literature and that kind of thing. And as you said, I think Tolkien, I mean, Tolkien, I know, was reading the most newly translated ancient Near Eastern texts and that kind of thing that he could lay hands on, some of which turned out to be forgeries and that kind of thing. But he didn't know. Or just badly mistranslated, you know, but he didn't know. But he was someone who. And that's why he's someone who you see this early on start to pop up in, because he was, he was deeply interested in it and kind of pursued it even in the West."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5170.16,"end":5319.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, you know, I'll say if you're interested in that particular angle of this. So I have another podcast called Amansul, in which I talk about JRR Tolkien from an orthodox Christian point of view with various guests. And Father Stephen came On that podcast for episode 24 of Amen Sul, and we specifically talked about the kind of mythic understanding of scripture and how that's how that's represented in Tolkien's works. And he gets a lot right, interestingly enough, even though he's writing fiction, he gets a lot, a lot right. But you know, just to sort of address the specific question of losing this sense of the scriptural understanding of the divine council and so forth, I think, you know, as Father Stephen said, like, there's a lot of the Fathers, and it's my understanding it's the majority of the Fathers have never been translated into English. Like, the vast majority of patristic writings are not in English. You know, that what we have is largely the bulk of it anyways, comes from 19th century Protestants who are looking for stuff to kind of use, to argue against Roman Catholics in many cases. So it becomes kind of submitted to those sets of questions and then that can kind of distort the way we read it. And, you know, this is a perennial. This is going to be a perennial issue on this podcast, which is, you know, why have I never heard this before? You know, someone who's maybe raised Orthodox Christian or catechized well, as an Orthodox Christian, they've never heard this stuff before. And again, it's not because this stuff isn't in scripture. It's not because it's not in the liturgical services, it's not because it's not in the Church Fathers. It's just that probably whoever taught you wasn't aware of this understanding. Now, that doesn't mean that you're not really an Orthodox Christian or that you're not capable of salvation, right? Because the whole point is to be faithful to Christ with whatever it is you've received. Our task here is to try to help people be more faithful. Right? But yeah, it's so, it's interesting. I mean, I watched Father Stephen, for instance, give some talks about some of these things to a group of clergy who were just sitting there dumbfounded. And again, they were almost all saying, why have I never heard this before? But the beautiful thing is that if you hear it and then you begin to connect the dots of the things that you do know already, it makes a lot of sense. I mean, that's been my experience over and over again. So I hope that a lot of people feel that way about this podcast. Like, wait a minute, it now it all makes sense. You know."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5321.98,"end":5361.64,"speaker":"Fr Stephen De Young","text":"It'S sort of like our inheritance. It's sort of like one of those websites where they're like, do you have money that belongs to you in another state? You know, and you go out there and you find out, hey, I owe 250 bucks in West Virginia, you know, or there's an estate from my uncle in California. That's sort of the way it is with this vast wealth of an inheritance we have from the Orthodox Church that there is this vast wealth of inheritance, but we have to go and look for it in each generation. We have to go and find it and appropriate it and collect it for ourselves in every generation."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5361.88,"end":5415,"speaker":"Fr Andrew Stephen Damick","text":"Right. Catechism is. I'm still being catechized, and I've been Orthodox for over 20 years, and I'm a priest and I teach this faith, but I'm still being catechized and that. Okay. Because Orthodox Christianity is not something that you have in a box that you carry around and you open up and show what a complete collection of Orthodoxy you have, if I may say. Yeah. All right. So. All right, well, we're going to take one more call. I hope that's helpful to you, Father Christopher. But we're going to take one more call, and then we're going to go ahead and. And wrap it up for tonight. We've unfortunately had some interruptions and stuff because of gremlins and Father Stephen's power grid, but we have Kathy calling from Minnesota, so. Kathy, are you there?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5415.8,"end":5416.76,"speaker":"Kathy De Young","text":"Yes, I'm here."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5417.4,"end":5419.08,"speaker":"Fr Stephen De Young","text":"Oh, this is going to be good radio."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5421.96,"end":5423.16,"speaker":"Kathy De Young","text":"Father Stephen's mother."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5423.56,"end":5437.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I gotta say, I could see from the caller as he says DeYoung. I'm like, oh, must be one of his relatives. All right. I feel like. I feel like I have to call you, Mrs. DeYoung."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5438.38,"end":5469.27,"speaker":"Kathy De Young","text":"Well, most. Most of your fellow clergymen just call me mom, but that's okay. He's scared to death now. See. No, it's not that. I. I would just like you two to possibly discuss the difference between the Protestant concept of sanctification and the Orthodox concept of theosis."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5471.19,"end":5471.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5473.03,"end":5493.16,"speaker":"Kathy De Young","text":"Because what I'm picking up, I mean, I grew up Protestant, so it was a process, and it was sanctification. And you grew into. Doesn't sound like that's a com. That's the same as theosis at all."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5494.68,"end":5510.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I would say, you know, just to give Father Stephen a moment or two to figure out what he's going to say to his mother. I'm sorry. You know, the first time Father Stephen and I were on live radio together, his sister called."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5511.3,"end":5512.42,"speaker":"Kathy De Young","text":"Oh, yes, I know."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5512.82,"end":5522.1,"speaker":"Fr Andrew Stephen Damick","text":"I am feeling a little left out. Where are my daemonics at Hello. Anyway, I know my dad listens, but he probably would never call."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5523.14,"end":5530.98,"speaker":"Kathy De Young","text":"See, I always text. I text Father Stephen after these sessions with questions, and he always says, why don't you call in?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5531.55,"end":5717.02,"speaker":"Fr Andrew Stephen Damick","text":"There it is. Right, exactly. So here's what I would say, you know, in most Protestants. So I grew up Protestant as well. I grew up as an evangelical. And in most Protestant contexts, sanctification is something that kind of happens. So you're kind of. You've got your salvation, you know, you've got your ticket or whatever, and sanctification is kind of the improvement that happens after that. And that can be understood as moral improvement, you know, especially. But. But from. From an orthodox point of view, now, we wouldn't say that we don't believe in sanctification. I mean, that's a word that's in scripture. It just means becoming holy. Right? But we would say that. That. That is salvation, right? That becoming holy is salvation. And if you especially understand that what becoming holy means is becoming one of the holy ones, one of the hosts of heaven, one of the divine council, then it is a much more active and complex understanding of what it is that we have been called to do. Right? We're not called to just sort of fix our sin problem and then become better people after that. Again, I know, I'm simplifying, but what we are called to do is to become like the stars in heaven. We are, you know, that is to say, like the heavenly hosts. We are called to become as one of these. One of the divine council, one of the holy ones of God. Right? And so we would say that sanctification is a word that describes what that is. You know, it's something that we grow into. Grow into the fullness of the stature of Christ. Right. It's not an instantaneous thing. It is at the same time something that we. We have by means of baptism, but that we also are called to grow more into. Because just because you're baptized does not make you instantly, you know, in the full sense, a member of the heavenly hosts, you know, in. In every way, you know, so. So it's kind of all of that stuff together. And I think the value of what we're discussing this evening is to say, like, look, look, the destiny of mankind is to stand alongside the angels and to do what they do. And so by virtue of being in the presence of God, we become more like Him. And we become more like him not just sort of by standing there and absorbing his holiness, but by participating in his works. Just as, of course, the opposite Happens if you participate in the works of demons, then you become like demons. It's kind of the anti theosis, you know, demonosis, for lack of a better term. So, so that's what I would say. You know, I wouldn't say there's a difference between theosis and sanctification. I would say that theosis is sanctification, but it's. But that the. But the sanctification in most, not all, but most Protestant models is a much reduced, you know, kind of, kind of image. So I don't know if that makes sense. Father Stephen, what would you say to your mother?"}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5718.06,"end":5794.42,"speaker":"Fr Stephen De Young","text":"Well, we, we read, we read Romans 8:29. We didn't read 30 and 31, where a lot of this in terms of the Protestant view of salvation comes from. Although sanctification is left out there. But there's what's called usually in Protestant theology, the ordo salutis, which is the fancy Latin for the order of salvation. So there's an idea that there are these different moments in our salvation that represent a sequence. Right. And the main ones that usually are, there's justification, which is held to be this one time thing that happens at the beginning when you get saved, and then there's sanctification, which is this process that comes afterwards, and then glorification, which is what happens when you die and go to heaven. To really simplify things a lot. Right. So it's a temporal order. It's a series of moments or periods in our salvation. But when you read at the end of Romans 8, there's actually nothing in the Greek to imply any kind of temporal order or succession that one happens after the other. They're all in the same verb tense. They're all in the aorist tense, which is just the simple past tense. These things all happened."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5794.74,"end":5802.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and even in the English it just says he also. He also. He also, not he then and then. Right. It's also."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5802.66,"end":5862.45,"speaker":"Fr Stephen De Young","text":"And so if you see, if you understand justification is being made righteous, being put right, sanctification is being made holy, glorification is coming to share in the glory of Christ, as we saw St. Paul already talking about. And we can throw in more. Right, but these are all not sort of a temporal order, but these are all things that happen to us as part of us being conformed to the likeness of Christ, being conformed to his image, as St. Paul said in Romans 8:29, at the beginning of all that. That, that's the goal. So these are all aspects of it, but they're like facets of a gem not these separate, independent things or processes. So they're all things that are true of those who become sons of God by the grace of God in Christ."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5863.25,"end":5868.77,"speaker":"Fr Andrew Stephen Damick","text":"Yep. So does that answer your question, Mrs. DeYoung? Yes."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5868.85,"end":5923.33,"speaker":"Kathy De Young","text":"I mostly asked it for others, you know, who have been brought up with this Protestant concept and this idea of process and, you know, this step and then this step and then this step. And I think it comes to mind. And my. My son likes to say, well, yeah, but. And tell me a bunch of other stuff, but the whole idea of, you know, he does saved, I am being saved, I will be saved. All those things are true at the same time. That. That It. But it. Yeah, they're true at the same time rather than being a process, a one at a time step."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5925.01,"end":5928.13,"speaker":"Fr Andrew Stephen Damick","text":"Amen. So thank you very much."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5928.45,"end":5929.57,"speaker":"Fr Stephen De Young","text":"Enjoy the snow."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5931.01,"end":5932.05,"speaker":"Kathy De Young","text":"You're welcome."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":5934.37,"end":6110.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're gonna. Just. Just to wrap up. I mean, let's. So let's each give kind of a, you know, concluding comments. But before we do that, I want to just give a plug. We have a special episode happening next week. Now, normally we have shows on the 2nd and 4th Thursdays of the month, but we have a special 5th Thursday bonus episode happening next week, and it is our Halloween episode, and it is called the Real Demons of Halloween. And it's our assertion that Halloween involves demons, and that that's not a problem for us. Okay, so we're not going to give away what we're all going to be talking about next week, but I just want to give that plug and please, you know, find that event on Facebook, share it with your friends, invite them and so forth. But I, you know, so for my final comment, I just wanted to read a little passage from that paper that I mentioned earlier from Father Matthew Baker of blessed memory. And the paper is called Deification and Sonship according to Saint Athanasius of Alexandria. You can Google that up and you'll find it. It's all online, actually. But so he talks about. He's talking about Saint Athanasius, obviously, and he has this. This is in one of his paragraphs. He says this in his letter to the Egyptian bishops in 356, Athanasius will count Wiothisia. Again, that means adoption or son making, as amongst the four instructions and gifts of grace given us by Christ, together with prayer, power against demons, and that exceeding great and singular grace, knowledge of the Father and the Word himself and the gift of the Holy Ghost. According to Athanasius, the spirit of adoption and of freedom gives the Christian fearlessness to confess the truth. And I just love that paragraph in his paper and how especially he connects that notion of our being adopted as sons of God with power against demons. I mean, this is an angelic ministry, right, to fight against demons. You know, knowledge of the Father and of Christ himself, the gift of the Holy Spirit, you know that. And also that fearlessness to confess the truth. I mean, if you become one of the divine council, if you become part of the heavenly hosts, then you can confess the truth because you have nothing to be afraid of. Nothing at all. You stand with God, you stand with his angels, and you're becoming like him and you're taking your place alongside them, Alongside all the saints. Alongside all the saints. So that's just what I wanted to highlight at the end. Father Stephen, your final comments."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6111.7,"end":6239.36,"speaker":"Fr Stephen De Young","text":"Yeah, I think it's important. The reason that this is important, what we talked about tonight is important, is that I think for too long we've thought too small about salvation and about God and about his plan. This life isn't about, you know, I did some bad stuff, but I'll do what I need to do to make sure I get to heaven anyway and get out of this crummy world. It's not about God really wanting to save us, but he has this justice problem he has to get over. This is about the God who created the universe, the eternal God who created everything. Created everything so that. So that he could become one of us and so that he could share his eternal divine life with us forever. And we have the opportunity not to do that when we die, if we do the right things here on Earth. Earth. But we have been given the gift to be able to start to experience that right now. Right now, starting with our baptism. And until we realize that, we're going to think too small and we're going to get bogged down in a lot of mundane things in life, in the world. But as long as we keep this great destiny we've been given and we've been created for by God in our minds, we'll have a different perspective about the world and living in it, about the people around us, how we view them and their struggles. And we'll come to know better the God whom we worship and whom we're becoming every day. More like. So that's my closing comment. And hopefully next week I will not be talking to you on a red solo cup connected to a string."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6243.52,"end":6279.25,"speaker":"Fr Andrew Stephen Damick","text":"May it be blessed. You know, Pray for us, everybody. Please, please pray for us. I believe that this is important work, so thank you very much for that. Father Stephen that is our show for today. Thank you for listening. If you didn't get a chance to call in during the live broadcast, we would still love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but can't respond to everything. And we do save what you send for possible use in future episodes and."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6279.25,"end":6296.68,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month and on October 29th at 7pm Eastern, 4pm Pacific. And don't forget to like our Lord of Spirits Podcast Facebook page while you're at it. Leave a recommendation, join the Facebook group and then invite your friends."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6297.16,"end":6304.36,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts. And that raises the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6305.08,"end":6312.52,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6312.84,"end":6314.99,"speaker":"Fr Andrew Stephen Damick","text":"Thank you and and God bless you."}
{"episode_id":"LOS - #005 - 2020-10-22 - Sons of God, Equal to the Angels","start":6321.15,"end":6358.44,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
