{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":0.4,"end":31.36,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World, I will play for you a discussion I had with my brother, Matthieu Pageau, regarding his newly published book at the time called the Language of Creation. The book that my brother wrote is, in my opinion, one of the best books, most succinct books about how to understand a symbolic structure, how to see the symbolic structure in the Bible, but also how it applies to life in general. And so we had a great discussion talking about the different elements in his book. And so I hope you enjoy."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":44.48,"end":47.92,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":58.73,"end":121.49,"speaker":"Jonathan Pageau","text":"Hello, everybody. I've been telling you for weeks we've been waiting for Mathieu's book to come out. I've been telling you that it's on the verge of coming. And here it is, it's finally out. So Mathieu's book is available. You can find it on Amazon. And because of that, I've also been waiting and hoping that Matthieu is going to come back on this channel so that we can talk. And so he's here with me and we're going to talk about his book. So I'm pretty excited. I have been going over the final copies and the final edits of the book, and every time I read it, you know, everything kind of builds up. And when you get. I always tell people, when you get to about page 100, you kind of start having seizures because everything starts to connect together, and it's pretty amazing. So, Matthieu, thanks for joining me. I'm going to start with a basic question. Maybe you can tell people what it is that prompted you to write this. What were you trying to accomplish? What was the motivation for this book on the commentary on the Bible?"}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":122.85,"end":346.11,"speaker":"Matthieu Pageau","text":"Well, I'd say my first motivation is an interest in symbolism and in the Bible, of course. But then in looking for answers to certain questions, I realized that nobody out there was talking about symbolism in the way I was looking for, at least. So I went. I took certain classes at a university level in the Department of Religious Studies, and I quickly realized that it was feminism. It was classes about feminism. So it's not about religion, it wasn't about symbolism, it was about feminism and Marxism. So that pretty much led me to. I pretty much decided right there that one day I was going to try to write something myself because nobody else was doing it. So basically what I realized in general is that in academia, when they talk about the Bible and when they talk about subjects that are related to symbolism, what they do is always the same thing. They use their own categories of interpretation. So they use their own lens to look at the text, to look the stories, and they analyze it according to their own ideology in their own lens. So basically they're using. Well, it's all grounded in materialism. So that's right there. That pretty much annuls any possibility of understanding real symbolism, because real symbolism is not materialistic. So if you look at it through materialistic lens, you might get some glimpses of what it means, you might get some insights, but you're always going to be in a situation where things that are actually simple will appear extremely complex. Because when you look at something with the wrong lens, that's usually what happens. You can look at something that's extremely simple if you look at the world with certain categories. And then if you look at it with the wrong categories, you might get an understanding of it, but it will be extremely complex and it will look, I don't know, artificial maybe is the way to say it. Whereas if you look at it with the right lens, it'll look absolutely natural. And it looks as if it's almost self evident. Like, how could I miss that? That's what happens when you, when you change your perspective, when you use the right lens to look at the Bible, all of a sudden things become kind of obvious. You can almost predict what's gonna happen in a story. When you have the correct lens, you see what's happening, you know where it's leading, because you're looking at it with the right kind of. Like if you understand science and you, and you look at a projectile, you can, you can figure out what's gonna happen in advance. You don't need to see it. You know it's gonna fall. You can kind of guess the distance. You can even calculate it if you, if you have the right information. But so it's kind of the same thing here. If you look at the world with the lens of symbolism, you can predict certain things in the Bible, but not just in the Bible, in the real world too. If you start looking at the world with this particular lens, you can make sense of a lot of what's going on. In particular, a lot of what's going on right now, a lot of what's going on in politics, a lot of what's going on at the social level makes a lot of sense. If you look at it with the proper lens, it. It's almost. I don't know how to say it. It's almost like it has to happen. Like what's happening right now, even though it looks completely insane, if you look at it with a proper lens, it's almost like, okay, this has to happen. It's gonna happen, and then after that, there's gonna be something else. So it becomes less of a big deal, actually, when you look at it correctly."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":346.75,"end":434.27,"speaker":"Jonathan Pageau","text":"I think that that's what really struck me in reading the book is that, you know, I have. You know, we, both of us, we kind of have these. These intuitions of patterns, and I have certain patterns that I work with and everything. But what's amazing is that you really go into the text and you pull out what is really such a simple pattern. I mean, it's very basic. You know, it's geometric, like, it's very. It's very basic. And then you. It's like. It's almost like you're reading. It's almost mathematical, right? It's so precise and it's so simple. It's almost. I always. Even when I'm reading, when I was reading the book, I thought, I hope people. It's almost too simple for people who were looking for something, you know, flighty and complicated. It's like you have to enter into that simplicity. And then once you see it, then after that, through the whole book, you just keep showing over and over, here it is, here it is. This is how it's played itself out here and here and here. And, yeah, it's quite astounding. So maybe you can tell us a little bit about the basic. I would say, like the basic structure, let's say, because I know a lot of it has to do with the relationship between space and time. So maybe you can give us just a little glimpse of what the basic pattern is that you've. That you kind of entered into when you were reading the text."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":434.51,"end":549.42,"speaker":"Matthieu Pageau","text":"Okay, well, basically. Well, I have a background in mathematics and computer science, so that's kind of how I looked at it. That's not what people usually do when they read the Bible. They don't necessarily interpret it like that. But I began having pretty deep insights into the stories of the Bible when I started analyzing it like a mathematician. Okay. So basically, I was just trying to figure out what are the fundamental categories of this cosmology. So obviously, when I started reading the Bible, the first thing in the beginning, God created heaven and earth. So to me, when you look at it with a kind of a mathematical lens, you say, okay, those are the first axioms. Okay? So we have God, we have heaven, we have earth. So those are the axioms. If I derive everything from that, then I've got a sound I've got a sound theory. Okay, not a theory, but I've got a sound system. So that's the basic framework of the Bible. But I also think it's the basic framework of every traditional cosmology there ever was. Well, all the cosmologies I've encountered, they've always been based on this simple structure. Heaven, earth, and then there is the union of heaven and earth, and that it's like the cosmos happens there. So it's like the two poles of manifestation is heaven and earth. And then there is a third element which is called man in the Bible or Adam, and that is like a consciousness that mediates between heaven and earth. And that's also something I've encountered in almost every other tradition. It's not always called with the same names, but it's usually you can tell that it's basically the same pattern. So that's the first pattern. Okay, I've understood that for a very long time because it's obvious in the Bible, like I said, it starts like that."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":549.42,"end":550.34,"speaker":"Jonathan Pageau","text":"It starts like that."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":551.06,"end":582.1,"speaker":"Matthieu Pageau","text":"But that doesn't necessarily mean that it's easy to figure out what all the implications are. So it's like mathematics. I could state the axioms of the basic systems of arithmetic right now. And that doesn't mean people could figure out what are the implications. It takes time to figure out what the implications are when you have principles. Because a basic principle is something that contains huge amounts of implications, but it's in a simple, simple form."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":582.42,"end":597.34,"speaker":"Jonathan Pageau","text":"In the book, you talk about how we often think that things are too complicated to understand. But then you mentioned that sometimes things are actually too simple to understand. Yeah, their simplicity, you know, you can miss what it's actually about because it just seems so."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":597.34,"end":597.74,"speaker":"Matthieu Pageau","text":"It's."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":597.74,"end":599.78,"speaker":"Jonathan Pageau","text":"It's too contained in a seed, let's say."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":600.18,"end":679.49,"speaker":"Matthieu Pageau","text":"Exactly. That's something not necessarily everybody has to deal with. But if you study science and mathematics, you might be a little more used to that. Because if you have a simple scientific formula, a simple equation that describes certain forces, that's an extremely simple concept. But then when you use it in practice, when you use it to interpret as a lens, okay, so if you have a formula, you use it as a lens to interpret reality. You're not trying to understand the formula, you're trying to understand reality with the form. You're using it as glasses. So I'm putting on some scientific theory. I'm looking at the world, and now I'm seeing all the implications of that theory. And I'm seeing also if it matches with reality matches with what I. My idea. So basically, that's the way I approach the Bible. So sometimes the concepts are extremely simple. And like you said, you have to not be turned off by that at the beginning. Because at the beginning. Well, this is something I encounter often. Somebody asked me, for example, what is it? What does the. I'm just giving an example here. What does the tree mean, for example, what does it. I usually don't know what to say because the tree is a fundamental pattern in this worldview. So how am I going to explain it? It's the other way around."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":680.53,"end":686.69,"speaker":"Jonathan Pageau","text":"You have to give examples, examples, examples. And then you can come back to the fundamental notion of the tree."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":687.01,"end":794.66,"speaker":"Matthieu Pageau","text":"Yeah. You don't explain what the tree is. You use the tree as a pattern of interpretation. It's not the same thing. It's like flipped it around. Because if I'm going to describe what it is, I'm going to have to use other categories to describe what it is. And which categories am I going to use? The categories of materialism. Well, that's what symbolism do. They use the categories of materialism and then they try to interpret symbols with those categories and the result is sometimes interesting, but it misses a lot of the obvious meanings that if you just change your goggles, then you'll see the right stuff. So. Yeah, okay, so heaven and earth, that's the most basic categories. That has a lot of implications. I use those categories throughout the book. Everything I say in the book derives directly from that pattern. And then there is another important structure is time and space. Yeah. Okay, so I talk about time and space, but it's not the time and space that, that we can find in physics. Okay. It's. It's like an archaic concept of time and space. And I define them very simply. I define them out of heaven and earth. I say, so space. This is going to be an example of a very simple definition that looks like it doesn't really mean anything. But. So space is when heaven and earth agree. That's like the definition of what I call space and time is when they don't immediately agree. Okay. So it's. You could call it truth and true and false. Yeah. Because that's what it is. True means heaven meets or agrees with earth. Okay. It means the meaning of something matches the fact."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":794.98,"end":798.02,"speaker":"Jonathan Pageau","text":"Right, Exactly. That's an easy way for people to see it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":798.1,"end":843.51,"speaker":"Matthieu Pageau","text":"Yeah. The identity of something matches the fact of the thing. So if you have. If you're a scientist and you have a theory that's the heaven, and then you do some experiments. You're trying to see if heaven and earth match. So you're trying to see if your theory is true to the fact and vice versa, if the fact is true to the theory. So it's the definition of truth. So in my book, I call that space. Okay. And I go, I talk a lot about it. It's not just an anecdote. And then there's. The other side is when it doesn't match. So that's when you have an idea and the facts of. The facts of reality are not fitting with your idea. Yeah. That doesn't necessarily mean always that the idea is false or that the fact is wrong. It could be, yeah."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":843.51,"end":844.23,"speaker":"Jonathan Pageau","text":"It just doesn't fit."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":844.23,"end":858.54,"speaker":"Matthieu Pageau","text":"Many factors. Yeah, it currently doesn't fit. Sometimes it can fit with some work. Sometimes it can fit if you get a little bit clearer understanding. But anyway, the idea is true and false. That's what I call space and time. Yeah."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":859.26,"end":890.78,"speaker":"Jonathan Pageau","text":"I have this image that is. I tried to find one of the most basic examples to help people understand how immediate this is. Imagine you're a child. You're a growing child. And then you have a shirt, and you wear this shirt. So you wear the shirt. The shirt is space. It fits you and you're wearing it. And then at some point the child grows, grows, grows. Now the shirt, it doesn't fit. And so now there's a disjunct."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":890.78,"end":891.02,"speaker":"Matthieu Pageau","text":"Right."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":891.02,"end":900.14,"speaker":"Jonathan Pageau","text":"Between the reality of the child and his space, his clothing that he wears. And so the only solution to that is change."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":900.46,"end":900.82,"speaker":"Matthieu Pageau","text":"Change."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":900.82,"end":903.66,"speaker":"Jonathan Pageau","text":"You have to change something. You have to change something."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":904.54,"end":909.86,"speaker":"Matthieu Pageau","text":"That's why use that example to explain why I call this change. It's time. Exactly."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":909.86,"end":910.54,"speaker":"Jonathan Pageau","text":"Time is changed."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":910.86,"end":915.85,"speaker":"Matthieu Pageau","text":"It's just change. When things don't fit, they have to change. And they do. Yeah."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":916.73,"end":933.21,"speaker":"Jonathan Pageau","text":"One of the things you explain, really, that's important, is that we have. We think that change just means things developing, let's say. But you really differentiate change, which would be, let's say, the change of the child becoming a man."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":933.61,"end":934.01,"speaker":"Matthieu Pageau","text":"Right."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":934.17,"end":953.73,"speaker":"Jonathan Pageau","text":"And the change of changing the clothing that goes on the child. One is something manifesting itself in its own identity, and the other is. Is actually. You have to transform into something else. Like it actually transforms into other. You have to adjust reality to fit an identity. And so it's not."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":953.73,"end":954.01,"speaker":"Matthieu Pageau","text":"It's."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":954.01,"end":966.61,"speaker":"Jonathan Pageau","text":"It's two different. We tend to think those two are changed. But you really try to, To. To separate those two. Because. Because if you. If you think that they're the same, then you. You end up in a confusing and Confusing place."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":966.69,"end":1096.39,"speaker":"Matthieu Pageau","text":"Yeah, well, that's. Yeah, I haven't. There's a. There's a chapter in my book about exactly that and maybe one or two. And that's actually pretty important because it's related to materialism. If you're not a materialist, things have an identity and they have a body or a concrete reality and an ideal reality. And then when. When change means something happens where this doesn't fit anymore. But if you're a materialist, change doesn't mean that because there's no. Things don't have an essence. So it's not even about symbolism per se. Even if you think in terms of Aristotle or in terms of philosophy before materialism, the concept of change is the same as the one I'm describing here. It's the idea of transformation. So if you talk about transformation, you have to acknowledge that there is a form. There's the concept of form somewhere. So as soon as you have the concept of form, you have the kinds of transformation or not transformation. So something can become bigger and bigger without transforming. So that's the idea. A shape can remain true to itself. Even if it grows in size, it stays the same, in a sense. And here, let's say you change a square into a circle, that's a transformation. If you make a square bigger, it's not a transformation. It's not change. Anyway. Just a way to distinguish the concepts here. Okay, so basically my book, I talk about, like I said, time and space, which has not very much anything to do with our current notions of time and space. And one of the important concepts is the fact that time is cyclical. That is extremely important. It's one of the things I go into in my book a lot because it has a lot of implications. We are absolutely not used to thinking in terms of this cyclical pattern. We're just not used to doing it. So I try to give some examples in my book of what it means of how this pattern manifests the cycle, because it's something we're not used to. I don't exactly know why. It's a strange thing, actually, because we."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1096.39,"end":1099.03,"speaker":"Jonathan Pageau","text":"Live in cycles all the time. I mean, we have days, we have."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1099.03,"end":1099.87,"speaker":"Matthieu Pageau","text":"Weeks, we have years."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1100.27,"end":1112.92,"speaker":"Jonathan Pageau","text":"Our entire life is filled with cycles. It's funny that people tend to think of time just as a linear kind of succession of moments, let's say, which. I mean, obviously that's not how we experience it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1113.08,"end":1173.54,"speaker":"Matthieu Pageau","text":"Yeah, and people often say. People often say things like, oh, Eastern traditions have cyclical time and Western traditions have linear time. I think that's just wrong. I think that's just an example of. I don't know how to say this. It's just an example of how academia is trying to kind of subvert the traditions of Christianity and by any means possible. And one of those ways is to find other traditions and then use that to show that this one is lacking in some way. Or that's actually one of the things that turned me off from. From the university level studies about the Bible. Most of it is subversion. Yeah. To be honest, it's all about, we're gonna subvert Christianity or maybe, maybe even Judaism, traditional religion, basically, we're gonna subvert it. We're gonna replace it with. I'm not sure what they want to replace it with. Feminism, I guess. Yeah."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1173.54,"end":1201.37,"speaker":"Jonathan Pageau","text":"But they can use, they can use. That's why you hear people use other religions as a weapon basically in order to destroy Christianity. It's not like they actually care about, you'll say northern paganism, but they care about it to the extent that they can say, well, look, Odin hung from a tree and therefore Christianity is just baloney. Because here are other traditions where someone hangs from a tree. It's like they don't. They just use it as a weapon to bludgeon Christianity."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1201.53,"end":1261.67,"speaker":"Matthieu Pageau","text":"Yes. Actually, this is one of the. One of the reasons why I wanted to write my book was to get rid of some of those argumentations because they're kind of childish. For example, someone sees something in some other foreign religion and then they see the same pattern in Christianity and then they say, oh, this one must come from that one, or this one must be a copy of that one. To me that means you don't understand the pattern. You don't understand how fundamental it is, how obvious it is. And so to you it's just a strange thing. So how did it get from. I don't know, how did it get from Africa to America or. And then you have to find some weird causality because to you. I'm being very serious. These symbols are strange, they don't make sense. So if you see them in one place and then you see them in another, you have to explain them through some kind of mechanical causality. But if you understand the meaning of it, you don't have to do that."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1261.99,"end":1273.33,"speaker":"Jonathan Pageau","text":"It's obviously the pattern of reality. So of course it's going to, it's going to, it's going to manifest itself. Symbolism is, is going to happen. You know, it just. Because that's the basic structure of the world."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1273.49,"end":1364.32,"speaker":"Matthieu Pageau","text":"Yeah. Because it describes exactly, it describes A reality. It's not. Because this is also one of the ways that was used to subvert. Acting as if it was completely arbitrary. Yeah. So the stories, the symbols, they're arbitrary. You know, they were just made up by some person. Usually they interpret it in kind of a Marxist way. They were. They were invented for power, to control to. I don't even know. I don't even want to say. I just get annoyed by this. So you can always analyze anything in that lens anyway. So it's not just religion. If you want anything anybody says, you can analyze it with the lens of power and you can criticize it like that. So it's not. It's not even a valid criticism, in my opinion. So anyway, when you start understanding the patterns, you see them in different places. You see them in the Bible, you also see them in different traditions. I'm not trying to say that all traditions are the same or anything like that, but they had a common basic framework of understanding reality. And it's actually pretty amazing how universal it was. You look at Native American traditions and you see the exact same fundamental patterns. You see heaven, you see earth, you see the tree, you see the hoop, you see all these patterns. It's exactly the same patterns. Okay, so that means. It doesn't mean there was necessarily a transfer of knowledge from one to the other, although it's possible. But it means that they're just describing reality. It just happens to be not the same exact reality as the physicist is trying to describe. Yeah."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1364.32,"end":1389.18,"speaker":"Jonathan Pageau","text":"But in the end, what's interesting in your book, and it's something that's been kind of floating around in different discussions online, in my discussion with Jordan Peterson and Bret Weinstein and everything, is that in your book, you end up containing science within your symbolic framework because you talk about this problem of theory and fact. Right. So maybe you can talk about that, because I think that's something that will interest people."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1389.58,"end":1507.77,"speaker":"Matthieu Pageau","text":"Oh, yeah. Well, it's. This is also one of the reasons why I wrote my book. The idea of reconciling science and religion is obviously very important to me, as I think it is for a lot of people, because it's. It's like annoying pain because it's like our past doesn't fit with our. Our present and future. Yeah. And there's something unsettling about that. I don't want to think that all of our ancestors were a bunch of idiots. I don't want to think like that. Okay. So I'm. The idea that I want to reconcile these two universes. It's just something that's in me. I don't even know where it comes from. It bothers me. I don't want to separate from the past. I want to join things together. So the idea of reconciling science and tradition or religion has been always in my head since I was a teenager and I got interested in evolutionary theory. At first it was to debate it or confront it as a Christian. And then after a while, at one point I said, okay, I'm going to read Darwin's book. I'm just gonna read it. I'm gonna stop just assuming it's wrong, and I'm gonna read it. So I read it, and I thought it was really interesting. And I saw in no way how that contradicted my ideas about God or anything like that. So to me, they had no contradiction. At first it did, but then slowly I started to see that I had a weird glimpse at one point. I could say maybe a kind of a spiritual experience where I was trying to reconcile these. These worldviews. So let's say evolution and creation. Okay. And then I had this weird glimpse where I saw how if you include the theory of science in the evolutionary process, then everything changes."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1507.77,"end":1508.49,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1508.49,"end":1555.76,"speaker":"Matthieu Pageau","text":"Almost becomes like a religious worldview. Okay. And this is one of the reasons why we were interested in Jordan Peterson. First of all, you're the one who first talked to me about Jordan Peterson. But then I became really interested when he started talking in these terms because that kind of coincides with some of the glimpses I had when I was trying to reconcile creation. Well, now I wouldn't even use the word creationism anymore. You see, creation and, well, modern scientific knowledge. I had this glimpse where I saw that the whole problem is the scientific theory is not included in the worldview of the scientist. So the scientist is not putting his own theory. It's like he's separating his theory from his. From the world completely."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1555.76,"end":1563.72,"speaker":"Jonathan Pageau","text":"It's as if his theory doesn't actually exist in the world. Like it, It's. He doesn't think about. Like, he doesn't even. It's a. It's. It's a blind spot is what it is."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1563.8,"end":1692.54,"speaker":"Matthieu Pageau","text":"Yeah. It's like I don't. At the same time, I understand this is where the power of. Of materialism comes from. It's like I don't even know how to explain it. It's like a denial of. Of spirituality. The theory that the scientist has is part of the spiritual realm. I'm careful when I use these terms because I know people will interpret it in any way, it's not material. Your theory about the world is not material. So no matter how you look at it, it's not material. So because of that, they act like the theory itself is not part of the universe and has no influence on the universe. But it obviously does. I mean, if you're a scientist and you discover something that explains reality, then reality changes. It's not a weird metaphor or some weird new agey thing. You're a scientist, you have a theory, you experiment, you show that it works, and then you transform the world. You change the world with your understanding of the world. So tell me again how your theory is not in your model of the universe. There's something missing there. Because when you understand the world, you influence the world. You don't even have to look at it at quantum level or anything like that. You can just look at it at a normal level. The scientist understands, he makes the connection with reality, then he gains power in the world. Not necessarily that particular individual, but humanity, using that knowledge, gains power, control, and control over the world and understanding of the world. So why. Why isn't your theory part of one of the forces that's in the world? Why isn't it part of the. Your model? So anyway, so that was the glimpse that I had at that moment, and it kind of blew my mind, I don't know how to say. And it took me maybe 20 years to deal with that. Yeah. To deal with that idea. Just that. Just that idea of including the theory in the. In the model. Yeah. So I guess my book is kind of maybe the culmination of that. It took a lot of twists and turns. And finally, it's not the subject, per."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1692.54,"end":1695.34,"speaker":"Jonathan Pageau","text":"Se, of the book, but it permeates the book."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1695.66,"end":1744.64,"speaker":"Matthieu Pageau","text":"Yeah. My understanding or my questioning about that problem is what led me to understand traditional cosmology in a certain way. And in the end, what I see is that the traditional cosmology is that what I'm describing, It's a universe in which the scientist has included his theory in the universe and has included his model of the universe in the universe. And even when I just say that, you can see that that is how traditional knowledge works. Because if you look at ancient patterns, it's always, you have a cosmos, then you have a mini cosmos, and then you have another mini. It's like a fractal putting a mirror in front of another mirror. That's exactly what happens. So that is how traditional knowledge works."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1744.8,"end":1767.71,"speaker":"Jonathan Pageau","text":"Like, this is really. I think this is really for the book. This is really to me, one of the glorious aspects of your book is that, you know, we talk about, let's say, microcosms. You know, I mean, people have been talking about the notion that, you know, that man is a microcosm for, you know, for centuries, since Plato or whatever. But, but, but what you are able to do in your book, which is amazing, is you actually show it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1767.71,"end":1768.03,"speaker":"Matthieu Pageau","text":"You."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1768.03,"end":1793.27,"speaker":"Jonathan Pageau","text":"You actually could show it even in diagrams. Like, you create these. These diagrams that are. That are fractals that move into each other. And then you do it with the story. Then you kind of show how he. You know, within a story, you know, the different aspects of the story are mini versions of the whole story. And it's. I mean, that is just. To me, that's a. It's a Tour de Fosse, like we say, like you're really able to show it because it's easy to talk about it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1793.27,"end":1793.79,"speaker":"Matthieu Pageau","text":"We kind of."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1793.79,"end":1809.59,"speaker":"Jonathan Pageau","text":"We have an intuition that that's how the world works sometimes. But you're able to really kind of show it. In terms of. What I'll do is, I'll edit. I'll put some diagrams, like, just to show people. At least they'll see the diagrams on the video of how you're able to kind of embed these parts into each other."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1810.31,"end":1845.27,"speaker":"Matthieu Pageau","text":"Yeah, that's something I wanted to mention with regard to my book. One of the ways that I dealt with the problem of. That I was describing at the beginning of our discussion where the idea that when people try to understand symbolism or interpret the Bible or any traditional story, they're using the lens of science. They're using the lens of different disciplines, academic disciplines, that are all grounded in materialism, because that's. That's the world we're in right now. So one of the ways I tried."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1845.27,"end":1845.59,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":1847.99,"end":2030.86,"speaker":"Matthieu Pageau","text":"Help the reader look through a different lens is by using images, diagrams. Because what happens. I'm not a neuropsychologist or anything like that, but there's a part of our mind that when it uses visual images, it doesn't interpret them the same way as language. So I found that it was possible to get the person to look through the lens of certain categories by using pictures instead of words. Because when you use words, the person interprets that language with their own categories. So if I use a certain word. So, for example, this is something I talk about in my book. If I say the word heaven, well, most people will interpret it with a current lens and they'll say, I'm talking about the sky, right? And the atmosphere. So if I use the word heaven. I have to be very careful to remind the reader that I'm not talking about the atmosphere. Right. But the problem, it's okay for a couple of terms like that, but when all the words don't, at some point, every single word that you're using, it has to be reinterpreted. It becomes a little bit painful. Right? Because it's like every word I have to say, oh, when I say this, I actually mean this. I don't mean what you think when I say this, I mean this. It would be extremely painful. So what I did was I used pictures, a lot of them. There's a lot of images in my book, and it's always the same pattern. I repeat, repeat, repeat. The purpose of that is for the reader to kind of get this imprinted in their. In their brain. The basic fundamental patterns of symbolism. So you have the hierarchy, you have the cycle. You have the idea of heaven and earth. Right? Like a duality of heaven and earth. So that pattern is repeated I don't know how many times, like maybe over a hundred. There's diagrams on every page. The reason is, is because I want that diagram, that picture to get imprinted in your mind so that you don't think about it anymore and you just slowly start to. Well, like glasses. You don't know. You're wearing your glasses. You're looking through them. You're not looking at them, you're looking through them. So if I repeat the same pattern, the pattern kind of becomes your glasses. Right, Your lens. So that's the reason why I use so many. So many diagrams. So basically, I use the same patterns, and I use them to interpret different parts of the Bible, different stories. The story of Cain and Abel, the story of Noah, the story of the fall, Adam and Eve, the serpent, the tree, everything, all that. So I reuse always the same patterns in every single story to interpret it. So basically the idea is that they're all based on simple definitions, except we're. We're so not used to thinking like that that I couldn't just give the definition and then talk about it as if it was acquired. Because it takes a little bit of time to intuitively acquire this way of thinking. So there you go. That's why I use so many images."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2031.1,"end":2082.4,"speaker":"Jonathan Pageau","text":"Yeah. But that's also why I tell people, like, make it to, like, page 100. Like, at the beginning, you're building. Like, it's a bit more of an effort. Like you're building, you're building. And then once you reach, when you Reach some of the examples that you give. I say page 100. I'm not even sure if that's the right place. Maybe even a bit before. Then all of a sudden things start to click. Like you. I could. I. You know, and it's funny because you and I, we were. You're probably the person who thinks the most like me, let's say, in the world, I would say. But even though, despite that, as I was reading your text, it was. There was really a magical aspect to it. Like, it was really change. I could feel it changing some of my perception. Like, I could feel it transforming some of my. Of the way that I view the world and kind of fusing. Fusing things together in my mind. And so I. I think it's definitely. Yeah, it definitely has something magical about it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2082.4,"end":2082.96,"speaker":"Matthieu Pageau","text":"Like, it's."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2083.2,"end":2093.92,"speaker":"Jonathan Pageau","text":"I think that people reading this book, if you read it honestly, it'll be difficult to reach the end without being changed in terms of your frame of view, like in terms of the way you see the universe."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2094.24,"end":2134.42,"speaker":"Matthieu Pageau","text":"Yeah. And of course, the idea always is not to become insane or anything. Maybe I should give that warning. Don't become insane when you read that book because it. It happens when you change your lens, you change your lens, you can go insane. Because what happens? And then you try to communicate those ideas to people around you and then they have no clue what you're talking about and they look at you like you're insane. So that's probably one of the key factors in becoming insane is when you start saying things and people around you are acting like you're saying gibberish. So just fair warning, don't go insane."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2136.98,"end":2139.78,"speaker":"Jonathan Pageau","text":"Author, fair warning, don't go insane while reading my book."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2140.58,"end":2143.78,"speaker":"Matthieu Pageau","text":"Talk to people who already think in those terms."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2144.02,"end":2144.74,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2146.74,"end":2147.62,"speaker":"Matthieu Pageau","text":"That's hilarious."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2148.18,"end":2208.45,"speaker":"Jonathan Pageau","text":"Oh, man. And I think that one of the things that. One of the things that is really going to be surprising to people is that you really don't shy away from any subject. Like you, You. You talk about time and space and about society and about cycles of time, but then you talk about human beings, you talk about sexuality, about taboos, about, you know, all the weird stuff. A lot of the weird stuff in the Bible that, you know about giants and fallen angels and all this stuff in the Bible that is so weird. People, they look at it and they just think it's absolute insanity. But you, you kind of bring it all together and I think that that's something that people are really going to. Are really going to open their eyes. Like the last part of the Book especially, I think, is really going to surprise people in terms of how not only talking about all that weird stuff, but talking about it in a way that helps. It's not weird what's happening now. It's showing us exactly where we are now. What is all this weird stuff that's happening?"}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2208.93,"end":2210.41,"speaker":"Matthieu Pageau","text":"All the weird stuff happening?"}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2210.41,"end":2236.36,"speaker":"Jonathan Pageau","text":"Exactly. All the inversions, all the upside down world. Like, you make total sense of that, especially in the last part of the book where you start talking about those subjects. So I think it's going to be. Yeah, I'm really. You know what? I'm also excited is to start to see people talk about it and start to see people discuss it on social media. So it'll be interesting to see people kind of bring things up and see how it morphs into different things."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2236.68,"end":2255.83,"speaker":"Matthieu Pageau","text":"Yeah. I'm curious to see also what the reaction will be, because I have no idea if it will fly or not. I've been. I've been doing this for about four years, so I've completely immersed myself in this way of thinking. So to me, these things have become absolutely obvious. Yeah. So I don't know."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2255.91,"end":2267.76,"speaker":"Jonathan Pageau","text":"I got some first comments. Like, on the first day that it was out, it was so funny because I didn't even know that it was out because I think it was kind of. You put it up on. What is it called? Kindle."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2267.92,"end":2268.32,"speaker":"Matthieu Pageau","text":"Right."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2268.88,"end":2274.16,"speaker":"Jonathan Pageau","text":"And I didn't know it was out. And someone else on Twitter said, I've been reading it all day."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2274.72,"end":2276.12,"speaker":"Matthieu Pageau","text":"And I thought, what? The book is out."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2276.12,"end":2300.47,"speaker":"Jonathan Pageau","text":"It said, I've been reading it all day and it's exactly everything I was hoping for. Then I got another comment, someone telling me saying that, yeah, their mind was constantly being blown. And so every comment, obviously every comment that I've gotten has been more than just, oh, it's good. It's been like, okay, this is really changing, really changing the way I view the world. So I think that at least for people who will read it, honestly, it's going to. It's going to have the effect that we're hoping it's going to have."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2300.95,"end":2438.85,"speaker":"Matthieu Pageau","text":"Yeah. One of the things I want to say is that I'm not trying either to convince anyone of anything. I'm just describing something that I understood. I'm not trying to convince anyone. This is also why I don't shy away from subjects, because I'm not trying to. I'm not even trying to reconcile the ideas that are in the Bible with our current way of understanding. I'm not even trying to do that. I'M just trying to describe my understanding of these stories, and sometimes it gets a little weird. But the weirdness is not, is not absurd. It's a weirdness that makes sense. It's only a question of, okay, we don't see the word like that right now. Or we don't see it like that anymore. Maybe in the past they did. At least it helps us to reconcile the past a little bit. Instead of thinking that our ancestors were a bunch of fools and at least say, okay, they weren't concerned with the same things as we are. We're interested in technical knowledge. We've advanced really, really far in technical knowledge, and we have brilliant insights into that. But we've also lost a certain kind of understanding that our ancestors obviously had. And yeah, it's. It's important to not make light of the fact that our worldview is completely different from that of the past. There's something eerily wrong about that. We have to figure out some ways to bring them together. Like I said, I don't try to do that in my book. What I try to do in my book in terms of science, in terms of the relationship between tradition and science, is just to give a way out to, to this, like the spiritual understanding of the world. Just get away from, out from under the foot of science, okay? Because science has been crushing, crushing down on traditional knowledge for a long time. And I'm not complaining or anything like that. I love science. I've always loved science. I'm just noticing that religion is taking less and less space. The problem with that is it will be replaced by something else. Okay. And that thing is gonna be weird. Yeah. Okay. If you don't. If we don't understand what's happening, something very strange is gonna happen. It's happening now. The weird stuff is happening is because."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2439.01,"end":2471.01,"speaker":"Jonathan Pageau","text":"No, but it's already happened. It happened. We had a cycle of it in the 20th century. I mean, communism and Nazism was exactly. That was exactly a space in which the materialist worldview, you know, the something was filling up the void of the spirituality in the world. And so we kind of. I mean, we killed 100 million people. Now we're taking our breath, but we haven't dealt with anything. It's like we're basically just taking our breath from those hundred million deaths in the 20th century. And if people think it's not coming."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2471.01,"end":2471.37,"speaker":"Matthieu Pageau","text":"Back."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2473.69,"end":2491.64,"speaker":"Jonathan Pageau","text":"Unless we can reconcile these things, it's going to come back. There's no. And like you said, it's already happening. We look around. I always tell people like, we are sitting. We are standing in Weimar Germany right now. Like, you know, weimar Germany Times100 is where we are. And so what comes after that? You know, it's not pretty."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2492.04,"end":2542.94,"speaker":"Matthieu Pageau","text":"No. Yeah. So we have to figure out what. What happened. Because traditional knowledge is not. It's not. It's not the same as experimental or rational knowledge. And when I say that, I'm not saying that it's irrational, because it's not, but it's a kind of knowledge that's been passed down. It's passed the test of time. Okay. That's not nothing. That's a big deal. It means it works. That's what it means. It means there's something in it that fits with reality. Now, it doesn't necessarily fit with our scientific understanding of reality, but maybe it fits with some aspects of reality that we're not aware of. So we should never just throw away ancient knowledge like that as if it was nothing. Something that's been around for thousands of years might contain some information that you don't know as a modern person."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2543.1,"end":2595.29,"speaker":"Jonathan Pageau","text":"Yeah. And especially as we move. And this is something that we've talked about, and it's something that's kind of been popping up more and more online and in different discussion. As we move towards these movements in cognitive science and this movement towards trying to understand consciousness and human consciousness, we're seeing little glimpses of a connection where as we talk about cognitive science, there is this notion that you. You then you once again do have to fit cognition in the world. Like cognition has to be a phenomena in the world. It has to be part of the universe. Our thoughts have to be part of the universe. Our, you know, our understanding has to be part of the universe. And when that happens, all of a sudden, some of the structures we are seeing, some of the structures that you talk about in your book, popping up even in scientific discourse. So that's really fascinating."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2595.85,"end":2602.61,"speaker":"Matthieu Pageau","text":"Yeah, well, yeah. We were talking about. Just before we started recording the. You sent me a link to a. Yes."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2602.61,"end":2617.89,"speaker":"Jonathan Pageau","text":"Sam Harris, of all people. He shared on Twitter this discussion with Hoffman. I think his name is. I think it's Hoffman. I'll put a link in the Description, a podcast where he talks about the science of cognition."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2618.05,"end":2618.93,"speaker":"Matthieu Pageau","text":"John Hoffman."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2618.93,"end":2631.37,"speaker":"Jonathan Pageau","text":"John Hoffman. And how basically he positing a theory that consciousness is a constitutive element of the universe. Which, I mean, it's like that's what we're saying. You know, we're trying. That's what we're."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2631.37,"end":2713.78,"speaker":"Matthieu Pageau","text":"That's where we're going. There's like bridges being created right now, I would say between traditional knowledge and scientific, technical knowledge. And I think it's great. I don't know where it's going to exactly how it's going to happen, but it's. Clearly there's. Things are happening, things are coming together. So I know, hopefully my book will help a little bit in some aspect of that maybe to understand religion or this perspective in its own. In its own way, not in the way, not interpreting it through a different lens, trying to adopt that worldview, see the world through that worldview instead of just analyzing it from a different perspective and looking at it. Because there's always a little bit of a cynical undertone to that. When you look at religion with a lens. Doesn't matter what lens you use, if you use sociology or anything like that, psychology even, there's always a little bit of an undertone of cynicism. It's normal because part of you has to look at it like it's not true or like it something wrong with it because it doesn't quite fit your category. So you have to like deal with what doesn't fit in a way that's kind of a little bit cynical. So it's like, I'm going to accept this part of it, but this part of it, nah, it's just. That's just. We're not going to go back to that or we're not going to even try to understand it because it's just."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2713.78,"end":2718.22,"speaker":"Jonathan Pageau","text":"Nonsense or it's just nonsense. There's a word."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2718.54,"end":2763.71,"speaker":"Matthieu Pageau","text":"Yeah, see, that's the thing. I mean, if you're a scientist and you look at a phenomenon and then you see an anomaly, you're not supposed to say, oh, I'm gonna even gonna look at that. It's stupid. No, you're supposed to say, whoa, maybe my theory doesn't account for that anomaly. I have to change my theory to account for that anomaly. Because saying that an anomaly just isn't important, that's fine for a while, but then you know what happens. The science has dealt with that problem many times. You can put the anomaly under the rug for a while and then it always comes back to take you down in the end. So it's the same thing when studying traditional knowledge. The anomalies are there to tell you, hey, there's something you don't understand, not the other way around. So that's my perspective on it."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2764.75,"end":2810.1,"speaker":"Jonathan Pageau","text":"All right, guys, so the book is out, it's on Amazon. You can find it at your different. Whatever country you're in. Go to Amazon, put Mathieu Pageau in the search or the Language of Creation and. And buy the book, leave a review as well. We're trying to push it now and hopefully we can attract a little bit of attention to it. And this is the place. So we're going to be talking about the book once in a while on this channel and I want to foster a discussion as well. We'll try to find spaces for all of you guys to discuss the book and talk about the ideas and we'll try to find ways to do that. Another thing is that some people have been asking me, how is it that I can encourage Mater? Because Mater is kind of."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2810.34,"end":2810.94,"speaker":"Matthieu Pageau","text":"He's not."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2810.94,"end":2843.51,"speaker":"Jonathan Pageau","text":"He doesn't have an online presence. You know, he has a slightly more hermit personality. And so he's not online, he's not on social media for sure. So what we're going to do is I'm going to put a link to Matthir's Patreon account. He's going to open a Patreon account and his PayPal. So if people want to support what he's doing financially, they then we'll have a way for you to do that. And so stay tuned. And hopefully Mathieu will also come back because while he was finishing his book he said, no, I don't want to make any videos. You know, I just have to focus. I need to finish this thing."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2843.51,"end":2844.67,"speaker":"Matthieu Pageau","text":"But now it's finished."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2844.75,"end":2850.27,"speaker":"Jonathan Pageau","text":"So I'm hoping that we'll see more of him on my channel as well. So I don't know, we'll see about that."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2850.59,"end":2851.55,"speaker":"Matthieu Pageau","text":"Yeah, we'll see about that."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2853.55,"end":2857.63,"speaker":"Jonathan Pageau","text":"I have to find ways to coax him, to coax him to come onto the channel."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2858.03,"end":2858.27,"speaker":"Matthieu Pageau","text":"So."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2858.67,"end":2862.67,"speaker":"Jonathan Pageau","text":"Alright, so people, stay tuned and thanks for watching. All right, bye bye."}
{"episode_id":"SW - #033 - 2019-04-02 - The Langauge of Creation - with Matthieu Pageau","start":2863.47,"end":2919.37,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that, that this is also a podcast. So share it to your friends, share it on social media. And if you can feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
