{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":0.48,"end":106.83,"speaker":"Jonathan Pageau","text":"So before we start, I just want to emphasize that I know that some people have said that they watch my video with their kids, and sadly, this video is definitely not going to be one you're going to watch with your kids. I'm going to deal with an important subject. I'm going to try to not necessarily use big words, but inevitably it will deal with some difficult things. For several years now, we've seen the subject of cuckolding appear in the vision of politics, especially in the right wing circles. We've heard people talk about this subject, using it as an accusation for people who are willing to sacrifice their own culture in order to engage with other, in order to receive other cultures, you would say, and are self deprecating. And so they, they've used this term to talk about it. And it's an interesting, it's an interesting use of the term. But I also. And one of the things that I've seen is people asking me about Joseph. And in the story of the Incarnation, we see that Joseph, who is promised Mary, is then all of a sudden surprised to find that his wife is pregnant and that she is pregnant with the Son of God. And so in a way, some people have seen this as almost a kind of divine cuckolding. And you see, jokes about it, even in the Middle Ages, about the idea that Joseph is somehow a kind of divine cuckold. And so we need to look at this question, see what it could mean, because this notion is a pattern of reality, one which is more pervasive than you think, and also one which actually doesn't always have the same meaning and can also have a double meaning that we'll both look at. And it might also temper the way that people try to use it in order to attack their political enemies."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":120.44,"end":123.96,"speaker":"Announcer","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":134.54,"end":826.18,"speaker":"Jonathan Pageau","text":"Now, in order to understand this question, we have to imagine ourselves in an ancient world, in a world of tribes, a world of small tribes, of small groups, of small clans that are surrounded by other clans, that are surrounded by more powerful clans, weaker clans, we have to be able to project ourselves in that kind of very, very primordial space. And we can imagine that in that context, whatever it is that you have in terms of your possibilities for your future, and you can understand that as your possessions, you can understand that as your land. And you can also understand it as the women of your clan, because the women are your, of your clan, are the ones who will carry your seed into the future that will, let's say, permit that you continue to exist. In the future. And so all of these aspects of potentiality, you could say, are something that the clan would have had. You know, like I said, there's also the land and your possessions, all of these things. And so sometimes people will be very angry to see how in the past, women were seen as possessions. But we need to understand it symbolically in the sense of how the women are those that are the vessels to bring your. To help you to survive into the future. They're the one who will carry your children, and your children will perpetuate your lineage. Will perpetuate. Will perpetuate your story. And so you can imagine in this. In this world where you are constantly in danger of being attacked from the outside, from other clans that are stronger than you, from other groups. You know, imagine that you're just a family together with your kids and a few families, and then all of a sudden, this. This. This strong clan will come in and what. What will they do? They'll take whatever it is you have. And that will usually include taking your women. It might include taking your women for good, or it might include just using them on the spur of the moment. And in order to kind of cast the doubt and to destroy your lineage, you would say, or cast doubt on your lineage, make you weaker by abusing your women and then leaving. This has been a war tactic from since the dawn of time, and it is sadly still a war tactic today, where one of the tactics to destroy your enemy is to. Is to abuse their women. And that way you destroy, you destroy. You affect even the identity of the group that you are attacking. Now, what's really important to understand is that that is one of the aspects of you losing your possibilities. And so you have. Because one of the problems that you have is that there's always more outside than there is inside whatever identity you have. So you have this identity inside, and then you have all these other things outside that are always. You're always in danger that those things are going to come and take what you have and take it for themselves and therefore destroying who you are. And so this, like I said, it has all kinds of connotations. And one of them is a sexual connotation. Now, what would you do in that context? How would you deal with that problem? And the way that you deal with the problem is to create structures of us, right? To. To. To make your clan stronger, to maybe align yourselves with other clans that are closer to you in terms of your family, in terms of your, you know, in terms of your interests or whatever you bind Yourself together with several people, and you create a unit that is stronger than what your unit was before. And one of the ways of doing that, and the way that seems to have been the most effective is to also create a kind of pyramid where you will, this clan that comes together will also have a head, will have a leader, and that leader will give your clan a stronger identity, will give your clan also a direction, will help organize the structure so that you're stronger and so that you are capable to cohere together, but also more capable to defend yourself from these outer clans that come and get you. Now, you'd think that that would solve one of your problems, and it does solve one of your problems. But then another problem appears. And the problem is that if before your possibilities, your possessions, your land and also your wives and your daughters would, could be taken from the outside, now the specter comes that this, that your wives and your daughters and your land and your possessions is also going to be taken up by the chief. We call it taxes. So it's like either you pay a tribute to your enemy who attacks you and then demands that you pay tribute to them. In order to stop that, you create a structure and then you end up paying taxes, so you end up paying up. So instead of paying out, you pay up. And so this is an actual reality and we see it as, as old as the stories of Gilgamesh where the people are angry against Gilgamesh because Gilgamesh insists on sleeping with a woman on the night of her marriage before her husband will have a relationship with her. And the story of this tradition, this idea of first night, this tax, this sexual tax that you have to pay up to your leader is a story that will perpetuate itself until it, until Europe, you know, and you have these ideas that, that pre Christian Europe had this tradition of first night where the chief would have access to your wife for the first, for the first night, and then, you know, then you would have her for the rest of the time. And it's a way for the chief to, to, to, let's say, to solidify his power on you, to say you are under me, and in order to show you that you are under me, I am going to take, take your wife. And there's not only your wife, but also your daughter. So the whole image of the king or the chief with the harem who takes, you know, the, the, the, the different, all takes more women than anybody because he's above everybody else. So he has this harem of women for himself. And then all the other people that are lower than him on the hierarchy end up, you know, scraggling and fighting to, to have access to women. And so this isn't, this is a really a reality. And so in this, the political sphere that we see today, we, we always in, you know, the kind of right wingers, they tend to want to emphasize the idea that, you know, the problem of giving up to the outside, of, of abandoning yourself to the outside, of being weak towards the outside, so that they take your possibilities. But, you know, when their idea is to create some really, really strong authoritarian structure in order to prevent that, you don't realize that it goes the other way as well. And we have seen examples of that in the modern times. For example, a very good example was that the tyrant Mobutu, the dictator, he named himself Mobutu Sese Seko, which in his language, one of the meanings of his name is the cock that stands above the roost, that is, above all the hands and, you know, and holds the hands together. And so Mobutu would. It is known that Mobutu would sleep with all the wives of his ministers, all the wives of his counselors. That if you wanted to be high up in his hierarchy, one of the things you had to do was to give up your wife to him for a certain amount of time in order for him to really, you know, hold his power on you. And the same thing, when he would travel around, he would go to villages, it was expected that people would offer him virgins so that he could, you know, he could show his power in that context. And if you read the ancient stories of, of these kind of ancient warlords in the tribal culture, that seemed to be the reality, which is that the, the tribal warlord had access to, to, to women more than every, anybody else. And there was this first night or other types of sexual taxes that had to be paid up towards the, towards the, the chief. You know, and you see it even in the Bible, you see this where, when Samuel, when Samuel is telling the people that they, the people who are asking for a king, he's telling the people, you know, you should be, you should be wary of having a king, because if you have a king, one of the things that's going to happen is that the king is going to take your sons and your daughters. He's going to take your sons to fight his wars, and, and he's gonna take your daughters and add them to his harem. You know, when we see that Solomon had thousands of women in his harem, we have to understand what that would do to a society that he, he, he also, he obviously got women from all over the place, but he probably got all the best women of his own group because he was the king. That's the first thing you need to understand. And so when you look at stories, for example, in terms of the Greek myths, you see what this means. You see that this is what is going on. You have a God, Zeus, for example, who goes around raping women. And what he's doing is, it is part of his manifesting his power upon the earth by taking human women, impregnating them and let's say creating this, this kind of, this kind of sexual hierarchy in the world. And so even in the storytelling we see this same problem where on the one hand you have the, you have the Greeks who try to unite under these gods and fight off the barbarians who want to take their wives, but then ultimately what ends up happening is they had to sacrifice some of their women up to the gods in order for them to, in order for them to create that power hierarchy. And so when the, when the kind of really hard wired people, and a lot of the neopagans as well, the, they tend to yearn for this ancient world, this ancient tribal world, this ancient kind of Nordic world. They, they, they have to understand that that is also part of the price to pay for having a kind of really hierarchical tribal thing which is that you, you, if you do it in order to not pay out, you will end up having to pay up. And that is not necessarily pleasant. And the reason why I think they, they don't seem to see it is because like most people, even, even monarchists have this problem. It's like you meet these absolute monarchists who, who, you realize that the reason why they're absolute monarchists is because they think that they're going to be the king. And the same with these kind of neopagans. They, they seem to like this world of power and, and like strength and all of this, but they don't understand that they will also be subject to that. And there's very little chance that, that you're the, you're going to be the big guy with the ax at the top of the hierarchy. You know, in reality there, there's only one of those up there and you tend to, you tend to end up being lower down there and have to pay up. So we have to, we, we, we really do have to, to, to see this. And one of the ways that you can see that this is really something that happened in the past Is that there are moments in history where it seems like all the genetics point to one person. You know, for example, I think it's like one third, I don't know, like a huge percent, maybe not 1/3. Like a huge percentage of."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":826.18,"end":826.5,"speaker":"Announcer","text":"Of."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":826.58,"end":1223.6,"speaker":"Jonathan Pageau","text":"Of people in Asia are descendants of Genghis Khan. And so you can understand that Genghis Khan, at some point, he was so powerful that him and his sons ended up having access to all the women. And then that created this kind of explosion in the genetic. In the genetic pool where everything kind of comes to him. And. And you see the same with other. There are still some northern chieftains that also. It seems to have this genetic. Which points to just one guy who was so powerful that he had access to. To all the women. And so it's really important to understand that as we look at the symbolism of the problem of. Of the cuckold, let's say, of the one who loses his. So you can understand it. So, like, you can see that the two ways that someone would become a cuckold is as a man is. It can be both. It can be either you're a cuckold to something which is above you because someone who's richer, someone who has more money, someone who has more prestige, someone who has more than you. And the other possibility is to also lose. Become a cuckold to the outside. It could be someone who has more body, someone who has more power, who's more attractive in terms of just that. That more, let's say, mysterious or seductive or whatever. So you can see that those two. Those two things are. Are. Are the reality of pretty much all the kind of, let's say, cuckolding stories that, that. That you can find in terms of storytelling. Let's say, of course, everybody who. People who experience that in their private lives, you know, sometimes it's. It's more mitigated. And there's. There are other personal aspects to take into account. Let's say in terms of storytelling. We can also. We can see that these are the two extremes that happen. And so the problem is, how do you deal with that? Right? Because this is just an aspect of reality. You cannot completely take sexuality out of the way that hierarchies lay themselves out. You just cannot. So you have to deal with it. And so what it seems is that the story of Christianity, it seems like it ends up being a way to solve the problem of this cuckold problem. And how does it do that? Well, so imagine that you have a king who's taking your women Or a God who's taking your women, who's actually having relationships with them. And it seems like what happens is Christianity is that we push that higher. It's like you lift up this notion of a God having a relationship with a person to the highest possible. And so we don't say that an angel had a relationship with a woman, like for example, one of the traditions in Genesis and that creates these monsters. We say that it is no, it is God himself. It is the highest, highest possible thing in the hierarchy. Now that is one of the aspects. So you push it way, way, way, way, way, way, way, way up. And then what you then do is you declare that the woman who is giving birth then didn't have sex with God. And this is really important to understand. This is really the tradition of the Christian Church. We say that the mother God is a perpetual virgin. Now Protestants have mitigated that in, in. I don't totally understand why that they, that they want to emphasize the fact that she wasn't. But the traditional view, the Catholic and the Orthodox view is that the mother of God is a perpetual virgin, that she remained a virgin before she was pregnant, while she was giving birth and after she was pregnant. Now you can say, I don't understand it in terms of biology. It doesn't matter. Try to understand it in terms of the story. So you push it up, you push up into the extreme and then you bring down to the extreme where this, this sacrifice ends up being one which, in which the, the woman remains a virgin and remains a perpetual virgin. And so this, to me, it ends up, seems to end up being the solution to the cuckolding problem. You create this extreme thing and it becomes the, let's say, the ultimate way in which reality is solved. The problem of the hierarchy gets solved and that gives, it gives Christ, but it also creates a world in which you were going to see as Christianity develops this notion that you need to pay a tax, a sexual tax up towards the aristocrat is going to slowly go away. We see that in the early Middle Ages already this idea of first night had become, it seems like it had become a tax that you would pay that you wouldn't actually, you know, the aristocrat wouldn't actually have a relationship with your wife. And it seems like that also completely went away at some point. It was not, none of that was expected even in terms of a kind of symbolic giving up towards your, towards your leader. What's fascinating about that is that then it seems like in Christianity what's going to Also happen is that in order to kind of create a, to continue to emphasize this issue, we're then going to have a culture of virginity in a certain cast of the culture. And so certain people will give themselves up to God in a sexual language and will remain virgins in order to, let's say, in order to enact this pattern. And within that the society will be fruitful. The society will be, will be fruitful and will also. And so a lot of people don't, you know, they, they, they struggle with the idea of, you know, how can you have monastics is somehow counterintuitive because you think that you have monasteries and you think how can if you encourage monasteries. And then it's, it's against the idea of perpetuating your, your lineage. Like it's somehow anti human to do that for, to have monasteries. But not if you understand it in this manner, not if you understand it in the manner of enacting a narrative which, which sets the barrier so that society in the middle can be fruitful and so that it doesn't have to be constantly paying up towards the, the emperor. But then you can also defend yourself towards losing your possibilities to the outside. So that seems to have been a, it seems to have been played out this way. And it also seems that this wasn't."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1223.6,"end":1230.36,"speaker":"Jonathan Pageau","text":"The first time that there was an attempt to solve this problem, to solve the problem of the relationship between the."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1230.36,"end":1235.72,"speaker":"Jonathan Pageau","text":"Inside and the outside. The capacity to create something which is."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1236.04,"end":1265.19,"speaker":"Jonathan Pageau","text":"Higher than the group or higher than the clan in order to cohere the clan in an even stronger way. So we see other stories where there is this strange relationship with a foreign agent or another agent, where cuckolding is actually part of the very origin of a people or the very origin of a great leader. For example, in the legend of Alexander we see an attempt to solve this problem."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1265.59,"end":1345.23,"speaker":"Announcer","text":"In the Alexander romance. Alexander is not the son of Philip of Macedon, but is rather the son of the Egyptian pharaoh Nectanebo. This Pharaoh comes to the court of Philip pretending to be an Egyptian magician or an Egyptian priest. And in that guise he then pretends to be the God Ammon. And as the God Ammon, he seduces Alexander's mother Olympia. And that is how Alexander is born. And so you can see there's a very complicated series of events happening here in this attempt to make Alexander the son of Nictanibo. We can see how all the things I've been telling you are in that version. On the one hand, Alexander is visibly the son of Philip of Macedon. But invisibly or in another manner, he's also the son of this foreign king. In the same way he is also in a strange way of bringing everything together. He also ends up being the son of this God Ammon, who is associated with Zeus himself. And so you see the bringing together of this foreign God Ammon with Zeus, with this foreign king and this also foreign priest as a kind of spiritual authority."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1345.23,"end":1346.35,"speaker":"Jonathan Pageau","text":"And so you can see in this."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1346.67,"end":1434.71,"speaker":"Announcer","text":"A whole strew of factors that are brought together in order to try to solve the problem of inside and outside in the attempt to make Alexander a greater figure, a figure that can unite more people under his identity and not just the little country of Macedon. If you look at all the elements in the story of King Arthur, for example, you will see that it is almost all the same. In the story of King Arthur, Uther Pendragon has himself disguised as Igraine's husband by the sorcerer Merlin. And in that guise that is how Arthur is born. And so you can see that there is this cuckolding right there at the origin of King Arthur who was going to be the one that was able to unite all of England together. A very strange detail in this story is that in the desire to join the inside and the outside some of the extreme symbolism will even be used. So in the story of Alexander the Great, for example, there are some versions where this Pharaoh, Nick Tannebo, who pretends to be a priest or a magician, is described as having dragon like qualities. And in the story of King Arthur we also see that although now it's not Uther who is a dragon, but rather Merlin who helps in this whole story is also the son of a dragon."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1434.79,"end":1437.51,"speaker":"Jonathan Pageau","text":"And so all of these are attempts."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1437.51,"end":1452.92,"speaker":"Announcer","text":"To join the extreme outside with the highest thing, to try to create a figure that has, you know, indefinite possibility and can unite further and further out into the world, different peoples."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1453.48,"end":1539.17,"speaker":"Jonathan Pageau","text":"We see also this in the Bible as well. In the story of Moses we see that Moses was an Israelite who was raised by the Egyptians. Here we kind of see it as the opposite where he was a foreign agent who was being raised by the Egyptian king himself. So we can see people trying to play with this problem in different ways. Even in the story of Abraham, who is the founder of the Jewish people, there is also an ambiguity which is set up because Abraham's wife was taken by the Pharaoh for a certain amount of time. And so it's actually left ambiguous who exactly is the father of Isaac. Although we traditionally tend to think that it's Abraham, the Bible and the story wants to cast a, a little bit of a doubt in the story of who is actually the father of Isaac, so that you ultimately can understand how it is also a trying to bring together these different elements into one. And even in the story of Christ, we can see how, strangely enough, in the Christian version of the story we see that Christ is the very son of the Creator, whereas in the Jewish version of the story, Christ is seen as the result of Mary being raped by a Roman soldier."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1539.81,"end":1541.89,"speaker":"Jonathan Pageau","text":"And so if you put those two."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1541.89,"end":1585.21,"speaker":"Jonathan Pageau","text":"Traditions together, you have this ultimate kind of contradiction, this ultimate moment where in all the, in his entourage, Christ would have been seen as the result of a rape of the Roman soldier. And you can understand that that is also how the Jews would understand the, in a way, the conversion of Rome to Christianity. While on the other hand, Christ is also seen as the very son of God and the son of a virgin. And so you can understand, you can see how there really is a desire to work out this problem. And it is not at all a simple question if we want to create a story which is, which can outlast the others."}
{"episode_id":"SW - #092 - 2020-02-28 - Is Christianity a Cuckold Religion -","start":1585.53,"end":2331.4,"speaker":"Jonathan Pageau","text":"The other interesting aspect is of course a lot of people will say that in the story, you see Joseph and Mary, Joseph is this cuckold of God, but that Christianity itself is a cuckold religion because it is a foreign religion that was taken up by the Roman Empire. And so it was a, you know, it's a Jewish religion that was taken by the Roman Empire. And by doing that, the Roman Empire weakened itself. And you have this strange idea that it was somehow the cause of the fall of the Roman Empire. You see that in kind of enlightenment thinking that the fact that Rome became Christian was the cause of its downfall. This is of course absolute nonsense because the more Christian part of the empire, which was not Rome, which was in fact Constantinople, continued on for a thousand years. It's not bad. A thousand years is not bad for something to continue on. And so the, the, the brightness of Constantinople seems to contradict the idea that Christianity is the cause of the fall of the Roman Empire because in fact, Rome was the more pagan of the two. And the senators in Rome continued to be pagan for a very long time. Even after the conversion of, of Christianity, there was a large tension in Rome between Christians and pagans because the elite in Rome continued to be pagan. So I don't want to digress too much, but what I want to address mostly is of why is it that the Roman Empire would do such a thing? And I Think that this is really similar to what I talked about in terms of Mary and Joseph. I think that what happened is a very similar thing. Now let me try to explain it to you. The problem is that if you just pretend like this pattern isn't real, like one of the patterns which is that that which is outside of you is bigger than you. And that's just the reality on the edges. Your edges can be stretched out really indefinitely. And one of the problems that happened in the Roman Empire is that they had reached so big that all of a sudden the place in which they had reached, you know, it's like if you build a road, if you build roads out in order to invade all these countries, those roads are there. Once you get a little weaker, those connections are all there for the people you invaded to come back and swamp you. You know, that's something that people don't tend to realize that it's a reality not just in Roman times, but it also, it is also a modern reality, which is that things, roads don't just go one way. You have to be careful when you extend yourself too far, you know, and so Rome was surrounded by these, these barbarian groups, the Germans, you know, all these, these kind of dramatic groups, but also the Scythians and, and you know, even on their eastern front with the Persians and all of these different empires and, and they were starting to, to break apart. In the third century crisis, we can see this problem. You know, it looks like the emperor is going to, going to break apart and you have all these barbarian generals that are vetting for power and are trying to take pieces of Rome for themselves. And so here it is, this massive, pro, massive problem. Now how do you deal with it? Because the idea of just asserting yourself and asserting your identity and coming back to your identity is, it solves the problem in the short term, but it isn't a total solution to the problem of the duality of inside and outside. It isn't a complete solution because that reality is just the way the world works. And we have to find a way to solve the problem in terms of narrative. And so it seems like in terms of understanding the narrative, Rome did what the Christian story is itself. I often tell you that the Christian story is a changing of death into glory, a changing of the crown of thorns into a crown of glory. All of this is the way that Christianity, the story of Christianity is happening. So we have to understand, to understand this properly, we also have to understand that for the first three centuries of the story of Christianity, Christianities were The scapegoats themselves, that Nero had identified them as those that wanted to destroy Rome. And so they were persecuted as this religious group. They were, you know, they were the. They were full of slaves and women. It wasn't the elite of the society. And they were scapegoats. And there were also this foreign religion which refused to integrate into the kind of syncretic deal that the Romans had been making in terms of their, in terms of their religious ideas. Until now, they had been accepting all the different gods and identifying them with their gods. And so you had these weird syncretic gods that the Romans started to engage with, where they were a mix of Egyptian and Roman gods, mix of Greek, Roman, pagan gods. You know, when they talk about the northern people, they, they try to identify their gods and say that they worship Mars, you know. And so they had this weird syncretic system. And there was this one group that refused to participate. There were two. There were the Jews and the Christians. But the Christians were particularly heinous because, you know, the Jews at least were completely separate. The Christians were Romans still kind of converting Romans. But also at the same time, they, they had been considered scapegoats by, by the Roman state from the very, very early stages, right? Even in the time of the apostles on, already the Christians were considered the scapegoats in the destruction of Rome, right? And so you see in the narrative where we're still saying that Christians are the reason for the destruction of Rome, but see, the narrative, the Christians were the scapegoat, Christ was the scapegoat. All of this is going on. And also the scapegoat as this foreign thing that is not part of your identity, all of this is kind of coming together. And so in their moment of crisis, as Rome was being surrounded by everything, it seems like what they did was take this thing, which was in a way, was the lowest thing in their society, and flip it up so that it would become a crown, so that it would be in a way above the Roman state. And the deal when you do that is that you solve the problem of the cuckold too, because you take the foreign thing and you don't. You put it above you, like completely above you, so high up that just like this idea of having God and Mary, God being so high and the mother of God remaining a virgin, you take this foreign, this whole foreign question of the scapegoat of, of the, of the, the foreign religion, all of this, and you, you flip it up so that it becomes the glory of Rome and So in that deal, what ends up happening is that Rome remains Rome. And this is something which is hilarious because everybody hates that now. Everybody hates the fact that Christianity is Roman. You know, Protestants hate it, the, the, even the neopagans hate that. All the modern people hate. Everybody hates Constantine and, you know, he's the enemy, number one, despite the fact that Constantine is one of the key figures in the very, this very flip of changing the scapegoat into a, into the highest thing. And so the deal ends up being that Rome can remain Rome, the Emperor can remain a Roman emperor, the forms of Rome can remain Roman, the architecture, the art, everything remains Roman. Christ himself ends up being dressed as a Roman senator and ends up being dressed as a, as a, as a Roman emperor because he, he is above it. As he filled as this thing which is completely above the system filters in. It actually doesn't destroy the system. It ends up being at the secret root or the secret cause of this whole thing. And so they've done, it's like as if they've done the whole. Solve the problem of the cuckold, solved also the problem of the foreigner once and for all because that problem doesn't go away. And it's interesting to see that it seems also then that Christianity seems to. Something similar seems to happen with Christianity in the different places where it manifests itself. And so if you look at the earliest, earliest forms of Christianity, you'll have Ethiopians who convert to Christianity and they have an Ethiopian Christianity, you have Armenians who convert to Christianity and they have an Armenian Christianity. And so we are able to then also be in communion without denying the particularity of the different peoples. And so you. One of the things that happens in Christianity is ideally this unity and multiplicity, that is the respect for the different identities, but also the capacity to be in communion nonetheless. And so it doesn't, it's not supposed to. And it, it has not until very recently in the modern world been just this kind of chaos of mixture and, and this, this idea that we have to destroy all identity. This is really a modern, a modern invention, but rather it was a kind of symphonic vision where you could be a, still be a Northman, you could still be Ethiopian, you could still be Armenian, you could still have your national identity and nonetheless be in communion with people from other groups because of this crown which was above and which permitted the multiplicity to exist within the unity. And so in the both sense, in, in the proper sense in terms of the notion of the, of the, the cuckold in terms of the problem of that which is above, taking from below which we see how Christianity solved it in the story of Mary and Joseph. And it also seems like Christianity solved the problem of the problem of the influence of the outside. How to deal with the fact that the outside is bigger than you, without you either just stifling yourself in this kind of without taking out the axe and just started chopping everybody's heads out that is outside of your identity, nor letting yourself be completely swallowed up by this flood that comes from the outside. So it feels like Christianity has found a balance between the extremes by creating this flip. And so this is something that I've just been exploring in terms of my thinking. I've been kind of provoked by it by seeing this question of cuckolding appear more and more on the Internet and in my comment section, and even people people writing me to ask me questions about that. So hopefully it will be the beginning of a discussion. I'm looking forward to seeing what some of you are going to say in the comment section. I get a feeling that part of the comment section is going to degenerate into absolute madness, but I'll try to pay attention to the quality comments and see if we can push this discussion further. And if some interesting things come out, I might make another video on the subject once again. So guys, thank you for for watching and I will see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
