{"episode_id":"SW - #168 - 2021-07-30 - The Mark of Cain","start":0.56,"end":2796.68,"speaker":"Jonathan Pageau","text":"The Mark of the Beast has been the place of much imagination, speculation and fear in the past decades. I remember as a child hearing that code bars on products might be an early shadow of this mark. Recently, with rumors of microchips being placed under the skin, of course, the most recent speculation has been that the new vaccine is the mark, or a step towards this mark. These intuitions, often arrived at through very immediate ways, can nonetheless divulge a mystery about what this mark is referring to. In general, though, this subject has been the arena of much panic in certain circles, while seeming like strange and arbitrary to others in the media. The reaction, of course, is to mock the concerns that people have, to attempt to debunk the claims, or else to simply wonder why it matters. Why, apart from some verse in Revelation, would it matter to be marked in this manner? Why would it bother people the way it does, except for their religious attachment to this very strange book full of dragons and trumpets and floating altars with lambs on them? What we will see is that although the relationship between a vaccine, surveillance, identification and a mark that would make you participate or expelled from a system might seem arbitrary at first, these intuitions do not appear out of nowhere, but are based on implications which are already there in the very notion of a mark itself. So what we're going to do is we're going to do a deep dive into the problem of the mark, and hopefully the concerns over this, the concerns over this, questions, whichever side you end up on, will at least make better sense to everybody once we're done going through this. But in writing this, I realized just how big the subject was. And so this subject will be separated in two videos. This video will deal with a mark and what its origin is in scripture, what that origin can teach us, and how it's related to accounting, to technology, to identification, and, yes, to medicine. And in the second video, we'll try to sparse out how all of this is connected to what is going on right now, what we're going through, and why both the projects and the fears and take the shape that they do. This is Jonathan Peugeot. Welcome to the symbolic world. And he, the Beast causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand or in their foreheads, and that no man might buy or sell, save he that had the mark or the name of the beast, or the number of his name. Here is wisdom. Let him that hath understanding count the number of the beast, for it is the number of a man, and this number is 6.466I've talked about the symbolism of the beast and of 666 in previous videos and how the system of 666 is about a desire for perfection, a desire to account for everything, even the exception and the effect that this thrust has. Now we will see how all of that is also present in the notion of a mark. So in order to understand the mark of the beast, we must first and foremost understand what a mark is. This question of the mark is actually extremely difficult. So everybody needs to strap themselves in. It's one of those subjects which is actually opaque and difficult, ironically, because it is very simple and it has far reaching implications. Elemental symbolism like this is often taken as a given. And so we have to make a particular style of effort. We have to enter in a type of innocence in order to perceive the reason and the function of a mark. In scripture, there is an early Genesis story related to the question of marks, and it's in a way a key to how the mark of the beast is presented. In the book of Revelation, the origin of the mark is found in the figure of Cain. After Cain killed his brother, God curses him, and humanity's first mark will play a role in that. Behold, thou hast driven me out this day from the face of the earth. This is Cain speaking. And from thy face shall I be hid, and I shall be a fugitive and a vagabond in the earth. And it shall come to pass that every one that findeth me shall slay me. And the Lord said to him, therefore, whosoever slayeth Cain, vengeance shall be taken on him sevenfold. And the Lord set a mark upon Cain, lest any finding him should kill him. And Cain went out from the presence of the Lord and dwelt in the land of Nod and on the east of Eden. And Cain knew his wife, and she conceived and bare Enoch. And he built a city, and he called the name of the city after the name of his son Enoch. So the elements in the text are as Cain does not accept that his brother Abel's sacrifice is pleasing to God, and so he kills him. God chases Cain away to be a wanderer. Cain complains that this will bring about his death, because whoever finds him will just kill him. And and so God declares that Cain will be avenged if killed and places a mark on him so that others would recognize him and not kill him. Cain is chased further away from the garden, knows his wife has a child, builds the first city, and then names the city for his child. The pattern of the Story of Cain follows nearly exactly the fall of Adam and Eve only just at what we could call a lower and more explicit level. Adam and Eve don't accept being forbidden the tree of knowledge, which would make them like God. And so they transgress by eating the fruit of knowledge, of good and evil, plunging them into duality. This seemingly immutable duality will become the motor for death and the fall. The first fruit of duality is to notice nakedness, that is, to see and to feel threatened by clear and irreducible separation between me and pretty much everything else. They see themselves as lacking, needed to be added to from the outside, while also paradoxically, experiencing inside and outside as incompatible, experiencing outside as a danger. So when we see the story of Cain in this light, we realize that killing your brother is an increase in the fruit of duality, that is, the capacity now to see the other human as so completely outside yourself as to be able to take his life. In the case of Adam and Eve, they're chased from the garden into the world of death for their transgression. But God gives them garments of skin, condescends and compensates their duality. Just like God will give Cain a mark, an aspect of death itself, which protects them from death. So Adam knows his wife, they have a son, Cain, who will, as we've just seen, replay the same drama in his own terms. We could say at a lower level through murder. Kane City will then also be another rehash of the pattern at an even lower level of reality. When we say lower, you have to imagine it lower, on the great mountain of being, on the mountain of paradise. As they are chased from paradise, they go down. They move from the unity of the top to the multiplicity at the bottom. And so this, this is bringing it closer to quantity by bringing the fruit of duality into a social sphere as the number of people are increasing on the earth. The strangeness of this can help grasp to what extent inside and outside are two sides of the same problem of duality. So the mark of Cain, just like the garments of skin, because they participate in duality itself, will strangely down the line, become the common origin of things which we usually understand as being opposite from each other, such as tribal inclusion or exclusion, or else something like identity and strangeness. The structure in the story of Cain shows us how death increases in the world. The mark received is a participation in the consequence of the curse, while also being a protection from the effects of the curse, while also even inviting a possible increase of. Of the effect of this curse. So you see that. So the mark sets up Cain as being excluded. We could say akin to dead in a way, thrown out further into the wilderness, further into the outer darkness. We could say, so that's the curse. That's the curse of Cain. So the mark also signifies how Cain is protected from death when he is recognized by the mark. Now, if he's killed, there will be an increase and a multiplication of death in the world because Cain will be avenged sevenfold, which is an increase of the curse. And we learn later that his descendant Lamech, who actually, according to tradition, is the one who accidentally killed Cain, says he will be avenged 77 times. So we can see how the curse, the promise and the vengeance of death is growing from 1 to 77, from 7 times to 77 times. All of this promise of death is actually far worse than if Cain just hadn't been marked in the first place. So this is the process of the supplement which I've discussed in many videos and which is the duality of any increase in power. It's easier to understand with the garments of skin or with technology rather than with a mark. But you'll see the mark will become clear in time as we go through the examples. So if we start with the garments, though, we imagine that you live in a kind of paradise where there is no danger. For some reason, I need to move away from that ideal into a threatening world. I go somewhere where it's cold, far away from this ideal place, let's say, both in space and in situation. So what I can do is I can supplement my body by adding layers and layers of clothing to keep myself warm. So in doing so, I'm both marking a type of strength, because this addition of layer, this supplement, will in fact help me face the increased danger, but it also marks a type of weakness. Remember when you were a kid and you didn't like wearing a helmet when you were riding your bike? Because of course, wearing clothing in the cold is a mark that you would be cold without them. It shows what would make you weak. So, like the mark of Cain, clothing or a wall is both a consequence of danger while being a protection from danger. And just like the mark, it is also an invitation to increase the effects of danger. So if near to my ideal world, my tropical paradise, a lack of clothes might have caused some mild discomfort for me. Now, when I come to the dead of winter in a place where it's very cold, to losing what by then would be layers and layers of warm clothing will bring about much greater consequences. So the process of supplement is difficult to limit to a specific point in time or space, because it's rather a process which embeds itself at all levels. We could recognize the elements and the patterns of this supplement, but the origins of the pattern go back. They go back ontologically and historically into something like a hidden origin. So we can't point to a place or time in our world of death where there is no supplement, because our very birth and biological existence are part of this ever receding memory. Rather, we can only point to something like a nostalgia of innocence and purity, what we would call a nostalgia for paradise. We can also recognize this process as fractal. So something which is actually relatively less engaged in this process of supplements. For example, imagine how the human singing voice, even though it's already bound in exteriority and death, appears nonetheless as an image of the ineffable paradise compared to those other things you can imagine that are bound up by layers and layers of addition. So let's say an electronic keyboard, for example. So in this case a human voice will appear more directly and not as encumbered as the complex electricity powered keyboard, which requires many layers of languages and buffers in order for it to even work. So it's always about fractal levels. But the supplement, the garments of skin, are inevitable in the fallen world. So what clothing does for your body, what the city does for the social element, the mark does for identification and knowledge. So if you were searching for the origin of writing in scripture, the mark of Cain would be your best bet. This might seem like a surprise to many, but it's completely coherent with every use of writing that has existed since the invention of writing. Just like the development of technology is a working out of the fall and death, a working out of the problem of duality. To put a mark on something is to make it stand out from other things, to separate it from other things. It's akin to a pointing or calling out, that one, you know, that's what a mark inscribes. But now it inscribes it on the exterior. Exteriorly, it's actually different from pointing or naming, which is immediate and done with presence. And we find as the way in which God even creates the world. Marking is something like the memory of pointing or calling, though it's not a living memory, it's an exterior memory. You could say the mark acts as a token to the invisible difference in quality which came about by the act of selecting itself. Let me give you an example. So let's say I go to a theater, and I want to keep my place. While I'm getting popcorn, I'm going to leave my place. And when I look at it, all the places are the same. So what I need to do is I need to mark it somehow. So I'm going to leave my shirt on it or my book so that I can remember when I come back. And others can also know that even though I'm not there, this chair, among all the other chairs which look alike, is my chair. It has an invisible quality, the quality of being mine at the moment, a quality that the other chairs do not have. So I mark it so it can be understood in my absence. But what makes it difficult to keep this very simple notion in our mind is that this calling out, this separating from other things can be good or bad. It can be done for the inside or for the outside. So a simple mark can mean something like this or mine, or it can mean good or else for this use dedicated, but it can also mean not this or rejected or defective. So let's say. Let's say something like a urinal is broken in the bathroom in a public bathroom, you know, the people that are responsible have to mark it somehow to avoid someone using it, will have to separate it from the others in a way that you'll know that it's different from the others. So if you want to think of a place where the duality of this process appears simultaneously, think, for example, of when you were going to school and a teacher would grade your paper and would put green and red marks, each meaning the opposite of the other, despite just being check marks on a piece of paper. So this inside, outside duality, this is the very shape of the fall. And it can be found in several aspects of the story of Cain. Cain is cast out and set to wander in the land of Nod, a land of hostility. And in reaction to that, he develops a city. Then techne, technology, the arts. And so his seed, the seed of Cain, contains both opposites of wild and civilized. Something that is contained, fixed, identified, and something that is unmoored, wandering and exiled. So both of these extremes are in the mark itself. Marking is always a making of both inside and outside. The mark is very close to the idea of a wall or a limit, which can be used to set aside some space for good or ill, in multiple ways to make sacred. For example, like a temple, we will bind it in a space or to keep excluded, like a prison, which we will also bind in a space. Keeping in or keeping out can also each be for good or for ill, each keeping in, because each keeping in is always simultaneously a keeping out. That's why there is a relationship between a mark and something like a seal placed on a container to bind several things together, therefore creating an identity of purpose. This reminds us, it brings us to this notion that the earliest writing we have, these really early cuneiform tablets, were most often a form of accounting. And this might seem surprising to those of us who believe in the sacred origin of Scripture, but this accounting is in many ways already what is happening in the story of Cain. If you watch my video on the symbolism of 666, you will remember the relationship between the system of the beast and accounting for everything. We can see that accounting is the most primordial form of writing and mark making because it is first about including and excluding, then about quantifying sets of things bound by an identity, whether by category or by owner. So we take a bunch of things and we account for them. We place them in a container with the name on it, or we put them on a list with the mark next to it so we can understand that they're related to each other. It's the place where purpose, quality and quantity or are bound by an authoritative system. We need to understand the mark of Cain as both the origin of writing and the origin of mathematical notation at the same time. This little insight about how marks serve to account for something can already show in all there is to understand about the mark of the beast in Revelation, which, as you remember, can be a number or. Or can be a name, the name of the beast. In order to more properly understand the relationship between the mark writing and the garments of skin, we actually need to take a little detour into Plato. Actually, we need to take a detour into Plato and into the philosopher Jacques Derrida. In his very famous work called Plato's Pharmacy, Jacques Derrida stumbles into the question of the supplement. And although I think he makes some serious errors in his conclusion, he appropriately draws attention to his importance. In his reading of Plato's dialogue Phaedrus, he analyzes the multiple meanings of the word pharmakon. Pharmakon is a Greek term which is equivalent to the English word, or similar to the English word drug, meaning both a poison and. And a cure at the same time, with the general notion that a drug is a supplement. It's an addition of some exterior thing to yourself. One of the derivatives of the word pharmakon is pharmakos, which refers to human sacrifice, the ritual scapegoat. Sacrifice. A deficient person was either expelled from the city or else expelled and killed. And so the. There is a relationship here to this Girardian notion of identity forming through scapegoating, which already happened in Cain killing Abel, but then is also happening for the line of Adam and Seth in the expulsion of Cain from their midst. We can see that scapegoating is already part of identity making right at the beginning of Genesis. Another related word for pharmachaeus, which Derrida also brings into the discussion, will mean a poisoner, but ultimately something like a magician or sorcerer. Of course, in the very ancient world, there is very little difference between a tecton, an artisan, someone who creates things, and a magician, in the sense that both of them are directing knowledge towards increasing power over the world, rather than using knowledge in order to acquire more wisdom. This is why the fallen angels in the Book of Enoch teach both teach all at the same time, metallurgy, necromancy, and even the power of seduction. So, going back to Plato's Phaedrus, in this dialogue, we find Socrates and Phaedra, his friend, encountering each other outside the city. And then they cross a river to discuss desire, to discuss sex, love as madness. And anyone who is aware of any story, from Hercules and the centaur to Elijah and the chariot or to St. Mary of Egypt, will understand the relationship between crossing the river and entering the wilderness. And the entire dialogue of Phaedrus is about the problem of exteriority and ultimately the question of supplement. In the second part of the dialogue, Socrates says that writing is a dangerous pharmakon, as we mentioned, a supplement to speech which must be rejected or at least seen as suspect. In making his point, Socrates retells the story of an Egyptian God, a foreign story, we could say, in its own right. He tells the story of Thoth, or Tooth, one of the Egyptian gods of the underworld, known for being the origin of all the arts and technology. And we see his presenting of writing to the God king Thamis. So in this story, Tooth presents writing as a supplement, a pharmakon to wisdom and memory, a way of increasing them by recording them. So Thamis, on the other hand, sees writing as the opposite of this and sees it rather as a weakening of memory and a decrease in wisdom, because now people will rely on something external from memory and therefore will forget things more than before. So, of course, this is the process of the garments of skin, which I've been describing from the beginning, and it's easy to understand, not only in terms of writing but as the basic problem and issue of technology, the fact that I have my parents phone number written in my phone means that I don't have to remember it in my mind. And having a multitude of phone numbers in my phone means that I can also access all the more people with ease, making me far more powerful than if I didn't have my phone. But it also means that I'm dependent on my phone now, and if I lose it, I'm in a much worse position than I was before I had a phone when I just remembered my parents phone number. Through Socrates Egyptian stories we can understand how the notion of pharmakon can be translated as medicine or elixir, which is why we still have the term pharmaceutical today, which is derived from the same word. So what tooth is presenting to Thamus is a medicine for memory and like for writing. We understand the duality of medicine, especially in the common word drug. You know, I can take a painkiller to reduce suffering, or I can take coffee to stay awake, but in doing so it means that my resistance to pain will decrease in relation to the painkillers and I might become dependent on coffee to stay awake. So if one looks carefully, one will find that in the very fact that the story of tooth is a foreign story, a story from Egypt actually structurally participates in the notion of the supplement as the this dead garment, this added garment, this outer and excluded aspect. And interestingly enough, we will find this paralleled in such people as St. Gregory of Nyssa, who uses the image of the Egyptian as the garment of skin itself. In his Life of Moses, St. Gregory relates the Egyptians to the foreskin which must be removed in circumcision, returning us to this hidden center. But we can also understand the Egyptians as the warriors with chariots, as we hear in the song of the warriors with chariots that are covered in the waters. And this is representative of civilization and technology that gets lost in the crossing of the waters. It's a little image of the flood and how the descendants of Cain, with all their civilization, all their weapons, all their metal making, metallurgy and and cities. Cain, who also became the first stranger, perished in the waters of the flood. Circumcision, the removal of this peripheral skin, just like the drowning of the Egyptians, functions like a basic scapegoat ritual. The notion of pharmakon is bound up in the story of Cain with all its element. In fact, we find in the story of Cain a version which is purer and clearer than the tooth story told by Socrates, as it simultaneously contains the opposite directions of this supplement that I'm telling you about, this plays itself out in the story, especially if we understand the story of Cain in the wider tradition, of course, of the Watchers and the Nephilim in the Book of Enoch. There the negative element of this increase in power is attributed to fallen angels who give this information to humans. This is actually not unlike the vision of a God of the underworld, like Thoth in Socrates, myth of the origin of writing, or for that matter, a titan like Prometheus in the Greek version, which brings techne and fire to the humans. The elements of the supplement are contained in Cain almost as an aporio, as this kind of mystical contradiction, we could say, which actually makes it difficult to. To see them. The extreme duality of inside and outside is brought together in one character. Cain is both a scapegoat, marked as excluded, and the founder of a city one has as a consequence of the other. He's both a wanderer and the father of all the arts and technology, the origin of both agriculturalists and nomads. In the mark of Cain, we also see another aspect of what is presented to by Plato in the Phaedrus dialogue, that is an origin of writing, which is also both a medicine and a poison all at once. So before we go any further, I think it's important to understand that this process, this process of the garments of skin, this expansion of death, can be transformed, can be transmuted, and even sometimes reversed. And this is what God will do in the consequence of the fall. Constantly, this is constantly what God is doing. And this is necessary to consider when one understands that God is not outside, you know, is not outside some arbitrary creation which is just going along its way, while he gets involved like this once in a while. Rather, God, as Saint Maximus tells us and the whole Christian tradition tells us, is the secret origin and telos of all things. His energies are actively underlying the entire cosmos and the. And so he's constantly calling fallen things to himself, making it possible once again for them to become aspects of his glory by transforming them. So we can see this transformation of the dead supplement into participation by looking at a few parallel stories in the Bible, for example, when God serves Israel from Egypt and leads them to the holy mountain after crossing the waters, what we're seeing is a new beginning. It's a new world that's beginning. And Moses who goes up the mountain, is actually an image of a return to paradise, a return to Eden, which was itself pulled out of the primordial waters, just like this new Israel, receiving the law of God, is pulled out of the crossing of the sea. So the crossing of the sea and the ascent of the mountain is also akin to Noah's flood, which ended, if you remember, on a mountain. And on this mountain, Noah will receive also a law. We often forget that Noah receives a simpler version, a very basic version of the law that Moses will receive later, with, let's say, in much more detail. And all of these stories are connected by the same pattern. So in Moses revelation on the mountain, he receives the the law which will be written on stone tablets. He also received the pattern of the tabernacle. So when Moses comes down from the mountain, now from this new beginning, this new origin, he must wear a veil to cover his face because of its glory for having countered God. Now remember that Adam and Eve, when they came down the mountain of paradise, also had to wear a veil, had to wear garments of skin to protect themselves. Now, in the case of Moses, this veil is also the supplement, it's a more subtle version of the garments of skin which were given to Adam and Eve when they were chased down the mountain of paradise, as I just said. But this supplement is not only in the veil. In fact, the veil is in many ways the written law itself. And not only the law, but the earthly tabernacle built by Bezalel in Oholiab, which has its own hierarchy of veils which are leading into the inner holy place. So this process of supplementarity of these adding of veils, of these coming down with a written text, a series of veils which lead to the holy of holies. If it's not taken as a good in itself, let's say as a means to increase one's power and pride, like Cain did, it can actually become the very procession of layers from the divine to man. It's a reframing of the supplement towards participation. It's actually showing the secret of what it can be in God. So the veils, in this case, the writing of the law, always both conceals and reveals, it covers and shows. And so the law, being a good, is nonetheless an answer to the fall, like writing and city building. So this exterior is insufficient in itself, right? It's good if it's connected to God, but it's insufficient in itself. And in some ways it can be dangerous. It's dangerous if it's not taken as a veil which covers something behind it, which connects it to something behind it, something inside something. This ontological hierarchy that recedes into the heart or recedes into the holy of Holies, or recedes up into the mountain where we encounter God, recedes ultimately, we could say, to the divine spark behind reality, which is God himself. And so as a form of manifestation of God, then it becomes a good. This can help us understand, for example, the way that St. Paul talks about the law in the Book of Romans, how the law shows us the reality of the fall by making us transgress particular rules, like a series of veils, reminding you that you are not in the holy of holies. It can also help us understand how sacrifice and city building is how it's presented in Scripture. So people today, modern people, love to quote Psalm 51, in which it is said about God, you do not delight in sacrifice, or I would bring it. You do not take pleasure in burnt offerings. My sacrifice, O God, is a broken spirit, a broken and contrite heart, you, God will not despise. This, of course, is the notion that exterior action is not what God wants. What God wants is a broken spirit, a contrite heart. So all must begin in what is invisible and above, which is what spirit is. Spirit comes from heaven, comes from above, it is invisible. And then the center, the heart, or the place where exteriority disappears in the holy of holies and in this hidden place. Our basic kind of New Age Gnosticism likes the idea that, you know, all these outer forms don't matter. It sounds spiritual, but not religious. You know, we talk about being saved by faith, but not works, that kind of thing. But people often forget that there is a next part in the psalm. So just after this, it says to God again, may it please you to prosper Zion to build up the walls of Jerusalem. Then you will delight in the sacrifices of righteousness, in burnt offerings offered whole. Then bulls will be offered on your altar. So recovering the Spirit, that which is invisible and the center, that which is the source and the origin of multiplicity, is lead then to multiplicity, to their exteriorization. The second part of the psalm is structured the same way as the first one that we, that we quoted, but now only in the world of manifestation, the mount Zion is the hierarchy of heaven, embodied on earth, which prospers, which always remembers that the mount. And always remember that the mountain is always paradise, it's always Eden. And the center gives place to the margin, the walls of the city that are built up. And always remember that the city is the fruit of Cain, but here it's seen as built by God himself, and so participating in his will. Remember, when we get further down into revelation, that the new Jerusalem, the Heavenly Jerusalem descends from heaven. It is built by God himself, we could say. And once all of this is done, once the heart is entered the mountain, the hierarchy prospers, the walls get built, then the righteous will offer sacrifice, because the outward gesture will be completely connected to the inner movement. So let's be clear, the outer gestures are the same. The garments of skin on the tabernacle are of the same nature as the garments of skin on Adam and Eve. Yet they are transmuted into a participation in in glory by their connection to the invisible center and reason for things. The writing on the tablets of the law are a continuation of the mark of Cain. Yet now they carry the will of God into the particular through multiple prescriptions. And understanding this seriously can help us understand so much of what seems ambiguous in biblical symbolism. For example, alluding again to the mark of the beast, it is said that the mark will either be on the hand or the forehead. Now, this statement about the mark of the beast actually refers to a commandment in the Old Testament which that we should wear, that we should bind, or we should be marked by the prescriptions of the divine law on our foreheads or on our hands, exactly where the mark of the beast is said to go. So the profound duality of these layers and supplements makes this symbolism difficult to hold in our mind. I'm sure you're struggling even to get through this video. One of the best examples which will show the duality and its difficulty is that even the removing of a veil, removing of this exteriority in a certain way can also be a veiling. That is, it can also be an exterior sign or mark of something which is happening at a more primordial level. And so circumcision is precisely the removing of the garments of skin. Remember, removing a layer of skin to expose that which is hidden underneath. In Scripture, this gesture is called a mark. Actually, it's a mark or a sign, but it's the same word which is used to describe the mark of Cain. But now this mark is one which makes one enter into a covenant with God, marks one as part of the chosen people by removing the the outer skin. But this gesture, which is actually a removing of the outside, will later be revealed, interpreted by St. Paul as to be a kind of exterior action, a kind of pharmakon, an outer gesture meant to reflect an even more inner reality. Which is what? Which is the circumcision of the heart, right, the center that was talked about in the Psalms. All of this is a similar move, as we just saw right now, like I said in Psalm 51, of course, this might seem to some like a contradiction, but this is the nature of the duality of inside and outside. And all of this is already there in the story of Cain, because the removing of Cain from the point of view of Cain is an adding of layers as he gets a mark. As he increases the garments of skin into city building, so he is adding layers onto himself. But from the point of view of God, or from the point of view of Adam, the casting away of Cain is something like a circumcision. Cain has been cut off. He has become the scapegoat. He's become something akin to the foreskin which is removed to keep the line of Seth, the line of Adam, pure and holy. So obviously there would be a lot more to say on this, but we need to remind ourselves that we are moving towards an understanding of the mark of the beast and how it relates to what is happening around us. Those of you who have been attentive, if you been able to pay attention through this difficult video, I will admit, will already notice an interesting pattern. If one looks at the mark of Cain as an aspect of these garments of skin, as this supplement, and with a little help from Plato's use of the term pharmakon, we see the mark as instigating several things. We see the mark as instigating a form of official identification, a way to identify Cain, a form of scapegoating, writing, civilization. But there's also a medical, magical aspect to the mark in the most general sense of a seal or a talisman, or also as a remedy, which is at the same time a poison. So looking at this, this story of Cain as the beginning of a pattern, we can then understand through the fractal nature of reality, that this moment of the mark of Cain can be expanded to different levels of being. And ultimately it can be expanded into its cosmic finality, we could say, or final historical version. And that's exactly how we need to approach the allusions in Revelation to, first of all, to the beast as the final tyrannical vision of civilization, to the number of the beast as the final accounting of this system, and the mark of the beast as the ultimate mark of. Of inclusion and exclusion. It is the final human mark of inclusion and exclusion in many ways. That is, without the mark, one will be excluded from even the basic participation in civilization, from buying, selling, just being part of human civilization. But the mark will at the same time be a form of apostasy and will cut one from the face of God, as is mentioned in Genesis, for Cain. But in the image of the mark and the consequences of Cain's fall, there are in fact two possibilities of the supplement which appear and which is seen in Revelation. One that remembers and one that forgets, one that is connected and one that is disconnected. Cain's story will feed the origin of the two final images in Scripture. Surprisingly enough, the image of the whore and the beast in Revelation, who come out from below, who come out from the sea, as we mentioned already, but also the image of the new Jerusalem which comes down from heaven. We could call it the final city, with all that implies sharing an origin with the city of Cain, though covering and fulfilling the consequences of Cain's transgression to its glorious resolution and by God himself. There's a hint, interestingly enough, of how this problem of the supplement can be resolved, also found in Plato's Phaedrus dialogue. At the very end of the dialogue, after they have talked about the problem of writing the problem of the supplement, when it's time for Socrates and Phaedrus to return home, Socrates offers a prayer. He offers the prayer to Pan and to the unknown gods which haunt the this outside place. But this prayer, you'll see, could easily be a prayer for any of us today. And he says, give me beauty in the inward soul, and may the outward and inward man be at one. It is in fact the unity of the inner and outer, which is not only the root of symbolism, but also the solution to the problem of layers. We can see that this prayer is akin to what we say in our own prayers. We say as heaven on earth as it is in heaven. We ask God to make it on earth as it is in heaven. This is exactly what Socrates is expressing, but now from the heart, the center to the periphery, rather than from above and below. But we saw in the images in the Psalms that these two are very much akin to each other. So after that, Socrates asked for temperance and temperance in being and temperance in having. But the last part is very interesting because Phaedrus answers with another version of the solution to the supplement. We could say a mirror of the first. He says to Socrates, ask the same for me, for friends should have all things in common. It is in fact, through communion of the particulars that the whole becomes something true. It is by coming together both within ourselves, but also with those around us, that all our intentions and our exterior forms line up to become a crown of glory. So I wanted to give you a little bit of hope in my video. So in finishing I want to help people remember that things don't happen arbitrarily. They follow patterns. And this is true as much in the most factual working out of what is going on. But also we see patterns in the stories people tell and even in the rumors which swarm and swirl around events. Both large scale rumors, but you know, that bubble around events, but also the official propaganda which emanates from authorities, all of, if we pay attention, all of these, because they have to engage in storytelling, can help us understand what is the narrative frame which is being brought and sometimes imposed on a very complex situation. So all the discussions of vaccines, of identification, of exclusion, with its relationship to economics and accounting, hopefully already for you they won't appear as simply arbitrary. They are deep narrative reasons why these things are happening the way they are. There are also deep reasons why very reasonable people are noticing how the recent events are circling around and are aiming closer to what in Revelations is called the mark of the beast. So hopefully after this video you will understand a little more why that matters. So in my next video, which I promise you will be less difficult, we will look more closely at what is happening today. Look at the rumors, the propaganda, the narratives. But we'll also be looking at the prophecies of a saint, St. Paisios, and how many of these threads, these narrative threads have been floating in the story world for quite a while now. And this Covid situation is actually not that new in terms of narrative. So in the meantime, I pray that you all have proper discernment in these difficult times. So thank you for your attention and I'll talk to all of you very soon. Soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop up in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
