{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":0.4,"end":39.42,"speaker":"Jonathan Pageau","text":"One of the most powerful moments in the movie, the Dark Knight, is the opening sequence. In this scene, we find the Joker orchestrating a clockwork precision bank heist. As the robbery plays out, though, we discover there's something else altogether going on. And this bank heist also becomes a statement of what the Joker stands for. For chaos. Or rather more specifically, an upside down clown hierarchy. This scene is one of the most succinct portrayals ever made of a revolution. It can help us understand contemporary phenomena like cancel culture and other upside down structures, which, like the serpent of chaos, always end up devouring themselves."}
{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":53.42,"end":57.02,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":67.54,"end":407.57,"speaker":"Jonathan Pageau","text":"The scene follows a group of robbers in clown masks. The spoils are supposed to be separated equitably to the group, but each of the participants think that they're in on a little secret. When the first robber finishes his job with the alarm, the one responsible for opening the vault kills him. Shot in the back. Then, as the volt guy is doing what he's there for, he tells the next robber whose job it is to fill up the money bags that the boss told me when the guy was done. Take him out. One less share, right? Of course, the moneybag guy has been told a similar story. So when the vault is open, he takes out his collaborator as well. At this point, the moneybag guy thinks he's figured it out. So in order to stop the dominoes from falling, decides to take things into his own hand. Hands Joker quote. If he kills the next guy before the next guy kills him, he'll be okay, right? But of course, once the gears of revolution have started turning, it is difficult to stop them. The bus driver runs him over. And to finish everything off, the Joker, who'd been hiding behind a mask this whole time, kills the bus driver and remains alone on the pyramid of bodies. The purpose of the whole process is not so that the Joker can keep all the money to himself. The Joker doesn't care about that. He tells us why he did it. When the bank manager asks him, what do you believe in? The Joker wants to reaffirm that whatever doesn't kill you makes you stranger. It is to crystallize his position as the king of the margarine, the emperor of what is strange. We've just witnessed an upside down hierarchy playing itself out. In a normal hierarchy, there's an exchange between the top and the bottom. The higher aspects of hierarchies give organization, identity, a sense of unity and cohesion to what is below. They provide a plan. The lower rungs of A hierarchy provide potential, a body to the identity, specificity to general rules that make it possible for a plan to be executed. Each level of a hierarchy both receives unity in what is above in exchange of body and multiplicity, but it also provides unity for what is below. This is of course true of human systems like governments. So a nation provides unity to provinces and states, states provide unity to cities, cities provide unity to neighborhoods, down to streets, to houses, to rooms. And we could continue down all the way to the quantum level. All of these levels provide potential to embody their identity from below. A country or any other level of the hierarchy cannot exist in in a world without all the lower levels of reality constituting them. This is the fractal structure of reality. In the Joker scene, we're seeing how chaos appears as an upside down hierarchy. It's not normal business transaction where purposeful objects and services are exchanged for the potential that is money. Rather, this is a robbery where social rules and exchange break down. To emphasize the chaos as a turning wheel, it is important that all of this is happening through a bunch of clowns. The pattern of the clown is in full force because the entire robbery is set up as a deadly practical joke. As one clown finishes playing a trick on the other, he quickly realizes that the joke is on him. And as the wheel turns and turns, only the king of the upside down is left standing, made more powerful for having orchestrated this gauntlet. The phrase, like Saturn, the revolution eats itself was coined by a French royalist named Jacques Mallet Dupin during the French Revolution. And it's remained a key phrase in understanding the side effects of revolutionary action. As the pattern goes, Saturn had castrated his father, Ouranos, which is heaven itself. It was the first act of revolution and was done to free himself and his siblings from the tyrannical order of the father. In doing this, Saturn acquired power to himself. But because the legitimacy of his own power was in his heavenly lineage, by castrating heaven, he also destroyed his own legitimacy and opened himself up to being questioned by his own progeny. And the only way to stop it from perpetuating itself was to make a purge. He had to stop his own lineage from existence. In the Joker story, we see how the first clown is takes out the one that preceded him and is then taken out by the next. By the third step. The clown with the moneybags understands that the only way to stop this cascade of destruction is to turn around and take out the next in line before it happens to him. He doesn't succeed. But if he had succeeded of Course, we understand that he would have had to take out the bus driver. There was no other solution once the revolutionary wheel starts turning. There are many examples of this in history, which is why revolutions always end up with purges. The first to be purged are of course, the top elite classes. So as the noble use the bourgeoisie to take out the king, the bourgeoisie then use the workers to take out the nobles, and so forth, and so forth, until the system is burned to the ground. The person who's able to stop it is the one who's capable of both destroying those from whom he takes power, and then also he is able to stop those next in line. So Stalin destroyed all his contenders while also crushing those beneath him once he had gained power. The most recent example of this shows itself in the cancel culture of social justice and intersectionality. Those who want to destroy the patriarchy are immediately suspect of being tools of the patriarchy who must, in their turn be destroyed. In order to prevent that, there has."}
{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":407.57,"end":409.37,"speaker":"Jonathan Pageau","text":"To be a purge of others, one."}
{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":409.37,"end":479.92,"speaker":"Jonathan Pageau","text":"Way or another, or else one risks being next in the line of the social guillotine. And so we see two strategies being laid out. The two strategies that we see in the Joker scene, one strategy is to continue the revolution itself. And so more and more marginal or strange identities must compete to emancipate themselves. Western feminists will accuse Western men. Minority feminists will accuse Western feminists. LGBT activists will accuse feminists. Trans activists will accuse others in the LGBT coalition. Minority trans activists, well, you know, you see the picture. So the other solution is the one taken by the money bag clown in the movie, trying to stop the bleeding by purging the other way. And so then you'll find feminists calling out trans activists for destroying everything that they've built. And then you'll see some trans activists resisting other nameless strangers. Marginal identities. Of course, just like the Joker, the entire process is related to a belief in how reality works. A competition to win the marginal kingship, to live out reality of the revolutionary cycle, which is that whatever doesn't kill you makes you stranger."}
{"episode_id":"SW - #100 - 2020-05-20 - The Joker and Cancel Culture","start":480.96,"end":545.94,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
