{"episode_id":"SW - #240 - 2022-06-30 - June 2022 Q&A","start":12.08,"end":4652.3,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. Hope everybody is doing well. And so before we start the Q and A, a few announcements. There will be a conference, by the way, with myself, John Vervaeke, Paul Vanderklae, and I forget the name of the other person, Dr. Richard Mondrol, which will be on from September 15 to September 18. And it actually starts a few days earlier. For those who want to arrive early, we're going to, it's going to be called Consciousness and Conscience, and it's in Thunder Bay, Ontario. You can look that up on eventzilla.net and you'll find the details for that. It's going to be a lot of fun. There's even going to be an Airsoft game with barbecue. And it's going to be, a lot of it is going to be about spending time together and seeing each other in the flesh and discussing ideas, you know, and getting to know each other. So I'm definitely looking forward to that. I haven't met Paul Vanderklee in person yet, and so that'll be really, really wonderful. Looking forward to that. So check that out for those who could come, that would be great to meet you there. And so here we go with the question for those who know these question. People who support me on Patreon or on my website for $10 or more get to ask questions in advance and then I will answer. They get sorted and sifted, you know, down, especially if the questions that I've already asked or that people have already asked are unclear, are removed, and then around 50 questions remain. I answer those. And then people who, anybody who supports me in any way or is on the Facebook group is, will get the link. So they are in the chat if they want to. And so I'll also interact with the chat. And so that's how this works. And then we publish them publicly. So if you want to show up, there are ways to access it to the Facebook group. And so, yeah, all right, so here we go. So I'm going to start with the website. All right. And so Walshi asks, you previously spoke about the symbolism of naming after something and gave the examples of cities and children. How does naming something like an album or a comic God's dog, for example, differ from naming a child or city, particularly when aspects of humor come into play? And so I, I mean, there isn't a difference, just a difference of level. You know, you name a book or you name something in relationship to something. It's just referring to that, to, to that Saint or to, to the, the person you are naming it after. And so in a way, it, it refers to them, it uses them as an anchor. And so there. I don't think there's necessarily a difference when humor comes into play. You know, of course, if you're going to use humor, you have to be careful the way that you use it because, you know, you don't want to, you don't want to make humorous. You don't want to be humorous about something that's not funny. I mean, that's the only thing I can say about that. So, yeah. Enzo, Eric asks. Hi, Jonathan. In Acts 16, 16:30, we see Paul, after losing his patience, invoke the name of Christ to drive a spirit out of a slave girl. This actually leads to him and Silas being stripped and beaten with rods and put into the deepest part of the prison. At night they pray and sing hymns to the Lord. An earthquake shakes the prison. The doors open, the chains loosen. It seems this might to me the mirroring of Christ going down into Hades. Also that Paul gets punished for losing his patience. Thoughts on this? Christ has risen. And so, I mean, it is, I think, I think it's definitely supposed to manifest some kind of small version of the resurrection in general. You know, when they, when someone goes down into prison and then comes out of prison, it's usually an image of resurrection. You see that in the story of, of Joseph. And so, yeah, that's, that's definitely what it is. I mean, it is a really interesting story. Like, it's a super interesting story the way that it's presented, you know, the idea that, that Paul, that St. Paul loses, is annoyed with this, with this lady. And so because of that, he chases out the demon. It's just kind of funny. It is a kind of a funny story when you think about it, you know, because why didn't he, like, it feels in the story that he's not doing it for her, he's doing it because it's a nuisance. So. But I haven't really thought about it so much. So interesting. But I think there is a deeper. There is definitely in terms of he does free her because she's also used kind of like as a slave by the people that are. That are using her to finance this operation like that, using her to get money from this operation that they, that they have, using her as a soothsayer. And so I think that they are definitely freeing her from slavery. So. All right, so in the chat, Ivan Engel asks, is paradise meant to be built on Earth, or is it an ever distant ideal? How could it manifest if not through power used by authority and humility and subjected to Christ? And so I don't think that paradise is meant to be built on earth. I think that there can be glimmers of it, there can be reflections of it, but you always, always have to be careful that the way you act isn't trying to create another Tower of Babel. And so I think there have been. So if you think of the man in which Constantinople, when it became, I think that there was a sense in which they wanted to create a holy city to the extent that that's possible. But that city would also have a kind of hierarchy in it and would also leave room for some chaos. So, for example, in Constantinople they banned the gladiator fighting, but they still had chariot racing. So they still had sports and stuff like that in the form of chariot racing. So it was kind of like a less extreme version of some of the negative aspects. Like, I'm sure there was gambling and there was all that stuff based on the sporting events. And there are moments like the Nika revolt, when that space, like that space of sport and of entertainment became, let's say, the bubbling of social revolution. But in a certain manner, it's hard to. You don't want to just create another Tower of Babel. So. So I think you have to be careful with the building of heaven on Earth. So the way you would build, like you could say something like the way you built heaven on Earth really is becoming a saint. And. And then around you there'll be a. There's a chance in which around you some type of heaven will. Some type of, you know, paradise will manifest itself around you. You know, something like that. All right. And so David Flores asks, with all the current discussion on higher level beings, egregores, angels and principalities, I was wondering if the parable of the Sower connects to these ideas. The bird eats the seeds on the wayside, seeds are stolen by birds. Assuming birds are analogous to higher level beings, how does this play out in reality? Or is this connection and misunderstanding? Thanks for the help. Definitely. Like, we're sure we're having a lot of discussions on that. Like there's still. I had another discussion with John Vervake and Jordan hall, which is going to be coming out pretty soon, maybe tomorrow, I'm thinking, I'm not sure. And then there's also another discussion that I had with the two guys who wrote the article on the symbolic world. So there's a lot of discussion on that. And I think your insight is quite right. I think your insight is right that it's related to the manner in which, let's say, intelligent patterns from heaven, how they can be embodied in the world. And so I think you're probably right that the birds that take the seed is something like these parasitic patterns of heaven. You could say, you know, these lower patterns, but that are still and they prevent the world from. I also talked about it like in terms of ideas that don't fit with the world, like ideas that can't be, they can't land. And so there's something about that as well. But there's. Your intuition is right. It's not exactly the same, but it's definitely related because it's talking about the manner in which higher principles exist in the world. So. All right, Alejandro Jurado says, hey Jonathan, if you state that higher level beings have an influence over people and affect their will, how does this permit destroy the vision of freedom to choose? So you always have to think about it fractally. It's not complicated. Because let me ask you that question now at a level that is not as. The problem is that when we think about these higher beings, I'm really starting to worry that people are thinking about it too much in magical way. It really just is the man in which things exist. So let me ask you this. So the fact that your family or your father or your boss or your mayor or your, or the police or any type of higher level being and higher level authority, the fact that it has influence over you and affects your will, does it permit and destroy the vision of freedom to choose? And the answer is no, it doesn't. It's like we have freedom to choose within higher systems. And so we are bound by our existence in higher systems and in like bigger beings, but it doesn't at all destroy your freedom to choose, right? You, you, you exist within that and you choose within that. And if you transgress, especially if you transgress the body of your family, then there will be consequences of that. If you transgress the city you live in, then there'll be consequences to that. But that's just how the world exists. And so that's the same like when I talk about higher level beings, it's just the same. So let's say if you think that there are intelligent patterns, intelligent watchers that are watching over natural, let's say patterns in the world, in the movement of the sun and the stars in the sky, it's like, does that destroy your Freedom to choose or permit the freedom to choose. It's like, it does. Just like any type of freedom, it gives the bounds to that freedom. And so within that system, if you act certain ways, it will be damaging to you. And if you act in other ways and it'll be good to you, if you walk outside in the darkness and you try to do the same activities that you're doing during the day, then you're going to pay the price for that. And if you. If you try to go outside in the middle of July and try to sleep in the sun, then you'll have a nice surprise when you wake up with a nice sunburn. So it's like all these things, they're just the way we exist in the world. We just have to understand that they're intelligent patterns that manage our existence, and those are intelligible, they're intelligent, and they have causal effect. They cause you to exist in certain ways. Um, but it's all fractal. So your capacity to choose is bound in that, but it's not. It's neither fully. It's like, it's. It makes it possible for you to choose within those systems, if that makes sense. Give me, let me give you an example, an example that Jordan Peterson used once, which is that it's like systems of control or systems of authority, they give you the possibility to choose. They don't remove it. The idea that higher beings manage the way in which you live actually gives you the possibility of choosing. To give you the counter example would be, it's like, if I drop you in the middle of the ocean and I say, all right, you're totally free, right? In the ocean, you are totally free. Now, you can do whatever you want, but there's nothing in which to bind your freedom. There's no order in which to bind your freedom. Then, like, who cares? Just being in the middle, or dropping you in the middle of the desert, you know, and it's like, okay, you're free to choose. That doesn't mean anything anymore. So the idea is that this is actually what makes freedom real and possible. So, yeah, okay, all right. So Cormac Jones asked a question. So, by the way, I want to mention, like, Cormac and a bunch of other people. I wrote a version of Snow White, which I'm hoping to publish in the next year or so. I'm getting an illustrator to do it. And this is something that I want to do, which is to create some fairy tales and kind of retell fairy tales, emphasizing the symbolism, but in a Way that's not like, tedious and explicit, but rather kind of brings out or teases out certain symbolic strains and that are totally fine to tell for kids, but think that adults would like as well. And so Cormac is one of the people that read it and has given some interesting critiques about it. So I'm happy about that. All right. So. Good evening, Jonathan. I sometimes really like something that I've made. That's why I made it, right? I created and saw that it was good. Those two actions, the creation and the perception, happened together and can be hard to distinguish. If I were to write something, say that to me functions as an image of Christ, well, I would love that piece of writing because I love Christ and I love his image at the same time, I sinfully love myself. This image is something that I've made. It occurs to me that this is the predicament of the iconographer and that I should ask how this works. How does one make an image of Christ while worshiping Christ and his image and not worshiping the works of one's hands, as would an idolater or someone captive to self love? I think it's definitely a balancing act. You know, if you're attentive to the way that other people react to what you've made, you could probably know whether or not you're captive by self love. So, for example, if you feel like you're not getting enough credit for what you've done, if you automatically get angry if someone criticizes what you've done, I think it's fine to defend what you've done and to explain it and if people are misunderstanding it. But if you have a reactive attitude to someone just because they are giving you criticism, and then also, can you part from what you've done? Are you attached to it? For example, like, if you were making some art, you know, would it hurt you to get rid of it? Like, would it. Would you suffer from that? I think those are all little ways to look at that and figure out whether or not you're kind of captive. But it's definitely. It's definitely a temptation, you know? I know because, like, I have to deal with that myself. Like you said, it's like, I make icons, I make these videos, I make a bunch of stuff, and I get excited about it, I'm happy about it. And then it's like, you're right. When is it a little too much? Like, when am I just in a mode of, like, self promotion and looking for attention? It's like, I'm Sure, I fall into that all the time. And so God forgive me when I do. I hope you guys forgive me as well. All right, so a popper says, so in this season of Pride, I have a question about the meaning of LGBTQ plus. This symbol represents the union of people from sexual margin. The plus sign at the end represents all other sexual identities known or unknown. What is the meaning of the cross that represents the margin and the margin being found at the end of this group of identities? Is there a hint of a possible Act 16, 17 moment? Paul making explicit the unknown God in Athens, where the unknown cross will be made explicit at the end of the Carnival of Pride? I don't know. I've never thought about it that way. I mean, for sure, the way that it's used in the LGBTQ has to do. I mean, the funny thing about it, like, it is kind of funny because. Right in. In Hebrew, I don't want to make sure. I want to make. I think I'm right. In Hebrew, the tav. Tav is the last letter, isn't it? And so it's just interesting because the TAV is a cross. I was right. Yes. So in Hebrew, the last letter is a tab. And so it's actually. It's like a cross. So it's interesting that it's like the end. It really is the end in this sense, that it's related to the end. And so that's kind of fascinating. But I think in their case, what they want is to say it's like. It's actually just. It's an image of indefinite variability. It's like a plus. It's like there are many others, but we haven't. We're not going to make them explicit, you know, so that's my kind of understanding of it. So I see it more like that than the idea of the unknown God. It's more like the end. And also the idea of the end as maybe a dissolving into so many variables that you can't name them. It's just like a chaos, basically. And that has to do with death as well. Like just a cross has to do with death as well. So maybe interesting to think about that. I'm sure the TAV thing, people. I've sure the tab thing, some people have. Have been keen on that. Someone should check it up and see if. If people have come up with that before. So Ramal asks, hi, Jonathan, what is the symbolism of surviving fire being fireproof? Notice the pattern in Christian stories such as the fiery furnace and the martyrdom of Santa Stash, but also in Indian stories of testing someone's purity by passing through fire. Sita and Prahlada. Also, does that have some relation to Joshua and Caleb passing through the desert and the idea of fire and the Last Judgment? And so. Well, for sure, the idea in. I think that the idea of being fireproof, I mean, fire is a kind of death. It's a kind of death by multiplication or a death of. By being consumed. And so I think that there are many more than one symbolism of that. It could have to do with what you're saying. The idea that. I mean, it could have to do with the idea that this person's integrity is beyond the capacity to destroy. Right. Something like that could mean something like that you try to destroy this person's integrity and you won't be able to, like, you just won't be able to do it. There's also the image of burning with fire without being consumed, which you see in the. The burning bush. And. And that seems to have something to do with theosis. And I think that that's something which has been represented in the idea of the. The three men in Daniel too, that there's a notion of resurrection, of theosis, of, you know, transformation, all of that. So. But I never thought about it explicitly in those terms, so you're definitely onto something. All right, so Simon says, kia ora, Jonathan. Was the symbolism of Jesus spitting on the ground, making mud, and applying it to the blind man's eyes to heal him? Is it to do with bringing heaven out of Jesus mouth to earth? Yes. And where heaven and earth meet, there is wholeness and healing. Yeah, I think that's what it is. I think you've got it. It's definitely has to do with like, spit coming, like with the water that comes down and then meeting the earth. And then it becomes like this union of heaven and earth that is healing the man? I'm. Yeah, I'm pretty sure that's what it is. So I think you've got it exactly. All right. So Silkana around asks, is paradise supposed to have no chaos? And so that's an interesting question. I think it has glory. So it's hard to totally. To think, like, does the. Do the lower waters, like, kind of continue to exist? I think so. So it's not in paradise, but it's like paradise. Paradise is the hierarchy. And on the edge of that hierarchy is still potentiality. And so you can imagine. So the idea would be that the work of creation has to continue. You see that the idea of naming the animals. And so Saint Ephrem the Syrian, for example, says that there are no animals in paradise. Like the animals are outside of paradise. And so Adam would like come down the mountain to the border of Paradise. Basically the animals would come up to him from outside, from the chaos. So it would be like these waters kind of coming out of the sea. You could. It's not exactly that, but you can kind of imagine coming down from below and then Adam naming them. And so there's already. There's always potential, more potentiality and more chaos that can kind of be brought into to order. And so I think that that's the way to understand paradise. But for sure, at the end of time, like when you look at the image of the heavenly Jerusalem, right? It says. It says that there will be no more ocean. That is a crazy statement. Like that statement. I remember re. It's like a year or two ago I was rereading Revelation and I sent that to my brother Matir, and he hadn't read it in a while too. And so he's like, what? It really says there'll be no ocean. It's the end of time. And so we're like going into the text and like looking and it's pretty astounding. So. Yeah, I don't even know what that means. Like, I don't even know. I guess it means that the fullness, this total fullness of God maybe. But it's scary to think the idea of like no chaos, like no potential. Wow. Like the fullness of actuality. I guess that's what it is. So. But there's also an image in Revelation of the sea becoming like glass, which isn't at the. It's not at the. At the moment of the heavenly Jerusalem, but it's like maybe that's something like that where it's not chaos. It's just like still potentiality that completely reflects, you know, the image from above. Something like that. Yeah. So choose. Agape asks. When the woman is caught in adultery, Jesus writes with his finger on the ground. The ten Commandments were written by the finger of the Lord. Was the significance of the finger. Thanks. So a finger. Fingers have to do with pointing. Like that's the. The great genius of the finger. The finger points. A finger is related to concentrating, meaning. Pointing is. Is like you could imagine like the. The most primordial form of language that you can imagine is something like pointing, right? So it's like there's all this stuff and you say that this. This thing, that thing that is the, like the the essence of. Of language, you could say the essence of, of naming is something like that. Right. And so I think that that's why the finger. That's the significance of the finger, and that's why it's written by the finger of the Lord. Yeah, that's what it is. It's like a concentration into a point that if you read Matthew's book, you'll get what that signifies. Like, that's the point, that place where things come together. So Mary asked, could you please comment on the symbolism of the number 40? Moses stays on Mount Sinai for 40 days and 40 nights. Christ in the desert. Is this somehow related to the human gestation time of 40 weeks in the womb? And does it have anything to do with birth or rebirth? Thank you and God bless. And so, yeah, there's also the 40 days of rain, the 40 years in the desert that the Hebrews, the 40 days of rain for the flood. So it, I mean, it has to do with a cycle for sure. And the idea of 40 weeks in the womb, definitely it has to do with a full cycle. And so there are different, like, ways of representing the full cycle in scripture. Sometimes just seven. Right? So seven days, but then sometimes it's 40. I don't totally know whether 40 comes from. I struggle sometimes with, like, I can see the numerical patterns, but I'm not the best at mathematical symbolism. So sometimes I see it like it's there, but I. Someone asks me, like, why is it 40 rather than 30? It's like, I don't know. I don't know. Seven is easier. You know, the first 10 digits are easier, but then it becomes 12. Maybe up to 12 is. Is possible, but after that, it gets hard to really understand, like, why 40? So sorry if I'm disappointing you. All right, So C. Streetsell says, does the story of the Apostle Peter give us any symbolic insight into the Roman Catholic Church and the role it plays in broader Christianity, particularly St. Paul correcting St. Peter at Antioch when juxtaposed to papal infallibility, or the Apostle Peter cutting the ear off a man coming to rest? Jesus when juxtaposed to Roman Catholic churches, crusades. And so my answer to that is I believe. So I really believe that. That the way that the story of Christ played out, let's say, in Scripture, it is also to a certain extent, playing out in the bigger. As a cosmic version, in the cosmic version of Christianity. And so I think that all the qualities of the Apostle Peter are there and all the negative aspects of the Apostle Peter are there. It's like the apostle Peter was, you know, the first of the apostles. He was the one who Christ said, on this rock I will build my church. And then, you know, right, the next verse says, get behind me, Satan. So the apostle Peter is the one that walks out on the water and then he's the one that sinks. The apostle Peter, right, is the one that says, I'll follow you until I die. And then he denies Christ at the cross. And so I think that that is a very mysterious aspect of Peter and I think that it's going to play out in the cosmic sphere. Now, I want to be careful because I want you to understand that I think that the apostle Peter is still the apostle Peter, that even when the apostle Peter is sinking and even when the apostle Peter is denying Christ, he is still the one that Christ chose. And so although I am orthodox, I am very careful. I don't want to. I think that in the big story, it's all going to play out and it's all going to play out in a way that, you know, that ends with Christ saying to the apostle Peter, love my sheep, you know, if do you love me? And if you do, then care for my sheep, you know, so I want to be careful that I do believe that it's playing out in a bigger sphere, but I don't think it gives us permission to make simplistic interpretations about that. It's a large and complex story that is playing out. So. So yeah, and I think the same with St. Paul. I think that there are, there are churches that revere St. Paul particularly. And those churches, they have the qualities of St. Paul, you know, especially in the west, the idea of St. Peter and St. Paul together was really, really important in terms of a pattern. And so I often feel like the Reformation is something like the separation of St. Peter and St. Paul and that the Reformation took on St. Paul and all his qualities, but also all his faults. And so, yeah, so it's definitely things to think about if you want to think about something. It's an interesting, it's an interesting idea. All right, all right. So Lisa says, can you comment on the carnivore diet? People go on it seem to become almost superhuman, health wise. Curing chronic issues, losing weight and not being a slave to craving anymore. But it comes at a great cost. Lack of dietary resilience and social exclusion. Technically they can't even have the Eucharist, which is the alternate symbol of communion. Does this has something to do with Cain? And is there also a kind of inversion at Play Eating meat comes from the fall and Cain founded cities. But our current culture, the end result of that is very anti meat and is the reason people are having these chronic health issues in the first place. And so I haven't figured it out, man. I like Lisa. I haven't figured out this carnivore thing. It is so mysterious that it's happening, it's happening now, you know, and you're right, it's like, you know, I'm, you know, I'm looking, watching Jordan Peterson and I'm kind of waiting. I'm like, it's been five years. Really, five years. You only eat meat, salt and drink water and you know, he's definitely in a better shape than I am. He's definitely like, I'm kind of nice and soft, like getting nice and soft around the edges, you know, I, I don't have, I get tired in the afternoon. I don't have that much energy. And it's like. So I don't know, man. I've been telling myself I'm going to try it at some point, you know, just for a few weeks and see what it does. Because I now I have. So I have some guy in my parish, a guy, a catechumen at our parish. You know, I met him six months ago and maybe a little more. He was walking with a cane. Chronic constant illness. He. He would go up the stairs of his apartment and he would have to lay down on the floor for 20 minutes because he could barely, like, function. And he went on the carnivore diet and like, what is it? A few weeks later, few months, like a month later, I don't even know. Not very long afterwards, no more cane, no more constant pain. Like, I couldn't believe it. He said, like, this is something he's been dealing with his whole life. And so it's pretty impressive. So I don't know, like, I don't even know. I already. I don't know. Like, I don't know what to think. I don't know. It has something to do with like the place we are in the world. Like, I mean, does it. How could it have something to do with Cain? Like Cain's an agriculturalist. Like, I don't know. I don't know what it is. It's. It's interesting. Yeah, I'm still thinking about it, so I'll let you know if I come to conclusions. So Tony Rosa says in the recent Rebel Wisdom conversation with John Revakian, in the context of the hermeneutics of beauty versus suspicion Discussion John described beauty as a disclosure of reality. It's such a beauty and overlapping category to symbolize. And if so, what are the distinctions? Or is it in fact equal to the idea of symbol as I understand a symbol, a disclosure, revelation of reality, of bringing together, of epiphany, of what is in a sign. Yes, that's exactly what it is. That's exactly. At least the way that I see symbol. That is, it's the gathering of the elements together and to manifest its identity in. And so when you can see the symbol, you can kind of see reality like it's not hiding, it's not masking reality. And so I totally agree. And it's interesting because it so, so it's interesting because you can see how people who engage in only this type of hermeneutics of suspicion, how they can sometimes engage in very deep conspiracies because they have a sense that symbols are always there because symbols can't hide things. It's possible. Symbols can be like secret languages, right? That exists in the world where only an in group knows what the symbol refers to and then the out group doesn't. And so I'm not saying that that's not possible, that that can exist, but there's a way in which for people who really get into kind of conspiracies, like at a really deep, deep, deep level, they, they start to think that all symbolism is like that and all symbolism is actually hiding some nefarious thing behind it. And so you can see how it's. It filled up different types of people's minds so much. All right, so. All right, so now we're moving on to Patreon. So Brandon Burns, sorry, in the chat, says, could you convince Matthew to write a Bible companion? I don't think so. I think Matthir, he has his will. He definitely kind of knows what he wants to do. So I don't think so. I successfully convinced him to help me write the next book of the next series for God's Dog because we're working on like another, another series which would be. Which will be related to like Legends of God's Dog. And so he's agreed to do that, but I don't know how it's going to play out because he's got a. He's got a lot of stuff to deal with. So. All right, so Christian Clyde says hello, Jonathan. I will try to reword my question from last month. Okay. All of the disciples followed Christ to the cross. St. John was the only disciple that wasn't martyred in doing so not all of them were crucified, but martyrdom is its own cross. And icons of the crucifixion, we see St. John and the Theotokos on both sides. From tradition, we are told that they both died naturally before being bodily assumed into heaven. I'm wondering if you have any insight there. I think there definitely is an insight to have there. There definitely is something related to that, but I'm not sure what it is. Like, I'm not totally sure what it means. Yeah, I'd have to think about it because I. I like, why is it that that St. John, who is the closest to Christ, right, the one that laid on his. On his heart, would be the only one that wasn't martyred when Christ himself was martyred? I don't know. If you think about that, there's definitely something there. Right. So Hugh Rose asks, why does Pinocchio's nose grow when he lies? How does this relate to what you said about saints being depicted with long noses and the idea that noses are associated with finding truth, nosing around, sniffing out. Yeah, there's the idea, like, the idea that God has a long nose. Right. It has to do with something with, like, patience and long suffering. But I never thought about why Pinocchio's nose grows, like, when he lies. Like, is the top of the. Of the face. Right. If you think of the face like that, then it's the highest point of the face. And so why would it grow when you lie? I don't know. I'm sure the guy who wrote Pinocchio had something in mind. Like what? They had something in mind with that, but I have never thought about that. So I. I don't. I. I have no idea. I mean, it definitely has something to do with. Obviously it has something to do with, like, his incapacity to hide that he's lying. Like, that's what it is. It's like, so he lies and then it shows. It's like you lie and then the signs appear of your lying. So for sure it has to do with that. But why the nose rather than something else? Like, why? And it also has to do with the fact that he's made of wood, you know, Although that doesn't tell you the meaning, but it's clearly, like, structurally, that's what seems like he was trying to go for. All right, so Nick Eggensperger asks. Hi, Jonathan. In rural Germany, we have this folktale of the Wiederganger. Sorry if I don't pronounce that right. Wiederganger is essentially the spirit of a deceased person which haunts people close to them, often their relatives. Now, one of the ways Wiederganger can attach itself to a person is through them looking in the corpse's eyes. I believe that this is definitely related to the evil eye and vampires. However, I would like to hear your interpretation and perspective on this. So. Oh, Ivan Engel says Pinocchio's nose is a sign of pride. Yeah, that's a great. That's probably right. You're probably right that that's what it is because the nose is the highest point on the face. And so it has to do with, with, with pride, probably right. I'm not, it's like I'm not, not 100%, but I think that that's definitely a good, A good possibility. Yvonne. So thanks. All right. So, Vitor Ganger. So the superstition is that if you look in a person's, a dead person's eyes, and you can be haunted, you know, by their ghost, let's say. I mean, it's not surprising as a pattern. It's like the idea, the idea would be to like, to be cautious with a, with a dead person that you don't. How can I say this? It's like you don't want to try to see consciousness in a dead person. And so that seems to be what's going on here. I mean, you could, you could totally explain this in a totally materialist way. Like, this is. You wouldn't have to. You know, a complete materialist could probably understand this pretty simply. It's like, why are you looking in the dead person's eyes? The person is dead. So if you look into their eyes, into a dead person's eyes, it means you're trying to see soul. Like you're trying to see life, trying to see meaning in their eyes. And so, like, surprise, surprise, you might find some. Like you might. But it'll be a twisted, like, version that it's going to wake you up at night. You know, it's going to be something which is going to haunt you because death has certain characteristics that, you know, it has a certain eeriness, it has a certain uncanniness about it. To look at a person's dead face and to try to find meaning that it's like, that's probably what a ghost is. You know, a ghost is probably something like that. It's like the remainder of meaning that a person leaves. And if you try to look for it, like, if you're trying to even, like trying to engage with it. Trying to find it, then it'll find you, you know, and then you might. Yeah, you might have nightmares after that. So anyway, that's the best way. I understand that. So Charles Harrow says, what is the symbolic significance of wedding rings going on the left hand instead of the right? They're different traditions, by the way. Like, there's some traditions that have, that have them on the right hand. But I think that in the. This tradition has mostly to do with like, the, the left hand as being something like the. The hand of protection or the hand of. Of out. Right? And so, like, if you hold. If you held a shield, you'd hold it with your left hand. It's also not the hand you do things with. And so there's less chance that it'll get caught in things. But that has to do with that as well, right? It has to do with the fact that your left hand would be used for a shield and your right hand would be used to fight. So it's like a hand that is clumsier but could be used for defense. And I think that probably there's a practical reason which has to do with the fact that the left hand is not something used for work. But there's also, like, that brings about a symbolic reason which is this idea of the hand of defense or the hand of. Of pushing away, you know, that which is unwanted. And so it's like, hey, I'm married. Stay away. It's like you're married. Your husband knows you're married. The wedding ring, in a way, is there to kind of remind you, but it's also to let other people know that that person is married. So it's like, it's kind of like the hand that pushes away, you know, the left hand that pushes away. That's the best I can do. But I know there's some. There's some cultures where it's actually on the right hand. So maybe there could be variations on that in terms of what it means. All right, so Gogo says, in the Eastern yogic concept of the Kundalina energy rising in the body the same as the Holy Spirit? Is the Eastern yogic conception of the Kundalina energy rising in the body the same as the Holy Spirit? Why is blasphemy against the Holy Spirit the unforgivable sin? So that's two questions, and I'm going to answer quick. I don't think so for the first one, but I'm also not an expert on Kundalini Yoga. Like, I don't really know much about It. There's something about it, which, which kind of there's something about it or something about the obsession with it, or there's something about the type of people that I've known that have talked to me about it so much that makes me suspicious of it. But, you know, I don't know. I don't know much about it, but I can answer the second one more easily. I mean, why is the blasphemy against the Holy Spirit the one unforgivable sin? I mean, it has to do with the fact that you're. You're. You're basically blaspheming against the thing that's making you live, like, the thing that makes you exist. And so that's what it is. But if you treat the very spirit of God, which, let's say, makes you exist, then the spirit that was floating above the waters, like, if you. If you misuse that, then. Yeah, but I don't know. I don't even know. Like, I don't totally understand what that would be in your life. Like, what would it mean to blaspheme against the Holy Spirit in a way that is unforgivable? A lot of people debate about that, and a lot of people get caught up by that and become nervous about it, But. So Sean Desmond says, symbolism of tornadoes. And why do tornadoes feel like such a uniquely American phenomena even though they have it everywhere? It's probably because you live in America. That's probably why you feel like they are uniquely American phenomena. I mean, they're the symbolism of the whirlwind. Like, they're the symbolism of, you know, an invisible force that is just turning on itself and therefore is destructive. That's the best I could do with that. You know, it's not. It's. It's unfruitful wind. So, yeah, Brad says, where's your ring, Johnny? It's a good question. It's actually. It's actually a funny question. It's funny in the sense that one day my wife lost her ring. And then she lost her ring in a way that she. She let my child play with it. And then because of that, she lost the ring. And so I let her use my ring. And so she was using my ring. And then. And then I think. I think something happened to that as well. Like, I think it was lost in some. Some moment. And so we just lost the rings. And so we keep telling ourselves, like my wife and I keep telling ourselves we're going to make new wedding rings. We're going to design them. Like they'll be really nice and make an image of our relationship. And then life goes on and things continue and we just don't do it. And so. But don't worry, I am very much married. I've been married for a very long time, so. All right. So Ajafka asked, why are mostly male animals sacrificed to God in the Old Testament? Yeah, that's weird. I've never thought about that. It probably has to do with the idea of seed or the idea of identity, let's say. The idea that the man is the seed, let's say, probably has something to do with that, but I haven't thought about it. So Matthew Moldenbrand says, the lost ring, hobbits to the rescue. That's hilarious. So Ib asks, hello, I was wondering if the proper hierarchy pattern that you have described connected to the rich having an obligation to let their blessings flow down through them to the poor, is connected to the story of Cain and Abel in some way. Rich Abel seemingly is not paying enough any attention to Cain, who is poor despite all of his efforts. They're not in proper communion. Am I confused regarding this is the wrong way of reading the story? Yeah, I would say. I would say it's probably. It's the wrong way to read the story. I don't see where you get that in the story. Like, why does it seem like Abel is rich and not paying attention to Cain who's poor? So I don't see that in the story. It doesn't say that. It just says that Abel sacrifices to God and his sacrifice is accepted and Cain's sacrifice to God, it's not accepted, but he's bitter and he's angry and so that's all it says in the story. So, I mean, I, I understand why. For example, Jordan, Jordan Peterson sometimes extrapolates on it and then creates this story about the idea that everything's going well for Abel, like he's good looking, that it's not there in the story. I think that's just a way to help you understand the idea that, that we have to understand that sometimes when we sacrifice, our sacrifices aren't accepted and we just have to accept that. But it doesn't. I don't think it implies what you're suggesting. So. All right. So Emmanuel Montiel says, hi, Jonathan. I can't help but feel like the rainbow as a symbol of pride is a sort of inversion of what the sign of relief stood for. Especially when considering how Babel is a story that immediately follows the flood. Is the pride month symbol of this Rainbow, a sort of symbolism happens moment and the constant additions to their flags. The sort of Tower of Babel in the making. So, no, it's not a Tower of Babel. You have to understand the difference. The Tower of Babel is about unity. The Tower of Babel is about one language. The tabloid Bible is like one thing. It's about gathering everybody into one thing. Whereas the rainbow symbolism is about fluidity and multiplicity and about, you know, indefinite identity. And so it's a bridge. Like, there's a positive aspect to the rainbow symbolism. That's why God uses it as a sign of a bridge between heaven and earth at the end of the Flood. But it's in the way that it's used now is definitely a symbolism happens moment because it's. It is just this an image of the lack of transparent light, like the lack of. Of pure light. And it's only refracted light without the pure light. And so. And then you. You just keep adding them because. Because the rainbow is fluid. It's an indefinite amount of things. And so there's no limit to how many things can be added at some point. Like, yeah, all right, so maybe there's a funny hesitant to say it. So maybe at some point they'll add so many, like, gradations into the flag and then they'll spin it and then it'll just become white. Like, it'll just turn white like you do when you spin, like a rainbow. So I don't know. Anyways. All right, so golden. Maybe that'll be like the final flip or something like that. So Golden Pidget of Valor says, once you said that the symbolism in the Narnia series doesn't work. Why do you think so? I didn't. I'm not saying the symbolism in the Narnia books doesn't work. I'm saying that it's that I think that. I think that it is not as powerful as it could be. Because I think there are a few things. One is, I think. I think that C.S. lewis, unlike Tolkien, for example, doesn't take into account the quality of the beings that he places in his Narnia. And so, for example, like a satyr, a faun has a certain characteristic. It's a human with animal legs. And that usually those are related to sexual desire. They're related to centaurs are usually related to aggressive, out of control sexual desire. And so to have them just be like characters in the book, like, okay, here's a centaur, here's a faun, here's all These creatures, and they don't have the qualities of their. They don't have the qualities of what they are. I think that's the problem, one of the problems with the Narnia book. And so I. So there are wonderful things in the Narnia book. They're really wonderful things. But I think that he kind of missed that. Whereas in Lord of the Rings, right, you have, like, the orcs look like what they are, you know, and the dwarves look and manifest certain characteristics. And so all the different groups have, like, characteristics about what they're manifesting exteriorly. And I think that that's closer to what you find in mythology, you know. And so. Yeah, so. So I think that that's the issue. One of the issues, let's say. All right, so Ken Lowry asks. I recently had a conversation with John Reva, working through aspects of bridging Christianity to his work, I think formulating thoughts on the primary question he asked me and would love to hear you address it as well. His question relates to the deity of Christ insofar as Christ's final words, My God, my God, why have you forsaken me? I'm not interested in parroting your thoughts. Rather, I'm interested in how you would frame this and pitfalls you might avoid. And so I think that the best way to understand that is to understand Father Stephen DeYoung. He talked about it in one of the podcasts. I forget where it was, but it has to do with something like a lot of the other stuff that's going on with Christ, right? And so a lot of the other stuff that is going on with Christ is that on the surface, it looks like something, but it's hiding a deep, deep irony which is hidden underneath. And so when Christ is being beaten and, you know, him being mocked for being a king, it's actually revealing his kingship as he's emptying himself. You know, he is also becoming full at the same time. And so this is what Christ is doing on the cross. So it's like as he is dying on the cross and everybody is mocked as a criminal and as the. The worst type of person. Above his head is an ironic statement about him being the king, which is actually true. And so he's actually filling up that role while he is emptying at the same time. It's a deeply mystical image. And. And this is what happens to Christ all through the crucifixion story. So when Christ says, my God, my God, why have you forsaken me? You have to understand what that refers to. That's a psalm, and it's a psalm that talks about, that uses an image of resurrection at the end of that psalm. And so this is King David's call to God, God, oh God, why have you forsaken me? And there's this sense of being abandoned and emptying and an emptying of yourself. And then when the psalm ends, there's a fullness and a resurrection. And so this is what Christ is really. So I don't want to diminish the deep mystery of Christ saying that on the cross there's a very, very deep mystery, but it does not at all deny his divinity. It is rather the deep, the deep kind of Cohen aporia moment where in emptying himself he is also revealing the, the fullness. And in saying that he is also. And it, because it is a quote from a psalm and read the psalm, you'll see where the psalm takes you. And it's like, it's like hiding, it's hidden in what he's saying, that what he's moving towards the final glorification and the final restoration is coming. And so that's what I think is happening, you know, So I hope that answers that. It's as good as I can do. But I want, like, I, I want to say one last thing. I want to be careful that we don't think that this is just a game, right? That this is just a play. It's not like there's a reality to what's happening when Christ is being tortured. He's not like on the inside going, haha, I got them. I'm actually the king. And you know, you know, like secretly knowing what is going on, like there's a reality to what is happening. And that reality is truly. Christ is truly crying, you know, on the, in the, on the Mount of Olives, he's truly sweating, sweating blood, you know, whatever that means. It's like he's truly in a moment of deep, of deep. But the way the whole story is told, he's showing how in that, in that emptying, he is also reaching totality and fullness. And that quote is just part, another one of those versions. And so I think that if someone questions that, I think that showing them that this is happening all through the story, it's not like one thing, I'm not just trying to avoid the problem. It's like this is what's happening all through the story of the crucifixion. And so it's not an exception, it's actually following the pattern. So Brandon Byrd says Is the descent of the Holy Ghost at Pentecost the rectification of the confusion of tongues during the, the construction of the Tower of Babel? And the answer is yes. It's actually sometimes called the anti Babel. And so it is in a way a rectification of the confusion of tongues. Like, it's not a return to Babel, it's not a return to like, of complete like uniformity, but it is rather a transformation of the splitting of the tongues that happened at Babel into something, something glorious that can participate in the glory of God. And so that's what's interesting about Pentecost. So you could almost see it like in a way Pentecost is continuing what happened at Babel, but in a way that transforms it into a kind of glory. So it's a, it is a rectification. That's probably the best, it is the best term to use. So. All right, so Alexander says, hi, Jonathan, I hope you're doing well. I've been praying for you. Well, thank you, Alexander. My question is regards to history and great men. What is the symbolic tendency of revolution and civil wars to culminate into a single figure wielding absolute power? Caesar, Cromwell, Napoleon, Stalin. Yeah. And in what way does Christ point towards how to break out of this pattern? Thank you. I mean, you're totally right. That's what it is. Like revolution leads to tyranny. There's no doubt about that. There's no doubt about that. And it's a, and it's something about, there's something in the mechanism of revolution which makes tyranny almost necessary, you know, because as you break down, as you assault the order, you, you know, then you fall into like all these chaotic competing principalities. And then there'll be a competition or there'll be a. Someone who will seize that chaos, right? Will able to turn it towards another purpose. And that will usually happen in the tyrannical way. And so how does Christ point towards the break out of this pattern is that Christ rules his kingdom through self sacrifice. So Christ, I've said this before, it's like Christ doesn't cause a social revolution against the Roman Empire, right? So some people at the time, the zealots, they expected the Messiah to come like a king that would free them from the Romans, that would fight off the Romans and would free Israel, Judah from the Romans. And then Christ doesn't do that. And so a lot of people say, well, he's not the Messiah. Right. And so that's the thing, that's the secret is that the pattern that Christ manifests is the notion of planting the seed and of self sacrifice. And it's a way to transform the world without falling into just dialectic. And so what happens is that Christ does take over Rome. It just takes longer, but it's also more permanent in the sense that Christ takes over Rome a few centuries later. And it lasts for what, 1500 years maybe, you know, or a thousand years. At least a thousand years. It lasts. So that's not bad, you know, and so it's like. And then it leads to something like Antichrist, but which is still part of the pattern somehow. Like, so. So that's the difference. That's a difference. All right. And so Dorothea says, hi, Jonathan, I watch your video on the symbolism of the Far east, and I guess I'm spiritually Asian or something, because I recognize myself as a small version of that pattern. I even literally dreamt that God is building a house for me. So my question is if you have some advice how to put all of that in service of God. You mentioned the three Magi giving their gifts to the child Jesus. Is it connected to that? I'm not sure I understand your. Why does it. Why are you saying that you dreamt that God is building a house for you? Is that something we talked about in the symbolism of the Far East? Did I miss something? I'm not sure, Mina. Oh, you mean the pattern of, let's say, sending someone from the west to build a house for the East? And so the east appears as, like, the seed, let's say. And then the west appears as the home or the house. So you. Right, so it's like an image of the. Of the temple or the tabernacle itself. Right. The tabernacle has the ark of the covenant in the west, and then the glory of God comes down from the east and then lands, you know, in the west. And so. So that's also. So you could also imagine, like you send builders to the east to build a house. And so. And so I understand. So you mentioned the three Magi giving their gifts to the child Jesus. Is it connected to that? And so in a way, it is. It is in the sense that the gifts that the Magi give Christ is something like gifts that recognize his divinity. And so they're sending their authority, like, or their. They're doing is. They're pointing to Christ. They're coming from the east with, like, with insight. And they're saying that's the Messiah right there. And their gifts are there to, like, point to the Messiah and So they are acting like light. They're acting like rays of light coming from the east that are pointing to the mysterious hidden thing that is in the cave, you know, and more in the west. So, yes, definitely that's related to that. But I don't know what you mean by putting that in the service of God. All right, so Kulai says, what is the symbolism of the morning star, as in spiked mace called morning star spiked mace? I don't know what that is. The meaning of its form and the relation to the aspergillum. I have no idea what you're talking about. I don't know what spiked mace is, and I don't know what aspergillum is. Oh, it's a sprinkle. Holy water. See, I didn't even know that had a name. Aspergillum. It's a good name to remember that it's related to the aspergillum, the meaning of its form and the relation to the aspergillum. So I've never thought about any of that. I never heard this relationship that you're talking about. I'm so sorry. As for the idea of the meaning of the morning star, I mean, it's that it has to do with Lucifer, right? That's the idea of the morning star. And so. And so you can. You can understand Lucifer in several ways. And I think it's probably. Probably good. Maybe I mentioned this before in a Q A. People have to stop freaking out about the term Lucifer. Like, I understand that in some circles, and in some ways it's interpreted as being Satan. But, you know, Christ is called Lucifer in scripture. Christ is called the morning star in scripture, and it means the light bearer, right? The one that bears the light. And so the reason why the devil or the evil one has come to take the name Lucifer is that it's the idea that the morning star appears in the sky. And what it does is it's like calling to the sun, right? It's basically preceding the sun. And so you can understand. So St. John the Baptist, for example, in liturgical text is called also the morning star. And there are many other people that are called the morning star because they're the forerunner, right? So like, St. John the Baptist is Lucifer because he is the foreigner to Christ. He is the morning star that comes up and then the sun follows. And so the reason why Christ is called that is because you could say that he is the. The image bearer of the Father, right? And so it's just a structural relationship of the morning star that comes up and Then you know that the sun is coming later. So it's like it comes out before the sun. And so. So the reason why the evil one is called Lucifer is that you can imagine that the morning star thinks that it's got it. Like, the morning star thinks that it's the one. It's like I am the light, right? I look at me, I'm so bright, and I'm. And I'm the light. And so it fills itself up with prophet pride. So because of that, it falls because it gets completely flooded out by the light of the sun. It just vanishes when the sun comes out. And so that's why that term or the idea of the morning star is used in different guises in terms of symbolic thinking. And so you have to be cautious, because I've seen people, let's say, play masses, for example, where in the mass, it's. It's actually seeing the. The verse where Christ is called Lucifer. And it's. And then people, like, you know, think it's like some secret thing that, like, the Catholic Church is worshiping the devil, you know, and so people just get nuts. Like, they just don't understand this stuff. So. So. Yeah. Yeah. All right. So there you go. That's as much as I'm gonna say about that. But the aspergillum. Someone says the aspergillum is a weapon. So this morning star is a bludgeon. Well, it kind of looks like one. I'm seeing. I'm looking at it here, and I can see that it does actually kind of look like a bludgeon. So maybe. Maybe in some cases it is. All right, all right. Enough on the aspergillum. All right? So Norm Gone says, what is symbolic significance of the fruit that Adam and Eve eat being an apple? Scripture never identified the fruit as such, but it seems universally understood to be an apple. I don't think so. I think it really depends on the culture. Like, there really are really many fruit that have been. Have been called the fruit. But I think more recently or like, in the last few hundred years, the apple, for some reason, has become an image of the fruit. But it's not that old of an interpretation. And so, I mean, I think that there's like, the simple version, like the kind of superstitious version, which is interesting, which is that an apple kind of looks like two halves. Like, you can kind of see the two halves in the apple, right? It's. It's like a heart kind of. So I think that there's probably something to do with that. Something the fact that it's common too. It's a common fruit in Europe and in the West. Something that everybody knows what it is, so it might be that as well. So Arie Fisher says. Hi, Jonathan. I've been learning a bit more about the logo recently and how they are in Maximus's theology, actually uncreated. Yeah. And basically divine energies of God. Timothy Petitsa described them as the way in which Christ empties himself for the life of the world. I'm wondering though, what is the distinction between the logi or the logai and angels as you describe them? I'm wondering if the two don't get conflated in the way you describe angels. I was thinking that the angels were the points of unity above the multiplicity of phenomena. But the angels are created and are not the logo. Are they like the next thing down from the logo? Forgive me for dragging you into technical metaphysics. It's not all clear in my mind. Yeah, I mean, I think that's probably the way to understand that, you know, in the sense that the angels are. They're invisible patterns that can be grasped or seen that can have influence, you know, but they also definitely have a logo. And you could probably understand the logi switching the way I say it, but you could probably understand the logi as they're akin to that because the logi also seems to kind of exist in this hierarchies of hidden purposes that are joined into God. But they're definitely, you know, when we talk about theosis, like we're serious about theosis, you know, know the idea that, that your, your origin, you know, that the highest part of you is God, it's actually a divine energy, like that's the highest part of you. And so yeah, Lisa Parrot says maybe the apple, you know, is the apple because of Apple, like Apple computers. Well, for sure, Apple computers is definitely playing on that. Like they're definitely saying that they are eating the apple of the garden. That is for sure. So Greg Garcia says. Hi, Jonathan. How did the ancients approach history? That is in contrast to our modern historical critical method, pole statistics, motives, whether political, economic or social, everyone is fighting over the narrative of history. Would people have done this in antiquity if they had the technology? The hyper focus on, ironically on it ironically seems to be breaking down trust. So I think that ancients approach history the way that we talk about universal history in the, in our universal history series. So if you're interested in that, you can watch those videos, you can get a sense of the more mythical origin of historical action. And the idea of finding common story like that is actually what makes history. And so the fact that right now everybody's arguing about common story, whether it be the kind of multiplication of historical narratives of the past, whether it be these different reinterpretations of American history or Canadian history. And it has to do with reaching the end, because you can understand it, like, in a positive or negative way. Think about it in two ways. So think about it in the negative sense. So in the sense that. So you have a common identity and a common history and a common core that binds you together. And so now when you reach the end of that, when it's running out of steam, what happens? That all these elements, they want to. They want to capture the story. And so one aspect of the history is like. Wants to capture it. So what it does is it fragments because you start to have fighting. Everybody's fighting over the story. Like, what's the story? And that is what it shows, is that the story is breaking down. And so now there is this infighting about who's going to control identity and story. So you can see it that way, but you could also see it in a sympathetic way towards these stories, these multiple stories, which is that in order to create a myth or a story, you have to order things in a certain way. And to do that, you also have to. You have to exclude and marginalize certain aspects of society. Because we're not God. We don't encompass all things. And so in doing that, it's like you're casting out or you're casting down certain elements of interaction. You are casting roles on certain elements of the. Of the story. And some of those are not great. Like, some of those are not. Are not particularly pleasant. Or some people do become like, the victim of that story because they end up in a marginal spot. And so when you reach the end, it's like. So when this story now starts to run out of steam, you can also have sympathy for the. All these competing stories now that want to free themselves from the negative aspect of the. Of the story. So think about it. Like, imagine I'm trying to find some version. It's like, imagine a society where in that society, there is a lower caste in that society. And that lower caste is blamed for everything. That lower caste is blamed for all the problems, all the stupidity. And so they, they. They're constantly the butt of the jokes, are constantly the ones that, you know, become the scapegoat for all the behavior. And so that works like it holds the world together. You have a coherent story, you have a scapegoat. You just put all your bad stuff in there, and then it, like, functions. But then when you reach the end of that story, it's like that scapegoat is still there and it's gonna come back. Why wouldn't it come back? You know, it's gonna return, and it's gonna return with a scythe. Like, it's gonna return with vengeance. So it's like, that's also one of the things that's going on in. In the story right now. And it's like, I'm not even saying one is good or the other is bad or, like, I'm not trying to. So I'm not trying to say that this should happen. I'm just saying it is happening, and we have to be able to understand it and be able to see it from all sides. Because I don't particularly like watching the narrative get completely corrupted and that there's these parasitic narratives that try to take over the story. But I also kind of. I understand why it's happening. You know, I get it. So, yeah, that's it. And so. Yeah. And so. But I mean, I think that there are excesses, and so it'll become. The revenge of the scapegoat is not necessary. It's not good. Right. It's excessive. And it'll. It'll. It'll create its own scapegoats and it'll create its own kind of weird narrative. So I'm not saying that I'm not trying to justify anything. I'm just trying to help you hopefully understand what is going on and what is happening right now. All right, so Russ Fro asked, could you comment on the depictions of snails often found in the marginality of medieval manuscripts? Yeah, I mean, I don't know. What would you want to understand? It's like, it's a snail is a clear, like, inversion of you because you have hard stuff on the inside and soft stuff on the outside. And so a snail has soft stuff on the inside and hard stuff on the outside. And so that's it. I don't know. It's an upside down. It's an upside to bug, first of all, it's also a bug. And it's also, you know, it's funny looking, but I think that it has to do with that as well. Like slugs and snails. Especially a snail because it has a shell. So, William Lawrence, what is the symbolism of coffee, especially in a church setting? Almost every church I've been to offers coffee Whether it's a mini cafe in a megachurch or it's coffee hour after Divine Liturgy. Is this just a convenience for modern adults or the. Is there more going on here? I mean, it's medicine, right? Coffee's medicine. Coffee is a. Is a stimulant. So it's like. It's like a jolt. It's like a. It's like a supplement. That's what coffee is. So, you know, that's probably why coffee's gonna take it over. I drink coffee, you know, at least one a day. So it is definitely like a stimulus and there's something rich. There's a ritual about coffee too. Like, you kind of have to make it. It's not. It doesn't just come. Like, you can't just like, buy a bottle. Like you buy a bottle of water, a bottle of Coke or whatever. You have to have it. It has to be made. So there's something about that, I think, which is also attractive to people, maybe unconsciously, like, there's a sense in which there's still, like, I have to prepare it right a little bit. And so there's a little ritual that goes with coffee. And you can see how people become weirdly ritualized about their coffee, you know, so Abe says, hi, John, I think you speak about the symbolism of owls. On the one hand, the Bible seems to portray them as unclean birds and harbingers of ruin, and they've been a favorite of secret societies. But on the other hand, they have a powerful associated with knowledge and wisdom from ancient Greece even to modern era. Do you see a way to reconcile their symbolism with Christianity? I mean, sure. You know, animals, especially animals, like, they definitely have multiple symbolism. And so the way that the. The symbolism will be represented will be contextual to the other elements. And so I think the idea of the wise old owl is totally fine as a story trope. But, you know, I think also the idea of the. Of the owl as like. Like a portent of something. Of something dark is also totally possible. You could use both. And so. So I think that you can. There's no. There's no. Absolutely nothing. There's nothing. You don't have to reconcile the symbolism with Christianity. They're. They're animals that exist in the world, and so think they have. Depending on their context, they can. They can manifest different aspects of what they are. So Chandler said. Jonathan, I must admit I was embarrassingly excited to see you in conversation with Bernardo Castro. Been reading his books and following his work for a while now, and I got to See a different side of him in your video. Bernardo's work is often based around metaphysical idealism, which he didn't discuss in too much detail during your talk. So I was wondering what your thoughts on the subject are and if you had any broader reflection on the conversations you had with them. Thanks. So I really avoided the idea, the question of idealism, because I think in a certain manner, I think it's like. It's like a false herring. It's like a. There's something about it that doesn't matter. And so like, when you read, when you notice, like, Bernardo's categories, so he says, like, he denies matter. So he sees everything as. As mind, let's say. But he doesn't deny the, like, the objective existence of the things you find out there. It doesn't mean that everything is. Is idiosyncratic. Everything functions with a pattern. And, and it's like what we recognize as matter or objects. They are, let's say they are mentations, you know, but they all have a structure and they have a certain way of existing. And so in a way, it was kind of like I was like, I don't think that that matters because if you could say, like, if you said something, something like, all things exist in the mind of God. Constantly. All things are. Are constantly existing in the mind of God. That's a completely Christian thing to say. Like, there's absolutely nothing weird about that. The idea that matter exists on its own and has a completely independent existence is something that Christians don't believe either. Like, I hope none of you believe that. It's like matter doesn't just exist, right? It is sustained by God and in God. And it. And it doesn't have stability at the bottom, right? It's held by logi. And that's how it finds its stability. So its stability is held in their purposes and in their higher things. So I think that, like, whether you use the word mind or it's like, I don't think that that's where the real debate is. I think. I think it's more about understanding the manner in which a system works and how, how to account for the fractality and the way that things fit into each other, you know, into. Into the mind of God. And so I think that ultimately we probably disagree. We didn't get to all the points of it. But I hope that we're going to have another discussion at some point. So I hope that in our next discussion we can address some of those issues. So that's why. So I think that the question of idealism. And let's say, at least in his case, you really have to just look at the system itself and stop worrying about. About what. What it. How can I say this? Because the category. He has all the categories, even though he thinks that they're bound, that they're held in mind, let's say. So he does have something like wood or table or. But they are held by. By mentations, by mental processes. That's how they kind of are held together in our perception and in the world. And so. So when he says something like matter doesn't exist, I think, how can I say it? It's like it's kind of a scandalous statement. And I understand why people react to it. But if you actually look at his system, he doesn't just mean that nothing exists. That's not what he means. And so that's why I didn't want to go into that with him. I wanted to go into the nitty gritty of the actual way in which all these things fit together. And I was really surprised, I was happily surprised to see that if I did it that way, that there was a lot more points of where we touched, our ideas touched, and where we could find some kind of. Some connection than if I had started to argue about idealism itself. So hopefully that makes sense. So Daniel asked. I spent some time with an atheist friend this week who I had not seen since becoming orthodox. He was curious about my conversion, but I feel as though we were talking past each other. He kept speaking to me as if I was a fundamentalist. Yeah, that's going to happen. I feel as though I didn't do a good job explaining the orthodox understanding of God. My friend even went as far as to say, the thoughts aren't real, whatever. How do you explain this sort of stuff to materialists and people who are so invested in science and empiricism? Yeah, I mean, you've got a long road ahead of you. I don't know what to tell you. I mean, I think there are tools right now. And so I think. I mean, obviously that's what I'm trying to do. So I'm sure you might be able to find toolkits in the things that I talk about, which is. Right. And so the idea of science and empiricism, when John Vervake and I talk about something like combinatorial explosion, the problem of multiplicity and unity. And so it's like, if you can bring someone into that space where they're thinking about that, like the fact that things exist both as all things exist, both as multiples and unities at the same time, that they seem to have parts and have unity together. That I think, I think that if you could start to get them into that space, then at some point they'll start to understand that they're like. The saying that thoughts aren't real is just the dumbest. I mean, it's such a dumb statement. It's like, but, sorry, I don't want to insult your friend or anything, but, but, but you have to. You, I think bringing them into that space, like, of understanding the necessity of consciousness and all that, it may be a way to kind of approach it. But, but I know the feeling, man. I know the feeling. And I also know like the kind of contempt or that look in the eye of your atheist friend that thinks you're some kind of an idiot and then them not knowing, not understanding what you're talking about at the same time. I know that feeling. And you really, you really gotta, you gotta, you gotta hold on to that, right? You gotta grab onto that and take it as like, joy. You really have to. Every time some like, materialist atheist looks at you and looks at you like you're a 10 year old and you're a superstitious idiot and, and you know, you're, you, you just gotta smile and you just gotta, you gotta really take it as joy because that's really the best way to do it. Or else, or else it's unbearable. You know, you, you. Okay, so explaining it, what I, what do I mean? You have to take it as, really as something like in this case, like with the person like that, you have to take it like I have a secret understanding. Like I have a secret understanding that this person standing in front of me, I have like, it's like I, I have this giant treasure, the secret treasure. This person like can't see it. They can't see it. And so it's like, that's what I mean by you have to find joy in it. Because especially if you've worked it out, especially if you know that these things are like, a lot of these questions and, and, and, and discussions are bring about the inevitability of, of, of invisible patterns, right? It's like, you know, so you just, so you just gotta, you just gotta take that as joy. Like, yeah, I've got this beautiful treasure and you can't see it. I'm sorry, man. Sorry for you, bro. That's all you could do. All right, so Jason Schweitzer asks when a Word is continually used. It seems to lose its elasticity and poetic nature and resolve into a type of prosecution. Does this happen with icons throughout the process of time and overuse of the icon, does it settle into an idol? And then history needs to. Needs the iconoclasm, the crushing to dust of the idol that the original thought once found, and the icon may again be set free to find a new yet similar form. You mean like icons in the church? Like, is that what you mean? Or do you just mean images? If you mean icons in the church, I mean, I mean, I guess I could ask you the same. Like, does the Bible become an idol? Like the icons of the church? You know, the types of the icons of the church have been really worked out theologically very profoundly. And so I can imagine that, like, let's say you can imagine that, for example, like a physical version of the Bible, you know, like an actual physical version of the Bible, like someone could come to treat it like an idol. Like that could be possible. And so you could maybe imagine like an actual physical icon that people excessively, you know, treat as if it's God itself or something like that. Like, I mean, I think that may be possible, but not the. I, Not. Not the Bible, like. Right. And not the icons. That is not the type, not the pattern that makes the particular ones exist. I don't think that that can become. Yeah, I don't think that can become an idol. Maybe. I don't know, like, if people get too caught up with like thinking that the Bible is God itself, which I see maybe possible. Yeah, maybe. All right, we're done. Look at that. 9:30. We didn't get to 10, so that's probably good. You know, we. We always go. Go sometimes too long with these and so. So, yeah, so thanks everybody for showing up. Thanks for. For coming along and. And we'll see you. We'll see you next month. And thanks everybody. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
