{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":12.56,"end":68.86,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So hello everybody. I am sitting here with Neil Degrade. Neil Degrade is a musician. He is the headliner for a band called Dirt Poor Robbins. But he's also done so much in the music world, written scores for movies, for different shows. He's been in several bands and he's also become quite a participant in the symbolic world. He is in contact with a lot of people that are kind of swirling around the videos. I've been in discussion with him for several. For like years now or like over a year. Over a year now. And we're also looking at doing some projects together. So I'm really excited to have him on the show. Mostly to talk about how it is that artists can predict the future."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":69.5,"end":185.22,"speaker":"Neil Degrade","text":"Oh, this is where I talk. If I was good at predicting the future, I could have predicted that. Oh, that's a good setup. I like that. This is a great topic. I guess I gotta give you a little background. Yep. So I. I was born into a family of entertainers and musicians. So both sides of my family pretty much across the board, all musical, all entertainers, most and many professional at one point. Really funny thing I like to tell people is that I found my parents marriage certificate and on the marriage certificate back then in the 60s, you had to put your parents occupation. So my dad's father, he was a radio announcer entertainer and my mom's father was a radio announcer entertainer. So there was a part of my. I think I was to be on the radio and just missed like stepped out of the stable and missed my calling. So. But it was a family of entertainers and so there was no question that I was going to learn music. It was going to be forced on me whether I liked it or not. And it turned out that I really liked it. So my dad used to bring home records from the radio station and the first one I ever get I think really explains what we're doing the best because he brought home two records for me and my brother to pick from. One was Kiss, and the other one was Queen. It was News of the World and my brother picked Kiss. And if you listen to Kiss and what they've stated their goal was, Gene Simmons says, we weren't trying to be the Beatles like every other band. We wanted to be Coca Cola. And that's like totally my brother. He's like brilliant with marketing and he's had an incredible career with that and he's kind of went off that way. And I picked Queen, which Queen I think was trying to Be an opera or a movie. And so that just blew my tiny mind. And the artwork on that record was like this Isaac Asimov take where there was this giant robot. I guess we could pull this up while I'm saying this, but was killing the members of the band. And it really tripped my little 5 year old mind out."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":185.38,"end":186.82,"speaker":"Jonathan Pageau","text":"5 years old listening to that."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":186.82,"end":198.18,"speaker":"Neil Degrade","text":"Yeah, man. Oh, dude. Yeah. That really just. That was it for me. That ruined me as far as being able to do anything normal with music. It all gotta be theatrical and cinematic from that point on."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":198.58,"end":198.9,"speaker":"Audio Clips","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":198.9,"end":222.49,"speaker":"Jonathan Pageau","text":"And that's an interesting aspect of your work which, you know, your bandpur. Robbins. There really is a storytelling aspect to the band. There's like a. Almost like you said, an operatic. There's some nostalgia. There's something melodramatic about the way that things are presented. And so I can really. I didn't. I wouldn't have thought right away Queen. But when you say it, I'm like, yeah, that makes a lot of sense that."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":222.49,"end":382.01,"speaker":"Neil Degrade","text":"Well, there are definitely other influences in there. So Kate is really. The band is myself and my wife. And we've used a lot of other incredible musicians and people play with us over the years. But Kate and I met when I was in my early 20s and she is really the other half of the band. She kind of taught me, I would say, how to write lyrics. She already had a music career growing. We met, she was younger than me, but I was this really poor guy living in Providence, Rhode Island. And there was a musical that was auditioning in town. It was supposed to be going to Broadway. And some people showed me some examples of it and I thought it was incredible. But I had like zero interest in being in a musical. So I did not want to audition. But I was hitching a ride with my friends and they said they would drop me off where I wanted to go if I would just audition with them, which was strange. So the audition was really weird because generally it's like, you know, you see these in movies where there's this panel and people watching. And that was there. But it was also in an old church in New England. So everybody waiting to audition was still in the. Was in the audience. So you're auditioning in front of all these other people, which I didn't care about. Cause I didn't plan on doing a musical. There was one part left and they were auditioning the male lead. And they were like going nationwide trying to find this guy. Well, I got up to audition and I decided my job was going to be to make my friends laugh. And it somehow translated as, like, confidence and composure and stage presence. And I had very little experience in musicals. And so the next day, I get a call, and they're like, hey, listen, congratulations, you got the part. And I was like, oh, that's so nice. I don't want the part, though. Like, you know, I'm sure you've got. There were a lot of people there that were great. I'm sure you've got them there. And then. And so I turned it down. And then the writer of the musical called me back, and his name was in Rico Garzelli. And he was really interesting guy, but he started. He started explaining to me a very strange angle as why I should do this. He's like, I cast you because you go perfectly with the girl we cast for the lead. He said, you guys are going to want to. You're going to want to MARRY this girl 100%. And I think there's going to be incredible chemistry. And she was from Los Angeles. She auditioned out in the West Coast. And I was like, well, maybe I could show up to a couple of rehearsals. So I said yes, and I showed up. And the first meeting I had with Kate, where we had to sing is she just got in front of me, and her part in this duet went first, and she started to sing. And I'd never heard anything like this coming out of someone's mouth. Three feet. It's really uncomfortable to have someone staring you in the eyes with complete confidence and just singing at you. And it sounded so amazing. I was like, I am in way over my head. I am doomed here."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":382.01,"end":385.69,"speaker":"Jonathan Pageau","text":"And so anyway, we just like, I'm gonna marry her. That's how I'm gonna do it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":385.69,"end":386.29,"speaker":"Audio Clips","text":"He was so right."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":386.29,"end":414.64,"speaker":"Neil Degrade","text":"He was so right. We got married, and we instantly started writing. She was a singer songwriter, and I was always in collaborations in bands, and she was like, a wordsmith. And so she instantly, like, turned my brain on to, like, that potential of music. Cause I was one of, like, those typical dudes that was interested in melody and music, But I was just like. Lyrics were just in the background of the song for me. And she, like, really gave me a love for that. So that's how really our band got started in our marriage and our kids. And so it's kind of everything."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":416,"end":417.36,"speaker":"Jonathan Pageau","text":"That's very fascinating."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":417.52,"end":418,"speaker":"Neil Degrade","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":418.64,"end":434.64,"speaker":"Jonathan Pageau","text":"One of the things that bring us here is because your last album is kind of causing a stir in the symbolic world. World, you would say, because you wrote it, what, in 2018? Or you came out. When did you write it?"}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":435,"end":619.5,"speaker":"Neil Degrade","text":"Okay, so I guess there's other background required is that all of our albums, all of our, you know, the last 10 years have been concept albums where I'll write a story and then I will record. I'll write down the bullet points of that story and the most important moments, and then I'll write songs for those. So it's a really. I really think art flourishes. When I have structure for me, like, when I know and I have an assignment and a boundary to play within, I will write within those boundaries. So I write the story, and then we fill in the blanks with the song. So we are wrapping up a record called The Ravenlocks in 2017, 2018, which was one of the things about movies and music. A lot of times it's written long before you ever record it. So the Ravenlocks is wrapping up, and I needed a new story. So 2018 rolled around, and this was a weird way to come up with an idea for a record. So you're familiar with Airbnb, where you rent houses and travel. So we had rented a house on the Gulf coast of Florida to go on a vacation. But right when we were about to leave for the vacation, like, a red tide had taken over, and they weren't letting people on the beach where the house was, and they were evacuating. There were dead fish everywhere. It was horrible. And so I was like, of course I'm not going to be renting this house. So it sounded like a nightmare. So I messaged the guy. I was like, of course we're going to need to get out of this. He's like, oh, that's fine, but he's not going to give us our money back. And I was like, oh, gee, that's an interesting turn of events. So I looked into Airbnb's policy on, like, why you could cancel. And so as I'm scanning through, one of the things was a pandemic. And I was like, I hadn't really thought about a pandemic. Our previous story, because we write lighthearted stuff, had to do with cholera a little bit. So I knew a little bit about how these things function. But as I was starting to read about what made something qualify as a pandemic, the story, like, hit me. And I was like, oh, my gosh. Do you. Like, there's a. I've had this concern that our society, we're already, like, the social fabric is disintegrating, and people are already pushing for a part. And if there was just some Kind of like even mild pandemic. Like, what would be the implications of that? So I just started writing a story about that idea. So, yeah, 2020 rolled around and we had released almost. We released our records in chunks, almost like a pulp thing, where we were releasing in EPs and everything, but the last EP had come out. But it was weird because, like, there were things that were happening directly in the headlines that we were singing about. And it is what it is. I didn't. Wasn't trying to predict a pandemic. I was just paying attention to the world. And I generally write and deal with subjects that are troubling me because I think I make music. And I've never been able to stop myself from making music because it's how I stay sane. So I use art to kind of ground me and explore the story because it's easier for me to see how something fits together when it all comes together as a concept within art and music than it is to just abstractly just imagine what the world's actually working like. So that was where Deadhorse came from."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":619.98,"end":648.97,"speaker":"Jonathan Pageau","text":"So in Deadhorse you have this story, but there's also not just a pandemic. There's this whole idea of kind of the edge of the world, how all of this is related to. And there's not just the pandemic, but also the reaction to the pandemic and this idea of a world that is kind of shut down and. And how this, like, kind of this prison of. I don't know, how can I say this, like this prison that makes you safe but then also takes everything away from you at the same time."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":649.61,"end":765.41,"speaker":"Neil Degrade","text":"Yeah, so, yeah. So what I did is I riffed on the idea of quarantine or a society that was riddled with series of quarantines for multiple reasons, from even reasons of personality, where ideologies were too different and people couldn't hear things they didn't like anymore, they were too fragile. And also the idea that people just saw everybody became a germaphobe and was afraid of what everybody else presented to them and the danger that presented, and also how companies would benefit from that and how all the new technology would benefit from that. So the story actually is this weird kind of like, I would say, like a Rip Van Winkle structure where the characters find the means to try to go into the future to escape what's happening. So it starts out in Dead Horse, Alaska, which is the namesake of the record. And Dead Horse, Alaska is in Prudhoe Bay in the north edge of the world. And that's where the Alaskan pipeline begins. And so the story starts when the Alaskan pipeline is turned on, and it's this power. And I, you know, I mythologized it. So they. I talk about that within the story as if they found, like, under some beast at the bottom of the ocean. And what were the implications of that thing and what were the desires of that beast? So as we moved into Deadhorse, you know, they go into the future, and they wake up 100 years later. I'm skipping really quickly just to get to the point of what you've asked, and that is that they wake up into a world. That's the world we live in now, but it's accelerated. So this pattern of spreading out, and everything's on a grid and everything's distanced, and people are, you know. Well, sadly, like they are now. We're communicating each other through a little window. Like, before we started, I picked, like, the best angle in here, and I put, like, my favorite gear in the shot, and so, like, gearheads would see it and, like, you know, all kind of breaking the wall. But this isn't what my life looks like. I mean, there's other angles of this trailer where I' pushed all the junk that I was working on. It was kind of a riff on some of these ideas and what that would do to personalities and people and also how technology would try to solve that."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":766.45,"end":828.49,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. So maybe we can look at some of the songs, because one of the things that I want to kind of bring about is this idea of pattern or pattern intuition. And so in 2019, I told people, get ready for 2020, because it's going to be crazy. And then some people later said, oh, Jonathan predicted the future. I'm like, I didn't predict the future. If you see a vase tipping on the side of a table, and then you tell people to watch out because it's falling, it's different. And I think that. I mean, obviously that's a simplified version, but I think there are some people that have an intuition about patterns. And so as you kind of look at the patterns and you talk about them, even without knowing it, you can end up doing something like predict the future without trying to do that explicitly. It's just this attention. Attention to the world, attention to patterns, and then kind of telling a story that ends up formulating this what's going on, even if it's implicit and it's not completely logical and understood yet."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":829.13,"end":1003.82,"speaker":"Neil Degrade","text":"Yeah, I mean, I guess before we dig into the story a little more that's really worth mentioning. So when we first got a record deal, we were making music independently. I was just making stuff on a computer at home, and it just started selling and I just quit my job. And I was like, oh, my gosh, this is going really well. And we did. The next thing you do is we try to find a record label. We had interest, and the problem with the record label was that they need to make money. And so what we were doing isn't like the most obvious way to make money. So there was this like, oh, they look at. They see talent or they see. They see something that's marketable, and then they try to package it within some kind of popular form. So there was this real push towards pop. And so my problem I always had when I was interacting with pop is I think I made my worst stuff because there's this tendency just to copy what everybody else is doing. You know, it's good when it fits the pattern, but you don't understand the pattern necessarily. So simultaneously, there was this other thing happening where it was kind of where I started seeing the world symbolically. And I didn't know it was a good way to see the world or the right way to see the world. I just knew there was power in it when it came to writing. So, like, what we talked about, you know, with this oil, and I personified the, you know, energy in the story. Or you could take. Cancel culture and you could give it some kind of monstrous description and describe, you know, come. Come up with some analogous ways that that monster might do the same thing. I realized there was so much. It was so much more impactful when I would take the patterns I was seeing and I would give them a will and an intelligence. And so that changed things. And also the other side of it that changed things is where we realized where we were going to be positioned as artists is that it was also. It takes place within a world that has a beginning, middle, and an end. And we, as we're writing, we found it was a way better sweet spot for us to imagine that this was the end. Like, it was that things were coming to a close and the pattern was about, you know, something new was ahead. So when once I started looking at this world in these symbolic patterns and, like, really starting to see monsters and, like, demons and things, whether they were there or not, I didn't know. It just. It suddenly it was like I had no end to the ideas anymore. It wasn't like I was trying to find an idea for a pop song. It was Like, I have more ideas right now than I know what to write about. It was changed in the way I was looking out of the window simultaneously. I was obsessed with Genesis. And the other part I felt was missing from the world was losing sight of what human nature was and why it was there. And I got obsessed with the story of the Garden of Eden because it was such incredible description of, like, these. These weird desires for perfection or to be divine or to be royal that we have, and that things shouldn't go wrong. And it just. It started to explain that in the story. So I always keep that story in mind when it comes to, like, how consciousness developed. And that interpretation of it is. I throw that over everything, whether people like it or not. Like, it's that."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1004.06,"end":1046.38,"speaker":"Jonathan Pageau","text":"But it doesn't necessarily. Because you. You've internalized it. It doesn't necessarily appear that way. This is one of the things, too, that even in the discussion with my brother Mathieu, sometimes. Sometimes we would say something. We would think, like, oh, that's too obvious. Like, it's too obvious if we say something this way, or if we say it this way, it's too obvious. Then you realize, no, it's not. It's actually not. You see the connection. Like, if you're using analogies, you think that it's the same as something else, but people don't necessarily notice it. And so if you take the story of the Garden and you superimpose it over another event, most people won't see that it's the story of the Garden. Like, they'll just see that it has this amazing coherence to it, or this strange, intuitive coherence to it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1046.78,"end":1113.2,"speaker":"Neil Degrade","text":"Yeah. And people are so. I think they're just. We're sitting on top of so many things we didn't invent. We're sitting on top of so many things we used to have to do ourself. We're so detached from how we get our food and how even the car we drive operates or how it's built. We can't repair it. I can't fix the computer I'm using. We're sitting on top of all this stuff that just. We start to reason as if that's the actual starting point for reality. And all kinds of errors are being made everywhere. Where. Even. Especially in the political spheres. When you listen to the different ends of the political narrative, it's like it's totally detached from the substructure of what being is itself, what it means to be a person in this world. It seems so inorganic now. It's starting to. It causes a little bit of panic in me when I realize how people see themselves and what they think we are sometimes. And so really, the record at the end of the day is a discussion of your nature and what you're ignoring. Again, that wasn't my intention. But when I look back at it, it's trying to drive to the bottom of why you do what you do and why you want what you want, because we don't question those things nearly enough."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1114.72,"end":1130.42,"speaker":"Jonathan Pageau","text":"All right, so I want to look at some of the songs right now because I think, because we've been talking about it abstracting, people are going to. Are going to see right away, especially people that have been following this channel, are going to kind of see the patterns pop out. And so did you have a song you wanted us to start with particularly?"}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1131.22,"end":1157.6,"speaker":"Neil Degrade","text":"Okay, so I. Well, I guess this is worth mentioning. I hijacked Jonathan's Symbolic world intro with a song, and the song is called Saints 1. So you've already heard the introduction to that song. And I guess we could start there. Cause I think that's an interesting one, because right after I released that, I just thought it was my idea for a story. But then Tim Cook from Apple came out. That's his name, right?"}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1157.6,"end":1158.6,"speaker":"Jonathan Pageau","text":"Tim, yeah, Tim Cook."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1158.6,"end":1159.24,"speaker":"Audio Clips","text":"Yeah. Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1159.24,"end":1176.59,"speaker":"Neil Degrade","text":"He literally just outlined the idea just straight. I was like, oh, okay. It's a weird moment when you do this, because let's just say you're gonna come up with a prediction of the future, and it's not so bright. There's a weird moment of satisfaction you have when you're like, aha, I was right. And then you're like, oh, no, I was right."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1176.59,"end":1177.11,"speaker":"Audio Clips","text":"Oh, no."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1177.99,"end":1181.87,"speaker":"Jonathan Pageau","text":"It's like, here come the Terminators. I knew it. I knew it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1181.87,"end":1182.15,"speaker":"Neil Degrade","text":"Great."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1182.23,"end":1182.79,"speaker":"Jonathan Pageau","text":"Wonderful."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1183.99,"end":1184.47,"speaker":"Neil Degrade","text":"All right."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1184.47,"end":1192.07,"speaker":"Jonathan Pageau","text":"And so let me read some of the. Some of the. So tell me the concept of the song, first of all, and then we can look at some of the actual lyrics."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1192.23,"end":1251.84,"speaker":"Neil Degrade","text":"Okay. The song is interesting because it intentionally steals Christian imagery of the saints and redemption and absolution. But it's being used in a pattern to advertise this technology that is supposed to solve your felt needs. So the needs that people are trying to solve now are generally this idea, and Tim Cook says it in his speech that it's immoral to despair or it's unethical to despair. This is this way that technology companies look at you or even anybody selling a product to you is. This is here to make you feel better about yourself, feel better about life. You Know, to give you, to take you one farther step down that red carpet towards your throne. And so what happens is that this abandoned structure in the world where people used to venerate saints and they decide to. Well, they come up with an acronym, S, A I N T S and it describes the technology."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1252,"end":1254,"speaker":"Jonathan Pageau","text":"And acronyms are so wonderful."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1254.24,"end":1254.76,"speaker":"Neil Degrade","text":"Like they're."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1254.76,"end":1259.51,"speaker":"Jonathan Pageau","text":"So acronyms are like one of the diseases of the modern world are these acronyms."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1260.22,"end":1304.6,"speaker":"Neil Degrade","text":"Well, and so part of you talk about this in your channel, but people can't help. So when a powerful thing gets abandoned, you know, people will pick it up and use it for whatever they can. They won't understand the purpose of it, so they'll abuse it. So in this song, it's basically this world where everybody's detached and so fragile and separated from connection. They're like, well, we're not going to get them back together with people that doesn't work. So we're going to create this AI, this embodied technology that's going to go and it's going to solve their felt needs. It's going to Oprah Winfrey their self esteem. And so that's what the saints is. And so this song is like they're opening ceremonies for the revealing of this technology. So that's. It's their propaganda is how I would see it in the story."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1304.84,"end":1305.16,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1305.16,"end":1305.64,"speaker":"Audio Clips","text":"Exactly."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1305.64,"end":1306.6,"speaker":"Jonathan Pageau","text":"All right, so here we go."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1308.76,"end":1393.04,"speaker":"Audio Clips","text":"Each day you wake up with an aching for something to set you up. Heart. Strip the scales from your heart. It never comes and go. A hostage tied up by its nature it can't happen. She needs claws. A beast with desires of God. You become, won't become. From an unlikely place. Redemption has come from a once abstract space of zeros and ones. And for resolution your absolution nowhere. When the saints go marching I want, wanna be in the way."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1403.11,"end":1473.62,"speaker":"Jonathan Pageau","text":"I mean it's pretty wonderful to see. Like the imagery is really powerful. First of all, this idea of. This idea of you want to be special, you want to be set you apart. And it's a great way of saying it because it actually. That's what being holy is, right? When you say something is holy, we say it's set apart. And so you have this desire to be holy and to strip the scales from your heart, to remove those outer garments, you know, and get to the middle. But then you realize that it's this factitious thing that they're presenting. And it's also this idea. I love how it's like I want to all of a sudden this idea of when the saints Go marching in and says, I want to be in their number. And then it talks about. The light begins to shine. All of a sudden you realize this weird kind of 666 image, right, of this. Of this total system that will identify you, that will name you, that will shine its light on you and make it impossible for you to hide. Like you said, to hide in any form of negativity. It's like, we're gonna make you happy by whatever means necessary."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1474.42,"end":1474.82,"speaker":"Neil Degrade","text":"Right?"}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1477.06,"end":1494.31,"speaker":"Jonathan Pageau","text":"That Simpsons episode with Ned Flanders. There's the Simpsons episode, like Halloween episode where Ned Flanders takes over the world and he has re education seminars where everybody has to say that everything's okay. And they force them into smiles. Like they pull hooks their lips up into smiles."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1494.39,"end":1535.59,"speaker":"Neil Degrade","text":"That's exactly it. That's exactly it. Well, because, I mean, the reality is that these narratives are detached from how things really work. And so every person who doesn't fit the narrative is. Is evidence against it. So that's why you have to force conformity, because the reality won't conform to this idea. So you have to use muscle. It's like, you know, there's an autopilot heading in a different way, and you. You don't want to go there. And so you have to muscle up and see how long you can hold the wheel going in a different direction. And so that's what happens in these. This totalizing system is that it just. It doesn't work. People break from the inside out, even if they can't get at each other."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1536.21,"end":1580.42,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And you can see it now because it's creating these weird side effects that I guess they probably haven't planned for. And now they're constantly trying to patch over and to compensate and to actually. While they want to kind of include everybody, to make everybody part of this total system, then they nonetheless end up having this strange desire to totally exclude those that want to be in the system. That's the problem. That's the problem with this kind of system is that because it presents itself as this totalizing system, then those who don't want to be in the system, they're not human or they're barely human. They don't have a place."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1581.22,"end":1590.1,"speaker":"Neil Degrade","text":"Well, you can't have equity if you're around other people either. The problem is the more things you equalize, the more the things that can never be equalized. Exaggerate."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1590.34,"end":1590.5,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1590.5,"end":1651.72,"speaker":"Neil Degrade","text":"It's just. It's just what happens. I mean, like, one of the jokes I make with people is like, a world that's trying to. Let's just say men and women are all the same. Is a world that also suddenly it's like cool to have a beard. And it's like, well why did that happen? You know, should we all be clean shaven? But also there's. Yeah, there's this. Well, the notion is so like just thinking down this idea is that if you don't deal with the problems in their, in their traditional places, we dealt with problems. Now you have to. So you don't know where the problem lies. And so everybody's a problem. So you have to treat everybody as an equal offender of being diseased, as being a potential insurrectionist. You want to say it that way, like that everybody's a problem. So everybody has to get away from each other. And that's the problem with that system is the end result is if you really try to stick to it, eventually you have to isolate everyone from each other to actually have equal. Because otherwise you're going to just observe inequalities that exist through any difference anytime there's a difference in something."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1651.88,"end":1691.08,"speaker":"Jonathan Pageau","text":"But your insight on that is so good because it's almost happening kind of on its own in the sense that I can't imagine that some people, maybe there are people that evil that are sitting around and thinking we need to isolate everybody from each other as much as possible for our system to function. It almost happens organically out of the necessities, their desires, which is like. Because they want this thing, this kind of. They want everybody to be included. The only way they can do it, like you said, is to actually limit real interactions between people because in those real interactions hierarchies will appear inevitably. Like you can't avoid it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1691.88,"end":1808.32,"speaker":"Neil Degrade","text":"So now there's still one of the things they realize with the technology that there is too much individual variation in between people. So they do. Almost like what you do when you try to hack a pop song is where you try to find the commonalities and you try to come up with something universal. I think a really funny version of that is on the show Lost is there this band called Drive Shaft. And their one hit song was called you all, Everybody. And it's like the most generic. Who does that not include you All Everybody. And I just thought that was a really perfect idea of when you try to hit the lowest common denominator. So they can't properly produce an intelligence that is reactive enough to everybody with their traditional means. So they outsource this idea to the collective knowledge and like the, you know, summarizing look at all of the books that have been produced and the songs. And so the computer just collects everything and tries to understand it that way. So it just looks at what everybody. How everybody's already defined things and then uses those definitions and adapts. So in the story, there is a group that's kind of like a Knights Templar group that, you know, that protects the Holy Grail. And Indiana Jones would be the way most people know about that idea. But there's this group that sort of hates this technology. And they're sort of, like, vanguarding this. And so they decide to take it down, or they try to take it down or break it by using ambiguity that's naturally in language. So they find the ideal word to mess with to break the technology. And that word is heart. Because the heart is. Well, it's the center. It's an actual organ in your body. And it's almost the same way in every language. Every language uses this the same way, but it has to do with affections. It has to do with things. And so they realized the best way to break the system and break the program is to mess with the idea of the heart. And so then all hell breaks loose in my story once this bug is introduced."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1809.44,"end":1820.08,"speaker":"Jonathan Pageau","text":"All right, so second song we wanted to look at. It's called it tore your heart out. And here you really get this. You really get this vision, which is powerful. So read a little bit of it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1822.64,"end":1824.72,"speaker":"Audio Clips","text":"A century in the plague."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1828,"end":1829.2,"speaker":"Neil Degrade","text":"A suburban."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1829.28,"end":1896.62,"speaker":"Audio Clips","text":"For the living dead Locked alone in the lavish homes with dancing wings and a bloated throat Such a beautiful shine to your skin who tell you from your skin you say communion now you come is the void Understand why you want why you want what you wanted."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1899.16,"end":1937.39,"speaker":"Neil Degrade","text":"All right, well, gee, this one was. This one was freaky because I had recorded it and I hadn't. I was just about to release it, and it was. I think it was like March 13th or March 15th. And then it was like, oh, we're all locked down in our homes. And I was like, oh, gee, this is a problem. And I. So I was looking at it, and I was like, oh, man. Well, at least I had my head on straight is what I thought. And I felt like I had some kind of. Well way to look at what was happening outside of just. I never believed 15 days to flatten the curve. It never even occurred to me that that was what was going to happen."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1937.39,"end":1938.91,"speaker":"Jonathan Pageau","text":"Yeah, you're like, there's no way."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1939.07,"end":1983.93,"speaker":"Neil Degrade","text":"There was just no way. It was like. Because, like you were saying, you don't have to be conspiracy theorists to realize where the opportunity lies in any given situation. You don't need a group of people planning behind closed doors to plot against you, because people are just going to go where the money is. And so money is going go to the world that can. A world that's isolated. So, you know, Zoom went through the roof, and, you know, Amazon, of course, all these companies really benefit from this, and there's incentive for them to just keep making it easier and easier for us to live like this. So I didn't. I wasn't fooled by that for a second. But, you know, if I was going to break that down a little bit, what's interesting to me is I use this imagery, is they're locked alone in their lavish homes with pets and wigs and their bloated thrones. So that's the idea."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1984.01,"end":1989.43,"speaker":"Jonathan Pageau","text":"Such a great image. Well, so much. There's so much to dissect in that. In that sentence."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":1989.91,"end":2028.62,"speaker":"Neil Degrade","text":"Well, everybody's going to become a fop. You know, it's like, if you don't know what a fop is, just go back and look at the signing of the Declaration of Independence and wonder why these grown men were wearing white wigs or watch Mozart. You can find out about that Turkish fashion movement. But so, I mean, with your filters and all the things people use, it's like, yeah, I have this really controlled view. And like, oh, man, this guy's life is great. His studio is awesome, except for the mess over there. And so that was. The thing is, like, I just envisioned. I'm like, if you keep people in a place where the only time they see other people is through a little lens, it's. They're. They're going to spend all of their resources and time into that window."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2028.7,"end":2029.18,"speaker":"Audio Clips","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2029.5,"end":2055.61,"speaker":"Neil Degrade","text":"And so, you know, just thinking about that, and I realized other things about it once I started living in that world. It's like, you know, I'm in public, and the only time I'm in public, no one, My identity is veiled. So when I'm actually with a person, my identity is veiled. But then when I'm with you, it's not only am I not, it's my full identity, it's a hyper identity. Because I'm looking in a mirror. You know, I put it over here so I'd have to do this to look at myself. But you're looking in a mirror. Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2055.61,"end":2056.77,"speaker":"Jonathan Pageau","text":"While you're talking to someone else."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2056.77,"end":2064.41,"speaker":"Neil Degrade","text":"Everyone, like, the proper psychological studies have not been done on what the impact of that would be."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2064.41,"end":2064.85,"speaker":"Audio Clips","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2065.09,"end":2067.25,"speaker":"Jonathan Pageau","text":"Talking to someone, but seeing yourself at the same time, man."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2067.25,"end":2071.75,"speaker":"Neil Degrade","text":"It's a horrible, horrible idea. It's like they're. There should be a fairy tale about it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2072.39,"end":2214.02,"speaker":"Jonathan Pageau","text":"But there's something about this paragraph which. It's just so powerful in the sense that. So the name of the song is it tore your heart out. And that's in the chorus. And so if you tear someone's heart out, if you tear the heart out of something that is the center, if you tear the middle out of it, then what you're describing is such a powerful kind of modern version of what that would look like. First of all, this idea of the suburban hell for the living dead. So the suburbs are not the city. They're this ambiguous margin of the city where everything becomes this. Like, I've talked about this before, right? Everything gets spread out and there's no center. There's no reason besides just kind of being these independent points on a map, basically on a grid. This, like, spread over a piece of toast, kind of. And so that is a form of living death because you're there, but you can't see the reason. You can't understand why you live next to these people, right? There's nothing bringing you together besides just the factuality of just being in a line of people on a street. So then being alone, obviously, but also being the idea of pets and wigs. It's such a great image because it has to do with the hair. It has to do with the extremities and these dead things. Because this animal part of us. It's also talking about kind of being stuck alone with your desires. In the sense that it's like you're there and you don't have communion. So you end up also going into. You're in the danger of falling into idiosyncrasy, right? And that's what the foppish aspect of it, too, is like going into these weird, idiosyncratic aspects of what it means to be human. And then coming to it, then to, say, pure devotion to your skin. Which ends up being what this is all about. Like this being stuck in this outer periphery alone in the periphery, in the edge of the wheel. Let's say you're stuck on the edge of the wheel. And then you compare it to the opposite, which is you flee communion, which is where you find the heart. And then the cup is void. And I say it's just a perfect. It's such a perfect thing."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2214.18,"end":2214.86,"speaker":"Neil Degrade","text":"It's crazy."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2214.86,"end":2222.42,"speaker":"Jonathan Pageau","text":"Like, I said that you wrote that. I mean, I guess you could intuit that, like, even if there wasn't like a plague that happened, that this was already going on, it was already going on."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2222.42,"end":2347.74,"speaker":"Neil Degrade","text":"Yeah, that's it. I'm like dealing head on with something. It's just where things were going. That's the trajectory of things. It's like what you're doing is that same thing you do on the sats, and they're like, they give you seven numbers and the next three are blank. And you have to figure out the pattern, right? And obviously there's more factors in life than just this number sequence, but it's the same thing. It's like, yeah, like this is where we're going. This is what all the technology is allowing us to do. People are tough. People are a problem. As long as people define their life as going wrong, anytime they have any kind of struggle or that, like, you know, God's favor has left them. If anything's difficult, you're. That's the man. I could sell that person anything, right? So that's part of the problem with this, is that the idea, it tore your heart out, you know, because you didn't understand why you want what you wanted, you know? So I met someone the other day. Well, someone I actually knew before this. But they had lost their sense of smell and taste from this, you know, this Covid flu thing going around. So they, they were like, they're in perfect shape. It was so, so silly. They said this. They're like, you would think I would lose more weight since I can't taste my food. And I was like, no, you have to swallow your food. Like, it's weird. Like nobody thinks about this anymore. Like swallowing is the, is more important than the food's taste at the end of the day, because go to your favorite restaurant. Like, just if they ever let you do this. But you'll never do it. But go eat. Order your favorite thing and chew it up and spit it in a bucket and tell me how good of a time you had. So there are things in life that are fat, that take longer to develop than meals, that, where if you didn't swallow your food at the end, like there might be, you know, one of the things I might realize about myself is one day I might look back and like, I didn't have grandkids and I might feel like I, I didn't swallow life, like that might hit me different, you know, as I, as I'm older and so now I have kids. But there's also other weird things. Like, you know, when you get hurt, like people don't understand, like Even what's going on inside of them because they think it's all made up. But, you know, if you stub your toe on an object, you. You have a weird thing you do where instantly you. You assign a will to that object that hit you. It's like it did it on purpose. You want to kick it back."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2347.9,"end":2348.38,"speaker":"Audio Clips","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2348.46,"end":2434.41,"speaker":"Neil Degrade","text":"You have to stop yourself from destroying yourself. Because that's that weird vengeance narrative we have that only destroys us. But also at the same time, people don't recognize when they're hurt. They feel isolated. They like you. Boom. You zoom out from the rest of the world and you're alone and they don't understand. Suffering and loneliness go hand in hand. So there's this lack of understanding of what's really going on in our nature, and we don't question it enough. I think that Garden of Eden story is so great because I read Hymns in Paradise, and when I read Hymns of Paradise and I think I told you this, and I ended up writing a song on this record about it, it was this idea that was like, oh, it was like I remembered something I was trying to remember my whole life or reminded me of something I was trying to remember. And there is this sense of where we have this evolution story going around. And I'm not anti evolution at all, but I don't think the story says enough. Because there are all kinds of desires we have for paradise and for perfection and for completeness and for things to never go wrong that just don't make any sense. Were these squishy animals running around. And then I read this story and suddenly it's like, yeah, we're like, mom died in the beginning of the Disney Princess story. And we're trying to solve that problem. And so people don't know why they want what they want. And if they really believe that anytime something isn't going their way, that that's wrong. Right again, you could sell them anything."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2434.49,"end":2482.63,"speaker":"Jonathan Pageau","text":"So then it brings us to the next song that I wanted to look at. It's called But Never a Key. And then this song really looks at the problem, or let's say the problem that the opportunity of safety gives and like the problem that we have right now, which is to see safety as the ultimate value and to see this kind of safety and pleasure too. Like this kind of idea that if you're safe, you can have your little pleasures. And I hear even the politicians talk about that. It drives me insane. Like here in Quebec, they're like, well, it'll be okay, you know, you can just you can have naps and you can watch TV and you can play video games and it's like, you know, you can get the rest that you've always wanted, right? You've always wanted this. So it's like you can. You can get that nice little pleasant life that you. That you wish for. So let me read a little bit from this."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2491.46,"end":2521.52,"speaker":"Audio Clips","text":"Need these flowers they've revoked the horrors your tragedy now ends happily and I'm sure that they won't be done Till they fenced off the ledges around the edges of all that goes wrong."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2524.32,"end":2525.2,"speaker":"Neil Degrade","text":"For you."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2533.52,"end":2612.71,"speaker":"Audio Clips","text":"The days where you're endlessly racing towards Pavlov's reward now your mazes replaced by the locked door you asked for Though that's the way that it goes I'm sorry you'll never be free if all that you see is a danger the cage will release oh, no that's the path that you chose the true hest indeed so don't lift a finger your word and provides all you need but never again but never again."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2625.69,"end":2626.49,"speaker":"Jonathan Pageau","text":"Yeah, it's awesome."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2626.57,"end":2627.29,"speaker":"Neil Degrade","text":"There it is."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2629.13,"end":2635.29,"speaker":"Jonathan Pageau","text":"Yeah. It's such an amazing. I mean, it's really amazing to see that you wrote this several years ago."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2635.45,"end":2637.45,"speaker":"Neil Degrade","text":"Yeah, I mean, that came out in 2019."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2637.77,"end":2654.39,"speaker":"Jonathan Pageau","text":"Yeah. So, I mean, but it's also not that long ago that it was right on the edge of the pattern. Like, it was riding the edge of the pattern so that when things started to happen, it was like it was that thing in that thing ahead of you that was telling you to watch out, that you didn't listen to when you should have."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2654.79,"end":2712.36,"speaker":"Neil Degrade","text":"Yeah, no, I cried when I wrote that too. It's so sappy. But this thing hits me every once in a while where you condense something into what feels like the right idea. And it's like, I think something's profound when it's like you saw it, but you didn't have the words for it. And then someone comes up and they say it in a real concise way and you're like, the light bulb goes off. But not because you weren't already seeing it. You were seeing it. So when I wrote this, it just hit me. I was like. Because obviously all these ideas are present beforehand because again, like this, everybody is just so concerned about it being in a pleasured state. And there's so many things on tap that can, like, you can just satiate so many different things without any hesitation. And so when I wrote this song, it's like, yeah, I mean, this is what's happening. People are going to accept A cage. That's where we're head. If something doesn't happen different, this is what's going to happen."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2712.36,"end":2721.68,"speaker":"Jonathan Pageau","text":"Yeah, I mean, it's already there. It's there right now. I would say it's just like. It's like maybe we have the sense that it's going to stop, but it could get worse. It could get a lot worse."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2721.68,"end":2810.68,"speaker":"Neil Degrade","text":"It could get a lot worse. So Daniel Keys wrote this story called Flowers for Algernon. And he wrote the story based upon experience he had with a real life student who had a brain injury who he was teaching to read again. And then they went away for summer break and the student came back and the student had forgotten everything and he was devastated. And he went and wrote the story Flowers for Algernon. If you haven't read it, I would check it out. Really great book. It's funny that it's called but never a Key and his last name is Keys. So one of the things they tried to do when he went to publish it is everybody was like, oh, what a great story. What a cool sci fi story. Yeah, just make the ending happy and we'll run with this. And he refused. And finally someone published it and it was like a Pulitzer Prize winner. And then they wanted to make it into a film in Hollywood. I think the film's called Charlie. And they're like, yeah, we're just gonna make it have a happy ending. And he's like, no, it's not real if it has a happy ending. So he wouldn't sell it until they made it his way. And so the whole idea here is that this idea of the devouring mother that, okay, kids had seven cupcakes, but here comes the eighth and he wants it. And you can't say no because you think your job is to keep everybody. Like you've sinned against someone if they are upset with you. So that's. The whole idea is like we're going to, you know, you just look at. If you're old enough like us. So you can see that there used to be. Not used to be rails on certain things and they didn't force you to wear seatbelts. And some of this is good, but also like everything's getting padded out there."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2810.84,"end":2811.52,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2811.52,"end":2811.88,"speaker":"Neil Degrade","text":"I love."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2811.88,"end":2814.44,"speaker":"Jonathan Pageau","text":"Until they fenced off the ledges and rounded the hedges."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2815.72,"end":2833.03,"speaker":"Neil Degrade","text":"Yeah, right. So that's. It's just what's happening. It's like that's, you know, that's too. If you're in like politics, you've got to look for the sharp, pointy Objects sitting out there that are still left. So you have a purpose. Yeah, right. And somebody like you said, it's already there."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2833.03,"end":2857.63,"speaker":"Jonathan Pageau","text":"So, like, I think I might have told the story on the channel before, but I. One of the things that. When I was. When my kids were younger and we go to the park, there's this one moment that hit me, like, it just hit me so hard. I saw there were these children and this child was playing in the park. The child starts running, and then the mother says. Or it was the father. I don't remember if it was a man or woman says, don't run, you'll fall in a park."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2858.03,"end":2858.83,"speaker":"Neil Degrade","text":"No, I've said that."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2859.23,"end":2865.63,"speaker":"Jonathan Pageau","text":"What did you just tell your child not to run because they will fall. That is the most insane thing I've ever heard."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2865.95,"end":2869.95,"speaker":"Neil Degrade","text":"Yeah, it's grass. It's like, that's fine to fall on grass. That's where you do fall."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2870.67,"end":2883.95,"speaker":"Jonathan Pageau","text":"Exactly. They better learn to fall there. All right, so. Last song I wanted to look at. All right. Obviously, it's a perfect song to also. To finish off our analysis, it's called no Land Beyond. And here's part of it."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2885.23,"end":2948.64,"speaker":"Audio Clips","text":"If you don't know why the bell tolls, you'll only hear the church. If you don't know the language Rain."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2949.78,"end":2951.38,"speaker":"Jonathan Pageau","text":"When the world is upside down Follow."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2951.38,"end":2955.54,"speaker":"Neil Degrade","text":"The fool for solid grand. That's awesome. A very pigeonian line."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":2955.54,"end":3007.68,"speaker":"Jonathan Pageau","text":"Very pigeonian line. But it's great because it also talks about this idea that this problem of not knowing the language or the language falling apart, like to say, the sacred language falling apart. And then people not being able to recognize the patterns. And then at that moment, it creates this madness because people don't know what's going on. They can't recognize, you know, the world's falling apart, but they don't understand why. They can't see it. If they could only they only knew the language, then they wouldn't notice that this is part of the story and this is where we are. It would give them some strange comfort to be able to at least realize what's going on, to limit the side effects or limit the adverse effects of being in this pattern. And then, of course, at that moment, like you said, there's only one last thing left to do."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3008.56,"end":3191.11,"speaker":"Neil Degrade","text":"So one of the things is. So what? I saw this part of the song as I did it as a canon, because these are things, I think, that are swirling around right now. These are problems that are swirling around right now. And every once in a while, there's this one little light that pops up and there's so many stories that just seem so politically driven and. And the world is filled with so much mush that it's like people don't understand the structure of reality or how to see it. Because again we're sitting on top of something so inorganic. But the fool in there is like this idea. I tell a story. It's like if you're ever stuck and you've run out of ideas and you need to make a decision and nobody has an idea. You look for the most foolish person in the group and you get them drunk and you listen to them. It's this idea like when. Cause everything's so. Everything's so counterintuitive that it's like oh, the person who is the anomaly who's saying the thing that doesn't fit the system might actually have the answer for this broken system. So that's part of the. In the end we're all mad men. Is that one of the ways I see life is like. You know, this is another type of womb. Like we had. We were a child, we were in a womb. And there are parts of us we don't need yet that are there. You know, so it might be. I don't remember being a baby to you, but there might be parts where it was awkward to have legs and arms like. But that you need in life. And there's this moment where right before you're born where it's the least hospitable space. You're just. You're scrunched in there. And life kind of works like that too in the sense that there are still things that are in us that we don't know what they're there for and we don't know why these desires are here and there's. They're on the other side of a thing we can't see yet. But. So part of where I was like realizing like the power was in us writing about the end of the world all the time was that that's what life feels like. We're crunched up against the edge of this thing. We're just. We're and that things make less and less sense. Our bodies are changed by this technology. We don't understand how this technology has really shaped our body away even to want things that aren't a part of our nature. So I think that that's the. In the end we're all mad men is that there's that moment of birth that's ahead. Like you want to look at it that way. It's like Just doesn't make. It's not good for anybody in that moment. It's not good for the mom. It's not good for the baby, like, but it needs to happen. And we seem to be at this point where everything's just getting crushed, and then the next thing is just around the corner. So that's. And then our life also, like, I mean, when you talk about looking at patterns, our life is just, you know, our every day is a really good example of what your life is like. And the way you wake up, you get to your feet, you become aware, you get energy, you run out of energy, you get sleepy, and you lay down. That's a life in general, too. And so the world just seems to be, like, right there. It's like, run out of stuff and it's. Everybody's getting lazy and weird and stressed and crunched. And meanwhile, we can satiate all of our desires. And so it's just. The madness is abounding."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3191.27,"end":3192.19,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3192.19,"end":3192.55,"speaker":"Audio Clips","text":"Yeah."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3192.55,"end":3206.34,"speaker":"Jonathan Pageau","text":"Like you said, it is. It's like it's the end of the day and. And that's the moment where people don't know what to do. And so some people will play games, some people will get sleepy, some people will try to satiate themselves, just put."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3206.34,"end":3207.78,"speaker":"Neil Degrade","text":"The TV on until they fall asleep."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3207.86,"end":3245.3,"speaker":"Jonathan Pageau","text":"Exactly. And so it definitely feels like where we are. But I think that I really appreciate you kind of positing it as this hope, as this capacity through the pattern to be able to see beyond this. This first veil that appears to us. Because sometimes I get lost and I get discouraged because all I see is the breakdown. And I don't realize, like you said in an absolute truth, which if there's a breakdown, it means that there's a resurrection on the other side. And so if we can keep our focus on that, then all of this madness won't be as difficult to bear."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3245.7,"end":3270.16,"speaker":"Neil Degrade","text":"Yeah. Too. For artists and just the average person, too. I mean, there's no less good in the world. It's just in fewer and fewer places, which means that when you see it, hopefully it shines brighter. So, like, that's the hope at the end of the tunnel, is that as people kind of give into this hedonism and this self indulgence is that it just makes what's good left shine brighter so it stands out."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3272,"end":3299.13,"speaker":"Jonathan Pageau","text":"All right, Neil, this is awesome. I really appreciated it. And so I would say, everybody check out Dirt Poor Robbins. We'll put all the links. I hope you appreciated this. I'm excited for the things that are coming down the line. We have some announcement to make very soon about some stuff that Neil and I and other people that you know are working on, so we're excited to announce that very soon. So stay tuned to that. And Neil, I wish you the best in everything you're doing."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3299.45,"end":3299.97,"speaker":"Neil Degrade","text":"Thank you."}
{"episode_id":"SW - #151 - 2021-04-02 - Neil DeGraide - Can Artists Predict the Future -","start":3299.97,"end":3366.9,"speaker":"Jonathan Pageau","text":"It's good to talk to you. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau Videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
