{"episode_id":"SW - #102 - 2020-06-03 - Mythic Patterns in Mario Games Pt 1 - The Arcade Origins","start":0.16,"end":1142.92,"speaker":"Jonathan Pageau","text":"Originally created by visionary game developer Shigeru Miyamoto, Mario games have been one of the most successful franchises in the video game medium, with titles still being made today and origins stretching back to the very early arcade games. In the past few years, countless people have asked me to make a video on the symbolism of this or that video game. Usually those with exhaustive mythologies like Warhammer or Elder Scrolls. However, by looking at the structure of the early arcade Mario games and then moving to Super Mario Bros. We will be able to unlock the most basic elements of video game symbolism and how it connects to universal patterns. Hopefully, this will give all of you a few keys for looking into other games as well. This is Jonathan Peugeot. Welcome to the symbolic world. Our best games endure through time because they're microcosms and ritualized versions of some basic pattern of reality. They permit us to engage with the structure of the world, whether it be hierarchy and other upward and downward movement like chutes and ladders, competition in war like chess or team sports, or the excitement and surprise of fortune like dice or card games. While in our lives war is bloody, costly and destructive, chess and football provide a boiled down ritualized experience and practice of the same pattern without the egregious consequences. In video games, we experience effort, perseverance, adversity and adventure in cycles. As worlds or levels begin and end, we're celebrated for our success and death is most often the image of our losses. There have been different iterations of Mario from the early beginnings, often marking the progression of video games through technical feats and even content elaboration. For this reason, these games are some of the best for discovering a basic sense of of video game symbolism. Of course, we all mostly came to know Mario from the classic Super Mario Bros. But to understand how it all comes together, we need to start with Donkey Kong. In Donkey Kong, a giant King Kong like ape kidnaps your beloved and holds her at the top of a series of ladders and obstacles which represent a kind of tower in construction. Playing as Jumpman, the pre named Mario and a regular construction guy, you must ascend to the top of the level to be joined with her again. This reunion is short lived as when you reach the top, the ape grabs her and ascends higher up the tower. Each of these ascents leaves you at the bottom of the next level where you must climb again to reach her once more, arriving at the very top of the tower. The final level consists in removing the studs from the tower so that the ape is cast down and you can be finally United with your beloved for good. The first thing to notice in Donkey Kong is that it's arguably the first video game to integrate a clear, progressive narrative of character arcs within the game dynamics themselves. Although some prior games have had characters or simulation structures, Donkey Kong had a clear character relationship and a story progression. It's one of the most simple, yet mythic story structures, of course, ascending through levels and trials to save the girl. Now, the idea of the unattainable feminine has been a narrative pattern and a motivation for human improvement since the medieval chivalric code. According to late medieval thinking, desiring and reaching a worthy feminine character pulls the hero into an adventure that makes him a better version of himself. In this case, the muse, or the heavenly feminine appears as a stand in for the game itself and its resolution. As you master the game in order to win, that is, as you become a better player, the ideal of the game, just like your ideal feminine, keeps getting pulled higher and higher. The game gets harder, but the value of attaining your beloved increases as well. We can see that in a very crude form, by ascending a tower, Donkey Kong followed the same pattern as Dante's ascent up the heavenly spheres in his Divine Comedy. There, his beloved Beatrice guides him up from the mountain as he escapes hell in Purgatory. As Dante reaches the highest spheres, Beatrice is transformed into the highest feminine ideal, the very mother of God herself, Mary. All human efforts to attain a goal appear in two A negative and a positive. A difficulty and a prize. The positive aspect, the prize is. Is the hitting of a mark or the reaching of a summit. And it's also the coming together of everything, whether it's writing a paper, delivering a project, or making a cake. Success in attaining a goal must be of the alignment of a skill, resource, time, your desires, your intentions. Reaching a goal is always a communion of priorly disparate elements. And this is why it is most suitably represented by love and the union of the masculine and feminine. This is, of course, why the kiss or the marriage so often accompanies the resolution of our popular stories. In the game, this mostly is represented by the appearance of the heart as the form which unites opposites. When Mario and his beloved come together, when they're separated, the heart is broken. The negative aspect in the path to attain a goal can take many forms. A puzzle to be solved, an obstacle to be overtaken, a confusion which needs to be made clear, a chaos that needs to be organized. The negative aspect can also appear as an inward quest to master and order your activities, honing chaotic potential to accomplish a new skill on an even more psychological level. The obstacle can be our disordered passions. The lack of discipline, lack of focus, which need to be tamed in order to succeed in anything. And so each screen, each level of the game, and ultimately the the whole game itself appears as an obstacle, a puzzle to overcome, a skill to be mastered, while also containing the boon or the satisfaction which comes from attaining the goal and solving the problem. So the game cycles you over and over within each screen of the game until you master it. That is why the top of each screen is represented by both. An obstacle, a kind of barrier, a guardian within video game jargon will later be called a level boss. And the prize, which is the escape and the liberation of the current level, the very reaching of a higher level of the game, a level closer to the resolution of the entire pattern. You die over and over, fail over and over until you escape the level. You're in a kind of micro samsara. You go through all the screens until you transcend the whole pattern with the fall of Donkey Kong. In this manner, Donkey Kong, a monstrous giant, appears as the guardian of a mystery, the union with the beloved. But also just the mystery of the next level in the game and the possibility of reaching higher on the tower. Donkey Kong even taunts you with a little cutscene as to how high will you get. We see this pattern in so many of the ancient stories. From the giant in Jack and the Beanstalk who guards the gold and the singing harp to trolls blocking bridges, to even more ancient stories of the Sphinx who blocks the road and. And whose riddle must be solved so it does not devour you. The ultimate example in our culture would be the cherub which guards the Garden of Eden or guarding the holy of holies of the temple. It's also the image of the ascent of a spiritual ladder which appears in much religious imagery. The attaining of virtue or higher states of being as a ladder whose levels can be represented by the duality of a dark and a light figure, a demon and an angel, A way to ascend and a way to descend. But one does not have to be so esoteric to see the pattern. It's also the pattern of going to school, where each grade level must be finished by mastering your skills, accumulating points, and beating a test so that you don't have to be held back and repeat the year again, but rather you can ascend to the next grade, where the problems become harder and the procedure of succeeding is increases as well. Like I said, the video game is a Highly ritualized participation in cosmic patterns. I talked a bit earlier about a kind of micro samsara in this game. And so it's important to mention that even when you finish the basic narrative pattern of the game, which ends with the fall of Donkey Kong, the game starts over faster and harder at another level, making each narrative cycle more prestigious. To finish the fractal pattern of four screens within one level, which then repeats as the number of levels go up, could have been indefinite if it was not for a strange glitch in the game programming, which stops you from going further and causes Mario to die after four seconds. Glitches are actually extremely important in understanding the meta symbolism, we could say, of video games. But we'll look at that in our next video when we talk about Super Mario Bros. Because Donkey Kong is a love story. Within the narrative of Donkey Kong, we also find an example and a counterexample of the proper union of different elements in love. Donkey Kong represents the brutish, beastly aspect of the person, maybe the dark aspect of Mario himself. He's the hairy garment of skin, the Dionysian embodiment of wild strength and abandon to desire. The reference to the donkey or the ass is supposed to mark Donkey Kong as a stone, stubborn brute. Like Mario, Donkey Kong also desires the beloved. But his animal abandon makes him take her by force, guard her jealously, and unleash his destructive power on the structures of civilization. He makes things crooked, throws barrels, unleashes flames, and all these other obstacles. Mario is the Apollonian builder or fixer, when mastering the game and overcoming Donkey Kong demonstrates directed desire. You know, worked out with method and honed skill. Like I said, by mastering the game, Mario and the player are making themselves worthy of receiving the boon and being united to the beloved. Once the final level has been reached, the monster falls on his head all the way down the tower. If he were the devil, we would say that he's been cast into hell. And the final union of the bride and the bridegroom can occur at the very top of the tower. The relationship between the wild Dionysian character and the Apollonian builder can also take on a different aspect. So if in Donkey Kong, Mario must master skills and the monster to win the girl. In the sequel, Donkey Kong Jr, we now have the tables flipped. In this game, the image of Mario as civilization builder is shifted to the negative side of order. We see him appearing as a tyrant who has caged the wild animal. In this version, the son of Donkey Kong must find a number of keys to open the cage holding his father in order to free the wild aspect from from hyper order. Instead of barrels and oil drums, which are subject to burst into flames, the enemies Mario unleashes are mechanical automatons and birds. Emphasizing this excess of order, the game is also, in a way, a funny version of the descent into the underworld to save your father, as Kong's cage is said to be hidden in Mario's hideout somewhere far away. In terms of the game itself, the pattern of freeing the enslaved, passionate creature also manifests one of the reasons for the video game itself. In contrast to the builder civilizer Mario, it's a reaffirmation that we are not robots, that our transformation is meant to bring joy, and that the playing of a game is also meant to be fun and pleasurable, not only the winning of coins and conquering of levels. This is of course true of any endeavor we accomplish. The image of of the football dad, of course, will immediately come to mind. If we hyper focus on any goal, we run the risk of destroying the wilder and more particular aspects of life. The spice which makes us relatable and human as well. So Donkey Kong junior Balances out Donkey Kong in the end and acts as a warning not to accept the story only from one side. But returning to Donkey Kong, I want to say one more thing about the big, hairy monster. We often imagine the monsters or giants as marginal figures, as the beasts of the edge of society. But when we understand the world of phenomena as an organized hierarchy, we can see why. Monsters both invade from outside, eat you in the forest, but they also guard treasures and princesses in towers. If you live in an ancient city, there are guards on the outer walls to stop foreign armies from invading. But there's also guards at the gate of the castle to stop you from simply waltzing into the throne room. Both series of guards play a similar role, preventing outsiders from illicit access to what is inside. It's just that in this schema, you are also an outsider to a higher royal reality. In Donkey Kong, we mostly see the monster as a guardian and an obstacle to the higher reality. In our more primordial consideration of monsters, though, we often understand them as these dark things, the hidden things that come out of the corners that come up from the watery depths. They can be big monsters, but they can also be pests, critters which need to be taken care of. So many traditional monsters, like goblins, imps, dwarves, are rather like these little critters which come up from the earth. Those are akin to like a rising chaos which comes from Underneath. In this image, instead of picturing the monster above you like an obstacle, like Donkey Kong, we need to think of the monsters below you or outside, which build up like mosquitoes or black flies. They can be the accumulation of little problems in your life which bubble up and take over. The way that if you don't get rid of that small line of ants you see on your floor, you will one day maybe find those ants eating the very walls that hold your house together. If you don't take care of that leak, you'll soon find your house flooded. The same thing will happen to you on a personal level if you ignore your bills or forget your appointments. It is this structure which is taken up in the game Mario Bros. The arcade game. The original Mario Bros. Is a game which is a little less known, but in looking at its gameplay, we can find that many elements will be taken into the future Mario games. In this game, Mario and his brother Luigi are reframed as plumbers instead of carpenters. So as plumbers now, instead of going up a tower to save a girl, they're now called down into the sewers to deal with these pests that are taking over. So in this game, they encounter turtles, crabs, and other monsters which pop out of the pipes as they must clean each level in order to attain the next level. So, by the plumber reference, the pests are, in a way related to a leak which must be stopped. The accumulation of pests as a rising chaos is also intuitively related to a flood. So in this game's structure, we discover the infamous clean your room scenario touted by Jordan Peterson. This manifests another aspect of order and civilization. Not so much the ascent of a hierarchy, but rather the stabilizing and making square of identities. Making clean that which is dirty or making straight that which is crooked, removing that which could be a distraction, an infection, or an infestation. It is as much running the antivirus on your computer as it is mowing your lawn or getting rid of some bad habit. And it's the basic prerequisite to later ascending the hierarchy. When we look at Donkey Kong and these other games, there's a crudeness to both the design, the gameplay, and also even the narrative. These crude tropes, like a monster, a sexy girl, cages with keys, or pests and sewers, might all appear simplistic and lacking in subtlety. But like other video games or early comic books, it is rather through a type of innocence that they manifest a very powerful pattern. The ramifications of the patterns they engaged with might even have been unknown to their creators at the time. Yet the simple expression appears in a form that is immediately accessible to to anyone from a four year old to an adult, which give them a kind of universal reach. Donkey Kong and other earlier games are formed at the proper level of innocence and simplicity to be the origin for a world. These original patterns would be unpacked slowly but inevitably through the history of video games. Although many recent games have reached unheard of levels of sophistication, when one scratches the surface, we often find the same pattern reoccurring a hierarchy of levels, an elimination of enemies, a boss, a prize, and a triumphant end. What is mostly fascinating is that if Donkey Kong and the early Mario games explore cosmic patterns from many angles, the next game in the series, Super Mario Bros. Often hailed as one of the most successful, groundbreaking and best video games of all time, is able to pull many of these symbolic elements together while also encompassing other aspects which make it closer to a full microcosm, including the notion of the secret and even the ambiguous yet important narrative function of the mistake or the glitch. So I hope you'll join me in discovering the world of Super Mario Bros. In my next video. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
