{"episode_id":"SW - #065 - 2019-10-16 - How The Joker Smashes Our Political Narratives","start":0.56,"end":1471.4,"speaker":"Jonathan Pageau","text":"So the Joker movie just came out. And to be honest, I wasn't gonna see this movie because I'm not watching that many movies these days. But because of the insane press that it was getting, because of the fact that everybody was afraid of the movie, that everybody was speaking ill, especially in the mainstream media, about this movie, I thought, okay, there's something else going on here, and I have to see it to understand why this particular movie is making people freak out. And so that's mostly what the movie is going to be about. I'm going to go through the Joker movie and I'm going to show you why. The reason people are so afraid of the Joker movie has much less to do with the story in terms of the violence or the way that the Joker acts, but it has more to do that in the very structure of the storytelling. It breaks apart the political narratives that have been prevalent in America. And it smashes the Overton window to smithereens. This is Jonathan Peugeot. Welcome to the symbolic world. So if you haven't seen this movie, please don't watch this video because it's going to be so full of spoilers you can't believe. I'm not going to spare you at all. I'm going to go through all the elements of the movie and I'm going to show you how the decisions made by the screenwriter and the director are there to break down the prevalent narratives that we find in our culture. And that is why the movie is so dangerous to the mainstream, to the establishment, to all of this. And it has much less to do with the violence, although it is a. It is a very violent movie and it is horrifying. But you know, the movie, it just came out two weeks ago. And so why is it that a movie about a killer clown that kills children does not bother people, but somehow they. This movie about a. A man who becomes crazy and starts to kill people. Why is it that this movie is bothersome? And it has to do with the manner in which it breaks down the current narrative. So I'm going to go through the movie and I'm going to. This is not the usual way I do things, but because the movie just came out, no time for editing, no time for fancy slicing in of scenes. I'm just going to go through the elements of the movie and break it down to help you see why it is doing what it is doing. So if you've seen the movie, you will know everything about it. So I will take that for granted as I go ahead and explain things now. The first thing to notice, of course, is his name. His name is great. His Arthur Fleck. And in that name you find two interesting things brought together. One, one which is Arthur, of course, the King Arthur. And the other is the notion of a fleck. Fleck is something which is thrown away. It is a piece of dust, a piece of debris which is thrown out, which is kind of flecked off. And so this notion of a fleck and Arthur is very interesting because of course, as you have watched the movie, just like King Arthur, his origin is ambiguous. King Arthur's origin is extremely ambiguous because he is an illegitimate son of a king. And that is what is. You're led to believe in the story. It is that the Joker, at first you're led to believe that he's the illegitimate son of Thomas Wayne, and then you find out that in fact, no, that is a fiction. Is it? It's an insane fiction. And so this. But. But the Joker does in the end become this kind of kingly figure, but a kingly figure of the. Of the chaos, you could say a king of chaos, something like that. And so the name Arthur Fleck already is a. Is a very well chosen name for what the Joker is and what the Joker becomes. So the movie begins with a garbage strike. And. And this accumulation of garbage in the city is of course a. Just a very literal. You guys are going to catch me because I said the word literal, but a very direct image of how everything is piling up in the city, how the chaos is growing in the city of Gotham. And you see the Joker spinning the sign which says everything must go. And there you go. That's the beginning of the movie. Everything must go. And that's what this movie is about. And because it is going to break down all the narrative structures that we identify in our culture right now. And that is uncomfortable for everybody. And it's uncomfortable even for those who think that they are somehow edgy, somehow that they're the ones who are holding the revolutionary hand. But they. This movie has nothing to do with that. It's gonna break everything apart. And so, in a way, the Joker movie is the most punk rock movie that I've seen in a very long time because it takes on everything and smashes it. So how does it do that? How does it break down the narratives? What it does is that it sets up certain situations. And the situations which it sets up are the situations which you would expect in the current political climate, in the current way that people put facts together or put elements together, and then what it does is it breaks that down. It shatters it as it's setting it up. And so that is what is making people so uncomfortable about this movie. And so I'm gonna give you some examples which are going to help you understand why this movie feels so dangerous to people. Now, the. The very first image that I can bring up for you is that there is this character, his clown friend, this bully. And they show him as a bully because he's making fun of the short person, the midget in the movie. And so they show him as this bully. And so this bully, this big, you know, this big huge white guy, you know, he's got everything you need to make him look like. Like that bully character. He gives Arthur Fleck a gun. Now, that's what you would expect, of course, because he fits the typified image. But then the Arthur Fleck character takes this gun and he uses it, but he uses it to kill these elite kind of Wall street types, as he calls them himself, these three young Wall street types, you know, looking like the Covington kids type of guys. And so already you have this problem, you have this smash, which is that on the one hand you want to. Certain political narratives will want to say, yes, of course, here's this bully type character giving him a gun, being interested in guns. But then the gun is used to kill the elites in society. And so. And so how. How do you deal with that? Because the. The gun ownership in the political narrative of the US is, Is seen as, you know, the powerful who have these. These guns. And it's the powerful who are defending the use of guns. But now it's used in a kind of revolutionary manner. But even in that scene, again, everything is broke. It breaks down because you see the Joker sitting in the train and you see these three kind of young rich kids who are bullying this young lady. And so when they come and they beat up on the Joker, they beat up on Arthur Fleck, you feel sorry for him, of course, and you. You can. That. That story is typified, these three bullies kind of harassing a young lady. And so finally you think the Joker defends himself and he shoots one of the guys. And so you. And so there's this. There's this disturbing sense of catharsis in the moment. But then he not only kills the guy, but he goes out and he hunts the third guy down and he shoots him down in cold blood. It's already the. The narrative of. The revolutionary narrative, you would say, is already broken down because the extra step that he takes to go hunt him down, to shoot him down with a gun. And this gun is an evil thing in American, in let's say left leaning American narrative. The idea of killing elites is a left wing fantasy. And so how do you jive these things together in the modern political landscape? So that breaks it down. But of course that's not the only way that the story gets broken down. Another way that this story gets broken down is in the very character of Arthur Fleck himself. Because on the one hand he is portrayed as someone who is poor, someone who is suffering, someone who has been abused. He is portrayed as a victim. But in the modern political landscape today, we have had all this talk about these dangerous incels and these kind of dangerous lonely guys who are, who are a social threat. So portraying him as a victim and at the same time having him as being this, this disturbing character who has become the big boogeyman of the modern world right now. It's very interesting to see, you know, the way that people view incels today in terms of the media is very similar to the way that some guy, some racist white guy in the 1930s would have viewed African Americans. He would have thought, oh, those black people, they're gonna come and get us. You know, they're dangerous. And so we have this, a very similar narrative today where it's like now all these, oh, there's an army of incels out there that is gonna come and get us. And so, you know, not that that can't happen. Just like violence, you know, any kind of group that is marginalized, that is suffering, that it can happen, that violence will erupt out of that community. But, but you know, we're not yet going to have a. Not all incels hashtag, maybe we should, who knows? But we see that in that element. And so another way in which all the expectations are broken is that you have this poor character, Arthur Fleck, and his mother who's writing letters to Thomas Wayne. And so Thomas Wayne is represented as this jerk and he's, you know, he's got, he looks exactly like you would expect him to. He kind of overweight, you know, big guy, you know, with a tuxedo and who talks about people who are not succeeding. He talks about the poor and about the marginalized in society as a bunch of clowns. And so you have the story of this lady who would have, in the, in the past, poor lady would have had an affair with Thomas Wayne. So Thomas Wayne would have shut her up like an abusive man in the Epstein style would have Shut her up. And she couldn't get anything from him, so she was forced to raise this young man alone. And so, aha. It's like, we have it. We've got our narrative. This is the narrative. Big mean rich man abuses woman, takes advantage of her. She has a child, and now this child is mentally ill. And, you know, that's the story. That's the story. But then the story is broken because turns out that she's delusional, that it isn't the case, that in fact, she, you know, she adopted this child. And Thomas Wayne is not the Joker's father. And so Thomas Wayne remains a jerk. You know, the things that he said at the beginning are still extremely annoying and extremely disturbing. But then he's also not this. He's not what the story has brought him up to be. And so the idea that somehow Arthur Fleck would want to wreak vengeance upon him doesn't have any meaning anymore. And so this. This narrative is broken as well. So constantly in the story, that is what we're seeing. We're seeing expectations brought up and then those expectations being cut at the knees so that you cannot hold on to the narrative that you think the movie should have in order to justify its existence. And that is why so many people have been angry and just annoyed and can't deal with the movie itself. And so the movie is. In the story, we kind of explore this notion of not having an identity that. So Arthur Fleck loses his identity as the movie is moving forward. He first discovers, he thinks that, you know, he has these fantasies about connecting with the talk show hosts. He has then this dream of maybe being the son of Thomas Wayne. And all of these identities that he has are broken down. And so he becomes, in a way, the same kind of anonymous ident. You know, he's adopted. We don't know who his real parents are. His mother is abusing him. And so he. He is without any identity. He's the picture of nihilism. The thing about nihilism is that nihilism is not on anybody's side. And that is why so many people are frustrated with it. I read a review on the Associated Press where. Which says, I wish the movie thought was as radical as it thinks it is. And that's hilarious because the movie is not about radical in the political sense. And what he means by that, of course, is radical. Like, I would want it to be radical in the way that I interpret reality, I interpret politics. I saw a very similar review of it on the Roger Ebert website where they criticize the producers for not being courageous enough, not being brave enough. You know, for example, not making the Joker character into a racist. And you think, huh, why did they say that? Very fascinating. Because if you had made him racist, then it would have been easy to classify him. It would have been easy to say, oh, he's that kind of horrible evil person. But no, because he's not a racist, because he falls in love with this African American woman, then you just can't believe put him in a category. And that is what annoys everybody so much. And I understand it because that is the clown that is the trump card. That is the card that has no category, the one that can be anything that you think it is and at the same time none of them at all. And that is why the movie itself ends up being what the Joker is smashing. Everything, nothing, everything must go. And that seems to be what the, the movie is really about. And you know, this is me speculating, but it seems like in a way the. The movie is also a comment coming from the director. The director expressed just before the movie came out that he decided to make more dramatic movies and stop making comedies because he who can make a comedy in this woke culture. And that's. That seems to be the moment where the media really turned on him, really decided to start attacking him. And you see there's a scene in the movie where the Joker is sitting in the couch of the talk show host. And we have to understand the talk show host as this political gatekeeper, you know, the Stephen Colbert of talk show hosts and all those other political talk show hosts which are out there who have somehow may decided what is funny and what isn't. And you see in the Joker, he says, he talks about the establishment and he says, you decide what is funny and what isn't. And then he points to their cruelty. There are a few very, very powerful little. There's so many little tidbits in this movie that, that help you understand what it is that is trying to be portrayed and how it really is this movie which is trying to break down all narratives. And the narrative of course, is seen as that elite, the ones who are holding the story, the ones who are holding the politics. Thomas Wayne, the talk show host, those are the ones who are holding the reins. And so there is a. There is a scene where they show on television. You see him in his apartment and it's in the background and you see this kind of gaudy scene of, you know, African American workers were kind of singing and it's. And it's this kind of really bad image of these kind of black workers that are singing. And the whole cliche of the kind of poor black man who sings jazz and you know, the whole cliche of the shoe shining black person, all of that is there. And it's kind of. It's kind of disturbing to see that on the television. And you think, oh man, what is going on? And so then you think, aha, maybe this movie, there's so many scenes like that. Maybe this movie really is racist. Maybe that's what it is. And then there's another scene where you. Where the Joker walks into a movie theater and all these. These people, all these rich elites in tuxedos are sitting there and watching Charlie Chaplin as the hobo and all of them are laughing at this homeless man who is spinning on his skates. And you realize that, you realize this, how, how much this is not so much how it is really is this breakdown of everything. It really is. Everything must go. But the ultimate thing that I think is making people crazy is how it crosses the different narratives together and gives us something which seems impossible but that people just can't stand to watch, which is that Joker is this bitter incel character. But then he ends up becoming the figurehead for a type of Occupy Wall street movement where everybody's wearing a mask. It's a clown mask instead of a Guy Fawkes mask. But you can see that it's all related to the same thing. There are places in. There are little scenes in the movie where, for example, people hold up signs and it says Wayne fascist. And they have resist signs. And so here is this. Here is the bad guy of. Here's the new bad guy of the contemporary culture. This clown incel, you know, lonely guy who lives with his mother. And he is the cause. He is the inspiration for a movement which is an occupy movement of resistance and anti fascist movement. And so it's like smash the two narratives together. And no wonder people cannot see stand it now. The movie is extremely disturbing. The. The. To watch this character become crazy, to watch him kill his mother, to watch him become this brutal character is extremely unsettling. But in terms of the actual violence, it is no less unsettling than any other movie that has that type of story in it. You know, the movie, it just came out two weeks ago. There are all these horror movies which usually come out in the month of October. We are in the month of October. We know this is the month for horror movies. But somehow this movie is the one that is freaking People out. And, and. And that's what it is. It really is. That's what's so unsettling about the movie is that everything must go. The whole thing is the entire narrative. All the narratives are thrown up in the air, smashed together and, and broken down. And very few people can handle that. And I understand why they can't handle it. But what it can help us see, if we are attentive, it can help us understand what kind of narratives we are attached to. What are the stories that we think are the stories which are unfolding before us, what is holy to us. And that's what a clown does. A clown is always pointing and taking apart the things that you care about. The clown is always turning things upside down. He's always making fun of the things that we hold dear. That is the role of a clown. And just because. Just because some people think that they're right and that their narrative is the only narrative, doesn't mean that there won't be a clown there to poke at it. So that's my review of the Joker, guys. If it is disturbing and it is very violent, so I'm not necessarily recommending that you go see it, but for sure, I think that it's playing a strange role in our culture. And you know, the joker in the movie at some point tells his psychologist that the name of his clown act is Carnival. And so it's October, guys. It's Halloween. It's time for carnival. Everything's going to be thrown up in the air. And this month I will be putting out some videos on Halloween explicitly on be putting out some videos on specific monsters. You know, I'm. I'm trying to get all of it together. I put out a Twitter poll to see which monsters you guys want to hear about, and they were almost all very equal. So let's see which ones I'm going to choose. I might try to do all of them. And I'll keep one of the monster videos for the patron only video. So, guys, thanks for your support. I hope you enjoyed this video, this format. It's the first time that I do this kind of immediate interpretation format. And I will see you guys soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you."}
