{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":12.16,"end":15.6,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":26.33,"end":26.81,"speaker":"Richard Rohlin","text":"Hello, everyone."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":26.89,"end":36.97,"speaker":"Jonathan Pageau","text":"I am back here with another episode of Universal History with Richard Roland. As you know, we have just wrapped up our Dante class. You know, it was an amazing. It was an amazing."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":37.29,"end":44.25,"speaker":"Richard Rohlin","text":"I just have to say Dante's Inferno class. Like you say Dante class. It's like we did the whole thing, which we didn't. Definitely did not."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":44.25,"end":63.66,"speaker":"Jonathan Pageau","text":"But yeah, we spent six. With six three hour treks. Five, five, three hour treks through the Inferno. It was amazing for me discovering all kinds of things that I had forgotten that I didn't realize was there. It was, it was just great. And we're looking forward to also doing Purgatory and Heaven and paradise."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":63.66,"end":64.02,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":64.1,"end":67.06,"speaker":"Jonathan Pageau","text":"But now, today we are here to talk about Ireland."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":68.02,"end":104.58,"speaker":"Richard Rohlin","text":"So people have been asking for a long time, when are you going to do the universal history of Ireland? And to be totally honest, I've been scared of it and putting it off. The reason I am scared of it is that when you bring Ireland into the conversation, people go a little crazy. I mean, really specifically Americans go a little crazy. You know, there's this sort of, I don't know, like, does everybody turn Irish on St Patrick's Day in Quebec? I'm going to assume no."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":104.58,"end":105.86,"speaker":"Jonathan Pageau","text":"No, we don't. We have."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":105.94,"end":110.22,"speaker":"Richard Rohlin","text":"You don't like, turn your local river, you don't turn your local river green or anything?"}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":110.22,"end":110.74,"speaker":"Jonathan Pageau","text":"No, we don't."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":110.74,"end":124.1,"speaker":"Richard Rohlin","text":"We don't. Yeah, we don't. Because they do that in Chicago, you know, like, and, and in some other places, like they just pour a ton of green dye. You know, I, I don't know what the long term environmental consequences of that are. I'm sure somebody's figured that out, but we've decided it's worth it."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":124.1,"end":124.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":124.9,"end":222.22,"speaker":"Richard Rohlin","text":"And, and all of the, every single, every single, every single store and you know, like, like liquor stores, grocery stores, et cetera, will, will sell like all the schlocky Irish stuff. Irish foods, obviously, they sell a lot of Guinness, they sell a lot of Irish whiskey at that time, et cetera. And, and yeah, so this is kind of like, there's something about it. There's something about it. And, and the thing is, like, it's not inaccurate. Like, almost every, you know, person in America has some amount of like, like Irish DNA or blood or like, however you want to say it. I myself, you know, and like most of my ancestors are from Scotland and Ireland, so, so there's something about it, but it's, it's, it's, it's, it's weird. Like, it's almost difficult to quantify a similar thing with Scottish culture, but I think not quite as much. I think quite as much. Although I think there were probably. That did get a bunch bump from Mel Gibson's Braveheart. Yeah, sure. Yeah. But okay, so there's something about Irish culture, Irish history, that is like. That is simultaneously when it's presented especially kind of like in a North American context, is simultaneously like, very kitsch, but also somehow is compelling enough to kind of like. Hold on. So here, I'll tell on myself for a minute. I've only ever been to two concerts in my entire life. I mean, you have to remember that I grew up like fundamentalists."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":222.22,"end":222.94,"speaker":"Jonathan Pageau","text":"Yeah, it's true."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":222.94,"end":232.7,"speaker":"Richard Rohlin","text":"Know everything. So we didn't listen to rock music because if you play it backward, you can hear the words the demons are saying, which is a real thing that I was actually told. I'm not just. That's not just a joke. That's a real thing that I was told."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":232.7,"end":240.5,"speaker":"Jonathan Pageau","text":"But probably if you play anything backwards, you can hear the words that the demons are saying. Because why you believe. Why. Why are you playing it backwards in the first."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":240.5,"end":250.7,"speaker":"Richard Rohlin","text":"I don't know. Like, like. And like, what is it? What is like, you know, did. How did CDs mess with the devil's plans? Like, how do you play a CD backwards? I don't know. But anyway. Okay. All right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":250.7,"end":258.22,"speaker":"Jonathan Pageau","text":"So also, the biggest complicated thing is also because why do you listen to backwards when listening to it? Straightforward. You can already hear the demons speaking."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":259.58,"end":263.42,"speaker":"Richard Rohlin","text":"Also that like. Like, who was like, I'm going to play this backwards. Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":263.42,"end":269.38,"speaker":"Jonathan Pageau","text":"Anyway, I listen to Megadeath backwards. You know, I have all these weird things. Like, dude, just listen to it for."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":269.54,"end":270.14,"speaker":"Richard Rohlin","text":"You're good."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":270.14,"end":272.18,"speaker":"Jonathan Pageau","text":"Like, you got enough, man."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":272.34,"end":273.06,"speaker":"Richard Rohlin","text":"Oh, boy."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":273.22,"end":273.7,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":273.78,"end":283.22,"speaker":"Richard Rohlin","text":"Derailed this one. Okay. So. So, you know, so I've only been to two concerts. One was, you know, Dirt Poor Robins with you guys. Like, really?"}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":283.3,"end":283.7,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":283.7,"end":349.59,"speaker":"Richard Rohlin","text":"Yeah. Like, literally, that's what. That's the only time. The only time in my life I've ever been in front of an actual rock band playing actual music. Yeah. And. Yeah. So horribly sheltered everything else here. But you also understand when I in my family, going to a concert meant you were going to the symphony. Like, so going to the concert literally meant you put on a tuxedo and you went to the symphony. And if I say I'm going to a concert, that is still what I mean. Like, you know, I'm still a giant snob or whatever. But anyway, okay, so the only other time that I've been to a concert was when the band Celtic Woman came to into my hometown. Yeah, there's. There's like a band or like a group called Celtic Women or Celtic Woman, but it's like, it's a bunch of. Bunch of tall blonde ladies singing, you know, vaguely Irish music. Like, vaguely Irish. You know, you get to your obligatory oh, Danny Boy. And everything else is kind of New Agey and whatever. But my wife and I really like them, so we went like. I mean, this is like. This is. This is like. This would be more embarrassing."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":349.59,"end":350.59,"speaker":"Jonathan Pageau","text":"A big deal for you."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":350.59,"end":395.18,"speaker":"Richard Rohlin","text":"This would be more embarrassing if I didn't own literally every album Enya has ever made. But anyway, that's a different conversation. It's a different conversation. So. All right. So I say all this to say there's something about that, like the Celtic Woman of it all, that is really kitsch and yet continues to remain interesting or compelling on some level. Enough that, like, all kitsch things. Like it. It. Like, you know, there's. There's got to be something to it or people wouldn't still be doing it. Right. So what I'd like to do in the next few universal history videos will be to take a look at some things in the British Isles. Because the other reason I'm scared to talk about this is because there's so much. Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":395.66,"end":399.02,"speaker":"Jonathan Pageau","text":"And, and, and really Engine of the World. So, you know, there's got to be a lot."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":399.37,"end":527.16,"speaker":"Richard Rohlin","text":"Exactly. Well, but also, like, there. There is like this much stuff about other cultures, but I'm, you know, this is my native language, for one thing, so that makes it easier. But also, like, this is the thing I've. I've dedicated my entire academic life to studying really is. Is Anglo Saxon and Saxon and medieval Celtic cultures. And so there's just, like, so much to choose from. It's really difficult to. It's really difficult to kind of know where to start. So what I thought we'd do today. What I thought we'd do today would be to start with a book which is sometimes called the Book of Invasions. The Book of Invasions, It's a work. It's also called the Book of the Conquest of Ireland is literally what the Irish name for it means. But it's an 11th century work of universal history. And so here we're on pretty firm footing in terms of what we've come to expect in terms of medieval universal history. And what it tries to do is it tries to take the pagan history of Ireland and specifically the lineage of the high kings of Ireland, which is like the main source of the pagan prehistory of Ireland, tries to take that and merge it with the biblical and classical narratives. And so basically you get a sense of. Well, it starts with Genesis. It starts with God made the heaven and the earth at the first, and he himself hath no beginning nor ending. That's the beginning of the book. So we find. I'll read a little bit from the creation narrative here, actually, because it's. It's kind of interesting to see how they interpreted certain things from the Genesis account. He made first the formless mass and the light of angels. That's the light. They'll let there be light. That's the angels. Which is. Which is. This is actually a common medieval debate, by the way, people. You know, when were the angels created? Were they created on the first day, or were they created on the same day as the stars, the sun and the stars. So he made the form first, the formless man, in the light of angels. He made firmament on the Monday. He made earth and seas on the Tuesday."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":527.48,"end":529,"speaker":"Jonathan Pageau","text":"Did it say he made the formless."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":531.09,"end":737.88,"speaker":"Richard Rohlin","text":"No, formless mass. I'm sorry? Oh, mass. But basically like a formless mass of matter. Right. That's the. England shaped things. The formless man would have been insane. Yeah, that would have been crazy. He made the firmament on the Monday, he made the earth and the seas on the Tuesday, he made sun, moon and the stars of heaven. On the Wednesday, he made birds of the air and reptiles of the sea. On the Thursday, he made beast of the earth in general and Adam to rule over them on the Friday thereafter. God rested on the Saturday from the accomplishment of a new creation, but by no means from its governance thereafter. He gave the bailiffry, that is like the jurisdiction of heaven to Lucifer with the nine orders of the angels of heaven. He gave the bailiffry of earth to Adam and to Eve with her progeny. Thereafter Lucifer sinned so that he was leader of a third of a host of angels. The king confined him with a third of the host of angels in his company in hell. And God said unto the foe of heaven, haughty is this Lucifer. Thereafter Lucifer had envy against Adam, for he was assured that this would be given him, that is Adam, the filling of heaven in his room. So this is a very common idea, by the way, that you run into. I can't remember if I read this already in our series from the Anglo Saxon Genesis, but there is a very common kind of a thing where you have this idea that the humanity is created or humanity's destiny is to take the place of the angels that fell. And this is implicit, by the way, even in the book of Revelation. Like you have four and 20 elders because that's a third of the number, the traditional number of the divine council. Right. So let's see. So thereafter, Lucifer had envy against Adam, for he was assured that this would be given to Adam the filling of heaven in his room, or that is his place of jurisdiction, wherefore he came in the form of a serpent and persuaded Adam and Eve to sin in the manner of eating the apple from the forbidden tree. Wherefore Adam was expelled from paradise into common earth. So most of this is the way, you know, happens the way that we would expect it to happen. But there are some kind of additional details that are very basically like nothing unusual for the Middle Ages here, but they are kind of interesting glosses on the Genesis text. So the story goes on to trace the. The lineage of the Gaelic peoples through the line of Noah. So you have Japheth. Japheth, of course, being in. In the Genesis account and in the kind of medieval understanding, Japheth is the father of. The father of the medieval. Of like medieval Europe, new European peoples. And so it says that Magog, the son of Japheth, of his progeny, are the peoples who came to Ireland before the Gadi, to wit, the Partholens. And it goes on and lists a bunch of tribe names, including the. Including the progeny it says of Nemed of the Fearbol and the Tuathedanan, which are the. These are important groups of essentially what we now think of as fairies that we'll come back to in a minute."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":738.04,"end":739.56,"speaker":"Jonathan Pageau","text":"The descendants Magog."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":739.56,"end":742.4,"speaker":"Richard Rohlin","text":"They're descendants of Magog. So I thought you would like that."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":742.4,"end":743.64,"speaker":"Jonathan Pageau","text":"Well, yeah, I do like that."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":743.72,"end":777.01,"speaker":"Richard Rohlin","text":"Yeah. So, yeah, they're descendants of Magog. So Magog is of course a giant. He's a monster. He's a giant. There's kind of different. How do I say this? There's like sort of different Magog legends. And sometimes it's like Gog and Magog are like two monsters and giants. Obviously they're sort of like the names of countries on the edge of the world. I mean, we've talked about this in a previous video, but it's been a month minute though, so maybe people should go back and revisit that."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":777.49,"end":784.69,"speaker":"Jonathan Pageau","text":"Sometimes they're kind of cannibal, hybrid type monster that live on the edge of the world. That they're the people that Alexander locked out."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":784.69,"end":785.01,"speaker":"Richard Rohlin","text":"Great."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":785.09,"end":787.17,"speaker":"Jonathan Pageau","text":"Locked out with the gates of yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":787.41,"end":814.75,"speaker":"Richard Rohlin","text":"Well, in another legend they came to the island of Albion, which is, that is the island of Britain, and were kind of actually the first people to settle there. And so in, for instance, like the history of the kings of Britain and the Brutus legend, which we've talked about way back at the very beginning of this series and we are going to revisit that stuff. But in the Brutus legend, that's who Brutus fights. Like basically, you know, they fight the giants when they come to the island. Right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":814.75,"end":825.59,"speaker":"Jonathan Pageau","text":"So that's interesting that the, that the Irish or the Gaelic see themselves as descendants of Magog. So it's like the idea that they're the ones who were chased out of."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":826.47,"end":888.05,"speaker":"Richard Rohlin","text":"So this is going to get even more interesting in a certain way. So to kind of, to kind of summarize, to kind of summarize this, the book of invasions or the book of the invasions of Ireland basically identifies six major waves of invasions. Right? And so in the way, the same way that we talked about Ethiopia being kind of like the symbolism of the nest, right, the thing that's made of, of leftovers. Right. Of. And then sort of. But then it kind of collects things and becomes a place where life can be sheltered. Ireland is similarly. Ireland is similarly a. It's a, it's a catch all. It's on the end. It's a sort of the, the, it doesn't quite have the same nest imagery that Ethiopia has, but it does have this sense of being, you know, the literally the edge of the world. I mean, it is the edge of the world for most of the, the history of medieval Europe that you can't go any farther west. Ireland."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":889.25,"end":909.37,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense. And that's why, you know, there are some legends that find themselves there and you don't know why. Like a good example is the St. Christopher legend. So St. Christopher is a dog headed man in the east and then he's usually a giant in the west. But then in Ireland, for some reason they caught that. Like they have these legends of St. Christopher as the dog headed man, even."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":909.37,"end":917.04,"speaker":"Richard Rohlin","text":"Gog and Magog, like they're, they're supposed to be off in the east, you know, shut out by Alexander's gates, but then they show up in the British Isles, like it's like."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":917.12,"end":918.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":918.64,"end":1018.73,"speaker":"Richard Rohlin","text":"So basically what happens, what you have in the book of invasions is this idea that these groups keep invading the island of Ireland. When they invade, they usually wipe out the previous peoples or the previous people are left there, but they kind of go into hiding and the Previous peoples that are left there and go into hiding have. Have the names or identities or culture that modern scholarship, like I'm talking about archaeology and history and things like that here, would associate with, like, this. This Stone Age culture or this Bronze Age culture or whatever, but also with the different pantheons of gods that are worshiped by that group of people. And it's sort of like. I mean, typically speaking, when you, like if you drive a people out of the land, you know, so you push them out, they go somewhere else, they take their gods with them. And it's relatively unusual for the gods of a conquered people, or let's say like, of four conquered peoples ago, to sort of like, still hang around in the hills. Right. But it's kind of like the idea is, like, in Ireland, there's nowhere else for them to go. Right at the edge of the world. They're already at the edge of the world. And so on an archeological level, this is happening, but also you could say on the level of principalities and powers. Right. This is also kind of happening. Like, there are. There's a reason that Ireland is so strongly associated. It's not the only place in the world, but it is probably the place in Western. The Western, like, you know, like the Anglosphere is probably the place most strongly associated with fairies."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1018.89,"end":1019.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1019.61,"end":1038.67,"speaker":"Richard Rohlin","text":"And there is some aspect of fairies that are something like a. Like a splinter or a piece that's broken off of or kind of like leftover hierarchies. And I. That's. That is. It's hard to, like, even say that out loud because it's like."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1038.99,"end":1046.47,"speaker":"Jonathan Pageau","text":"Yeah, and so. Because that's. That's how they function. You know, they're. They're kind of like the gin."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1046.47,"end":1046.75,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1046.75,"end":1066.33,"speaker":"Jonathan Pageau","text":"We talked about this before. Because they're. They're very ambiguous and they're. They're. You know, why is it. Why would they want to, like, trick you? Like what. The idea that principalities kind of want to get your attention or trick you and all of these things, it means that they have. They have to be kind of wandering."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1066.33,"end":1066.65,"speaker":"Richard Rohlin","text":"They're."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1066.65,"end":1072.49,"speaker":"Jonathan Pageau","text":"They're. They're wandering in the desert. They don't have. They're not attached to. To the right order."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1072.57,"end":1107.78,"speaker":"Richard Rohlin","text":"You know, if you read eyewitness accounts of fairy stories or like, fairy encounters, rather eyewitness account of fairy encounters. These are people who were, like, walking along usually in Ireland or Wales is where most of these things happen. And we'll talk about Wales in a future episode, I think. But people are walking along and you meet a fairy Right. Very often it's like the bishop is walking along or a priest is walking along, and they meet a fairy. And the fairies are always concerned with a question of whether or not they can be saved."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1107.94,"end":1108.9,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1109.06,"end":1120.26,"speaker":"Richard Rohlin","text":"Right. And so there's, like, all kinds of, like, strange things, like where. Where, like, the priest or the bishop will say, you know what can you say? The Paternoster? And, like, the fairy can't say Our Father."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1120.26,"end":1120.58,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1120.58,"end":1225.44,"speaker":"Richard Rohlin","text":"He can't say that. And so then it's like, so, by the way, the answer is always. That can't be known until the Day of Judgment. That's always the answer. Like. And so there is this sort of thing, like, where. And maybe some of this is tied to the idea that you also find in the Legends of Jinn. Oh, right now I'm reading, rereading for the umpteenth time, a wonderful novel called Declare by Tim Powers. You should read this at some point because it's. It's. But it's all about. It's all about gin and also, like, Cold War spycraft and stuff. Anyway, great book, great book. But. But they. But. But Powers digs into. Powers is a. Is an amazing. Actually, you should have him on the channel. He's. He's an amazing. He's a Roman Catholic, amazing contemporary author. Probably. Probably. For my money, he's like the best current fiction author. Okay, he's great. But anyway, he's got a great book about this. But what he. But he, like, he's really deeply researched, like, all of these different legends about the jinn and the fairies and so on, and it kind of incorporates them all into kind of this thing that makes a lot of sense. But anyway, all that to say in the legends of the fairies and the djinn, one of the theories of where they come from is something. Is that they're basically like angels who only fell halfway, or that they. They didn't join Lucifer's rebellion, but they didn't side with God either. So they're cast out of Heaven, but they're not cast all the way down. Right. So that's one kind of medieval theory about where fairies come from. There also seems to be something, though, like, as I was saying, like. Though they're the sort of the Remnant, or like. Like a sort of a fractal, like a piece that's broken off of an older hierarchy. And Ireland just sort of collects these things, collects these hierarchies, collects these. These stories of invasions."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1225.44,"end":1341.86,"speaker":"Jonathan Pageau","text":"And so this is important. I think this, at this little point that you Made is really important for people to understand kind of how it works. And so how it works is that there are traces of this at every level. Right? So you have a story, like you said, of the idea of these gods that have been kind of chased away, that they, that they are, you know, in ambiguous spaces. They haunt, you know, places that aren't clear and that they're. Or like we saw in Dante, like we do, we actually have in date a place in hell where these ambiguous spirits are, where they didn't take, they didn't take position in the war between heaven and hell. And then that will then reflect itself at the lower level. So like Richard said, it also means that there is a ancient civilization that was there, that was maybe broken up and the, the residues of that were not fully, you know, assimilated into the next, into the next civilization. And therefore it leaves these, these bra. These little parts of stories, parts of, of rituals, maybe superstitions, all these types of behaviors and things that are actually residues from a world that is now over, but that are still kind of haunting the margin of a story. So then, and then you, you can have that in several layers of that, like you said, and you, then you end up with these odd spaces of remainder that, that are part of your, of your culture. And so when the archaeologists and the modern historian, they'll, that's, they just see that level. So they'll say, oh, this weird story is a trace of an older story that the people that were there before, you know, and it's not really well integrated into the new mythology. And the answer is yes, yes, but it also is, it also means that the principality that were ruling over those people, they are also kind of there, but not there, you know, that they affect, they still affect the world, but in a, in an indirect, in an indirect way."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1342.58,"end":1373.25,"speaker":"Richard Rohlin","text":"Yeah, I mean, that's exactly it. Like, like that, that whole. Well, this is just like, this is probably just a leave over from the previous civilization that is what a fairy is like, you know, and, and, and the, the, and of course, like when people historically came across those, like the burial amounts from those people, they say, oh, that's a she mound, right? That, that's the Irish word for fairy. It's a much better word than fairy by the way. Fairy comes from the French. You guys know how I feel? No, I'm kidding. Just."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1373.81,"end":1445.2,"speaker":"Jonathan Pageau","text":"But I just, I want to press one last thing because I think it's really important. So it's like, I know it's hard because we talk about these things and Sometimes they just sound just mythological, right? They are. But it's important to understand that like when, for example, people build computer systems, this is a good example, they create a program, like they create a language or they create a, a, how do you call, like a platform for something to run on and then if they want it now, add another platform. Sometimes they can't completely destroy the one that was underneath. They, they tried to like press it down and it's already had windows running on DoS. And then DoS is like this weird thing that is kind of lingering in the background that you don't know. But sometimes the effect of DOS would pick itself into Windows and then you'd have all these weird things happen because it's basically running layers of things running on top of each other. And so this idea of this problem of, of how to create a new world without like on a, on a place that already exists, creates these residues that will infect sometimes the systems that are built on top of it. So it's not just like, like we're just not just talking about like weird mythological stories. Like this is actually how you build systems of meaning and that this is how it works."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1446.32,"end":1481.5,"speaker":"Richard Rohlin","text":"So in the Book of Invasions, the first people to settle in Ireland before the flood, before the flood of Noah is a woman. And the people with her who come from Egypt. I know you just hate it when stuff comes from Egypt, but here we are. The reason we haven't done a universal history of Egypt yet, you guys, is because Jonathan's always like 19th century Egyptologist in. But we are going to do it at some point. You need to do it."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1481.5,"end":1484.14,"speaker":"Jonathan Pageau","text":"The symbolism of Egypt is important in the Bible and in a lot."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1484.3,"end":1515.64,"speaker":"Richard Rohlin","text":"But also like the symbolism of Egyptology, like the way that just like took over the British cultural consciousness for a hundred years, I mean is, is really crazy. But anyway, okay, so they come from Egypt with a great, great plan for perpetuating civilization here. 50 women and three men. And depending on the story that you read, the accounts here is that, is that it's just, that's kind of a lot of women. And so the first two men kill themselves."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1515.88,"end":1518.36,"speaker":"Jonathan Pageau","text":"They just, they just tire themselves up."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1519.19,"end":1760.58,"speaker":"Richard Rohlin","text":"And the third man, the third man, a guy named Fintan, he throws himself into the sea. And when he throws himself into the sea, he changes into a salmon. There's a lot of shape shifting in Celtic myth and turning yourself into a salmon is one of the main things that you would turn yourself into. It turns himself into a salmon and then later on into a bird and so on and so on. And it's because of this that Fintan survives the great flood, survives the flood of Noah. Not only does he survive the flood of Noah, but he survives every single successive invasion, like every single successive generation. And he's the sort of the one who tells about it all like in kind of the, the idea, you know, when he, you know, is able to tell the story to the first High King of Ireland of all the generations that came before and so all the way back. Like even there's this idea of like a residue from before the flood, right? Which is, which is, which is something that shows up in a lot of world cultures, right. Obviously it's there in Gilgamesh and it's there in other things, but this idea of a residue before the flood, something like a seed, something that survives before the flood, like even. It's difficult now in a time in an age where people are so widely divorced from their food to understand how incredibly important the salmon were not just for like, so that people could live and eat in, in the, you know, in ancient Britain and in Ireland, but also the way that the, the salmon, the, the place that it took in, in the, the sort of the mythological, mythological consciousness, right? As the, as a thing that goes out and returns, right? And the thing that, you know, like it, the salmon, the salmon come back to the river like and they always, they always home back to the place that they're from. They always home back to the place they're from. They come back to the river, they're in to spawn and then to die, right? And then it's like out of that death is going to, is this new life is going to come. So it's, it's. And, and somehow like this, this figure of Fintan is, is related to that and there are other really similar figures in later Irish myths that are basically the same idea like this, this, this, this residue or this, this guy that's left over from a previous age. He's usually got shape shifting powers, he's usually a poet and, and he's able to remember the stories of what happened before because he was actually there. Yeah. So then the next group that come along are the, are the Parthalon and you're going to really enjoy this. So they came from, they basically came from either like Sicily or maybe Greece. And actually most of the, most of the early groups are usually said to have come from Greece or Egypt or somewhere in whole kind of the biblical globe. And they do a bunch of different things. They are the ones who originate cattle husbandry they're the first people to keep cattle in Ireland. Which becomes like the main thing that you do in Ireland later on. In fact, the great Irish epic, basically the Irish Iliad if you will, is called the Cattle Raid of Coolie. And we are going to talk about it at some point because it's. It was one of my favorite things to read as a kid. Like it's one of those books somebody gave me as a kid probably because they didn't know what was in it. And then as a kid I read this and I was like, oh boy, this is good stuff. I see. Yeah, it's pretty spicy. They also originate cooking, drinking and dueling. Three things as everybody knows, the Irish love stereotypes are really old. I don't know what to say. So they are eventually either wired, wiped out by a plague or by an invasion of dog headed apes. Oh, right. I don't have a lot more to tell you about that right now, but I thought that was a very little interesting."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1760.58,"end":1780.11,"speaker":"Jonathan Pageau","text":"Yeah, it definitely is interesting. There is a whole connection between the dog headed men and also the dog headed apes. And you know, this is one of the theories obviously of the modern type scholars. They talk about how the dogged and man are basically just are baboons really. I mean people encounter with baboons. I think it's boring. It's a boring."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1780.19,"end":1901.12,"speaker":"Richard Rohlin","text":"I mean my main problem with that is like you act like nobody in the ancient world ever saw a monkey. Like, like half of, half of the Roman empire was in Africa, man. Like, like people saw baboons like anyway, so then the next, the next wave or the next invasion is. Is by a guy named Nemet who also comes from Greece with his four sons. There's a whole kind of an interesting thing about them. Let's see if I can find this several of them. Basically, man, the reason I'm paused people is because there's so many weird things here. I'm like they're, they're trying to all get out of my mouth at once and it's a little hard to prioritize. So Nemed, he comes and comes from Greece with his four sons. A bunch of his sons actually drown trying to seize a tower of gold in the sea. There's like this undersea kingdom and a tower of gold and everything. I think we'll come back to this. And Nemed is the one who clears the plains and builds the royal forts. So basically you have kind of these iterative things that explain why Irish culture is the way that it is in mid, in the middle Ages, Irish culture was. Was basically organized as, as. As was much of the culture of Northern Europe organized around like these networks of hill forts. And then eventually that's. Those are where the monasteries will be built later on. And so we got cattle husbandry, cooking, drinking, dueling. We get the network of forts that comes, you know, is established by the successive generation. And basically, basically they are. They come into conflict with this group known as the Formorians. Formorians are not one of the six traditional invasions, but they seem to be sort of like, basically the Irish or the Celtic equivalent of the. Of like titans or the giants."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1901.12,"end":1901.8,"speaker":"Jonathan Pageau","text":"Okay, Right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1901.8,"end":1929.44,"speaker":"Richard Rohlin","text":"They're these really monstrous kind of spirits that, you know, like chthonic spirits that have to do with the, like, uncontrolled nature, something like that. And so they mostly get killed. About 30 of them flee back to Greece. And there's this idea later on that the, The, The. The. The. The next group that comes, which will be the Fearbolg that they're going to be. You know, basically they're the survivors of those guys and they're coming back, trying to take back."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1929.44,"end":1930.64,"speaker":"Jonathan Pageau","text":"They take revenge or take back."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1930.64,"end":1983.96,"speaker":"Richard Rohlin","text":"So this is the fourth invasion. These guys also come from Greece, where they've been slaves. That might be what the word firbolg means. It means. Might mean something like, like the men of pouches or the men of breeches. But also there's this, I mean, this word bog, funnily enough, same word in Dante, like the bulgia in, in. In. In circle eight of. Of Inferno. Right. This is an old Indo European root that means like something is swollen. And so it could also have the, like. It can have the idea of like a pocket or a pouch or like some, you know, kind of compartment that swells out. It might also, in the case of the Fearbolg, it might have something to do with them being like, swollen with rage. That's a pretty. That's one possible etymology. There are some people that thought they were actually related to like, the bell guy, like the Belgians. And maybe there's a relationship between the two of them there."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1984.6,"end":1986.28,"speaker":"Jonathan Pageau","text":"They're swollen with rage all the time."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":1987.08,"end":2320.83,"speaker":"Richard Rohlin","text":"See. Ah, see, everybody has somebody else. They joke. The English pick on the French. The French barely pick on the Belgians. That's it. Okay, that's cool. All right. So, yeah, so they come and they divide Ireland. They're the ones who divide Ireland into the traditional fifths. And the interesting thing about them is that the fear bulk don't fight against the fomorians. In fact, they seem to fight alongside them. Later on, they seem to make some kind of rapprochement with the. With like these, these monstrous nature spirits. So the next group that comes and invades Ireland after the fear bulk is. And these are the ones who are the most probably well known would be the two after dawn. And they were told, unlike the one, unlike, unlike everybody else who comes from like Greece or Egypt or whatever, we're told that they come from the north of the world and that they, that they're. And they're experts in magic. Like these are the fairies, these are the old Celtic gods. That's basically who they are the most, you know, Lug being like the main. The main, you know, their main champion who is also like the main Celtic war God, right? And so they come and they show up and there's a whole bunch of battles with the Fear Bolg and the Fomorians and basically eventually the Tuathedan win all of these battles, drive everybody out and take over Ireland. And these are the, the. The sort of like the most strongly. Sort of the group that we most strongly associate with fairy traditions later for a reason. I'll explain in a moment. But the, but they. I mean, one of the things that's really interesting to me is this idea that gets developed kind of in parallel, gets developed in. In Celtic, like British Celtic, like in other words, like Welsh lore is the idea of like the great treasures of the land. So the two at the Don have four great treasures. And then later on there are, you know, the things develop into. There are 12 treasures of the. That the 12 treasures of the island of Britain. You know, later on, you know, this idea that Merlin or somebody else like cultivates these 12 treasures. And the treasures are always items that are important to kind of like the Bronze Age or like early Iron Age civilization in some way. So I mean, as for an example, the four treasures of Batua da Dan are the Stone of fal. And I'm not a Celtcissist, so if I'm mispronouncing some of these old Irish words, everybody, you're going to have to forgive me. I'm sure I know somebody out there, you know, Martin Shaw, if nobody else will correct me later. But. So this is the Stone of Fall is the stone that cries out beneath the king who takes the sovereignty of Ireland, right? And so it's like. And this is something that shows up again in lots of like even today, like the Blarney Stone, right? You have this idea like there's sort of like this Magical stone, which might be related to some of, like, the later on the later Grail stuff, and the connection between the grail and the Stone of Preparation in Jerusalem, which we talked about earlier in the series. But this. The stone that cries out beneath the king who takes Ireland, like, whoever is the High King. Right. And so it's how you sort of know there is the. And each of these treasures, there are four treasures. Each of the treasures comes from these four legendary islands called the Four Jewels, that are, like, supposed to be in the very north of the world. So, you know, historians might try to, like, tie that to, like, the Hebrides or something like that. It doesn't really matter for our purposes, like, for mythological purposes. But the idea that there are these four islands, and each of these four islands had this beautiful. Has this beautiful, like, city on it, and the Tuathedon as. As powerful magicians or gods or whatever they are, that when they come to Ireland, they come. By the way, they don't arrive on ships, they arrive on burning clouds and invade the island. And they bring with them. They bring with them each of these four. They. They bring with them each of the, you know, these four treasures, one from each of the islands. So there's a Stone of Fall, there's the Spear of Lug. This is basically, you know, just an invisible weapon. There's also the. The. A sword. No one ever escapes from it. Once it is drawn from its sheath, nobody can resist it. And it glows like a bright torch, like it's a magic sword, probably, you know, close to the original magic sword, basically. I mean, like, as the idea of, like, a magical sword that shines with light, and that's completely irresistible. There's a ton of other stuff downstream from this, like Caliburn or Excalibur in King Arthur's sword and so on. Like, there's a ton of. There's a ton of examples of this all the way down to Tolkien. Right? But this idea of a blade that shines brightly and that nothing can resist is a very Celtic idea. And then there's also a cauldron, a magical cauldron which basically produces unlimited amounts of food and drink. And this is, like, about half the magical items are that kind of thing, like a Horn of Plenty or like a magical mother or something like that."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2321.78,"end":2325.62,"speaker":"Jonathan Pageau","text":"Nowadays, a stone, a cauldron, a sword, and a."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2326.42,"end":2448.6,"speaker":"Richard Rohlin","text":"And a spear. A spear, yeah, yeah, very. I mean, like, very evocative, very kind of the word for this, but, like, the fundamental things that you need for civilization, that's the idea here, right, because the, The. The. The conflict between the two at the dawn and the Formians is something like the conflict between the gods of civilization versus the God, like the Chthonic. You know, it's like the Olympians versus the Titans, right? It's that kind of a thing. And. Or the Olympians versus the Giants. It's that kind of a thing. And the interesting thing is that the Irish trace themselves to the people who sided with the monsters, which is, I think, pretty awesome. So the fir. Bulk who fight along with the Formorians against the Tuathedan. And then later on, the final group that comes, and this is the group that the Irish. The medieval Irish trace themselves back to is the Sons of Mill or the Milesians. And the Sons of Mill or the Milesians, they come from Spain. This is not like an accident, by the way. Spain was Celtic during the ancient world. It was Celtic. Everybody remembered that, by the way. And so he shows up. So the Sons of Mill, they show up in Ireland. There's a ton of amazing stories. There's a ton of amazing stories here which we will maybe go into in kind of a future thing. There's a bunch of stories that I want to kind of abstract it, but. But most of the time, medieval Irish writing is like. It's just like sometimes just a wall of names and then like these little. These little, like excerpts of story or these long poems, things like that. And so it's rather hard reading for modern people. And so what you have to. What I want to do, reading numbers."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2448.6,"end":2450.28,"speaker":"Jonathan Pageau","text":"In the Bible, it's like that, but."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2450.28,"end":2653.19,"speaker":"Richard Rohlin","text":"Worse, you know, maybe only because I grew up with numbers and I grew up with this, and so I'm used to it, but. But yeah, it's like these, like, here's a wall of names that you can pronounce anyway. And then somewhere at the end of that wall of names you get a little. You get these little, like, vignettes of, like, weird things that happen. Like the Tuathan, when the Milesians are coming to Ireland and they're. They're basically coming because they're. They're. They're. They're coming for a good Irish reason to do anything, which is revenge, right? And so they're. They're. They're headed towards Ireland and the Tuathedon, like, they disguise the land to make it look like a. Like a pig swimming in the. In the ocean. And there's all this other stuff. Eventually they fight these battles. The. Oh, and the Tuathedon, they're the ones who basically invent Druid is like Druidic magic and like Druidic practice and things, by the way. And so they fight some battles and the Tuatan say we'd like, like a three day ceasefire. And the Milesians say, fine. They agree to it. And so they say, and you have to wait like a certain number of hours off the coast in a boat, right? And then while they're waiting off the coast in the boat for three days, the Tuathan call up all these storms and try to kill them. But then the, the harper, the main harper of the Milesians, he. He sings a song that calms the storm, right? And so then the Tutana are like, all right, well we can't really, we, we better broker peace. So, so they say we'll divide the land between us. And the harper, I think his name is Aramon, but that might be wrong, I can't remember right now. But they all look to him, they say, well, he's the smartest guy, so he can divide the land. The idea is again, this guy is sort of a bard in the Celtic tradition, right? And so they say you can divide the land fairly between us. And so it's got to be exactly even. You will take half and they'll take half. And he says, yeah, no problem at all. For the Milesians, they can have the upper world and the Tuathedan can have the underworld. It's half and half. And so there's like a little bit of trickery there. And so then the Tuathedan all go down into like, they go into the sea, the she mounds, they go into the earth, they come into the other world. And that sort of like explains why is Ireland the way that it is now, Right? Is that. And so again, there's something interesting to me about the Tuathe de Dan being associated so strongly with civilization and the sort of like the arts of civilization, right? What are the things that you need to found, you know, a civilization in the Middle Ages? Well, you need stones and you need a king and like the idea of a stone of kingship, those two things go together because who rules over the city, right? And then you need, you need weapons and you need the ability to like provide for everybody, feed everybody, right? So even in their treasures, like these are the fundamental treasures of civilization, but then those are the, those. But then basically they get like civilizations stolen from them by this trick and then they have to go down, they have to go into the other world."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2653.35,"end":2661.47,"speaker":"Jonathan Pageau","text":"Yeah, interesting. I mean, it's interesting because in some ways this is the duality of civilization, I think, is being represented very well here."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2661.47,"end":2661.79,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2661.79,"end":2713.83,"speaker":"Jonathan Pageau","text":"We have the same situation in the story of Cain, which is, it's reversed, but it's that Cain gets ejected and becomes a wanderer. And then because of that, then he found the city. And so you have, and you have this image, right, in analytical mythology that the idea of Hephaistos are these underworld gods that are the origin of technology and of weapons and all of this stuff. So, you know, the duality of it might actually might seem contradictory and in some ways it is, but it's contradictory in the sense that there's a relationship between, you could say the underworld, the world of death and civilization because they play off each other, right. They, they kind of, they act as, you know, civilization is a way to prevent, to protect ourselves from that world."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2713.83,"end":2714.03,"speaker":"Richard Rohlin","text":"That."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2714.03,"end":2718.23,"speaker":"Jonathan Pageau","text":"So it's not surprising that you find this, this relationship in stories like that as well."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2718.87,"end":2762.42,"speaker":"Richard Rohlin","text":"Yeah, so there's, there's a lot of, I mean this, this particular work, the, the Book of Invasions, which you can find arts of online. It's kind of hard to find a full English translation, but is full of just very strange, wonderful things that we haven't even talked about today because it's like, it's too much. But I will try to, for our next video, what I'm going to try to do is to kind of excerpt these, you know, like some vignettes. So you get a. So people get a sense of the storytelling style and things like that. Actually a lot of it is just poetry. It's about this guy and how famous his cows were and you know, stuff like that. So it's like this, this sort of thing maybe would be more important to you if you, you know, like, if you like cattle, if that was your whole life, you know."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2762.42,"end":2774.74,"speaker":"Jonathan Pageau","text":"But what is the interaction between the different. So, so is there this idea that all of these people like the ape, the ape, dog headed apes and stuff like that like that they're still kind of lingering."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":2775.78,"end":3033.7,"speaker":"Richard Rohlin","text":"Yeah. I mean, so this is the, this is the thing like, like some of these earlier groups, like the fear bull, they'll come back later on in like the Ulster cycle, which is like again, that's like the big, that's one of the big main Irish mythological cycles. Like. So a lot of these groups will come back and throughout later Irish and earlier Irish stories, like you'll, you come across people who were like. And it's, it's this very kind of common thing. One of the main stories that I want to look at in our series on Ireland is going to be a book that's sometimes called the Colloquy of the Ancients. This is a hugely important work of universal history. Basically, it's a book that explains the place names in Ireland, why the places in Ireland are called what they are. But actually it's a story about St. Patrick meeting and baptizing the last giant. And then he travels around with him and the giant tells the stories of like, hey, what about this? Great. And by the way, I mean, this is really sad. I have. I had an extensive book of notes on the Colloquy of the Ancients that I've been studying for months and months and months and it got left out in the rain and ruined. No, that was so sad. But anyway, it's okay. I have most of it in my mind, but. But I'm working on reconstructing my outline for those videos, but we'll probably spend more than one on it because it's. It's got so many important details about kind of like early Indo European civilization and so many important details about how did Christians in Ireland, where they encountered this stuff in kind of a different way like we've talked about all along. Like, there's always what C.S. lewis referred to as like the Christian right and a Christian left. And the left is always trying to get rid of things. Right. So that's actually the more extreme, rigorous, who are trying to like purge all the paganism and everything. And there's a right that's like, no, there's good stuff that we need to hang on to here. And most of the Irish. Most of the Irish fell into the second category. So they're always trying to figure out how to save things. But this is actually. It's dealt with explicitly in the story. We'll come back to this, but I'll just tease it in the story. St. Patrick. Everybody knows St. Patrick has two guardian angels, by the way. Maybe the rest of us only rate the one. But Patrick of Ireland, the Salmon of Heaven, as he's called, he has two guardian angels, by the way. This is awesome epithet. But anyway. And so he's sitting there and he's listening to basically the last Irish hero or the last Irish giant telling. And he saw these guys, there's two of them. He saw them coming towards him with a cloud of demons over them. So that he baptizes them and all the demons go away. And then they sit down to have dinner and he says, tell me about like what was the greatest horse you ever saw or who was the great. Who had the best hounds back in the old days and all these different things. And at some point, Patrick is like, maybe it's not good for me to think about these things because it's keeping me from prayer. And so he prays about this and his guardian angels come to him and they basically tell him something to the effect of, it's okay, all of the bad. All of the stuff in this that's harmful is going to be forgotten. Wow. Right. And so there's this. This idea that, like, the stuff that's, like, when it comes into contact with Christianity, the stuff in paganism, that's like. That's, like, harmful or this is detrimental. It's going to be sort of like it'll be left behind. But the stuff of the remnant. And again, this is what. This is really like the. The main idea in Irish, you could say, like Irish mythology or folklore, like, whatever. I don't know. There's not a good name for it, actually. But let. Universe. That's why we've been using universal history. But like, the main idea in Irish, universal history is the idea of the remnant from whatever came before, like some. Before the flood, from the previous civilization. Right. And the way that that remnant carries forward and it carries forward through the medium of story. Right? It carries forward. It's always. It's always poets. It's always poetry, Right? That's the thing that you always. When you sit down with, like, one of these people, if you are ever. If you're ever, you know, like, you run into, you know, a man who can change into a salmon and then into a hawk, and he remembers the life before the flood. Dear listener, like, if you ever run into this guy, the thing you need to ask for is the poetry."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3033.78,"end":3034.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3034.82,"end":3073.02,"speaker":"Richard Rohlin","text":"Like, you know what, what. Who were the great. Who had the seven greatest hounds in Ireland? Right. Who had the best horse? Who had the. You know, these are the kinds of things that you want to know. And so that's what the. That's what the Colloquy of the Elders of Ireland is. By the way, Martin Shaw has done an amazing retelling of it on his substack. Wow. We should really have him on to talk about it. But he's done an amazing retelling of it on the substack. And of course, it's got this fancy scholarly title, the Colloquy of the Ancients, which he's renamed to Old Men Talking, which is what it is. It's just old men talking. Anyway, I have a question about these."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3074.31,"end":3084.95,"speaker":"Jonathan Pageau","text":"Do The Irish have a connection to Troy. Did they, did they trace, did they develop that story or they only have this idea that they are connected to people before the flood."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3085.19,"end":3094.39,"speaker":"Richard Rohlin","text":"So the Celts of Britain have an explicit connection to Troy and that's the Brutus story that we talked about."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3094.47,"end":3094.91,"speaker":"Jonathan Pageau","text":"Of course."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3094.91,"end":3130.26,"speaker":"Richard Rohlin","text":"That's right. We'll revisit again. At least in this particular book, at least in the, in the, the invasions of Ireland, there, there is not an explicit connection to Troy. Yeah, there's, there are, there are other connections to see here. There are other connections to kind of important locations in Italy. But are not Italy in, in Western Europe? Mainly Spain and Egypt and Greece. But I think the idea is that all of this is kind of like before that."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3130.42,"end":3142.62,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting, I find it so interesting the whole Egyptian connection also because the, the Egypt really is considered in a lot of stories as the strange culture."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3142.62,"end":3145.18,"speaker":"Richard Rohlin","text":"Like it's a strange culture, but it's also the oldest culture."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3145.18,"end":3167.82,"speaker":"Jonathan Pageau","text":"Like it's the one that is, that is the oldest. It's like a, it's somehow connected to like pre flood world. And that sounds like it seems to be continuation of the, of the pre flood world. But they also is the one that's least connected to all the others. And so it has this particular function. But interestingly enough too is that Irish monasticism seems to Egyptian."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3169.02,"end":3215.66,"speaker":"Richard Rohlin","text":"That's right, yeah. So this will be something that we're going to talk about in a future video. But again to just tease it a little bit, there are lots of indications that the Christianity that came to the British Isles and particularly to Ireland probably came from the Egyptian desert. And there's plausible historical reasons this could have happened. And there's different archaeological evidences you can point to. This kind of gets us into the messy world of talking about Celtic Christianity, which as I've said before, is kind of a wax nose. People like to shape it into whatever they want it to be, though a lot of times like it's like, it's just like shorthand for New Age."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3215.82,"end":3216.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3216.14,"end":3216.78,"speaker":"Richard Rohlin","text":"And the thing that you have to."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3216.78,"end":3219.02,"speaker":"Jonathan Pageau","text":"Understand that's what they do with Egypt too, by the way."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3219.26,"end":3411.05,"speaker":"Richard Rohlin","text":"Yeah, you're right, you're right. That's right. But the thing you have to understand about both Egyptian Christianity and then also Irish Christianity. And to me this is as good evidence as anything that they're related is that these are actually the most hardcore, most rigorous versions of Christianity that existed in the, in, in, in the, the medieval world. So I mean, as you know, for, I mean most of the rigorous heresies basically come out of. Come out of the Egyptian desert or, you know, Britain, Ireland, right? Like that's, you know, it's like, I mean, Pelagianism, people forget Pelagianism was a rigorous heresy, right? And. But so was Donatism. Like, they're two opposites, but they're both, you know, founded in this rigorism in Irish monasteries in the Middle Ages. Okay? So just to get a sense of how hardcore they were in Irish monasteries in the Middle Ages, a newly baptized monk. So they baptize you and they make you a monk. So this is not just like a layperson, like you and me, living the world, raising a family. A newly baptized monk, somebody who's dedicated their entire life to living this ascetic experience, this life of holiness, was not even allowed to receive full communion in both kinds until three years after they've been baptized. So, like, they, they were like, really hardcore, like, took things really seriously. And I do plan, like on doing four or five episodes and we're going to talk about mythological stuff, and then we're going to talk about the conversion of the British Isles. And one of the things that we'll see is that this rigorism is one of the problems that the Celtic Church, or like, you could call it the British Church or the Irish Church at that time. So one of the problems that they ran into with the Augustinian mission when St. Augustine of Canterbury comes to England and he's there and he's got basically letters from the Pope that says, we're going to, you know, let's reunify the whole church here in the British Isles. And the British bishops were not into it at all. And one of the reasons, one of the reasons is that British Christianity had kind of taken this sort of weird turn on its own, and it had to be sort of brought into line with the rest of the church. And this is symbolized by the way they're doing the tonsure and also the day they're celebrating Easter and things like this. And those things seem trivial to us in retrospect. But you got to think about if you put yourself in the place of a medieval pagan in the 6th century, and you see there's two groups of people and they're all. This group over here cuts their hair one way, this group over here cuts their hair another way. And then you see that their rights of initiation are different because the Celtic church got to doing baptism. Kind of weirdly talk about this. So the rights of initiation are different, and they don't even have the same feast days, but they're not even celebrating on the same day. You could be forgiven thinking these are two completely different religions. I mean, why not? You know, like, you don't know about all the, like ecclesial politics and everything going on. And so anyway, so the, the Celtic church actually got out of line. And this is, this is the other thing that I'll say is that you have to be very careful, ideally taking."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3411.05,"end":3413.17,"speaker":"Jonathan Pageau","text":"The side of Rome in this question here."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3413.17,"end":3548.42,"speaker":"Richard Rohlin","text":"All right. I mean, I, I mean I'll be up, I'll just say up front. I do take this like, like, like, like the, the Synod of Whitby did what it was supposed to do. Like, like, like, you know, they needed to be like in line with the rest of the church as far as the date of Pascha and under obedience. And the Pope at the time was Pope St. Gregory the Great, who's, you know, as bishops go, you know, kind of wrote, literally wrote the book on it. Actually. His book on pastoral care was like the handbook for how to be a pastor in the Middle Ages. So anyway, and of course he's very important in our own orthodox tradition. He wrote, he's the person who is credited for writing down the liturgy of the pre sanctified gifts. So. And anyway, so all that to say, all that to say. Yeah, I'm mentioning all of this because it's important that we don't over idealize that. I'm getting ahead of myself on like two or three videos that even trying to talk about Ireland is like. Yeah, it's just like, it's one of those things where symbolism happens. Like even trying to make notes or make an outline for today's video was just like so impossible because I had all these little things kind of popping up as I was trying to write. But the thing, the thing that I would say is it's important not to. When it comes to Celtic Christianity, things like that. First of all, we know almost nothing about it because it didn't survive. And the second thing is that it's important not to over idealize these things because there is a kind of, one of the things that comes with the symbolism of being on the edge is that you are, you do tend towards certain kinds of extremes and those extremes are very often unhealthy. But what's beautiful about it, what's really wonderful about it is its capacity to preserve. Right. So that you can have these things like what's good from the previous ages, even the pagan past, the things that are good about that have this Capacity to be carried forward in a way that they weren't, for instance, in medieval France, to pick something that's at the center. Yeah. Because medieval civilization is mostly French. So give them their due there. Maybe that's a good place to."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3548.58,"end":3550.66,"speaker":"Jonathan Pageau","text":"I think so. I mean, it's a great introduction."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3551.06,"end":3727.57,"speaker":"Richard Rohlin","text":"Yeah. And again, I apologize that this is so scattered. Like, it is difficult to talk about. It is truly, like, there's partly because there's so much material and it's just so all over the place. It's just all over the place. But what I want to do in future videos is we're going to do another video or two looking at some specific examples from Irish mythology. I want to look at the. And then look at the colloquy of the ancients and then introduce the Ulster Cycle, which is like the big. Again, this is like the. Like the Irish Iliad. And then. And then after that, we'll move on to looking at the kind of the ways that the British Isles were converted, starting with the. Which happened in like, multiple. Happened multiple times. Like. Yeah, you know, Christianity, the religion. So nice. They did it twice. Like, there's going to be. There's going to be, you know, there's like a Celtic conversion and then there's multiple waves for the Anglo Saxon conversion. And I'm going to look at all of that in a lot of detail. So that's probably going to be like five videos. So everybody just, like, you know, buckle in, be patient. We're going to get to all of it and hopefully by the end you'll understand why I'm so terrified of talking about all of this stuff. But at the same time, there's something about it that is really, like I said, I mean, there's something about even the kitsch. There's something about even the kitsch that's really durable. And especially as Americans, when we so often don't have a sense of where we're from or who we are, I think that's part of the Celts as the sort of perpetual underdogs and, you know, the only people who. Who have ever, you know. Well, not the only people, but like one of the. One of the few people groups who have ever become famous through losing, you know, like. Like over and over again, you know. But there's something. There's something about that, that. That took root here in American soil, like, very early on, very early on. So my ancestors, on one side of the family, it's sort of like English Quakers and the other side of the family, it's like Scotch, Scotch Irish. And the funny story that I'll end with is that when the Quakers were settling, they were settling too close to the Indians, the Native Americans, they were settling too close. And of course, Quakers are pacifists, Native Americans less so. And so they said, what can we do about this? And so that's when you have these massive waves of immigration from Ireland and Scotland coming. And. Because what they figured out was we could get all of these Scotch Irish. And there's a group called the Ulster Scots, who are basically Scots who settled in Ireland for a little while and then came over to the US and that's my family, basically. And they basically said, we're going to get them to come and settle between us and the Native Americans between us, so that. So that they could fight it. We won't have to deal with it. And so, you know, there's passive."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3728.13,"end":3730.21,"speaker":"Jonathan Pageau","text":"That is, you know, they're able to fight for us."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3730.61,"end":3762.29,"speaker":"Richard Rohlin","text":"That's basically why Appalachia, here in the U.S. like, that's why it is what it is. That's why it exists. And. And we just got back from a trip through Appalachia, you know, as a family. And the fun thing is that geologists will tell you that that range of mountains is the same as the Scottish islands, like back when all the continents were all together. It's like one contiguous range of mountains that split off. And Appalachia is the. That is the place in the United States where you can still run into fairies."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3763.33,"end":3766.21,"speaker":"Jonathan Pageau","text":"Well, that is the best place to finish for sure."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3766.21,"end":3767.41,"speaker":"Richard Rohlin","text":"So I'm going to stop right there."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3767.57,"end":3776.13,"speaker":"Jonathan Pageau","text":"All right, everyone. And so get ready. We're going to have several episodes of the Universal History of Ireland. I am definitely already excited."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3776.37,"end":3778.21,"speaker":"Richard Rohlin","text":"Crazy, guys. Gonna be crazy."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3779.33,"end":3786.13,"speaker":"Jonathan Pageau","text":"All right, everyone. So it was wonderful. Thanks, Richard, again, thanks for taking us on these trips. I love it and I know everybody else does, so thanks a lot."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3786.53,"end":3786.93,"speaker":"Richard Rohlin","text":"Yep."}
{"episode_id":"SW - #350 - 2024-07-26 - Richard Rohlin - Universal History - Ireland, the Remnant","start":3787.97,"end":3803.01,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
