{"episode_id":"SW - #145 - 2021-03-02 - January Q&A","start":12.56,"end":8840.72,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I hope you are having a wonderful beginning of the year. I shouldn't laugh. I'm laughing because things are nuts and we all knew that they would be nuts. But it's unpleasant to go through the nuts stuff anyways, even though we all knew that it was going to be crazy. So it's good to see some of the people in the chat. It's good to see Gridwald. Grim. I think I recognize you from the. The. What is it? The. The. The. What's the name of the channel? Man, my. My brain is gonna be horrible tonight. It's not gonna be good. And so Brad's there, Neil is there. Jacob. Nice sorting yourself out that channel. My goodness. Sorry about that. All right. And so. All right, so let's do this. Let's go. I wanted to make a few announcements. As you see, I'm slowly starting to inhabit this space. I'm still not totally ready yet, but it's. It's getting there. It's getting there. I'm starting to have stuff that I'm going to put up. Some stuff that I saw. Like my Adam and Eve thing I stole from the flood. I got it out of the water and it still looks okay. There's a bit of rust on it I might have to take care of, but it looks okay. And I put my brother's book up there and so I'm gonna have some books in there in the. So I'm just setting up. I'm happy. So this year is going to be the year that I'm going to redo the website. One of the reasons to redo the website is to make it more streamlined, make it more easily accessible, especially the blog posts that are being done, you know, that it's not super streamlined. I want people to be able to get to the content easily and that the content be featured. Another. Another purpose to redoing the website is that, you know, I made this big thing on Facebook, on the Facebook group saying that, you know, it's. Facebook and Twitter are becoming dangerous spaces to rely on. And so I thought, okay, let's move. Jacob the who you've seen on my channel before, he's Jacob the Fool. In the chat, he. He had had a Discord channel that was talking about symbolism. So we thought we'd move there and so we did. A lot of people did move to Discord, but Discord's different. The way that it works there isn't like the post and. And comment functionality. It's more Like a stream conversation. So it's not for everybody. Anyways, so. So one of the things I'm going to be doing, and I'm kind of announcing this to all the moderators here as well, is I'm going to be having forums on the website. And so that way. And the website is being hosted by someone named Matthew Ramer and a company called Content Safe. And so they're very deliberate about making sure that the content will at least be protected to some extent if, if things start to go off the rails, if there starts to be attacks. And so if we have forums on the website, that way we can. That way we can at least control more and we can decide the functionalities we want. It's all. Have some discussions with Lisa and Lisa's there, by the way. It's like in. It's like 3 o' clock in the morning there for. I think it's like worse than that. Anyways, so Lisa and Brad and Jacob and all the moderators and decide how. What kind of functionalities they want for the group. I think it'll be better to have that on the website. So that's like a big change that's going to be happening soon. I'm working with a marketing company now to kind of set that up and to centralize everything. So in the move, what we want to do to protect ourselves is we want to focus on the website because we have control over the information, over the people we know. Like we can know who's there and we can contact them if things start to get weird. And so what I want to encourage people to do is to. Is to sign up on the website. If you go to the website, at the bottom of the page, there's like a. There's like a subscribe to the symbolic world. And the idea is if you're subscribed, then you know, you'll be connected through the website. So if YouTube decides to do whatever and we have to go through Bitchute or through another video service, then at least you'll get notifications through email for the video. So I'm encouraging people to do that, you know, so that we. We're ahead of the curve if things start to go weird on us. And so to encourage that, I'm going to do something. All right, so to encourage people to sign up for the website, I'm being like a real YouTuber now, you'll notice. Watch this out. All right, check this out. So I'm going to raffle off two things. I'm going to raffle off a Image of everything. Sweater, this dark sweater, which is. What is it? What size it. So it's a large, medium sweater. And I'm also going to raffle off a tote bag with our patron Saint Michael, so that he can protect your stuff. And so next month at the beginning, at the Q and A, before the Q and A, I will raffle off one thing for everybody who subscribed to the website and one thing for everybody who's supporting me as a patron on the website or through Patreon or whatever. And so if you're so, in a way, if you're already supporting me on Patreon, it's like two. You get two chances to win this. So this is just to kind of. I know it's. I know, because I hate going on websites and signing up. So I want to, like, really entice you to go and do that so that, you know, in a few months when things start getting really loopy, we will be able to continue to have discussions on symbolism and to kind of hold the line, at least for a while, until, until it gets so bad that then we can. But, you know, we'll, we'll, we'll. We want to be ahead of the curve. All right, so that's, so that's all right. Here we go. So, as you know, the way it works is that people that are Supporting me at $10 or more get to ask questions in advance. And, and then, then I'll go to super chats at the end. Usually it. Usually that's about as much as I can do. Like, it's hard for me to get into the, to the Q and A because it's just, it's already, it already lasts like almost two hours when we do it this way. So, you know, one day I'm thinking, so maybe sometimes I'll maybe have like 2, 2 streaming so that people that are in the chat can have a chance to ask questions sometimes. So anyways, for now at least, it's the best way that I found of doing this. And just remind you, if people write too long a question, like a really, really long comment, I probably will skip your question just because it's difficult to, like, read long texts and then answer them. Right. Mfprisl Michael. Sorry. From Michael. It says, did theology ruin everything? Did we focus too much in the west on juggling statements about faith like they were abstract formula and loss and thus lost their meaning? After a religious high school, I was able to catalog heresies based on minute details, like 19th century biologists catalog species. But I did not really get the meaning of the teaching before I listened to Lord of Spirits podcast. All they say is in line with what I was taught, but they make the abstract theology incarnate. So I think that it's not so much. It's not so much the idea that you need to think that. That it's useless or that it's not important. I think it's mostly that you need to balance. Things have to be balanced. So it's okay to be interested in theology and even to be interested in very minute theology. Some of the great. Some of the great people that I. That I love, like Sam Axis the Confessor, was. Was involved very, very minutely in some very, you know, how can I say this? Like, really, really tight questions about theology. I'm not that kind of person. I'm not that interested in that, but I think it's fine to do that. You just have to balance it out and know that theology is not going to save you. It's like having the right theology is not going to save your soul and that it has to be embodied. You know, your faith has to be embodied, your Christian life has to be embodied. And of course, your theology will help you to kind of orient yourself, but it has to be more than that. And I do think that these theological minutia has a meaning. Like it has a metaphysical meaning and an ontological meaning, and. And those actually kind of manifest themselves in the world. But I agree with you that a lot of times people don't seem to care or know or understand the relationship. And so because of that, it looks just arbitrary. And I've not. I think I've told you guys before, there are a few things where I don't totally understand them. I. I can see that the Fathers were fighting for this or that detail, but I cannot. I'm fine with it. I'm not going to go against it, but I also don't totally see how it lands in the world. You know, sometimes I do, sometimes I don't. So Kingsley asks, any symbolic insight on the Trisagian prayers. It's interesting. It's interesting that you ask that, because I've been thinking about that. I've been thinking about that a lot. You know, I've been thinking about trying to understand the version of the Trusagian prayer in the Orthodox Church. Like, what is the symbolic pattern that's there? And I have to admit with you that I don't totally feel like I have it. I can give you a general statement. So those who don't know, the Trusagion prayer is that it's usually holy God, holy, mighty, holy and immortal, have mercy on us. So it's like holy God, holy, mighty, holy and immortal, have mercy on us. So it's like three invocations of God, you know, three, three kind of titles of God or three invocations of God's different aspects. And it definitely has to do with the, with the idea, like a general notion. It has to do with the idea that we are joined with the angels because that holy, holy, holy comes from the, from scripture. The, the, the. This idea of the, the. The angels. That's this, it. The seraphim, cherubim, seraphim that sing Holy, holy, Holy Lord, Lord, Sabaoth, like Lord of the ancient of days. And so that you can see that it's related to that. And there are several prayers in the liturgy that we join kind of these Old Testament prayers of glory with like New Testament prayers. And so the idea would be that now the holy, holy, holy is, is trinitarian. Like it becomes trinitarian when in the Old Testament or for Jews, for example, they wouldn't necessarily understand it as trinitarian. So that would be that. But I struggle to see even in the Holy God, holy, mighty, holy and immortal. Like, is it a trinitarian thing? I'm not sure. Like, I'm not sure that it relates to the two persons of the Trinity. And if it does, I don't totally. I don't totally see it clearly. So I'm sorry about that, that I can't answer you in a better way on that. I always try to be honest. If I feel like I don't know something, then I don't know it. All right, so. Hi, Jonathan, can you talk a bit about. Maximus is writing about God's movement in the Unity Monad to Rest in the tried multiplicity, talks about the movement towards perfection and fulfillment, but having trouble grasping it. Yeah, well, that's one of those things where I'm going to have trouble grasping it as well, or not grasping it, but grasping what exactly is the relationship? Like, I can tell you my, my, let's say vision, like if when you say it the way you said it, for example, the idea of moving from perfection to fulfillment, it's, it's the question. It's this whole question about the Trinity is that, you know, there's a tendency to see the one as being higher than the many, as the oneness of God is being higher than the Trinity. But there's also a way that you can Understand it almost like the, like the opposite, where the three persons are like the fullness of divinity. They like. They, they. They. They fill out or, you know, are like the glory of the. Of the. The glory of the. The essence, you know. And so that's kind of the weird mystery in Christianity is this important on hypostasis or this important on the person as not just an embodiment of a higher idea, but an actual fulfillment of what that ideal is. So it's actually the revelation of something is somehow in some ways fuller than the principle that it has more. And that's like a. It's a strange thing. It's hard to totally understand it. But you, you see it, for example, in the whole story of Scripture, where this sense that the new Jerusalem or the heavenly Jerusalem is more than the garden and it's more in adding like it has the fullness of the city added to the. The primacy of the garden, let's say. And so that's as close as I'm going to get to understanding that. But I might be wrong. All right, so Josh the Mover asked the Mother of God, and some saints have allegedly been appearing to people lately telling them not to wear masks in church for state ordinance. My own church requires them, and I haven't been able to properly venerate an icon since I started attending in June. The consensus at first was to be patient and wait for the ordinance to pass. But it's beginning to look like that day may never come. Indeed, I'm a catechumen and I don't want to overstep my boundaries. But at what point is it the Church's duty to civilly disobey the state? It's never permissible for a laity to make demands of this sort to clergy. So this is what I suggest to you, is that you need to obey your authority. Like, you need to obey what your authority tells you to do, and the spiritual responsibility of what's going on will fall on them. That is, if they are making the wrong decision. And if I don't know about disappearances of saints and the Virgin, like, I don't know, I don't want to. I'd have no desire to pass judgment on that. But it's the authorities that need to be able to take the right decision. So if they're taking the wrong decision, and you might think so, and I might think so, we still need to obey the decision. That doesn't mean that we need to be. It doesn't mean that we can't find ways to make petitions or we can't find ways to express or to help or to ask and to wonder about the reasons for certain things. And so it is completely acceptable for the parish to question the authority. That's one of the reasons for. That's one. It's one of the natural aspects of what it means to be under someone is to question. But then ultimately, even if you question, you need to obey the authority, because if you don't, then what are you going to do? What are you going to show up in church without a mask? And then what? Like, you know, and then the priest doesn't want to give you communion and then you're in a fight with your priest and it's like the priest gives you communion. You can't take communion. So I don't know, like, what it would do to. Yeah. To do that. But, you know, there are ways to prod and poke and see, you know, how solid people feel. This, this, this restriction is in wherever it is you're living. Like, we don't need. We don't have church services now. We are. Our churches are closed right now. So. So, David Flores asks, is unrestrained self indulgence a symbolic element of the zombie? I feel like the rotten flesh has a connection to excess. Yes. Circumcision, indeed, as well. Insatiable hunger. Yeah. So it does have to do with the idea of this excess of eating and this, this, this slave to desire. So the idea of the zombie is a. Is a slave to one desire. He's such a slave to that desire that that's all that animates the zombie. There's nothing left in the, in the zombie except for that hunger. Right. The hunger for flesh. And so the, the. And the flesh is this kind of raw, outer flesh, like you said. And so it is the falling into the passion of, of. Of desire for flesh. Where you understand it in terms of eating or in terms of sexuality, it does have to do with the amps, the lack of restraint or the lack of aschesis, which is what circumcision ultimately also represents for the Christian. This idea of the circumcision of the heart, this removal of the outer influences the removal of the, of the weight of the flesh. And so it's like there's nothing wrong once again with the body, but it's rather. It's rather being a slave to this outside. Sometimes you have to remove the garments. Remove the garments of skin. So Roxanne asks, what do you think of the fairy tale found in the Grimm Brothers collection, iron John In 1990, the poet Robert Bly expounded it as a guidance for masculinity. He hosted men's gatherings to defend masculinity from a perceived threat. In those days, folk version is Wiley and the Hairy Man. I'm afraid I do not know. I do not know this. This fairy tale. So I'm sorry about that. It'll be. It'd be difficult for me to answer that, Iron John. Well, I'll definitely look into it, though. It's very interesting. Iron John. Okay, so I see there's. There's actually like a book about it, Iron Skin Man. All right, I have to look into this. All right, I have to look into this. If it's interesting, I'll make a video about it or something. I keep saying that and then I don't make videos about things. All right, man, I'm in a weird mood tonight. I hope I don't say anything stupid. Okay, so Jacob. Jacob asks a question about the Eucharist. Catholics and Protestants are in the endless tug of war between real presence and just a symbol. All right, real presence and just a symbol. Would it be fair to say that JP's and Orthodox stance would be. That would be a symbol without the just and this real? Yes, exactly. I've said this before, if I've said it in several videos where I once heard a deacon who actually then became a priest later, who said that Protestants believe that the Eucharist is symbolic. The Catholics believe that the Eucharist is real. And we Orthodox, we believe that it is real because it is symbolic. And I thought it was such a great way of talking about that. It's one of those moments where you feel like, okay, I'm at home in the Orthodox Church. This is where I belong. And so, yes, that's it. Is that because we don't believe that the world is arbitrary and because we believe that the world lays itself out through the divine energies of God, which underlay all of manifestation. Therefore, the world appears as full of meaning, full of pattern, full of light. And so it is symbolic. And therefore the present. The symbolism of the entire liturgy is. Is. Is also the reality of it, you know, so. Yes. So Pnuma asks, what are the Judges in the Book of Judges judging? To me, they don't seem to be functioning the same as the judges that Moses set up. It looks like they're not acting in some position of judicial court, but rather they are judging the nations that were oppressing Israel at the time. Yes, that's because for some, I don't know, why they call them Judges? They're not Judges. They. And I don't know why we call it the Book of Judges. They're. They're prophets. It's like they're just prophets. And so the Book of Judges could be called the Book of Prophets or something like that. And so they, they, they act as prophets, but they're, they're. They're different from the prophets that you find later, you know, like Isaiah or Daniel or Ezekiel. They're. They're prophets in the sense that they're kind of charismatic leaders that, inspired by God, you know, become momentary, like momentary inspirations for the people of Israel through the will of God. And so that's what they're doing, you know. And so maybe that's why they call them Judges, is because they want to separate them from just the prophet that has visions and then tells people about them. These are more like, you know, the spirit of God comes in them and then they drive a stake through someone's head. You know, like the story of jail and all these other wild stories in Judges. But the important thing about understanding Judges is that there are a lot of. There's a different narrative that's going on in the Book of Judges. And one of the narratives is that this is the effect of not having a king yet. So it often says there was not yet a king in Israel. And when it describes some horrific thing that happened or some really disturbing element. And so despite the fact that you find in Samuel this warning about having a king and how. And how in a way, there are dangers to having a king, there's also another discourse which is happening at the same time in the Book of Judges, which is that without a king, things are wild, like things are. It's difficult to have coherence without this. This permanent figure of authority above you. So that's one of the things that's other stuff that's going on in Judges. All right. And so White Ear 2 asks, do you see any symbolism in Bitcoin and other cryptocurrencies? I cannot help but see cryptocurrency as another iteration of the description of hierarchy. Caesar's inscription has been replaced with collective self interest. Indeed. And with cryptocurrency, trade can theoretically happen independent of any specific authority. Right now, the system works, but I wonder if it is sustainable and whether there might be some snakes in the Bitcoin garden. Do you see a cryptocurrency as a fundamental breakdown in reality? Or is trade something that can work in a peer to peer way without any authority. And so I do think that it is definitely a continuation of a breakdown. There's no doubt about that. And it is also a desire to remove authority from the system of exchange. And so what it does is, opens up a, it opens up a space for freedom. And so this is the thing. It's like, you can, you can see what it does. Like, this is, this is really, actually can probably really help you to understand what, what, what this, what happens with this kind of stuff. And so you can understand that like, let's say the, the closer something is to a kind of stability, right, Or a kind of anchoredness, then the more stable it is, but it also, the less possibilities you have. Okay, let's say it that way. And so the closer you are. So, so imagine that you have a system, monetary system, which is completely dependent, which actually, let's say you don't even have a monetary system. You just have gold coins or silver coins. You have coins in which the value of the metal is the actual money that is being produced in the land. And so it's like you have a piece of silver. Yeah, it might have the stamp of the king on it to say, to encourage people to think that it's real silver, but what matters is that it's a piece of silver. And it's like, it's almost like bartering, right? So it's like it has a value and it's directly exchanged. And so that is extremely stable, but it also lacks potentiality, lacks possibility. And so if you create a monetary system which is based on promise and which is based on the promise of paying, then it becomes less stable, but it also increases possibility. And what we've seen is that as we move towards the modern time, the government, governments have tried to add more possibility as much as possible. And so, and so in order to do that, they've. They've broken it apart from an actual value. More and more just kept breaking it, kept breaking it apart. And so to a point where, you know, now the difference between fiat currency based, that's. That's produced in Canada is. And a fiat currency which is Bitcoin. Like, the only thing that's holding it together is basically the authority of the state. So there is something. And it'd still be more stable than Bitcoin. But that's why Bitcoin is like this, right? Bitcoin is like, you know, what is it in 2011, it was like a. When. No, when was it? Like at some point it was like it was like $11 or something for a Bitcoin or $50 or something. And now it's like, I don't even know where it is now. 50,000 or whatever. And so that's the, that's what, that's what these type of unanchored systems of value will do, you know. And you can see it's similar to what's happening in the stock market. It's like the stock market has very little to do with the actual value of the companies. Look at the whole GameStop thing. But it's not just GameStop. That's just one glaring example that happened recently. But you can see that even during COVID and after Covid, people were surprised to see the stock market continue to rise because it has been detached from actual reality, like actual value. And so what it does is it will offer way more possibility, but it can also offer way more risk, and then it can also crash. So we all know that. And if you want to know, I myself am not interested in that stuff in terms of personal things. And let's. Like, I'm happy for people that are, and I, and I'm excited when people tell me that they just made, you know, hundreds of thousands of dollars of Bitcoin or of, of, of, of this shortstop thing that they're doing. And I'm like, that's awesome for you. But I really, for me, at least I don't. It's not something that I'm interested in. And if I do invest, it's going to be in, in things that are palpable and things that are, that have some connection to who I am and what I do, what I care about. So. And I don't care enough about money to just be in money. It's like I, I'd want to create something, you know, anyway, so that's, that's me. But. All right, so Luca Ascovic asks, once we put something into a certain frame that will come true in one form or another, for good or bad, how do we stop this process, these cycles? Or should we even stop them? If I got it right, Hindus call them karmic knots. Here are some examples. Almost anyone that was certain that Covid doesn't exist got the COVID with really bad symptoms. Whenever I made fun of someone, it always came back to bite me. Sometimes seconds, sometimes years later. So in the sense of, like, the whole idea of karma, I understand what you're saying. Like, this idea of if you attend to something, you know, then you, you, you hope you put it on the, on your horizon of possibilities. And so, you know, like, you Said if you, if you do something bad to someone else, you are putting that as a possibility. You're opening up that possibility in your world. And so it's not a, it's not a one. For one thing, like, I don't believe that there's like a, just like a, like a, like a really kind of really tight system, but there's, there's definitely a loose system of, of opposition and of opposites. And so if you, if you're not careful and you open up spaces for bad things by doing bad things, then you're in that world. You're, you're, you're, you're going to be in that, that space. And so it's going to, it's going to come back to, to get you. So Nikos says, would it be acceptable as a Christian to assassinate Hitler in World War II? You mean in like, it depends. I mean if you were, if you were an English soldier and you were acting under orders, it would certainly be acceptable to assassinate Hitler in World War II. Of course you might have to go to confession afterwards, but it still would happen. That's a weird thing about Orthodox, Orthodox soldiers is that although, although they, they, they're allowed to go to war and to kill people, they still need to, to go to confession and to kind of amend for their sins. So. So someone said that Bitcoin is 33,000usd. So yes, when I said 50 000, I was living in, I was more in like Canadian money. So that's probably similar. That's probably something like that. No, it's more like 40 something thousand Canadian. So. Timothy Aspaslaw. Sorry, Timothy. I never know how to say your name right. So. Hey, Jonathan. The more I re. I learn about Renaissance art, the weirder it appears to me. Drawing God the Father, painting St Peter at the left hand of Christ instead of his right cherubs as baby saints are drawn in the nude in a weird muscular body. I'm struggling to understand how the Catholic Church ever commissioned and approved these works of art or what was going on. And so I agree with you. Obviously if you've watched my discussion with, with Father John Strickland, you'll see that I obviously definitely agree that. I think, I think what happened in the Renaissance is a kind of neopaganism and, and, but it's interesting because it tapered off afterwards. And so like the great artists, whatever in parenthesis, these like, great artists like, like Michelangelo and, and Rubens and all these really excessive artists, you know, they were famous and we talk about them in there are all these big churches, but that kind of stuff would never have gone into, like, the normal churches. And so a village church would never have had something that would like that. It would have been way more sober, way more toned down, even if Baroque, it would have not been. You wouldn't have had, like, naked women, you know, cavorting around or whatever. It would have been way more sober. And so I think that that's an important thing to understand in terms of the excesses of the elites that happened during the Renaissance and the post Renaissance period, and a village church, which would have been probably way more conservative. But it really is, to me, a pagan moment in Christianity, the Renaissance. And it's a decadence. There's a decadence in the art that I didn't talk about Father John Strickland, but there's a decadence in the meaning. And so in the Middle Ages, there had developed this amazingly powerful relationship, kind of cosmic language of symbolism. And so in the Renaissance and after the Renaissance, the symbolism became more and more kind of hermetic and closed off and a little arbitrary, rather than based in scripture and liturgy. And so in an icon, you can understand what's going on because it's bathed in the world of scripture and liturgy. But if you look at. It's like, if you look at the image of the creation of Adam. So you look. It's a great. It's a great example. So you look at the image of the creation of Adam by Michelangelo, and you're like, what's going on? I mean, that's not the way. Even if you. If you first of all accept that they drew God the Father, which already is a problem. But let's say you say, okay, fine, It's. It's. That's. We. We'll look over that for now. It's like, why are they touching fingers? What the heck is that? What does that even mean? Like, what is that in Scripture? It says that he blew air into his nostrils. That's how he created. And he spoke the world into being, and he blew air into Adam. And so what is this? And so that's one of the problems of Renaissance art, is that there's a decadence in. Not just in the way that it's represented, but there's a decadence in the. The iconography, where all of a sudden it's like these things have become arbitrary and just like the fancy of the artist that is not this deep, deep plunging into the story and kind of engagement into the story. So anyways, you know, you got me ranting about the Renaissance again. It's too easy for me to do that. All right. And so. All right, so. All right, so Benjamin Rva, this is your. Benjamin, your, your question is a little too long, but all right. Because it's important. I will, I will do it, but okay, so I apologize. Okay. I continue to struggle with the nature of metaphysical status of higher level beings. When I hear you describe the angel of London or France, I hear what sounds like an emergent phenomena, although I also believe that phenomena phenomenon has its own kind of agency and consciousness feeding back to the material world. What I can't shake is the sense that this angel is contingent on the earthly, that if a nuke were to wipe out that city and all trace and memory of it, the angel would cease to exist and is therefore dependent on the earth for its being. And if this were true, I don't know how the same contingency would appeal applied to the Logos of God. Logos and God. If earth and human consciousness got blinked out of physical existence somehow. That is really not. This is not helpful. Like, that's not helpful. There's nothing in the Christianity I've come to know through you and Father and people like Father Andrew and Stephen on the Lord of Spirits that I'm not all in on and viewed from the emergent side of the coin, but I sense that to be a real Christian, I have to believe the eminent perspective of and his primacy is this where the logo and logos transcend manifestation. Please help. So, so a way to understand, for example, like a way to understand the idea that the, the, a way to understand the idea that the angel of London, the angel of London doesn't exist in time the way that we exist in time. And so it's, it's not, you can't really, you can't really understand the relation. And I think even Father Stephen talks about this in, in his podcast. So you, you have to understand things almost in a non linear manner to understand the ontological hierarchy of beings. And so the, the, the city, the angel of a city, you know, it exists in eternity in the mind of God. It's not just something, you know, in the fullness of everything. It exists and that city exists and the angel of that city exists as well. And so the problem is that obviously we can't, it's difficult, but it's difficult to move from this kind of linear time in which we see things come up and then go away, and then we see things are being born and dying and the totality of Everything in which all things exist in the kind of simultaneity of the resurrection, let's say, and in the simultaneity of this kind of this, this moment, eschatological moment where all things are revealed together. And this is a reflection of something like the existence of all things in the mind of God from all eternity. And so I'm not helpful when I use those. I use more technical terms like this. So I'm, I feel like I'm answering your question, but I'm not helping you because I'm using and using techno like philosophical speech. But the most important thing to understand is that for the angel. Okay, think about it this way. For the angel of New York to, for the city of New York to exist, it has to be moving towards something. It's a. The identity of, of something has to proceed towards a certain extent the manifestation for you to be able to recognize it. Right. That's why that's the whole idea in Plato that, that, that cogniz. Cognizing or that's not a word, that to cognate something to. To think something or to recognize something is to remember something. It's like you, that's. That's the thing that Plato had the intuition about. That's one of the things that leads to the notion that of reincarnation even is this idea that things have to somehow there's a certain type of pre existence that has to be there, there for something to be recognized. And so it's, that's what's calling you towards the logos. It's like it has for you to recognize something, it has to pre exist. I don't know how else to say it. Man, this is tough. This is not helpful. I feel like I'm not being helpful. So. Sorry, Benjamin. Okay, so Alex asks any thoughts on the symbolism of the GameStop situation. All these Redditors more or less spontaneously organizing to take revenge on hedge funds by weaponizing the stock of a few dying companies. GameStop, AMC, Nokia. This stuff is tough because it's kind of like there's something anarchy, there's an anarchist tendency about it. There's a. I, I kind of sympathize obviously with this because the elites don't care about us. And so I sympathize with it. But I also think that it's a very destructive move. It's going, it's going to increase the breakdown. But maybe at this point it's inevitable because. Because the elites are only financial elites and because the elites don't, you know, in the normal World, the elites of a country or a people had responsibility. And so, you know, that's why if you look at even, even in Roman times, the senators or the elites that made a lot of money from the conquest, they felt responsibility to then build buildings, like to make public buildings and to do, to have all these gestures towards the citizens of the city. But in our world, the, the elites don't care about anything. Like they don't care about you. They, they just want to make more money. And so because of that, it's inevitable that things like GameStop will happen. But it's definitely, it's definitely breaking things down faster and you know, whatever, maybe that's what we need. Who knows? Like, I'm not an accelerationist, but I also, at some point this whole crazy system is going to break down. It can't, it can't last forever. All right, so Bogdan asked, what is, what's the symbolism of the Israelites entering Egypt as high status honored guests but over time becoming class, second class citizens and slaves? I've been reading Genesis and Exodus in this contrast struck me, but I'm not sure what to make of it. So the solution to that question is Joseph. That's the solution to the quest to that question. The idea is that the reason why, the reason why Egypt saves the Jews is because of Joseph. And so this is a lesson for today, by the way. When the pharaoh forgot Joseph and then it says something exact, I think it says exactly like that, like the pharaoh no longer remembered Joseph. And then when the pharaoh no longer remembered Joseph, then the Israelites became slaves in Egypt. So there's the image of the, of the, just the image of this holy person who is like the anchor of the Israelites. And he, he is able to go out into Egypt. He's an image of Christ really. He's able to go out into Egypt. Now think of it for us. Go out into Rome and save Egypt, save Rome. And as long as the pharaoh remembers Joseph, then the place where he came from is safe. But then when that doesn't happen anymore, then they become slaves. So, so that's what it has to do. And in terms of your, in terms of practical application, you can understand it as you know, if you understand, if you, if you have the reason why you, why you act like if you have the thing towards which it comes together, then you can move out into the world and the world is not dangerous to you, right? So if you, if you remember your purpose, then you won't fall into all these temptations, right? If you Know, if you act with. With. With purpose and focus and memory of God, then you won't fall into temptation. But if you forget, like you in this story, it's like the Pharaoh forgets Joseph, but that, in that, in this situation, you can see there's a lot of stories where it's either way. If you, if you describe it either way, it's the same. So it's like if you, if. If you forget, there's forgetting between those, then you're going to stray and you're going to become a slave to Egypt. So if you forget your purpose, forget your focus, your attention, then you're going to get tempted by the second piece of cake that I always talk about or whatever it is that is your passion is going to take over and. Yeah. All right, so. All right, where are we here? So, Television Smith. Television Smith asks, were you ever inclined to experiment with animation? Can an icon move? I have experimented with animation, in fact, long ago. I have many lives that you guys don't know about. Long ago, before I went to Africa, I worked for a project management company and I was developing pedagogical material for them and didn't. And it was a lot of graphic design. But it also. It was the time during flash animations, probably. You're probably too young for that. So I was doing. I was illustrating course concepts using flash animations. So like all these little animations of little stories to kind of. To add to the thing. So, yes, I am interested in animation. I find it very fascinating. And I would love to see some animations that would not be icons. I would be careful with that. But I would say to take some of the iconography, for example, and create visual, moving, visual representations of the iconographic programs. And so I think that that could be awesome. And there are some interesting people that are thinking about this and hopefully. And some of them are in the chat right now, actually, or at least one of them. Right. Hopefully one day, you know, you'll see that maybe not an animation or something that will kind of take. Take really iconographic thinking and bring it into a more movement or visual medium. So hopefully that works. That'd be fun. There's a lot of stuff on the. There's a lot of plans, a lot of plans. We just hope that we can get to them, you know, because the last two years have been. Have been really slowed me down. But I feel like this. This year, you know, Covid, though. But, you know, this year I feel like things are gonna. Things are going to move. It's gonna be Fun. So Tan Mooseman asks. The Youth Congress said a prayer to a number of deities four days before storming of the capital, including Brahma, and then included with a man and a woman. Yes, we all heard that. Very embarrassing. The very embarrassing thing, the only associations I have with Brahma are the Hindu deity and the Brahma bull. Is the fact that a guy with the bull horns looking like some pagan shaman tattooed with the hammer of Thor, correlated to the prayer to Brahma. Seems to me like Brahma might have answered their prayer through, through a sort of demonic manifestation. What do you think? Is this a case of symbolism happens? Well, it's definitely a case of symbolism happens. You know, it's not just another. It's just. All of it is just breakdown, guys. I mean, it's all breaking down. It's all falling apart. And so the fact that someone who has a, the theology degree could say something as hilarious as a man and a woman. Dude, that's a, that's a scene from a movie. I mean, that is hilarious. There's nothing as funny as that. And then the capital, it's. I'm sorry, I shouldn't laugh. What they call an insurgency. But my goodness, if you watch the video of those guys in the, in the Senate room, man, it was funny. Like, it was frightening, but it was like a frightening and funny because these guys were idiots. Like, they were just these morons. And the Q shaman is obviously. He's not. Whatever. Like, he's obviously confused. He's a confused, weird, psychedelic, you know, multi dimensional guy. I mean, the things he says are just completely nuts. It was still fascinating to watch how they acted. And so I, I shared it on social media. Rachel Fulton Brown wrote an article on, on that moment where here are these guys that come in and they're telling us they're insurrectionists, but they come into the Senate room and they're all like, hush. Like, they, they, they're overwhelmed by this place. And they're dressed like. The guy's dressed like an idiot shaman with like bullhorns like this made up whatever shaman Nordic, half weird Christian mixture. And. And then in the Senate room, there's a guy who shot in the face with like a bullet and a plastic bullet. And he says to the cop, he says, I'm here to make sure nobody damages anything. And I'm like, what, what's going on? And then, and then they like go up and they're like hesitating like, oh, man, you can't go, like, you can't go in that chair right then they end up doing it like, so the shaman goes up to the, to the, to the vice president's chair, and it's like totally overwhelmed. So he's kind of being cocky at the same time, but he's overwhelmed. And then they end up saying a prayer. So he says this like, prayer, and he ends the prayer, which surprised me completely with in the name of Jesus. Right? He. I forget exactly how he phrased, but he ended the prayer in the name of Jesus. I didn't see that coming at all. And everybody is all excited. So it was. But it's all a sign of, of, of this breakdown, all of it, you know, and it's, it's also a sign of the breakdown that you don't know what's real. Like, we don't know in the chaos, like you don't know who's who. So that's something like, for example, even during the BLM riots and the Antifa riots, you know, the idea that they are, are whatever, back block, an aspect of back block, which is actually police or military that are dressed as protesters in order to provoke reaction, like to bring the protest far enough so that the police will react. That's something that happens. That's something that really happens. I've seen in Montreal, there were police who were breaking windows and they got filmed. They're breaking windows during student protests in order to blame it on the protesters. And so same thing with this, this, this capitol thing. Like, did the police let them in? How did they get in? None of them were armed, so why did they let them in? Who knows? Who knows? Like, that's one of the aspects of the breakdown. And so everybody says psyop this, psyop that this is fake, this is real. Who knows? You don't know. And people who think they know, they, they, they don't know. Like when someone tells you it's definitely a psyops, like, you don't know that. Or if someone says it's definitely real, you don't know that either. Because we're in a situation where it's like a hall of mirrors in a carnival and it's all insane and we don't know who's behind things and we don't know. We don't know what's real anymore. And that's it. Like, that's the breakdown, guys. It's going to take a while to know what's real. And it's gonna, it's gonna, it's gonna be so strange that we are gonna forget what it means to just know what's real. And that's the situation we're in. And it's gonna be like this for a while. And. Yeah. So sorry, guys. All right. Okay. So. All right. Finish with the symbolic world. I'm going to go to subscribestar, but I think that there aren't any questions on subscribestar today for some reason. All right, no questions. I'll subscribe. Star. I think it's also because I posted this Q A very late in the month and that we are still. When we're actually not in January, but we're in the first of February. So sorry about that. It's been wild. This past month has been crazy for everybody, I imagine. But. All right, so here we go. So now I'm going to Patreon. So. Hello, Nick Scott. Are we truly in the Age of Aquarius? Thanks. All the best. I never knew what that meant. I don't know what that means. And I don't know. I don't. I don't know what that means. Like, I don't know what, what it would mean to be in the Age of Aquarius. And, you know, ever since. What is it that, that. That musical hair where they talk about the Age of Aquarius? I. I don't know. I don't know what that would mean, really. Sorry. I don't know enough about astrology either. I always want to know more about astrology, but it's just. It's kind of. I just feel like every time I read. This is the thing about astrology is that I think that ancient astrology probably had very deep insight into patterns of reality. But I think that most people today that talk about astrology, they don't know what they're talking about and they're just making it up. And so that's the problem with astrology is that when you read things, people talking about astrology today, you just get a bad smell from it. It just feels like they're making it up. But nonetheless, I think that it probably at some point had a lot of pattern and story in it that was probably useful in helping to see how the world kind of functions. And obviously, ancient astrology was nothing like this kind of stupid prediction type astrology. It was more this, this, this vision, this, you know, this canopy of possibility of, like, principalities that are up there and there's an infinite amount of them. And so the question is, like, what patterns will manifest themselves to you? Right? So it's like, why did they. So people say it's arbitrary, but it's not arbitrary if you make a Pattern with like stars, it's going to end up, end up being something which is part of your consciousness. So there's definitely going to be a connection between the patterns which reveal themselves to you from heaven and your structures. Like the structures of what? What? Of meaning. So anyway, so I, I can perceive that it's probably something that had some power before, but today I, I, it's just all, it's just all nonsense in my opinion. All right, so Charles Haro asks. I've been reading your brother's book. I've been trying to analyze the world symbolically and I was hoping to get your comment on my thinking if it's correct in regards to inflation. So inflation would be symbolically linked to time and the circle because it erases people's savings, which represents their saved hard work. Thus it acts as a force of disintegration because it threatens to make space of work productivity pointless. And when inflation grows out of control, it will devour itself and lead to a new monetary system as people abandon the old one that is no longer functional, which is akin to the snake that eats itself. Curious to hear your thoughts on my phrasing and any commentary that would have had on the inflation given the period of loose financial policy. Yes, I agree with you. I think that it's not inflation like just normal inflation. Normal inflation in the terms of like let's say a normal, not a general inflation, but like the normal inflation of things, like the change of the price of things would just be related to offer and demand and just that kind of basic idea. But the way that inflation works today, it has to do with credit, it has to do with interest. And so there's definitely something about interest which is part of the cyclical thing because I've talked about, I have a few videos about interest, by the way, if you're interested. But it's hard to think about it. But the, the thing about interest is that you're borrowing from the future, right? And so that's what part of the acceleration. So it's, it's, it's like, it's like you're going into the future, you're grabbing possibility and you're pulling it into now. And so you keep accelerating the wheel because you have to keep taking more from the future in order for the system to work. So you're constantly going into the future and pulling it towards you so that, then you have to do that, do that again. And so that is what brings about the inevitable inflation. And so, so I think that your analysis is, is correct. But it has to do. The, the way to understand it, I think at least is through credit and interest. So glory to. So Micah, Micah Mueller asked, Glory to God. What is the symbolism of a star hatchery or nebula? I have no idea. I don't know because I've never seen one like, I, I don't see those things. They're not part of, of experience. They're very far away. And so I don't, I, I, I don't, I had never thought about it, to be honest. Maybe I should, I mean, obviously it's now part of reality, so there's, there, there's something about it which, that should reveal some pattern. But, but at least until now, it's, it's just always se. Seemed like it was very far. So, so Garcia says. I had, I had a question about Deida's thoughts on virology. Is there a way to flip its virus approach where Christianity would infect, or lack of a better word, for lack of a better word, the world? Like a double subversion? Again, for lack of a better word, I think there's something like that which is going to happen. I wouldn't use, I wouldn't use it that way. I think that what we're seeing is, what we're seeing is that in the postmodern gesture of this undermining. So Deida always used to say that you need to, you can't just destroy, you have to rebuild. Right. He would say we deconstruct so that we can add value again back into the system. But that obviously didn't happen and because that's not how things work. But I think that what we're noticing is that it's more maybe the way to understand it is that as the, as the virus kind of takes over, it's weird because it's not exactly that, but it's something like the virus has to make sure that the host stays alive or else the virus is going to die. So that's probably the best way to understand it, is that there's like a weird thing where it's like for the virus to remain active, it has to because it doesn't have anything to replace. There's nothing to replace Christianity with. And so for the virus to continue to act, it has to keep its host alive. And that's what's happening is that in the reenactment of this deconstruction, they constantly have to restate the first position. So they constantly have to create a world and then deconstruct it. And so that's why Like I mentioned that in my video on parasitic storytelling. I think it has more to do with that. I don't think that, I don't think that Christianity is going to infect the world. And you can see. And that's just not. And it's funny because that's not how actually at least, maybe some people have done it that way, but at least traditional Christianity, the way that it converts people is a really different way. It's like the way that Christianity converts people, converted ancient empires, is that there would be some Christians there, let's say in Rome or in another country, and those Christians would actually be like model citizens. It would be model citizens which obey all the rules all the way. They were model Romans. They were model citizens. The only thing they did obey was this prescription to not worship. You know, let's say to sacrifice to the idols. So that's the first thing. Then the second thing is they continue to submit to the authority, the pagan authority, until that authority converts. And so the transformation ends up happening through the conversion of the king. That's Constantine, which is in Clovis, and then Vladimir of Kiev. None. There's non stop, like the king of Armenia, I forget his name, sorry. You know, the, the. The same thing with the king of Ethiopia. So all of these, these transformations happen through a. So it's not at all an infection. It's like it's, it's actually, it's, it's. It's. The Christians reinforce the good aspects of the culture without trying to, to. To politically destroy the, the culture itself. And then the king converts. So it's. So I think that that's what Christianity does. All right, so I need to speed up a little bit or else I'll never finish this. So, so Anders Vroud stat asks. You previously talked about flips that occur between layers of manifestation and also about the flip which occurred politically between the conservative and liberal in regards to the protection from the virus. First the conservative wanted to isolate said borders. The liberals keep society open. Then after the flip, conservative wanted to reopen due to economy and liberals closed down due to the potential of hurting those at high risk. I've heard you say flips occur between different layers of reality. Was this a flip from attacking virus to defending ourselves? Where is Christ in this flip? I. Yeah, I don't necessarily think Christ is in this flip. It's just the way reality works. It's just this strange thing that happens and sometimes it's not completely, it's not completely clear. Like one of the things that. That Paul Vanderklee talked about was it had to do with strength and compassion. And so it's like the way to show strength and compassion at some point flipped. And so the main value ended up going to the opposite in terms of effect. And so that's something that happens in terms of the left and the right influence. I've talked about this before, where it's like, let's say the tendency to move away from the. The center. Depending on the. The context, it can have opposite appearances. So if you push someone away from the center or that is appears as harshness. Right? And so it's like harshness is moving away from. From the center. So it's like a rigor. Right? And that. And so it's like the left hand in the sense of the goats move away from. From Christ, but from the point of view of the goats or from the point of view of you when you're moving away, that it's actually a form of breakdown, a form of like, giving in to all the. The outer things. So it's a form of fragmentation when it's seen from the point of view of the other side. So that's one of those. That's the kind of flip that happens. So I'd have to analyze this one flip more because it was obviously, it was so obvious when it happened. It was insane. It was like from one day to the next, you know, it just. Just turned. So it'd be interesting to understand if it has something to do with that, with this idea of. With a way to view oneself and to view the others and how it can turn in there. All right, so Angel Terpstra asks, is Christ the symbol of all symbols? A hermit key which connects everything together? Yes. The beginning and the end, above and below. And it is therefore possible to read Christ back into the prototypes of the Old Testament. Or would this be a superficial vision of Christ? No, I think that that's it. That's the key. The story of Christ is the, you know, the keystone, right. If you think of it in terms of an ark, when he says the stone that was rejected by the builders became the top of the arch. So it's like, you know, this whole edifice and then you don't see Christ. You know, the image of Christ is. Is. Looks odd. It's not. It's not. Doesn't look like it's part of the system. Then when it's revealed, then it becomes the thing that holds the whole edifice together. And so in his life, Christ was not. They didn't see what he was doing the patterns, but now it's when it was finished, we look at it and we say, wow, this is the story of everything. Like this, this story contains it all. And so I think, so I think it is definitely, I think not only you don't read Christ just back into the prototypes of the Old Testament, but back into the myth, in the myth, different myths and different fairy tales and you know, and then also back in the sense of out into all the stories, all the, all the, even modern, even modern storytelling. So, all right, all right, so, all right, so Mirko quotes Hannah Arendt. And so it's a long quote, but man, you guys, you have to write shorter questions. But I will read the quote from Hannah Arendt and we'll see. So he quotes her from the origins of totalitarianism. Just as terror, even in its pre, total, nearly tyrannical form, ruins all relationships between men, so the self compulsion of ideological thinking ruins all relationships with reality. The preparation has succeeded when people have lost contact with their fellow men as well as the reality around them. For together with these contacts, men lose the capacity of both experience and thought. The ideal subject of totalitarian rule is not the convinced Nazi or the convinced communist, but people for whom the distinction between fact and fiction, I. E. The reality of experience and the distinction between true and false, I. E. The standards of thought, no longer exist. Yeah, yeah, yeah. And you know, and one of the ways to do that, and we saw this in 1984, you know, Orwell described it very well, is, is to change the facts on a dime, right? So get people to believe two opposite things, you know, from one moment to the next and change the way they think. And so, and so an example that's been happening obviously is the masks. It's like, don't wear masks. They're stupid, they're silly, they're useless. You know, all these studies say masks are useless. And then from one day to the next everybody has to wear masks. Follow the science, you know, from one day to the next. It was nuts. But then not just that, like, like you know, there's going to be interference in the election. The Russians are going to hack the, the, the, the voting machines. You gotta watch out. Election happens, the other person wins. It's impossible that there is any corruption in the election. Like you can get people to believe things completely opposite from each other within days. Like that's, that's like you've got people then. Like it means that all they do is, is they don't think anymore, they just base, they just listen to what you tell them, and then they do it. And so, yeah, so he says, do you think this is what's happening in the world right now? Yes. Conspiracial. Conspir. Conspiratorial. The conspiratorial paranoia is on the rise in the world and most visibly in the US Seems to me that mostly comes from the right, probably as a natural response to it. So it doesn't. It doesn't just come from the right. It's just that the conspiratorial thinking on the left is completely in the. In the mainstream media. Like, do you think being told that your president is a Manchurian Candidate for two years, like three years or something, being told that. That your actual president is a spy from another country, like, if you don't think that that's conspiratorial insanity and that there are like these massive networks of, like, white supremacists in the US that are all organizing and that are all ready to, like, take over. That's conspiratorial thinking. And so it's like, yeah, the right has their insane conspiracy theories. Like, Q is just completely insane, but it's not just on one side. So I think that it's the. It has to do with this breakdown. Like, it has to do with the breakdown in meaning. And so, yeah, people are looking for authorities to tell them what's real, and they'll just believe it. And so, you know, trust the plan is no different than, you know, follow the science. It's like, okay, dude, you know, who are these people that are. I mean, I believe we need to. Of course we. You know, as a Christian, I believe we need to. To. To obey our authorities, but we have to keep thinking. We can't stop thinking. Yeah. How did this veer into politics? I don't like that. At least not too much. All right, so Christopher Mihali says, with the rising divisions in culture and politics in the US and abroad, what do you believe will finally be our giant one eyed psychic squid monster to bring us together? Will we have to wait for Eschaton or any semblance of unity? I hope we have to wait for the Esk. I mean, not. I can't say that, but for sure, the giant. When it. For those who don't know what that's referring to. It's. It's in the story of the Watchmen. At the end of the story of Watchmen, you discover. Spoiler alert. You discover that one of the main characters created a fake alien invasion. And. And that alien invasion is what united the world together and stopped the division. And so, you know, there's been an attempt to create this giant one. This, I mean, Covid, is that it was. The people thought it was going to do that, or they hoped it was going to do that. They tried the environment for a while, hoping that they was going to do that. The world is in danger. Environment, global warming. Everybody needs to unite. And then now. Covid, Covid, Covid, we need to unite. It's not working. And so, you know, hey, an alien would do it, right? Like the story in Watchmen is, is. Is fine. You know, like it worked. Why wouldn't it work again? You know, it's like it really feels like we're being prepared for them to announce to us that there are aliens. Like, they keep hinting at it these weird ways, you know, like they're gonna tell us all the UFO stuff. They're going to reveal it. So it's like, man, yeah. And then we can, you know, we can give Alan Moore a Nobel. A Nobel Prize or something for his Watchman story. All right, so Jason Lindsay asks. Hey, Jonathan, I hope all is well for you this year so far. If it's not too much asking, you maybe give a short summary of what the first 10 numbers represent in symbolism. Man, all the first 10. I don't think I can get to 10, so. Or point to a place to find this information. I looked into numerology and gamatria, but I fear that I've only found the new ag and fragmented information on the subject that might lead to distracting rabbit holes or Egyptology level necromancy. Yeah, that's not going to help you. That for sure is not going to help you. So I don't know, maybe I should. I should probably make a video about this. Like, the one is one is simple. It's one. It's unity. It's. It's the. It's the oneness. You know, it's the place where everything comes together. It's the origin and the place where things come together. So imagine if it was a pyramid. You'd have the one at the top. And you know, and it's, It's. It's the. So depending on how you count it, you can see one as the unifying principle, but you can also see one as the first. Those two are different in terms of their use in mathematics, but nonetheless, they. They have a similar function in terms of what they're doing in terms of origin and in terms of. Of the absence of multiplicity. Right, okay. And so two is duality. Right, Right. That's not that hard to understand. So you have one, then two is. Is duality, and then three is unity and duality at the same time. So it's. You can understand three as a triangle. And so it's like duality held by unity. Right. So that's probably the best way to understand three. And so it's. It's like it's a triangle. What, unite, like I said, so it's. It's the duality, but with unity. Okay. And then four is this. It's usually an image of stability. So it's a square. Think of it maybe, if you think of it in terms of geometry, it's probably the easiest way for some of these done to. To understand. So, so it's. It. It has to do with. Has to do with stability, but it also has to do with the limit of conceptualization of quantity. It's like it represents quantity in itself. Because you really can't hold more than four in your mind. You know, usually you have to separate it when you get to five, you kind of have to separate it between three and two. It's hard to hold more than four in your mind. And so maybe stop there for the numbers. But we could go. We could go into more like, we could go. Probably go up to 10 at some point. So hopefully that's at least enough to give you a hint. So Arie Fisher says. Hi, Jonathan. What is your interpretation of Christ? Warning not to be lukewarm. Most people seem to see it as an admonition against being a fence sitter and the assertion that it's better to do something fully rather than worry about its morality too much. I'm wondering about a more ontological meaning, but also what do you think it means for action? Does it have to do with manifesting one of the opposites, cold or hot, so that you can productively unite with the other? What is the difference between being cold or being hot? So I think you're right. No, I think you're right in the sense that the idea of being neither cold nor hot has to do with not the middle in the sense of the unity of. Of the two, but the middle in the sense of like the blah, like the non, you like the mixture or the lack of solidity. And so you're right that it can have to do with a fence sitter in the sense that if action is required and you're unable to act because you don't want to take a position, then that is probably what it's talking about. So, and so another thing too is that there is a, there is an aspect of transcending opposites which has to do with going into the opposite. So it's. So the idea, for example, that this is actually, it's interesting because it's a difference between the kind of modern, the recent, or the more kind of contemporary. Can I say this gender theory about how lack of clear division between gender is, is equivalent to the transcendence or the kind of, or the kind of union of the 2 and 2. Just something higher and, and it's the opposite, right? And so the confusion of gender doesn't, doesn't help you transcend gender. What helps you transcend gender is to embody the aspect that you are. So it's like to be a man and to do it in a way that is holy and full and is, let's say, fulfilling the nature of what that is will make it possible for you to also integrate your opposite. And that will happen in a way that, so it's like. And so, so the idea, for example, in Orthodoxy, you have the sense that, yes, in, for example, in Christ we transcend the differences. Like, you're not a Greek, nor a Jew, nor a man, nor a woman. All of this happens as you enter into Christ, but at the lower levels you do that by virtuously embodying the identity that has been given to you. So it's like, yes, you are Greek, you know, in, at a lower level, and you live that in a way that is, that is virtuous and, and true. And that through that, then you will be able to then transcend that, you know, and see the, the, the other as also being an image of God, you know, rather than just being in this kind of universalist vagueness that, that doesn't, you know, that doesn't. That leads to just a kind of weird agnostic non. Identity, you know, Know. All right, so Eamon ask what happens to one that chases sexual adventure? How does the meaning of a possible relationship between him and a woman get twisted by his chase of many women? Oh, so someone who, who wants to have a lot of relationships? Well, I mean, it's very simple. Like the more relationships you have, the harder it'll be to join with one person. Just because you, you, you, you leave something with that person and you, you connect with someone. I mean, sexuality is a form of union. And so if you join yourself with someone, then you, you will be joined with that person and that, it will create in you a part of you that is given to that person. And that part, you won't be able to give it to, to your spouse because, because you can't. It's already been given to someone else. And so that will fragment you. And it's a fragmentation that is very, very difficult to heal because it's there. Right? You can forgive, you can go beyond it, but it's still there. Right? And so it has its fruits and it has its effects. So be careful with that. To Dorothea says, why are there no real romantic loves in the Bible? What are you talking about? I don't think that's true. Many of my friends are trying to really hard to find something in the Bible to guide them in finding the right one and so on. But they seem to always end up in the Book of Tobit, the Book of Ruth and that's it. I guess the Song of Songs could also be, could kind of fit in, but I don't think there's anything like Romeo and Juliet. Well, I hope there's nothing like Romeo and Juliet because Romeo and Juliet kill themselves. Like you don't. That's not, that's a dis. That's a. It's not a. That's not a normal relationship. Like there's something extremely twisted about Romeo and Juliet and they leave, following their passions into, into death. You know, it's, it looks all good and nice in the, in the play, but that's not, that's definitely not the, the true union of masculine and feminine the way it's supposed to happen. So for sure, the Song of Songs is definitely a song about desire and about, about, you know, this kind of call, back and forth call between the masculine and feminine. You know, in the Book of Ruth you do get a very much a kind of romantic story where. Of a unexpected union, let's say, you know. And you also see that with, in the story of Isaac and his, his spouse there is, you can feel like there's, there's, there's some connection there where he sees her at the well. I forget, I forget if it's Isaac or Jacob. Oh man, that's horrible. This is unforgivable. One of them is the servant that goes to get. I think it's Isaac and then he sees her and he cries, you know, and he kind of takes her in his arms. So there's some, there's some images in scripture, but they're very, they're very obviously just like all, everything in scripture is always written in a very short way. So the wakeful asks, what do you think of Rastafarianism? I don't know enough about Rastafarianism. I doesn't seem to be very building. Like, it doesn't seem to have. At least. I don't know, but at least what my perception of it is that it doesn't seem to have much in terms of how something that can create a communion of saints, let's say, a communion between people. I mean, I know the weird, the interesting story that Bob Marley converted to Orthodoxy or to Ethiopian Orthodoxy at the end of his life. And so I think that maybe the best version of Rastafarianism is something which would lead you back to. To Ethiopian Orthodoxy, if that's possible. So Constanta Trugilo asks, or Trugilo, do you see the inevitability of God's will in Tom Holland's book? I know it might not mean much for many, but that book was what changed me from an atheism, from atheism literally at the end of 2020. I mean, I really think that what I enjoy about Tom Holland's book is this is Dominion, is that you feel in his writing that he's. That he is kind of surprised at what he himself is discovering. And so there's as if, like he's seeing how Christianity is so inevitable and how it just permeates everything that you can almost feel this, like, weird giddy excitement of like, telling people about it and being like, no, you know, this thing you hate about the world. Well, this is how, you know, without, you know, the ethics behind it, even if you think you're being against Christianity, you're actually reaffirming Christianity. And also, like, his really, really wise perception about how Mahki the sad is the piercing, the illusion of the Enlightenment, right? And how, you know, hidden in all the pomp of the Enlightenment and its pretension at having a kind of secular morality that hidden underneath there was, you know, was the really dark stuff, right? And so it's like the finality of humanism is 50 shades of gray. Like, that's the finality of humanism. And it's like it was there right there at the beginning. It's like it led to Marquis. Like it led to. To weird will, to power and fetishization and, and kind of breakdown, you know, and you see that happen in, in, in a lot of things. It's like even in Renaissance art. I talked about this with John, Father John Strickland again, where you see in the early Renaissance this desire to represent form and balance and proportion. And then right away, very quickly, there's a fall into idiosyncrasy and a desire to show weird stuff and kind of disturbing stuff and to elongate the figures to, to. To show people in very weird positions. You see that in El Greco, for example, there's like a very kind of disturbing sexuality about his supposedly Christian images in El Greco especially. But you see in Archimboldo, like you see in, you know, in, in anyway, so there are several, Several places where you can see how quickly the humanism degenerates into a kind of fetishism, right? And so it's like people say, oh, the Renaissance humanism, but it, but, you know, the Renaissance also gave us the Machiavelli's Prince, you know, and so it's like these are the undersides of the, of. Of humanism that people don't like to see but that Tom Holland really saw and kind of perceived. And, and so, so I do think that he is kind of. He is. Right now Tom Holland is kind of manifesting this, like you said, this will of God, and he's probably making Christians despite himself without even totally being involved, like, or marginally being involved in a church. And, and, and so, yeah, I really, really enjoyed it. There are some things I disagree with, obviously, and I mentioned them before, but yeah. So Jezebel goes up against Elijah and Jehu, both powerful archetypal men, in different ways. Why is it the eunuchs who kill her? I mean, it probably mostly has to do with this idea that the, the symbolism of the eunuch, sorry to tell you, the symbolism of a eunuch is like, is something like. Let's just say the eunuch is a marginal figure, right? The eunuch is a. That's why the Ethiopian eunuch is like a double whammy, right? It's like, here's this person from the edge of the world who is also a eunuch. And so it's like neither male nor female, kind of like, you know, indefinite. And so that's what eunuchs were, and that's what they were seen as. But that's also why they could act as guards, because they were indefinite and they were not. They had no stake in identity because they couldn't reproduce and they couldn't. They couldn't continue. They were sterile, right? And so the sterile, ambiguous figure who act as guards, you know, and so that's the nature of the margin, folks. It's like that. It turns, right? So she, she's cute. She's. She's also eaten by the dogs, right? So it's like the dogs, this outer beast, these marginal Guard figures, you know, and so it's like it turns against you, and that's. That's why she's killed by the eunuchs. All right, so Christian soccer says, love seeing you and Matt frat talk. I spent my government check to be both your patrons. Well, thank you, Christian. That's kind of you. In your discussion about nakedness, I got the sense that if one got past the nakedness of the opposite sex and art, they would become blind to the virtues, the virtuous experience of nakedness and marital unity. Yes. Maybe it's similar to how priest hides the host at the moment of consecration. Yes, the hiddenness preserves the experience for the thing itself. Indeed, the Old Testament, seeing God would kill you. Some individuals did see him in a mysterious way. Seeing what's naked is like exposing the image of God and thus leading to a kind of soul, meaning death. Yes. There is a relationship, like I said, between the nakedness or nudity and sacredness, if it's proper. And if it's improper, then it becomes a kind of desacralization or a kind of. Or like the nakedness of shame, like I said. And so the idea of hiding something precious is to preserve its value, like you said. And so then the value of the unit of the union of male and female takes up all its power because it's kept and it's protected and it's. And it's not thrown out into the street and just made accessible for anybody to look at and to. To. To think about. So. All right. So Ricardo Rojas asks, how should I approach my conversion to Orthodoxy? I've been going to church a couple times now, and my spiritual father is teaching me the foundation of the faith. Should I focus more on the theoretics, reading more, or in the practical aspect, praying, going to liturgy to begin with. Thank you so much. I would say listen to your spiritual father. That's what you should do. You should follow his lead and you should ask him what he thinks you need, because he knows you. I don't know you, so I don't know what you need. But I would say the best is to ask him. So. Dom Palermo says, I am wrestling with identifying my given unique inclinations and talents, apart from sinful tendencies of pride and fragmentation. Man. Sorry, can you please shed some light on the commonality and difference at the confluence of idiosyncrasy and multiplicity, with unity under Christ, wherein distinction is preserved? Sorry, I don't totally. Yes, there is definitely a relationship between multiplicity and idiosyncrasy. Not necessarily, but it's definitely something which is connected together, you know, because as you move towards multiplicity, especially if you forget the unity, then that's when you encounter idiosyncrasy. It's, that's where idiosyncrasy starts to take up room and starts to manifest itself very strongly. And so, you know, that's why the demons that, that they represented, like medieval paintings of hell, are very idiosyncratic. They, they are, they, they've lost. They don't. You don't have ways to connect them with higher identities. Right? They're just these monsters really. So the monster is the ultimate idiosyncrasy. And as you move towards multiplicity, if you forget unity, that's what you get. But you, if you can move towards multiplicity and remember unity, then you should be fine, because that's what Pentecost is. Pentecost is a movement to total multiplicity without forgetting the unity. So Amy asks, in Corinthians, it says, the kingdom is not in word, but in power. In the same regard, I've been thinking a lot about how the question, the quest to become like Christ is never ending. Both tell of a kind of living as or embodiment of God rather than a philosophical ideal of God. This kind of structure. Is it correct to say that the Bible acts as a kind of mediator between fugitive, human and eternal plight towards Jesus, like an anchor or baseline? Or is it more fitting in symbolic structure to view God as the baseline and the Bible as fugitive with the human? So I'm not totally sure I understand what you mean, but maybe a way to explain it is we need to understand the Scripture as a, as a solid banister, right? Or a solid, solid wall, or a solid foundation on which you can stand. So it's actually not above you. It's something to hold you in. It's something to help you not go astray and not lose yourself, right? So it's, it's, it kind of binds your attention. And so, and then the authority is, God is your, is the authority of your spiritual father, your priest, your bishop, you know, your father or mother as a child, the, the authorities in government, all of these things above you, they're the ways in which you will then embody your actual life in, in God. Whereas Scripture is more like, like the proper frame to, to help you, to help you not lose wonder in terms of your attention, you know, so that's probably the best way to understand it. So Jacobus Rodin asks, how do you interpret Matthew 10:34, 39. Not peace, but sword. Guys, you can't, you can't give me just, you guys can't give me just. One of the reasons, One of the, one of the things that happened when I became orthodox is that I somehow became very alienated to the, to like the verse, chapter and verse thing. It's like I, I know scripture, but I really don't, I almost don't want to remember the chapter and verse. I want a basic idea where it is, but I don't, I don't want to like say anyways, so Christ says, do not think that I've come to bring peace to the earth. I have not come to bring peace, but a sword. I have come to set man against his father, and a daughter against her mother and a daughter in law against us. And a person's enemies will be those of his own household. Whoever loves father, mother more than me is not worthy of me. And whoever loves son or daughter more than me is not worthy of me. So this has to do with one aspect of Christ because, so Christ, and this is probably something that I don't emphasize as much as I should, but the Logos both unifies and divides. You know, the, the Logos is a sword. The Logos cuts, you know, and can also, yeah. You know, cut asunder things. And so especially if you are too attentive to the things which are not the Logos. And so if you don't attend to the Logos more than you attend to the things of the world, then the very Logos will fragment things will start cutting them because you won't be able to see and to experience how all of these things are joined together in one in the Logos. If you're not attending to the Logos. And so, you know, if you just attend to. So think of it like, so think of it like if you're doing something like, if you're doing something like a task. I don't know what, like if you're doing a task and you're not attending to the purpose of the task, well, then what's going to happen is that the elements of the task are going to start to fight amongst each other and they're going to start to fight against you because you don't even know what, what's bringing you together anymore. Right. Imagine if you, if you had a team and you, you forget what the team is there for and you don't have a proper hierarchy of leadership and of, of attending to what it is you're trying to accomplish, then everybody's going to start to argue about what to do and how to do it, and, and, and all of this is going to be to get to, to increase if you don't keep your eye on the goal. And so it's something like that that Christ is talking about. You know, he's saying you need to, if anything below you is pulling you away from the, from, from God, if anything below you is pulling you away from the Logos, then you need to, to not attend to it. You need to hate it. You know, but if you attend to God and if you attend then, and if your family attends to God, especially if you all come together and then it'll be the binding agent of your, of your society. But, you know, I mean, a good way to understand it, it's harder to understand if you think of your family, but if you understand it, I don't know, like, you, you used to be a druggie and you used to hang out with, with, with, with a bunch of, of potheads. And then you're like, okay, so now I want to follow Jesus and I want to stop taking drugs. Well, doing that is going to create division in your friendships. It's going to break your friendships, it's going to destroy your relationships. And you might think, well, that's horrible. But then that's because if you, that those relationships were not properly ordered and we're not ordered for the right reasons. So if you, if you don't have the proper relationship, even to your own family, then if you try to attend to something higher, it's going to destroy your relationship. And that's, that's just how it is. And I think most people have actually experienced that somehow in, at some level of reality. So it's not that mysterious. So, Jesse Blaney, fun question. What has been the most significant lesson from all your years of marriage? That I'm selfish bastard. Like, that's you just being married and being, like, deliberate about it makes you realize just how selfish you are and just how, you know, it's so difficult to kind of, to give up your protections, your, your idiosyncrasies, you know, your little desires in order to be in communion with someone. And I think that that's what it's shown me. Hopefully, hopefully it's not been, it's not been a complete obstacle to my relationship. I don't think so, because we, we've been together for, you know, 20 plus years. So, so, yeah. So, Daniel DeMarco, can you ask, can you please explain the meaning of the symbols of the four Evangelists? How are they related to the angels? In Ezekiel, the beast and Revelations. Well, they are. I talked about this a few times before Daniel, so I can't, obviously I can't expect you to watch all my Q and A's. That's, it's, that's not the right way to do this. But they are related in the sense that. Because you can understand the four beasts in Ezekiel as kind of four corners. And so you can imagine there are different ways to think about it. But there's a, there's, in that story, there's like a four, right? So there's, there's like four wheels of the chariot. So there's this divine chariot which kind of manifests itself. And this divine chariot is the support for the. The support for the presence of God. So you can understand it as the four corners of the four corners of the Ark of the Covenant, this idea of the square which is the container of this divine revelation. And so that's the idea of the four beasts. And so obviously each beast has a certain meaning. I won't go into that too much. But you can understand that this 4. You can understand it in space, in terms of the temple, in terms of the Ark of the Covenant, in terms of the throne with the four, four feet, in terms of the chariot with four wheels, the stability of manifestation. And then you can understand that the four gospels do the same for Christ. So it creates a stability in diversity, right? So each corner is different, each gospel is different. And by being different, it actually points to the mystery of Christ, which is above and which unites all of these stories together, even despite their idiosyncrasies. And so it's a way, it's a way to not have this linear. So Christianity is always this union and this balance between unity and multiplicity. And so it's very different than the idea of, let's say, the Quran, which comes down, like straight down from heaven, and then through Muhammad, straight down. And then it's like, this is it. And so, and, and here's this point. Whereas in Christianity there's this idea that there's, let's say the one divides into four and then creates a stable place for the One to remain above and mysterious. And we can commune together in that unity. It's the best way to understand it. So Charlie Longoria says, what does it mean to sin against the Holy Spirit? It means that you don't accept the Spirit of God, you don't accept the transformation of your life through the Holy Spirit. That's what it means. And so there's actually a direct Causality between not being saved and not. And sinning against the Holy Spirit because you're, you're not being transformed. If you're not. If you don't let the spirit of God make you into an image, into a resembling image of God, then that's it. That's as good as to. Our generation is dumb says, hello, good sir. I hope you're doing well. I'm wondering how we can be praying for you. That's very kind of you. Our generation is dumb. I wish I had an actual name, but that I can say. But that's okay. I understand. How can you pray for me? I mean, I think. I think that, like, there are several things. One of the things if you want to pray for me is, is. Is to help me not become prideful, because that's the difficult. Like, here I am, I'm, like, talking to you guys, and you're listening to me. That's a very dangerous place to be in terms of my soul. And so if you want to. If you want to, don't pray that God humiliates me. At least don't, don't pray that. But maybe at least pray that God prevents me from becoming prideful. It's much better. But I think that that's, that's something that I think about and I worry about. And that's so, So I think it's, it's. It's good. I think that I need to. To have discernment. One of the things that really makes me suffer and that I don't know how to deal with is I. Is I. Is. I don't know. So like, even now, like this thing, like this Q and A, it's like, okay, so people send me money and I answer these questions, the people who send me money. And it's. And it's like, you know, I get emails every day and I get these beautiful long descriptions of people's stories and they're asking me to interact with them and I. And I don't know how to do it. And so I don't. And without it totally swamping me and submerging me. And so I've decided to not answer emails anymore. But I don't know. I don't know if that's so. There's something about discernment that I need to, to, to. To figure out, to know, you know, how to discern where to put my attention. That's definitely something. So thank you. All right. And so, so the Blaze asked Jonathan. I've been having a conversation with someone about the nature of what is wrong with our culture, I. E. A lot. He is of the belief that what is needed most is a return to reason with a capital R. Yeah, Everything is seen instrumentally discussing Christianity only on the grounds of its utility. I very much understand your comments regarding how hard it is to discuss the meaning of crisis with someone who has not had the intuition or had the veil pulled back for them regarding the questions of consciousness. While I understand that pure reason is not sufficient, I have been having difficulty articulating why. Why is reason not enough? And where did the goddess of reason in France go wrong? Any tips for helping me put someone's finger on the conceptual gap left in such a worldview? So it has to do with the problem of one of them has to do with the problem of infinite, with which is that the world is bigger than what you can gather into reason. And ultimately God is infinitely bigger than what you can reason or what you can grasp. And so reason only becomes very prideful, right? It builds towers of Babel because it, because it thinks that it contains everything, but it doesn't. And the remainder comes back to bite it, right? And so that's one of the problems with reason, is that it doesn't look out for the remainder. It doesn't rest on the Sabbath, you know, it doesn't. A lot of ways to, to. To phrase it right. And so because of that, the, the Sabbath, the, the remainder, the leftover, the thing that doesn't fit, builds up and. And it collapses the system. And it's just, and it's just. That's just how it works, you know. And so you can't just have pure reason. You need to leave space for mystery above and strangeness on the side. Like you need both of those. Without that, then you create systems which become fragile and they break apart. So Paul Dumad asks. Hi, Jonathan. In the ring of quantity and the signs of the times and symbols of sacred science, Rene Guinot lays out some harsh criticism towards psychology and more specifically towards psychoanalysis. As a psychology student, I recently started an internship in retirement home and I feel like most of the people, they need a priest more than a psychologist. In your view, what is the right place for psychology as a science and as a clinical practice? I think it. I don't think that it's complete. I think that there's room for it. I don't think it's completely wrong. I think that it has limits and it's important to understand those limits. I think that understanding the structure of the psyche is helpful, but I think that One of the problems with psychology and the reality of psychology is that there's, it doesn't take love into account. And so a psychologist, because a psychologist cannot love their client the way that a father loves their son or the way that a priest loves his flock. Then, then they, they've set out their own limit. Like they, they just set out their own limit. So that's what I think. And so, but I think that someone who is more like a father or a priest or, you know, someone, a pillar in a community who understands the mechanisms of the psyche, it can be a tool. It can be a tool to help you to not be stupid and then to not act in ways that would be counterproductive to you. But psychology has its limits because it's, it's the psyche looking at itself. And because the psychologists and the psychiatrists are, have a pretension of science and of standing outside of, of their own consciousness or their own system of consciousness, then they, they have the same problem that all these people have, that Brett Weinstein has it all the. I'm reading right now Master and His emissary by Ian McGilchrist. And it is unbearable. To be honest. I find it unbearable to read that book. I'm getting very frustrated reading it and so I don't know if I'm gonna finish. Like, I'm. I'm in his second part where he, he basically thinks that he can, he can explain the whole history of the west based on right brain, left brain separation. And it's like, dude, seriously, like, it's just very frustrating because he, he basically wrote a 600 page elegy of intuition and right brain dominance. He wrote this 600 page analysis with footnotes and scholarly book about the supremacy of, of, of intuition and of, of flux, right? How the world is actually in Heracli. Herac. Heraclit was right and Heraclitus was right in terms of flux and of like context and this kind of, you know, and I'm like, dude, like, can you say performative contradiction any louder? Just very. I don't know, I'm just, I just find that stuff very frustrating. And I think I see that in psychologists and, and, and, and yeah, I find that tough. Anyways, so sorry to ruin that book for you guys. If I know some people probably liked it, but I'm really struggling to read it and to get something out of it because I see that blindness, like that blind spot and just glaring at me. All right, so Keenan Wang says, what's the significance of Christ's first miracle being the Turning of water into wine. It is the recreation of the world. It's the, It's. It's the beginning. It's changing the world into. And not just. And it's more than that. It's actually more because he could have. Turning water into something like bread would have been like creating the world. But turning water into wine is like. Not just that. It's like turning the. Turning the water into creation, then bringing it into the. The edge. Like the edge in the sense of. Of this ecstatic moment and the. And also this idea of death turned against death. That's what wine is. Wine is fermentation turned against itself. And so he's bringing it not only into. Into the world, into being, but bringing it to the end of his own story, which will be this resurrection in the end. And so it's a. It's a. Yeah, and he does it at a wedding. And it's like. It's all there in terms of this. Yeah, it's a. It's. It's amazing. All right, so Ronald Canada asks. Hey, Jonathan, I've heard some of the recent videos you put out or others that put out in conversation with you, and in one you spoke of how we are called to die on purpose, just as Christ did. I know you discussed this concept some in the video, but I found it so fascinating that I was hoping you can explain it a bit more here. And so, I mean, it's not me. It really is. You find that in the church fathers and in the ascetic fathers especially. I mean, and it's the idea that Christ. It is one of the mysteries of Christ, which is Christ basically changed the nature of death or showed us what death is truly for and, and what it can do. And so this is, of course, in the actual death that he. That he went into. But it's also in terms of little moments. It's little moments of. Of will being willing to self. To sacrifice. Your immediate kind of desire or your immediate pull is. Means that you won't be a slave to it, you know, and so you. You sacrifice. You sacrifice. So the idea is that. And it's also this idea that, like, instead of sacrificing other things, because that's how sacrifice used to work. So it's like you take something and then you sacrifice it. And. And then that becomes like a foundation for. For a world. But the mystery that Christ showed us is that you sacrifice yourself. Then it becomes like a seed that bears fruit into eternity, that bears fruit into. Into way more fruit, like just way more than than the idea of sacrificing, you know, the, the scapegoat or, or sacrificing some animal. And so, and so you can kind of see it in your life. I hope that you can see that when you, if you sacrifice yourself for your children, then they will become like, they will grow and they will become more than what you were and they'll become more in terms of multiple quantity and they'll, they'll grow your fruits into the world. And so and it's the same if you sacrifice yourself for, for others, then it will act as a kind of seed that will. And so that's the idea that if you, if you don't, if you don't sacrifice yourself, then you, then you will be a slave to the things that kill you because you, it'll happen to you instead of, it'll be a passion. That's what passion means. Passion means something which is done to you, right? Something that you incur. And so you could say that Christ willfully went into his passion. That is he, He. He. He was. He willfully accepted that others act upon him and then that transformed reality. So yeah, well, I'm done with the questions there, so let's go see in the super chats if there are super chats. All right. And so we go. So sal door for $5 says thank you for your work, brother. I'm enjoying the shirt and prints. Well, I don't know who you are, Sal door because you have like an anime thing, but I'm happy that you, that you are enjoying the, the things that you, that the prints for. I don't know if you, if you mean you got them through Patreon, but probably not the shirts. Probably got them on Teespring. And so thank you for supporting what I'm doing. I, I'm really enjoying the T shirts thing. I didn't think I would enjoy it so much. I kind of like the idea because some people are giving me pushback on it and I understand, but I kind of like the idea that I'm making things that span from the altar to the street. Like I like that idea, you know, the whole idea of hierarchy where I can make a book cover or a chalice or, or you know, processional cross, but then I'll also make something that you know, like a 20 year old guy in college, you know, will want to wear. So I like that. All right, so dirt poor Robbins. Neil, thank you for $10. That's very kind of you. So Martha Immers says, can you comment on the Theotokis as both virgin and mother in this she seems to inhabit the same space as the bush that burns and is not consumed. Yes, the God who dies but then lives. But I can't work out the meaning here. So I don't know if it has to do with the God that dies and then lives, but it definitely has to do with the bush that burns and is not consumed. And so you can understand that the, the idea that the extreme of reality or like extreme potentiality in order to house everything has to be non perturbed. Right. Think of it almost like, think of it something like for the, the ocean to reflect the sun, it needs to not have waves on it. And so when it has waves on it, it can reflect the sun and in like a frac, in a fragmented way. And so the light will sparkle. But then if you want to reflect the sun directly, then you have to, you have to be still. There has to be this stillness. And so that's what the idea that through her virginity the Mary becomes the mother of the very principle of reality, the very, the very thing that organizes reality. And so you have to understand her virginity obviously not just in physic physical terms, although that's part of it, but you also have to understand her virginity in the. Yes, like in this giving up her will for the, for the will of God. And so when the archangel comes to, to present to her that she will be the one who will receive the Christ, then this, yes that she answers. And then this, this like worship, you know, it's kind of making herself low saying yes and then opening herself up in this, like in this worship. And so that is how being. The relationship between being a virgin and mother. And so the, a normal mother is a. Is mitigated along that line. Right. And so it's not the, it's not the, the so there. But there's also an aspect of that which is there even in like the Christian family, for example. And so, so the idea that. So it's not, it's not virginity, total virginity, because that's for the totality. But in terms of properly hosting the seed of her husband, let's say that a woman must be chaste to, you know, must be dedicated to her husband. And so she's not a complete virgin for everything, but she has to be virginal in relation to all the other men and chaste towards her husband because if she's not, then that will sow confusion, obviously, because you want, you might not even know who the father is. Like this dedication and this, this capacity to be a virgin to everything else is also what is. Gives the possibility of properly hosting the masculine towards which it is, towards which she's dedicated. And so there's. It's like a fractal. It's actually a mini version of this story of the virgin mother, but it. On a smaller scale. Right, but it can help you understand how that's actually how. Like I said, it's actually how reality. How reality works. You know, you can't have something be many things at the same time. It has to. It has to have a form of dedication which appears as virginal to everything else. Right? Like. Like it. It's not. It's not mixed. It's not confused with other things. It's this space which is open only to one. To one manifestation. And that's how you have something which can exist in the world without it being confused. Anyways, I always feel like when I go too far in these. These descriptions, then I. Then I'm losing everybody. And then, like, then they think I'm just spouting gibberish. All right, so Michael Vitales for. For us, $20. Thank you, Michael. So shaky raindrop for $10. How can I introduce a symbolic worldview to my Protestant biblical literalist family? They reject extra biblical texts and regard the Church fathers as a cult. Whoa. Occult, as in voodoo, magic type of cult. Dude, a cult. The church fathers. And you could be cheeky about it, but, you know, you wouldn't want to do that. You know, obviously the word Trinity is not in the Bible. Someone came up with that at some point, and that person would be called the Church Father, you know, but you know, that maybe that'd be a. That's a more cheeky way. Like, the best way to help people see the symbolic worldview is through typology. For people who love scripture, the best way to. To help them have a symbolic worldview is to show. Show them how the story of when Christ says, you look through the Scripture, but you don't see that they talk about me. It's like he's telling the Pharisees that. But so many people are like that. And so it's like if you can get them to understand that all the scripture is talking about Christ and then. But not in a vague way. Not in like a kind of vague, yes, you know, the Bible talks about Christ's way, but rather that, no, everything in scripture is referring to Christ. Like every, every, every verse, every sentence in scripture is pointing to the manifestation of the divine Logos in the world, which culminates into the incarnation of the Christ of the God man. And so, and that can be seen in the typology between the story of Christ and Genesis. Like you can find, you know, help them see how, for example, like, Christ does certain things which don't make sense unless you see them as referring back and answering the things that are happening in the Old Testament. You can start by the things that Christ says. So Christ says, you know, as the serpent was raised by Moses, so too the Son of man must be. Was. Be lifted up. And so, like, why is he saying that? It's not arbitrary, right? He's, He, He. He's. He's making a connection. Can we expand that connection? We talk about it, like, why is that connection made? And so working on those types of moments where Christ himself seems to, seems to make connections. And St. Paul, for example, makes connections. Like, for example, the book of Hebrews is an amazing book in terms, to help people see symbolism because the author is basically telling you that everything about the Old Testament culminates into Christ. And so, like, what does that mean? What is that about? What are the images? So I think that that's probably the best way to go about that and then hopefully kind of build on that and help them see that, even help them see too, that the reason, the reason why you say, for example, that something like the Genesis story is a. Is the pattern of reality or that the Genesis story is showing you how the world works is because you love Scripture. It's not because you want to debunk it. Because one of the problems is that a lot of Protestants, and I understand this, I sympathize with, with this, the, the type of person they've met in the past that have tried to talk to them about symbolism have been people who have wanted to do that in order to discredit Scripture. So they'll say things like, right? They'll say things like, well, the story of Jesus, you know, is just one other version of Mithra or one other version of this other. This other mythological figure. And so they see the analogy and so they try to point to it in order to discredit. But it's like we're going at it from the other way. We're saying, no, it's like this is, you know, the symbolism actually gives power to Scripture. It makes it a map of reality and makes it something by which you can live every breath of your life through, right? So, so it's, it's. It's actually more than the kind of moralizing and technical type of, of. Of description. You know that, that you'll find in. In certain branches of Protestant. Protestantism. So that's what I would suggest. But it's hard because it's also emotional and you can't get through emotional emotions with arguments. Then it's. And then, then, then you just have to become a saint. You can't get around it. If you become a saint, then, then it'll be fine. So Bread Pilled says, what is your opinion on natural magic and Christianity? A la Marcelo Ficino, Pico de la Mirandola. Is it something you could do a video on? Sure, maybe, sometime. I don't like talking about that stuff too much, but, you know, I'm not com. I don't. I don't like people who, who have this strange. On the one hand, you know, are traditional and like liturgy and like ritual and like all that. And then when they see any form of ritual action in. In the world, then they're suspicious of it. It's like, why are you suspicious of the fact that certain gestures would. Could create certain results? And so I think in that sense I'm not completely opposed to some of the, some of the, some of the notions that you would find in something like natural magic. Of course, the problem is mostly related to invocation, like people who do demonology, for example. That stuff is extremely dangerous. Invoking wild principalities in order to gain power from them is definitely something that will cause problems. So mean. I would have to think about it, but maybe at some point I can make videos about that. So Louis Duron asked, how should I approach interpreting the Book of Revelation? That is not a question you are allowed to ask, Louis. You're not allowed to ask that question because it's the toughest thing to interpret in the world. And so it's like you probably shouldn't and, you know, it's just so difficult. So sorry. Sorry about that, Louis. So Griswold Grimm, our friend Griswold, says, what's your view on Hindu deities and rituals to them at cern? Yeah, I don't know about that. People are talking about that weird. I don't know. Like people can. Are you talking about like the weird tunnel thing which got conflated with cern, which is actually not related to cern, like the weird tunnel or, or I know that in, in at CERN there's a statue of Hindu deity. I know that, but I didn't know that they actually had rituals. I know that some quantum physicists and some like high physicists have been influenced by, by Vedanta in terms of the, these, this, you know, the, the description of like principles of manifestation. Some people, some of the physicists have been influenced by Buddhism and also Vedanta and just Eastern thought in general. And so I don't think much of it. Like I, I think, I think people can't see Christianity. A lot of people, for some reason they can't see it properly maybe because it's their own thing. So they feel like they have to kind of look outside in order to see something. But it's a, it's a, it's a dangerous game because. Undermines the world. So Michael Vitales for 9.99 says, can you, could you explain the symbolic meaning of modern Christian praise and worship? Is the concert setting stage, electric guitar, drums, more shallow than the liturgy? What makes a good worship song? Yes, it is more shallow. It's more shallow first of all because of, even the spectacle aspect of it makes it more shallow. The fact that it's set up like a show, the fact that, that worship bands are trying to imitate concerts, all of that is a problem. It's a serious problem. It's, it's, it's a lack of understanding of what we're doing. It's a lack of proper vision of what, what's. What it means to worship, what it means to be in communion, what it means to act in a direction together. All of these things are, are just completely ignored or, and it has to do with, it mostly has to do with the problem of this, this kind of anti. Symbolic vision where people don't think that for example, the way that you do something is related to the meaning. You can't separate the meaning with the way you do something. The body and the soul and the spirit of something are connected, they're not disconnected. So, so, so if you, you know, it's like you worship has a content and it also has a form which reflects its content. And so if you have a shape show and you have people that are dressed in ripped jeans with ripped clothing and, and have funky haircuts with dye in their hair and, and then they're, they're singing songs which we're used to hearing at concerts, at rock concerts, then. Yeah, I mean it just doesn't, it just doesn't, doesn't work. And so I think it is more shallow. I have nothing against music and I even have nothing against concerts and, and there's room for dancing. I, I believe all these things, like, I just don't. I just think that it's a hierarchy and so you can't have. You can't have something which is meant for the tavern in the church because you're just not understanding the proper relationship of things. So, so I think that a lot and, but in the same, at the same time, like, let's be honest, I prefer this. Like, I'd rather someone go to church on a Sunday at a, at a like charismatic church with a really good band and a light show. Like, I prefer you go there, then go see, I don't know, some death metal band or go see some really horrendous rap artist that is disgusting about his. In his lyrics. So it's like I, I would. It's still better. So, you know, parade for praise songs. I'm totally fine with praise songs. All right. So Valensky, for $5, ask have you ever looked into the Rotos Square? It is used in the movie Tenet. I would love to see your take on it. Yes, I have thought about the Rotas square. I'm afraid that I probably couldn't go into it right now just because I would need to have it up on the screen and kind of point out to it. It's a very fascinating square. It does seem to have cosmic, a cosmic meaning. And it, it seems to have a cosmic meaning in terms of how the world turns or how the world works. But. But it's not super clear. I mean, maybe I'll do a video on that. I'm afraid I. It'd be hard for me to answer on the fly like that. So. The Golden Thread says thank you for engaging with Benjamin RVA's a graduously long question. It was a helpful answer and not too technical. Greatly appreciate it. Well, thank you, Golden Thread. Appreciate it. Wow. There's a lot stuff for Brain says, have you ever considered having Nassim Talib on your show? He's mostly known for predicting the 2008 crash and his polemics against academics, but it's talked highly about religion and is Eastern ortho. Man, I'm scared of Nassim Talib. Like, he is a scary dude. The things that he says on Twitter is terrifying because he's also so smart. He's obviously an extremely intelligent person and an extremely intelligent mathematician who's definitely not afraid of flaunting his intelligence and using it to crush his opponents. And so it's like, first of all, I'm not sure you would even agree to come on my show. But if he did, it's like I'd be nervous to talk about his concepts. But if it have, if there's an opportunity. I'll do it for sure because he's obviously an interesting fellow and I think he is orthodox. I don't know how practicing he is, but he is orthodox. So. David Mac Markham says Happy feast day for $10. Thank you, David. Jacques Christo for $5. Are you familiar with the show Neon Genesis Evangelion? Yes, it's. I know about it. Everybody's telling me to read it, to watch it, but I haven't watched it because I don't watch a lot of movies to be honest. But I actually trying to convince like my daughter who's really into anime. She's 13 and she's like really into anime almost too much. But that's okay. I'm trying to convince her to watch it with me but I haven't succeeded yet in convincing her. So. Travis Jordan, US 42. Thank you, Travis. Wow, that's amazing. That's a. With no question. So ASNA for 10 written British pounds, do you think that the way the world sees design today is how people saw art in ancient times? I would say similar, yes. I would say similar, but not exactly the same in, in the sense that design today has, has a lot to do with effect. Like in terms of. There's still a kind of weird. Not always, but there's, there's. There's often an alienation between. There's a type of design which is there to just make the thing as functional as possible and then there's a type of design which is there to just make things pretty, let's say. But I think that the best type of design would be something which tries to make the thing it's making as functional as possible in beauty at the same time. Because the beauty ends up actually being part of the function. Ultimately that's something that's hard for us to understand. But when you look at an ancient sword, you know, or you look at an ancient anything like these ancient objects that were made, there's a. There's a functionality but there's also a power of balance and, and beauty and ornament even. So, so Shaky Raindrop Friday asks thoughts on technology, especially in relation to techne and poesis. How can we rejoin art and utility? Thank you. So, yeah, similar to the other question, you know, I think that that's the problem. Like one of the big problems of our world has been the complete tearing asunder between beauty and then technique and poetsis or, or. Or. Or music, musicality or pattern making that, that you would find in the ancient world. And so you know, I mean that's obviously one of the reasons why I make liturgical art, is that I see in liturgical art a place where it's still possible to join all of those together and to make objects which are both technically proficient, are embodied principles, and are also, you know, reaching out in terms of iconography and in terms of the possibility of creating patterns of meaning at the same time. So. Yeah, so Tao for 5. Thank you. Love you, man. Thank you for everything you do. God bless you. Thank you, Tao. That's very kind. Euro divi for $5. Hey, Jonathan, love your work. Hopefully this isn't too sensitive a topic, but what are your thoughts on Origin? I mean, look, I think Origin is extremely important to Christianity, and I think anybody who denies that is deluding themselves. Origen, you know, there's a reason why all the most important Fathers, that's why the reason why St. Basil and St. Gregory, you know, the Cappadocian Fathers published a philokalia of Origen's work. They published a kind of edited version of Origen's works. And so we can't get rid of Origin, like so. And nonetheless it seems like in his writings, or maybe in his students writings or those who saw themselves as disciples of his, that some excesses were there and some mistakes and some errors in terms of, of his. His tendency to be maybe a little too speculative in terms of his understanding. And so I have to recognize that as well and recognize that because of that, Origin has been excluded from the official, you know, the official space. But at the same time, he's very important and some of his insights are, are very powerful. And so just like, just from example, so it's like, just like I willing to read the Iliad and see insight in the Iliad, and just like I'm willing to even look at Midrash, like Judaic Midrash, and find some insight there. You know, I have no problem with reading Origin and finding some insight in Origin, as long as you are aware of the dangers and aware of the, of the differences between what has been accepted by the Church and some of the things that Origin has propounded or supposedly propounded. It's hard to know because there's so much polemics in that, in that discussion. But yeah, that's what I think of Origin. But having said that, I haven't read as much Origin as a lot of other people. Like, I've read some Origin, but not. I haven't like read everything he's written. Oh, so there's more questions. All right, so, so stuff fried brains for $10 ask. What is the most righteous way to celebrate God? If we, if I were to peruse art. I've been interested in creating video games since I was young. Can this be holy art without being tacky? I would say probably no. I would say be careful. Don't try to make holy video games. I would say try to make good video games that are, that have, that are something like, you know, art, secular art that is kind of pointing in the right direction, you know, because not all art is sacred in the, in the strict sense. Not all art is made to, to be part of a church. But it is possible to have a, a painting in the king's, in the king's dining hall that isn't a saints or that isn't that It's a historical, beautiful historical painting which, which emphasizes virtue and courage and, and, and those types of things. So I think that it's possible to make video games like that. So I would say that's probably the best thing to do. I don't know how you're going to do it, but it's possible. So. Ron Wood, for $10, ask. Hey, Jonathan, perhaps this has been answered, but I'm curious how the God's Dog project is doing also. What do you think of Paul's Language of Creation videos? And so I send those to Matthew. I watched one or two and then I send them to Matt here. And so Matthew's pondering, you know, Paul's take on his, his book. So that's, that's interesting. Curious if Matthew is going to have a reaction or maybe write a comment or something. Hope we'll see. In terms of God's Dog, it's according to the plan. It's this summer, like this summer we're going to put out the, the, the comic. It's going to be the first book. It's supposed to be like four books or five books. It depends if we, there's something we want to add. And there's also the. There's going to be an extra book which is going to be kind of like a more symbolic book describing some of the symbolism of the dogged men. And then also Mat said he was going to write a, a book on an article on Samson which is going to be awesome. So we're really excited. We're probably going to do it as a crowdfunded project. And to be honest with you, like, I'll be really honest with you, what I hope is going to happen, what I would hope would happen is that it, it's very successful and that Quote, cord can quit his job and then make the next book. I'll be honest with you, that's what I hope's gonna happen. Now, I don't know if that's possible because I really don't want to wait another, like two, three years to put out the other book. Like I would. I would really like to put out the. The second book within a year of the first, but that would really depend on whether we can make it happen happen like all, all out. Make it happen so that everything's covered, you know, the printing, the distribution and like, basically, you know, Cord salary and so. That's tough, man. That's tough. Like, it's, it's a. It's a. It's. It's a. It's gonna end up being like a higher number. But, you know, so I'm hoping that's what's going to happen. If not, then we'll put it out and then, you know, then we'll. Then people will. Will wait until the next. The next book, which might. Will take a little longer. So. So, max, sheesh. For $5, that's. What do you think about the Lesser Keys of Solomon and 72 sigils Unicode emojis? I never thought. I, I didn't. I don't know anything about this 1772 sigils Unicode emojis, so I wouldn't know how to answer the relationship between those two. So. Brandon Samuel Friday asked thoughts on Oswald Spengler's view of history. Rome, Babylon, Egypt being typologically similar. Decadent atheism. I mean, I think that that's. I haven't read Spangler directly. I've read him through other sources, but I think that he has a. I think that he, he has a good insight in what brings about the end of civilization. And I think that his insight about how this is something which seems to be happening now is particularly good. So, you know, so stuff. Stir for brains for 25. Wow. Surfer brains. Nassim is very gracious to people who act through experience. Shows great grace to those who take risks for what they believe. God bless. You've helped me back into the path of Christ also. Bishop Baron. Win. So thanks. Yeah. Maybe I could reach out to. To Talebi. He probably won't answer because it's like he's a pretty big fish, but maybe I could try. That'd be interesting. And Bishop Baron. I don't know, man. You know, you guys, if you want me to be on Bishop Baron, you guys need to make the pressure because I've Pretty much done everything I can to. To get Bishop Baron to talk to me. I've talked to the right people. I've been able to email, it seems the right people, but no movement on that. So if you want, if you want Bishop Baron, you guys, you have to start. Other people have to make noise. So. So, yeah, so that's it. All right, so I think we're done. I'm out of voice. Look at you guys. You guys are able to make me go like a lot longer. Look, it's 11:30. I went from 9:00 o' clock to 11:30, so I have to say that I'm out of out of voice. So. So anyways, hey guys, thank you for, for, for attended. For attending. Thank you for, for being there. I really appreciate it. And there's some good stuff down the line, you know, and crazy stuff. Everybody knows there's crazy stuff coming because I keep repeating it at non stop, but. Oh yeah, just to tell you that I need to. I guess I need to mention this, that this month's the, The January Patreon video I put out on. Didn't put it out on YouTube. I put it out on Bitchute because I'm talking about vaccines explicitly and the symbolism of vaccines. And so I did not put it out here because. Because it was maybe too much for the algorithm. Wouldn't like it. So just, just make sure you know that. And, and I probably will be making a video on the sidelines of that. I might do a video on the mark of the Beast and talk about that symbolism and how it relates to the mark of Cain and then all the, you know, what a mark is and all that stuff. So that might be interesting for people to think about some of the craziness that's going on right now. So everybody, thank you. So Nathan, Kurt's last. Last one. Last. Says your Twitter exchange with Jeff Martel got me to check out his podcast. I'm very excited about the prospect of YouTube talking. We have talked The. The video is actually up on YouTube and, and I will make it public tomorrow. So you will enjoy that. It was an interesting conversation because he, he's like my weird doppelganger and, and he. He comes to very different conclusions than I do. So. So I think you'll enjoy that discussion. All right, guys, it was good to see everybody. Thanks. Thanks for your time. Thanks to the moderators for those that. That are still there and I. And I. Yeah, I really appreciate it. So I'll see you next month, guys. Bye. Bye. Don't forget, sign up on the website. Look at me. I'm like. I'm like a. Like an advertisement guy. All right, bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Great. Going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
