{"episode_id":"SW - #068 - 2019-10-30 - The Symbolism of Halloween","start":0.48,"end":1325,"speaker":"Jonathan Pageau","text":"In many ways, Halloween is the last carnival left in the West. It is in many ways a modern holiday, although it takes its roots in ancient holidays as well. And so I want to look at Halloween, especially as someone who grew up in a Christian home. There was a lot of controversy about Halloween, whether or not Christians had celebrated and what exactly it meant. And so I think that that controversy is actually part of its meaning. And so we're going to look at Halloween, the different practices that are being done in the modern time, and look at what it is exactly. They might be telling us symbolically what they might be telling us about the. This is Jonathan Pageau. Welcome to the symbolic world. So Halloween, the way it is practiced now, is mostly an American holiday, although it does have its root in Irish culture, in some English culture, and also in Catholic culture from before. But in the. In the modern form, most of us, most of the people who'll be watching this video will know what it looks like. It's a night where all the houses are decorated in a garish manner in terms of frightening decorations. Tombs, vampires, death, monsters, all this stuff, cobwebs, witches, all the. The most cliche version of what is frightening to a human person are brought together in this evening. And then usually what happens is people will. Children especially, will dress up in costumes. Adults, it seems, do that as well. And they'll play frightening games, they will watch frightening movies. And ultimately it all comes together in trick or treating, which means that the children will dress up as monsters, there's all kinds of things, and will go from house to house and ask for candy by saying trick or treat. If the person gives them a treat, then the monsters go away. And if they don't, in theory, they get a trick, but of course, of course, nobody does that anymore. But that's the narrative, that's the story, at least that we understand is being told. And so I want to look at each element and talk about the history of it a little bit in terms of why it's taking the form. It is, as I've said before, in many of my interpretations, we have to be careful in thinking that just because we discover the historical causes of something, that somehow we have discovered its meaning. The historical causes of something can help us understand the meaning of something, but it doesn't end there. And so one of the big controversies that is held both on the kind of neo pagan side and the fundamentalist Christian side is that Halloween is a residue of an evil ancient Celtic holiday, Samhain, which was celebrated at the same time. And there's something very interesting about that because, well, let's go, let's move to what it happened later. And so it coincides, this ancient feast of Samhain would coincide pretty much around the equinox, these, the fall equinox and the solstice. So kind of midpoint between the equinox and the solstice. And so what you can understand is that with the equinox we have this shift where all of a sudden the days start to get shorter, but you don't notice that right away. And then with the equinox we reach this kind of 50, 50 day where the days are, ha, are half short, half light. And so it's like this last moment and then after that the days start to get shorter and shorter, moving towards the solstice. And so halfway between that is the moment where we really would notice that the days are getting shorter, everything is getting cooler. The leaves are changing. In certain parts of the world, especially here in Canada, the leaves probably already are starting, the leaves are starting to fall around the time of Halloween. And so it really makes sense that this feast would be connected, at least in Western Europe to the feast of the All Hallow Tide, we call it in the Catholic Church it was called All Hallow Tide. People, some people still celebrate it today. It's three days of celebrations. There's All Hallows Eve, which has come to become Halloween. Then there's All Saints Day, and then there's All Souls Day. And what it is basically is a day to commemorate the dead. And so we have the eve of the feast, then we have the main feast which is All Saints Day, which is prayer to all the saints. And then there's a later holiday which was added, which is All Souls Day, which, which was a day to pray for all the dead. And so what we have is this moment where all these, let's say images of death were kind of brought together, praying to the saints, praying for the dead. But also in terms of Western Europe, the seasons are starting to change, things are getting cooler. And so there's an element of death which is missing. You can see the things coming together. You can, you can see all these images of death coming together, but there's an aspect of death which is missing. And that would be the more, we could call them, the more negative aspects of death or a, an understanding or a participation in the negative aspects of the dark fringes, that darkness on the corner which is equivalent and related or at least related to death. All those negative emotions like fear, like horror, all these things which we associate with death. And so it is inevitable that at least in the folk tradition, that some thing would happen, that something would come together at that time to celebrate, let's say, or at least remember the darker aspects of this feast of death, we could call it. And in this idea of, let's say, celebrating the feast of death, it's not completely irrelevant to think that it is partly or largely this celebration of death is related to a remembering in a decomposed manner, a remembering of pre Christian Europe, that there are some strains of pre Christian Europe which, which would appear in this kind of remembering of death. Because the notion of something which came before, of a world that came before our present world, is also extremely related to death. To the margin, to the monster. I've talked about this before in several of my talks, how that which precedes our origin is usually portrayed as a monster. Which is why you have these mythical stories of heroes that come into a new land and chase away the monsters, chase away cannibals or monster, you know, dog headed men or all these kind of monstrous creatures. And that's why, you know, on the, on the edge of the world you have this idea that the Titans are there, these horrible monstrous gods, you know, in, in Greek mythology, but that these Titans precede the order of Olympus. And so this is how the world works. When something replaces something else, that which was there before becomes a kind of reaction, residue, becomes like a decomposing corpse and it becomes related to death. It's for the same reason that, the same reason that the Greeks portray the Titans as being these dark, monstrous forces on the edge. Then Christians portray the ancient gods as being these demons on the edge. And the reason why they do that is because that's what they are, that's what they become. Because a new story is established and that which was before no longer connects to the new story. And so when we see those things, they don't fully fit in the story and they appear to us as monstrous, as decomposing, as residues we could call them. And so it's not completely strange to imagine that the Halloween holiday, especially in that moment where there's a celebration of death, we would see aspects of the residues of the ancient religions pop up. And so even if it's not the case, even if it's a purely Christian holiday, the very fact that people say that, the very fact that people latched on to that as a narrative shows you the structure of how the world lays itself out. And so we have this celebration of death. And what does it look like, what are the elements that are part of the. Part of Halloween? Now, one of the first things, of course, is the basic notion of all these monsters that come out. You know, the vampires, the ghosts, the ghouls, all of this coming out of monsters in the form of storytelling, in the form of watching movies, in the form of costumed people. All of these monsters are coming out. Now, the thing about ghosts and monsters and a lot of these creatures is that they're not fully embodied creatures. They're somewhat more on the print side of print principalities. And so they need what we could call secondary causes to manifest themselves. They don't manifest themselves on their own. And so you actually need movies and novels and. And people to dress up in these things for them to appear to us, because they're not. They're not. They're not bodies the same way. They don't have bodies the same way we have bodies. They. They are subtle beings, you could call them. Hopefully that makes sense. And you're not taking it in a science fiction way. Uh, one. One day I'll explain more about subtle bodies and, And. And all that and how it. It makes sense. But just to say that these beings, they. They manifest themselves through. Through these. These secondary causes, like, like the costumes, like the stories, like the big giant vampire that you put up in your window, you know, like the. The hanging ghost that you put up to decorate your house. All these things are how these monsters at this point manifest themselves in our world. And so makes sense, of course, to think of this time when darkness is becoming more and more apparent, where death is becoming more and more apparent in nature, that you would get. It's like, you know, once the. When the light is not strong enough, then the darkness starts to take form. The darkness starts to manifest itself, let's say, from below. You could. You could say something like that. Like, it starts to. It starts to appear from below. And the way to get rid of that is, of course, to pray. And that's why we pray to the saints. That's why we pray for the dead. That's the way to solve Halloween. Okay? The problem that we have right now is that we only celebrate Halloween, and nobody celebrates, or almost nobody celebrates the second part. It's just like everybody, you know, still a lot of people will celebrate Mardi Gras, but nobody does Lent, and nobody celebrates Easter. And so it's a. It's a sad sign of our society that the only thing left of this. This hollow tide is the monstrous part, whereas the prayer part, which is the way to get rid of the monsters isn't there anymore. But nonetheless, let's. We can still go through the elements and to help you understand why they manifest themselves that way. So now the notion of trick or treating is very important in terms of understanding this problem. The problem of death or the problem of things which come from the margins and start to manifest themselves. The problem, the question is, how do you deal with them? You know, because strange things that come from the edge and they come to your door now you have to decide, do you let them in a little bit, do you let them in completely, or do you chase them away? And you have to realize that if you chase them away, then a horde can come towards you. You have to watch out. Christ talks about that, by the way, he says, he talks about the person who chases away the demons and then sweeps his. Sweeps his house, you know, and the. And then all the hordes of demons come and find a nice clean place to inhabit. And so you have to be very careful when you chase away the demons. A good example of that is someone who, for example, will want to diet extremely. And so because of that, they'll impose on themselves an insanely strict diet. And then what will happen is that they'll swing between an insanely strict diet and binging. And so that's what happens when you're not careful when you chase away the demons. It's the same thing with all those passions that come to you. And it's the same thing with strangers as well. If you are hostile to strangers completely, then those strangers will see you as hostile and maybe they'll come and rob your house. So what is the right way to deal with it? And the right way to deal with it is to find the balance of hospitality and the balance that is found in the trick or treating is the monsters come out to the door, right? You don't let them into your house. You keep them on the porch and then you give them a little something so that they go away, a little treat just so that they go away. It's called placating demons. And a lot of people will say, oh, it's horrible, because that's what pagans do. Pagans placate demons, you know, and that's what all these shamanistic religions do, they placate demons. And yeah, the truth is that's what they do. But the problem is that you placate demons all the time. We always placate demon. That's what, you know, every time you smoke that cigarette, every time you masturbate, every time you, you know, eat that second piece of cake. What are you doing? You are placating the demon, all right? You are giving a little bit of candy so that the demon will go away, at least for a while. And so obviously that is not the best way to deal with that. And that's why Halloween has. Has that first little kind of remembering of death and the. And the vicissitudes of death, you could say. And then it has all saints and all, all, all souls. Because the answer to the problem of Halloween is prayer. Now, I'm not saying that you shouldn't celebrate Halloween, and I'm not saying you should celebrate Halloween. You should understand why all those things are lined up the way that they are. Makes sense. And so in the Halloween, you have all the kind of negative or the marginal aspects are used in the feast. So apotropaic imagery is used. You know, instead of having gargoyles on the outside of the church, you put gargoyles in front of your house. And so you're using death to chase away death. You're using these frightening husks of. Of the harvest. And you are trying to frighten away the monsters, frighten away the. But, yeah, but at the same time, you're also attracting them at the same time. That is the ambivalent problem of apotropaic magic. But anyways, that is the ambivalent problem of apotropaic practices, you could call them. And so that is the basic of Halloween. But you also have to think of Halloween really as a carnival in the sense that, you know, like, it's the. The placating of demons. That's a bit what carnival is in general. It's this moment where we let in a little bit of inversion, a little bit of madness, a little bit of darkness, in order to not completely give ourselves to it at some later point. And so when you're wearing a costume that is also something that's happening, you don't necessarily realize it, but often when you choose a costume, you are, in a way, venting some little aspect of yourself, you know, especially those that dress up as monsters and all this kind of more scary stuff and the ladies dressing up in the sexy stuff. It's all about venting. The. Venting that little part of you that you've been bottling up and you. And giving one day for it to kind of come out a little bit and then putting it aside. So it does have. Everything that the carnival has is in Halloween. Now the question that, of course I said I won't Answer. Maybe I'm going to answer it anyways. The question, of course, of why should we or shouldn't we celebrate Halloween? Now? The question is, is Halloween somewhat dangerous? The answer is, of course, yes. All those images of monsters and witches and everything, they are images of death. They are images of all those things that can devour us on the edge. And. And so is it dangerous to engage with that? The answer is yes. The other answer is what happens if you don't engage with that at all? That is also dangerous. And so I think that each person, especially as Christians, have to find a balance with that, have to understand that you will have to deal with your demons. You will have to. And you will placate them. No matter what you think, if you think you're not placating your demons, then you are living in an imaginary world. And so you will do that. And so this feast, the feast of Halloween, is a small moment where we can at least understand the structure of that. We can participate it in a kind of celebratory way in order for us to see how it works. And then hopefully, then we will also know that in the original Halloween, there is the answer, which is prayer. And prayer is the answer, the ultimate answer to your demons. But in the manner in which it's celebrated, in most people's experience, there is, because it's in a manner, also a kind of laughing at death. That's what I told my kids. I said, one of the aspects of Halloween is that here we are, we're looking outside, we're seeing the days get darker and darker. We're noticing that the sun is going away. And so the question is, is that it, Is it going to end? Is the sun going to go forever? And we know the answer. The answer is no, it's not. It's coming back. It's a ruse. It's a trick. All of this is. It's not an illusion, but it's a temporary thing. And ultimately spring will return and, and the world will live again. And so there's something appropriate about laughing at death in that moment to make fun of the power of death, because we know that it has lost its power long time ago. And whatever power it has is the one we give to it ourselves. So I'm going to, for October this year, I said I was also going to give some, some descriptions of some monsters. And so you'll see them in the next, in the next few weeks until Halloween. And I will also leave one of the interpretations. I still haven't decided which one is going to be held for the patron only video. So I will keep all of you keep you informed on that. So I wish you guys a good October and see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
