{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":0.56,"end":64.07,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I am going to play for you a panel discussion that I had with Jordan Peterson and Brett Weinstein last year at a Students for Liberty event. And before I play that clip, which is quite long, it's about an hour and a half, I'm also going to play for you a short clip that I put up a few weeks before, a clip of Bret Weinstein talking to Joe Rogan with Jordan Peterson, where they talk about this idea of truth, what he calls metaphorical truth and literal truth. And then I give my analysis of that. It's important to have heard that because at the end of the Q and A, the mediator announces, ask Bret Weinstein if he's heard the clip, and then asks him to respond. And the most interesting part of the discussion then ensues, sadly, to have the discussion cut off towards the end. We hope that one day we continue the discussion, but that seems improbable at this point. So enjoy."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":78.15,"end":79.67,"speaker":"Jordan Peterson","text":"This is Jonathan Pageau."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":80.07,"end":81.75,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":92.55,"end":93.11,"speaker":"Jordan Peterson","text":"Hello, everyone."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":93.75,"end":217.26,"speaker":"Jonathan Pageau","text":"I've been wondering for a while whether or not I should weigh in on the whole debate which happened between Jordan Peterson and Sam Harris on the question of truth. Though I'm sure that for those who have been following me, you can surmise what I think about this already. Maybe at some point I'll put something together, but in the meantime, I wanted to give you a short comment which is moving in that direction, let's say. So a few weeks ago now on the Joe Rogan podcast with Jordan Peterson and Bret Weinstein, they had a discussion commenting on the whole Harris Peterson conflict about truth. And just like Sam Harris Weinstein and Joe Rogan just couldn't grasp the extent of this question. And that's really a problem. There really is a kind of blindness to consciousness and blindness to the extent to which the scientific truth they love so much is embedded into religious structures, embedded into language, embedded into patterns of being. I mean, I don't want to go into the argument too much, and if you want a more detailed description, please watch my video. How Scientists Nested in Religion. What I'm about to show you will suffice to demonstrate to all of you how inescapable all of this is. Now, the first thing I have to say is that I have the utmost respect for Bret Weinstein. I think that he acted forthrightly. I think that he acted heroically in standing up to the politically correct bullies. And I wish that there would be more professors like him. In, in the North American university system. And honestly, I hope that this difficult moment for him will become an opportunity to do much more than what he's had to leave behind. So let's start with the basic argument. I'm going to play a little clip of his attempt to reconcile the two positions which were presented by Jordan Peterson and Sam Harris."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":218.62,"end":248.07,"speaker":"Bret Weinstein","text":"We tend to think of intellect as having evolved because knowing what's true gives you an advantage. But there's actually nothing that says that the literal truth is where advantage lies. And so I have a category that I call literally false, metaphorically true. These are ideas that aren't true in the factual sense, but they are true enough that if you behave as if they were true, you come out ahead of where you would be if you behaved according to the fact that they're not true."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":248.55,"end":296.94,"speaker":"Jonathan Pageau","text":"So according to Mr. Weinstein, the there are these factual truths which correspond to scientific truth, I guess, which he opposes to metaphorical truth, which are factually untrue but contain a form of wisdom which can be useful. So I think that his categories are inadequate. But obviously we would say that symbolic truth contains the wisdom, the usefulness, but does not necessarily have to be non factual. But at least for now, I'm willing to go with him on this. Let's just follow through and see where it goes. So after he gives a few examples of how these two truths relate to each other, and then Jordan gives a few points, Weinstein then goes on to say this."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":297.26,"end":314.4,"speaker":"Bret Weinstein","text":"There is this overarching truth, the one that Sam Harris was pointing to, the one I think you're pointing to also, and the one I'm imagining we all subscribe to, there is the testable truth that reveals itself in the laboratory or in a careful experiment in the field. And that really is the top level truth."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":314.4,"end":554.34,"speaker":"Jonathan Pageau","text":"But now did you notice what just happened here? So beyond the slightly condescending tone of wanting to attribute his opinion about scientific truth to everyone in the room, as if obviously we all agree that scientific truth is the top level truth is the overarching truth. I mean, it's so obvious that he would not dare to think one so simple minded as to consider anything else. And then it's funny because he kind of does a double take looking at Jordan, because that is exactly the point Jordan has been arguing against with Sam Harris. But beyond that, can you spot the supreme irony? Because the only way he can make his point about the superiority of testable truth that reveals itself in the laboratory is by using a metaphorically true but factually false, using his own structure to say it. So he has to say that this testable truth is top level truth. But you know, I looked at for hours on that top shelf and I couldn't find it. But the second one is better because he says that factual truth is the overarching truth which reaches sublime levels of irony and contradiction. Because, well, number one, obviously if you look over your head, you will not see this testable factual truth. And number two, if we even look at what that means, how an overarching truth is precisely a truth in which other truths are embedded. It's not just truth, but it's, you know, the truth of truth, let's say, or the structure in which other truths are contained. And then in his very statement, he embeds factual truth within the metaphorically true but factually false language of hierarchy, which is, you know, by using the language of up and allusions to heaven and transcendence, it is the very language of religion. But number three, which in my opinion is the most maddening because 99% of your life, of your decisions, of your constituting, your worldview, your representation of the world, you do not have access to those laboratory tested truth that you are so keen upon. In fact, we barely ever have access to those tests. What we have access to are the retelling of those tests and the results by other people. That is the overarching truth, even for scientists. It is not the tested experiments which almost no one has done themselves in order to know them, but rather it is our trust in a community of people to accurately represent the experiments that they have done. So it's really important to see this because there is this idea that faith or that trust is something which necessarily is a giving away of reason or giving away of empirical knowledge, whereas in truth it is the basis our existence. That is 99% of the decisions you make, 99% of the information that you believe is based on trust because you have not done the experiments yourself and you could not do the experiments yourself. You trust a community of scientists that they are being forthright with you and that they are representing the facts accurately. So this is not as simple as many of the new atheist types would have us believe."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":556.66,"end":598.75,"speaker":"Jonathan Pageau","text":"So this was the first video that I did trying to tackle some of what Brett was talking about in terms of metaphorical truth, which I find to be lacking in its profundity, let's say. I think that it fails to fully grasp the profundity of religious symbolism and also it fails to fully grasp to what extent metaphors or to what extent symbolic language is used even when we talk about how things fit in the hierarchy. So then after that I am going to play the full discussion and the relevant question of hierarchy and religion and science will come up as the last question in the discussion. So enjoy."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":600.03,"end":626.62,"speaker":"Moderator","text":"So I'm not really sure how to introduce this, but you all know what this is. So first question, any advice for public university administrators who do not have tenure, who have been asked to participate in equity and diversity conversations or committees, and who want to speak out against postmodernism, intersectionalism and authoritarianism, but are inhibited from doing so due to cultivated insecurity? Ilya Starr asks us that question."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":631.59,"end":638.15,"speaker":"Jordan Peterson","text":"Well, the first thing you want to make sure is that you know, you prepare yourself for that."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":638.23,"end":638.63,"speaker":"Bret Weinstein","text":"Right?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":639.75,"end":732.55,"speaker":"Jordan Peterson","text":"Because otherwise you'll get afraid. And so this is something to know for you younger people too. Like, you want to put yourself in a situation in your life where you have options when you have to make moral decisions. And so sometimes that means keeping your resume sharp and clean and making sure that if you needed to make a lateral move in your profession that you could probably do it because otherwise you end up enslaved to your insecurities, let's say. And you really want to think about that because you want to set yourself up in your life so that to the degree that it's possible, you can, you can say what your conscience demands that you say. For the administrators, I would say don't underestimate the number of people that agree with you. There's likely far more than who disagree with you, but they're just as worried as you are about speaking up. And they often don't hold the positions of power because they're off doing useful and important things instead of worrying about like imposing political politically correct idiocy on everyone else. But there's more people out there like you than you think. And you'll be giving voice to what's almost inevitably the silent minority. And then the last thing I would say is if you're going to oppose unconscious bias training, then you need to go online and familiarize yourself with the relevant literature to the degree that you can so that you know way more than the people that you're talking to. And then advance with caution and don't make unnecessary enemies. And that's, that's pretty much all I can say about that."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":734.31,"end":842.1,"speaker":"Bret Weinstein","text":"Yeah, I guess I would maybe add a couple things. I think Jordan is right that the it's not even necessarily silent support, but it's non public support is immense and things are a little different for an administrator. Administrators are in a position to serve their own interests as they betray their colleges. Professors are in a different spot. My feeling for professors in this situation is that if they serve their own interests by not speaking up in the short term, then they end up living under the regimes that get set up. And chances are, if you're feeling really uncomfortable about a policy initiative that is moving down the pike, eventually it's going to target you. So it isn't really a question of whether or not to stand up. It's a question of whether to stand up now or later. And now is almost certainly the better choice. There is also an issue, though, of organizing in a way that academics are not good at. Academics need to be able to gather when something is moving through a governance structure. You need to be able to gather with other reasonable people and plot a course. And the very best thing that you can do is figure out how to protect each other. One is almost never in a good position to defend themselves, but if you stand up and defend somebody else, you have a lot more leeway. So one of the things that serves these, these movements is the fact that people have to defend themselves and they're compromised in so doing. If people can agree to protect each other and stand up in numbers, they will be much harder to defeat. And so figure out how to gather privately and talk about what's actually taking place and, you know, amp up each other's courage."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":844.98,"end":887.65,"speaker":"Moderator","text":"I found YouTube presentations of Stephan Molyneux and others on our case selection theory and the tendencies of liberals and conservatives fascinating and troubling. As much explanatory value as there may be in looking at politics through the lens of the two survival reproductive strategies in nature, it could easily be twisted by lesser thinkers into justification for otherizing political opponents. In terms of predators and prey, Humans are not lions and rabbits. But our case selection theory may provide some understanding of how the cyclic rise and fall of civilization unfolds. How close to the truth is it that as common values like free speech unravel, genes and environment take over, polarizing groups into conflict? And how meaningful, how can meaningful common ground be created to avoid a catastrophe of unconscious social processes?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":889.41,"end":1031.93,"speaker":"Bret Weinstein","text":"I guess that's targeted at me. I have to say I have not seen Molyneux's videos on this, so I have no idea what the hypothesis that's being advanced is. I will say that people do not appreciate the extent to which we have not escaped our evolutionary nature. People tend to think that evolution is what created us, but that it is not an important factor in our current circumstance, and nothing could be farther from the truth. We do live under novel circumstances for which we are not evolutionarily prepared. But the toolkit that we bring to the table is thoroughly evolutionary, which means that our reactions to things have everything to do with a program that is not well understood by most people. Once you realize what it is that evolution has set us in motion to do, a good person will have no choice but to reject it. It's not an honorable program. It is no different than the program that drives a liver fluke or malaria or a spruce tree. The evolutionary program has an objective, and it is singular, and that is to produce more copies of the genome in question, having freed yourself from obligation to that program. Understanding what kinds of dynamics have allowed human populations to move from one opportunity to the next is vitally important, because if you look at our current situation, you will realize that we stand at a precipice. We have ancestral wisdom that has been generated by evolutionary processes, and it is completely inadequate to the problems that we face. We have to generate new wisdom, and that is something that many ancestors have also had to do. We have to resist, therefore, those tendencies that derail that process, those tendencies that make us unable to talk to each other candidly about what's going on so that we can access the toolkit that allows human populations to bootstrap a new mechanism for being. That is the place in history we are the only difference between this one and all of the predecessors that looked like it is. This time, we are all in it together. The way we have rigged civilization technologically means that our fates are now linked across the globe, and we have to put aside our differences if we're to survive another hundred years."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1034.65,"end":1132.16,"speaker":"Jordan Peterson","text":"I'd like to add something to that, probably a point on which we disagree slightly. I mean, I certainly don't disagree with Brett's supposition that we're driven by evolutionarily determined factors to a degree that people don't appreciate. I mean, we don't appreciate our own biology because it's so complex we can't understand it. So it's not. It's not that surprising. But I'm less pessimistic than, say, Richard Dawkins about the relationship between the genome and actually manifest behavior, because think about it this way, One of the things that men are adapted to is the existence of the male competency hierarchy. And I call it a competency hierarchy because I think dominance hierarchy is the wrong word, because it's been around for a very, very, very long period of time. Like, you can trace hierarchical structures governing animal behavior back about a third of a billion years. So it's older than trees. And what happens is that the males at the top of the competence hierarchy are much more likely to leave progeny, and the other men basically vote for them, because men in functional societies organize themselves into competence hierarchies. And so I actually think that men are driven, at least in part, by the desire to emulate the pattern of behavior that moves them up competence hierarchies, because that's what makes them attractive to females, and that's what increases the probability that they'll leave offspring. So I actually think that genetic structures and the moral structures act much more in accordance with one another than people like Dawkinson, apparently people like Brett assume so, you know, so that's what I have to say about that."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1133.36,"end":1177.63,"speaker":"Bret Weinstein","text":"Can I just respond a little bit? What I would say is I don't disagree with that formulation. I think that our cultural apparatus and our genomes are actually built to function together in a particular way and that we are built to solve these problems by various mechanisms. My concern is, is that the novelty of this moment in history due to technology and other factors is going to interrupt the processes that would normally solve this problem, that would allow us to bootstrap our way out of it. So my pessimism is not about the human capacity to do this or even the human instinct to do it. My pessimism is about the fact that the proper mode is not going to be triggered in time."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1181,"end":1192.68,"speaker":"Moderator","text":"What advice would you have to improve one's conscientiousness for people with attention deficit or similar disorders which directly interfere with this trait? Anything other than schedules? Routines?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1194.28,"end":1339.89,"speaker":"Jordan Peterson","text":"Anything other than scheduling? Well, yeah, there's something else. I mean, in order to focus your attention, you have to have your emotions aligned because otherwise it'll fragment and, you know, ADHD is a loose diagnosis. You might want to take an online personality test to find out if you have ADHD or if you're just really high in openness and extroversion and low in the other three traits. Because it's not a pathological condition. It's just a temperamental variation. Like, creative people tend to think laterally and they're somewhat scattered, and extroverted people are somewhat impulsive. So if you're extroverted and open and you're not very conscientious and you're not very agreeable, you're going to manifest yourself as somewhat attention deficit disordered. It's not necessarily a pathology. And the fact that ADHD medication works for you is no indication of the validity of the diagnosis. Because ADHD medication makes everyone concentrate more, it doesn't have a paradoxical calming effect on people with adhd. That's complete nonsense. So one of the things I would recommend, this is partly why we built the future authoring program, is make a bloody plan. And make sure the plan includes two things. Where you want to be in three to five years and how to get there, and where you do not want to be in three to five years. And you need to really think that through and make both of those things potential realities. And then your emotions will align with your goals and increase the probability that the unconscious mechanisms that direct your attention will stay on task and focused. And then the other thing I would say is learn to use a schedule, but don't treat it like a tyrant. That's the mistake people make with schedules. A schedule is not a tyrant. What you're using the schedule for is to design the days that you would like to have if your life was optimized. And so it's actually a friend. It's the discipline equals freedom thing that Jocko Willink talks about. You know, if you learn to manage your time, you actually have way more time, not less. You have way more freedom, not less. And it might take you two years to get good at using a schedule and following it. So specify your aims and your counter aims and organize your use of time and just practice that, you'll get better at it. You can discipline yourself. It takes a while, but you can learn to do it."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1342.22,"end":1413.75,"speaker":"Bret Weinstein","text":"I would add something to that as well, which is that I think we don't really understand what human emotions are for. We sort of treat them as an anomaly that are untrustworthy because they don't necessarily make sense in analytical terms. And really, that whole system of emotions that actually dominates most of our living experience is a system to program us to function better. So with respect to something like adhd, I have to agree. I'm not a huge fan of this diagnosis. It seems to me that it results from the fact that we're living under circumstances that cause some of us trouble, rather than the fact that we're actually broken in some way. But what that suggests is that the answer to the question of how to become more conscientious if you're not sufficiently conscientious, is to put yourself in circumstances where. Where conscientiousness is helpful to you. And if you do that, if you seek out those circumstances, then when you fail to be conscientious it will generate psychic pain. That psychic pain will cause you to de. Emphasize the patterns that got you into trouble. When you do it right, you'll feel pleasure. That will cause those systems to be elaborated and suddenly you'll be more conscientious."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1416.87,"end":1420.23,"speaker":"Moderator","text":"Do you believe we are experiencing a Christian renaissance?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1422.84,"end":1516.69,"speaker":"Jordan Peterson","text":"I have no idea. I mean, all I can account to is my own experience in this field. I know that for the past year I've been taking on this crazy journey that I didn't expect at all. And by now I'm getting emails every day. And the emails are basically the. There's a pattern. The emails are the same. And it's. I have a vague religious upbringing and became an atheist, Sam Harris style in college, discovered Jordan Peterson, realized religion isn't stupid, discovered your videos and thought, wow, okay. And now like, I want to go to church. And it's like, I don't know, I have no idea. Like, I don't know what numbers those represent. Like, I don't know how many people write me and how many people who are going through that don't write me. But for sure, as a person, I believe that to dive back, I mean that I staked my entire life on this. Being an icon carver and talking about the things that I've talked about tonight are completely related together. I believe that the underlying grammar that was developed in Christianity, especially In the first 1,000 years, the underlying relationships of symbols is like an algebra and it's like a mesh through which we can look at the world. And I think that to recover that to the extent that it's possible is one of the solutions out of our morass. And so I've staked my own."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1516.93,"end":1517.33,"speaker":"Bret Weinstein","text":"Yeah."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1517.33,"end":1518.09,"speaker":"Jordan Peterson","text":"My life on that."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1518.09,"end":1518.45,"speaker":"Jordan Peterson","text":"So."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1518.93,"end":1519.41,"speaker":"Bret Weinstein","text":"Yeah."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1520.37,"end":1638.19,"speaker":"Jordan Peterson","text":"Yeah. Well, I mean, it was a surprise to me when I learned, say 30 years ago that our cognitive architecture and our perceptual architecture were grounded in this grammar that Jonathan referred to and that there's no escaping from it. You can either understand it or not understand it. If you don't understand it, you live as a mess of internal contradictions. And that paralyzes you in many ways. You're a house divided within itself. These archetypal stories, let's say Christian or not, but certainly they're Christian insofar as the west is predicate. The west is a society predicated on those stories. They're inescapable and of ultimate value because they lay out the patterns. This is actually the point of them. They lay out the pattern of being that enables you to maintain Nobility and sanity in the face of suffering and evil. Now, if you don't believe in suffering or evil, then, well, you don't have a problem. But you're not very bright if you don't believe in those two things. I mean, you're just like. You're naive beyond belief. And you need an antidote to those forces because they'll tear you apart. And the question is, is there an antidote? And the answer is, well, there's a best path forward anyways. And the idea that the best path forward has something to do with shouldering your cross cross and taking responsibility for your own malevolence is. There isn't a better answer that anyone has ever come up with than that. So now are we experiencing a Christian Renaissance? I have the same feeling as Jonathan who. Who they. Who knows, like, more than a year ago."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1642.68,"end":1702.48,"speaker":"Bret Weinstein","text":"I should probably let you go on here. So I don't say what I'm about to say, which is going to get me in a lot of trouble, I have a feeling. But maybe we're going through a Christian renaissance, but we shouldn't. It's not a good idea. And that is not to say that there are not a tremendous number of values to be rescued from Christianity as there are from any ancient tradition that has survived into the present. However, I would say if there's one thing I'm convinced of as an evolutionary biologist who has been very focused on human beings, it is that there is no ideology that we can pull off the shelf that is adequate to our present circumstances. So whatever it is, it's gonna be a 3.0 or a 4.0 version. It's not gonna be the version that we have available to us now. And that is not to argue that the versions that we have now are not wisdom from a past era. They just simply aren't up to the challenge."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1708.16,"end":1744.68,"speaker":"Moderator","text":"You know, I gotta say, Dr. Weinstein, during your talk, you come to this event put on by libertarians, and you say both left and right libertarians are wrong. Then you get up on a stage with an orthodox iconographer and say, we should not experience the Christian Renaissance. And I kind of feel like you just want to get into a fight. All right, Thomas Lindner wants to know, are you familiar with Dharmak and Jalad at Tanagra? And. Oh, yeah. And if so, will we see Shaka when the Walls Fell? Universally, none of you? Oh, man."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1745.64,"end":1747.8,"speaker":"Jordan Peterson","text":"Okay, so enlighten us. Do you know about that?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1748.44,"end":1751.68,"speaker":"Moderator","text":"I do, but. So in Star Trek the Next Generation."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1751.76,"end":1753.04,"speaker":"Jordan Peterson","text":"Oh, yes. Okay."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1754.72,"end":1856.35,"speaker":"Moderator","text":"Patrick Stewart gets stranded on A planet with an alien who looks suspiciously human, which is weird how that works. And this alien can only speak in metaphors and stories. So he, for example, says Darmak and Jalad at Tanagra, which is like this famous battle where two guys come together to defeat evil. And he keeps trying to say this to Patrick Stewart and he doesn't know what the hell he's saying because. Yes. Oh, it's from the 90s, man. So essentially, he has to learn to communicate with a being, a species of beings that can only speak through story and metaphor and analogy based on their own history and their own myths and their own symbols. So Thomas Lindner rightly thought this would be an excellent question to ask. And I'm sure he's very disappointed that none of you watch Star Trek. I am as well. Moving on to Jordan Peterson. I wanted to ask you about psychopaths and mythology. Mythology is a conscious outgrowth of our underlying cognitive structure accumulated over history that teaches us how to live. People who score very high in psychopathy have measurable differences in brain structures linked to cognition and effect, leading to high charisma, no empathy or remorse, and lower impulse control. I was wondering how these differences influenced their sense of religion, mythology. And if so, could Marxism, Nazism and other pathological ideologies and religious sects represent an attempt by psychopaths to create their own mythology and erase the history and culture of empathic humans in brackets? I realized that psychopathy, pathology are on a continuum. This is asked by Michael Goodwill."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":1859.47,"end":2014.14,"speaker":"Jordan Peterson","text":"I don't think that we really understand the neurological differences between psychopaths and normal people very well. I know the literature pretty well, so it isn't obvious to me that psychopaths are qualitatively different. I don't think that we formulate the question properly. I think that the person who appears psychopathic is likely very low in agreeableness, which does increase the probability that you'll end up in prison, and very low in conscientiousness. And then the other traits vary. The charismatic type of psychopath generally would be also very high in extroversion. So I think it's a normal, although rare, temperamental variant. I also. I'm not convinced that there are people who are born psychopathic. I think it's a. I think there are children who are born who are very, very tough and aggressive and difficult to socialize and that some percentage of them become psychopathic. So I'm not convinced that it's genetically determined in its entirety. Having said that, I mean, there are very aggressive people who are deceitful, who use manipulation to move forward. The question is, what role do they play in the formulation of political movements or belief systems? Well, I don't think we know the answer to that. The only thing I could say is that the sort of person, and these might not necessarily be the psychopaths, the sort of person who wants mayhem, are going to gravitate towards extreme political. Those who profess extreme political beliefs because the probability that violence will erupt is higher. And there's certainly no shortage of people who would rather that violence erupted. That's actually one of the reasons that the current situation is so complex. You know, among the antifa types and among the radical right wingers, there are people who are praying for violence because that's actually their natural milieu. Or maybe they're resentful and hoping for destruction. But I'm not sure that you can draw a line in a simple manner between that and psychopathy per se. Psychopaths generally aren't group oriented. Right. They're more individual predator types. And maybe they can find a niche within an organization, but it's not exactly their normal hangout, I would say."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2017.66,"end":2039.92,"speaker":"Moderator","text":"4 Jonathan or Jordan or Brett. It's often said that to fight against evil only makes it stronger by adding fuel to the fire. But sometimes it seems imperative to openly engage in opposition to, or at least draw attention to a subject in order to dismantle it. How have you decided when to speak out against things versus simply being an advocate for the things you value and love?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2044,"end":2068.6,"speaker":"Jordan Peterson","text":"I have no idea. I think, I mean, like in my case it's just been circumstance where I felt like all of a sudden I was in a place where people were listening to me and so I said things. But I don't know when that should be for a person. Until now, I've never had any public Persona, and so I have not figured that out at all. Yet you've had a longer public Persona?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2070.12,"end":2338.97,"speaker":"Jordan Peterson","text":"Well, for me it was when I knew that the cost of not saying something was higher than the cost of saying something. Because one of the things I do in my clinical practice, and this is something that you can practice as a. As a habit of thought. What happens to people is that if they're in a routine, they discount the danger of the routine. Now often that's intelligence. Because if intelligent, because if you're in a routine and nothing terrible is happening, then it looks like the routine isn't very risky. So it's not surprising that you stop being afraid of those things that you've routinized but let's say you're bored to death in your job and you're thinking, well, should I take the risk of leaving my job? It's the wrong question. The right question is there's a risk in continuing with my job because I'm bored stiff and I'm getting resentful and I'm not working very effectively, and there's a risk associated with leaving my job. And which of those two risks would I rather take? That's a way better way of thinking about it. And so if you're deciding to speak out, you do the same thing. You think, well, okay, which. There's risk both ways. Which of these would I rather live with? And, you know, I was very sensitive or am very sensitive and maybe even very oversensitive to the risks associated with the suppression of free speech. Because, you know, I don't know for with certainty how large a social risk we're taking right now with the moves, especially on the radical left, to delimit people's ability to speak and think freely. Like maybe it's a tempest in a teapot. That's. That's certainly been an accusation that's been leveled at me, but for me personally, it was that it was very personal in some sense, which was that I regard the ability to choose my own words under every circumstance, I would say, as of crucial importance. And so when legislation was afoot in Canada to infringe upon that right, I thought that the risk of not saying something about it far outweighed the risk of saying something about it. And so I said something about it. But I don't think you can do that. You see, this is also why it's so useful to really deeply understand that in some sense that you're doomed and that life is suffering. You have to understand that. And you think, well, that's a horrible thing to understand. It's like, yeah, it's true, though. But so, like it or not, there it is. But there's an advantage to understanding it because it kind of frees you up, because then you know that sometimes you don't have a path that isn't without catastrophe, but you still can choose the paths. And that looks like bravery. Like, I don't really think it is. In some sense, maybe it is. It's just that for me, I picked the path that was going to cause me less grief as far as I was concerned. And so I also think that you speak out when to not speak out makes you resentful and bitter, unless you want to be resentful and bitter. And I wouldn't recommend that because it's one of the prime pathways to hell, so to speak. And so if you're resentful, it means one of two things. You should grow the hell up and shut up and get at it and be mature, because you're just whining, or you're actually being subjected to a certain form of tyranny. And unless you want to be a slave, you should stand up and say something about it. And so you also have to decide about that. You have to decide on the conditions under which you regard your life as worth living, and then you have to speak up for that. And Brett made a point earlier, which is exactly dead on. It's like, I also thought the same thing last year in September. It was like, well, I can either speak up now, when I can pick the time and place, I can pick the matter of engagement, I can pick the topic, or I can wait five years when this is way worse. I'm much more compromised, and the opportunity might not arise again. So that was an easy choice. It's like, if you're going to fight something that's growing, you might as well fight it when you're young, relatively speaking, and it's small. So those are all factors that you have to take into account."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2341.37,"end":2458.88,"speaker":"Bret Weinstein","text":"So I find the missing element in almost every discussion about human beings and what they're like and why is development, that we do not appreciate the importance of developmental environments, and we do not appreciate how long development goes on for human beings, I think, because human beings are so unusual in this regard. But the question of whether or not to speak up is in some sense not a question. If you've had certain developmental experiences, one of the crucial ones is that for some reason you have spoken up and you've lived to tell the tale. If you have that experience, then you know something that other people don't intuit, which is how you get from A to B and feel all right about it. I would also say something is not analytical about this choice. And I don't know whether this is true in general or not. I do know that people who end up speaking up and becoming well known about it become focused on this question, because in some sense, we are all interested in the question of how to get other people to stand up, too, so that society can move in a reasonable direction. But for me, the phrase that I think of is, it allows me to sleep at night. If I don't stand up, I mean, then I lie there in bed at night and wonder Why I didn't. And if I do, then even though things go haywire, I feel good. And the point is, it doesn't mean that I'm necessarily going to come out ahead, but it does mean that I'm okay with myself, that I don't have to be angry at myself for not saying what I know needed to be said. So, anyway, I'm sure that comes from early developmental experience, but it doesn't have to be early. You can try it out. Try it out on something where, you know, you can survive and see what happens and you'll develop the toolkit."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2459.76,"end":2516.33,"speaker":"Jordan Peterson","text":"Just maybe I want to add something because that made me think of what happened in terms of Jordan, is that I knew Jordan before the whole pronoun thing, and I had come to appreciate him. And I guess in my case, the thing that prompted me to speak out was that I saw someone that I could identify. It wasn't an abstract thing anymore because political correctness is just a very abstract concept that's floating up in the air. And I saw someone that I could identify that I knew who was being targeted. And so it was actually, how could I. Like, it was the easiest thing in the world then to say something because it was like, okay, it's happening now here. And I can imagine that. I mean, I didn't have. I'm not in a university setting, so I don't have that opportunity all the time. But it seems like in both your cases, it was also what was happening. It's like, it's happening now to my environment. I have to speak because it's my life. So, yeah. My last."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2519.53,"end":2544.09,"speaker":"Moderator","text":"Helen asks. In order for the concept of equality to work, it must stem from the idea that everybody on Earth has the same value, dignity, regardless of lineage, talents, beliefs, or status. How can we convince ourselves of our own worth and thus influence others to see their own worth as discovering one's dignity is an inside job. Easy question."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2546.73,"end":2634.68,"speaker":"Bret Weinstein","text":"Yeah. This, I think, is another one of these that has a little bit of a bitter pill to it, because I actually do function on the principle that all people are effectively equal, that there might be tiny little differences between populations and that one day we might ultimately know what they mean. This is certainly not true athletically, by the way. Different populations are good at different things because different habitats select for different things. But that's not true of the cognitive capacity and the moral capacity. Those things are effectively selected for universally. The bitter pill part is that effectively, we are all equal at birth. What happens to us after separates us out. And it seems to me that it is essential that we actually provide everybody with an environment that is enriching and allows them to develop full capacity and then they can sort themselves out based on how they decide to spend their time and effort. But I do think, at least as a working premise, imagining that all people, no matter where they're from, no matter what population they belong to, have equal capacity and given enriching environments, will attain the ability to do things that are very rarely seen, because most of our environments really aren't as enriching as they might be."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2635.89,"end":2720.57,"speaker":"Moderator","text":"So I don't know how, but this one's typed. So whoever did that, look at that. I'm from Montreal. Although I've been in Vancouver for more than two years now, I still follow the news over there from time to time. And I was wondering what were your thoughts on Bill 62, which the Quebec government calls an act to foster adherence to state religious neutrality and in particular to provide a framework for religious accommodation requests in certain bodies. So for those who are not familiar with it, here's what you need to know. Here's an excerpt of the bill. Personnel members of bodies in public services must exercise their functions with their face uncovered, unless they have to cover their face in particular because of their working conditions or because of occupational or task related requirements. Similarly, persons receiving services from such personnel members must have their face uncovered. So the fear here is that this bill only targets Muslim women who wear the niqab. This vision of a secular society is closer to what the French have in France and is often perceived as latent racism in the rest of Canada. Of course, the libertarian side of me doesn't want the government to tell anyone what they can or cannot wear. But at the same time, I recognize that the niqab is a symbol of oppression and it carries values that are contrary to those of our society. How do you reconcile the two? Is it okay to force freedom on people with laws that in a way restrict that same freedom?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2724.73,"end":2786.52,"speaker":"Jordan Peterson","text":"I can't answer that. Probably because I haven't thought about it enough. I mean, I can see like my gut tendency is that it's a bad idea. I would say, I think probably because it expands government power in a manner that is likely to be counterproductive in the medium to long term. That's how I feel about it. I understand why the French do it in France and why they're following that example in Quebec. You know, it's. And it's not obvious that everybody who's wearing the niqab is doing it by choice, but it isn't clear to me that the government attempt to restrict that is going to cause more good than harm. We'll see. Right. We have a chance to watch it unfold because it's happening in Quebec. It's an experiment of sorts. We can watch it unfold, we can gather some information. Time will tell, I suppose."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2790.76,"end":2791.2,"speaker":"Bret Weinstein","text":"Yeah."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2791.2,"end":2791.64,"speaker":"Jordan Peterson","text":"Wow."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2791.72,"end":2892.78,"speaker":"Jordan Peterson","text":"I guess I'm the Kibiqua. I don't have a solution for that question. I think that I do have a thought and I have a thought about what our societies are kind of based on. And I think that one of the, the idea of the face, of encountering someone's face, it's a very, very deep part of what our world is based on because it has to do with trust, has to do with this, this capacity to encounter people. And so the whole idea of a, of a democracy or a free society has to do with that capacity to encounter someone. And, and so I think that the Niqab like veiled, I don't like, I've never, I'll never mind like veiled people, but the first time that I encountered a woman in Niqab, it was very odd because my first reaction, it's not even thought out but like my intuitive reaction is that it's difficult to see that that's a person. And I know it is, obviously I know it's a person, but the grammar that we use like that Western society has used for ever to know that you are interacting with someone is not there. And so I can understand the difficulty with especially the face covering. I can understand the difficulty that society is trying to figure out, like how do we do this in a society that's based on trust, on automatic trust."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2892.78,"end":2893.14,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2893.14,"end":2935.23,"speaker":"Jordan Peterson","text":"That's how our society is based on automatic trust. The first reaction you have to someone when you meet them on the street is to trust them. And I've lived in places where that is absolutely not the case. And so for me it's a question. I don't necessarily think, like Jordan said, I think that I live in Quebec and I know how left leaning the Quebec government is and how it loves to really put its fingers down into people's private lives. And so I also have a tendency in myself to say back off, but I think as a bigger question in terms of our essential values, I think it's something that has to be played out. And like Jordan said, we'll see how it plays out."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2938.03,"end":2953.07,"speaker":"Moderator","text":"You have said, Dr. Peterson, that there is absolutely no connection between IQ and wisdom or being a good person. Has there ever been an effort by psychologists to quantitatively measure wisdom and if so, what is its relation to life, success, happiness, et cetera?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":2953.56,"end":3037.28,"speaker":"Jordan Peterson","text":"Yeah, no, we can't measure wisdom. The best we can do is measure the big five and iq. And after that it gets pretty sketchy from a personality or psychometric perspective. And my own sense is that people get more conscientious and more agreeable and more emotionally stable as they get older. And so that might be part of what constitutes wisdom. We've also been sort of investigating the hypothesis that part of wisdom might be, you know, imagine that you're an introvert, but that you learn the skills of an extrovert, so you sort of expand your toolkit of adaptation and that you're an unconscientious person, so you know how to relax, but you learn how to discipline yourself. You know, I think you can expand your bag of tricks and, and then match your behavior more specifically to the situational demands in an appropriate way. And that's something like wisdom. But we're a long way from being able to quantify it. And people have tried, you know, and they've tried to quantify well being. It's something that Sam Harris really is. He's an advocate of that approach. I'm extraordinarily skeptical about it. I think the psychometrics are dismal, but we're not wise enough to quantify wisdom."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3039.04,"end":3061.22,"speaker":"Bret Weinstein","text":"I'm really surprised I've heard you say this about the lack of relationship between intelligence and wisdom. And I'm not surprised that they aren't the same thing. But I am surprised to hear you say there's no relationship at all. I mean, it seems like at least very low intelligence probably results in the failure of wisdom to emerge. Is that not true in your experience?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3061.62,"end":3366.05,"speaker":"Jordan Peterson","text":"No, I wouldn't say that. I mean, I've seen some. I could tell you a story. All right, I'll tell you a story. So I had this client years ago, many, many years ago, who basically presented herself like a street person. She wore pretty dirty clothing and she was pretty unkempt, and she was unbelievably shy. Like she couldn't approach a person without going like this, like bowing down literally and going like this. It was like there was a light emanating from the people that she was approaching and she couldn't bear it. And she had come to this unit on a mental hospital grounds that I was working on, and nobody had actually really listened to her when she came into the unit. And I was assigned to teach her more pro social behavior because the way that she approached people was, well, obviously quite strange. And so people were reacting to her in a somewhat negative way. But I actually listened to her and I tried that for a while, but then I listened to her and it turned out that she had been in the hospital. And at that point the hospital had emptied itself of most of its residents. And the only people left in the hospital were people who were so ruined that you cannot even conceive of it. The hospital at that point was quite an old hospital, about the size of University that had tunnels underneath it connecting the building so that people didn't freeze to death in the cold Canadian winters. And many of the residents of the asylum were down there and they were. It was like walking through Dante's Inferno or a painting by Hieronymus Bosch or a collection of photographs by Diane Arbus. Like, it was seriously disturbing and strange. And those were the people left in the hospital. And she'd been an inpatient from time to time. But she. Well, I can tell you some more things about her. She wasn't very bright, she wasn't educated, she wasn't very attractive, she wasn't skilled in the world. And she lived at home and she had an alcoholic boyfriend who was schizophrenic and was always muddling her head with satanic delusions. And I think it was her aunt was dying at home. And like man on every dimension of life, quality and potential, she was in the low percentiles, you know. And when I listened to her, she told me a story about this dog she had. She used to take this dog out for a walk and she liked this dog and she was pretty good at taking care of it. And then she had this idea she'd been released from the hospital and was only an in was seeing an outpatient instead of an inpatient. And she'd actually come to the hospital to find an administrator who would listen to her because she had an idea and she couldn't really distinguish between the administrators and the psychologists. As far as she was concerned, they were all high status people, they were just all the same. And so we weren't really the right people to even be talking to. But she had conjured up this idea. And the idea was I could take this dog and I could go get one of those inpatients and I could take the inpatient for a walk at the same time that I walked my dog and that would be good for them. And I thought she just blew me away. It's like this woman, she just had. She had a rough Life man. Like it was rough. And despite the fact that it was rough and despite the fact that she was not an intelligent person in the psychometric sense and that she had virtually no advantages that were detectable, she was able to look outside herself and generate this act of kindness that really required her to go out of her way and pursue it to, you know, against insuperable odds in some sense, given how unbelievably shy she was. And that was one of the first times that I came to understand that if there was a relationship between intelligence and wisdom, there wasn't much of one. And the other thing I've noticed among my clients is that, well, among the people that I've dealt with is that it's very often that intelligence allows you to drive yourself crazy and unbelievably creative and and manipulative ways. Like it's quite common for psychologists to experience phenomena where the intelligent client who's having mental trouble is in much more trouble than the less intelligent client because, well, first they're arrogant and second, they can argue like mad for the validity of their pathology, let's say, even though they know perfectly well that it's destroying their life. And so I really do think they're, they're not self evidently related. So that's been my thought and experience. Anyway."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3369.01,"end":3404.69,"speaker":"Moderator","text":"As someone who is very soft spoken and nervous about speaking up, I have found myself falling into the position of tool of SJWs. I have taken the steps to leave. However, friends and people who I know are good, well meaning people are becoming, for lack of a better word, radicalized or encouraged to violence and bully tactics. How could I approach these people who still think I am a member of their group to at the very least reevaluate their positions or take steps to leave? Also, is it even my place to try to help them leave? To all, thanks."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3407.33,"end":3475.94,"speaker":"Bret Weinstein","text":"Here's the key. I think the SJW program is an unconscious automatic program. The alternative is a conscious program. So what you're up against is the fact that when people are on autopilot, they're hard to reach. The thing that causes the mind to become conscious, to invest in this expensive way of processing things rather than to continue on autopilot is error. That is to say, when you detect an error, it wakes you up. So I don't know how much hope there is. It really depends on the individual you're talking to. But the best hope you've got is to attempt to cause them to see contradictions in what they're saying when they detect that they are generating an error, they will have to wake up in order to reconcile them. As I mentioned in my talk, it's difficult because they've got this hermetically sealed set of beliefs that have an answer for everything. But if you can somehow detect a fissure in that thing and exploit it to get them to see that they are making a logical error, they will have to wake up to answer you. And then you can talk to them consciously."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3477.46,"end":3677.27,"speaker":"Jordan Peterson","text":"I would say prepare yourself to leave. And partly you do that by trying to think about what your life would be like if you don't leave. Because it's going to be hard to leave. But obviously you've decided that it's going to be hard or impossible to stay. So you're in one of those situations where you know you've got a choice between two poisons. Pick the healthier one. And then I would say if someone asks you why you're leaving, tell them, but don't tell them to convince them. Because if you tell them to convince them, you won't. You'll just raise these defenses that Brett referred to. You just tell them what motivated your decision. And you really have to be neutral and detached about it. And they might listen. If they don't listen, shut up. It took me a long time to learn the meaning of the biblical injunction to not cast pearls before swine. It's a very harsh injunction, and it's very apropos to this situation that you're in. If someone is not listening to what you say, when you're doing your best to delineate out a truth, then you violate the truth by continuing to delineate it. You're not where you think you are. Just back off, shut down, because they're not ready to hear the message. And Carl Rogers, for example, the great clinician, he thought that there were prerequisites to successful psychotherapy that the psychotherapist, him or herself, couldn't induce. And one of those was that the person who was seeking psychotherapeutic change had to be ready to change. You couldn't take someone who was ready to, wasn't ready to change, and use psychotherapy to get them ready to change. They had to already have encountered that error. That indicated to them that in some manner the jig was up and they needed to learn something. And if you're talking to someone who thinks that they have everything tied up and they've already got all the answers, then all you do is sully your. Your words by continuing to share them. It's Harsh, but that's how it is. Muster up your courage. Take the pathway that you think will be least harmful to you, and if you're questioned, say why. But don't try to convince anybody, because all it'll do is raise their defenses. Now, the fact of you leaving, that's actually a pretty strong argument. So you're doing, you've got your argument best formulated in terms of your actual action, and that could easily be sufficient. So the probability that some people who are doubtful will be curious and ask you is high. So you, then, you also want to have your story straight. You want to figure out what it is really, deeply, truly that tipped you in the direction of deciding that this was a bad idea. And then you can share that with them. And you share it as like a fallible person who isn't certain that this is the right thing to do, but that you're willing to risk it. And maybe the part of the other person that isn't completely possessed by the ideological slogan will be awake enough to listen, but that's really all you can do. So."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3679.99,"end":3685.67,"speaker":"Moderator","text":"How do counselors break through the victim mentality when clients find power in this identity?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3691.48,"end":3971.64,"speaker":"Jordan Peterson","text":"Well, first of all, they often don't find power in that identity. Like if they've come to therapy, for example, they know that something's up. What I usually do when people are adopting a victim stance is to explore, is to ask the person why it is that they construe the situation in that manner. You know, so first of all, it's very individual thing, right? So there's no cookie cutter answer. You want to find out. I mean, first of all, the person might have been victimized. There's a high probability. I mean, most people are victimized at some point in their life in some serious way. And so you got to let that unpack itself. And then, and then you got to ask the person, well, what do they want? Like, how do they view themselves in the future? And. And they have to kind of build an ideal that they're aiming for. And generally, if you let people think through the idea of the ideal that they're aiming for, like cringing victim is not what comes out. Like, they may have learned that that's the only card they have to play. But that's usually a fairly easy thing to fix because you can use assertiveness training techniques, you know, speaking in a low resolution manner, to help people learn how to stand up for themselves. And you do that, basically. And this is sort of relevant to the issue that everybody asked about to begin with is, like, how do you know when to stand up for yourself? I mean, one way of figuring that out is like, maybe you're not ready to take on a political battle. In fact, you're probably not. I would say, like, do that at your peril. But you might be willing to say one thing to someone who's pushing you a little bit too hard, you know, after thinking about it for a while, that would tilt that relationship away from the tyrant slave axis, you know, because you'll walk away. Brett said, well, sometimes you don't say something. Then you can't sleep at night. And when you're not sleeping, you're thinking about all the things you should have said, because that's what happens when you sleep like that, because you've sort of violated yourself, in a sense. And, you know, if you walk away from an exchange and you're feeling resentful and all these potential responses are going through your head, then you kind of. You sort through those responses and you think, well, is there one of those things that I could tone down a little bit and then actually say to this person? And usually you'll find something. So you sort of progress towards that kind of courage in increments, and that's fine. Like, the trajectory you're on is more important than the position you're in. And so if you want to take on the tyranny of the world, let's say you start by addressing a problem that's bothering you and making you feel resentful that you actually could take on. Like, maybe there's something you need to say to your brother, your sister, or your boss or an employee, you know, because they're taking advantage of you in some way that's making you resentful. And you think, well, what do I want? How would I rather have this be? And then, is there some small thing that I would be willing to do that would tap it in that direction? And you know that that almost always works. It certainly encourages you and emboldens you and, well, encourages you in the technical way, which is that it makes you more courageous. And so you start by. You start speaking up, let's say, or you start telling the truth partly by not lying. That's really helpful. But you also start telling the truth by taking small risks of a size that you can actually manage. And you develop the expertise in doing that. You know, you don't want to. Like, if you're going to be a good person, you don't walk down the street and pick up the first homeless person that you See, and take them home. It's like, that's not going to work. You just don't have the ability to do that. You are not in any position to manage that. It's going to be a catastrophe. And it's the same with taking on major ethical battles. It's like, well, start with some of the smaller ethical battles and you build up some muscles, you know, develop some expertise. And everyone knows you sit down and think to yourself for a bit. Everybody knows that there's someone to whom they should say something that they're not saying, you know, and then you want to say that with minimal necessary force, something like that. And you want to do it at the right time. And that'll. That'll make you a little taller in your own eyes. And that's a good thing. Maybe you'll even stand up a little straighter. That's a good thing. It'll put you on the right trajectory. And then at some point, you might be able to take on, like, a major battle without getting crushed by it. So."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3975.56,"end":3987.36,"speaker":"Moderator","text":"Given that intelligence and conscientiousness are the two biggest predictors of success in life, what advice do you have for someone in the 99th percentile in 1 and the 1st percentile in the other, asking for a friend?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":3988.56,"end":4063.35,"speaker":"Jordan Peterson","text":"Well, I would say look at your other traits. You know, first percentile in conscientiousness is pretty rough. First percentile in intelligence, you wouldn't be taking the test. So I'm assuming it's first percentile in conscientiousness. It's like, first, you're probably young. People get more conscientious as they get older. It's going to be a problem no matter what you do. So you got to learn to discipline yourself. It's very, very difficult. But, you know, you might be very high in trade openness, for example, which means that you're going to involve yourself in creative pursuits. And the interest that's generated by the creative pursuit might be sufficient to keep you on task while you're engaged in the creative act independently of whether or not you're conscientious. Like, there's many forms of motivation, right? And so most standup comedians aren't very conscientious. Like, that's not a lifestyle you can have if you're conscientious. Most rock musicians aren't very conscientious because, well, for the same reason, conscientious people can't tolerate that deviant routine. It just drives them crazy. So I would say look at your other traits and see if there are some strengths. But, you know, it might not be a bad idea to make a life plan and try to work on the discipline, because first percentile is, you know, it's going to cause you trouble."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4067.43,"end":4079.99,"speaker":"Moderator","text":"We have seen an increase in political polarization and identity politics, tribalism in modern political culture. My question is, what do you believe is causing this? And how can we go back from this?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4083.03,"end":4087.21,"speaker":"Bret Weinstein","text":"So I think this is a really interesting and important point."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4087.44,"end":4087.64,"speaker":"Jordan Peterson","text":"Point."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4087.64,"end":4153.63,"speaker":"Bret Weinstein","text":"And the issue is that we human beings are built for an oscillation between boom and bust circumstances. And in a boom, we experience what economists would call growth. And when things are growing, you can afford to be decent to other people. When you reach a point of austerity, what happens is tribalism breaks out. Because the way to deal with what is effectively an addiction to growth that we have when the growth runs out is to generate pseudo growth by figuring out who can't defend what they have and going after it. And this is the thing that has caused the worst atrocities in history. And the task for us is to realize that the increase in polarization and tribalism at the moment is actually something we should expect. It happens at this point in history. And the trick for us is to figure out how to break this boom and bust oscillation so that we are not repeatedly exposed to these extremely dangerous outbreaks of tribalism."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4157.23,"end":4184.78,"speaker":"Jordan Peterson","text":"Well, I don't know. I think I agree. But there's another move in history and a move. And there is a move in history which is that when certain civilizations become actually quite wealthy and quite content, they tend to fragment because they have everything they need. We saw that in the late Roman Empire. And it's as if."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4186.86,"end":4187.74,"speaker":"Jonathan Pageau","text":"They lose the."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4187.74,"end":4223.83,"speaker":"Jordan Peterson","text":"Capacity for their own cohesion. And when that happens, those who are tribal can come in and ram through that, like, kind of weakened civilization and just like. And sort of bust through it. And so to me, I get the sense that the increased polarization in our society is. It's not just polarization. I think there's also just a basic fragmentation. And that fragmentation is almost physically real. It's physical even in the manner in."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4223.83,"end":4224.51,"speaker":"Jonathan Pageau","text":"Which we develop."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4226.35,"end":4227.87,"speaker":"Jonathan Pageau","text":"The layout of houses."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4227.87,"end":4248.11,"speaker":"Jordan Peterson","text":"And the layout of suburban neighborhoods where we don't. Like, I've been in my neighborhood for 15 years and I barely know my neighbors. And I think most people in North America have that same experience. It's like. So we are like the tissue, the mesh that's."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4248.56,"end":4250.68,"speaker":"Jonathan Pageau","text":"That created whatever it is that we."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4250.68,"end":4281.8,"speaker":"Jordan Peterson","text":"Are like, whatever civilization, whatever is fragmenting. And so I think that that's one of the things that is causing the chaos, at least. And the problem is that those. Some people who see that fragmenting, they're afraid, and then they want to pull back and say, okay, we need to get something really straight, something really hard. And then they tend to go towards tribalism. You know, it's like, it's."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4284.12,"end":4285.56,"speaker":"Jonathan Pageau","text":"Beyond, like, the economic."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4285.64,"end":4313.97,"speaker":"Jordan Peterson","text":"I mean, I think that the economic thing can kind of unleash it. But if you look at Weimar Germany and you look at where we are now, the social tendencies, and like the kind of underlying feeling that things are falling apart were there too, and then an economic disaster created, that crazy kind of. So I think there's quite a few level of things happening at the same time."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4317.25,"end":4478.19,"speaker":"Jordan Peterson","text":"I think we don't exactly know what's causing the polarization. I think that you could attribute it to some degree to rising levels of inequality. That might be particularly true in the US but the polarization is also occurring in Europe, and it's also occurring to a lesser degree in Canada. So I think it's something. Inequality is no trivial thing, and it has profound effects. But I think there's other things going on as well. We don't know the role that social media plays. I do think that it's working as an amplifier. You now hear about every idiot thing the left, radical left does instantly, and you hear every idiot thing the radical right does too. And I think it radically distorts your perception of how unstable the world is. Like, you know, one of the things that was really interesting over the last two or three decades is that crime took a nosedive in a major way at exactly the same time that the incidence of crime reporting in the news climbed to new heights. And so people are convinced, were convinced well, even now, that things are far more dangerous than they've ever been, ever. And that's not true. Like, general civil society is safer than it's been since 1962. And in 1962, it was basically safer than it's ever been ever in the history of the world. And so the media that we're. The information matrix that we're looking at the world through isn't giving us an accurate sample of what's out there. And I think that that, and I can see this to some degree when I'm looking at Twitter, is that I get a feed of outrageous things that are happening on campus. It's like, God, there's hundreds of colleges and universities, and at any given time, the probability that someone is doing something that's stupid in a newsworthy fashion is like 100%, and in any reasonable society, basically I'd never know about it. And so then I'd have to sample the environment that's right around me, which actually turns out to be pretty damn stable. Like at the University of Toronto, the proportion of people who are committed antifa type radicals is like none. It's one in a thousand, maybe, or maybe it's one in 500. But we're looking at the world through this mediated perceptual structure, and it isn't clear that it's giving us unbiased information. So."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4482.43,"end":4489.55,"speaker":"Moderator","text":"Please tell us how we can tell the difference between misguided SJW types versus the people with evil intent."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4493.55,"end":4557.45,"speaker":"Bret Weinstein","text":"Yeah, that's an interesting question. I will say empirically, I don't think it's all that difficult. I think they sound very different. And I think maybe the approach is to ask questions. If you ask questions of a misguided person who's going along with something based on the label on the box rather than the contents of the box, then they will tend to say more reasonable things about why it is that they are doing what they are doing. If you question it, in other words, they will defend some version of Equity that's actually recognizable as a type of equality rather than some undefinable booby trap that's been set for you. In general, the hardcore bad actors are pretty few and far between. And unfortunately, it doesn't take very many of them to set something like this in motion. But for the most part, the movement is composed of people who are misguided at one level or another, and people who are cynical are small in number, but important in effect."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4561.13,"end":4702.91,"speaker":"Jordan Peterson","text":"I think that one of the ways you can tell is that you can actually have a conversation with someone who's misguided. Let's say if you, you know, if you start the conversation properly, you can ask them questions and they'll engage and, you know, with a bit of care, you can actually start to talk. But someone who's malevolent, it's like you can just forget about that. That's not getting off the ground because that just undermines the game that they're playing. And so if, if, despite your genuine goodwill, you can't find the human being underneath the ideology, then it's best to back away. And, you know, in the McMasters, some of you have seen the video at McMaster University, where I was completely shouted down, essentially with air horns and chants and all of that. Most of those people in there, they're just dopey Kids fundamentally, you know, and. And they're idiot professors had used them as avatars for their pathetic ideology. And, you know, I think, well, they're 19 years old. What the hell do they know? If you met them in. In a pub, like, 20 minutes later, they'd be chirping away in a perfectly reasonable manner like your neighbor's kid, you know, but not everyone in the crowd was like that, you know, and it's. The feminist men are the ones I really worry about often, especially the bigger guys, because I'm not sure what game they're playing, but I've seen a couple of the same suspects at a number of different protests, and I can tell they've got blank eyes and they're just looking for trouble. Like, they're. They're people I would avoid on the street. I can. I can see them. And there's no having a. There's no having a conversation with those people. Like, in fact, the mere fact that you would like to have a conversation with them is enough to demonstrate that you're their enemy because they don't want to be moved away from their. Their manipulative grip on a route to power. It's something like that. So."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4707.23,"end":4719.74,"speaker":"Moderator","text":"So Dr. Weinstein, you came here looking for a fight. Mr. Pageau made a response video to. Oh, yeah. To something you said in the. On the Joe Rogan experience. Do you have anything to say?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4720.06,"end":4769.4,"speaker":"Bret Weinstein","text":"I'm glad you're asking that. I was hoping it would come up. So I don't know how many people have seen the video and what it's responding to, but the short version is that I said something on the Joe Rogan podcast about there being different kinds of truth that I argued for something I call metaphorical truth. That something can be literally false, but it can contain wisdom. And the way you know is that if you act as if it were true, you come out ahead of where you would. If you act according to the fact that it's false. And I then said that scientific truth is the top truth in the hierarchy. And the response was that it was arrogant of me to say that there was a top truth that you know effectively. From what position do I do that? And, yeah, I can. You want to. Go ahead."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4769.64,"end":4771.64,"speaker":"Jonathan Pageau","text":"I just want to say that's not the argument."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4771.96,"end":4773.44,"speaker":"Jonathan Pageau","text":"The argument is that there was a."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4773.44,"end":4809.02,"speaker":"Jordan Peterson","text":"Performative contradiction in your. In your statement because you taught. You said that factual truth is higher than metaphorical truth. But then to say that there's a top level truth or that there's an overarching truth is to Use a metaphorical structure to demonstrate where you're placing your truth. And so within the statement there was a performative contradiction in terms of you have to resort to metaphorical truth to speak of hierarchy, because all the language of hierarchy is metaphorical. And therefore to place factual truth at the top of that hierarchy is a performative contradiction. So that's my argument."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4809.18,"end":4934.25,"speaker":"Bret Weinstein","text":"So I will plead guilty to using metaphor to defend my position, because of course language is composed of metaphors, both living and dead, and it's really hard to communicate anything without running afoul of that standard. But I will defend, in spite of that guilt, I will defend the idea that scientific truth is the topic truth in the hierarchy. And the reason is really simple. It's because there is no mechanism for sorting between metaphorical truths that belong to different traditions and are in conflict with each other. So in other words, if we take two like behave well when you die, you go to heaven. That's cool. You should do that. On the other hand, if you behave well in a Brahman Atman system, you may be reincarnated as something better than you are now. That's also cool. But it's not the same truth, right? So you can't sort out these are both kinds of wisdom. And I think we know exactly what kind of wisdom they are, at least we should, which is, if you behave so as to be reincarnated as something better or to go to heaven, what it will do is in all probability it will leave your descendants really well positioned in their culture. And that means that your genes, which you might not have been in a position to say anything about, will be well positioned to persist and spread because your descendants will be well placed. So in effect, going to heaven or being reincarnated as something better than you were are stand ins for a genetic truth that we can't say. And so what I'm arguing is that what makes the scientific truth hierarchically superior is that it explains all the subordinate truths in a way that is logically consistent. Whereas if you were to prioritize the heaven as a truth, then you would have to say, well, reincarnation is therefore false, or you would have to have them all simultaneously be true in some unreconcilable way. So the only one that has the special characteristic of accounting for all the others is the scientific truth."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4934.57,"end":4974.86,"speaker":"Jordan Peterson","text":"Okay, so I'm going to get into this now. So I think that what you just did was nested your claim for the validity of scientific truth within a pragmatic framework, which is what I claimed when I was talking to Sam Harris was necessary because you said, I believe that the justification for assuming the truth of the mythological representation was its effect on something that's associated with the Darwinian process. Right. And that's what you used to justify your claim that it was in fact true."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":4976.46,"end":5016.99,"speaker":"Bret Weinstein","text":"So in the discussion that you're referencing, my point. So my point was essentially that there is something called metaphorical truth and that it's a real thing. So I was. I'm in agreement with you on that. Where we might be in disagreement is that there is simultaneously a thing that I would call literal truth or scientific truth. And by the way, I'm not saying that what scientists say is in this category inherently scientists can be wrong. But the point is, truth that is scientifically verifiable, that makes predictions, has a special priority in this hierarchy because it is the one objective version. It is not contingent on being nested in a series of beliefs."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5017.39,"end":5020.99,"speaker":"Jordan Peterson","text":"So what if it's a scientific truth that's metaphorically wrong?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5021.79,"end":5023.43,"speaker":"Bret Weinstein","text":"Oh, and there are, like."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5023.43,"end":5080.45,"speaker":"Jordan Peterson","text":"I can give you an example. Okay, so I read this. The memoirs of a KGB scientist, KGB agent who worked with the Russians in this biochemical lab. And their job was to meld Ebola with smallpox, because smallpox is. Ebola is not that contagious. And so that's kind of annoying if you're trying to kill people, whereas smallpox. But it's really fatal, whereas smallpox is really contagious. So if you could get the two together and then develop an aerosol spray, you could kill a lot of people. In fact, they did kill about 500 Russians by mistake when some of what they were doing escaped. But it isn't obvious to me that that's an invalid scientific pursuit. But I do think that it's an invalid ethical pursuit. And so that seems to me to indicate that the ethical pursuit supersedes the scientific pursuit with regards to truth claim."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5081.17,"end":5098.13,"speaker":"Bret Weinstein","text":"So I'm going to disagree with you. I would say it doesn't supersede with respect to the truth claim. It supersedes with respect to considerations of behavior and policy. So I absolutely agree with you. There are plenty of scientific truths that are deeply unfortunate."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5099.01,"end":5119.93,"speaker":"Jordan Peterson","text":"I want to take what you said. The first thing that you said, okay, if you are good, you die and you go to heaven. If you're good, you die and you're reincarnated as a higher being. Those two things are the same, okay, in terms of their effect, there are restating of the hierarchy, the hierarchy."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5120.57,"end":5123.25,"speaker":"Jonathan Pageau","text":"Religion is all about the hierarchy."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5123.25,"end":5126.65,"speaker":"Jordan Peterson","text":"That's what religion is about the restating."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5126.73,"end":5128.73,"speaker":"Jonathan Pageau","text":"Of the hierarchy in those two terms."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5129.29,"end":5140.57,"speaker":"Jordan Peterson","text":"Have the same effect in terms of what we're saying is that if you're good, you will not meld those two things together."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5141.05,"end":5147.41,"speaker":"Jonathan Pageau","text":"And that is the hierarchy. The hierarchy itself is the capacity to."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5147.41,"end":5154.09,"speaker":"Jordan Peterson","text":"Be above quantitative, purely quantitative considerations and."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5154.09,"end":5156.29,"speaker":"Jonathan Pageau","text":"To apply qualitative thinking."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5156.29,"end":5168.86,"speaker":"Jordan Peterson","text":"And the whole language of hierarchy is all a language about a movement from quantity up to quality. Like it's movement, it's going up a mountain, it's going up the base and."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5168.86,"end":5173.18,"speaker":"Jonathan Pageau","text":"Then going up to unity. And when you stand in that top."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5173.66,"end":5181.5,"speaker":"Jordan Peterson","text":"Place, then you can look down and you can judge what facts, because there."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5181.5,"end":5183.9,"speaker":"Jonathan Pageau","text":"Is innumerable amounts of facts."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5183.9,"end":5192.97,"speaker":"Jordan Peterson","text":"There's an infinite quantity of facts. You can decide which facts are worth pursuing. And so that's what religion is, and."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5192.97,"end":5196.09,"speaker":"Jonathan Pageau","text":"That'S what the hierarchy is. So if you take, if you take."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5196.09,"end":5207.49,"speaker":"Jordan Peterson","text":"Qualitative, if you take a quantitative tidbit of information and you say that is above, let's say, qualitative judgment, how do."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5207.49,"end":5209.97,"speaker":"Jonathan Pageau","text":"You even, why, why are you even."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5209.97,"end":5215.13,"speaker":"Jordan Peterson","text":"Focusing on that quantitative data? Because there's, there's an infinite amount of them."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5215.62,"end":5217.62,"speaker":"Jonathan Pageau","text":"So you have to have a manner."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5217.62,"end":5220.46,"speaker":"Jordan Peterson","text":"By which you focus on something, and."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5220.46,"end":5222.14,"speaker":"Jonathan Pageau","text":"That is the hierarchy, and that is."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5222.14,"end":5224.9,"speaker":"Jordan Peterson","text":"The whole language of the religious hierarchy."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5225.78,"end":5264.87,"speaker":"Bret Weinstein","text":"So what do you do where religious traditions and what I'm calling metaphorical truths conflict? So let's say mating systems. I would argue that monogamy is a superior mating system because it does not sideline any significant population of males. If you sideline a significant population of males by having what biologists would call a polygynous system, or people would generally call a polygamous system, if you do that, then you have sexually frustrated males who are left over and inevitably become something like a marauding horde or an army or something immoral like that."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5265.11,"end":5301.28,"speaker":"Jordan Peterson","text":"Now, wait, wait. Now you're assuming that's bad. And so you're falling into Jonathan's trap because you're saying, you see, you have this a priori framework that monogamy is better because you've already decided what constitutes bad. You can't help but lay a moral framework over your selection of facts. And so that, I mean, I'm not trying to trap you. I know this is a crazily complicated problem. But the idea that, the fundamental idea is that you can't select the damn facts and order them, which you have to do. You have to do it without applying an a priori moral framework, Right?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5301.44,"end":5358.37,"speaker":"Bret Weinstein","text":"So I would say I am applying an a priori moral framework. I am not treating this as. I mean, you know, we could also look at the behavior of people as a physical process. It's equally a physical process as it is a moral, behavioral process. I'm not doing that. I'm being a human being. And I'm saying from the point of view of values that probably everybody in this room would share, it is not desirable to have sexually frustrated young men roving around, being violent because they can't find a mate, because some other highly placed males in the society have many mates. That's not a good thing. That's not me speaking factually. That's me speaking morally. But my point is not that that's what should come out of this conversation. My point is different religions that contain metaphorical truths differ over what a viable reproductive strategy is. In other words, Christianity prioritizes monogamy. Modern Judaism does too, but the Torah does not."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5359.33,"end":5391.98,"speaker":"Jordan Peterson","text":"So, okay, so, so how. Okay, so your claim is that because it's very difficult to adjudicate between competing moral systems that science is preferable with regards to truth claims because there's a way of adjudicating between scientific truths. But I would say the mere fact that it's difficult to adjudicate between competing moral claims doesn't indicate, therefore, that science is a higher truth. It just indicates that science has an advantage when it comes to comparison, that ethical systems don't. It doesn't mean that ethical systems are perfect."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5392.14,"end":5443.79,"speaker":"Bret Weinstein","text":"No, no. So this is one of these places where I don't exactly know what I'm running afoul of and why. I think my brain is built around some sort of model that makes it hard for me to understand why we could possibly be disagreeing over this. My point is you have a thousand different belief systems. They're all built out of metaphorical truths and a certain amount of real truth. Let's just stick science in with the rest of them. It's belief system 1001. Okay, now let's say, well, which of these is best? How are you even going to do that? There's only one of them that has a distinct characteristic. It's number 1001. What's its distinct characteristic? It explains why all the others work. So how is it not just by virtue of the fact that it does something that nothing else can? How is it not the top one in the hierarchy?"}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5448.75,"end":5450.99,"speaker":"Moderator","text":"We have run a little bit past eight."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5451.39,"end":5453.47,"speaker":"Bret Weinstein","text":"Would stop it now."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5454.83,"end":5464.4,"speaker":"Moderator","text":"Would. Would y' all wanna. Would y' all be interested in getting together for an organized debate, like a little tag Team Peterson, Pageau versus Weinstein Harris."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5464.4,"end":5465.36,"speaker":"Jordan Peterson","text":"Oh, my goodness."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5466.72,"end":5467.12,"speaker":"Bret Weinstein","text":"Sure."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5467.44,"end":5471.44,"speaker":"Moderator","text":"Okay. Well, that's a good place to end, so."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5473.92,"end":5480.9,"speaker":"Bret Weinstein","text":"Oh."}
{"episode_id":"SW - #020 - 2018-10-23 - Peterson, Weinstein and Pageau Panel Discussion","start":5485.29,"end":5541.08,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
