{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":0.56,"end":1656.24,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am in Salem, South Carolina. As you can see, it's nice and warm here. I am going to be giving an icon carving class this week, and for the beginning of this session, there's an icon carving class and an Ikon painting class as well, given by someone else. I was asked to give the opening talk, and I decided to do it on the, let's say, radical solution that making Christian, and especially liturgical art offers to our culture. This is Jonathan Peugeot. Welcome to the symbolic world. I was asked to give a definition of an icon. And so an icon is a sacred image. So the word icon is complicated because the word icon just means image. And so it's not. It's a shorthand, right? When we use the word icon, what we mean is sacred image. So we don't say sacred, but that's what we're talking about. So that's what makes the icon particular. It's because it is an image which not only depicts sacred things, holy people, but also is sacred in the sense that it participates in the life of the Church. It participates in the life of the liturgy as well. And so it is. Another word we could use is something like liturgical image. That's another way that we could talk about it. And so, because of. Because of what it is, because it is a sacred image, it has certain characteristics which grew up in the Church, in the tradition of the Church, to help identify the images, to help differentiate them from secular images, and to help us understand what it is that's going on inside the image. And so, in terms of the actual canons, you could say, in terms of what the Church has decided in, it is required for something to be considered a sacred image. You need to have an image of a person, a holy person, and you need to have the name of the person, which is written on the image. And that is actually in the seventh Ecumenical Council, the basic strict minimum of what it takes for us to recognize that this, okay, so this image is something. It's the image of a saint, it's the image of Christ, it's the image of the Mother of God. And. And we put the name there so that there's no mistake, we know who it is we're interacting with. And that image is there to help us participate in the liturgy, participate in the sense to interact with the person that is being represented. And I think that that's going to slowly kind of bring me to what it is that I mostly wanted to talk to you about. As I'm talking, I'll give a little bit of Characteristics of the icon. But what I mostly want to bring people to think about right now is the particular moment that we are in, in terms of culture, in terms of Western culture, Christian post Christian culture. We're at a point in our history where we have. We're very cultural. We have a lot of cultural events. All the cities, they'll organize different cultural events. And what's interesting, if you pay attention to what we now call culture today, what is it like going to a concert, going to the theater, watching a movie, all of these things. What describes them is that they are entertainment. That we have come to a point in our own story where we have reduced what we call culture to entertainment, to something which you sit passively and you look at, you watch a movie, or you listen to music, and you passively encounter something. And what's interesting about the icon, and it's not the only thing that's interesting, but what's fascinating, if you think about it in the context of our social moment right now, is that it's actually a way into a more profound and authentic way to engage with what we call culture, that is the images. If you think of how modern art developed, you know, from, let's say, especially from the time of the Romantics up to today, we really have this idea. And you'll meet artists today, you know, find artists who. What do they want? What is their hope? That they hope that their art can be shown in a gallery and that they can maybe have a nice catalog published with their images in them, and that people with a lot of money will collect their art, put them in their collections, so that then when they get shown in museums, then they could have, you know, where the provenance is in this famous collection. So we have a series of cultural artifacts. We have artists, galleries, museums, right? And all of these are there for you to go and look at art or buy art and collect it. Okay, now, this is where you can see the difference between the icon. But the icon is going to be, in this particular example, a window into an ancient world which is now gone, which has slightly not completely gone, but it's. It's slowly fading away. When you're making an icon, you are not making the icon to go into a gallery. There are a few artists, sadly, there are a few iconographers who wish that's how it was. But usually when we make an icon, why are we making the icon? Usually two reasons. I mean, very practical reasons. I mean, practical reasons, usually it's because you're practicing or because you've been commissioned Those are the two reasons why you make an icon. Like, either you're trying to get better and make better icons, so you're learning, you're improving your. Your craft. Or someone asked you and said, I need an icon of Saint Dimitri. I need an icon of Christ, of this feast, of this. And that's when you make an icon. I don't. I make a very few icons. Once in a while, I'll make icons just like that. But most of the time, if I make an icon, I'm making an icon for someone. That's a huge. It's a huge difference. It's a huge difference. If you think about the artist in their studio who's expressing themselves and then hopes to show their work in a gallery and hopes that their work will become famous. I am creating something for someone's particular need. That is, it's like making a chair, right? Like, I'm making something for someone. But it's bigger than that. The particular transaction is that someone writes me, calls me, talks to me, and says, my nephew is being baptized, and I would like to offer an icon of this saint, something like that. And so there's a story there. It's a human story. There's a human story of someone who has a need, a church that has a need, someone who wants to celebrate something. And so I am engaging them in that story. But then at the bigger level, what I'm also doing is I'm participating in a communal act and participating in a communal language. That is the language of the icon. As you'll see, those who are painting, those who are carving. You'll see it's a very specific language. And it's specific for spiritual reasons, for theological reasons. But there's also another reason why it's specific. It's specific because it is a communal language, just like any. Just like English is it just like the spoken languages are communal languages. That is, when I'm saying something to James, I want him to understand what I'm saying. I'm trying to communicate something. I want to engage with him. And when we make an icon, we are entering it into a community, into a church, into a whole history and a whole community of people that recognize these images. There are other traditional arts and other cultures that have that. Of course, you know, you think of. You think of. Now I'm not good. Like, musical instrument making. Making musical instruments is a great example of that, where you are making a musical instrument for someone, let's say, very high quality. So it has to be beautiful. It has to, you know, you really want it to be the best, but it also has to do what. It has to play music and it has to sound right. So that person can then play music with his band. And so that's the same thing. It's very similar to when we make an icon. We're making an object within a language, within a community, for a community. And we're also. So we're participating in this whole. Also this whole strand of history. We're connecting ourselves to a community, but to the past. All this is a connected language. So now contrast that with the state of secular art where we are today. Now, they don't succeed in doing it, but usually a lot of the famous artists today, the way that they get attention is by shocking. By doing something that no one has seen before. You know, is it innovative? Like, is it. Innovation has somehow become a core value of culture for some reason. The idea that you should do something that no one has seen before and why. So they're appealing to something very different, something very, very different. This desire to titillate, right? This desire to surprise, to shock, to provoke a disjunction in culture. And if you look at modern art from. Especially from the 20th century, now you look at the modern artists, their particular goal was to create constant disjunctions, to. To break what was there before. So the cubists tried to break the classicists. And then, you know, the surrealists came and said, all these formalists. No, we're going to break that with this kind of broken. This exploded imagination. The Dada came in and they said, we're going to break the whole thing. We're going to smash the entire system. And that's our. That's the background of the way that we think about culture today. If you watch a movie that gets great reviews, usually they'll say, oh, this is new. This has some kind of. There's something you've never seen before. It's innovative and everything. Now, there's nothing wrong with innovation. It's very dangerous. As I'm going down this road, I'm thinking he's saying you can't innovate. No, there's nothing wrong with innovating, but the question is always. When you're making icons, you always have to think, firstly, that you want to integrate this image into US community. So it's not that there's something wrong with innovating, but the question is, why would you innovate? You have to have a reason. There has to be something which would make you change what you're doing. Because if I'm trying to communicate something to you. I'm trying to engage you. You know, if I'm trying to find out how your day went, I'm not going to make up a new word. That would be stupid. Because, I mean. And there's nothing wrong with making up new words if there's a reason to. But unless there's a reason to. What you want to do, you want to focus on the purpose. The purpose of what you're communicating, the purpose of what you're doing. And that's what you find in iconography. So once you realize that there's actually something, there's a strange little moment now also in culture is that we've kind of, you know, I said that most of our culture is, say it's entertainment and passive, but there's actually quite a lot of the passive culture, which is trying to be transformed into active participation. So there's some. I'll give you an example. This is the most. One of the funniest examples. There's something in the United States. It's a pretty large organization. It's called Harry Potter and the Sacred Text. And what it is is basically a church. So people will meet every week and they'll have readings, group readings of Harry Potter books. So they'll sit together, then they'll have a group reading of a Harry Potter book, and then they'll have a discussion about it. I don't know. I've never been to one of those events. I can just. What? Sorry, is this really real? This is really real. You can look it up. Harry Potter and the Sacred Text. Okay. But it's only one example of several other things like that. Like, you have something called, you probably have heard of cosplay, where people will dress up as their favorite comic book movie characters, and then they'll go to these events and they'll be costume and they'll, like, celebrate their favorite fiction characters together in these almost liturgical events. Okay, now what you're seeing. What you're seeing is we're seeing the end. We're seeing the. The end of the passive entertainment culture. We're not that totally the end, but we're seeing it start to fray in these types of movements where people. It's as if they're. They're lacking something. They want participative culture because that's what ancient culture used to be. Like. Think about, you know, a village 200 years ago, 300 years ago. What was culture? Culture was, you know, Mardi Gras and Lent, and then we had the Feast of This saint and the feast of that saint. And then we would have processions and we had folk dancing. All of these were participative. There was. We didn't have this idea that culture was just sitting there and watching someone else perform something. Not that it was excluded, but that wasn't the core of culture. Yeah. Do you think that's why social media is so popular, because they feel like they're participating? Yeah. Now, social media is an interesting. Is a very interesting thing in terms of community, is that social media is a parody of community. Because what we've had in, let's say, the past hundred years, we've developed this idea of the celebrity. The celebrity has replaced the saint. We're not idiots. It's pretty obvious. We call them stars, we call them icons. We use all the words that we would use to describe some saints. They replace them. And so. But it's an invert, obviously, an inverted form of sainthood, where it's whoever can titillate or shock or surprise or attract that kind of carnal attention, you could say, is the one who wins the game. But now there is this desire to participate, but it's in the image of that strange inverted thing. So social media, if you think of Facebook, the way it works, or Twitter, same thing. We have the sense that it's somehow a form of community, but it's not really what it is. It's basically people who are showing themselves and then other people who can watch. Right? So it's many, many stars. So it's basically exposing yourself and voyeurism. So you can look at some. You can go on someone's Facebook page. You'll never know. Right. They'll never know that you're looking at them unless you write a comment. But it's like, so. So. So I'm going to show pictures of myself. Some people can look at them. And so it's like it's a mini form of this stardom that we have, like a little mini form of it. And it's. It's a parody of. It's a parody of community. Now I'm on social media. Like, I'm not. Not saying you shouldn't be on social media. I'm on social media. It's useful and everything, but I think it's important to understand the moment in culture where we are. And like I said, all these things, like, let's say these kind of cosplay worlds, all these things. And also video games are part of it, too. Video games are part of trying to create participative places where you're not only receiving culture, but you're actually engaging within an actual narrative. But what's interesting about what we're doing, and this is the most. This is why iconography, liturgical art, is in a way, the most radical thing that you can do right now, because the question is posing, or the challenge that it's posing to culture. It goes very, very deep, goes right at the root of our entire culture of entertainment and of passive, let's say, aesthetic experience. And so that's why you look at someone like Marek and myself. There's other iconographers in North America who were actually trained in contemporary art. We were all trained in contemporary art, trained to be gallery artists. All of this. And reaching, let's say, the end of that. It seemed like the only place to go. That was the only place to go was this desire for participative art culture. And the icon offers that in every way. Now, when I talk about the icon, it's very careful. We have to be very careful not to disassociate it from everything else. That is, the icon only has its full meaning, its full purpose, when it's part of the community, when it's part of communion in the largest sense, when it's part of the liturgical life of the church. And so it's not. You can't. It's very. We're used to thinking of these objects as paintings because that's how we think that. It's hard to break that. We make these paintings, we put them on the wall like that. Like I said, there's nothing wrong with that. But it's important to understand that this has. It's part of an entire, let's say, an entire work of art. I always say the. The composer Wagner, at the end of the 19th century, he had a term. I probably not going to be able to say it. He had a term which meant the perfect work of art. And he said this is opera, because opera has all the different arts in it. It has visual art in terms of the scenery and in terms of composition. It has music in it, and it also has narrative, it has drama. And so he said, this is the perfect. It's the perfect work of art. It's the complete work of art. But there was one thing missing, right? What was missing that was participation. That's what was missing in Wagner's. Is it Kasson? I'm not being able to say it anyway, the perfect work of art. And the perfect work of art is more something like the liturgical year. That is the perfect work of art because it covers the entire narrative, first of all, that we participate in the narrative of Christ's life, that we engage in, that we try to emulate and participate in. It also includes all those things that Wagner talked about, which is we have the music, we have the visual aspect, we have, like I said, we have the narrative. We also have architecture, which Baghdad didn't have. We also have the actual space itself is thought out. And that's why the Orthodox tradition has done us such a service by preserving the basic grammar of the Christian language. It has offered us the possibility to once again participate in this full language. And it's hard to do in our modern world. We're also alienated. Even though we're Orthodox, we're not like in a Greek village 500 years ago. But we do have this door that is open to us. And like I said, the fact that we always have to remember that the icons are not just painted boards. They are images inside the church. The placement of the icons in the church and is coherent. It's not arbitrary. We put certain image. It's not always the same. It's not 100%. It's not a system. But it is always theologically proposed. That is images. The images speak to themselves within the church. The images also speak to themselves across different icon types. That's something that we always have to remember. Just like the person who's excited to read Marvel comics and. And to see references to other Marvel comics in their Marvel comics and to see how all of these go, to watch an Avengers movie and to see all the different superheroes that they like come together into an Avengers movie. Look at the icon of the Last judgment. That's the ultimate Avengers movie. You have every single story from Adam and Eve, right all the way to the last to the final moment of the whole universe, all put into one image. In the icon of the Last Judgment. We have the Ascension, we have the basic deises. We have all these different images that are kind of brought into one. And then all the other icons also talk to each other. So there's this inter. This fancy word, but this intertextuality that exists within the icons. But the icons are not just talking to themselves. They're also referencing the liturgy, they're referencing scripture. And so all of this is like this massive grammar, this massive sacred grammar of things that are talking to themselves. And we are part of that massive poetic language. And that's why the actual architecture of the church is also important, because. And let's say just in terms of iconography that there are different ways you can make a church. But let's say the basic Orthodox church with a dome and a square. Well, there's a reason why Christ is up in the dome and that you have a hierarchy of angels, or that you have the saints who are watching Christ ascend. All of these things are related to what the dome is. The dome is the dome of what happens in the west, in the church. It'll be relevant. It'll be the dwarmission of the Mother of God, the Last Judgment, something which represents the end, the sun that sets. If you look at the east, then you see the child Christ, who is coming out of the Mother of God's womb. So you have the dawn. You have the dawn and the sun rising out of the east and the sunset in the west. So the whole church is a cosmic image. And all these icons are speaking to themselves. The hymns, all of that goes together. And so that is what I'm trying to propose to people, is that what I'm finding now is that for a lot of the young people, like the people in their 20s, these are the ones that I'm in contact with. That is a very, very attractive thing because they've reached the end of. They've reached the end of their world. Like, they, they've played hundreds and hundreds of hours of video games and they're, they're tired, right? They're, they, they're. They're tired of that empty desire, that desire to participate which always leaves you somewhat empty. And they, they, they love all these, all these mangas and all these comic books and all this kind of pop culture. But they also realize that there's something missing. And to be able to propose this beauty, like I've given you some images, some hints of what's going on in say, this gigantic grammar, this gigantic story that we have in the Christian tradition. But it's inexhaustible. It is inexhaustible because it starts at Genesis and it ends today, ends into the end of the world. But, like, we're part of it too. And all these saints are part of it too. The whole movement of history is part of it too. So you have this, you can participate, you can be inside a story. And that has so much value for people today. Anyways, what I've seen is young people who are thirsty to have something to participate in. And so when we paint the icons, we need to understand that the codes, let's say that the norms of the icons are not arbitrary. They are there, first of all, to make that image the most participative it can be to make the image of the saint bring you into communion with that saint in the best way. Right. There's been a lot of discussion about style. Some of you will be aware of this, some of you will not be aware of it. But within the world of iconographers, there's been a massive debate over style for, like, the last 50 years, maybe, and it's still raging today. It's still raging today. But when you look at the image as this desire to commune, to commune with the tradition, commune with the people, to commune with the church, then a lot of those problems are less urgent, because the decisions that you make are not only stylistic, they're also there, like I said, so that people will understand what it is that you're trying to do. So I'm not going to solve this stylistic problem for you today, but in terms of understanding why there's a halo, understanding why the saints are looking at you, usually either straight on or three quarters, all of this is part of this, right? We don't show an icon of a saint with the back of their head. Why? Because of what I said. The image is there for you to engage with it. It's not there for you to just. To just look at how nicely well done the painting was done. And there's nothing wrong with that, too. Nothing wrong with a beautifully painted icon. That's not the first reason why it exists in the world. So, anyways, I'm not going to speak forever. I just was hoping to give you that little, little thought and to maybe to help us realize that as we're sitting there at our table and we're trying to figure out how to paint the face or paint just the actual technical part, that we're also, even if subtly, working towards a world where there's a renewal of participative culture, renewal of the capacity to enter into a story. And it's the best story, right? It's the best story because it's the story of Christ. It's the best story. So thank you. So I don't know if anybody has any questions."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1656.64,"end":1693.77,"speaker":"Audience Member","text":"Yeah, just occurred to me, you know, what you've been saying is great to hear, because I haven't been able to articulate this, put it all together. This was great. One step further, if I'm in order. We come into church, we come to the icon, we venerate the icon, we kiss the icon. We are maybe, without realizing it, engaging ourselves into this realm of the icon. Is there anything you'd like to say."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1693.77,"end":1694.13,"speaker":"Jonathan Pageau","text":"About."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1696.78,"end":1699.26,"speaker":"Audience Member","text":"The way we do it or the meaning that we do it or."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1701.34,"end":1806.58,"speaker":"Jonathan Pageau","text":"Yeah, but I think that when we reverence an icon, when we venerate an icon, we have to. At least that's the way I understand it. The way I understand it is it's the same way as when in church. The priest will come out and he'll bow before us. We bow before the priest. You know, we. We are. That is the way we engage with ourselves. And so when you encounter an icon, it's not just an image, right? It's an image of a person. It's an image of a story. It's an image of an event in the life of Christ or in the life of a saint that is extremely meaningful to us. And so by venerating it, we're doing this. Like I said, we're doing the same thing. We're recognizing how God is manifesting himself through that. When you bow down before someone, it's like, you're not just. If I bow down before in church, if the deacon is sensing and I bow before the priest, I'm not bowing before, you know, Bob. I mean. Yes, but that's not the point. The point is that is that I'm bowing before the image of Christ which is appearing through him as we are in this space of communion. And so the icon is also the same. Like, when we look at the image, obviously we're looking past the actual paint. We're seeing the saint, and ultimately we're actually looking past the saint to a certain degree, where we're seeing Christ in that saint. Everything leads to Christ. The whole. All of the liturgy, everything, all the icons, all of this all leads to the image of Christ, which is appearing. And it's different as sparks in the different people around us and the different events around us. Does that make sense?"}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1806.58,"end":1807.26,"speaker":"Audience Member","text":"Yes, it does."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":1807.82,"end":2053.77,"speaker":"Jonathan Pageau","text":"Can you speak to the experience of the artist participating in icon painting or icon carving? What's going on or what could be going on spiritually within that participation process? I mean, I think that, first of all, there's like, an objective aspect. I think that just like in church, there's a sacramentality which is not dependent on the individual of, you know, the individual's particular moment right now. It's like the sacraments are valid no matter what. The priest, even the priest, the jerk or whatever. Like the sacraments are valid. And I think that in a certain manner, that goes the same for an icon. We have to be careful. We have to be careful about that, because you will hear people say, Things like, because, you know, this icon was painted by this guy who's, you know, he's not in the church or barely in the church or, you know, whatever. That's dangerous because the image with the name, if that image is part of the, let's say, part of the language of the church, you know, it can participate in the life of the church. And so that's important. That's important to understand. Now, on top of that, let's say on top of that, there is then the more mystical aspect, which is there also in the sacramentality of the church. You can go to church and then you can have this amazing moment, right, this amazing grace, where you're transported, where you can feel the grace of God just being funneled down into you. And I think it's the same for when we encounter an icon, and I think it's the same for when you're making an icon. So there are moments when I've been making icons where I was like, not there at all, where I was completely. And I was fighting with my wife or, you know, I've financial problems, and this is what's going on. And, you know, I finished the icon and someone loves it, says it's beautiful and it's full of grace or whatever. And it's like, that wasn't me. That wasn't me, for sure. Like, I didn't. That was beyond me. But there are other moments when you are carving or paint. I'm not. I don't paint. But let's say you're carving an icon and then you really have these. First of all, you can have these very strange moments in terms of encountering the saint that you are painting or that you're carving. That has happened to me, oh, very oddly, where I'm making an image of a saint. And then all of a sudden, all these strange events, you know, regarding this saint start to appear. And all of a sudden the saint is everywhere for some reason. You know, it's like I hear people talking about that saint, or, you see, I mean, all kinds of different. You know, you go somewhere and then there's some strange story that the saint has been here or something like that. So that is something that can definitely happen to you. And it's happened to me several times. And then also I think that in the best moments, I think that making an icon can also be a prayerful act, because you are. You are. It's a. You're participating in the life of the church as you're making the image. You're making something for the church. If you're doing it in a spirit of service and humility and you're connected to the saints, then I think that you can also have just these moments of grace, these moments of peace, these moments of. So yeah, I'm sure it can go pretty far. I'm sure if we were saints, we might have visions of the saint. And sure, it could go a lot further than that. Sadly, I'm not quite quite there yet. Does anybody have questions for those who have come, maybe for the first time? Do you have questions on why icons look the way they do? Anna will be also giving people. I'll be talking about it in our class as well, kind of talking about different. Just some of the. More like the codes you could say, like there are certain things in icons which you need, which we traditionally put in icons for us to. To engage with them properly and to recognize them. So. All right, well, thank you for your attention."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":2054.01,"end":2054.89,"speaker":"Audience Member","text":"Thank you very much."}
{"episode_id":"SW - #076 - 2019-11-27 - The Radical Proposal of Sacred Art","start":2054.89,"end":2138.78,"speaker":"Jonathan Pageau","text":"And I wish everybody a great week. And it's tough, you know, it gets hard, especially after a few days. And so hopefully you can all in the morning, go have morning prayers and put ourselves in the right track for the day. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo Videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
