{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":12.56,"end":118.46,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World. So, hello everybody. I'm here with Richard Roland for those who are involved in the symbolic world. You have seen him around, you've heard him, he's written articles for the Symbolic World blog, he's involved in the community in different ways. He's also the co host of the Aman Soul podcast, now is involved with Father Andrew in different projects. I would say he's involved in this really. He's completely aligned with what we're trying to do, which is try to help people understand traditional thinking in a modern way, help them understand how we can re, embody, relive these stories. And one of the exciting things that I found is that I've had this secret dream for many years which is to restore what we call the universal history. The idea that the ancient peoples had a common history that they shared, that they kind of had different perspectives on and that like in the Middle Ages everybody was just part of this massive story. And I've always had this dream of kind of helping people understand why it's important and why it matters. And I've discovered in Richard, really like a partner, we were both texting away at each other, amazed at how we're excited about the same seemingly obscure things, but that are not at all obscure because they really can help ground us in a common narrative. So, so Richard is a philologist, he studied ancient languages. He's also very smart, works in data science. But I'm looking really forward to our discussion today. So maybe Richard, you can tell us a little bit about the things you've done around us and then we can dive right into the subject."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":119.26,"end":265.75,"speaker":"Richard Rohlin","text":"Yeah. So as you mentioned, I've written a couple of articles for Symbolic World. I have a couple more that are in the pipe, but I just keep not finishing them. But I've written some things there specifically on hagiography, which is a subject that's really important to me as it's actually the main genre of literature in the Middle Ages, like far and away, there's more hagiography than literally anything else, but it's not a lot of attention is paid to it. As you mentioned, I'm a philologist, basically that means I study old words and old texts and old stories and the languages that they're all written in. And I'm a data scientist, which as I mentioned earlier, is sort of a modern day soothsayer. And so. But my main deal is kind of looking at medieval stories. Two things. One is looking at medieval stories and seeing meaning there and Then the other one is sort of. I have now developed a kind of sideline in reminding other academics that the Middle Ages was a Christian period, which you would think people would know this, but I mean, I once had a. I once had a conversation with a fairly well known medievalist about the Holy Grail. And I was talking to this person and you know, making an argument for kind of a liturgical reading of Chretien's Grail story, which one of these days we're going to do a video on. And you know, he said to me something like, well, you know, aren't you reading a lot into that? I said, well, I mean, there is a host in it. And he looked at me, no lie looked at me and said, what's a host? So my basic sideline, and I'm kind of in connection with this, I was going through a recent translation of the Pearl poem, which I write about in Amid Weeping There is Joy, which is a book that we had that just came out. We'll talk about that later. But I was reading a recent translation of the Pearl poem and the scholar, who again is a very well known medievalist, she translated the word Mass as feast, just sort of like generically feast. So completely took the Mass out of the poem."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":266.07,"end":266.71,"speaker":"Jonathan Pageau","text":"Amazing."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":267.03,"end":287.01,"speaker":"Richard Rohlin","text":"Which the poem is all about the Mass, so things like that. So basically my new thing is just reminding people of the Middle Ages was a Christian period and that there was a sort of a narrative, an original context for all of that and that that should actually affect the way we read these stories. Exactly."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":287.25,"end":322.9,"speaker":"Jonathan Pageau","text":"And I think that what we want to do now is part of helping people understand. You know, one of the things that I. The Middle Ages act as a kind of mythological substructure to the modern world, whether people want to or not. You know, there is that even though people are trying to kind of move away from it, so much of our dark, like even the idea that it's kind of went into the dark place where we have these dark stories and these fairy tales and these strange misunderstood stories, you know. Cause the fairy tale, even if it's not medieval, it's medieval in its structure and it's medieval in its illusions, let's say."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":322.98,"end":323.3,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":323.3,"end":340.02,"speaker":"Jonathan Pageau","text":"So all of that shows us that Middle Ages are acting as this kind of just like for the Greeks of the times of Athens, you know, the Trojan War and, and the Odyssey were like this mythological backdrop to who they were. The Middle Ages are the mythological backdrop to."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":340.66,"end":341.14,"speaker":"Richard Rohlin","text":"We are."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":341.14,"end":354.26,"speaker":"Jonathan Pageau","text":"And so we need to diving back into it and having a clear vision of what it can tell us and how it can structure our more consciously, structure our reality can be one of the solutions to the disenchantment that we're facing."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":354.9,"end":397.46,"speaker":"Richard Rohlin","text":"It's funny because somebody asked a question and this might have been on an episode. I think this is on an episode of the Emmons fool podcast. Somebody wrote in with a question of basically, like, well, why is all fantasy? Or like the vast majority of fantasy, why is it set in a medieval setting? And it's for exactly the reason you just described. And this is what I was trying to explain. It's that. That's where we look back to, Right. That's where our meaning comes from. Even that's where our monsters come from that we're dealing with right now. Like, it's all. It's all sort of contained in there because there's this big medieval synthesis where basically it's the only time in human history when we've really had everything sort of come together and mesh together and fit together."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":397.86,"end":409.46,"speaker":"Jonathan Pageau","text":"That's amazing because you say that and everybody. So many people who are listening will think what the Dark Ages had, a synthesis where everything came together. And it just shows how ignorant we are of what the Middle Ages had."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":409.78,"end":461.32,"speaker":"Richard Rohlin","text":"Well, and that's really, you know, we're going to be talking about universal history today. That's really what universal history is about. It's about. It's about showing how the Christianity of the Middle Ages, Chesterton, in his poem the Battle of the White Horse, he said, it's only Christian men who. It's only Christian men who protect even pagan things. In other words, only Christianity has the, let's say, the catholicity, the universality, to actually take in the entire pagan world and. And integrate it, find a place for everything. And that's what you see basically happening in universal history. It's a way of fitting our story. Right. The story of my people, whoever my people are, into kind of a master story, a master narrative. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":461.48,"end":550.71,"speaker":"Jonathan Pageau","text":"And this is something which was already there, let's say, before Christianity. That is, we have to understand that the ancient pagans had an intuition about other peoples, which is that when they would encounter other peoples, they would always be trying to pinpoint, for example, like, okay, so they have these strange gods. Let's recognize the strange gods, right? So, okay, so when they talk about this God, they're referring to Zeus or they're referring to Ares, but they're referring to different. The same gods we have. They just had different names. And some of them. And it wasn't like a perfect system. Sometimes it was like. Well, their God seems to be like a joining of these two gods that we are. That we're worshiping, let's say. But there was a sense in which it's not like this strange modern idea that somehow things are so arbitrary that they just pop up. And you people can have all these traditions that are arbitrary, but rather that there is a common human experience, whether we're connected historically or just in terms of our nature, that will bring about similar stories, that will bring about similar principalities, that will notice different principalities in the world, and we end up worshiping the same gods. And so even it was there before Christianity, but then when Christianity arrived, there is almost this idea that all of this now culminates into Christ and all the good elements of these ancient traditions and can be kind of pulled into this one story."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":551.27,"end":657.18,"speaker":"Richard Rohlin","text":"Yeah. In the discarded image. Lewis says. I think it's in the preface or like the introduction to the book. He says that there was. Of course. Of course. And he actually divides it into right and left. Obviously, you'll understand, and your listeners have been paying attention for a long time, will understand the symbolism of the left hand, really, is to sort of push something away. Right. So he says there's a Christian left, but that was always trying to get rid of these things. But then there was always a Christian right who would say, along with St. Justin martyr or Justin the philosopher, whatever true things have been said by men at any time belong to us Christians. Of course, you could look at that now and say, oh, that's just appropriationism or something like that. And first of all, technically, yes, there is this university in California that has this proposed class that they want to start teaching, that actually Christianity is guilty of what they call theocide, which, again, yes, sort of our deal. Right. But also what people don't always understand there is that when these things die, that they have a capacity to be resurrected in a way that allows them to participate within the larger story of the Christian world. So you do see the seeds of this happening in. I mean, for instance, Herodotus, when he encounters Egyptian society, spends a whole lot of time trying to figure out how do the gods that the Egyptians worship to the map to the gods that we worship. But then what Christianity does is it integrates it in a more complete way so that you don't have competing principalities, so that everything is able to kind of lay itself out in a hierarchy that lets you figure out where your story fits into this larger narrative."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":657.34,"end":730.25,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And the idea that we're appropriating. It's so hilarious. It's as if it's like you think that we were. That these were copyrights or that the purpose of the world is to be original and to like come up with the new thing that hasn't been done before. Every time someone says that Christianity has elements of things that are there before them, I'm thinking like, are you patenting these things? Like, what reality do you actually live in? Like, that's how it works. We take the things that are given to us and then we try to fit them in a way that will be more real and that will be more conducive to a universal history like the one that Christianity finally ended up coming towards. That this was actually a process, a historical process that wasn't done by one person that was kind of. We don't even know who was doing it sometimes it just is this organic thing that, that happens and pops up in legends and pops up in different texts. But it's just a funny thing to think that somehow, somehow these stories, once again, somehow reality is so arbitrary that we could be stealing ideas from other companies, steal tech ideas from each other."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":731.29,"end":854.51,"speaker":"Richard Rohlin","text":"Yeah. One way to think about the development of narrative in the Middle Ages is that it's not until a very, very late stage, basically until Dante. Right? Dante is kind of the first self conscious author, right? In the sense that he's really the first person. I mean, obviously there are a lot of works which will begin with, you know, oh, pray for the poor wretched sinner whose name I'm not even going to give you because I'm so unworthy, because I'm going to not relate to you these great things or something like that. But Dante's really the first sort of like in one sense, kind of, you know, he's standing right there on the cusp of the medieval and the modern because he's the first person who sort of writes himself into the story. But before that, the writing in the Middle Ages is characterized by two things. One is a deep respect for authority. And authority really, at the end of the day means anything else written down. Right. Because writing is very expensive. People don't write stuff unless it's important. So a deep respect for the authority of the earlier text. And then also secondly, basically no concept of the idea of authorship, like our ideas today of authorship, plagiarism, things like this would not even make sense back then. That's why when people get a little hung up on things like, well, who's the real author of this pseudoepigraphal text, like only a modern person can ask that question and it be meaningful. Right. So I wrote an article on the symbolism of Saint Dionysus the Areopagite and his story basically just takes everything I'm saying right now and just kind of combined it. Right. So there's this whole body of text and the question is most scholars today say it, it was actually authored by somebody that they're going to call Pseudo Dionysius. So, so in other words, not Dionysius, but somebody else writing under his name. Right. Well, that's essentially just a modern hang up. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":854.67,"end":890.75,"speaker":"Jonathan Pageau","text":"And also the idea, it's also because it's the idea that text exists in a vacuum because the person who wrote that, Pseudo Dionysius or whatever, who knows who wrote it, didn't write it just out of his own mind. He didn't just sit down and think up something new to write. He was writing it based on things that had been handed down to him. And, and even if we don't know exactly how these things were handed down, they reveal themselves as they're received by the Church and integrated into the Church as appropriately transmitting certain things which were already there in the tradition."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":891.07,"end":892.47,"speaker":"Richard Rohlin","text":"Right? Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":892.47,"end":929.2,"speaker":"Jonathan Pageau","text":"All right, so let's go into the history. So when we talk about universal history, the biggest thing that happens is the joining of the Hellenistic tradition and the Christian or the Jewish history or the Hebrew history. That seems to be like the biggest thing that happens. And it happens in Troy, in Alexander, and then ultimately joining all of this together with the genealogy, genealogies of scripture and how these different groups relate to each other. So if you can tell us a little bit about how what that looks like, let's say."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":929.84,"end":1079.28,"speaker":"Richard Rohlin","text":"So I think kind of the first moment where this happens is actually probably in the Book of Daniel. So in the Book of Daniel you have these prophecies. And of course, whether or not you think they're prophecies will depend on whether or not you believe such a thing as prophecy is possible. You know, can people write about events before they happen? But in the Book of Daniel you have these prophecies, some of which concern Alexander the Great. And so there's this legend that goes back into the time of antiquity that Alexander the Great shows up to Jerusalem with an army and the people of Jerusalem come out and they're please spare us, don't destroy the city, etc. Etc. And so they bring out the, the high priest brings out the Book of Daniel and he reads to Alexander the prophecy concerning the rise of the Macedonian Empire in the book of Daniel. And Alexander is so profoundly impacted by this that he spares the city. So this is the tradition. And of course we know historically that Alexander, whenever he went to a city, he would always figure out what does he need to do to join that city's pantheon. How does he become adopted as a son of the principality of that city? Right. And so we can, so I think you can see that same pattern manifesting itself here. And in this case it's not that Alexander can sort of ritually become the heir of David or something like that, but there's a joining at that point between what's happening in the Hellenic world which is not a, it's not a secular thing. Right. Alexander's rise is not a secular thing. Right. He's identifying himself as a divine figure, as actually multiple divine figures. The whole Alexander story is deeply religious to the point that even long into the Middle Ages Alexander is sort of seen as this pre Christian manifestation of the virtues, sort of as like the highest, the highest human development that you know, the highest you could get without actually being a Christian. And I mean you've talked about the ascent of Alexander and sort of he ascends and then sort of hits his limit. He can't go any higher than that. Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1080.96,"end":1205.09,"speaker":"Jonathan Pageau","text":"And there are some traditions about Alexander which have him actually recognize the God of Israel and recognize the one God. So he's so impressed by the priests that come to greet him, he's so impressed by what he sees in terms of worship that he declares the unity of God. And that. And this is important for people to understand because that legend, that's why Alexander is in the Quran, Alexander is in the Quran because there was a tradition which was there within the Christian world that Alexander had recognized the unity of God and therefore was acting like a predecessor to what Christianity would be, which is the pagans recognizing the God of the Hebrews as being this one God. And there's something about that, what's important is like there's something about that which is legendary, but there's something about the fact that Alexander was Aristotle's student and there's a whole tradition of Alexander exchanging letters with Aristotle and these are all apocryphal or whatever, but that the fact that he was Aristotle's student, that Aristotle had that notion of a single, that divinity was one and that there was an unmovable mover, makes these legends that went around it not completely insane, not completely unfathomable, rather talking in narrative form about a reality which is slowly developing in the west, which is this capacity to see the unity of the divine and to start to formulate it in a way that would ultimately culminate in Christianity. And so there is this sense in Justin Martyr and in some of the early Fathers that this seed was there in the Greek philosophers, that there was a seed of what Christianity would bring was already there. So these legends of Alexander are talking about that in narrative form. And they end up creating something as powerful as having Alexander in a sacred text, in the Islamic sacred text."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1205.57,"end":1219.41,"speaker":"Richard Rohlin","text":"So another text tradition that is closely related to this is the Sibylline oracles, which I've been reading through recently, I'm about maybe halfway through, which we thank."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1219.41,"end":1222.85,"speaker":"Jonathan Pageau","text":"You for reading those because they're really long and there's a lot of them."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1223.08,"end":1240.52,"speaker":"Richard Rohlin","text":"They can be tedious sometimes, but there's some real nuggets in there. So just to say, you know, usually we associate. Maybe if you're a student of, like, mythology and folklore, you might associate the Sybil with Rome, which is not incorrect. But actually, in the ancient world, there were like a bunch of different Sybils."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1240.68,"end":1242.96,"speaker":"Jonathan Pageau","text":"Tell people what a Sybil is, because a lot of people will not know."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1242.96,"end":1303.31,"speaker":"Richard Rohlin","text":"What that a Sybil is a female oracle. Basically, it's a female prophet, a seer, somebody who's been given access by the divine to sort of know the future, to see the pattern manifesting itself in reality. And so actually, your video on the Apocalypse, the beast of the Apocalypse, came at a really good time because it came out just as I was getting into the sibling oracles. And something that's really key in there is, of course, scholars have gone through there, and they said, well, this verse sounds like paganism. So this verse was written by a pagan. But then this verse is clearly, you know, supposed to mention, you know, refers to Christ. And so this verse had to have been written by a Christian. And then they come across a verse that says, well, this verse references vaguely Judeo Christian moral values, but it doesn't explicitly mention Christ. So that one must have been written by a Jew. And they dissect it like this."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1303.31,"end":1306.08,"speaker":"Jonathan Pageau","text":"You know, man, you know why I hate scholars so much?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1306.56,"end":1471.64,"speaker":"Richard Rohlin","text":"I know, I know. I apologize on behalf of my tribe, I really do. But I mean, like, it can be a little maddening to kind of. To kind of like try to trace that down. But if you. If you just take all of that source criticism and you just set it to one side and you read, the whole thing is actually, especially if you're familiar with any other ancient medieval literature, deeply cohesive and one of the things that's interesting in there, you said in your video on the Beast of Revelation, that prophecies, the way prophecies work, they don't just refer to the one event at a certain point in time, otherwise once that event was passed, nobody would read them anymore. But rather, it's almost because there's this fractal structure to reality that prophecies, you can see, you know, they deal with the patterns. And even if the accidents change, the patterns manifest themselves over and over again. And you see that in the sibling oracle. So for instance, when they're dealing with judgment against a certain people, they'll pick two historical events that we would know, like in a chronological sense, happened 500 years apart, but they both happen to the same Greek city where they both happen to Rome. Right. And so the Sibylline oracles, which probably do come together as sort of probably a hodgepodge of different sources, because even if you believe what the ancients believed, there are many different Sybils and they're writing at different times. And at some point somebody collected these prophecies together. And of course, the first and the most important Sybil, you'll like this is Noah's daughter in law. Interesting. Yeah. So it all goes back to. Or it all goes back to Noah. And in fact, in the first, it's either the first or the second sibling oracle, there is this passage where it drops out of prophecy because it's describing the flood. It drops out of prophecy and it just starts describing, here's what happened in the flood. And it's this deeply realistic firsthand account of Noah opening the door of the ark and what. Or the window of the ark and looking out on the sea and what he saw and how he felt and the color his face turned and you know, just the, you know, like all this stuff, like it's this deeply actually. I mean, it felt like something Tolkien could have written about the downfall of Numenor. In fact, some of the language was so close that it made me like kind of raise an eyebrow. But then you get to the end of that oracle and the prophetess reveals herself in a riddle. And if you work out the riddle, it's she's the daughter in law of Noah, you know, since she was on the ark. So."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1474.68,"end":1511.81,"speaker":"Jonathan Pageau","text":"Even the existence of these symbols and the existence of the kind of strange, what you could call mixture of the. Some pay more pagan symbols, some more Christian, some more Jewish, and how they're kind of brought together, on the one hand, you could say that this is syncretic. And it is. But out of that syncretism can be pulled a notion that whoever it is that pulled these legends together thought that these were. Could exist together, like, that they were living in the same world, that somehow the Hellenistic world and the Jewish world had a way to talk, you know, had ways to talk to each other."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1512.45,"end":1522.23,"speaker":"Richard Rohlin","text":"That's the thing. Whenever somebody starts to say such and such is incredible, I'm always like, why is that an objection to you? Like, have you met people? You know, like, how else do we do things?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1522.31,"end":1534.47,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it's also about. It's about meaning. It's like understanding that what makes. What makes syncretism problematic is when it goes against the truth."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1534.71,"end":1535.11,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1535.43,"end":1560.31,"speaker":"Jonathan Pageau","text":"When it moves against the truth, but when sometimes it points towards the truth. And so that's why some of the ancient myths have a little seed of understanding what Christ will ultimately reveal. And in those seeds, we can see something valuable. And, for example, like, we all know that every single culture in the world has a flood narrative. So we could say something like, oh, those stupid cultures, they just copied the Jewish story. And it's all."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1560.31,"end":1561.59,"speaker":"Richard Rohlin","text":"The Jewish story copied the."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1561.59,"end":1613.33,"speaker":"Jonathan Pageau","text":"You know, don't look at that. It's. It's. It's horrible. Or like you said, or that it's just the Jewish. Or you could see. No, there's a. Definitely a common. The common experience on which this is based. Whether it's a common experience in terms of history or if it's an actual, almost like genetic or like human nature thing that we have in us that bubbles up no matter what you do, that it's almost like an imprinted memory on human nature. It doesn't matter how you look at it. That means that you can get nuggets from these other stories as well. And you can get a sense, like, when you read Gilgamesh, there are some things about the ancient flood that actually shine brighter when you read the Gilgamesh story, because you're like, oh, they're doing it this way. And so you say, oh, so it's pointing to something that I had noticed in the other texts."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1613.97,"end":1767.32,"speaker":"Richard Rohlin","text":"Yeah. And maybe it's also worth kind of pointing out here. So the Sibylline oracles are. They're sort of part prophecy, part history, but the two things are so interwoven that you can't actually separate them. Yeah. And part of being able to understand the idea of a universal history is being able to also understand it in terms of apocalypse. These two things always go together. I mean, we've Talked a lot about this particular volume from the dumb Dumbarton Oaks Medieval Library, which I have a lot of on the shelf over here. And so this connects two works. One is the Apocalypse of Pseudo Methodius, and the other one is an Alexandrian World Chronicle. So the Apocalypse of Pseudo Methodius is basically like dealing with the whole idea of after the Roman Empire. Well, it's dealing with. It's really sort of like dealing with the story of the rise of Islam. Right? So after the Roman Empire has come, has Christianized, has established peace, why then are bad things happening? Didn't we, to put it in Arthurian terms, didn't we find the Grail? Shouldn't things be good now? What's going on? And then the Alexandrian World Chronicle is another work from roughly the same period that is basically just a very straightforward, blow by blow universal history of the world. In fact, if you want an easy introduction to a universal history, you could do a whole lot worse than the Alexandrian World Chronicle. But the fact that these two things were just included in the same volume is a wonderful sort of symbolism happens moment because the two texts are not related in that they were from the same author, but they are of a piece that ancient peoples understand. You have to understand history to understand Apocalypse and vice versa, because the history is. Here's the way that the pattern manifested itself before us. This is where we're from. This is how we fit into the story. But then the Apocalypse is that same thing. Looking forward. Okay, so I grew up in basically the same kind of culture that you did, fundamentalist, Baptist, evangelical. And so you'll know that there's a deep obsession in that culture with the end times, with the book of Revelation, et cetera. And of course, one of the things. Now, this may not have been an issue for you because you were from. You're from the land of Canadia, I think. I think that's how you guys say it. Canadia, the land of."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1767.32,"end":1773.08,"speaker":"Jonathan Pageau","text":"I'm actually not. I'm from the land of Quebecia. You don't identify with those other things."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1773.56,"end":1792.41,"speaker":"Richard Rohlin","text":"Yeah, but in America, in American evangelical culture, there's a deep obsession with trying to find the nation of America in the book of Revelation. It's really important that Americans like, I've."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1792.41,"end":1799.21,"speaker":"Jonathan Pageau","text":"Got bad news for you. If it's there, it's the whore. He's like, okay, stop, stop."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1799.61,"end":1826.31,"speaker":"Richard Rohlin","text":"I don't disagree with you. But it's. But it's like, so actually. So a good example of this would be there's this moment when the Virgin who Bears the child. Is it the church or is it Mary? I mean, it's both. Yeah. Not hard people. It's both. But anyway, she's born up on the wings of an eagle to a safe place. And so they will say, the wings of the eagle is the United States Air Force."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1826.63,"end":1827.51,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1827.59,"end":1828.63,"speaker":"Richard Rohlin","text":"I have sat in."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1828.87,"end":1829.27,"speaker":"Jonathan Pageau","text":"Stop."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1829.43,"end":1854.29,"speaker":"Richard Rohlin","text":"Like, I had a. I was a. I was. I mean, part of my story too is I was a Baptist pastor before I became Orthodox. And so I've sat in theology classes teaching, where they were teaching eschatology. And that's what they said in the class, that the wings of the eagle are the United States Air Force carrying the chosen of people, chosen people of God to safety. So see, there it is. America is part of the story now that's."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1854.53,"end":1857.33,"speaker":"Jonathan Pageau","text":"And you wonder why there are so many atheists. Like, you just wonder."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1858.21,"end":1914.99,"speaker":"Richard Rohlin","text":"Okay, but it's wacky. Yes. But it's actually also a pretty normal impulse. Yeah. To try and find where is. What's your place in the pattern? Like, you know, in the story that's being told, in the pattern that's manifesting, like, where do my people fit in? And that's kind of what a universal history is about. And part of the loss that we've had as a result of the loss of the medieval model, part of the loss that we felt has been not having a universal story that we can plug ourselves into. And so that's actually been replaced. We think we're so cosmic cosmopolitan, but it's actually been replaced by much more parochial narratives, like the sort of evangelical American conservative narrative. America is the new Israel or like even things like the 1619 Project. I don't know. Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1914.99,"end":1921.79,"speaker":"Jonathan Pageau","text":"Their desire, a desire to restate the origin ideologically."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1921.79,"end":1931.4,"speaker":"Richard Rohlin","text":"Yeah. Those are ways of doing mythology, but they're not universal. They don't actually, you know, they're actually ironically, deeply non inclusive. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1931.88,"end":1959.13,"speaker":"Jonathan Pageau","text":"And so the. The way that I kind of see it, and I think that you. Pointing to the apocalypse and to the, let's say, legendary history, there's something about. So just in terms of experience, so you can imagine you. We have your moment, like the moment in which you live. And that moment you have access to a certain granularity to that moment. If you want to, you can kind of access the details of this moment."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1959.13,"end":1959.65,"speaker":"Richard Rohlin","text":"Okay."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":1959.89,"end":2124.66,"speaker":"Jonathan Pageau","text":"But the more you go forward and the further you go back in both directions, the more you move towards pattern. And that just will happen normally because in order for you to remember things from a very long time ago, they have to synthesize into patterns. And in order for you to talk about something that hasn't happened yet, but that is following that pattern, then you also have to use images that are universal enough for them to then find body in the future. It's like if I said something like, I'm going to die, I'm going to meet death one day. It's like I'm talking in patterns. I don't know how, I don't know, but I know because I understand the pattern of life that this is going to happen. And so I'm predicting it. But I'm not saying that I'm going to get this disease or that I'm going to be this age or, you know. So as you move towards the future, you talk, you move in patterns. And so that can help us understand why the legendary history, both the story in Genesis, why it's so patterned, and why it looks like the end of Revelation with the heavenly Jerusalem, and why the prophecies of Ezekiel talk about paradise and the mountain of precious stones and all of this type of imagery. Because it's both, like, there is this extreme in the past and the future of how you can actually see the pattern more easily when you look at things that are very far away in both directions, let's say. And so in the universal history, that's something that happened. And so one of the elements of the universal history is trying to trace all peoples back to Noah. And the way that they would do it was almost like through ontology, you know, through the characteristics of the people to a certain extent. So there would be, like, their place in the world geographically, but there would also be, like, an understanding of the characteristics of the people. So a good example that I like to use, which is. Which seems arbitrary, is that the Hungarians see themselves as descendants of Nimrod. And you think, like, how could you ever prove that? You can't prove anything like that. Like, this is obviously not. But there's something about their. So you can imagine when the Hungarians converted, then they tried to. They looked at the. They tried to unite themselves with the biblical story of the Christian story, right? Then in. Their characteristics are like, oh, we're nomads, we're hunters, we live. You know, this is how our ancestors lived. And therefore connecting it to Nimrod, who was this giant. It's also because the Hungarians are. Are kind of. Are kind of ogre, like, you know, like even in their own. The way that they. That's why the ogres are actually Hungarians. You know, I think some people think that the word ogre comes from, like, the same root as Hungarian."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2124.66,"end":2125.34,"speaker":"Richard Rohlin","text":"Oh, interesting."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2125.34,"end":2135.82,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so. And so this idea that they have giant ancestors and that they were these hunters and everything. And so this is not even, like, people saying it about them."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2136.31,"end":2136.55,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2137.27,"end":2153.11,"speaker":"Jonathan Pageau","text":"Because there's a negative aspect to that. Like, being a descendant of Nimrod is not, like, necessarily all positive, but it's like recognizing yourself and your place in the story and then understanding that that aspect can also be converted and participate in the universal salvation."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2153.83,"end":2244.31,"speaker":"Richard Rohlin","text":"Yes. So, yeah, you have to connect yourself back to Noah. This is even sort of there even in Scandinavian folklore and mythology. You know, as. As those people Christianize, they look back at their ancestors and one of the things that they try to figure out was, where do we fit in? And actually, this sort of thing has been going on ever since the Gospel According to St. Luke, when Luke writes his gospel. So there's the genealogy in Matthew's gospel, which goes back to Abraham. Right. The genealogy in Luke's gospel goes all the way back to Adam. And the point of this is that Christ has come not as the savior, just of the Jewish people, but as the universal savior, so that there's a place you can trace your lineage back. This is what Luke is basically encouraging his Gentile, his primarily Hellenic readers to do, is to figure out where their story joins the line of Adam, which that should be everyone. Right. So figure out where their story joins the line of Adam, because Christ is the new Adam, so he's going to actually assume or sort of recapitulate all of that stuff back into himself. And that's really where this begins in the Christian story. And then, of course, it goes on to manifest itself in some really dramatic ways with one of my favorite historical figures, who we'll talk about in a minute. So I thought it would be."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2244.55,"end":2245.11,"speaker":"Jonathan Pageau","text":"Go ahead."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2245.51,"end":2254.46,"speaker":"Richard Rohlin","text":"Well, I mean, I want to get to basically, again, so we grew up in the same kind of subculture. Right. So I don't know if people blamed everything on Constantine."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2254.46,"end":2256.3,"speaker":"Jonathan Pageau","text":"Oh, yeah. So we're moving towards Constantine."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2256.46,"end":2258.38,"speaker":"Richard Rohlin","text":"Yeah, we're moving towards Constantine. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2258.38,"end":2260.14,"speaker":"Jonathan Pageau","text":"Before we get to Constantine, we need Troy."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2260.38,"end":2260.74,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2260.74,"end":2271.5,"speaker":"Jonathan Pageau","text":"Okay. The two sources are really Noah and then Troy. And so tell us more about why is it that everybody's connecting themselves to Troy and even just tell us how they are, because it's pretty amazing."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2271.5,"end":2407.43,"speaker":"Richard Rohlin","text":"So let me talk about the Scandinavian peoples, because this will get both Noah and Troy in there. Right. So the Scandinavian peoples have this culture hero, he's called Shield, Shield or Sheave, or sometimes like Those are, you know, some sources. Those are two different people. And then in, like, the Beowulf poem, they're combined into one shield shaving, which is basically shield son of Sheaf, you know, so it's the same. Same character. Right? So the. The idea is that. And what the. These Christian monks, you know, writing in the frozen north, actually, it wasn't that frozen. There was a warming period. So they were growing grapevines in England at that time. But anyway, these Christian monks writing in northern Europe would actually tie this time back and say Sheave was a son of Noah who was actually conceived and born on the ark. There's actually a bunch of really wild medieval legends about a fourth son of Noah who was born on the ark. And actually, there's some in here. So please buy this book, people. This is a super cool book. There's some in here. And sometimes, like, it's a pretty monstrous thing, but actually, that monstrousness, that's part of the story of the Scandinavian peoples, especially as they first interacted with the Roman world. So they sort of tied themselves back to Noah via this sort of fourth son who was maybe born on the ark. And then others, you say it was through the line of Japheth, who actually, if you look at the divisions, so a lot of people tried to take what's called the table of nations in Genesis, right? So these 70 nations that descend from Noah's three sons who are divided up after the Tower of Babel, and what they would do is they would try to map those onto the nations that live in the world today. And the crazy thing is that they mostly get it right. They get it more right than they get it wrong, because what they basically end up doing is mapping the three sons of Noah to the three major linguistic groups of the ancient world. It's almost perfect, actually. So what you end up getting is most of the people who they believe to be descended from Japheth are speakers of Indo European languages. So from a philological standpoint, it's actually pretty interesting."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2408.87,"end":2413.27,"speaker":"Jonathan Pageau","text":"And so they see themselves as maybe born out of this monstrous fourth child."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2413.67,"end":2463.33,"speaker":"Richard Rohlin","text":"Maybe born out of this monstrous fourth child who is born on the ark. So he's. I mean, you can think about the symbolism of, like, he's not born on solid ground, right? You know, he's born in between worlds. Like, he's born in between worlds, right? Yeah. And even in. Even in Beowulf, he's a liminal figure because he shows up. He just washes ashore during this interregnum period that the Danes Have. So their previous king was bad and he's gone and they don't have a king now. And so they've lost their culture, they've lost technology. Right. And then she comes to them and brings about this renewal of the Danish people and kind of founds this mythical Danish court, which is basically the Danish equivalent, the Scandinavian equivalent of the Arthurian story. So he's this. And actually Arthur's got that same sort of half monstrous element in his story."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2463.33,"end":2494.63,"speaker":"Jonathan Pageau","text":"Which so does Alexander. Alexander has that too in the legend at least, because he's the son of an Egyptian priest posing as an Egyptian God. Yeah, he's like. He's a bastard figure. A lot of these founders because they're intermediary, like they bridge two worlds. They're represented mythologically as half human, half snake. Sometimes they have different. In every culture, you always have the first king often is a giant or a monster or some kind of a hybrid figure because he's kind of in between worlds really."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2494.95,"end":2593.95,"speaker":"Richard Rohlin","text":"Yeah. So then the other part of this is Troy. So Troy is, I would say, a full half of the master story of medieval civilization, east and West. Right. And the story of Troy, I mean, is deeply important. It's one of the stories that if you don't, if you haven't read Homer and then you kind of, I mean, it's hard to even know where to begin. And the fun thing is that actually a lot of people in the Middle Ages hadn't read Homer, but they, you know, especially in the west, they didn't have Homer until pretty late. But they had Virgil. Yeah, they had the Aeneid. Yeah, they had the Aeneid. So in the Aeneid, what we see happening is the origin story of the Roman people and specifically of the Julian family. Right. Where Julius Caesar comes from and literally every Caesar after him. Because even if you're not born into the Julian family, to become Caesar you have to be adopted by the previous Caesar, obviously the Recus and things like that. But that was the normative way that things happened. So you could say every Caesar was in a sense part of the family of Julius Caesar. Caesar is a family name before it's like a title. Yeah. And this is not a new story that Virgil is writing down. This was already the self understanding of the Julian family and some of the other major families of Rome was that they were descended from the mythical, basically the exiles, the people who lost the Trojan War. They're the descendants of the losers. Right. But the Trojan War is not a. How do I say this? It's not a. If you read Homer, there's no right side. Yeah, yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2594.03,"end":2601.71,"speaker":"Jonathan Pageau","text":"It's a truly epic story in the sense that it shows all the sides and you can actually see the story from the different sides."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2601.71,"end":2690.14,"speaker":"Richard Rohlin","text":"Yeah, It's a deeply complex work. It's a deeply complex work. And so even though they were the losing side, they were still seen as belonging to this older, more beautiful world. And so to tie back to that is a way of tying back to the. You know, you could cynically say it's a form of political legitimacy, but it's more than that. It's. They're already trying to tie themselves back into the older story of their culture. Right. And so what you have happening by the Middle Ages is that almost every culture. And I'll give Father Andrew a little shout out here because he recently discovered that actually the Lithuanians, and Father Andrew's been sort of recently reconnecting with his Lithuanian heritage. The Lithuanians also have this story that their civilization was founded by refugees from Troy. So what you have by the time of the Middle Ages is every major culture has somewhere in their story, somewhere in their founding story, this idea that they go back to Troy. They'll have, you know, and usually, though not always, but usually this will be somehow tied into Aeneas family, because then what that does is it connects you with both the old world and by the old world, I mean like the really old, like the Hellenic, Persian world. But then it also connects you to Rome and all of the things that Rome brings with it."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2690.78,"end":2732.31,"speaker":"Jonathan Pageau","text":"There's something about the Aeneid, too, that people need to understand, is that the Aeneid was seen in many medieval strains as being somewhat prophetic, because the prophecies about, let's say, the pronouncement that Virgil makes about Augustus Caesar were interpreted by the medieval scholars as ultimately talking about Christ. It's like almost as if Virgil didn't know, but the things he was saying were really ultimately referring to Christ because Augustus was seen as this kind of Son of God figure. It's like then the medieval people said the real Son of God that he was talking about without even knowing, was Christ."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2732.47,"end":2833.15,"speaker":"Richard Rohlin","text":"And the interesting thing is it's not even so much Augustus as it is Augustus Son who dies in childhood. Right. So the prophecy, this is in book six of the Aeneid, it's never realized in the Roman story until Christ. Yeah, yeah, yeah, yeah, yeah. So it's this really powerful thing, and it was so powerful that many people in the Middle Ages believed that, you know, maybe Virgil was a Secret Christian. And then they sort of rejected that idea, but they still wanted Virgil to be part of the Christian story. And of course, Dante does this in a really beautiful way. But even much later on, Charles Williams has this. He's one of the inklings, and he's my least favorite inkling because he's into some not great stuff a lot of the times, but he does have this. He does have this. He's really into the occult and kind of went down some bad roads by the end of his life. But he does have this one poem in his. He has a cycle of Arthurian poetry called Taliesin through Logres. And in that, he actually has this idea that the Welsh bard Taliesin, who is a Christian, somehow by participation, sort of like, goes into hell or back in time. It's a little ambiguous. And actually, like, is able to save Virgil as he's falling into the abyss. Right. So there's this. So people thought. And not just in the Aeneid, but some of Virgil's other poetry, they saw all of these sort of foreshadowings of Christ. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2833.15,"end":2913.14,"speaker":"Jonathan Pageau","text":"And I wanted to take a little pause before we go further to help people understand why this matters and what is going on, because a lot of people might have known a little bit about this or heard it in their different history classes, but it's usually presented as a kind of cheap trick, either as a way from a Protestant point of view, as the syncretism, and as this kind of return to idolatry, and then from the kind of modern scholar point of view as a cheap trick that doesn't count, that you don't. That you should ignore, and that you should just look at either the more pagan versions of those stories. Like a good example would be in the Eddas, where even though in the Eddas it's specifically told from a Christian point of view, the scholars today will say, just ignore that. Ignore that. Just look at. Just go beyond that. And what's really important is that this is talking about the ancient gods, but the process of trying to integrate the past into the new story is something which has so much power and so much meaning, and is something that Christ can also do, which is just as Christ baptized Romans, just as Christ baptized Rome into the Church, he can do the same for all the ancient stories as well. Can do the same for. It doesn't mean that everything gets in. It doesn't."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2913.14,"end":2913.46,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2913.62,"end":2929.87,"speaker":"Jonathan Pageau","text":"Some things get in, some things don't. But there is this process by which it has to narratively be connected. So it's not just that we continue to think that these stories exist independently, but we give them a Christian meaning. They actually get connected to the Christian story in the story itself."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":2930.11,"end":3005.66,"speaker":"Richard Rohlin","text":"So it really sort of all hinges on how real you believe the Incarnation is. Like, how much of humanity did Christ actually assume in himself? Was it all of it? Does it go all the way back to Adam? Well, if it does, then all of this, like, anything that's good in any of this stuff, like, it's sort of like it's. It's a. It's, you know, it's the deep magic that it work, and it works in both directions, you know, and so if you. If you believe. I mean, I've got this. I think I said this on the Areopagus podcast, but I've got this theory that you'll know a society is, like, really Christianized when it has a specific icon of the Mother of God that's specific to that culture. You know, like the Poles had the Black Madonna and the Russians have the Theotokos of Vladimir and so on. But the reason for that is because she's so deeply connected with the Incarnation. And so the more fully Christ becomes incarnate in that culture. Right. And obviously he became, from a historical perspective, incarnate in one particular place and time. But it's that particularity that the universality, we could say the catholicity of the faith actually depends on."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3005.66,"end":3009.9,"speaker":"Jonathan Pageau","text":"Yeah, it becomes like a fulcrum, like an axis around everything else, sort of."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3009.9,"end":3013.3,"speaker":"Richard Rohlin","text":"Slowly connecting, sort of like a cross shape. I don't know. I don't know."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3013.38,"end":3014.82,"speaker":"Jonathan Pageau","text":"I don't know where we get that idea."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3014.82,"end":3015.46,"speaker":"Richard Rohlin","text":"I don't know."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3015.7,"end":3033.16,"speaker":"Jonathan Pageau","text":"All right, so now. So I think that we kind of got them. So the idea is that when we say that, everybody comes from Troy, so, like, we'll go through fast so people can get a sense. Like the Germans, the. The Scandinavians end up seeing the gods as being a rescue from Troy."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3033.24,"end":3114.66,"speaker":"Richard Rohlin","text":"Yeah. So in Snorri's Edda, which is basically this. It's actually a manual for poets that he writes. It's not intended to be like, here's systematic theology for Norse pagans, which is how people use it, which is crazy. It's not insane. But he actually begins it with a story called Gil forgetting, which is this what scholars today would call a euhemerize, which is a nice way of saying, oh, these pagan gods were actually human beings a long time ago, and then people started worshiping them. And by the way, if you think that story is, let's say in Conflict with the idea that the gods of the nations are demons. You're not understanding the story because those things are not opposed. But any. But that's a different story for another time. But in Gale forgetting, what we see is we get the real story, right? The real story of the old Norse gods and the story of the Norse gods. And by the way, the Aesir, the. What we normally think of when we think of the Norse gods, Odin and Thor and all those guys, right. They're not Scandinavian originally. They're not. We know that they're not. We know that those gods were imported from somewhere else and they took over. And so that story is explained as saying these were Trojan kings and, you know, people from Trojan lands, the lands around Troy, who after they were defeated by the Greeks, they migrated north and they took over."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3115.3,"end":3152.46,"speaker":"Jonathan Pageau","text":"So that doesn't contradict at all the idea that the principalities would. That all of this would be happening at different levels at the same time. Right. That all of this is going on, is going on at the same time. And so it's mostly to help people understand that even the neo pagans, like all of you neo pagans that are watching, the ones. The people who wrote. Hello there. The people who wrote those stories were trying to connect this to the universal story. Even though you'd think that there's no relationship between Scandinavians and the Romans, there was this desire to join together and to have this universal story."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3153.18,"end":3156.78,"speaker":"Richard Rohlin","text":"So can we maybe in the time that's left to us, can we do my favorite one?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3157.02,"end":3164.62,"speaker":"Jonathan Pageau","text":"Let's go. Because this is the key. It's like the relationship between King Arthur and Byzantium. Like, that's how deep this connection is."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3165.43,"end":3169.59,"speaker":"Richard Rohlin","text":"Yeah. So let me talk. And we won't actually get into Arthur today, but we'll just."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3169.59,"end":3172.07,"speaker":"Jonathan Pageau","text":"No, no, no. But it's the source of all that."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3172.23,"end":3183.71,"speaker":"Richard Rohlin","text":"Yeah. So we'll set up a teaser and then we'll get into that. So this is all from the History of the Kings of Britain by Geoffrey of Monmouth, which is discounted by scholars."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3183.71,"end":3184.79,"speaker":"Jonathan Pageau","text":"Completely. Completely."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3184.95,"end":3329.56,"speaker":"Richard Rohlin","text":"Yeah. Completely discounted by scholars. Right. So the way that it starts out is that the island of Britain. And this is for all my Lord of Spirits friends out there. Okay. So the island of Britain is believed. Was believed to have been inhabited by a giant clan, the giant clan of Albion. So Albion is an ancient name for the island of Britain. So Albion, in a sense, were descended from essentially this Greek princess. Now keep in mind that she's Greek, so she's from. At least in relation to Britain. She's from the east, this Greek princess who she's betrayed by her sisters who want to kill their husbands so that they can rule over their kingdoms without being subservient to men. That's going to be important later when we talk about Arthur. And so the princess in question didn't want to comply with the plot, so she and her ladies, they get set adrift and they land on the island of Britain. And there are no men there for them to marry. And so they end up interbreeding with evil spirits, Incubi, Right. And they beget a race of giants. Now, of course, if you're been listening to Lord of Spirits podcast, you will know that this is how you get giants. And I just want to point out that this version of the story survives all the way into a 14th century text. So it's not like the idea, not, you know, that like the Nephilim ritual or the idea of where giants come from, it was never totally lost, especially out here on what we could call like sort of the edges of Roman civilization, where contact with paganism, where contacts with paganism were sort of ongoing. So these giants, Albion and his sons, they rule over the island of Britain until the coming of the Trojan exile, Brutus. And Brutus is kind of depending on the version of the story, he's either the grandson or the great grandson of Aeneas, and therefore he's related to the Roman royal family. He's part of the Roman story. So Brutus has a journey which actually kind of recapitulates the journey of Odysseus and Aeneas. He has a stopover in Africa, he has a bunch of battles, he has an encounter with the Sirens, and he actually founds the city of, forgive me if I say this wrong, tours in France, and he passes by a bunch of other legendary locations until he eventually reaches the island of Albion, which is totally unpeopled, except for the remainders of this giant clan and basically the last, the ruler of the giants. There's only about 20 giants left, but the ruler of them is a giant known as Gog Magog. As in Gog and Magog."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3329.82,"end":3330.06,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3330.54,"end":3390.63,"speaker":"Richard Rohlin","text":"And Gog Magog attacks Brutus's camp and he's eventually the giants are defeated and Gog Magog is killed in a wrestling match with one of Brutus's men, Corinius, who goes on to found the kingdom of Cornwall, which is actually also a really important element in the Arthurian story. And I'll just again point out there, put this out there, that the way that Quirinius kills Gog, Magog is that he heaves him up onto his shoulders and throws him off a cliff and into the sea. So Gog and Magog are the giant, the nephilim, whatever you want to call them, they're removed from the kingdom by being banished to the abyss, which is actually the same way that Christ gets rid of the demons, sends him into the pigs. We read the gospel three times a year liturgically in the Orthodox Church. It's a disproportionately read story, but the reason is because it's this powerful story of. Of the defeat of these demonic powers of these giants. Yeah."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3390.63,"end":3418.06,"speaker":"Jonathan Pageau","text":"We need to remind people that in the Alexander legend, Gog and Magog are not a giant per se, but they're like a race of monsters, a race of kind of cannibalistic, insane creatures. And they get shut out of civilization by being. There's these gates that are built and they get thrown behind those gates, and they're supposed to stay there until the end of the world when they let loose and onto the world."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3418.3,"end":3482.7,"speaker":"Richard Rohlin","text":"Yes. So with the giants banished, Brutus establishes the kingdom of Britain. Right. And so the legendary history that Geoffrey of Monmouth lays out traces this line of Trojan British rulers in all of the ways and times that it intersects with the Roman Empire. Of course, we'll remember that, you know, Julius Caesar invaded the island of Britain. So did Claudius, Claudius Nero. So it. So we see these Trojans intersecting and fighting with the Roman Empire, who, we must remember, the Romans are also Trojans. Yeah. So it's a very complicated narrative that he lays out. It's multiple chapters, and I won't try to summarize it here, but essentially to say it's this conflicting. It's this complicated narrative of conflicting principalities. And ultimately the way that the conflict is resolved is by a marriage alliance between a British king and a Roman princess. And this line ultimately produces, among other people, the Roman emperor, Constantine the Great."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3483.02,"end":3501.26,"speaker":"Jonathan Pageau","text":"And that's something that people always have to remember that Constantine comes from Britain. This is not like now we're not in the legendary history anymore. This is like everybody knows Constantine comes from Britain. This is really. This is part of how. This is part of the universal story of Christianity here."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3501.34,"end":3603.81,"speaker":"Richard Rohlin","text":"Yeah. So even if he wasn't born in Britain, St Constantine is indeed. He's very British, according to just your boring old history books. Right. He's first acclaimed emperor by the Roman legions in Britain. And I just have to point out here, though, that his mother, Helen, she was claimed to be depending on the medieval source Either a native of Anatolia, which is where Troy was, or. And she was, and therefore, and a Greek, or Britain in antiquity, in the Middle Ages. And it should be clear enough by now, if you've been paying attention, that these two origins for St. Helen, they're not mutually exclusive, they're actually polyvalent. To say that she's from Troy, and by the way, her name is Helen. Okay? Yeah. So, like, you can't make this stuff up. Like, to say that she's. She's a Greek from the area of Troy, which Helen was a Greek and then taken to Troy. Right. So to say that she's a Greek from the area of Troy or to say that she's part of this Trojan remnant in the British Isles, those things are really close. And so they're polyvalent. They're not totally the same, but they have overlapping senses of meaning. And so then what we see is that in the same way that she, you know, Helen is instead of a divider, like Helen of Troy was, or Helen of Sparta, instead of being a divider, Helen. St. Helen is. She's a uniter. Right. And so what she's able to do is she's able to. And she's a very important feminine figure in Christianity, especially in the Orthodox Church. Right. Very important."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3603.81,"end":3606.25,"speaker":"Jonathan Pageau","text":"She says she heals. Helen of Torah. Like she's."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3606.25,"end":3616.59,"speaker":"Richard Rohlin","text":"Yeah, exactly, exactly. Like, and, and what she does is. And of course, then like St Olga, right. In baptism, her baptismal name was Helen."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3616.83,"end":3617.15,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3617.15,"end":3639.11,"speaker":"Richard Rohlin","text":"So it's almost like if you're going to have a woman to fill this role, she has to be named Helen. Just. Just like. Just like. So you. So maybe way to think about it is this, you know, we have this idea of the. The Virgin Mary is the new Eve. Right. But within Christianity, there's also the idea of St Helen and then St Olga as the new Helen of Troy."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3639.11,"end":3641.43,"speaker":"Jonathan Pageau","text":"Yeah. And you could say, and it's a."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3641.43,"end":3678.17,"speaker":"Richard Rohlin","text":"Beautiful parallel because she completely undoes, like you could say the Trojan War is like the first hard divide between sort of east and West. Right. And then what St. Helen does is she actually heals that those things, she brings them together. So she's either an Eastern person or she's a Trojan, but either way, she's the one who is able to communicate Christianity to her son. And then what Constantine does. I mean, this is crazy if you think about this. So Constantine goes to found his famous city, Constantinople, within just a few miles of the ruins of Troy."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3678.25,"end":3680.33,"speaker":"Jonathan Pageau","text":"Where does he found his city? It's amazing."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3680.49,"end":3837.66,"speaker":"Richard Rohlin","text":"Yeah. Within a few miles of the ruins of the city of Troy. So you've got Constantinople, which is also called New Rome. And if you read Geoffrey of Monmouth, he'll tell you that the original name of London in the universal history, the original name of London is New Troy. So you've got movement from east to west Troy to New Troy, and then movement from west to east Rome, which is Troy, to New Rome, which is at the location of old Troy. So there's this cross. And of course, obviously the story of the, the cross is obviously super important to Constantine's story, but it's so important that it's actually embedded in the basic shape of his narrative. There's this X shaped cross shaped movement in the development of Roman history and Western civilization. You have exiles from Troy move west to found a new Troy, which is either Alba Longa, which eventually becomes Rome, or it's London, New Troy. Either way, that's the same story. And then you have a king from New Troy. Constantine is a Roman emperor, but he's also from Britain moving east to the ruins of Oltroy to found the new Rome, which is Constantinople, which becomes the first Christian city. There are no pagan temples in Constantinople. Right. But in doing that, he takes this thing that started back with Alexander, right, this merging together of the Hellenic and the Hebrew narratives, which was not always, it didn't always go smoothly. There's this whole thing called the Maccabees, if you read about that. But it didn't always go smoothly. But then what Constantine does, but it didn't go smoothly because Christ had not yet entered the picture. He was hidden, hidden down in sort of the roots of history, but he hadn't yet emerged the, the stump. I mean, I mean, this is literally the language of the Bible. The stump of Jesse had been cut down and it had not yet sprung up again. And so when it springs up, that creates the potential, right? That creates the potential for the Hellenic and the Judaic stories or the Romo, you know, Roman, Greco Roman and the Jewish stories to actually merge. And so when the people that we grew up around or people out there on the Internet say, oh, Constantine introduced all this paganism into the Church, right? They're not right, but they're also right in a way that they don't realize they're right."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3837.66,"end":3838.38,"speaker":"Jonathan Pageau","text":"They don't understand."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3838.38,"end":3852.5,"speaker":"Richard Rohlin","text":"Yeah, yeah, they just don't understand that actually Constantine's merging of these things was, first of all, it's the only way it could have gone, right? It's the fulfillment of, you know, it's the cross, right?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3853.38,"end":3886.62,"speaker":"Jonathan Pageau","text":"And also the few things to understand is that Britain, what's suggested in the story of Britain and even the reality of Britain is that it was considered the end of the world. It's considered the edge of the world. Which is why the Romans were constantly trying to build walls out there to stop these insane like crazy naked barbarians from like flooding into the world. So just like Alexander built a wall, you know, at the Caspian Sea, then the emperors built. There were two walls, there were two maginal lines that. The Hadrian's Wall and what's the name."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3886.62,"end":3887.34,"speaker":"Richard Rohlin","text":"Of the other wall?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3889.1,"end":3920.11,"speaker":"Jonathan Pageau","text":"Antonine Wall. So there are two walls that the Romans built out there in Britain to like stop these insane barbarians from propping in. So it was understood as the western edge of civilization. And Napoleon and Troy was the beginning of this whole story in the first place. And so Constantine joins them together right through Rome itself. And so it's like you have the middle, the edge and the other edge, like the beginning, this middle part and then the other edge and all kind of brought together into one, into one."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3920.11,"end":3930.4,"speaker":"Richard Rohlin","text":"Story, which is going. That goes back to. And by the way, I know you're a Francophone because you said Maginot lion, which is like. That it would never occur to. To an Anglo."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3930.72,"end":3931.92,"speaker":"Jonathan Pageau","text":"Well, how would you say it?"}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3931.92,"end":3941.84,"speaker":"Richard Rohlin","text":"Well, we would just say like a wall. Like, you know, like we don't go to the Maginot line as. Oh yeah, that's a good way to explain this. But anyway, I just love that. So."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3941.84,"end":3983.1,"speaker":"Jonathan Pageau","text":"And then Constantine. So Constantine's actual. Like even the history of Constantine, which is still preserved by modern historian, still has so much mythical in it. And so the fact that Constantine wins his battle on a bridge, they're all about that, it's all about this. And if you read the descriptions of the battle of Melville Bridge, you get the sense that he's like the new Moses. He's crossing the Red Sea, he's crossing the flood. All this imagery of a transition between two worlds as this kind of. And also as kind of bringing together these opposites. Like this new world that will join all of this together is there right in his own story."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":3983.34,"end":4006.7,"speaker":"Richard Rohlin","text":"And that's the same. A few minutes ago we were talking about the joining of history and apocalypse. The beginning of a thing and the end of a thing. That's what Constantine is doing. He's joining the beginning and the end. And what does he join them with? He joins them with the cross. Yeah. So I think we're gonna fixed everything. I just have to say that on the Internet. So it's recorded."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4006.96,"end":4008.4,"speaker":"Jonathan Pageau","text":"Keep saying that Constantine fixed everything."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4008.4,"end":4009.92,"speaker":"Richard Rohlin","text":"Constantine fixed everything."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4010.08,"end":4012.08,"speaker":"Jonathan Pageau","text":"Well, let's just say Christ fixed everything."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4012.16,"end":4012.64,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4012.96,"end":4145.67,"speaker":"Jonathan Pageau","text":"And then Constantine participated in, like, the. The fruits of that and manifested, like, the hidden fruits that were there from the. From the cross. And so I think. So we'll stop there. But just to kind of give people a hint of where this goes is that you. Now, you have to remember that Arthur. The idea that Arthur is like this Celtic pagan figure is absolute nonsense. Arthur is a descendant of these people. He's a descendant of these Trojans that are in Britain. And so all of this is going to help you understand how this universal story then continues and how Britain itself plays such an important part because of this, because of how it is the edge of the world, because of how it was the place out of which Constantine came to bridge everything together and how this really is a mythical story laying itself out. I hope you guys are. I struggle to think you could be as excited as us about this story. But what we hope is we want to start to bring this into the fore of your consciousness so that you can see that these connections are not arbitrary and that we. Even though we don't have to give up completely a more critical historical approach, we don't have to give that up. But we need to be able to see these connections as extremely meaningful and based on meaning and on identities of these people and how they saw themselves. Right. And so sometimes it's not necessarily even positive, like the fact that the example that I gave of the Hungarians or the Scandinavians who saw themselves as a monstrous son of Noah. It's not just about boasting and about making your people to be the best. And it really is about a piercing into the mystery of the light and dark sides of your own people and seeing how this all connects together into this giant puzzle. So I'm hoping you guys are excited about this because I really want us to kind of move on to both east and West. We'll talk about Arthur. We'll talk about the Byzantine prophecies and the Byzantine notion of the coming emperor, like the hidden and coming emperor that is similar to Arthur."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4145.67,"end":4148.39,"speaker":"Richard Rohlin","text":"And we're talking about Ethiopia as well."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4149.03,"end":4159.19,"speaker":"Jonathan Pageau","text":"Definitely. We definitely need to talk about Ethiopia. Very important. All right, everybody, so thank you for your time. I hope you enjoyed this little trip that we brought you on. Go for it. Oh, yeah. Let's talk about."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4160.39,"end":4194.78,"speaker":"Richard Rohlin","text":"Let me just talk about a couple of cool projects which, if you work this sort of thing, you would want to check out. So as I mentioned earlier, I'M the co host of the Amat Sewell podcast on Ancient Faith Radio. If you just want to come hear me talk about Tolkien, which is actually what I do to sound sane to people I know that's crazy. The stuff I'm talking about today, this is the stuff I get really excited about, but I have to normally keep a lid on it. So I talk about Tolkien and we have this book out now. It's like a who's who of people who have been on the Amensul podcast. It's called Amid Weeping There Is Joy Orthodox Perspectives on Tolkien's Fantastic Realm."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4195,"end":4199,"speaker":"Jonathan Pageau","text":"And it is officially endorsed by me. Even if you look at the back of the book, it's got an official."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4199,"end":4214.4,"speaker":"Richard Rohlin","text":"Endorsement on the back. Officially endorsed by Jonathan Pageau and also great forward by Father Andrew Stephen Damick. There's an essay in here by me on rude screens and ritual space in Tolkien and the Pearl Poem, which is."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4214.4,"end":4215.24,"speaker":"Jonathan Pageau","text":"Amazing, by the way."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4215.24,"end":4217.24,"speaker":"Richard Rohlin","text":"You people would, I think, do very good."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4217.24,"end":4220.92,"speaker":"Jonathan Pageau","text":"It really was written for all the people listening to my podcast."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4220.92,"end":4221.56,"speaker":"Richard Rohlin","text":"It really was."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4221.56,"end":4253.01,"speaker":"Jonathan Pageau","text":"When I read it, I was like, this is for us. But there's also an article by Nicholas Kotar that people around here know. And it is, I think, like the first fruits of getting a sense. Not the first fruit, but one of the first fruits of giving a sense of how we're moving towards something which is really going to resemble an intellectual movement, a cultural movement, a social movement. All these people who see the possibility of re enchantment. And Richard has really been playing a great role in that. So tell us a few of the other things you're involved in."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4254.21,"end":4436.14,"speaker":"Richard Rohlin","text":"May 7th and 8th, Father Andrew, Stephen Damek and I will be hosting an online conference on Tolkien and orthodox Christianity. It's going to be called Doxamut There Will Be Giants. So please show up to that. It's only 30 bucks. You can sign up for it at store.ancientfaith.com doxamut d o x A M O O T and there's still plenty of spots open, so please join us for that. There's a couple of things you really don't want to miss. One is Father Andrew talking about enchanting orcs and about the idea of sort of like demonic incarnation and the way that Tolkien plays with that in his mythology. The other, though, is that I'm going to be giving a talk on the recovery of actually what For a few years I've been calling in talks, I've given in articles, what I've been calling the sacramental imagination. What Father Andrew's been referring to as re Enchantment. And really what is basically Jonathan's whole deal here on the Symbolic world. And basically, it's going to be my premise to give a little teaser that it's a real problem, that it's easier to talk about the Inklings than it is to write good stories. And saying that as somebody who's contributed more than my fair share of ink and airtime to talking about the Inklings. Right. We need good storytellers, Christian storytellers, who understand this stuff deep in their bones. And the fact that we don't have very many people doing that, with a couple of exceptions, the fact that we don't have very many people doing that right now tells me that there's something that the Inklings had that we've lost. So I'm going to try to take a stab at answering that question. But then that's also going to kick off a new book. So the talk that I'm giving is called Fighting the Golden Key, which is a nice little George MacDonald reference that some of our Symbolic World readers will understand. It's called Finding the Golden Key, Recovering the Sacramental Imagination. And next year, in the fall of 2022, there's going to be a book of the same title coming out that's going to be a collection of essays edited and curated by myself. I'm going to be soliciting essays from several Symbolic World people. I've already talked to Jonathan about, yes, he's got to submit something. But I also actually, I'm going to be opening it up to the community. So if you're interested in this sort of thing and you'd like to contribute an essay, we'll have a website up by the time of Docs and Moot so that you can go there and actually submit, like, a summary of what you'd like to pitch. So that's going to be published by the 8th Day Institute, and we're actually going to have a big book launch party for it in Wichita, Kansas, which is the actual center of the world. You thought it was Jerusalem. It's actually Wichita because Wichita is the greatest bookstore in the universe. So we're going to be launching it there next fall and maybe we'll see what travel conditions are like this fall of 2022. But maybe we can get some of these people all together in one place, which would be amazing convergence. Yeah, that would be great to have."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4436.14,"end":4437.86,"speaker":"Jonathan Pageau","text":"An actual meeting together with people."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4439.22,"end":4449.15,"speaker":"Richard Rohlin","text":"So please sign up and come to Doxamut. You won't regret it. Even if you're not orthodox or you're. I don't know about all this Tolkien stuff, come anyway, because there will be something for you that's great."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4449.23,"end":4481.12,"speaker":"Jonathan Pageau","text":"So it really, I think it's just exciting time. It's a dark time, but it's also an exciting time because we are starting to kind of see who it is that's working together towards this re enchantment and who is trying to plant the seeds for these future fruits. So, Richard, thanks for all the work you do on Symbolic World, all the things you do, which you also have a job, which I can't imagine that you do all these things. And you also have four kids, which is astounding. So all of that, thank you for putting your heart into this and we'll definitely talk very soon."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4481.36,"end":4483.2,"speaker":"Richard Rohlin","text":"Thanks, Jonathan. Thanks for having me."}
{"episode_id":"SW - #160 - 2021-05-30 - Richard Rohlin - A Universal History","start":4484.24,"end":4549.19,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
