{"episode_id":"SW - #101 - 2020-05-27 - April Q&A","start":12.56,"end":5619.56,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Okay, here we go. Yes. The beard has been cut. Yeah. I told you. April is a crazy. April is a month of. Of madness in so many ways. So I hope everybody is doing what they can, is doing okay in the world of quarantine, of. Of isolation, of whatever it is you have to do. Lisa, you're supposed to be sleeping. What are you doing here? That's what I was told was gonna happen, man. I don't know what to tell you guys. It has been. It has been absolute madness. First of all, the first thing I want to do as people kind of. As people kind of pour in here, is I want to. I just want to thank everybody that's supporting me. Seriously. You know, when. When the quarantine hit and everybody was. Everything was shutting down in the entire world, you know, I was fully braced to see people. The support that I was getting go down. I was like, you know, this is gonna happen. It's. You got to get used to it. You know, this is. This is normal with everything that's going on. And I have to say that I have seen some people kind of, you know, move on. And to all those people that have moved on, I have to say, I hope. You know, I'd say God bless you. I hope. I hope you're doing okay. I hope you are finding opportunities and that this has not been a too crazy a time for you. And strangely enough, I have seen all of a sudden, all these other people kind of come up and. And support me as well, so. So it's just been really touching to see people. To see people kind of stand by what I'm doing. You know, I've been seeing my views kind of drop off on YouTube. I've been watching, you know, my videos taper off. Like, they would take off, and then a day later taper off. And it's hard not to think that. That I'm not in YouTube's best eye. Might not be. Might be just that my. My content isn't the best content right now. But anyways, I'm doing what I can, so I want to thank everybody for being there. I hope those that are orthodox, I want to say Christ is risen. It's hard to think. To say that I've spent the last two Paschas at home. I have not had Easter in two years. Last year, almost on the 27th of last year, my house was flooded on Easter Saturday, and so I was not able to go to Easter. And then this year, we all stood at home in Our house, looking at Zoom video, watching people try to sing at the same time on Zoom, not totally understanding that you can't have many people singing at the same time is kind of a strange chaos. But it was still, there was still a little bit of Pasca, I guess, you know. But at the end of the Easter service this year, my bishop, Bishop Irene said this is the strangest Easter. It's the strangest Pasca he's ever seen. So still we need to, to, to stay in the spirit of the risen Lord. And I hope that Christ is bringing everybody, bringing everybody a sense of peace and, and trust that God is in control no matter what we see and no matter how insane the world seems to be going right now. So, so yeah. All right guys, so I, let's go into the question. So also I have to say another thing before I get into the questions. For those who have been waiting for a April Patron Only video. It is coming. I recorded it today, really by the, the skin of my teeth. I just, I just, I would sit in front of the camera and I just couldn't talk. For the last few days I've had, I've had some very, very difficult news of one of the, my favorite people in the world, member of my family, someone who I love, who is young, has been diagnosed with stage four cancer. And you know, I just, I'm just struggling to, just struggling to get past that. And so, and so anyways, but I was able to record it and I will try to put it up tomorrow. So. All right, so let's get into the question, guys. All right, so I am starting with website. So as you know, people who, who give at the ten dollar level have early access to questions. And so I will go through those questions. I, I try to do one question per person, guys, just because there's a lot. And so once we're done with that, we'll see if, if there's stuff that comes up in the super chats. So here we go. So Josh the mover asks, hi, Jonathan, do you know of any words from the biblical languages that refer explicitly to things like patterns or fractals? Are there church fathers who spoke about pattern reality explicitly? Or have the patterns always been an implicit structure and within the teachings? Thank you. I would say that in the Bible what we see is we mostly see the patterns being enacted, whereas in the church fathers you. And so it's not like that it talks about patterns, but rather that it shows you the patterns and it enacts the patterns in. It enacts the Pattern in narrative. But. But when you look at the church fathers, they don't use the word fractals because fractals, surprisingly enough, fractal. The explicit use of the concept of fractal is a very modern. I don't know when it started, but it's a very modern mathematics. It's a very modern science, you would say. Although fractals have always existed and have existed in art, in patterns, in all kinds of places. The, The. The reference to it to fractals explicitly, as well as the, you know, the Mandelbrot fractals and all these mathematical formulas are. Are modern discoveries, modern developments. And it goes to show too, how, you know, as the world advances, one of the things we see is that as it sometimes loses the implicit or the. That the higher understanding, it's developing the explicit understanding. And so we are. We're. We're still. Still seeing amazing things come up as we move further in time. We're seeing, you know, there's all these things. There's all these things in scripture that talks about, like, in the end times, you know, we're going to see some surprises. And there's the idea that we're going to find that animals that used to be extinct are going to reappear again. And the. One of the things that I think is part of that is also the reappearance of the. Of texts like the reappearance of the book of Enoch, of all these books that were basically lost to most people, I think is part of this. This strange kind of gathering of everything together as, you know, as we approach the eschaton, whenever that's going to be, maybe it's still very far away. Who knows? But. Oh, sorry. But in the church, I'm gonna be like this, guys, I'm sorry. I might. I might not be super, super efficient. In Sangri of Nyssa, he actually uses the word archetype and he talks about pattern. So, for example, in the life of Moses, there is this idea that as Moses ascends the mountain, when he gets to the top, he receives from God the pattern of the tabernacle. And the pattern of the tabernacle is basically the pattern of reality, and it's the pattern of Christ. It's Christ himself. And. And so Christ is the pattern of reality in St. Gregor Venissa. And of course, he doesn't use the word fractal, but St. Gregor Venissa himself engages in a kind of fractal structure as he talks about the mountain of paradise being a cosmic mountain. But then Also being the tabernacle and also being the human person. And so he's always working on the different levels at the same time of the same pattern. All right. And so Benjamin Rva says, jonathan, I'm struggling to reconcile commandments and traditional values like honoring one's parents and those families members themselves are deracinated from and in some cases, hostile to traditional patterns of being. How should I commune with a family that is out of communion? I suppose this is a microcosm of how to love people in the world as it is now. At the macro level, the Benedict option of withdrawing from corruption feels right. At the family level, less so. Any thoughts? Yeah, it's tough. It's tough. You know, I think that there's this. There are these. There are these two. Balance. There's this balance we see in Scripture, you know, when there's this idea that we need to honor our Father and our mother. We need to honor that which is our origin because that is by which we get our identity. So. And so we need to enact the. On. We need to enact at a lower level the. Let's say, the worship that we give to God because he is our ultimate origin. We need to reenact that at a smaller scale and at a smaller level to the things that are our own origin and our. Our. That are the source of our legitimacy. And so our parents, the. The king, you know, our authorities, all of these things. You know, all power comes from God, as St. Paul talks about. All authority comes from God. But it does. It is possible for that order to become corrupt. It is possible for our parents to be bad parents. And, you know, and I think that in that moment, we can see where. We can see where there are other statements about Christ, you know, about really radical statements that Christ makes about, you know, if you do not hate your. Your brother or your. Or your. Your father or your mother, if, you know, if you. If you. Those that do not hate their. Even their family will not, you know, cannot come into Christ. And so there's this idea that we also need to get things in the proper hierarchy. That is, if your family is not in line with what God is asking, then you need to give honor to that which deserves honor, but then also not give honor to those things that don't deserve honor. You can honor your parents and honor your father and your mother for having given birth to you, for having raised you, for having given you a name for all these things, but you do not have to honor them in the ways in which they are deviant. From what God is asking, you know. And so I think that that's probably the best way to look at it. And I know it's. It's tough, it's difficult to do that. But as you become an adult and you find your own space especially, and you've kind of find your own life, it's probably easier to. To do that where, you know, you. You don't have to be arrogant and disrespectful and hostile to your parents, but you also don't have to honor them in the things which don't deserve honor. That's how I see it. But I know that these things are difficult in the practice, so I don't want to make it sound like it's easy. So why does Christianity find it unnecessary to follow certain laws from the Old Testament? I usually hear that it is something with the destruction of the temple, which I get in terms of feast, sacrifices, and other things having to do with the temple. I don't quite understand that in terms of the Sabbath and sabbatical years, or not eating the fruit of a tree for the first three years and other things not necessarily pertaining to the temple. Perhaps it has something to do with the law being more than the individual commandments given. Either way, I'm clueless. So this is a really good question, and it's not a. It's not a super easy question to answer because in a certain manner, you would almost have to look at all the laws and each law and kind of look at why some laws are followed and why some laws aren't. There is a sense in Christianity that the law has been resolved, has been, let's say, has been brought together in Christ. And so all the laws of the Old Testament find their resolution in the person of Christ. And so that has an effect on the law. So, for example, one of the. So, for example, one of the things that I often tell people is the law about not making graven images, for example, is resolved in Christ because Christ is the image of God. And so we are given an image. And so in that way, the resolution of the law happens in the person of Christ. And it actually kind of flips the law because we are given an image, and then in that image, we celebrate the image that God has given us. And we celebrate the fact that we all participate in that image by that, by becoming the children of the new Adam. So that's a way in which the law is still there. It's not gone, but it has. It's kind of brought into Christ. There are other Laws, for example, the Sabbath, where we also understand to a certain extent the death of Christ as the resolution of the Sabbath. And so we see, if you look at the paschal, if you look at the paschal hymns, you have this whole sense that, that the, the day that Christ is in the tomb is the, the true Sabbath, that it is the resolution of the Sabbath, for example, right? That it is the holy Sabbath. And as Christians, we are asked to live in the eighth day, in the bringing together of the end and the beginning, the day of the Resurrection, the day after the cycle, which is also the beginning of a new eternal cycle. And so it's not that the Sabbath isn't there anymore, it's that it has been brought into Christ. And so you see that in a lot of the different laws. Now I'm not going to go into all the different laws, some of the more technical laws, those that are more to do with kind of ritual purity and all these things are also not followed as much because we are not Jews. We, we are the strangers. We are the, we are the, the impure that have been brought into Christ and made pure through Christ. And so we are not asked to be circumcised, right? We are not asked to participate in the circumcision rituals. And so those circumcision rituals have all. I, I call them circumcision rituals, but you could just call them rituals of purity. The idea of not mixing different things, the idea of, you know, or the idea that you can't eat certain foods, that certain foods are impure. You know, you have this, this moment in the, the Acts of the apostle where St. Peter is dreaming and he sees the cloth, sees this cloth come from the heavens and it unfolds in front of him. And on the cloth is all kinds of pure and impure meats. And he hears a voice which says, eat. And St. Peter says, I can't eat that food. I, I'm a Jew. I've. I've always followed the law. I can't, I can't eat these impure meats. And he hears again, you know, it happens again. He has a vision, I think three times. And by the third time he decides to eat. And that becomes an image of how now the outsiders, the, the, those who are not Jewish are meant to come together into the same space as the, the, the Jews. And so that also implies that we are allowed to eat also different meats that we don't have to eat. The, just the meats that are kosher, for example. So that is usually the argument which is given in or in, in terms of the law, but the law is still very useful. It's very useful to study the law. It is very useful to understand the different laws. I always like to go into the strangest laws and try to show how they are extremely meaningful and how they actually point towards Christ. So I hope that that answers that question. All right. So David, Flora says, have you considered doing live stream carving drawing sessions would be cool to your art come to life as it. To see your art come to life as it happened? Well, I've thought about it, but just not a very technical person. I just can't imagine setting up a camera in my workshop. And, and like even right now I don't, I don't even have the Internet at my workshop because it's at my house which is still. Which we. I still don't live in and there's no Internet there. And so, so it probably wouldn't work, but maybe one day, who knows, it's possible. So Keenan Cronin asked if you could give one piece of advice to all fellow Christians, what would it be? I mean, I would say that if I could give one bit of advice and I would say to. To see that Christ is everything that Christ is. Is that. That in Christ you find all the keys to the, all the, all the keys to the questions of. So joser 733 asks. Hello, Jonathan, could you give an interpretation of Tobit going blind via bird excrement? Man, to be honest, I've never thought about that. I've never really. I've never really pondered that question. I would have to think about it. I would have to think about it. I mean, I would say like at first glance, just like this, I would say that it probably has something to do with the mat. The way that St. Paul became blind, something about being blinded by heaven. But I, I would need to. I'm gonna need to, to think about it more and get back to you. All right, so see mange at two different levels of reality. And so St. George represents the killing of the dragon of St. George has something to do with. At the earthly level. It has something to do with the individual level in terms of the, the. In terms of slaying our, our demons, in terms of fighting our passions. All of that kind of stuff there there also has to do with the enemy. It's also an image and I know a lot of people feel uncomfortable with that, but it also is an image of a nation or a city or a state which is able to Subjugate an enemy which is bleeding them dry. There's also. It is also an image of that. And. And that's why a lot of people don't like the icon of St. George. But the image of St. Michael, then that is really the cosmic image of the city. Same pattern. It is really a cosmic image of. Of the heavens pinning down the. The chaotic potential, you know, that is below, you know, stopping it from its destructive. Its destructive capacity. And every time you have a. An image, let's say in scripture, I don't think it's talk about him being speared, but the. The image of. Of spearing a dragon is really important because there's something about pinning it down which is more than just killing it. Right? There's something about, you know, the chaotic waters. You can imagine, like a snake that's. That's kind of moving in the waters. And you pin it down, you know, you fix it, and you stop it from being the. The stop it from being subversive and chaotic. Right? You foreign. It's also. This is. Yeah, yeah. And it's also. This is also the idea of pinning down the serpent is. This is gonna. Is also related to putting the bronze serpent onto the pole. And it is also related to Christ being nailed to a cross. You know, when Christ is nailed to the cross, one of the things he's doing is. Is becoming the serpent, who. That is fixed to the. To the space becoming time, which is being fixed to space. That is also happening in the crucifixion. All right. All right, guys, so I'm gonna. I'm gonna go on like I told you. I'm gonna do one question per person who asked. So if your second question gets skipped, guys, sorry about that. I am going to now go into subscribestar. All right, so Nicola asks, what is the interplay of femininity and masculinity in Mary, the mother of God? She is the most holy of all saints, hence higher than all the church fathers in terms of heavenly hierarchy. But it is my understanding that feminine is subordinate to masculine in some way. She is clearly feminine in her relationship to Christianity, but what about her relationship to everyone else? And so this is something that I've talked about a few times, Nicola. The I. The way of understanding it, the idea is to understand that you can have. You. You can understand it as masculine, feminine, as a basic heaven and earth, right? So above and below. But you. That pattern. This is. When we talk about fractal patterns, that pattern reproduces itself at all the different levels of the hierarchy. And so at each level, the hierarchy is composed of a masculine and feminine aspect. So a little heaven and a little earth is at every level of, of the ontological hierarchy and at the, at the, at every level of the fractal structure, reality. Okay, okay, so you could subdivide all the different levels of reality into other different levels. And then again, in that, you also have this reproduction of this, of this, of this pattern. And so, and so the Mother of God is so. So, for example, if you think about the primordial heaven and primordial earth, a way to understand it is to understand heaven and earth as this primordial opposite and then everything in between. But another way to understand it is to also understand the primordial heaven and the primordial earth as, as above everything else. And so the Mother of God, she is feminine, but she is the highest feminine. She is the cosmic feminine, you could say. And so she is above us and she is higher than us on the hierarchy. And there is a version of the, of the hierarchy of something above you in the hierarchy which is feminine. And if you have a mother, you should understand that your mother was feminine and was also above you on the hierarchy the way that. That the masculine and feminine will. So you could say that. That with that which is feminine above you in the hierarchy, you could say to a certain extent that it plays a relatively masculine role in regards to you. And so, for example, a queen is, you know, has an authority similar to a king on your life. But there'll still be a distinction in the way in which those are enacted. You know, there'll still be a distinction between the manner in which a king acts and a manner in which his queen acts. You know, so hopefully that is. And, you know, we have to be careful, like, we have to also be careful not to think that there isn't an aspect of the feminine which is, you know, not which. That the feminine can't be a kind of tyrant or can't be a, you know, an extremely authoritarian figure. Of course. Of course that can happen. There is, you know, every. Everybody has experience. Not everybody, but several people will have experienced that in their own life with a teacher or with their own parents. You know, the tyrannical feminine figure is quite, quite possible. And it really comes about, you know, it comes about. My brother Matthew always talks about how when you. When you start with symbolism, you need to kind of master the basic categories. Right? You know, and. And that's totally fine. And you need to do it. You need to master. But as you continue to dive in. You see how you. Now you. Then you start to see the subtleties. You start to see how. How it's. It's actually very. In its simplicity. It. It. There's a subtlety which set. Which sets itself up, you know, and it. A good way of understanding it is like a very good wine, is that you. You. You start to discover the. The savors and the flavors. So sometimes when I try to talk to you guys, I, I always. I try to talk in a way that is understandable, but there is. As you dive in, you start to see how these things interplay with each other. All right? And so Christian Chad, our man, asks, hi, Jonathan. What effect do you think Machiavelli had on the ideas of leadership and Christianity? Can we ever reach the idea of a good, just king in a world of Machiavellian politics? Also, the last two videos were brilliant. Very good content. Keep it up. I mean, I think that Machiavelli was. I think Machiavelli was pointing out something which was already there. It's not like Machiavelli made up Machiavellian politics. I think that he was. He was making explicit something which was already there, you know, the difficulty of earthly power, the difficulty of earthly hierarchies. And so can we ever reach the idea of a good, just king? You know, I think it's possible. I think it's possible. I think it's difficult. And you see that in all of history. You see it in scripture. It's like, how many good kings were there in the Bible, really, you know, and how many good leaders were there in the Bible? And it's the same in history. You know, a lot of people complain about the. Of. About Christianity, about. About Byzantine emperors or popes and how corrupt and horrible they are. And the thing is, is that most of the time, it's not necessarily false. It's not false. The problem is when you think that. That you could do better or that you can decry the authority and then try to replace it. I think the real, the Christian way to do it is to decry the authority but then not try to replace it. And you see that in, you know, for example, figures like St. John Chrysostom, who. Who denounces the king for his immorality and then is killed. You see it the same, you know, with people like St. Maxwell the Confessor, who see that the emperor is wrong in their position and he denounces the emperor, but he doesn't try to take political power and remove the authority. And so that is the reality we live in. And so I believe that it is completely acceptable to criticize the authorities and remain submitted to them. That, I think, is the Christian way. A lot of people will disagree with me. I'm sure a bunch of Americans will disagree with me. But I'm Canadian and I have a queen. So, you know. All right. Okay. So. So XRD asks, hi, Jonathan, are you familiar with Camilo Paglia and any of her writings? If so, what's your general opinion of it? As an artist, sexual Persona really spoke to me. I think she, before Peterson, was the person that prepared me for thinking like yourself. Well, I haven't read a lot of Paglia. I've read some. I did a talk based on her, on her thinking. I did a talk called Sacred Art and Secular Terms where I use one of her papers to show the importance and the necessity of something like sacred art and that even someone like her is able to see it. I think that Camille Paglia, like Jordan Peterson, is someone that has kind of come out on the other side. That is, especially Camille Paglia. It's like she's gone through the 60s. She went through the whole counterculture thing. She went through everything. And now it's like she's come to the other side where she realizes that. That if she wants to be countercultural right now, the. The only way to do it really, is to encourage. Is to encourage something that looks like tradition. And I don't know if she would agree with me, and I don't know if she would see it that way, but it seems like that's what she's doing, maybe despite herself. And she seems to be sometimes advocating for a kind of traditional position, even if she's doing it because she wishes she had had something to rebel against. Because that's the problem right now is that there's nothing to rebel against. I mean, in terms of. For all those that wanted to break the taboos, like what taboos are left, really? There are no taboos left. So. All right. And so next question Samuel asks. Hey, Jonathan, hope you're well. Have you been listening to anything interesting recently? I got a lot of free time to expand my mind at the moment. Take care. To be honest, I have not been listening to a lot of stuff recently. I usually listen to a lot of podcasts and a lot of things. When I'm in the workshop and I'm working, then I tend to listen to stuff. But when I'm, you know, recently we're working on the blog. I was writing an article by the Way. For those who know Bishop Barron's work, I am publishing an article in his magazine in June. So in the Word on Fire in June, I will be having an article which talks about movies and narrative, the importance of living inside a narrative, and also, to a certain extent, I will also talk about my differences with Jordan Peterson. So if you are part of that group, I hope they make it public and they put on the website, but I don't know if they will. They might not. But. Sorry, Samuel, right now I'm not listening too much. All right, so let's, let's move on. I am going to go into Patreon. Here we go, guys, into Patreon. All right, so Dom Palermo asks. Greeting, Jonathan. My question is regarding the relevance of bodily integrity for the Christian. Considering an individual Christian feeling divided, facing the question of submission to a secular authority to take a compulsory shot under the skin given the spirit field, St. Paul explicitly calls Christians to be in submission to civil authorities. While it is also true that the early church defied civil orders when meeting in the catacombs meant maintaining their identity by gathering as a body of Christ given, we are called to be holy, live by faith, and to be obedient to Christ. What else might we consider in this dilemma? Is the, maintaining. Is maintaining the integrity of the body in context of secular authority an important value for the, for the Christian? All right, so you guys are bringing me into. You guys are bringing me into the, into the dark. The dark question. So, yes, we are called to submit to authority as Christians. We are called to submit to authority to the extent that the authority does not ask us something which is contrary to. To our submission to Christ. Right. We, we, the, the Christians were asked to sacrifice to the, to the Roman emperor or to burn incense for the Roman Emperor, and they refused to do that. And some of them were killed because of that. Some of them were burned at the stake, you know, burned at the stake. At the stake. Man, that was weird. No, they were, they were killed in the. Killed in the arena, mostly. But the question of what's going on right now with the idea of a mandatory vaccine, I think that we need to be very attentive to. To me, it's not, it's not as much the question of bodily integrity. And like Matthew has been really talking to me about this recently, and he, it. It's been preoccupying him quite a bit to the extent that he, he almost accepted to make a new video with me because he's been so preoccupied by that. You know, the. Both, both Himself and both him, himself and myself. We've talked about the question of the vaccine in our writings, in our videos about how it's an image of death turned against death and how it's an image of using death in order to fight off death. And so we have emphasized the positive aspect of the vaccine, but it is not only positive, there is also a negative aspect to vaccines, you know, because it is taking death into yourself. There is a negative aspect to it. It can be a negative aspect to it. Now it's not so much the question of bodily integrity which is a problem I think for us right now. I think the, the question that, the question we have right now is rather the question of the question of control. And the question of the problem that is happening is mostly the problem. 666 what I've talked about in my different videos. It's the problem of trying to account for everything and trying to account for the margin or using the margin to account for everything, using the exception to account for everything. And we talked about that in terms of the weird situation of, of the Apple CEO, you know, of, of these kind of weird hate speech laws and the way that they try to, to have all the marginal identities be included, you know, to a point where someone who just wants to be having integrity in that way, bodily integrity could be an image of it. The only person that is excluded is the one who wants to maintain integrity. And those that are, those are the ones, the only ones that are being excluded. And so anybody who wants to hold on to any identity, like any normal identity is dangerous of being pushed out, whereas all the marginal stuff is being brought in. And so the vaccine can also be an image of that as well, especially if it is tied to control and especially if it is tied to identification, you know. And so if, if there is a vaccine which you, if there is this idea that you have, you are given a vaccine and by this vaccine you are included in society and without the vaccine you are excluded from society. I think that that's the place where Christians have to really, really wonder whether or not this is, this is the right thing to do and whether or not this is, this is really approaching 666 symbolism in a manner that is, that's too, that's too hot to handle. So take it for what it is, guys. I don't know what's going to happen. So when things start to play out, you know, maybe I will have to, to, to be more explicit about that. But for now I would say just be attentive. You know, nobody is, nobody is forcing us to do anything for now that in terms of our bodily integrity. So we just need to, to be attentive and keep talking about it. So. All right, all right. So Dionysus asks. Hello, Jonathan, why is God the Father and the Holy Spirit inconsistently represented or emitted completely in the icon of the Last Judgment? If the Father is included, it. Sometimes, I sometimes see his hand above Christ while in other icons appears under this, it appears under the scale. The Holy Spirit is sometimes with the scale but usually absent. Why is that? Well, Dionysus, the reason, the reason why that is, is because the whole idea, for example, of representing God the Father is, is problematic. We have images of the Trinity, for example, the baptism image. And there are some iconographers, for example, who will, who refuse to represent the Holy Spirit as a dove outside of the, outside of the icon of the, of the baptism of Christ because the Holy Spirit is not incarnated as a dove. The Holy Spirit appeared as a dove. And, and so it's a, it's a contentious question in iconography. The appearance of God the Father is also very contentious. So you will find icons with God the Father fully represented, especially in, in later Russian icons, you'll find God the Father represented full on as a bearded old man, you know, above Christ or next to Christ. That happened. A lot of people talk about the, how Orthodox art became more Western, had more Western influence because until, until like the 14th century, I would say 15th century, 16th century, it starts to creep in at the, around the 14th century, but before that there really weren't any representations of God the Father. There are representations of Christ as the ancient of days. And then that image of Christ as the ancient of days slowly got morphed into an image of God the Father. But I would say most Orthodox today don't represent God the Father fully. And so yes, it is possible to represent the hand of God and it is possible to represent the, to represent the Holy Spirit as a dove. Sometimes Some, like I said, some iconographers don't feel, don't feel comfortable with that. And so that is why you'll probably see that it's not systematic and you can make an icon of the Last Judgment, which is not necessarily invoking the Trinity, you know, just like you can make, you know, because the Last Judgment at its basis is, is, it's, it's Christ who, who, who does the Last Judgment. And so if you look at earlier image or simpler images of the Last Judgment, it's just, you know, like I've Showed this image from, from Rome. Is it from Rome? No. Yes, it is from Rome, from St. Mary Major, where you have Christ and you have the sheep and the goats on each side, you know. And so that is a very simple image of the Last Judgment. You can have an image of the Last Judgment which is just Christ in glory. And then you can have more complicated images, whether it's flat where you, you are two tiers. And then you get it more and more elaborate, elaborate, elaborate. So you can see how in some images they might have wanted to include trinitarian reference, but it's not, it's not necessary. The elements of the Last Judgment icon are variable. It's not that they're variable in the sense that you can put in whatever you want. They're variable in the sense that you can have minimal versions and maximal versions, images that contain all the different elements and then you can compress it down to just a few elements if you need to. That's a better way to understand it. It's like I talked about in some talks recently that to a certain extent the image of Christ contains all of iconography in, in it, you know, and so in the icon of Christ is all about iconography and all the, the types and all the saints and all the different feasts are, are, is that says if you take the icon of Christ and you unfold it and you take out parts and you show us parts of that, of that icon. So, so, so it would be the same with the Last Judgment, I would think. All right, all right. So Christopher Cetera asks. Hello, Jonathan. I am interested in Christianity on artistic, literary and philosophical levels. I am fascinated by Christianity, but so far have not been compelled to become Christian on anything more than a Jordan Peterson level. I read Christian works in the same manner I read secular works. Are there any California Buddhist esque dangers of engaging with Christianity in this manner? Well, I don't know. I don't think, I don't think it's the same at all as the California Buddhas, because if my under, if your name is Christer Cetera, I imagine that you are not from another. Like you're not from India or from China or from, from a country that isn't traditionally Christian. You're probably your ancestors were Christian for the past 1500 years or whatever. And so it's not as if you're just. Yeah, it's not as if you're fascinated by, by the appeal of something strange and, and glittering which you don't understand. It's more that you want to rediscover your roots, and you want to rediscover that which your ancestors have given you, you know, and so I don't think it's the same. I would say that just, I would say that you don't have to force anything. I would say continue your interest, continue to read, continue to, to engage with Christian ideas. I would say ultimately it'd probably a good idea for you to, to participate in a Christian service, to attend liturgy. To participate in liturgy that sometimes can be more existentially attractive than just reading. And so to be in a service and to actively engage or to, to be part of, of something is different from just reading. So I would say that if you're wondering about that, I would say just try to drop into a church once in a while and participate in a service, because Christianity isn't just in the head. There's also, if you're interested in the artistic, literary ideas, liturgy, music is also part of it, space architecture, all of these things. So I would say to engage with that and just, you know, just take it one step at a time and see where it leads you. All right. So Jorge Fernandes asks, or is this a question? Not sure. He says, hi, Jonathan. I've been reading the book of Romans and I was shocked by Paul. This blew my mind. Romans 8, 35, 39. Who shall separate us from the love of Christ? Shall tribulation or distress or persecution or famine or nakedness or danger or sword? As it is written, for your sake, we are being killed all the day long. We are regarded as sheep to be slaughtered. No, in all these things we are more than conquerors through him who loved us. For I'm sure that neither death nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation will be able to separate us from the love of God in Christ Jesus our Lord. I, I, I also get chills every time I read that. So what do you think of the symbolism of this message? Thank you. I mean, that's it. That is, that's symbolism right there. That's, that's what symbolism is. Symbolism is that we exist by the love of God in Christ. That is, that is how the world exists. And so nothing can separate us from the love of God because it is the very manner by which we exist. It is the glue that holds the word world together. And the, the, and Christ as the incarnation, as the point where heaven and earth meet is the, the fulcrum, is the turning point, is the ax, axle of everything. And so with, and so we cannot be separated from that. You know, we, it is our very breath, it is that by which we exist. All right, so Christian Pennington asks. Hey, Jonathan, I'm a long time viewer, but first time questioner. I've recently done a little bit of research into Lilith and the story surrounding her. Could you give a brief overview of her symbolic role and how that may be relevant to the today? Thanks for all that you do. May the Lord continue to bless the work of your hands. All right, so I think I've talked about this before. First thing to say is that Lilith is not, is not Christian, it's not a Christian story, it's a Jewish, it's a Jewish legend, it's a Jewish story. And so you won't find talk of Lilith in the church fathers. But I, I do think that nonetheless, I think that there is something to ponder. There are some things we can understand in the story of Lilith, just like there are some things you can understand in a lot of extra biblical stories or extra, you know, or stories from other cultures or from other, or from other mythologies. The, the idea of Lilith and what she means has to do with that which was before the origin. And I've talked about this before. This is really a structure of, of social reality which is that the, you know, I, I usually talk about space and I talk about the idea of you have a center and a center of identity and then you have a hierarchy and then on the edge of the hierarchy then you have the borders and then you have a kind of mixture, hybrids. And then you have chaos on the outside and that chaos is full of monsters and giants and all these demons and all this stuff, all this dark stuff on the outside. So you can understand it that way, but you can also understand it as in time. And so you can also understand that you have an origin in time which defines you. Something that starts you. Okay, so the origin of your country, the founding of your country, the founding of anything, right? And so when you have a founding, everything which is based on that founding is coherent, right? It's connected to the founding. It has its origin in that beginning. And so because of that it lays itself out coherently. And it, and it has meaning and it's logical. It flows from the origin. Okay, something like that. But all that was there before the origin is not connected to the origin, right? To a certain extent it is, it is the potential out of which the origin has food like it. It's that which feeds thou, the new origin and the new Origin can reshape, restructure, re. You know, reorganize some of the stuff that they take from before and then put it forth in, in a coherent manner. Okay, but the, that which is before the origin is. It's chaos. It's chaos and it's dangerous. It. That's why, that's why, that's why all the neopagans are. That's why Neopaganism is being used to destroy Christianity. That's why Egyptian stuff is being used to destroy Christianity. That's why, you know, the, the, the more obscure, the less known, the better. The Minoans, you know, these, these, these snake print, these snake goddesses or they weren't probably, they weren't goddesses, but these snake dancers are all these like strange residues from ancient, ancient, ancient cultures. They are used to, to destroy that which. They are elements of chaos that are used to, to bash the, the origin of the world. And so that's what Lilith represents. Lilith is, is the wife before Eve. It's the wife before the wife that Adam had before humanity existed. Right? And so if you want to understand what that means in terms of story, it means that she is the one who gave birth to all the monsters. She's the one who gave gives birth to all the giants, to all the, you know, and, and you see the same story in the, in the story of the, the gods, say in the Greek God, the Pantheon before the Olympians. You have, that's, that's where you have all the Titans and all the monsters and all these, these, these monstrous giants with thousands of arms or whatever. The, the, the giants fighting the Titans and all this crazy stuff that happens before the Olympian gods is because they're, before they, they don't connect to the origin. They appear as monsters and they are monsters for all intents and purposes because there is no, you don't have an, you can't abstract yourself from, from your world. They are monsters. And so Lilith's children are the monsters. They're the demons. The, you know, the, the especially the monsters that are the monsters and kind of demons that are related to, to sexuality, you know, in the west. They did, it did kind of merge with, with Christianity. The idea of the succubi and incubi being the offspring of, of Lilith. Once again, it makes sense, you know that you have to understand it as. I hate when it gets into this stuff because I always feel like the rating of my talk just keeps getting higher. It's like, okay, so there's rated PG13 now. It's rated R. So where are we going here? But so, so imagine, for example, the idea of a. Of the idea of a succubus, right? The idea of a non consensual, let's say, relationship with a demon. You can understand it as a nightly emission if you want. It's. So your seed is being spread out in unconsciousness, not in. Not in the conscious world, not through your will, through something else, through some other mechanism is being taken from you. And that is. That is a. It's monstrous. It's. It's a dream. It's the dream world. It's the. It's a chaotic world. It's the world that. Where things don't make sense, where things transform into the other, you know, and so that's what, that's what Lilith and all this kind of stuff is, is also referring to on a. On an individual level. But there are not just individual levels of this. There's also social and cosmic levels of these kinds of things. All right, guys, like I said. Don't, don't. It's like if you're orthodox, this is not stuff you tell. You don't talk about Lilith to your kids because it's not part of the. It's not part of our tradition. It's something. It's something which is kind of on the outside. Like I said, you can think about it. It's. It can be useful, but it's not. It's not kosher in the Christian way. It's kosher because it's Jewish, but it's not. You know what I mean? All right, here we go. So Chase and Lindsay asked, hey, Jonathan. All right. In your brother's book, he uses Abraham as an example of a proper hosting of angels that lead to the birth of Isaac. As a counter example to this. To this. As a counter to this example, he uses the story of Manoah and his wife as an improper hosting of an angel that leads to the birth of Samson. Looking through both of the stories, I don't seem to find what exactly Manoah and his wife did wrong. Manoah does not seem to recognize that the angel is one of God at first, but eventually he does. So I presume that alone is significant enough to lead to the downfall of their son. In addition, is their significance that Samson is not compared to or identified as a Nephilim, despite his similarities to them, the product of an improper relationship with angels, raw power and strength, etc. Thank you for any insight into the story. Your videos on symbolism and principalities finally broke the last barrier that was keeping me back from grasping what a lot of these old stories were talking about. Well, thank you, Jason. That's very kind of you. So first thing I can say to Jason is you're looking in the right places, if you want to know. If you want to know where the, the, the. The. Let's say the deepest nuggets are in my brother's book. They're always in the footnotes. And so in the book, Matir in the footnote talks about how Manoah and his wife improperly hosted angels. Now, I think that you. One of the things you maybe didn't get right is that he doesn't say that they did something wrong. That's not really the point. He says that they were not accepted as proper hosts because what happens is Manoah offers food to the angel, but the angel refuses the food. Know, and this is the difference between Manoah and Abraham is that, excuse me, by giving, by giving food to the angels in the story of Abraham, he hosts angels. He becomes the proper host for angels, and that is what brings about his son. Now in this story, when he offers to give food to the angel, the angels refuse. And. And the angel says, you should offer. Give your offering up to the Lord. So take the food and then offering up to the Lord. And as they are offering the food up to the Lord, the angel disappears into the flame and goes up. And so it has something to do with, you know, I talked about this idea of the bird which comes down and picks something, you know, the predator bird which comes down and pick something up, you know, and there's something of that happening in that story. It's like the angel is. Is not. It's like you can imagine, like the, the feet of the angels are not let to touch the ground. The. The angel comes down but doesn't touch the ground. He. There's a separation which remains and the angel is taken up. And that is what makes Samson into more body than spirit, you know, Samson is more body than. Than spirit, you could say. And so when you ask your questions like that, you compare it to the Nephilim. You're right. You're totally right. This is, this is, this is the. The right questions to be asking. There are. There are some church fathers that talk about how Samson is one of the closest to Christ. And there's also. The biggest question is, the biggest question is asking why is Christ not seen like a Nephilim? That's the biggest question. It's like Samson as well. Samson is like a Prefiguration of Christ, because he's also. He's bringing things together and he's doing it in an improper way. And so he. That's why he's not. He's not Christ, of course, but he's bringing things together and it's kind of awkward. You know, he. He takes the door, you know, he takes the door of the city and brings it up to the top of the mountain. You know, he takes the margin, brings it up to the top of the mountain. You know, when I talk about things like the crown of thorns or I talk about this type of imagery that Christ engages with, this is something that you see in the story of Samson. He. He marries the foreign woman, you know, just like Christ marries or, you know, gives the image, gives the story of him marrying the Samaritan woman in the. In. In his story. And also Samson, He. He. He finds the honey in the impure right. He. He finds wisdom in the dead carcass of the lion. And so, right. That is Christianity. That's what Christianity is. Christianity is finding the fish in the fish in the deep, is finding wisdom in these dead, you know, foreign nations. That is what Christianity is. And so Samson comes really close. And so in a way, there is a. Something of a relationship with something like the. The nephilim to a certain extent. And so once you understand that that's one of the problems being posed, you can also understand all the fourth century of Christianity. This is the key to the fourth century, if you want to understand why the church fathers just fought so much to talk about the nature of Christ and that the fact that he is fully man, fully God. Two natures, you know, unmixed, fully united, fully separate without being mixed. You know, all this type of language where they want to show that Christ has two natures which are fully united in his person but are not confused. That is them trying to help us understand why Christ is not a. Is not a giant, why Christ is not the mixture of heaven and earth. He's not the mixture. He's the full, complete union which preserves also its separateness at the same time. That's the difference between synthesis and confusion. And this is something seriously, the. The difference between synthesis and confusion. If people could just understand that right now, the difference between. Between synthesis and confusion, so much. So much of our problems would. Would fly apart, like, Would just vanish. When you see someone who talks about Christ as being the first, you know, kind of transsexual person because he. He transcends male and female. He joins them together in his Person that's. That is not seeing the difference between transcendence and confusion, or synthesis and confusion. All right, here we go. So Vanessa asks, what is the symbolism of the addiction people develop with tattoos, piercings, and plastic surgery? Once they start, it seems to change people's judgments about their appearance, and they can't stop adding or fixing. Do you think it's just a common disorder or linked to a greater pattern? I mean, I think that for sure there's something to do with. With a passion. You know, all our passions can take. Take. Because not everybody is addicted to that. You know, some people get a tattoo and then that's it. Some people get a piercing and that's it. But there are people that get into it extremely. And I think it's probably no different from any passion. You know, the thing that would lead you to get a tattoo. Sorry for those who have tattoos, but usually would be some kind of a passion of some kind. You know, and the same with piercings. It's like a desire for vanity, a desire to. A desire for vanity. A desire to. To. To appear in front of what you. To. To stand out, you know, for your strangeness or whatever. But, you know, just like someone can. Can have a beer and then another person becomes an alcoholic. I think it's. It's no different. I think it's just a passion. You know, someone becoming possessed by a passion and then being completely taken over. All right, so Sander Cooter asks, isn't Satan as accuser, the gap between being and doing? Unactualized potential, then the complement of Christ crowned by meta time? Is Satan bound by meta space, bound by the logic of remaining potential? Not sure I totally understand your question, Sander, but what I do see, let's say in terms of when you said Satan bound by meta space, I would wonder if that has. There. There is an image of Satan bound in Christianity, and you see that in the icon of. The icon of the Resurrection, the icon of the descent into Hades. Sometimes you see Satan and Hades being bound by angels or just being bound under the. The feet of Christ. But I'm not sure I totally understand it, what you mean. All right, so Norm golden asks, you speak often of Christ flipping things around or enacting an inversion, such as the crown of thorns turning death into glory. Would this be part of Christ as master of unity and multiplicity are trying to bring everything back together? Yes, that's what I think it is. I think it really is trying to bring everything back together. And this is the mystery of non. Duality you know, the idea that if we believe that the world at that ultimate reality, that God is non, dual ultimately and that there. And that everything is good, that everything is good if it is in its proper place and if it is in its proper direction, if it is directed properly and if it is in its proper place and everything is good, there's nothing that is in itself bad. Evil is always a, a improper attribution of something in, in, in the wrong place, in the wrong direction. And so that is, that is. So my contention has really been that, that death and glory is made of the same stuff. You could say that that which was glory became death and that which is death can be changed into glory. And so that solves the problem of, of death. And it's really hard to think about this, but it, you know, there's something, there's something interesting, you know, when you look at. Sorry about all the neopagans who are watching this. I keep going after you guys, you know, just because it's just the thing that's on the horizon right now. I can see these neopagans kind of coming in the, in the, in the distance. So, so for example, one of the accusations that the neopagans have of Christianity is that it's, it somehow fetishizes death, right? That it's weakness because we, we accept death and that their metaphysics, their vision of reality is, is strength. You know, it's boldness, it's this kind of will, will over the world, all of this type of attitude. But see, the problem is that you're gonna die. That's the problem is that you're all gonna die. So, so how do you deal with that? You have to deal with death. And if you only see death as a tragic undoing of all that you've built, if you only see death as a tragic, as a sad, tragic end to a life of strength and will and imposing yourself on the world, then you lose. You lose. That's how reality ends. Reality ends that you lose. And so what Christianity does is that it says we're going to deal with death, we're going to take it seriously. Dude, you're gonna die. So what is death? What is it? Why is it part of reality? Or, or what, what can it do? What can it do for us? And that in that you find the Christian answer, which is that in the willing acceptance of death, you transcend yourself. And, and that death is transformed into something more. Right? So, yeah, that's how I see it. All right, let's keep going. All right, so Herman Smith says. Hello, Jonathan. Christ is risen. Indeed, he has risen. I knew. So I apologize if this has been asked before. I'm noticing an interesting pattern for initiates in. Initiates into orthodoxy. In the exorcism, we spit, send out water of our bodies on Satan. In baptism, we are submerged in water that has been blessed. At Christmas, we are sealed with oil which does not mix with water, so that we are essentially waterproof, keeping the symbolism of water as death, chaos. Am I seeing this in the right way? Yeah, I would say that you're seeing part of it, you're seeing half of it. I talked about this before, that there's two. There's two. There are two waters. There's a water above, there's a water below. In the, In. In scripture, at the beginning of Genesis, God separates the waters. So at first there's the earth is. Is watery, and then he separates the waters. There's the waters which goes above the heavens, and then there's this water which is below. And so you can understand it as a. As a kind of potentiality. I always talk about how the margin goes low and goes high at the same time. This is also the. Related to the death and glory problem, which is that that death goes lower, but it also brings you higher. And the waters go lower, but they also go higher. And so in the, in. In our tradition, in the symbolism, you have the water below, which usually represents exactly what you said, which usually represents death, a kind of cleansing of death. But there's also water which comes from above, and that is usually seen as a blessing. And so water which comes from above in terms of. In terms of blessing, you know, when they, they. They sprinkle, blessing, blessed water, rain. And also in, for example, in Catholic baptism, they tend to emphasize mostly the idea of water from above. And so they take the water, bring it up, and then pour it down on the person. They make that gesture, bring the water up and then pouring it down. And in Orthodoxy, we have that a little bit not as much the idea that it has to be. It's supposed to be active water, it's supposed to be moving water. And so, you know, like some priests will. Will make a wave even in the, in the, the baptismal font. To have this kind of moving water depends on the different things. And so you really have these two poles. So it's not just death and chaos, but it's also kind of higher potential, you could say, or something which. That which is above, which comes down as water. So hopefully that helps. And it Just maybe it just confused you more. It's also possible. Okay, so Angel Terpstra asked, you have talked frequently on the vessel that's container, the ark of Noah, the ark in the tabernacle. It seems to highlight the vessel as a place of protection in order to prevent amalgamation with the outside. But it might also be a place of transformation. This is highlighted in Jung's psychological interpretation of medieval alchemical symbols. Typically, these manuscripts would portray a vessel between polarities, the sun and the moon. According to Jung, the health fire underneath the vessel will get would give rise to a new symbol which functions as a balanced answer between the polarity. I was wondering if there is Christian symbolism on the vessel transformation and polarity. I've noticed that Christ on the cross is frequently portrayed with the symbol sun and the moon, but maybe this means something completely different. Well, for sure, in terms of Christ on the cross, it's not, it's. It's not just that he represents that which is between polarities. He also represents the origin of duality, the origin of. Of everything. And so you're right that in a way you will see Christ representing the cross and having the two sides, the left and the right hand, the sun and the moon, the good and the bad thief, you have these different sides and Christ is in the center and represents the axis of the world, that which. Which is then separated into two. And so he joins the whole world together. He brings everything together, and he is the origin of everything at the same time. Now, in terms of the vessel as the place of transformation, I mean, I think that that is not strange. And you know, in terms of the idea of, of the womb, in terms of the idea of the earth, you know, as the place of, of life and of change and all of this, you know, and that the earth as a vessel, you could say, is the mediation, is the place where the influence of the opposites are being played out, you know, and so I don't. I don't find that odd at all. I don't think it's weird. I mean, I don't know, it's probably not phrased in the same way that Jung would phrase it, but I think that it's definitely, it's definitely there. And I don't know enough about alchemical symbolism to be honest, to be able to comment on the other part. All right, so Mark Peters asks. A general social observation about past fashions is that they come back to later generations as something new. But they don't all come back, at least not to the general public. And conversely, Something seems, something seem completely bizarre and novel, such as young men wearing big pants 12 inches below their waistline. What is the symbolic meaning of this? And I wonder if anyone has ever done a study on the return of fashions and how these fashion statements map onto the social dynamics of the period. Thanks. I don't know. I, I don't know. In terms of, of, in terms of how they map onto social dynamics, there's probably something there. It seems that one of the reasons why fashions are being recycled, especially today, there's something also about nostalgia in the, in the way that fashions are being recycled. Because the idea is that we do function with patterns. We do, we do function with, with cycles. We, we all, that's how it works. You know, days, months, years. Our world is made of cycles. And so I think that fashion in the past was often confused with progress. You know, this idea that these new things that come about, they're just an image of progress. But I think that by now we've actually kind of seen, or especially with postmodernism, maybe we've also accepted the reality which is that they cycle and that there, there's this cycle. We've accepted it in a way that is also feeding the market. And so one of the things that we're seeing is that fashions are coming back to the children of the parents. And so, for example, like when I was a teenager, all of a sudden we were, we were all wearing, you know, 70s stuff, bell bottoms, and we, we'd go and try to hunt for all this old stuff. And so now my kids, you know, my 12 year old girl is wearing weird stuff from the 80s, which, it's like you never thought it would come back. But you can see that also in movies and in culture where, you know, it's like I, when I was a kid, we played with Transformers. And now when I became an adult, all of a sudden these Transformers movies come out again. Same with Marvel Comics. You know, when we were kids, we would read Marvel Comics and then as adults now our kids watch the movies. So it's like this weird cycle of fashion where, you know, it's also to maximize their profits so that I can also enjoy the same thing as my kid is enjoying. But I mean, it's, it's just, it's, it's inevitable that the world will manifest itself in patterns, that's for sure. All right, so, so Oliver Erickson asked, how good of an understanding of symbolism do you feel like you have? I've watched you for about a year and I feel I've only gotten started. But you have been thinking this way a lot longer. How deep does it get? I mean, I don't. I don't. I think it gets a lot deeper than what I understand, that's for sure. I think that I. I have a certain level of understanding, but I can peek and I can see that there's way more that the well goes a lot deeper than what I can perceive. And so I don't know if I can measure that, but for sure, I know that. I think that. I think that in terms of my own understanding of symbols, I feel. Always feel the same, like I'm just starting, you know, and then I get hit with some. Some insight or something about a story that I. I didn't notice, you know, so. So, yeah, and it's fun. It's a. It's a great road to be on. So welcome aboard. All right, so JD Asks, are the waters of the creation story the same as the waters from the flood? Noah. They are analogous. They're not exactly the same. You can understand them at, like, a different level. You could say that the. The waters in creation story are like the ultimate waters, the cosmic waters. Whereas the. The. The story, the. The waters and the. The flood story are, let's say, at a level down in terms of their implication. And so. But they are similar, and they are very similar because the waters come from above and from below and they join together, right? There's rain and there's water coming from. From below. We always think of just the rain for some reason. There's also water coming from. From below, and they join together and they create this. This chaos, this kind of return to primordial chaos. And so your insight is quite good. All right. So Lord Marduk. Wow, Lord Marduk is asking me questions. So a question about the ending of the novel, Loras, and any more thoughts you have on the novel and how it compares to our current situation. Spoiler alert. Okay. At the end of the novel, they dragged his body through the field after his tribute services. I imagine it was a way to heal the land. And the outsider observing it was a stranger was a strange thing to do. Observing it was a strange thing to do. Is there a particular ritual in Russian folktales or religion that points to dragging his body through the field? There is a plague during the time of the novel. It has to do that. In this, in the lore story, it really does have to do with the. The problem of the holy fool. It has to do with the problem of the. The person who wants to kind of evacuate himself into the world. And so the, you can understand that scene as it's a desecration of his body. He wants his body to be desecrated. And you would say, why would he want his body to be desecrated? And this is where the extremes meet. This is where this is at least I think this is the desire to be shown in the, in the book. This is where the extremes meet. This is where the Christian martyr who is desecrated. The Christian martyrs are always desecrated, right? Their bodies, their bodies are always, are always, are always desecrated. And that desecration ends up to their glory. It doesn't mean that desecration is good. Most people should not have their body desecrated. Most people should be, should be properly buried. And in the novel he talks about that problem too because he, he cries because his, the, this, the lover he has at the beginning of the book that she is, is not. Because she's not going to be properly buried. And so he has this kind of anguish about that at the beginning. But that's the, the idea is that in his case, at least that's the way I understand it, he is going to the end of his, to his holy fool Persona and he is asking for his body to be desecrated and that is to his, to his highest glory. But it's, it's like I said, it's dangerous stuff, man. It's dangerous stuff because you, you have to be able to tell the difference between what the holy fool does and a masochist. Those two things are not the same. Right? A masochist who, who, who wants to be humiliated for his own pleasure is not the same as a saint who is desecrated to his glory. And, and I know that it's, it's tricky because we, we see confusion about that in, in popular culture, there is some confusion about that. But those two things are, in a way, they're opposites. They're not, they're just not the same at all. So, so, yeah, so. Wow. That was the, that was the last question, guys. And so it went an hour and a half. An hour and a half is pretty much like the time that I feel that these should go, if I can help it. And so I think I see that I, in looking at the chat, I think that I, I think that I disabled the super chat by starting this new, this new feed. Okay, so now I see that some super chats are sent into the other chat. So let's look at those. So sorry about the Chaos. Guys, I didn't mean to, I didn't mean to put you in. So, so some people in the original chat put out some super chats because I, in starting this new stream, I guess I didn't, I didn't know that I had to, to put in some, some, some. I had to change the, the, the parameters or whatever. I don't know what I'm doing. You guys are seeing the limits of my capacities constantly with these live streams things. All right, okay, so I'm gonna just go. What I'm gonna do is I'm gonna go into my own. So I should see the super chats here. All right, okay, so I see a bunch of super chats in, in my thing. All right, so. Okay, so Brad's pit is back with a super chat and he asked not to catastrophize, but do you think Christians should prepare for flips similar to the anticipation for the end of the world? I've really only heard Roger talk about this legitimately. Yeah, there are flips happening all the time right now. I think anybody who's paying attention is noticing how insane the political narratives are becoming and how conservatives are becoming or acting like we used to think liberals are acting. Liberals are acting the way we used to think conservatives would act. And you know, and so it's, it's crazy. Even when this whole pandemic thing is really hilarious and a lot of people, I pointed out to it about how, you know, the right wing people are the ones who want to open up everything and the left wing people are the ones who want to keep everything closed down and want everything to remain shut down. And so we need to really prepare not only for the flip, but for a little while. It's not, it's going to be crazy. It's going to be kind of like it's going to be, it's going to look like a ping pong table. We're going to see things flip back and forth and there's going to be just madness. You know, I think I told you guys that you need to get ready for 2020. I didn't expect this to happen, but I knew that this year was going to be mad. It's not over, man. There's an election in the US this year. It's going to be crazy. This year is not done because being insane, you're not done seeing madness this year. And we're also starting to see, you know, once, once, a few times I joked, I said, I never thought the end of the world would be so funny. And, and I always knew even when I said that, that it's not going to be like that the whole time. So just get ready for the worst, guys. All right, here we go. So common sense culture asks, I have a few years experience with woodworking, and I'm drawn to icon carving. I'm orthodox. Can you recommend a process, timeline and learning resources to get there? So, I mean, there isn't an official way to do it. You know, we have, like, I give workshops. You can also learn to paint icons. Just to learn to draw, you need to learn to draw. And so if you can't draw, you're going to struggle to be an iconographer. So you could take icon painting classes or icon drawing classes in order to kind of get drawing. And you can practice carving on the side. Like, you can practice carving other things. You can take carving classes of other types of carving classes that you can find in your local, you know, in your local town or whatever. But learn to draw icons and then slowly try to merge that together. And I always tell people, like, if you send me pictures, if you start carving icons and you send me pictures by email, I will. I will comment. You know, it might take a few weeks before I answer email, but I will. I will. I will answer if you send me carving pictures. So. All right, so cabal for $10 says my prayers go out to you and your family. Thank you. Question, other than being monsters and on the edge, is there any other relationship between the giants begotten by The Watchers and St. Christopher? Well, yeah, in the sense that one of the things you could understand St. Christopher as is the ultimate possibility of the edge, right. To understand how these aspects of the world can be saved in Christ. That's really the idea now in terms of the terms of the story of St. Christopher. He is. He is through his name, through. Not through his origin, which is that he's a. In some of the legends, they say that he's a Canaanite. The fact that he's a. He's a Canaanite is. Is trying to link him directly to the. To the giants, like through. Through genealogy. To a certain extent. It's a. It's a fantastical genealogy. But. But by calling him a Canaanite, they are trying to link him to the giants that, you know, like Og and all these giants that the Jews, that the Israelites encountered when they came back to the promised land. And those. Those giants are seen as remainders from the flood in tradition. So there is a direct relationship in terms of what people, how people would have understood Christopher to have been. So Andrew Johnson asked, what is the meaning of the young George Washington throwing a coin across the Potomac River? I. Andre, I have to tell you that as a Canadian, I've never heard that story. So I don't even know what it refers to. I'm sorry. People are gonna get mad at me. I would have to. I would have to to. To know what. What it's about. George Washington, he threw a silver dollar across the Rappanok River. Is it possible to skip a coin or flat rocket? I have no idea. Sorry, dude. I wish I could give you more on that, but I do not know. So. All right, guys, I think. I think. I think we're done. I think we're. Last one. Leroy Plank, what are your thoughts on the sacred secretion or the Christ Oil? Is this new age nonsense or do you think the symbology can have meaning for followers of Christ? I don't know what that is. Sacred secretion. Sacred secretion. What is this? It seems when I look at the. When I look at the. The books that talk about this, it looks. It looks pretty new Age to me. But I don't know what it is, so I don't want to speak out of turns there. All right, everybody, thank you for showing up once again. Christ is risen. I wish you all, you know, all the best in this very strange time. I would say, as I always say, just pay attention. Keep paying attention to what's going on. Don't let your, don't let your attention drop. Not right now. There's a lot of stuff going on and we need to. To. To try to see what it is that's happening in terms of patterns and in terms of how we can participate or should not participate in the pattern. So I want to say thanks to my moderators, as usual, all the folks that I like to see in, in the chat. Thanks for your work and I will see you next month, guys. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
