{"episode_id":"SW - #394 - 2025-05-23 - The World War II Consensus is Breaking Down","start":0.16,"end":61.01,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #394 - 2025-05-23 - The World War II Consensus is Breaking Down","start":72.45,"end":2299.74,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So several years ago I coined this frame watch the fool. And you know the purpose of saying that, I think I said that in 2017 maybe, or maybe 2018, I'm not sure. And so when I started saying that, what I wanted people to be able to do is to watch the fool in especially in a world that was top determine upside down. Because this is a way that my brother Matthew frames it is that when the world is upside down, the fool is the one that in some ways can give you a sign of what is coming, can in some ways restore the world. You know, restore the world right side up. Now when you say right side up, it doesn't mean it's not a question of morals, it's a question of a return to order. Right. How in some ways the, the madness of the moment in the the fool is kind of joking and turning and at the end he becomes a. He becomes a victim of his own ploy and then he kind of almost inadvertently restores things in the right side up. Okay, so I started saying that a while ago in 2019 when I saw that I think it was 2018 or 2019 when a certain Kanye west put out an album called Jesus is King. I kind of could tell. And I've been telling people to watch this particular album person because he has a weird, he's like a weird tuning fork. He's he. Someone who catches what is coming. He's a kind of inadvertent mystic, you could say. He's able to. I don't think he does it on purpose, but he kind of is able to sense what is happening and. And sense what is coming in the future and is manifesting it usually in a rather contradictory way, but nonetheless, this is how his life seems to proceed. It doesn't seem to always be good for his own soul, but, you know, if you watch him, you can kind of see what's coming. And so, you know, in 2018, 2019, he put out this album, Jesus is King, and he kind of converted to Christianity for a short time, I guess. And you could know by watching that to see that there were some things happening. And it kind of foretold or showed us that there would be a resurgence of Christianity, which happened during COVID and has been happening ever since. And so we've kind of seen the growth of the traditional churches, especially Orthodox Church and the Catholic Church. I think it's happening in kind of more traditional Protestant churches as well. But, you know, although the. You could say the general statistics is still of decline of participation in the church, there's a counter move, which is that young people are. Are coming back and young people are coming into the church in droves. Right. My church is bursting at the seams with new converts. This is happening all over America. And so he, despite himself, was able to kind of perceive that in his. In his move. And so now he's gone in a. In a whole other direction for, I think, a year now. I don't follow him that closely anymore because it's a little scary. He has even more than a year now. He's kind of started to manifest a kind of Nazi fetish where he is bringing back all that imagery, bringing back the swastika and it's, you know, and is bringing back Nazi imagery. He's also is bringing back kind of KKK imagery and this kind of weird imagery. But as usual, he's doing it in a absolutely contradictory way. In some ways, I. I keep thinking that Kanye west is. Is 4chan's final form, or maybe like Pepe's final form, because he is doing it, and people can't see the contradiction, which is kind of funny in the same way that people can see the contradiction in Pepe. They only see the side that they want to see. They only see the side that is kind of sailing to them, and they can't see that they it's always proposed as a contradiction. His latest song, which I won't even say the words because it's a, you know, it's like you can look it up. It's a song that, that, let's say, calls upon a, A, a certain German chancellor. But the song, in the song, the, the, the, the way the song goes is that he uses a racial slur against black people, like calling black people to recognize the German chancellor. And so everybody is saying, don't you see that Hitler would have hated black people? And it's like, you don't understand. You don't understand the contradiction. You can't see that everything about this man manifested itself in a contradiction. And like I said, not to the benefit of his soul. It feels like he's being ripped apart. But if you watch, you can kind of see that this is happening. And it's happening in conjunction with a whole lot of other things that are showing us what is coming, that are showing us what is happening to us. And, you know, I didn't really want to make this video, but it feels like things are becoming so confused. People are so confused to watch what's going on that they are struggling to understand. And so I guess we have to talk about it. This is it, folks. This might just be the culmination of my life's work. Join me for the symbolism masterclass this April 2025. During this course, I'll take you by the hand into the essentials and depth of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way, I'll teach you everything about how I think, so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace, the being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class, we will talk about so many things. About heaven and earth, the sacred and the secular, the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years, and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals. Plus getting some hidden gems that I've never shared before. So don't miss out on the live experience and register today what is happening. So this has been going on for a little while in little doses, but now things are kind of getting bigger and bigger, and it's inevitable. You know, all worlds are based on a kind of sacred origin. Every world has a kind of foundation and a foundation myth on which it is based. That foundation myth, what it does is it casts the light on the world. It kind of structures the world. It gives you a frame, tells you who the good guys are, tells you who the bad guys are, you know, tells you what's important. Also frames space, right? Kind of stabilizes space for a while. And our world is based on World War II. And I think I don't have to explain that. Everybody kind of knows our geopolitical world is based on World War II. The way that we understand ourselves is based on World War II. The hierarchy of values that we have is based on World War II. All of this, right? World War II is a kind of foundation myth for our world today. Now, it played an important role in kind of holding us together. It had its heroes, it had its. Its. You could say its principalities. And it had its enemies, it had its devils, and it held the world and created prosperity for quite a long time. It kind of stabilized things. Now, the thing about foundation myths, or you could say small foundation myths, is that there's always. There's always a sin that's hidden in the foundation myth. There's always something. There's always something because the world, the small worlds that we participate in, right, These small stories that we participate in, they're not the full thing. They're not the full world in order to be coherent, they can't be complete. And so because of that, they have to push things into the margins and that. To push things outside, you could say, so that they become blind spots and they become kind of monsters hiding in the corners that we try to push back, we try to ignore, we try to fight, but we nonetheless have to do that. And I want to be careful that you understand that this is inevitable. Like, this is something that all worlds do. There is no way around it. And this is something that we did at the end of World War II. And so World War II presents itself as a kind of victory of good over evil, as an establishing of a kind of world peace that is going to last. But it also has a kind of secret. And if you think about it, you know, the secret. You know, when you. When you grew up, you were told, we won World War II, we beat the bad guys. You know, it was a moment of victory of good over evil, and that's that, Right? And it established. It established the world. It established the world moving towards democracy and moving towards a kind of, you know, a global vision of peace and all of that. Right? It's in the wake of World War II that we coined the end of history idea that that now history is over and that the tensions of history are over. Of course, that's all impossible. There's. We're not going to reach the end of history, at least not because of World War II. And World War II, in order to hold the stability of things together, had in it a kind of dark secret, right? And the dark secret is that who won World War II? Did the good guys win World War II? The reality of the war is that we, in order to beat a very, very bad person and a very, very bad thing that was happening in Germany and that was spreading across the world and could have, let's say, brought the world into a form of tyranny, we had to ally ourselves with a tyrant, with a horrible person in order to do that. And then what we did is we handed half of Europe to that evil person. And the level of torture and of, you know, people being imprisoned, whether it's in Romania or in the Gulag or, you know, in all of these communist countries, is horrible. The stories are absolutely horrible. And so, you know, we kind of, in the general parlance, we tend to hide that aspect of the story in order to establish order. And so I want to be careful. I want to. I want to be careful and does not say that there's necessarily an. It's necessarily of ill intent that we hide that, but it is almost necessary in order to establish a kind of order. And so you have a good guy and a bad guy, and, you know, and for all intents and purposes, the bad guy is Hitler, and Hitler is a devil. Like Hitler is the devil of our world. Those two words are interchangeable. You know, you call. If you want to say that someone is the worst thing in the world. That's what you do. You call them Hitler. That's how you characterize it. It's even worse than calling someone the devil. Actually calling someone Hitler is worse than calling them a devil. That's how much Hitler has become the devil for our current world. And, you know, but there's an issue, right? It's. It's that you could say it this way, is that this story, this myth, it has an expiration date, right? It can hold the world together for a certain amount of time, but at some point it will stop holding the world together. Now, the question is, you know, that expiration date. We don't know when it is, but the countdown to that expiration date started at the end of World War II. And there's no way for World War II to hold the narrative of the world together forever. And you understand that, whether you. Whatever you think, I hope you can understand that it is impossible for that story to kind of be the narrative, let's say, the narrative underlying pattern of reality forever. And it is also impossible for Hitler to remain the devil of the world forever. Because although he is a horrible, evil person, you know, he cannot be. He is not worse than the devil. He is much less worse than the devil. And he cannot play that role of being worse than the devil and being the devil forever. And so there was a time when that would expire. And so anybody who knows how stories function and anybody who knows how stories kind of capture the worlds and run through them, you know, knew or knows that at some point that will. That structure is going to. Is going to come apart and some new structure or a new story will establish itself. I have intuited this a very long time ago, a very, very long time ago, and I have said many times, I might even have said it on a video, I've said it in private, is that when the last people that were alive during World War II die, the memory, you could call it the memory of that story will start to fade. And that will have major consequences on our world because the story holding the world together is indistinguishable from memory. That is, if we remember the story, then that story has a hold on us. But if we forget the story or the reason for the story, you could say then at some point, the story starts to break down. And you could say that what we're seeing happening now all over around us is the breakdown of the World War II consensus. It's the breakdown of the hold that that story has upon us. And it's something which. It's not even a moral question, folks. It's just something that at some point was going to happen. The question is when it was going to happen. And we can see it kind of happening now. And it's happening in all kinds of guises. It's happening at all these different levels. It's happening in terms of the way that we view ourselves. It's happening in the way that politics is playing out in the geopolitical vision of the map, even. And how. And what are the axes that are holding things together? What are the alliances that are holding the world together? All of these are shaking right now, and people are kind of playing through this breakdown. There are, of course, people that are going to try to save it, but the problem is that in trying to save it, you can extend it for a little while, but there is a time in which it's going to fail you. Because the story of World War II is not sufficient to hold the world together. Because all sacred stories have taboos. They have sacred places. They have, you know, certain things that you're not allowed to touch, you know, because if you touch them, you make everything shake. And that is what's happening now, right? The entire. The entire story of the whole Douglas Murray and Joe Rogan discussions, the Daryl Cooper situation, the Tucker Carlson situation, the crisis king question. Everything is kind of shaking that story, you know, and one of the things that we notice, and it's important to notice it, to kind of understand also why things are shaking the way they are, is because. Because of the taboo of the end of the war. Because it created a taboo and it created a kind of secret. You could say that the secret, it's not a secret, but the deal that we made with Stalin in order to win World War II created a pattern, created a form that led the world. What do I mean by that? Which is. It means that, you know, my friend, you've heard my friend Jordan Peterson, I've heard him several times when, you know, saying, why do Communists get a pass in the West? Why is it that, you know, the fascists and the Nazis are. Are the devil and. And absolute evil, and you can't invoke any of their imagery. And not only can you not invoke any of their imagery, but if anyone is able to link anything you say through 1, 2, 3, 4 steps, as many steps as you need it, to fascism or to Nazi imagery, even if it's not directly, even if it's like this person met this person, person, therefore, you can't. This first person he talked about, you can't mention them because they knew someone who knew someone who knew someone who was a Nazi. It's like, why is it that strong and the communists get a total pass? Why is it that the communists their, their intellectuals fill the universities? Why is it that, you know, even in terms of imagery, think about the trucker protest in Canada was a great example. You know, in the actual trucker protest, someone came to the protest and brought a Nazi flag. And the person, it seems like the person was actually some kind of fed, was actually a policeman or some kind of infiltrator that was there to bring that flag into the protest so that the media could talk about it non stop every day until the end of the protest. And even though the people in the protest like told him to leave, you know, got angry with this person and, and he finally had to leave because people around the him were getting aggressive about him holding that flag. It doesn't matter. The simple touching, like the infection of being connected to that imagery was enough so that the main story that the media went with was saying they're all Nazis, right? But in the counter protest of the trucker protest, they had communist flags all around. They had literal communist flags. In the counter protest, even though the communists killed way more people than the Nazis killed, that the Gulag slaughtered more people that the Communists. Although whether it's, if you join them all together, especially the Chinese, the Russians, the Vietnamese, the, you know, the Cambodians, like all of, in Romania, in all the countries, if you bring it together, their level of sustained slaughter was much worse than the Nazis. Now obviously I'm not defending the Nazis, I'm not saying the Nazis are not as bad or whatever. That's not the point. The point is to see that why is it that that side is completely available, but the other side, if you even touch, if you're even touched by their imagery, you are completely destroyed. And that's because of the secret. It's because the secret of World War II, it's because we made deal with Stalin in order to beat the Nazis. And because of that there's a kind of taboo and there's a pass for the, for our, for our allies. And it just happens. It's not, it's not even anybody doing it on purpose. It just happens through natural narrative causes, you could say. And so we have this problem, right? And everybody has kind of experienced this problem, you know, which is that identity itself, as the time went on, identity itself, whether it's gender identity in terms of normal gender Identity, whether it's national identity, whether it's ethnic identity, any kind of tribal identity, right, Is in danger of being called the Nazi. Like that's, that's how bad it was. And we've seen a kind of encroaching. Anybody who lives in the south of the United States will have seen this. One of the things that happened is that, for example, every image of the south of the United States is now equivalent to racism. And so no matter what it is, the, the Confederate flag, Confederate images, Confederate characters, you know, all of these characters because they are 1, 2, 3, 4, 5, 6, 7 steps removed from the, from the sin of World War II. Like the, the idea of how in the end, what happened in World War II was an excess of tyranny and identity in the, in the Germans. And we made a deal with the anti. Identity. We meant it. We made a deal with the, with the, the communists that are kind of revolutionary identity. We made a deal with them in order to beat the. The tyranny of identity. Now, everything that is associated with normal identity is associated with power. Anything that's associated with normal identity becomes associated with tyranny and ultimately can be associated with Nazi. And so that's why there's this, like, slide. And everybody's experienced that and everybody has kind of seen that. Now that is not a balanced portrayal of reality, right? That can't hold. Like that cannot happen because what you end up with is a rainbow tyranny, right? You end up with a kind of imposition of openness, right? Think of Justin Trudeau that says openness is our only value, right? We post national nations where we don't actually have a nation. We are just openness to the outside. And we need indefinite migration and we need indefinite immigrants, you know, because our identity is actually bad. We actually want. Secretly, even knowingly or unknowingly, we want to destroy identities. We want the whole world to just be a giant soup that doesn't have identity, right? Because of this, all of this because of the myth of World War II at first, kind of holding the world together in the. In a beautiful way, but then ultimately that story running its course. And you could say the side effects of the story, right, the negative aspects of the story started to play themselves out more and more, more and more and more and more. Now we end up in this problem. And now what we're going to see. And we're going to see the, the breakdown of those taboos and the breakdown of those myths, and it's going to happen in all kinds of Ways that are going to seem contradictory at the outset, but if you pay attention, you'll notice that that is what is going to happen non stop. And so, and even people who will hate each other will end up playing out the breakdown of the World War II consensus. Here's a simple ex, you know, a simple example to show you how it's not as simple as you think. So, right, Donald Trump is elected president, he decides that all of these national identities, all these kind of borders that exist, that they don't seem to matter to him, like he just wants to, seems to think that he can redefine them however he wants and has this kind of populist, you know, stance. And so, and he's being accused, of course, of being a Nazi, obviously, that's how you do it. You know, he's the devil. If he's bad, he's the devil. If he's the devil, then it's better to say he's the Nazi, to say that he's Hitler rather than say that he is the devil. But that's playing out in a way that people don't expect, which is that in the actions that he's doing and in saying to Canada, well, if you're a post national nation and you don't have an identity, why are you opposed to just joining us? Like, why are you opposed to just being taken over? Because you keep saying that you don't have an identity. You've been saying that for 10 years. And so let's just take you in. I mean, you don't care, right? You're just about openness. And then the Canadians react and they're like, no, our nation, we are proud Canadians, we are proud nationalists. And it's like, oh my goodness, can you see what's happening? Can you see that it's all playing out, that no matter what you do, that the breakdown is playing out. And so it's just important to kind of notice that. And so, you know, and this is of course, what Mr. West is manifesting in his own confusion, in the own kind of breakdown of his, of his world, and in some ways in his desire to transgress every single boundary and transgress every single taboo. In his kind of clown contradiction, he is grasping to reassimilate the imagery of the, of the, of the World War II taboo. And it's happening in all kinds of chaotic ways. It's not just him, it's happening all over the place. And it's, and it's, it is in some ways an extremely dangerous, dangerous time because if we're not careful, obviously, you know, we become. You could say we become Satanists to our little story. That is that we. We naively embrace the opposite of the narrative and we think, oh, no. And you see it happening, right? You see all these morons that they're like. It's actually the Nazis that were right and they're. Everything about them was right and everything about what they were doing was right. And it's like. It's like, oh, my goodness, it's so tedious and embarrassing, which is why I don't like to talk about it, you know. But that's the danger of what's coming, is that. Is that there has to be a way to reintegrate this story in a manner that won't let all the demons out of hell, that won't let all the demons that are resentful and angry that have come to realize because they have no place in the current story, that the anti story is actually the completely right one. That the anti version of the story is the right one for all intents and purposes. They're like, let's say World War II metalheads, right? World War II Satanists in that sense, where it's like the upside down story is the right one. But that is not the right way to go. There has to be a kind of reintegration so that we can come back to a type of synthesis. Now, I don't know how that reintegration happens. I don't know the way to do it. I don't think it's also my job to do that, but I'm just warning everyone that it is going to happen. And what I hope is that it happens in the least insane way, in a way that doesn't provoke just an anti story, which is something that is. That is definitely possible because there are some things, like a little example, like this is actually one of the best examples to kind of understand how at some point the story has the. The myth has to kind of be reintegrated more completely into a bigger story. Which is a good example of the swastika. It's like the swastika is the most ancient image. It's the most universal image, one of the most universal images that exists. It is found in every single culture. It is found. It is one of the oldest images. You find it in all over the world, thousands and thousands of years ago, 4,000, 5,000 years before Christ. It's everywhere. You can find it in India, in South America. You can find it in European churches. You find it Everywhere. And so the Nazis capture this image, right? And they use it for their diabolical purpose. But then what happens is because they use it for their diabolical purposes, then it's captured. And so now this is a scary image. For how long? Forever. Like, forever. This image that is the moan of the most powerful images in the world is captured by these devils. That is not possible. Just that image at some point has to break out because it's bigger than the Nazis and it's bigger than them. And the swastika is kind of like a little example of how things get this problem of capture and infection. The idea that everything. How can I say this? Like, the idea that something, if it's tainted, you know, with the Nazis is now verboten forever. And you saw that happening, like, all over. All of a sudden it's like, you can't say this. You can't do this. All these things you can't do. And if you remember, like, all the 4chan trolls were playing jokes on this narrative, like they were doing that in 2016, 2017, and they would, you know, if you've. If you followed that, it was kind of funny. They. They started saying just to. Just to provoke people that the okay sign, like this sign that Trump was doing, he was always kind of doing this okay sign that. That meant white supremacy. Then immediately when they said that, the left said, now you can't do the okay sign anymore because it's white supremacy. And then they started saying that drinking milk was like, white supremacist. And so then the left started saying, you can't use milk anymore. Like, drinking milk is racist, you know, and it's like they were kind of playing with this problem, which is that, you know, this weird capture of the story that has had become a kind of parody. And that's the issue. I rem watching a video when I was a teenager, it really struck me there. There was a kind of more conservative writer in France that was writing, was writing, had created like a conservative group. And he was using the image of a kind of dramatic image of a knight on a horse that had been developed in the Middle Ages, you know, and then the. Their critics, what did they say? Well, they said, germanic knight on a horse. Huh. You know, that some Nazi at some time point in the World War II, use that image or use an image that looks like it. And so are you. Are you a Nazi? You know, because you're using that image, and it's like the guy was like, what? This is a medieval image. And it's like, no, it doesn't matter, doesn't matter. You can't use it. And so that's not possible. You can't hold the world prisoner forever and you can't hold European identity prisoner forever and you can't hold the swastika prisoner forever. Like it just, just some point has to be reintegrated. And the question is, how do we do it? What is the best way to do it? You know, I have some ideas about that. I don't know. It's a very, like I said, it is nonetheless a very dangerous time. And so I would say be very careful. Please don't take this in as a kind of please. If you're watching this and you have a tent, a temptation for the anti story in you, please understand that the anti story is not the way to go. What we need is a proper kind of integration so that we can elevate this into a new, more powerful and more encompassing story. You know, and it's happened before, you know, it's like the generals and the wars in the past. Some of the things that happen. If you take Alexander the Great, you know, Alexander the Great is a horrible, horrible man. You know, the way that he destroyed those that resisted him even a little and just razed their city to the ground and salted the earth and just killed everybody, all the men, all the women, all the children, like he's a monster, you know, and we can still say that, but he has been reintegrated into the story in a way that recognizes, you know, the, the effect that he had on the world also seeing all the monstrosity that he's done and that in some ways, ultimately that is what is going to have to happen to, to the World War II story. It doesn't mean that it has to happen fast. It can happen slowly, it can happen over decades, can happen over generations. But there, this is the inevitable way in which it moves. Because if we try to hold on to the taboo forever, at some point, that taboo, all the demons that it's held at the bottom, like all of this repression that it's done, and that repression is a repressed story, but it finds body in those that are repressed. It finds body in those that are marginalized and those that are held outside of the narrative. And so it's not just a story, it's embodied in people. So the angry, the resentful, those that see that they have no stake in the story are tempted and you can understand why. To embody the counter story to become Satanist for all intents and purposes for this little, this particular story. And so we can't let that. We can't let the satanic moment win. And so we have to find a better, a better solution. So that's my little thought on that. I hope it is useful. These are very difficult subjects to talk about, but I hope that I brought you a little further on this reflection. And so wishing everybody all the best and talk to you very soon. Bye bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #394 - 2025-05-23 - The World War II Consensus is Breaking Down","start":2300.38,"end":2363.03,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com Mint is still $15 a."}
{"episode_id":"SW - #394 - 2025-05-23 - The World War II Consensus is Breaking Down","start":2363.03,"end":2385.49,"speaker":"Jonathan Pageau","text":"Month for premium wireless and if you haven't made the switch yet, here are 15 reasons why you should 1. It's $15 a month. 2. Seriously, it's $15 a month. 3. No big contracts. 4. I use it 5. My mom. Are you. Are you playing me off? That's what's happening, right? Okay, give it a try. @mintmobile.com Switch upfront payment of 45 for."}
{"episode_id":"SW - #394 - 2025-05-23 - The World War II Consensus is Breaking Down","start":2385.49,"end":2391.69,"speaker":"Laura Diaz","text":"3 month plan $15 per month equivalent required. New customer offer first 3 months only, then full price plan options available, taxes and fees extra. See mintmobile.com."}
