{"episode_id":"SW - #361 - 2024-10-19 - The Real Meaning of Lucifer","start":0.24,"end":1571.63,"speaker":"Jonathan Pageau","text":"So, by the way, spoiler, right, that is why you can sometimes hear in liturgy, when they are singing that verse in the Catholic Church, there's a moment when they sing that verse, it is referring to Jesus, actually. And so when you hear the Pope praising Lucifer, he is, of course, not praising Satan, he is praising Jesus as Lucifer. And so you'd say, well, how is it possible that we use the word Lucifer to talk about the devil, but in the New Testament, Lucifer, the morning star, the bright morning star is referring to Jesus. This is Jonathan Pedro. Welcome to the Symbolic World. Hello, everyone. So today we are going to talk about the symbolism of Lucifer. And this video is prompted by something I saw a while ago where I saw certain Christians, certain type of Christians freaking out because they found a video of the Pope of Rome praising Lucifer. And so they were freaking out because here this proves, you know, that the Catholic Church is a satanic thing. And so I thought it was pretty funny. And so it seemed like it could be an excuse to explain the symbolism of Lucifer, because it is a good example of one of the aspects of symbolism that I talk about all the time, which is that symbolism is structural, it is positional, and it is not necessarily moral in itself. That is, the terms of symbolism occupy certain places in a hierarchy of being, and therefore they can be used in multiple ways. So symbolism is polysemic. That's a complicated word. But what it means is that symbolism can mean many things, but ultimately those meanings will nonetheless come together in a positional way. Once you understand it that way that they refer to certain places in the structure of being, you could say, so that's what we're going to look at and look a little bit about at the origin of the notion of Lucifer and symbolism in the Christian tradition in the Bible, and see what it is that we come up with. So before we start, I just want to remind you that, you know, there are ways that you can join us on the Symbolic World. If you go to the symbolicworld.com, you will find there's a community tab, and you can join the Symbolic World either with a free account to join in on our discussions in the community there, or you can also support what we're doing by becoming a member, a paying member, where you get a Q and A every month and also an extra video a month and different discounts on different things that we're doing. And some of the things we're doing right now, for example, is we've got a class by John Vervaeke coming up on the Science of the cognitive science of ritual, but also a class by Martin Shaw, which is on the Christian wonder tales, which I can't wait to see both of those. And finally, don't forget that our Symbolic world shop is open and we have a pre sale for a new fairy tale, Jack and the Fallen Giants, as well as there are Snow White books and also God's Dog books, volume one, volume two, and all the extra stuff that comes with it. And so having said all that, here we go with the symbolism of Lucifer. So in scripture there is a. There's a text. First of all, the term Lucifer comes from this, the appellation of the planet Venus in the sky as it appears in the morning. And so often, not always during the year, the planet Venus will appear in the sky before the sunrise and will be very, very bright because the sun is shining on it before the sun comes. And so it's the dawn star, the morning star, the bringer of light. In Greek, it has several names. Phosphorus, which means the light bringer, or hyosporos, which means the dawn bringer. And this is of course, what Lucifer means. Lucifer means the one who brings the light, the light bringer, the light carrier, and all of that, because it refers to Venus in the morning. Right? And so this has brought about a whole slew of symbolism in scripture, but then also in the following tradition. And so, of course, many times, especially in the modern world, when we use the word Lucifer, what we're referring to is the evil one, right? The Satan, the opposer, the opponent, the challenger. And there are reasons why that's the case. We'll look at those reasons as well. But Lucifer is also a designation for Christ himself. In fact, the only place in the New Testament where there is a reference to the morning star, the bright morning star, the is in talking about Christ In Revelation 22, Christ says, I am the root of the offspring of David and the bright morning star. So, by the way, spoiler, right? That is why you can sometimes hear in liturgy, when they are singing that song, singing that verse in the Catholic Church, there's a moment when they sing that verse, it is referring to Jesus, actually. And so when you hear the Pope praising Lucifer, he is of course not praising Satan. He is praising, he is praising Jesus as Lucifer. And so you'd say, well, how is it possible that we use the word Lucifer to talk about the devil, but in the New Testament, Lucifer, the morning star, the bright morning star, is referring to Jesus. And so this, of course, comes from a text in the book of Isaiah, Isaiah 14, where Isaiah is talking about a king of Babylon and is describing this haughty king of Babylon who will fall. And so we'll read from it. Isaiah 14, how you are fallen from heaven, O Lucifer, son of the morning, how you are cut down to the ground, you who weakened the nations. For you have said in your heart, I will ascend into heaven. I will exalt my throne above the stars of God. I will also sit on the mount of the congregation, on the farthest sides of the north. I will ascend above the heights of the clouds. I will be like the Most High. Yet you shall be brought down to Sheol to death, to the lowest depth of the pit. Ah, so now you can see where this imagery comes from. Of course, this text is talking about a king of Babylon, but you can understand how it's a structural text and you know, because of the text in Revelation, which describes the great dragon that brought that with its tail gathered all these stars from heaven and then, you know, made them fall down to earth and that rebelled against God by taking these stars. And when we talk about stars, of course, you understand in the symbolic world that the stars are, of course, the stars in the heaven, but they're also images of the angels or the gods or the bright beings that are in the heavens that know that rule over the world. And so in the book of Revelation, when he talks about the dragon that gathers these stars and makes them fall into the earth, you can understand how the Church Fathers, you know, very early Tertullian origin, you know, some of the very early Fathers, and then later Augustine, and, you know, it just became basic tradition to understand that this text in the Book of Isaiah referring, in collaboration with the book, the text in the Book of Revelation is referring to Satan or the Evil One as well. So it's referring, of course, to the king of Babylon. But it also is an image of the Satanic trope, right, where a being that is important and has authority will rise, try to take the authority for himself. And so this is what is being described in the text in Isaiah. So you can understand now, let's say an aspect of the morning star, a negative aspect of the morning star, which is the star comes up in the morning and it appears very, very bright in the sky. And so it. It is a. It is something that announces the sun, right? It is a messenger for the sun. Because when you see the morning star up in the sky, you know that the sun is coming. So it's a smaller light, which is a vessel or a vehicle. Or a messenger for a larger light. You could say that all authority is meant to play that role, right? And so any authority in the world, at every single level, is always there, shining brightly, right? Because they are a messenger. They are derivative of a higher light that is above them, that is giving them their light. And so without the general right, the corporal has nothing. But the corporal does shine with a certain amount of light and has a certain amount of authority and power. But that authority and power is derived from the higher power. So you can understand that this description of Lucifer is structural. But now it can happen that someone who has authority, someone who has power, will try to take that power for themselves, and not only take the power for themselves, but will try to cause a revolution in the heavens, will try to cause a revolution in the hierarchy, where they will try to supplant the power from which they get their authority. Supplant the authority from which they get theirs. This is, of course, the revolutionary trope. It's imaged in so many ways in mythology. You know, where there is the idea of Saturn castrating his. His father heaven, Uranus, Kronos castrating his father. But it is also this image of the dragon, of course, that opposes heaven and now tries to take the principalities for them. So you can imagine now the morning star becoming arrogant and thinking that the light that it has is only its light and that it has all the light and is stronger than the sun. But then it's a form of hubris, because, of course, once the sun appears, Venus disappears, right? Once the sun appears in the heaven, the morning star vanishes. You can't see it anymore because the sun is too bright. And so you can understand how this is also an image of how without. How can I say this? That if a secondary authority, if any being tries to take the authority they have or the power they have for themselves, then ultimately they are eclipsed by the thing that causes them, right? And so that is, of course, the negative aspect of the morning star. But, you know, there is, of course, a very positive aspect to the symbolism of Lucifer and of the morning star, which is this idea of a hierarchy and. And a kind of fractal participation in the light. And so the sun gives its light to the star, and now the star shines forth in the name of that light. So you can imagine when Christ says something like, I do not do my own will, but I do the will of the Father. This is an example of the proper manifestation of Lucifer. There's all the light that the Son has. He receives from the Father. The. The divinity is received from the Father and then is not taken for something in which to raise himself up, but is ultimately given out, right, and is given up to God and is seen as, let's say, not something that belongs to him, but because of that, then he is raised up, right? And so this is, of course again now the image of Lucifer in a positive way. Because Lucifer, because this, the star that comes before the dawn, if it gives its authority back to the sun, if it understands that it is derivative of the sun, then what will happen is that it has all its might, it has all its glory. It's beautiful because here's this bright, bright star in the morning that announces the sun. And so this is, of course, why Jesus is described as Lucifer in the Bible, because he plays that role, because he doesn't take his authority for himself on the earth. He receives it from the Father and is willing to give it up in order to serve him. And so you can see now that the symbolism of Lucifer is structural. Where the star appears in the sky is very bright, and you can see it as, let's say, a derived authority. But that derived authority can be good or bad. You know, I've talked about this before, where a good example of this is, of course, Aaron in Scripture, where God chooses Moses. And then Moses says, I need someone to represent me. Like, I need someone who is in some ways derivative of me, who's going to help me manifest myself in the world. So God gives Moses Aaron. And Aaron is a good example of Lucifer, which is that he has the light to some extent, because he's the mouthpiece of Aaron. In Scripture, it even says, God says, I will be your God, Moses, and you will be Aaron's God. You know, like this hierarchy of authority. And so now Aaron is able to speak. But the problem with that is that, you know, when he is separated from Moses, he's in danger of thinking that he has access to that authority himself. And then that is a. It's a. It's a beautiful symbolism when Aaron makes the golden calf, because on the one hand, he seems to forget that he is, you know, derivative of Moses, that he receives his authority from Moses and then through. Through Moses, by. From God. And so he. He kind of revolts against Moses in some ways and tries to take the authority for himself. But then simultaneously, what he does is he creates an idol which is a cosmic version of what he's doing himself in regards to Moses. And so this is, of course, the reality of Lucifer, the reality of the Morning star, which is that anything that tries to capture authority for itself, anything that tries to have an existence on its own that's not derivative of a higher participation, is in danger of becoming an idol, is in danger of becoming an opponent. And so now the derivative authority, the person that is, you know, a derivative of a higher power, now turns its arrogance against the power from which it comes and then becomes an opponent. And in that case, in the case of Aaron, when he makes the golden calf, this is what happens to him. He becomes an opponent. And so the symbolism is structural. And you can understand that the symbolism is structural so much that if you notice, if you know a little bit about orthodox hypnography, for example, you will see that now that we understand this structural thing, then we can apply the symbolism of Lucifer to different beings. So we can apply the symbolism of Lucifer, of course, to the opponent, to the, to the fallen one, because that this is now the case of the arrogant, you know, messenger, the one who takes it for himself, but you can apply it to other people as being the positive messenger, the ones who, who step forth and shine brightly, but pointing to the light. And so that is why, for example, we use the term morning star to talk about St. John the Baptist. So St. John the Baptist, who comes before Christ, who announces the coming of the Messiah, who announces the coming Christ is called in his Akathis, for example, we say, rejoice, star, illumining the path that leadeth unto Christ. Rejoice, morning star of the never setting sun. Rejoice, worthy lamp of the never waning light. Rejoice, thou who prepares the way for the approaching Christ. Rejoice, thou who appears as both angel and man. Rejoice, great John, prophet, forerunner and Baptist of the Lord. And so you can see, right, multiple ways that the image is used is to help us understand, because St. John walked out in front of Christ, you know, paved the way for him, opened up the doors so that Christ could walk, you know, could be recognized in the world, and is pointing to Christ. Therefore he is Lucifer, he is Lucifer in the right way. He is Lucifer in a way that is not subversive at all, but is actually a normal derivation of participation. But it's not, of course, only St. John that we've called Lucifer, but the mother of Christ herself, the Theotokos is also called Lucifer. Again, in her akathist, we say to the mother of God, we say, rejoice for you carry him who carries all. Rejoice, morning star, who brings forth the sun. Rejoice, womb of the Divine incarnation. So here again, because she is the one who, let's say, causes the dawn not in a divine way, but in a material way. She's the one who appeared before the dawn and has the sun coming up behind her, right, and coming through her, you know, like kind of the idea of a rooster that announces the sunrise, you know. And so now she's also called Lucifer because she is the one who points to Christ. And so this is a, you know, used very well in an image called the Deis, where you see Christ on the throne in the center, and then to his right you see Mary, you see the Theotokos. To his Left you see St. John the Baptist, St. John the Foreigner, and both of them are pointing to Christ. So this is their role, both of them playing the role of Lucifer, playing the role of a light that points to the true light. And so this is, of course, something that we can use to understand everything about the world, everything about reality, which is, first of all, that in symbolism, things are structural. And so we always have to be careful when someone tells you. When someone tells you things like, you know, the pentagram is evil, or the hexagram is evil, or, you know, an upside down cross is evil. And the truth is that these symbols have multiple manifestations. And if you understand them in the right context, then they are positive and then sometimes they are negative. And I'm not saying that the term Lucifer is not one which refers to the opponent or the fallen one. Of course it is. And in common parlance, because it has become, how can I say this, usual to refer to him in that term. I think it would be dangerous to just casually, you know, refer to Christ or to the Mother of God or to St. John as Lucifer, because it would cause confusion. That's not necessary. But when we look at it deeper, we need to understand how. How structural symbolism works and how we need to always have the right, you know, we have to be able to discern things properly in order to not be confused and to not be mixed up. And also to not say silly, stupid things like the Pope is worshiping the devil, because here he is, you know, singing a hymn to Lucifer. And so in the same way, this can help us, of course, understand that everything in the world can be Lucifer, right? Everything that you encounter in the world can be a small light which points you to a higher light. Either a higher light that's not even God itself, God himself right away, which is just a higher good that you participate in something that, you know, makes that thing shine, right? I'VE talked about this before, right? A steering wheel, for example, is a little Lucifer of a car. And so a steering wheel on its own is just a ridiculous object. But if it's integrated and it's pointing to the higher light that it's participating in, then it can be a small Lucifer for a car and the same thing for the car. So a car in itself, you know, what is it, unless it serves a higher good. If it helps you bring your child to the hospital, if it helps carry you to work or carry you to church or help you see your friends, then it can be a. A Lucifer for a higher good, a higher participation. And so this is, of course, you know, a good way to understand how symbolism works, but then also even how the symbolism of the morning star and the bright star, which points to or precedes the higher light or the bigger light, is actually an image of symbolism itself. And as we move forward, we can, of course, can help us to not be naive and to not say silly things when we talk about symbolism. And so I hope this has been useful. And just to help you see, one of the biggest Lucifers, let's say, in Scripture, in the New Testament, and one which is related to the double symbolism of both the messenger or the. The one who's derivative of a higher power, but then can also become an opponent, is of course, the symbolism of St. Peter. And then we'll look at that, the double symbolism of St. Peter in my next interpretation of symbolism. There's also another mystery about this whole image of the morning star or Lucifer, of Venus rising up in the sky. And this is related to the fact that, in fact, Venus is sometimes during the year, the morning star, but then sometimes during the year is the evening star. And there is also a movement of Venus in the heavens in which retrogrades, right, which is that it. It moves in a certain direction, you know, and then at some point during the year, it starts to move in the opposite direction. And, you know, this is related to the symbolism of Lucifer very much. So you can understand that when Venus is the evening star, it shines brightly after the sunset. And so you see it appearing shining brightly after the sunset. And when Venus is the morning star, you see it shining brightly before the sunset. So this is, of course, a good example of understanding the relationship between Venus and the sun and also the relationship of different authorities. And so this I take from someone named Tom Brie, which you can look up if you're interested. He is someone who's quite good at architectural symbolism and cosmic symbolism. As well. But he gave me this insight, which is that. So you can understand the Venus, the morning star and evening star, as both one that comes up before the sun or one that comes down, you know, in the evening, comes down after the sun. And so these two aspects of Venus and going up and going down, right? So you can understand it, for example, as rising up into heaven or then falling down into the underworld, right? So these would be the two aspects of, of this star where on the one hand it rises up and on the other hand it goes down. And you know, his insight, which was wonderful, is that when you think of the opponent or the evil one and you think of Christ, what you see are the same symbolism but in the opposite direction. That is. Or flipped. One flips the symbolism of the other, which is that Christ is the one that is willing to descend into hell, descend into death willfully, right? Give up in that way. And because he's willing to do that, then he has actually raised up and made the highest right and becomes the highest thing. And that's how it's described in gospel and in St. Paul, right? That because he gave up and because he was able, willing to empty himself, therefore it's fine that he is now raised up because he's not in danger of becoming a. Becoming a kind of loose, an opponent character, right? He. He is the son of the Father in every way and does the will of his Father. But the devil, right, the, the opponent, the Satan, the, the. The evil one, you know, he does the opposite move, which is that he raises himself up. And because he raises himself up, he's cast down into hell and into Hades, right? If you look at the mythology of the devil, right, he's thrown down into Hades. And so it's really interesting because you can apply that, of course, again to any form of authority you know, that is that if you are humble and you play your role in the best way you can and you give up, you know, the authority to the reason why you're there in the first place, then you will be raised up. But if you raise yourself up, then you'll be cast down. Christ says that all the time. But he says when you go somewhere, sit in the back, you know, and then if you're willing to sit in the back, then you'll be recognized if you're, if you're good, like if, if you're someone who's actually shining, then you'll be recognized by the people and you'll be asked to come to the front. But if you come and you boast and you, and you, you try to take it all on yourself, then you are in constant danger of falling and of being thrown back into the back. And so that's another example of how the symbolism of the morning star and the symbolism of Venus is very complex and subtle. So thank you, everybody, for your time. Thank you for your support and talk to you very soon."}
