{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":12.08,"end":1861.52,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, so Dante wrote this amazing text called the Commedia. This is what I'm going to be talking about most. But he was, if you've studied Dante a little bit, he was part of a brotherhood of poets that were focused on the notion of love. Now, love in the Comedy can be seen as the animating force behind everything that Dante talks about, and not only the animating force in the story, but really presented as something like the animated animating force of everything. That is the manner in which the world exists. And for us as modern people, that is a very strange thing to think. To think that the world exists through love, let's say. But hopefully, by the time I'm done speaking to you, at least understand how we could think something like that or how it is that people could think that way. So Dante hadz is this whole massive experience of going down into hell, encountering all these people that are suffering for different sins, and then going up to purgatory, encountering again people that are expiating some of their sins, and then moving up into heaven, where there's this slow ascension all the way up into God. But when you read the text, you realize that, for example, the people in hell, they rush into hell themselves, they want to be there. And there's a sense in which the people that are at the different levels of reality that Dante encounters, they want to be where they are. And the reason why they want to be where they are is because of love. That is, it is something like in the lower spheres, let's say, in Hell and in Purgatory, it's something like ill directed love, or sometimes lack of love, or sometimes excessive love of things that are good, but that there's too much love attributed to them. So I want to read. I'm not going to read a lot from the actual poem, but I want to read at least a few things from the. From the poem. And so this is taken from the translation by John Ciardi. And I'm going to read a little text from the 17th, 17th CANTO in the Purgatory. So if you want to look it up later, you can look it up. And so in that moment in Purgatory, there's a little pause and Dante's guide, Virgil, we'll talk about why it's Virgil a little bit later. But Dante's guide Virgil gives him a little speech on love and he says, neither Creator nor his creatures move as well, you know, he said, but in the action of animal or mind, directed love Natural love may never fall to error. The other may by striving to bad ends, or by too little or by too much fervor. While it desires the eternal good and measures its wish for secondary goods and reason, this love cannot give rise to sinful pleasure. But when it turns to evil or shows more or less zeal than it ought for what is good, then the creature turns on its creator. Thus you may understand that love alone is the true seed of every merit in you and all acts for which you must atone. And so love is basically. I'm going to be simple about it. Love is basically that which makes you move. Whatever it is that makes you move in the world, you can understand as love. Now, it's strange for us to think that way because we always think about love just in terms of romanticism or like, let's say, the love that we have for children. An easier way to maybe understand it would be to use a word like care, for example, or attention. That is, the things we. The reason why we move in the world is always because of care. Now, that can mean something like, I need to eat. And so I care enough to move to get something in the fridge, right? It means that I care enough about certain things to get dressed in the morning. I care enough about certain things to walk out. And you know that because you know that when people become depressed, often it's often expresses itself in a lack of care. A lack of love, you could say. That is, as the love in the person becomes cold, that person becomes unable to do things. And it's not even. It's not like necessarily a physical thing. It's not like they have an infirmity in them or that they're weak or that they're physically incapable of doing things. Is that they're incapable of finding motivation and that they're incapable of love. Or their love is cold in them. So Dante, a little bit later in the same chapter, Virgil says, all men, though in a vague way, apprehend a good. Their souls may rest in and desire it. Each therefore, strives to reach his chosen end. And so everybody in them, we have an intuition of that which is good. And that is what makes us move. And we have a sense that we'll rest in that good. So this is very simple. Like, it's not a. It does end up in a very kind of deep, theological, mystical idea. But at the basis, it's this. It's the idea that I'm hungry, I eat an apple, and I find rest in that good, right? I'm Tired, I go to sleep. I find rest in that. Good. And so everything that makes us move, makes us move with desire towards something which we think that will give us a form of rest from that desire. And so love expresses itself as this burning, you could say, in us, that drives us forward towards other things. Now, this is true, of course, for little things, but it's definitely very true about. In terms of relationships, in terms of erotic love. That is, erotic love has the same structure, right? We move into erotic love with the desire to find rest in that moment, right? In that. Because love expresses itself as a kind of pain, right? As a kind of suffering. As we long for that. The things that we don't have, as we long for our beloved, as we long for that which is drawing our attention, drawing us towards it, right? So it's something like anticipation. Anticipation is actually a form of suffering. It's a strange mix of suffering and pleasure, right? It's like this, this goal that appears to you, this shining thing that appears to you in front of you. Whether it's like, I don't know, whether it's having a good meal in a restaurant, whether it's going to see a new play, or whether it's seeing your beloved. There's this. This thing that pulls you and the anticipation is excitement, but is also a kind of suffering. And you, you. You move towards the. The possibility of finding rest in your. In the thing that is beloved, in the thing that you are moving towards Now. Dante says that. So the idea is that the people that are. Everything that is good in you is happens through love, but everything also that you need to expiate, that does all the bad stuff in you is through love as well. And you can understand that in terms of. A simple way to understand is like any bad habit that you have, right? A bad habit is, say, is sparked by love. And so let's say someone who smokes, it's easy to find the very simple badass. Someone who smokes, like someone who smokes will have created this pattern of love in them which will both. Which will make them desire the object. And so if you haven't had a cigarette in a certain amount of time, you're going to feel that pull. And that pull will be both anticipation and suffering. And then when you take, when you get your hit of nicotine, then all of a sudden you feel that rest in the thing that you love. And so that's true for any bad habit that you have, like, whether it's ocd, washing your hands, whether it's like Any kind of behavior that drives you, you'll feel that anticipation, that suffering, and the desire to find resolution in the love, in the object of that which is desired. So the idea is, in Dante especially, is that to a certain extent you could imagine that all things that exist in the world are good, they are a good, and that we are meant to move towards them as we move towards a good at the level at which they are meant to be loved. So he says, but when it turns to evil, the love assures more or less zeal than it ought for what is good. Then the creature turns on its Creator. And so the idea is, when we love something to the level at which it's supposed to be loved, then it will be normal. But if we love something excessively, then it will lead us into hell. And of course, this is something that we understand. Like anybody that has been madly in love with someone can understand the danger that is there. Because especially a very strong attraction, if you're very strongly attracted to someone, all of a sudden, the desire to find that resolution, especially if it's unrequited love, especially if the person you desire does not. Does not answer your desire, then the suffering can be huge. And if it's disproportionate, it can lead you into total despair, right? And we. Everybody knows someone to whom that's happened, someone who falls into despair out of excessive love for someone. But that is, of course, something which can happen not only in terms of a lover or in terms of the beloved. It can happen who. Someone who's trying to get. Who's applying for a job. And that their desire to apply for that job is so strong, it is pulling them. They want it. They want it so bad. And then when it is unrequited, then it will lead you into suffering. Now, it's true that way. But it's also true that if you disproportionately love something which is not meant to be loved at the level that you're loving it, then you will have other problems. Alcohol is a great example, right? You know, you drink with friends, you use it as a social lubricant. There's this capacity to engage in that, say, the pleasure that alcohol can bring you at a level that is normal, that. A level in which it will only act as a step into higher loves, which is that, you know, I like to have a drink with my friends because it loosens the mood, and then I can really have a great time with my friends. And so now this love for alcohol, which is. Which is not wrong in itself is at the right level. It's at a level that leads me up to. Towards a higher love. But if I become too focused on the lower love, then it can lead me into despair, because it won't. It's as if I'm trying to make it fill a hole that is too big for what I'm using to fill it with. Because the truer love, let's say the love of a person is much higher than obviously should be much higher than. It's something which will fill us more than the love for something like alcohol. So if I'm not careful, I'm trying to basically, I mean, you've heard, you've seen this trope in any kind of movie, right? It's like I'm. I. Like I'm. I'm feeling something I'm missing in terms of love, in terms of some desire I have to be loved by my father, whatever. Like, or to love by someone else. And I'm compensating through something like alcohol. But this can also be true, like I said, of people. That is, even the love we have of each other can become excessive. There's actually a wonderful version of that in another story which deals with this kind of voyage into the afterlife. C.S. lewis wrote a book called the Great Divorce. And in this book, he has a similar story as Dante, where he visits the other world. And it's basically lessons about how we live now. Even Dante's book, I'll tell you a secret, it's not really about the afterlife. It's really about now. It's really about how we live now. The same with C.S. lewis's great divorce. And so in this book, there's a beautiful image of a woman who arrives in the afterlife. And as soon as she arrives in the afterlife, she asks to see her son who preceded her in death. And the angel that is there, I forget who the guide is, says, yes, you will see your son, but before, there are a few things we need to go through before you see your son. And the woman is like, no, I want to see my son. Like, I knew when I would die that I would see my son. So bring me my son. And once again, the angel says, no, your son is here. Don't worry, you'll see your son. And she starts to, like. She starts to get really animated. And she said, who is this God that will separate me from my son? Like, what kind of God would separate a mother from her son? And so I want to see my son now. And the answer is, no, not Right now you can't see your son. And it drives her so mad that she runs out of paradise into hell, where now she asks, she demands that they bring her son into hell with her so she can be with him. And it's a very. It's a very powerful vision of even how our human relationships, if the amount of love or if the manner in which we love those around us can become disordered and can lead us into. Can not only lead us into a way that makes us go to hell, but really a desire to bring other people into hell with us. This is something which is. Which is fascinating, something that I've noticed in terms of bad habits, for example. You can see that with people that take drugs, they have a strange desire to get other people to do it. And it's very fascinating. It's like they actually invert the relationship. So where their love of the drug is so strong that they see it as the mediator towards their relationship towards others. That is, they want to pull other people into their love almost to justify their love or almost to help them feel that this love is appropriate. And so they'll actually want to pull people into their web, into their bad habit with them, in order to. To kind of justify their love. And so people pulling others into hell with them is something that happens quite a bit as well. And I'm sure many people have had an experience like that. So what Dante does is he basically, in his way of describing the world, he describes what you could call something like appropriate love, or the manner in which loves can scale up, can scale into each other, how the loves can build on each other in order to lead us towards more, let's say to higher, more lofty loves, and not get trapped in these lower loves that we. That we all have, but that can become dangerous if we don't. If we try to fill our existential hole with them. You could say the way that the whole story is set up, right, is that at different levels of reality, you have different people. So if you. In Dante's poem, there are people that are in limbo, there are people that are in hell, there are people that are in purgatory, and there are people that are in heaven, and there are people that are at different levels of heaven. So the story starts with Dante falling into despair. He falls into despair. He's at the middle of his life. He's been exiled from his city. He basically has lost all the things that helped him understand who he was. And so he is faced with these three beasts that are preventing him from going further. He's. He's stuck in a deep, dark forest, and he can't go further. He's. He has these three beasts that are facing him. And so he's stuck. And so in order to get out of that, there appears to him the poet Virgil. Now, for those who don't know, Virgil is a Roman poet of the first century who wrote especially the Aeneid, which is his most famous poem. And so Dante encounters this poet who's dead, who's been dead for a very long time. And Virgil starts to guide him around these monsters, but has to go down into hell and then come back up to go up the levels of Purgatory. But at some point, Dante asks Virgil, like, you know, how is it that you came to greet me? Like, how is it that you came to get me in my despair? And so what Dante describes is that Virgil is in purgatory. Sorry, he's in limbo. He's at the gate of hell. And then someone from above came to see him. So Beatrice came to see Virgil. And Beatrice is Dante's muse, you could say. It's a woman that Dante encountered at some point in his life. He never had a relationship with her. He was never married to her. She had her own life. But he saw her as this thing that awakened love in him when he was young. So he encountered this woman, it awakened love in him, and she became for him the ideal of human love, of Eros, the ideal of, like, erotic love in the positive sense, that this thing which draws you forward, which becomes your motor to make you do things. So Beatrice sends. Beatrice comes down to Virgil and says, virgil, why don't you go see Dante? Dante's in trouble. You should go and see him so that he can move forward. And she says, I was contacted by St Lucia, who is Dante's patron saint. And then there's a hint in which that St. Lucia was contacted by someone else, by another lady. And so it's not said in the text, but it's the Virgin Mary, basically. And so you have this interesting setup where the Virgin Mary comes down from God, comes from Christ, comes down from Christ and encounters St. Lucia and says, lucia, Dante's in trouble. Maybe we could do something about it. Your patron saint. And now this patron saint goes down, encounters Beatrice, who's the woman that awakened love in Dante. She says, why don't we go help Dante? She goes down to limbo, and now she encounters the pagan poet, the greatest poet that has ever lived, you could say, before Dante, in his estimation and now this poet goes out to find Dante. Now, we can obviously understand this in a narrative way. It's a nice little trope, it's a nice little narrative, but it's telling us about the manner in which loves work, the manner in which loves stack up on each other. And so now you saw it from top down, right? You saw basically God or Christ telling the Virgin Mary, telling La St. Lucia telling Beatrice, etc, etc. All the way down. But now you can also see it going up, right? Because that's what's going to happen with Dante. So as Dante moves up, moves down first into hell, then goes up, at some point Virgil will leave him and will be replaced by Beatrice as a guide. And as it doesn't. It doesn't map on exactly, but it maps on well enough as he goes up. Then Beatrice at some point is replaced by Bernard of Clairvaux, who was a great theologian in the Middle Ages. And then Bernard of Clairvaux leads him up and at some point Bernard leaves and the Virgin Mary herself takes Dante up into the presence of Christ so that he then enters into the presence of God. So this is, you can understand that this is really telling us about how love works, about how loves and can build on each other. And so Dante's love for poetry, right? Dante's love for poetry, but not also, you could, you could say in terms of Virgil, what he represents is also all of the secular world, because he's a pagan, he represents, let's say, secular reality. So all of secular reality, all of these things, whether it's poetry, whether it's science, whether it's just things that exist in the secular world, they are the first thing that draws Dante into the possibility of loving. And so his attraction to these things, his attraction to literature, his attraction to poetry, let's say, awakens something in him. Now, if he stayed there, he would become. He would become that stuffy professor that lives in books and that doesn't have any connection with reality. And maybe you've met people like that that live in a world of literature but have no relationships, have no. Their lives are a complete mess. Like their relationships are a complete mess. They're basically like sociopaths, but they know literature, like, they're really experts in poetry and all this stuff. So that's a possibility. But no, Dante, that possibility of understanding patterns in, in the world, patterns in literature makes it possible for him to fall in love. And now he falls in love with this woman, but this woman is, is actually unattainable to him. And so here again, this could be. It's both a positive and a negative. It's positive because it brings him higher. Now it's an actual human relationship. It's not just fictional or like people on paper. It's a real flesh and blood person standing in front of him, you know, who now his erotic love can be directed towards. But then again, that's the same now it's a very. It's something which is positive but could be negative if he just stayed there. Because again, you know, this like someone who's in a relationship and that relationship fills all their needs and then they find out that the person is cheating on them. Or then without. Then it. Things spiral out of control and then they end up getting a divorce and their lives are ruined forever because all their love was put there. Something which is good, but which is not all good. And so then Dante's love for Beatrice leads him up towards a. Now a more spiritual love, right? A more spiritual but particular love, which would be something like his patron saint. He. You can imagine it like an angel. You can imagine it like the capacity to love something. Like it could be something higher in general. Like, it could be something like an ideal, you know, moving towards an ideal, working towards an ideal, working towards something which is higher even than our. Just our human relationships and becomes a manner in which our human relationships can be bound together. For some people it could be something like a. A cause, you know, for some people it could be something like, like a team, you know, like a sports team. This is. It's lower than a patron saint, but it can help you understand how these lay. These loves can kind of scale up into other loves. And of course, now this love leads them now cosmically to the highest form of. Of love, which is ultimately this moving into the Virgin and then ultimately into God. God himself as the absolute good. You could say for modern people, it's hard to understand this. Like, it's hard to understand this because we tend to understand God as an arbitrary being which exists in heaven or whatever, you know, that just as arbitrary being. But there's a sense in which the medieval person or the medievals understood God as the source of all good, the infinite source of all good, and therefore all our love should move slowly towards the good. Now those goods are, like I said, they are smaller things, they move into virtues, they move into ideals, but then ultimately they also have to move up towards, let's say, the source of love itself or the possibility of love itself maybe is the best way to understand that. And Trinitarian theology is basically a description of love. Trinitarian theology is about how something, obviously it's not a thing, right? How the source of all things is both one and many at the same time. If you want to understand love, that's basically a definition of love. Love is the capacity to be both one and many at the same time. So if you love someone properly, you will want that person to exist outside of you. Because if you suck them into you, right, if you basically annihilate them into your desire, then they will, they'll cease to exist, you'll turn them into shadows, you'll turn them into dreams. But true love is the capacity to both be fully one with that which is loved, while letting that thing completely exist outside of you. That is true love. And in the Trinity that is what you find. You find basically a kind of self emptying love in which the different persons of the Trinity completely give themselves to, to the other while not fusing together and becoming just a Monad, you could call it. So this description of God, ultimately this is what it's. When we say God is love, it's not an arbitrary thing. It's an actual description of how God or how the source of all things animates our experience, animates everything that we participate in. And so this is why Dante, I mentioned this earlier in one of the speeches I read, he says, all men, though in a vague way, apprehend a good. Their souls must rest in and desire it. Each therefore strives to reach his chosen end. But there's a manner in which that desire for the good leads up into the good itself, leads up into the highest good. And there's a manner in which that the lower goods can be transmuted or transformed into something which leads you higher. And this is something which is obviously there in Christianity, but it's not there. Only in Christianity you find it in, for example, in Plato. So in the Symposium you really do find an image of something like that. Where the Symposium is a drinking party. And of course in the Greek culture there was, there was this erotic relationship between men of different ages. And so the older men and the younger men would have these erotic relationships and it would be seen in Greek culture it was kind of iffy or it was okay, but they weren't sure about it. And there's a way in which Socrates in the Symposium, he comes into contact with Alcibiades. And Alcibiades is a very, is a very passionate person. He's an extremely passionate person. He's extremely driven, he has A lot of ambition and he really wants to, he's like, he takes up a lot of room like he's a glorious young man and everybody looks at him, everybody wants him, everybody is attracted to him. And so ultimately Alcibiades, according to Greek tradition, is the one who will betray Greece, who will betray Athens. But we don't know that yet. And so Alcibiades tries to seduce Socrates. And Socrates is constantly, if you read the text, it's wonderful. Socrates is there with Alcibiades as Alcibiades is trying to seduce him. And Socrates is constantly receiving that, receiving Alcibiades desire and turning it towards higher goods. And he's constantly trying to like, say, to bring him, to contemplate the forms, to contemplate higher goods. And of course Alcibiades gets very frustrated in the story. He's like, he gets very annoyed. He ends up, let's say, admiring Socrates. But there's a sense in which, in the bigger story of the Symposium and Greek culture, there's a sense in which the fact that Alcibiades was not able to temper his passions, was not able to temper his loads. Now, not only for Socrates, but in general, like you can understand that someone who is extremely, that has a lot of desire to succeed, that is extremely motivated to make it in the world, is someone that is driven right and is willing to do anything to reach their goal. And so in the case of Alcibiades, that love, that strong passion that he had, would lead him ultimately to betray Athens. And so if he had learned to moderate his love and, and moderate his passions, he might have been able to, let's say, turn them towards higher goods. And he wouldn't have gone the dark route that he has in the story of Greece. And so when you look at, in the story of Dante, you can understand that in a Christian manner, the best way to understand it is something like compassion. And so you can understand that the way that the love that moves up is something like admiration or something like veneration, something like seeing, seeing something as a model that attracts you towards it. And then the love which comes down from the higher goods is something like self sacrificial or compassionate. And so it's by, it's through compassion that the Virgin calls down on these lower loves to then draw Dante in. And Dante isn't ready for the higher things. So there's a way in which he must, he must, let's say, truly explore the loves that are there, present, present to him. That is his desire to become a Great poet. His desire to, to learn about poetry is something which is good and he needs to fully, he needs to fully accomplish, you could say, but also always knowing that it eventually has to move up towards higher and higher goods. And so I would say that that was basically like, let's say the basic thought that I wanted to bring you guys. And I was hoping that there would be questions because I know that this is maybe something that you hadn't thought about and is not maybe obvious at the first glance or maybe it is, I don't know. So I would love to hear questions from you so that we can continue the discussion."}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":1861.92,"end":1894.5,"speaker":"Audience Member","text":"I know it's not like say your job to help fix other people's lives. That's not the angle that I'm asking this question from. But when you see somebody who's maybe loving excessively and you can see that it's to a point of harm as a friend or whatever, how would you suggest, what advice would you suggest giving to mental navigate that and help them maybe see maybe like a third view perspective of like why it might be detrimental."}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":1894.82,"end":2002.99,"speaker":"Jonathan Pageau","text":"Yeah, it's very difficult because someone that is drunk on, on love is very difficult to reason into reason into anything. It's very hard. That's why, like I, I won't lie to you. That's why in Dante, that's why people are in hell. There's a sense in which the people that are in hell are completely drunk on their love of the thing that's making them, that's bringing them there. They're so drunk on it that there's no, almost no way to get them out of it. It's like they're completely blind and turning in their circle of desire. And so it's very difficult to do that. But I think that it's possible. And I think that let's say modeling proper love or modeling proper compassion is probably the best way to do this. Which is that if you have a friend that is, that is obsessed with something or with someone to a level that it's self destructive, then I think the best thing to do is to, let's say kindly tell them, take the wrath and let that person know that you're still going to be there. Like you're not going anywhere, right? That is like, okay, I'm gonna tell you that this, I think is, is, is dangerous to you. And then that person will say whatever. If you, I hate you, I don't want to talk to you again. And you, and you're like, okay, I get it, but I'm here. Like, if you need me, I'm here, and I'm not going anywhere. Like, I'll still. I'm still your friend. I'm. It's important for me to tell you this, and I'll be here, you know, and then when that person crashes, which obviously was gonna happen, then to be there for that person when they do. But it's tough because love is that, right? Love is the. Is our driving, is our driving force. So hopefully that helps a little. Yeah."}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":2002.99,"end":2015.95,"speaker":"Audience Member","text":"Okay, maybe I missed this when you spoke about it, but how do our loves for, let's say, our work, you know, jogging, friendships, how do they bring us to a higher good?"}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":2016.43,"end":2136.2,"speaker":"Jonathan Pageau","text":"Well, it depends on the love. But let's say jogging is a good. But the good of jogging is to make you healthy, right? That's. That's the good you're aiming towards. But, you know, some people that stop aiming towards that and then just become weirdly obsessed with physical activity. And the physical activity now becomes like the thing they do. And now they're not doing physical activity in order to be healthy. They're just doing physical activity as if it had. It was the goal in itself. And. And it's the same with work. Like, you know, people that, like, love what they do, love their work, love what they're doing. And, you know, people that are slaves of their work and become completely enslaved by their work and see it as their only identity, as the thing which gives them value. And so they'll work insane amount of hours because they think that it's the only thing that makes them exist, basically. So then it becomes completely aberrant. But if you. If your. If your work, it stimulates your mind, it stimulates your. It stimulates your, you know, your capacity to learn new things. It brings you into contact with other people that you. That you create bonds with, that you create friendships with. Then the love of work becomes something which is balanced with other loves and kind of lead you into higher loves, which would be friendships that you develop at work, you know, whatever it can lead you to. It can also. It also. It provides money for you to be able to live out other goods, you know, which are to have a relationship, to have children, to maybe focus on certain causes that you want to be involved in certain higher things which are, let's say, more to the service of humanity, like help the poor or whatever it is that you do. All these things can kind of fit together. And it's usually when we become. When we try to put all our identity into one love that's usually when it becomes out of whack."}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":2136.76,"end":2169.38,"speaker":"Audience Member","text":"So my question is, okay, so like, I agree with you, but how can we ourselves. So Jane was asking, okay, how can we help someone else realize that that obsession they have for something is not healthy? But if we don't have anyone around us, how can we notice that, that like, okay, so it's like, yeah, you don't need to love things. Let's start the next 10. And I guess my answer, the answer will be that it doesn't prevent you from going to higher things. But how can you detect that? Maybe the way you're putting in something or someone, it's too excessive. It's not proportional."}
{"episode_id":"SW - #213 - 2022-01-10 - The Divine Comedy - Love in Heaven and in Hell","start":2169.7,"end":2458.56,"speaker":"Jonathan Pageau","text":"Yeah, if you're a, if you're a religious person, then that is. Makes it easier. Like if you're a religious person, then it's kind of set out for you, which is that there's a hierarchy of goods. And so you have an objective scale that you can look at and realize that if I'm neglecting these higher goods, like if I'm neglecting worship that is attending to the highest good, if I'm neglecting becoming more virtuous, then that is also a good which is competing and etc. Etc. Like, if it's, if it's, if this good is destroying my relationships, then those are all signs that the different goods are not in their proper order. And so praying itself, or I'll be generous to you because I'll say if you meditate, for example, is something that can help you. Because one of the problem with these loves is that they drive us into a circle of passion, right? It's like they drive us from desire, anticipation to fulfillment, to depression, to desire to anticipation to fulfillment. And so it's like this wheel that keeps going. And so once you're in that wheel, it's very difficult because you're like a little gerbil running and you're like, you're just trying to make it go. But that's why something like stopping, you're stopping your activity, stopping what you're doing and then praying or at least being meditating and just being in silence for 10, 15 minutes a day, for example, is something which will definitely help you because what it'll do is it'll pull you out of the. Pull you out of the wheel just for a little moment. It doesn't even have to be that long. But just being pulled out of that wheel of like all the thoughts that are running in your mind for a little while will help you to see more with More clarity. The things that are driving you and you're going to start to see them. Because what's going to happen is when you're going to start to want to pray, all of a sudden you won't be able to, because these things are going to start seeping back into you. So you're. If you can't, if you, if you try to stop thinking about something and you can't, that's a bad sign. That's a bad sign, right? If you, if you're just saying, okay, I'm not going to think about this now, just going to stop in silence and not think about anything, say, and then those thoughts just come crashing back in, then I would say it's a sign that you're in trouble. Like, they're not in big trouble. Most people are slaves to some of these things. But it's something to be attentive to, to know that, okay, I need to maybe refocus some of the things that I'm focusing on. And it's something everybody has that I go through it all the time because I love what I do, I love my work. And then I get all these people asking me to, to come speak here and to do this and do that. And so I'm, all of a sudden, I'm like, I'm running and I'm super excited and I've got, you know, like, my adrenaline level is super high and I've got all these endorphins coming in. I'm like, woo. And then I realize, okay, I'm drunk. Basically, I'm just drunk on this thing. And it's really bad for me because, you know, it's like, oh, I'd rather do that than call my friend. Like, I'd rather be in this world than, let's say, do the things that I know that I need to do. So that's a way to be attentive to it. But in terms of, like, so I'm an orthodox Christian, and there are a lot of things there to help you do that. Like, confession is a great way to deal with that. Because when you have to go to confession with a priest, it's like all of a sudden you have to think about it. Like, you have to think about those thoughts that you've got. You got to think about those actions that you pose. And you've got to ask yourself, like, okay, what are the things that are motivating you? What are the things that are driving me? And so it's a good way to, to reflect. You go see a psychologist. It's not as good, but it can help. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interest. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
