{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":0.48,"end":72.75,"speaker":"Jonathan Pageau","text":"So hello everybody. I am sitting here with Christian Roy. For those who follow the channel. You have probably seen my past interviews with him on Jacques elleul and some McLuhan as well, and the question of technicity, the problem of technology. And so he has recently written an article on Marshall McLuhan and his relationship differences to orthodoxy because Marshall McLuhan was a Catholic. Looking at the places of contact with orthodoxy, but also the differences and also the possibility within McLuhan of understanding how his ideas connect to symbolic world and to symbolic vision. And so I really thought it would be a great opportunity to explore a little more Marshall McLuhan's work, see how it connects to symbolism, and also see how he was able to perceive some of the things that we are seeing happen around us in terms of technology, in terms of social media transformation. And so I'm really looking forward to this conversation. This is Jonathan Peugeot."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":73.15,"end":74.83,"speaker":"Christian Roy","text":"Welcome to the Symbolic world."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":84.84,"end":93.96,"speaker":"Jonathan Pageau","text":"So, Christian, maybe you can tell us a little bit about your experience with McLuhan. I know the text that you wrote for us was already presented at a conference beforehand."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":94.92,"end":205.66,"speaker":"Christian Roy","text":"Yeah, it was at the Faith and Works McLuhan Faith and Works Conference in Winnipeg Saint Paul University in 2015. Centered on the religious dimension of McLuhan's thought and activity, which has often been overlooked, but which has surfaced more on the discussion since the publication of this book by his son Eric, who the Medium and the Light Reflections on Religion, which is a collection of some of McLuhan's articles and letters pertaining to religion. It appeared in 1999, I believe, and actually I want dwell on it because James Cortides already has in his introduction to his own reading of my recent article on McLuhan for the blog. So it was, I guess, among my first direct engagements with McLuhan, which has informed my thought for maybe decades, probably since the 1980s, my thought on technique. So. And I'm a bit of a dabbler in his talk, but it's so nourishing that even is concentrating on a couple of articles like we're going to do. You could have a whole seminar on that, but I hope we'll pick on certain issues that stand out in ways that will bring something to everyone's thinking on symbolism."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":205.82,"end":249.06,"speaker":"Jonathan Pageau","text":"And so one of the things that I find fascinating with McLuhan and I think that he's really illuminating is the manner in which he talks about technique as an extension of the human person. As you know, this is something that I'm very fascinated with in terms of the symbolism of the garments of skin. But McLuhan really emphasizes on the techniques of information like media writing. But then today with television and all the different media as extensions of the psyche. And so he really tries to show how this extension of the psyche is different than just, let's say, physical technologies like cars and all that. So maybe you can tell us a little bit about his understanding of this extension of the psyche."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":249.78,"end":900.56,"speaker":"Christian Roy","text":"Well, it's more down to earth than that. It's extension of the nervous system because technologies are extensions of specific organs as they appear in human history. The wheel is an extension of the foot, while the house also is an extension of the skin. This could go on for every medium you can identify what does this extend in man's basic physical equipment and on a physical basis. So the basic, the basic historical anthropological distinction for him is between oral odile tactile cultures, which is sort of the baseline of mankind for most of its history, and visual dominated cultures that structured by the phonetic Alphabet that first appear when Greeks adapt the Phoenician Alphabet. That is where the letters, the characters correspond to sound completely independent of any association with their shape, et cetera. It's completely arbitrary. But that gives amazing flexibility in applications to classify things and order them, categorize them. And that extends the reach of man. But it also extends a specific sense, which is the eyes. Because normally at the kind of baseline of oral or most traditional cultures, the common sense is, I guess. Well, there's a certain balance in the sensorium, in the general distribution of emphasis between the different sensory inputs. But the ones that can be said to give the tone for the whole thing is more the hearing and touch, which are related. Because touch is also about gaps. When you touch something, you don't merge with it. There's a sensitive gap, a resonant gap, you would say. So there's a continuity between that and sound. Now these sensations are kind of. They tend to be non specific, they're low def and low definition. And they surround you and you can't focus, you can't close your ears. You hear things in a kind of environmental way. So you receive all of experience kind of simultaneously, but in a sense in a kind of heterogeneous way, discontinuous way. Because you know things will stand out in very local ways that you can't really standardize it just all jumbled together. And if there is an order to emerge from that is through a kind of whole body attunement. When you listen to something and you attune yourself to the whole environment, which will in this context in our normal culture will be the whole tribal of communal environment. But there's not much of a distinction between the individual and the group. I mean, this distinction really arises once you have. With the phonetic Alphabet, you have to focus while abstracting from context to have a kind of. You have to focus on the characters and you have a kind of, let's say a mental image, schematic mental image concept. So you have a kind of pinpoint ability which you can use to sort things in very sectorial ways. So you can make the space more continuous. Therefore you can have citizens with equal rights in the community, called the police, the city, and have statues that are very clear and realistic, etc. It's very detailed because you can sort of surround visually what is given to you in experience survey, make it into the sum of individual parts. You know, rather than a kind of whole body experience that you just receive everything like a vision. You know, the vision is. Is kind of an acoustic thing. You know, there's many, many apparent paradoxes like that. But you receive things sort of frontally wherever you look in an acoustic state, because it's all kind of an apparition out of nowhere, like out of a fog or in the dark with a visual emphasis like the light is turned on and everything is very clear, very clear outline. There's little. Few surprises there, whereas everything is more or less a surprise in an acoustic space. It's like being in the fog, you sort of in wonder at whatever happens. So you have a more kind of magical or sacred relationship. If the lights are turned on and everything is sort of in its single place and not in ambivalent positions that could move without warning. It's much more predictable. So you can. A control of the environment is more possible there. So now that is. The classical Greeks were the first to pioneer that and to give us some of the key the basic elements of Western civilization. But things reverted to a more. More scribal and acoustic conditions in the Late Roman Empire and in the Near east, etc. And in the Middle Ages these were still large, largely still acoustic culture, even though they wrote manuscripts. Now what changes everything is the advent of print. I've argued in my article that actually the shift to visual dominance, and McLuhan recognizes this, had started at the very around the time of the Great Schisms. There was already a kind of visual bias, but it came to a head with interchangeable print where you could sort of. This segmentation, categorization, standardization could have a kind of mass dimension that could. It heightened Individual identity and also non local collective identity, like nations and churches. And sects had to be defined in yes or no, in or out terms that were very sharp. So there had multiplication of sects and of nation states rather than broad universal jurisdiction where you had a kind of, I guess a fractal relation between the local unit and the universal one. Now you had the standardized holes on a national or ideological scale. Now this started to change. That's the Gutenberg galaxy. But that begins to be. To shift to the. But that's the title of McLuhan's famous 1962 book, one of the first that made him famous on this revolution caused by print. Now that's followed that something changes altogether with the new electric media that begin with telegraph in the 1840s, followed by radio, telephone, television, computers. These are electric media. They're a new environment. And what they emphasize is what the organ they emphasize in different ways is the central nervous system itself. So it's your neural wiring, both physical and cerebral, that is altered. It's now centered on this external wiring of, well, physical wires. And now in a wireless way, a kind of diffuse global environment, which is what he meant by the global village, which has like the original oral village acoustic properties where again things like symbolism can find new currency in the way that they could not in the highly visual dominated, rationalistic, methodical and quantitative oriented world of the Gutenberg galaxy. So there are new opportunities, I guess, for interest in symbolism. And for him it shows in the new receptivity of contemporary man for tribal peoples, oriental religions and even the oriental forms of Christianity. You know, that's what my, my article dealt with. So these are the. The neo acoustic tradition, the neo tribal environment that is created by the extensions of the. The. The nervous system outside our body so that we have now actually ourselves and our consciousness is mostly outside of us. Yeah."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":900.72,"end":925.6,"speaker":"Jonathan Pageau","text":"So I think to me, one of the things that makes it difficult for me to kind of get into mechanics fluent is at first his terminology, for example, this oral versus visual terms. @ first you wonder why like you kind of wonder what he's saying because like you said, that there are certain aspects which, which you could say is visual, but he considers more oral, tactile, depending on. On its kind of integrative."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":925.6,"end":927.04,"speaker":"Christian Roy","text":"Yeah, exactly."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":927.04,"end":1003.97,"speaker":"Jonathan Pageau","text":"So he ends up, it ends up being more about something which is more kind of holistic, this kind of holistic experience versus something which is focused and segmented. And so if you understand it that way, then his terms start to make more sense. And you can see how the Progression that he talks about in terms of the Gutenberg galaxy or the Gutenberg Explosion, in terms of this hyper focus, this technical possibility of putting knowledge in books and in a way that was not possible before. Because in the world of the manuscript, even, let's say in the world of the ancient text, you would have a line of text. People don't realize that in ancient manuscripts there was no separation between words. You would just have a line of text which would cross the entire page. And the person reading, because it was low definition, as you mentioned, the person reading would have to buy his inner knowledge, separate the words, separate the paragraph, separate the sentences. And so with the Gutenberg explosion, there is a need to create these clear sentences, paragraphs, punctuation. All of this becomes hyper focus. All of this is happening at the same time. There's a shift in thinking."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1003.97,"end":1008.81,"speaker":"Christian Roy","text":"It seems individual access to standard text. It starts with the Bible."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1009.05,"end":1031.27,"speaker":"Jonathan Pageau","text":"Therefore, even the standardization, the absolute standardization of all texts becomes necessary because we're printing them. So we need to. Until now there is some variability which exists in the manuscripts because of transcription errors, because of, you know, different traditions of manuscripts that are somewhat standardized. But then when we get to the printed text, it has to be standardized."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1031.27,"end":1149.2,"speaker":"Christian Roy","text":"And dialects also you have to standardize national languages that are uniform within certain boundaries and that that applies to all of society. It has to be uniform so that there's interoperability between all the agencies and manifestation of these new extensions of man. They don't function if they don't have standardization on a certain territory. And now all that is upended when it becomes electric because the boundaries are fuzzy. Things that happen, you know, more and more of a global. Well, of course, the world had been globalized by capitalism, exploration already under Gutenberg. But it happens at the less territorial and more directly experiential level through the media themselves, starting with the telegraph, radio, et cetera, television, and now computers. So that, that becomes the primary reality actually of how we experience even ourselves through these reflections of these extensions. Well, you know, just look at smartphones. They've become a new organ that we've had for a dozen years. And ourselves, our very identity is complete, is centered in it. Now if someone loses their phone, they lose their face, their public face. And we come back, that's why we come back to a shame culture, as opposed to a guilt culture, which was a hallmark of more of, of the Gutenberg galaxy and alphabetic. We come back to oral conditions where the worst thing that can happen to you is to lose face, to be cancelled, to not have a good reputation in your immediate community to be shunned by your village, which is now the global village. Cancel culture."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1149.2,"end":1252.18,"speaker":"Jonathan Pageau","text":"Yeah, cancel culture is definitely part of it. We also notice in the age of the cell phone, in the age of the Internet especially, we can see the breakdown of grammar. There's a deliberate breakdown of grammar in order to manifest tribal affiliation. You can see that in meme culture, where they will on purpose, someone who can spell the word will on purpose, misspell words in order to create a sense of tribal group. And so McLuhan, even already in the 1960s, was seeing this retribalization which he talks about through electric media. Of course, he didn't have the Internet at the time, but he was definitely foreseeing something like the Internet. In the Playboy article which he gave, he really does talk about this interconnectivity and this exteriorization and how it's going to lead to retribalization. What's fascinating about his interpretation is that he was predicting, you know, he was predicting a return to ethnic conflict, a return to tribal conflict in terms of nations and everything. One of the things I don't know if he foresaw was rather what people are talking about right now in terms of mimetic tribes, which is that we. We have broken down into tribes. But these tribes are these strange ideological tribes which are not centered in space. And so you have online tribes which. Which connect to each other and these online. And they're not related to your local."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1252.5,"end":1338.56,"speaker":"Christian Roy","text":"They're not spatial. They're not spatial. They're. They're entirely in this. This new subtle dimension of an outer psyche, of an outer worrying, of an outer brain, really an outer collective planetary brain. That's what they are. And you just mentioned the McLuhan article. We should, I guess, specify what we're talking about. This interview is based, aside from our own article on McLuhan's two contributions to Playboy magazine, which are actually probably the best introduction to his thought. This famous. A very long interview in the April 16, 1969 issue, which is very well known, included in anthologies like this one. The Central McLuhan. There's also a less known article by him, April 19th. No, December 1968, which we also read in preparation of this interview. So, but. So the McLuhan interview in Playboy is one of the few he didn't like interview. He would. He would just sort of rumble out, you know, spin out his ideas. But he didn't like the interview format because it would pin him down, you know, and extensions of man yeah, you."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1338.56,"end":1342.28,"speaker":"Jonathan Pageau","text":"Can turn it off and then. Yeah, I'll cut that out."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1342.28,"end":1352.44,"speaker":"Christian Roy","text":"Don't worry. Well, I think it's pretty good. Illustrates my point. Yeah, exactly. I feel like I've cut a limb."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1352.44,"end":1354.8,"speaker":"Jonathan Pageau","text":"Yeah, you cut a limb off and throw his phone away."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1355.76,"end":1373.96,"speaker":"Christian Roy","text":"But throw out your eye if it offends you and, you know, if it causes you to sin. And probably it's something that I think in his more sober. Sober moods, in my countenance, you know."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1376.44,"end":1377.32,"speaker":"Jonathan Pageau","text":"To cut that off."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1377.72,"end":1386.68,"speaker":"Christian Roy","text":"Yeah. And of course, to him with electric conditions, it's. The deal is a near for an eye, you know. Yeah."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1386.68,"end":1446.02,"speaker":"Jonathan Pageau","text":"And you mentioned that in his article. So McLuhan saw this retribalization. One of the things that I struggle with or one of the things that I'm. I see that he talks about, but I'm not sure. I don't know how clearly he saw it or if he was just kind of. He seemed to have some weird kind of prophetic capacity is. He talks about retribalization. He talks about the breakdown, this return to these tribal identities. You could say this is something that I've noticed as well, the return of identity in different manners. It seems to be coming back, you know, in some scary and some more interesting ways. But then he also talks about how that will lead or that is also part of this global village. And so on the one hand, you have a retribalization, but on the other hand, you have what he talks about in terms of moving towards a kind of unifying world or a unified world under this new global consciousness or this conscience that will rise above the."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1446.9,"end":1485.95,"speaker":"Christian Roy","text":"Well, it's not. It's less. It less under or over. But that's. As you know, it's. Well, yes, it's hard to follow him there because there's these two aspects, tribalization and global consciousness. So the tribal aspect, what he describes in 1969, there too, is amazing resonance. He talks about the impending civil war of the United States that will not. Will not survive long as a unified country will. Will break up into many states along racial and regional lines."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1487.15,"end":1501.19,"speaker":"Jonathan Pageau","text":"The problem is that if. I don't know if he would have seen that, what he's suggesting has become even more complicated through this memetic tribe. And so it's. It's almost now impossible to think of the United States breaking down in regional."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1501.19,"end":1502.59,"speaker":"Christian Roy","text":"That's it. Yeah, because."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1502.59,"end":1508.83,"speaker":"Jonathan Pageau","text":"Because now it's. It's all through the system. You have these different groups that are set up."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1508.91,"end":1513.87,"speaker":"Christian Roy","text":"These tribes are entirely online. Really. You don't have much of A geographic."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1514.19,"end":1526.27,"speaker":"Jonathan Pageau","text":"Base unless people come out and start burning buildings, as we saw this year. It's like the conflict is emerging, is popping out into the real world right now."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1526.67,"end":1527.71,"speaker":"Christian Roy","text":"But it starts online."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1527.95,"end":1579.64,"speaker":"Jonathan Pageau","text":"Exactly. It all starts based online. It is, yeah, you're totally right. It's. And cancel culture is based online. And so this is really. I mean, this is the place where I struggle, although it's like I struggle to understand him because he talks about a return to mimetic, or he doesn't use memetic, but a return to tribalism, A. A less individualized society, a society which is more based on group affiliation. But then he also talks about this kind of desire for global consciousness. And I see it, to me it doesn't make sense, but I see it around me everywhere. That is the narrative that is being proposed to us in terms of global culture is exactly that, right? Yeah, it's a kind of idea of like a diversity, but at the same time everybody is in the same global culture."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1580.44,"end":1620.21,"speaker":"Christian Roy","text":"There's an element of that. But he's not being ideological here. No, from it, far from it. You know, his own stance really. Basically he'd like to be a hobbit. You know, he'd like to be in a constant small scale, craft based, semi scribal culture that didn't really change. But he has to deal with the culture in which he's born and he tries not to have value judgments about it. So he's just describing it. And yet. So it sort of plays with what it could become. It plays. Could be something not that bad. Something actually like a village, except on a different scale, but which could also be a nightmare, you know."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1620.93,"end":1651.23,"speaker":"Jonathan Pageau","text":"So one of the most astounding two images that he proposes in the same interview, in this paper interview is that on the one hand he moves. At first he's talking about media, but then he moves in a weird mystical space where he talks about what's coming as replacing or being analogous to the body of Christ in the church, but at a global scale. And so there's a. There's a strange move towards this image. But then he also says maybe it could also be the Antichrist."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1651.23,"end":1651.71,"speaker":"Christian Roy","text":"Yeah."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1651.71,"end":1662.27,"speaker":"Jonathan Pageau","text":"And so, and so I'm wondering if he and other places, if you've seen him talk about this or what he. What would differentiate that and if not what you think would differentiate the two."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":1662.43,"end":2020.09,"speaker":"Christian Roy","text":"So I've been thinking about, about that because it's rarely clear. I mean, for every instance where he seems to. To lean in one direction, you can find another where he leans the Other. And that happens in this very. Within a couple of pages in this Playboy interview. That's what happens. You know, it could fulfill the times on a galactic scale. You know, it's kind of. I mean, it's. Well, it's transhumanist territory, really. You know, it's a kind of global consciousness that would have shifted with no distinction between the individual and the collective and would expand throughout the universe and reshape it in a kind of artistic way. It would sort of refashion itself in an artistic way. Well, that's his optimistic hypothesis. Well, I want to come back first to the tension with how can that happen at the same time as the retribalization? Well, what's in common is that at both the tribal and the global level, the individual sort of merges back into the more oral collective, I guess. He suggests that since it's the same electronic elements, even these tribal conflicts are. Well, they could settle. Well, he's talking in 1969. It could settle into some kind of accepted diversity where every tribe would appreciate the other one as a tribe within this common element. Well, he doesn't. I mean, other places, he says, well, a global village is not about, you know, peace and harmony. It means that you're always too close for comfort and looking over your shoulder and thinking that someone might have cursed you and et cetera, you have the evil eye and you're almost on the edge of being at each other's throat. And so it's not a cozy place. So he always. His way of thinking is by sending out probes, in a sense, literally throwing out ideas into this new environment and see what sticks, playing with them, and see what echo would come back. See what. So some different probes, different instances of his speculations give different results at different times. So they're all possibilities to entertain. But I guess at that particular fireside chat, he was in a relatively good mood. So he tried to entertain the more possible positive side of things, where he thought that maybe the creativity that he drew personally from his literate culture and then the avant garde figures in Western literature that sort of foresaw the changes ahead. Maybe if the creativity of a Joyce or a Pound or an Elliot, maybe it could be shifted to the global electric neo acoustic environment which they foreshadowed in their work. So that's an optimistic hypothesis. But my perception of that is you can't have creativity on a kind of. For a collective brain on the scale of a planet. You have to have embodiment in a finite self that has to Find its ways around the different dimensions of its finitude in space and time. Aesthetic and spiritual wonder at its own contingency, trying to renegotiate the different parameters of its embodied. Of embodied existence every moment. It's something that artists do by feeling out the environment, seeing how things could be. Experiencing and enacting how things could be reconfigured, how the connections could be made with these different dimensions of the self. I don't see this being uploaded to a collective artificial intelligence. It would just go on, you know, like a Borg or whatever, you know, I mean, how else do you imagine something spreading like that to the earth and beyond? You know? Reminds me, you know, of the projected ending of Jodorowsky's Dune, you know, where. Where there's. There's a kind of collective awakening. Well, the. The Messiah, Paul Muadib, is killed. But everyone says, I am Paul. I'm Paul, I'm Paul. And the whole planet starts to move through the universe to bring in a collective enlightenment to the whole universe of this collective consciousness. It's a kind of 60s, you know, it doesn't age well."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2022.93,"end":2168.22,"speaker":"Jonathan Pageau","text":"But I think that there's something about his apocalypticism which is interesting in the sense that there, you know, you see, in the Christian tradition, you'll see this notion of the two versions of the Last Judgment. Christ talks about how the wheats and the tares are growing together, and that it's only at the end that we'll be able to separate the wheat from the tares. And so I think that maybe his intuition was something like that where he was. He was seeing that in this increase in technicity, that there's extreme danger and extreme, extreme danger of falsification, of chaos, of pride. But at the same time, he can't completely discount it. He sees there's also positive in it. And he was struggling to separate the two. But it's a strange thing, because even in terms of the difference between Christ and Antichrist, everybody thinks that they'll be the one who can tell the difference. But it's very difficult to know the difference between. Let's say, an example in Scripture, the difference between Judas telling Christ that they should use the money to help the poor and Christ telling us to help the poor. And so what is the difference? There is a difference between the two. But I think that it's easy to be seduced by one or the other. It's easy to be seduced by the falsification. And in terms of. I think that. I wonder in terms of where we're seeing it go now, in terms of the little versions of what he's talking about, like something like Facebook or Twitter or even Google itself, we can really perceive the dark aspects of this kind of global consciousness or this global brain. We can see it taking form in front of us. And it doesn't necessarily look pretty because it too easily becomes a frame that can be manipulated. And once we're connected to it, then that manipulation becomes 1984 style, the inevitability of reality. Like that first page of Google. The first page of Google search has become the new frame of many people's perception."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2168.94,"end":2244.19,"speaker":"Christian Roy","text":"Except there's no big Brother in this constellation. No one in particular is ordering all of this. Anyone who does is itself a dispensable organ of that configuration which has a mind of its own. Our mind is mostly already offloaded up there. And to come back to the contrast of tribalization and globalization, well, what we're experiencing now is both at once. Tribalization heightens our fascination, our absorption and migration into the global medium. That's where our being is. And the more we're excited about tribal conflict, the more we are the global consciousness. So. And sorry for those who think that, you know, vaccines or viruses or whatever are going to invade your body from outside, you're already inside the beast. I like to say we're already intestinal flora in the belly of the beast. Yeah. That you have to deal with that. It's not coming from outside. You're already being digested. You're part of its metabolism. So what do we do with that?"}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2244.19,"end":2281.74,"speaker":"Jonathan Pageau","text":"Yeah, but would you like one of the ways to understand it? This is a way that is going to say, scare people when I say it. But to me, a way of understanding it has to do with talking about the traditions in Enoch, right. This. This notion of the fallen angel or this notion of the principality which falls into the world and brings about the mechanical world or the metallurgic world that is there before the flood, you know. And so when we say that there's nothing, say, controlling it, to me, all bodies need principalities."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2281.74,"end":2282.26,"speaker":"Christian Roy","text":"Okay."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2282.26,"end":2283.78,"speaker":"Jonathan Pageau","text":"And so I can't. I."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2284.34,"end":2285.86,"speaker":"Christian Roy","text":"Let's say nobody in particular."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2286.26,"end":2319.71,"speaker":"Jonathan Pageau","text":"Right. But there are. To me, there has to be some principalities that are. That are using this as a. As a body. And so I don't. I don't necessarily. And I don't want to free. I don't want people to be freaked out, like I'm thinking, but I think that there's an inevitability. And because the system, like, because the systems are geared towards our passions. Let's say it's clear that Facebook and Twitter use our irascible passions to stay alive. That's how they feed on our conflict with each other."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2319.95,"end":2340.66,"speaker":"Christian Roy","text":"It matters not one wit which side you're on in the culture war. The deeper you're in, well, on whatever side, the deeper you're within the one subject that, that is of this. This whole thing that you think you're fighting, you know."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2341.62,"end":2367.36,"speaker":"Jonathan Pageau","text":"Yeah, well, there has been. There has been a. Let's say, I think there has been some efforts on part of some of the media techs to take sides. But every time they really do take a side, they. They in the end end up weakening their own beast because like you said, it feeds off conflict. If you say we're going to remove extremes from this side, then they're weakening themselves because they're fragmenting."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2367.6,"end":2550.05,"speaker":"Christian Roy","text":"Like Zuckerberg did a few days back while saying, well, you know, the new documentary on social media, you know, we're starting to deal with content, so it's going to be under control. But that's not the point. That's the basic McLuhan point. Doesn't. The content is not the issue, it's the medium. That's where the subject, your consciousness is. It doesn't matter what the particular motif emerges in that element. It's the element itself. And how do you even perceive this element? You know, like he liked often said, you know, we're not sure who discovered water, but we're pretty sure it wasn't a fish. You know, you need a counter environment. Like him, he could perceive what was happening because, well, as a literate man, he was outside the electric environment to some degree. But unlike other illiterate men of his of his day, he could also. He could not. He could not pretend that his familiar categories of written texts shielded him from the outside world of advertisement and the actual life of contents of the consciousness of his student. Not the contents, but the fabric of the human mind as it existed in the young minds he faced as a professor. So it's not a matter of the contest, it's the medium itself, this electric psyche that we have. And I might get into scary territory too, but I like to think of it in terms of an egregore, which is a term from occultism, about a kind of emergent collective being that comes from an entanglement of an enmeshing, I guess, of different intentionalities, different consciousness that become a mind of their own. So a civilization or a religion could be an egregore. But these things, you know, it's a psychic entity that exists on its own. Well, egregore means from the herd. You know, it's something constituted from. It's a herd mind that exists independently of its individual constituents. So that thing that we're drifting on or part of has a mind of its own, and it probably has some kind of weird intentionality that we can't fathom. You know, it's a psychic entity that happens to have an electric body, you know? Know."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2550.05,"end":2627.33,"speaker":"Jonathan Pageau","text":"Yeah, but that's where I, that's where to me, at least under. Seeing this happen and like you said, noticing it and noticing that its intention is beyond the individual intentions of those involved. And you can see it like, you can. You can see that Zuckerberg and what's his name, the CEO of Twitter. They're. They're. They can't control their monster anymore. They're. It's completely out of control for them. And they keep saying they'll do it, but they can't. And so you can notice that these things have a will of their own based on the very. On the patterns that were set up in the beginning as they were coming to life. And this is where, to me, it helps me to understand the idea of fallen angels. It really helps me to understand what fallen angels can mean, how principalities can fall into aggregate bodies and start to manifest patterns which are. Are disjuncted. They're. They're real and. But they're, They're. They're destructive in the sense that they. That they're feeding on their. They're. They're feeding on each other, and they're. They're not. Let's say they're feeding on the energy of the people, almost like a weird parasite, but it's not a parasite because it's. We are the ones who are giving it its energy for it to exist."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2627.33,"end":2641.16,"speaker":"Christian Roy","text":"And because it's not individuated, it's kind of invulnerable. You know, you can't pin it down and say, oh, if we pin it. If we strike it there. No, it won't stay there. It's so diffuse. Yeah, well, it's viral, you know."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2645.64,"end":2696.92,"speaker":"Jonathan Pageau","text":"And so to me, it's very fascinating to see that McLuhan seems to have had, even before the Internet, seems to have had a intuition of how this was, was kind of move it where it was going. But in order to not be too negative, I think one of the things you explore in the article and one of the things I want to explore with you is because it is a breakdown of this Gutenberg galaxy, because this new electric world, this new electric acoustic world of tribalism, there is in that nonetheless an opening to talk about a more symbolic vision, a more connected vision and a more. Even within the chaos, to introduce a more kind of holistic, coherent vision of the world."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2696.92,"end":2874.38,"speaker":"Christian Roy","text":"But you're living proof of it. We are also psychic projections are already existing in that element, and yet we point to something else, maybe not outside, but certainly inside each still existing embodied subject, caught up as we are in this psychic flood. So it's an element that is conducive to symbolism as well as confusion and also to the confusion of symbolism. So discernment and attempts at. At embodied focus, such as what a spiritual or ritual practice can provide is of the essence here. If we want to retain our humanity and maybe recover an integrity of a different kind than just going and merging with the maelstrom of the electric beast. This would, I mean, a few decades ago, if you would refer to the divine, what would you show? You would show Michelangelo's 16 Chapel, you know, a piece of meat hanging in midair and gesturing to another piece of meat, but in a wonderfully realistic detail. And that would be. It's the idea of the divine that each atheist still propagate. You know, that when they think of religion. Oh, it's the. It's what? Well, people are generally spiritual now. They hardly bother with that. What they know to be spiritual is an icon, a mandala, something from an archaic culture, a tribal culture. Well, a non Gutenberg culture, even a Christian one. And that's because of the rebalancing of the sensorium that's happened thanks to the breakdown of the Gutenberg galaxy under the impact of the Marconi constellation that is now coming to its full flowering with our uploading in a global, instantaneous, electronic and cybernetic environment. So, yes, even, even as, as, you know, tiny microbes in the belly of the beast, we're still an element of. We can still regain some. We can ourselves become the parasites of that larger, very ambiguous being."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2874.38,"end":2909.35,"speaker":"Jonathan Pageau","text":"Yeah, no, no, but I agree. I think that this is one of the reasons why I talk about what I call the double inversion, or, you know, this, the. The fool at the end, which turns things back, which is that in the world that. In the world of the beast, like when the, let's say this beast has taken over, you know, those that constitute some form of normal hierarchy appear as a parasite that finds some food actually in the belly of the beast to point people back towards the. And use."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2909.51,"end":2909.99,"speaker":"Christian Roy","text":"It's like."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2909.99,"end":2959.04,"speaker":"Jonathan Pageau","text":"That's why one of the reasons why I talk about monsters and peripheral things is because I can. I can. Because that's where we. That's what we're in. We're in this weird egregore of disparate elements which are nonetheless connected together in a kind of chaotic manner and manifest will, you know, that in that there's food to point back towards a kind of normal. Kind of normal order which also includes the monsters on the edge and includes, you know, the leviathan, which is the beasts that are on the edge. And so I think that there's hope, maybe not for everything, but there's hope at least for a remainder or a small ark that can float inside the digestive track of the beast."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":2960.56,"end":3156.17,"speaker":"Christian Roy","text":"Yeah, but we have to be sort of nimble, you know. Well, of course. Yeah. Well, McLuhan's, you know, classic simile for the situation in which it, you know, it was the Descent into the maelstrom by Edgar Allan Poe. You know, where this guy is in a shipwreck, his ship is, you know, he's floating around. The debris of his ship are circling in this huge whirlpool that's emerging the ocean and falling into this black hole. But so he sees the end approaching with every turn, every revolution of the mindless spin. And yet he observes among the debris, some that are floating, well, some faster with the current, some slower, some actually even opposite the current. He realizes that there are some counter currents there. So he manages, I believe, to swim to one that flows in the opposite direction, that goes up, that goes not down, but up to the sea and beyond the pull of the maelstrom. And that was McLuhan's wager. So if we understand the medium that we're immersed in that's sucking us into a black hole imploding before us. We have to learn to swim it and navigate the currents and counter currents. So we first have to. To observe it, but not necessarily in a visual way. We have to feel our way through it, in a sense, actually bring to bear all our senses, including the distinct sense that McLuhan saw in faith itself. He describes faith, Catholic faith, in his terms as something completely different from what people understand. It's not a concept in the sense of a belief or a trust, etc. It's a percept. It's a sensibility to certain resonant harmonies between realities, visible and invisible, that are like a six to sense, that structures the interplay of the five other ones, the spiritual sense the percept, which is not based on distance, but not on incomplete immersion either, but in awareness of the interplay and the resonance between different levels, different currents, etc. So that's what we need to develop. And, you know, certain spiritual disciplines are probably the best bet to navigate that, as long as we're not too stuck in their form. And we can also bring discernment to just the element that we're immersed in, the resonance among its chaotic debris, the flotsam surrounding us. See, there are things that we can use to build the raft and maybe guide it to the surface."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":3157.45,"end":3197.31,"speaker":"Jonathan Pageau","text":"All right, well, I think that on that note of hope is probably a good place to finish our conversation. And so I just want to, I want to thank you for this moment. I hope that everybody, this has been useful to kind of begin or to think about this exploration of McLuhan, who was a strange, in a way, strange modern prophet who perceived what was happening. And I think, Christian, your call for us to be aware of where we are, not be naive about the environment in which we are living so that we can navigate it as best we can so that we can change the death into something better. So thanks for your time."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":3197.87,"end":3198.43,"speaker":"Christian Roy","text":"Thank you."}
{"episode_id":"SW - #126 - 2020-11-30 - Christian Roy - Marshall McLuhan and the Electric Nervous System of Antichrist","start":3199.39,"end":3264.28,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
