{"episode_id":"SW - #215 - 2022-01-27 - Weaponized Compassion","start":0.08,"end":1165.02,"speaker":"Jonathan Pageau","text":"One of the interesting aspects of the story of Christ, and the Christian story in general, is that within the story of Christ, you see that Christ chose his own betrayer. And this, of course, is a testimony to how, in a larger sense in Christianity we have the sense that Antichrist will rise out of Christianity, will appear as a side effect or a kind of a strange deformation of the Christian message. And so there are several aspects to Antichrist. I'm going to look especially at one which I called something like weaponized compassion, and we will see this version or this aspect of Antichrist, especially in the story of Judas Iscariot, who is the disciple that Christ chose, who ultimately ended up betraying him. This is Jonathan Peugeot. Welcome to the symbolic world. And so there are several aspects of Antichrist. There are two aspects which we could see almost as something like, opposed to each other, or two extremes of what Antichrist looks like. The one that people usually tend to look upon is the empire idea of Antichrist or the beast, this notion of Rome and as being something like the whore of Babylon. All this kind of imagery of Antichrist, and it especially happened in the Protestant Reformation, where the notion of the relationship between the Catholic Church and Rome was related to a certain extent with the idea of a kind of parody of Christ and of Christ's message and something like Antichrist. And there's something about that which is interesting because there is an aspect in the story of Christ of Antichrist, you could say, which. Which is related to St. Peter, because St. Peter is of course, the one who denies Christ. St. Peter is also the one who, although he is the first one to recognize Christ, he ultimately refuses one aspect of Christ, refuses for a certain amount of time, one aspect of Christ's message, which is that Christ must die. And when St. Peter wants to oppose that, wants to say that Christ will not die on the cross, then that is when Christ tells St. Peter, get behind me, Satan. And so, of course, St. Peter is important. And there's a very positive aspect of St Peter which is true and which is good to understand. But the story of Christ is very complex and contains all this subtlety within it. And one of the aspects of St. Peter, of the strength of the Christian story and the strength of the, let's say, the possibilities of Christianity also has a dark side, which is the possibility of pride, the possibility of not thinking that Christianity is about self sacrifice and the willingness to die for others and the willingness to die in general. But there is also a flip side to that image of Antichrist, which is that although Christ tells us to care for the poor, tells us to tend to the orphan and the widow and to care for the weak, to to be attentive to the margins, to be attentive to those that are usually excluded, cast out. There is also a dark side to that, which is the Antichrist aspect of it, which is something that we could call weaponized compassion. And this version of weaponized compassion appears in the other disciple in the story of Christ that has to do with this Antichrist aspect, and that is, of course, Judas Iscariot. Now, Judas Iscariot is the one who betrays Christ, ultimately betrays him with a kiss. And this is related to this weaponized compassion that we see in the story of Judas and that we will especially see in the story where Mary of Bethany washes Christ's feet. So I'm going to read the text with you, and we're going to look at what's going on in the story and what that can mean for us, especially today, because we are faced with some of that. And it tends to confuse Christians just like also when Christianity is strong and empire like, it can also, let's say, confuse some Christians as to what the real goal of Christianity is. And so the text appears in the Gospel of St. John, chapter 12, starting at verse one. Six days before the passover, Jesus therefore came to Bethany, where Lazarus was, whom Jesus had raised from the dead. So they gave a dinner for him. Martha served, and Lazarus was one of those reclining with him at table. Mary therefore took a pound of expensive ointment made from pure nard and anointed the feet of Jesus and wiped his feet with her hair. The house was filled with the fragrance of the perfume. But Judas Iscariot, one of his disciples, who was about to betray him, said, why was this ointment not sold for 300 denarii and given to the poor? He said this not because he cared for the poor, but because he was a thick thief. And having charge of the money bag, he used to help himself to what was put into it. Jesus said, leave her alone so that she may keep it for the day of my burial. For the poor you always have with you, but you do not always have me. And so what's going on in this story? We have an image of a woman who takes. Takes something very expensive and. And focuses it on worship. Now, we could understand that as many things, of course, we could understand it in general of the idea of creating beauty in order to worship God. We could also understand it in terms of the amount of attention the amount of time and resources and valuable things that we put into the service of worshiping Christ. And so the trick that Judas wants to take is he wants to take a good, which is caring for the poor. Now, of course, caring for the poor is a good. Not only is it a good, but it is a good that Christ himself has asked us to do. Christ is constantly telling people to care for the poor and to help the weak, but he's trying to make that good into the highest good. And this is where there is a problem. And so he tells the woman that she should not have used this expensive thing, this precious thing to worship Christ, but that she should have used it and sold it and given it to the poor. Now, what's interesting in this is this is why I called it weaponized compassion. Because ultimately Judas doesn't care for the poor. What Judas wants is to acquire power for himself. And so he wants her to sell this for money so that he can dip into the money bag and. And take the money for himself. Now, of course, this is very specific in the story, but you can understand that in many ways, which is that many people can use compassion or use compassion as a weapon in order to acquire power for themselves. Now, this is a temptation which is becoming stronger and stronger in the Christian church. It is something which is blinding many Christians to. To some aspects of what is going on around them. And because they don't know how to react to it, there is a tendency to make people feel guilty about their own Christian values, to make them feel as if those very Christian values, the very Christian beliefs they have, is somehow a compromise in compassion, and that if they were truly compassionate, they would actually sacrifice their own compassion, Christian beliefs. The ultimate version of something like this is in the movie Silence, which many of you have probably seen in this movie. A Christian missionary is sent to Japan. And the Christian missionary is faced with a serious problem, which is that in trying to support the Christian church there, the Japanese authorities realize that if we torture the missionaries, we have a problem because the missionaries are willing to die to for their faith. But if we torture other people, then that is putting the right pressure on the missionaries because their own values, their own compassion will compel them to deny their faith in order to preserve the life of others. And so, of course, I can't imagine being in that situation. It's a horrible situation to be in. And I don't want to judge anybody who's in this situation who would have compromised or fallen. But the very fact that this is framed in the story that in the story, there is a sense in which although the missionary denied his faith and ended up completely denying his own belief in Christ and his own attachment to God, ultimately there was something holy about that very action. And it's shown that in the end, when he is. When he's dying and he's being cremated, we see that there's a little cross hidden on him or something like that. And that is to show that somehow the very denial of his faith was done out of compassion. And that this would be the ultimate Christian act, in a way, would be to deny your faith out of compassion. And so you can apply this problem to many, many other things. You can apply it, of course, right now to many social issues in which those social issues are related to things that Christians hold dear in. In their values. But there is a pressure. There is a pressure on Christians to, out of compassion, to deny their own stance. That is, not only have compassion for the weak, have compassion for the sinners, have compassion for people who are not able to hold the standard, because who can, like no one. No Christian can hold the ultimate standard that Christ lays out for us. But that compromising on your standard would be a. A more Christian thing to do than to simply love others and be compassionate while holding to the highest standard. Now, there's a place where you see that happen all the time. But there's another aspect of this which is going on right now, which is related almost directly to the story of Judas and the notion of compromising worship in the name of something else, compromising worship in the name of compassion. There is a narrative which is being pushed and which is very strong. And it's strong because it's also long, it's enduring. You know, it's been two years now where people are being told that Christians shouldn't commune and worship together out of compassion for others. That is, that out of a desire to preserve the weak and to preserve the helpless, people should, should sacrifice worship and should not practice the Christian practices of singing together before their God, of communing together to the holy sacraments. And this is a very, very fascinating thing because you can see that in a way, it is a very strong tool. It is a very strong tool because it dives right into what Christians believe, and it dives right into the Christian's high values and. And tries to set those values up as the highest above what is more important, which is worship and submission to God. And you see it. You actually see it very interestingly. You can notice that if you look at the difference between Pope Benedict and Pope Francis. It's very fascinating because Pope Benedict wanted to bring back worship. And so he brought out some old crosses that were in treasuries and wanted to kind of to show the beauty with vestments and this kind of beautiful aspect of the Christian liturgical services and Christian worship. And he was eviscerated. He was eviscerated by the media, eviscerated by people ultimately who hate Christianity, let's be honest. But nonetheless, there was a manner in which people gobbled it up and people completely gave in to this narrative. And now here comes Pope Francis, who is the very opposite of, who tends to, let's say, play down the worship aspect of the church and play up the social aspect of the church, play up the idea of helping the poor. And there is absolutely nothing wrong. Of course, it is wonderful for Christians to help the poor, but the notion that we should, the notion that worshiping Christ is somehow bad and that putting valuable things in the service and worship of God is somehow horrible and, and disconnected, whereas helping the poor is something that everybody loves and everybody find is beautiful, I think is definitely an issue. And it's an issue that, although I sympathize with Christians who struggle to see the normal hierarchy, this is actually the normal hierarchy of being. This is really representing the manner in which attention to the highest worship of God, you know, placing yourself in the right position to. Towards God alone and together in a communion and, you know, engaging in the liturgical dance, engaging in the grand singing and dancing of worship is more important than the social actions of the church. And of course, I know some people are going to watch this and going to get angry and think that I am somehow diminishing or bringing down the idea of helping the poor. And of course not. I spent seven years of my life as a volunteer in Africa in the desire to serve Christ in that manner. But nonetheless, I still need to re. Emphasize the natural, the normal hierarchy of things, which is that if you try to sacrifice the top part for the second part, you are going to break down. And you can see that in many of the churches that have embraced social justice, no matter how they phrase it as their highest value, higher than their creed, higher than their own original beliefs, higher than the values which were given to them from the apostles all the way then. And they're willing to even sometimes criticize Scripture, criticize the saints in order to bring about this social justice transformation that they want, it's not going to work. It's going to break down. It's going to lead to a breakdown because it doesn't follow the normal. If you focus on secondary goods as the highest good, no matter how good it is, it will ultimately lead to a breakdown. One of the key ways to recognize if what is being used or what is being promoted is something like weaponized compassion is to look at the power aspect. Because one of the ways that we can see it in the story of Judas is that Judas is telling someone else to be compassionate and is reproaching someone else for not being compassionate with the purpose of gaining power for themselves. And so this is the best way to see whether or not this is weaponized compassion. And I think that we have seen plenty of that in the past two years. We have seen plenty of authorities tell us that we need to act in this or that way in. In order to be compassionate. And what's interesting is that, you know, on the one hand, there's this idea that you are not being compassionate, you are being selfish by not doing this or that. But then when you look behind you, the same authorities are holding a massive baseball bat over your head. And the consequence for not being compassionate is that you will feel the brunt of their raw power on you. And you also notice that, that ultimately the action that they want you to pose is to the increase of their power on you and the increase to their power on others. And so this is the way in which you can recognize, weaponize compassion. It's that it is ultimately a making you feel bad about something in order to acquire power for the people who are promoting this. Compassion is something which is freely given. Compassion is something which we should always be examining ourselves to see whether or not we are being compassionate and what is the motivation of our actions. We should not be trying to impose compassion on others. This is something which you do not see in the Christian story, you know, that is, there is no law towards compassion. There is no rule which makes you compassionate. You can follow all the rules you want. Compassion is a disposition of the heart. Compassion is a disposition of the person. It is not about rules and about following this or that thing. You could act in ways that look very compassionate on the outside and are very selfish inside and vice versa. And so compassion is not something which is subject to the law. It is something which is subject to the heart. And this is, of course, the very difference that Christ brings to us, which is the difference between the externals and the external law, which is useful and helpful, and the. The inner true reason of why someone is acting. And so when you see someone, or when you see an organization try to impose compassion by law, or try to make you feel as if, you know, by not being compassionate, you are going to receive the full brunt of the modern state, then we have a serious problem. And so of course, I do not want to say that there isn't also the other aspect of Antichrist, which is the aspect of believing that Christianity is a political weapon, believing that Christianity is a tool for nationalism. All these things exist, and they exist now, let's be honest, the prideful aspect of the Antichrist, but the other aspect, the weaponized compassion one, is an aspect which I think is more misunderstood today. And it would be helpful for us to understand that as we continue to face the crisis that we are dealing with, you know, that we've been dealing with for the past few years. And so I hope this was helpful to help you understand some aspects of this pattern. And I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved through There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
