{"episode_id":"SW - #051 - 2019-08-21 - The Symbolism of Hair","start":0.72,"end":64.77,"speaker":"Jonathan Pageau","text":"In this episode of the Symbolic World podcast, we're going to talk about hair. I'm going to play for you back to back two of the videos that I put out on the symbolism of hair. The first one was called the Symbolism of Hair, looking especially at the symbolism of hair in scripture and how it relates to the garments of skin, to death, to the periphery. And then I will play for you another video that I had put up on the story of Rapunzel. In that part, I will be applying the symbolism that I explained in the first part and I will be applying, applying it to that fairy tale to show just how coherent and how universal the symbolism of hair is. So I hope you enjoy that. Don't forget that everything I'm doing here on the Symbolic World podcast is due to your generous support. So go check out the symbolicworld.com to see how it is that you can support this podcast. Of course, sharing, subscribing and leaving a five star review. Hopefully wherever it is you listen to podcasts, I hear that that's one of the best ways to get the word out and so enjoy the symbolism of hair."}
{"episode_id":"SW - #051 - 2019-08-21 - The Symbolism of Hair","start":77.89,"end":81.57,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #051 - 2019-08-21 - The Symbolism of Hair","start":88.64,"end":2249.61,"speaker":"Jonathan Pageau","text":"Foreign. The discussion in this video is going to be about hair. It is a very difficult discussion and that's why I, in a certain manner took so long before Jacob asked me to make this video to get to it. The reason why it took so long is I needed to make a few videos, hopefully to prepare people in their thinking for this video. That's why I made the video for the One Ring in Lord of the Rings. And, and I also put up this last video on technology because hair is a. It has to do with a very large paradox in scripture which I've talked about quite a bit, which is the relationship between death and glory. How in the story of scripture, glory turns into death, but then also death is turned into glory. And we see that, of course, when I say that there's an intuition, we have this intuition that it's right. You know, think about how we celebrate war heroes, but also think of the story of Christ himself, who on the cross brought those elements together, where he was both in his lowest point in terms of dying, but also as Christians, we believe that he was also attaining the highest point and entering into the holy of Holies of the temple at the same time. And so those two things come together. So seems like a paradox, but hopefully I'll be able to at least point you to some elements which can help you understand how this is possible. And it's important to understand that because of what's happening right now and because of all the things that happen in society, it seems like we need more people who are able to flip the script, who are able to change death back into glory. And so hopefully this will be a little bit of a help. And so when we look at hair, we have to understand, we have to look at hair, just look at what it is. That's always a key to understanding what symbolism is. What is hair? How does it function? Not in terms of scientific composition, but really in terms of how we experience hair. And when we kind of understand that, we'll be able to understand how it works. What's the function of hair? Well, we know that hair is there to protect you, right? You have hair all over your body. You have hair on your head to protect you from the sun, to protect you from the cold. You have eyebrows to protect, know, your eyes from sweat. And so hair is related to this notion of the garments of skin. So I've mentioned this a hundred times before, but for those who haven't heard it, when Adam and Eve fell in the Garden of Eden, God gave them these garments of skin. And the garments of skin have to be understood as this kind of layer of death that is put around Adam and Eve in order to protect them from the world of death. And so it's like a layer of death to protect you from death. And you can understand that in terms of hair is a perfect example because hair is dead. And this is explicitly mentioned in the church fathers, especially St. Gregor of Nyssa, who talks about how hair is a symbol of death because it doesn't have any feeling. And because, you know, and we can keep going because it is the thing which grows out of you, but. But then is also not totally you. And so as we understand this notion of something which grows out of you but is not completely you, it's like a dead version of you. We can understand it, we can extend it to pretty much everything which is external to you. So we have to link this symbolism of hair to the symbolism of power. Of power to act in the world, or strength, strength to be able to act in a world. Because all that you do, let's say you build a house, let's say you write something, let's say all your actions are coming from you, but they are also these remnants of you. There are also these dead aspects of you, but they are not only that, but they are also your glory, because they are that which comes out of you. And also that's what People see of you, and so they also act as this glory. Okay? And so as we move on, as I show you, and I give you examples of this, hopefully you'll be able to understand a little more as I show you the biblical examples. And so there are many places in Scripture which will make this interesting connection between hair, between death and glory. So, for example, there is a verse in Proverbs which talks about how a gray head is a crown of glory. It is found in the way of righteousness. And so here we have this beautiful relationship between the idea of aging and approaching death. The idea of this hair becoming white and so showing this coming closer to death, but also becoming a glory. And so, I mean, it's very intuitive. If you encounter this person with white hair, you have light coming out of their hair, coming out of their head. So you have these strands of light which come out of your head. And so it becomes this crown of glory. But it is also a sign of death. There's a place in scripture where it talks about how the young should rise up and stand, you know, and honor the aged and the gray headed, the people who have white hair. And then you should also revere God. And so this relationship between the glory of the person, but then also, you know, moving up towards the glory of God, basically. And so once you understand that this idea of white hair as being this connection between death and glory, and also just the idea of light coming out of someone's head, you can also understand why, for example, in the book of Daniel, the Son of man, and then in the Book of Revelations, the returning Christ is represented as having a white hair, hair as white as wool, because there it is again, that relationship between death and glory. But you can also understand there's another place, for example, in Corinthians where it talks about how women should have long hair because it is their glory. And so you can see how this hair is a covering and is a glory. Now this is something that a lot of people struggle to kind of understand because they tend to think of glory as just light. But in scripture, it really isn't just light. It's light, but it's also a kind of dark covering at the same time. The perfect example is, of course, in the transfiguration where Christ is transfigured, and then the disciples see this blinding light, and then it talks about how this light cloud overshadowed them. So there's this coming together of light and darkness, of showing and hiding. And that is really the paradox of everything which is exterior, exterior to yourself. You Know, I talked about this with the ring. Anything that shows you also hides you can also come to hide you at a certain extent. Everything you do externally can show who you are, but. But it can also be a way of hiding you. And once you understand that, you can understand so many things that Christ talks about in the New Testament. That's why Christ is so obsessed with hypocrisy. That's why almost everything Christ says is about dealing with hypocrisy. Because Christ doesn't want there to be your outer actions to be a form of death, but wants your outer actions to be connected to you and be a form of glory. Okay? And so that's one of the reasons why Christ is constantly talking about hypocrisy as being one of the main problems. And so this idea that hair, that let's say white hair, we talked about this white hair, which is glory. Well, there are also places in Scripture where it is more strictly related to death. For example, in Leviticus, it talks about a form of leprosy in which the. One of the signs of the leprosy is that the hair is in the infection. The hair in the place where there's leprosy has turned white. And so that becomes one of the markers to know that this person is impure and has to be put aside. Now this is really. Now we're diving into. We're diving into the deep stuff of symbolism, which is, like I said, symbolism is structural. And so the glory on your head, the white hair, will set you aside, will mark you, will be a crown, an ornament, which will mark you as being different from others in a good way. So it shows your glory. And then the white hair in the infection will also set you aside, will become like an ornament, something which makes you special, but. But in a bad way. It sets you aside, makes you impure. And so there are these two extremes you can imagine. One which is being set aside in the right way, that is set aside for holiness, and another which is being set aside, you know, cast off because it is impure, because it doesn't fit. Now, there's a very. Like I said, because symbolism is structural, you can use sometimes the same symbolism to talk about one side and to talk about the other. And we saw that right now in this idea of white hair. Okay? Now, because like I talked about this notion of the garments of skin as something to protect us from the world. Hair is something to protect us from the world. Also hair as being something which comes out of you but is not Totally you. Then it becomes related to power in general, to strength. And so of course, when I say that everybody will think of the story of Samson, which, it makes absolute sense that it, it can be that it would come to that, because the story of Samson is exactly about that, this idea of this long hair which becomes the key to his strength. And you know, because it is this strength really, really strength in a, in a very physical way. That is the capacity to act upon the world, capacity to beat up someone, capacity to, to build a house, capacity to do, to do, to act or to protect yourself from the outer world in that sense, like real power, physical power. And so the hair becomes an image of that and it also becomes akin to your actions, right to your outer actions. So, for example, a good example of this notion of how it can be related to your outer actions and kind of how you act in the world, you. A good example is the story of Absalom, the son of David. In the story of Absalom, it talks about how he had this beautiful long hair, right? And so he had this hair that was so long and so beautiful that every year he would have to cut it because it became too heavy. And so he had to cut his beautiful hair because it became too heavy. Then it would grow back again. And so this is really this image of Absalom as being, you know, the up and comer, this young buck who's wanting to replace, wants to replace his father for through his own kind of power, his own strength. But then Absalom gets caught up in his outer power and his hair gets caught in a tree. And as his hair is caught in a tree, then the David's soldiers are able to kill him. And so there you can see how this strength, this outer strength is a danger because if you rely on it, then you can also become, it can catch you up, you know. You know, we've talked about that before in terms of technology, how every time you give in to outer strength or once you rely on your outer strength, you also make yourself weaker because you become dependent on your capacity to act in the world. And those things will, you know, those things will go away. You know, our strength, our power to act in the world will disappear. And so that's why, for example, you'll see in the New Testament there's a way to kind of play with those relationship where, for example, you know, an interesting, two interesting ideas in the New Testament, two images of hair come up, which are very fascinating to help you understand how you can emphasize different aspects. For example, in the epistle to Timothy, St. Paul talks about how he says women should not adorn. Should be modest and should not adorn themselves extremely with braided hair and gold and costly garments. And so he's talking about this hair as an adornment. And he doesn't want women to adorn themselves too strongly, but to adorn themselves with good works. And that's what I'm talking about. And so he's saying, here are these external signs of you and this ornamentation. And the real glory is the good works that you do. Those are the good works. But you can also then oppose the inside and the outside. And St. Peter does that himself. And he says your adornment should not be merely external braiding the hair, wearing gold jewelry, putting on dresses. Rather, it should be that of your inner self, this unfading beauty, you know, which is great in God's sight. So you could say your outside work should be. Should be good, your glory should be good. But instead of just being this kind of pretty adornment, your work should be your right, the adornment. But then you can also oppose them and say, you know, you shouldn't focus on the outside. You should focus on the inside. Okay, so, for example, also, I think in the Old Testament, there's a place where it talks about how the glory of young men is their strength and the honor of old men is their gray hair. So you can see again, this relationship between now emphasizing on one side, strength and then on the other side, hair. But in other places, those two, the hair for the young man and his strength are also connected together. And so it kind of shows you how symbolism, although it isn't. It's never systematic. Symbolism is never a systematic thing. It is. It is nonetheless coherent in how it kind of lays itself out. And so that's how you can also understand this idea of the Nazirites. And so Samson was a Nazarite. He's a very strange Nazarite because he actually doesn't follow the rules of the Nazirite. But the Nazirites were people who dedicated themselves to God. And in dedicating themselves to God, they would let their hair grow long for a certain amount of time, the time that they were dedicated. And then when their dedication was finished, then they would cut their hair and they would offer it to God as an offering, as a burnt offering. They'd actually put it on the offering of the altar of offerings and would offer it up to God. And so you can see once again, how this growing of the hair is related to a following of a vow to do all these different things so that then when you're done, you cut your hair, you take all those works that you've done, and you bundle them up in your hair, and then you offer them up to God as a sacrifice. And what's interesting is that the opposite can also be true. For example, in the New Testament, it talks about St. Paul cutting his hair in order to follow a vow. And you see that, of course, in the act of tonsuring, that is still. That was there in the Roman army, but that is also still there in the church where you cut your hair in order to accomplish a vow. And you can see that as starting over. Cutting your hair is like. Is a form of death as well, in the sense of you remove all this external stuff that you have. It's an ascetic act. You have all these externals, and you say, no, I'm going to remove them, and I'm going to focus on this one thing. And so shaving your head, cutting your hair can be a form of focus where you're removing all these externals, all these ornaments, all these things. And you are focusing on the vow that you gave. You can also see it as a form of mourning. It's a common practice to cut your hair when you mourn. And so it's the same thing. Someone dies, this person is no longer with you. You're starting over. You cut your hair. So it's like you're starting over. And it's a form. It's also a form of showing your new focus, like this new thing that happened to you, like you've lost your spouse, you lost this person with you. And so you cut off all these. You cut off all these externals. And. And you refocus, let's say. So that is one of that. That's another example of how all of that comes together. And so that brings us maybe to the last example of kind of understanding. The relationship between hair and works, or hair and externals is really this idea that we see in Scripture, how all your hairs are counted, or this notion that no hair on this person will be harmed. For example, you see that when the three youths are put into the oven in the book of Daniel, where it says not one hair on their body will be damaged. And so every place where it talks about how all your hair will be counted, and also this notion that no hair will fall off or no hair will be removed, it has to do with this idea of, in a certain manner, of the totality of the incarnation, or the totality of. Of creation, where all things will be measured, all things will be accounted for. It's related also to when Christ talks about how, you know, not one letter of the law will fall before the end, right? This idea that even the externals, this external law will, all of it is part of this story, this whole thing. And the same with works. It's like. What's important is, let's say, like St. Peter talks about how you need to focus on the inside and then the outside. Your hair, your actions, your everything you do use that external power in order to manifest that inner thing. And then those works, those externals will become your glory, right? You run the race, you attain the goal, and then you receive a crown. So there's a relationship between this glory and the actions that you put out in the world. And also, let's say that you could call the specificity of yourself, that is that which makes you you. And part of it is everything about you, as much as your internal as your externals. All of that is part of the totality of what you are. And that the glory of that. These dead works, these dead things that you do, you know, this art that we make, these buildings that we build, the technology that we create, all of it can be flipped, can be filled with light and become a form of glory out of their, let's say, dead selves. And so that's. I think the symbolism of hair is. I know that this might have been a little bit convoluted because it's a very difficult subject to talk about, but I hope that I've given enough for everybody to at least meditate on the question of hair. And I think the next video I will do will be on Rapunzel and the story of Rapunzel as an example of a proper use of hair, its relationship to death, its relationship to. To glory, to beauty, to all of that and how it all comes together. Hello, everyone. In this video, I'm going to talk about the symbolism of hair in the story of Rapunzel. It is, in a way, a continuation of the last video I did directly on the symbolism of hair in the Bible. But I also wanted to use a story that is from another source, so here a fairy tale to talk about the coherence of. Of the symbolism of hair. And so most of us will know the story of Rapunzel. I'll give the details of it, just to give you to start. Usually the story starts with the idea of a couple who's pregnant and very poor, and a man goes and steals some Cabbages for his wife in this witch's garden. And the witch catches him and he promises either they make a very disturbing trade where he promises to give their firstborn in exchange for the cabbage, or else she tells the man that she is going to take their first child when it's born. And so when the child is born, the witch takes the child and then raises her up in a tower and raises her there with no entrance to the tower. When the young woman becomes a teenager, she has this long flowing hair. And, and the witch, when she wants to engage with the young lady, she goes up to the tower and says, rapunzel, Rapunzel, let down your hair. And then the witch can climb up and can engage with the lady. So then with Rapunzel, the idea is that the witch will not let Rapunzel go. And often the story is interpreted in relating to this notion of an overbearing mother, of a devouring mother that will not let her daughter grow up and enter into a relationship. But she wants to protect her. And so I think that that's a fair interpretation. But what I want to look at is especially how the symbolism of hair plays into this story. And so of course she has this kind of long unnatural hair. And in the story later on the prince will come and we'll see the witch saying, rapunzel, Rapunzel, let down your hair. And the prince will climb up, will go up, and then when the, the, the, the witch is no longer there, he will himself called up to Rapunzel to let down her hair, climbs up her hair and then they meet, they fall in love. Etc, etc. In the very early versions of the story, after the prince's several visits, Rapunzel actually gets pregnant and they plan on how to get her to escape her the witch's grasp. And so as they're planning to help her escape, the story usually has it that Rapunzel will make a mistake when she's speaking to the witch, will let it be known that the prince is coming to see her. In the very, very early versions she says something like that her, her dress is becoming a little too tight around the belly, suggesting of course that she's pregnant. In other versions, she makes the mistake of saying as the witch is climbing up how, you know, it's funny that the prince, when he climbs up her hair, it doesn't hurt her as much as the, the witch, you know. And so because of that, the witch then cuts off Rapunzel's hair, usually tosses Rapunzel out, you know, out into the the wilderness. And when the prince climbs up the hair this time he calls Rapunzel. Rapunzel sees this hair come down. He climbs up. But when he arrives, he. He finds the. The witch who is behind the hare now, and she pushes him off the tower. He falls into a thorn bush and. Which blinds him. And then he wanders through the wilderness blind for quite a while, until one day he hears the voice of Rapunzel in the forest once again. Rapunzel has been living in the forest and raising his children. Basically raising. Often it's twins, a boy and a girl. And so he hears the voice, he calls to her. Rapunzel comes and she takes him in his arm. She cries. And the tears, her tears will heal the prince. And there you go. Now they're back together again in some virgins, in touching her hair, then her hair will grow out again and she'll be back to how she was before. And so, of course you can obviously see the whole, like I said, devouring mother and also, you know, allusions to relationship, allusion to the relationship between the man and the woman. But we really need to look at it in our case, look at. It's a very deep story. It has a lot going for it, but we need to look at it especially in relationship to hair. And so the way you have to kind of understand it first of all is we have to understand this, first of all, this notion that the woman who is up in the tower is of course related to the man and the woman come together. So it is related to the notion of the couple. But you also have to understand it kind of in the medieval idea of the chivalrous romance, where the woman up in the tower represents not only, let's say, the relationship that he can have with a woman, but represents also, we could say, the mysterious spiritual aspect of the feminine. We see, of course, this vision of the world in Dante, where it is Beatrice who leads him up, up to the top of the mountain, where she even at some point is traded. And then it's the Holy Virgin kind of guides him up towards God. And so in the chivalrous idea, dedicating yourself to a lady could be a manner in which we could enter into the mystery of God. We can encounter God through are dedication to a woman, to a dedication to a lady. And so this woman up in the tower is not only a woman in the strict sense, but it also represents, you know, this mystery, you could say this almost this spiritual mystery that this prince can come to encounter. And so the hair, as I've talked about in my video about the symbolism of hair. The hair represents these externals. The hair in this sense represents this external thing which. Which reaches from the woman out into the outside. And so when the prince comes, that's what he sees first. What he sees first of Rapunzel is her hair. Just like what we see of anybody when we first encounter them is this kind of outer showing that they have. In the case of hair, it goes very far because hair is just like we talked about also in the video about the. The Lord of the Rings and the Ring of Power. Hair is, you could say, the first ornament. It is this first ornamentation, the closest to us because it actually comes out of us. But it can be molded, it can be changed color, it can be coiffed in a way that acts very much as an ornament. And everybody knows that. Everybody knows, especially women who will spend an enormous amount of time on their hair, dyeing their hair, doing all kinds of things in order to use their hair. And as a form of ornamentation like makeup or wearing a nice outfit, the hair becomes the first outfit. You could call it the first garment, okay? And so in that sense, the prince encounters this garment, encounters this ornament and uses the ornament, and the ornament becomes a way for him to access the princess. So in that case, the ornament, her hair, becomes the glory of this. This princess, you know, that is too far from him. That is too removed from him. And by climbing up this external, by using these external signs of her, he is able to come into contact with her, okay? And that, of course, is true of everything, okay? That is true of, let's say, religious structures, let's say art. The church building is a way, is an external manifestation of something which can help us bring us closer to God, bring us closer to that mystery. You know, all the externals, all the liturgies, all the. Everything that, you know, even the Bible itself, all these externals are there to act as a kind of ladder to bring us closer to the mystery, to something which is beyond the external, something which is hidden in that secret place. And so here it is, the prince who goes up and encounters the princess. So now when, you know, let's say the problem happens, the witch cuts off her hair, and then the witch uses her hair. But now the witch is using the hair in the negative aspect of ornamentation, in the negative aspect of externals. She's using this beautiful, you know, long hair to hide herself, to hide the fact that she's actually an ugly, horrible witch. And so the prince sees the hair and he is, in this case now he is actually duped by the hair. These externals are, are, are actually leading him into error because he's trusting only the externals and has, doesn't, isn't looking further than the ornamentation. And so that is true once again about anything that is external, you know, and that's why we always have this conflict within religion, within Christianity to say, you know, how important are these external things? You know, are they idols? Are they, are they, do they actually lead us astray rather than lead us towards God? And the truth is that they, they're both, they both, they can lead to. They both lead you too, because without them, you would not have access to the mystery. But if you trust only on the externals and you don't use them as a way to get closer to that mystery, then those externals can lead you astray. And so in this case, the prince trusts the hair. And then when he climbs the hair, he finds that the hare was actually hiding this horse. Horrible witch. And so what does it cause? His mistake, his error in entrusting only the externals makes him fall and falls into a thorn bush. Now, for anybody who knows anything about biblical symbolism, you will see that this relationship between the hare and the thorn bush is extremely important because of course, the thornbush is that first sign in the Bible of the fall. And so when you, when, when, when Adam and Eve fall, God says that the. That the world will now produce thorns. And in order to protect yourself from those thorns, God gives them these garments of skin which are represented, of course, by these hairy garments. And so you have the hair to protect you from the thorns. Now the prince is, is led astray by the hair. He's been tricked by externals. And because of that, he loses the protection of the externals and smack. He goes into the thorn and he becomes blind. Of course, the blindness is exactly what he already had gone through. He was already a form of blindness which led him to trust only the hair, Rapunzel's hair, instead of being attentive to what the hair is connected to, which had caught him to fall in the first place. So he falls, he becomes blind. That's of course a perfect image of this, this forgetfulness or this incapacity to actually see things for what they are and is a consequence of the trick in which he's let himself fall, that he's also. That he didn't have the strength to see beyond the hair. Let's say. And so the prince then wanders, of course, we all wandering in the wilderness, just like, you know, just like the Israelites wandered in the wilderness when they. They didn't trust God. Just like Cain wandered in the wilderness when he slew his brother. This notion of wandering in the wilderness is really this idea of being lost, having lost meaning, having lost the capacity to see the world for what it is and to be led astray, to be. He could have been on water. He could have been, you know, basically it is this loss of a capacity to see. Capacity to see meaning is being lost in the wilderness. For those who have more questions about that, I would say read Matthieu Pageau's book, my brother's book, the Language of Creation. In that book, he talks about wilderness as well as this falling away from meaning and this incapacity to see. To see meaning in the world. So the prince wanders off, and then finally he hears the voice. And hearing the voice of Rapunzel is once again then being reconnected to his first goal, being reconnected to the meaning which he had lost, which he had. Which he had not been able to see beyond the externals. And now he hears the voice. And of course, hearing the voice is in symbolism. It really is this kind of inner relationship. To hear someone's voice is to encounter that person in a very intimate way. In the Old Testament, for example, we don't see God, but we hear God. And this hearing is really this intimate relationship. The world is created by word. It is that link to word. And so by hearing the princess, he recognizes her. He's not seduced by her outer beauty anymore. He can't even access it. But he then finds her again through herself, through her deeper self, you could say by hearing her voice and connecting to her voice. And then, of course, the princess, in her feminine guise, you could say she washes away his disease, she washes away his incapacity to see. And there you go. The prince recovers his sight, recovers his goal, and recovers, of course, the princess. And not only that, but he also discovers the fruit of his purpose, of his gold, in the two children, the twin children, which represent having a boy and a girl. Twins will also represent this kind of, you could say, totality of his union with Rapunzel. And so you have this new wholeness which is created by the. By this reconnecting with Rapunzel at the end. And so we can see now, once we see it, how hair functions perfectly in that story, functions perfectly in the way that it is really is this double bind where there is this external thing that is there to act as a kind of ladder in order to bring you closer to the mystery, which is. But if you only trust the latter and you're not trying to see what's beyond it, then it can become a form of hiding and a form of artifice that can get you lost, that can make you lost, and it can make you lose sight and lose the deeper meaning. And so I think that's really important, especially for this whole discussion in Christianity, that we've had these extremes in Christianity where in certain branches of Christianity, people have fought so much the external forms. And in other times, in other places, people have relied so much on outer forms. But it really is only those two things coming together, the outer and the inner, the external manifesting the internal and the internal being. The final goal, let's say the final purpose of what all those externals are for the. That's how the world can exist. And it's really the only way that the world can exist properly."}
{"episode_id":"SW - #051 - 2019-08-21 - The Symbolism of Hair","start":2250.73,"end":2306.62,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
