{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":0.88,"end":20.88,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I will be playing for you a discussion I had regarding some of the strange ways that people interpret symbolism and try to limit symbolism only to their historical contingency. And so when they see a symbol, they try to associate it directly with."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":20.88,"end":23.68,"speaker":"Jonathan Pageau","text":"The group or groups that they know."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":23.68,"end":85.97,"speaker":"Jonathan Pageau","text":"Who have used this and then have a strange way of wanting to join all the people that have used the same type of symbolism into one big mass. And so what you get are kind of weird conspiracy theories where people go back in time, you know, and find all this evil symbolism and then come to tell you that, oh, the Catholic Church or the Orthodox Church is evil because it uses the same symbolism. Anyways, that was the main point I was trying to make, and it was provoked by a video that I saw of someone who was criticizing Jordan Peterson. And to be fair, after I made this video, I felt a little bad because I really don't like going after people, especially people that aren't famous or people that aren't that, you know, that haven't weathered this kind of thing before. And so I reached out to the person who had made that video, and I think we're on good terms. I think it's fine. We had talked about him coming on the channel and then giving him a chance to discuss his ideas, and sadly."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":85.97,"end":87.45,"speaker":"Jonathan Pageau","text":"It happened just before the flood."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":87.45,"end":117.07,"speaker":"Jonathan Pageau","text":"And then everything got crazy after that, and I was never able to finally get to having him on the channel. I think by now it's probably too late to do that anyway. So, nonetheless, I think my main point in this video is still sound in terms of a way of interpreting symbolism, which I find is limited and is not usually very helpful, especially if you want to understand how the world works. So, as you know, everything I'm doing here, the videos, the podcast, it's all."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":117.07,"end":120.55,"speaker":"Jonathan Pageau","text":"Thanks to people's support. So if you like what I'm doing."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":120.63,"end":166.48,"speaker":"Jonathan Pageau","text":"You can go to the symbolicworld.com support and find ways to support the podcast. Supporters get early access to videos. Some, you know, at certain tiers, you have the chance to ask questions in advance for my Q and A. And ultimately now I've started also making a free video a month for all the supporters interpreting traditional stories. I've done the Princess and the Pea. I've also done Jack and the Beanstalk, and now I am preparing Rumpelstiltskin. So please enjoy and talk to you soon. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":176.91,"end":856.63,"speaker":"Jonathan Pageau","text":"Now, as I grew up in a certain culture, we'll call it an evangelical, conservative, evangelical culture. I faced something that was called chick comics. And I don't know if any of you have heard of chick comics. In chick comics you had this very anti Catholic strain. And what they would do in chick comics is they would show certain aspects of the, the Catholic liturgy, for example, and then they would show how evil the liturgy is because it has these occult and ancient Egyptian or pagan influences. And so I remember, for example, in the Catholic Church they have liturgical fans, which we also have in the Orthodox Church. And then they would show how these liturgical fans are the same as the liturgical fans that were used in Egypt and therefore proving that the Catholic Church is evil and satanic. And so as I grew up with that stuff, like I said, I think I said this before, this stuff didn't come from my family. It came from, let's say, the surrounding culture in which I was bathing. And so growing up, as I discovered symbolism and as I discovered symbolic structures and imagistic thinking, liturgy, ritual, all of this stuff, as I discovered this, of course I started to look back at all this silly nonsense that people were saying with something of a righteous anger, you could call it. And what annoys me at this particular moment is to find the exact same attitude inside some strands of Orthodoxy where the same attitude is applied. What we're seeing is the reduction of symbolism to their historical contingency. That is somehow by pointing to the historical origin of an image or, or the, or the one that you can find, or finding some analogy, visual analogy between something which exists today and something which, which existed in the past, we somehow. That's enough to explain the symbolism. First of all, what that is, is an extremely simple minded vision of symbolism. And second of all, it is a way in which to just simply show our, our somewhat, our superiority in being able to identify the analogies between different cultures and then to decry them as being evil and our own version of Christianity to be this amazing pure thing. And the reason why it frustrates me is that as you learn, start to understand symbolism and understand the structures, then you start to see that that's not enough to understand symbolism. Simply pointing to the analogy between one symbolic image and another is not enough to explain it. Now the reason why I'm getting kind of pumped up about this right now is because there are a bunch of people that have been attacking Jordan Peterson from the Christian camp. And I understand the criticism against Jordan Peterson. I have said in many videos that there are plenty of things that we can say to criticize Jordan Peterson. In fact, I finished reading Vox Dei's book, and I believe that I could write a much better criticism of Jordan Peterson, which would be much more accurate and also would cut in the right places instead of strange, conspiracy, occult directions. Now, what do I mean? Okay, I want to give you a few examples of this. The main example that I want to bring up is some. There's a guy, I won't name him because I don't want to get into polemics, who is pointing out how occult Jordan Peterson is. And the way he's doing it is exactly the way I said. He is showing something that Jordan Peterson is talking about. And then he's using words like, this is the same as the occult, this is the same as Kabbalah. And when you hear those words, this is occult, this is Kabbalah, this is a magical. This is from, you know, the magical thinking. When you hear that, you should be very suspicious because it's a way to simply discount something without actually looking at it. And so you know the word Kabbalah, for example, you know what that means? It just means tradition. That's what tradition means. The word occult, what does the word occult mean? The word occult means secret. It's the same word. It's a synonym to the word, for example, mystery. And it's also a synonym to the word sacrament. And so the sacraments, the mysteries of the Church, are the secret teachings of the Church. And if you read in the Church Fathers, you will find texts which are called mystagogy. And this mystagogy is the secret explanation of an outer form that appears in the Christian Church. The ancient Christian Church had a mystagogical structure. It had an initiatory structure, which is that if you are not initiated into the mysteries and into the sacraments of the Church, then you were not given certain aspects of the mystery. Even today in the Orthodox Church, we have a moment during the liturgy where we say all the catechumen must leave. That is, all those that are not initiated into the Christian community must leave at this point. Because what is after that is part of the sacramentality of the Church. It is the mystery of the Church in which we come together and. And we participate in the act of communion together. And the act of communion is not without its. If you look at it objectively, it looks very strange. We are eating the blood and body of the Incarnate Logos. And so the only reason why we don't think that's strange is because it is our culture and it is our own initiatory practice. And so if we, if we look at an image and we see how weird it is, people. I see it all the time. People will look at images and look at how weird this is, look at how strange this is, and somehow, because it looks weird or strange, that it is necessarily evil just because of that. There's nothing stranger than eating the blood and body of the incarnate God. You will not find anything which is more mysterious, which is more occult, which is more esoteric. Okay? And I'm using those words, of course, in a way to help you understand that we can't just. We can't just look at this, at an image and simply because it looks strange to somehow say that it's evil just because of that. Now, I'm not defending, for example, occult practices. Somehow someone, for example, like Aleister Crowley was an obviously evil person. And for example, if you look at Freemasonry, it has been an obvious. And historically, you can prove the fact that Freemasonry has been part of. Of subverting the west, part of the revolutions, part of destroying Christian culture. And so I'm not defending the actions of those people or those organizations, but just because there's an analogy between certain images within even the worst occult thing and let's say with Christianity or something that someone's explaining, doesn't make it evil in itself. Okay, I hope this is understandable because I'm a bit annoyed at seeing this happen. Now, I want to give you a few examples. Now, one of the examples in this video that I won't talk about too much, the guy shows an image that Jordan Peterson talks about. The image is an image of Fuxi and Nua. Fuxi and Nua were, according to Chinese mythological tradition, were the first humans. So the first male and the first female, and then they're joining together. Represents the beginning of humanity, the beginning of human culture, human tradition. And so the guy looks at this image and he says, oh, this is the type of stuff that I saw when I was in the occult. This is the type of stuff that I saw. And look at how the characters. And so one is holding a square and the other is holding a compass. And oh my goodness, look at how occult it is. Because of course, the Freemasons use a square and a compass and look at how occult it is. Because the double snakes, the double snakes which go around this pole are like Eliphaz. Ls Baphomet creature, which is. Has this double, you know, snake going up and it. And it's a cult and it's Evil. And it's like, okay, you know, fine, okay, fine. I don't want to defend this image, but simply showing that there's an analogy between this symbolism, Chinese symbolism, and. And what the Freemasons use and what, you know, occult people used in their symbolism doesn't make this symbolism point to anything that's evil. It is totally absurd to think that. Let's break it down and we'll look at this image and see, you know, what it is. And so, first of all, we have these two masculine and feminine characters that are intertwined. And so we have this notion of the joining of masculine and feminine as the origin of. Of humanity. Now that if occult people use that type of symbolism, whatever, that's fine. Christians also use that type of symbolism. Christ is seen as the union of heaven and earth. This is normal symbolism. This is something which you find in the Church Fathers, which you find in the symbolism in icons in the liturgy, that Christ is the union of heaven and earth. That's what Christ is. And so. And so the fact that you reference the union of heaven and earth doesn't make it evil. Okay, now let's look at it again. They're holding a square and a compass. Once again. Oh, this is evil. Because Freemasons use a square and a compass. There's nothing evil about a square and a compass. And there's also nothing evil about a compass representing heaven and a square representing earth, because we use that also in our own churches, the Orthodox Church basic architecture is based on a dome on a square, a circle on a square. And so the circle represents heaven and the square represents earth. That is the same symbolism as a compass and a square. So just. And the fact that the masculine and feminine are united together, the circle and the square, there's nothing evil about that in itself. Okay? Now, like I said, I'm not saying that Freemasonry is fine. Of course, even as an Orthodox Christian, you are not allowed to be a Freemason. You're not allowed to give your loyalty to another secret organization. I'm not saying that Eliphaz Levi's Baphomet is fine. Eliphaz Levi's Baphomet is obviously part of some strange desire to impose your will on. Upon the world. And in that kind of Nietzschean sense, which is not the Christian sense at all, you know, in the Christian sense, we are meant to submit our will to the transcendent. And then that will, thy will be done right, Not. Not my will."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":856.63,"end":857.07,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":857.07,"end":1150.68,"speaker":"Jonathan Pageau","text":"I mean, we could discuss the subtleties of that at Some other time. But what's important to understand is that the symbolism itself is not necessarily bad. Now I'll give another example. I have seen people who, as soon as they see someone who has their right hand up and their left hand down, you know, they'll say, oh, look, it's the symbolism that Eliphaz Levy used in his baphometation. You know, the right hand going up and the left hand going down. Look at how occult it is. Look at how evil it is. It's like that symbolism is also found in Christianity. You can see it in images of the Last Judgment, and you can also see it in images of the cross itself. The Russian cross has a bar which goes up on one side and down on the other, up on the right side of Christ and down on the left side of Christ, because the thief went up, the good thief went up, and the bad thief went down. Thy cross, O Lord, is like a balance. The right thief went up into heaven and the bad thief went down into hell. It's an image of the Last Judgment, which is the. Inserted directly into the image of the cross. And so just because you see someone with their right hand up and their left hand down doesn't necessarily mean that this is evil occult symbolism. Now, it could be evil occult symbolism. It depends on how you're using it. It depends on how you're distorting it. It depends on all these things. But to simply show the visual relationship between two images is not enough to decry a certain amount of symbolism unless we are able to look at things clearly. And instead of attacking people because of how their thinking relates to some thinking, historical movement of thinking, that's not enough. We need to look at the actual ideas. What is that person saying? How are they using the symbolism? That is how we can identify what. Whether or not these symbols are used for good or for bad, not simply showing a visual relationship between the two. Okay, and the same goes if someone just says, oh, those ideas are like the ideas of the Kabbalah, and, you know, with a very dark, ominous tone, as if the Kabbalah is, you know, this, this. This immensely evil thing. In the Kabbalah, there are things which are obviously not coherent with Christianity. For example, in Lurianic Kabbalah, there this notion of the broken vessels and this idea that these sparks could not. The vessels could not handle the divine sparks. And this is a very Gnostic way of seeing the world, that the world itself somehow is incapable of receiving, if you will, the divine sparks of God. The will of God are not capable of being held in these vessels. Well, that, of course, is not coherent with Christian thinking because we believe that God is good. But just because certain rabbi, a certain Kabbalistic rabbi made an analogy in scripture doesn't mean that that analogy is necessarily bad. Sometimes there can be an insight there that's worth looking at. Like I said, we need to look at the ideas themselves, the application of this symbolism, and not the. Just look at the accidental historical or visual relationship between different images. That is not enough. And so I just want to say to a lot of those people that have been attacking Jordan Peterson, you're doing yourself a disservice, especially those of you that are traditionally Christian, because if you look at an image, for example, of two intertwining snakes and these two snakes with the heads looking at each other, and you say, ooh, that's evil. That's a culture that, you know, look at how evil that is. I will like to remind you that our bishops use that symbolism in their staff, and their staff have two snakes which come up, which come up head to head at the top. And so to simply point to that symbol and say that it's evil because some 19th century occult person used it is not enough. Okay? You need to understand what it's referring to and, and need to be able to discern whether or not this is good or whether or not this is bad. All right, guys. And so sorry about the rant, and I hope, despite the fact that I was being very ranty in this video, that it was useful to you, and maybe I'll come back on this at another time in a. In a calmer, more dissected way. But, but if you feel that I. If you're wondering what I'm talking about, and if you're curious, you know, if you still think that some. I'm supporting the occult, go ahead and write it down in the comments. Hopefully I'll try to be more involved and try to answer your comments and see. See where we can go with that. So thanks a lot."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1151.56,"end":1154.68,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World podcast."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1154.92,"end":1157.24,"speaker":"Jonathan Pageau","text":"As you know, these podcasts are all."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1157.24,"end":1161.96,"speaker":"Jonathan Pageau","text":"Versions that of videos that I put out on YouTube. So if you want to see more."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1161.96,"end":1164.72,"speaker":"Jonathan Pageau","text":"There are a few videos that I don't put up. So if you want to see more."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1164.72,"end":1171.18,"speaker":"Jonathan Pageau","text":"Of what I'm doing, you can check that out on my YouTube channel. The link is in the description of the podcast."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1171.34,"end":1183.26,"speaker":"Jonathan Pageau","text":"And I hear also that if you do want to help the podcast, one of the ways you can do that is to go to wherever it is you're listening to podcast and leave a five star review. Supposedly that is quite helpful so that."}
{"episode_id":"SW - #058 - 2019-09-21 - Stop Being Silly","start":1183.26,"end":1191.18,"speaker":"Jonathan Pageau","text":"The podcast gets suggested and promoted and put out there. So once again everybody, thank you for listening and I will talk to you soon."}
