{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":0.96,"end":78.13,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World Podcast, I will be playing for you the second part of a conference in which I participated in Seattle called Shared Inheritance, which was organized by Byzantine Catholics but also had Orthodox speakers there as well. In the last podcast, I played for you the first part, which was called Anthropology of Looking at How Mystical Christianity offers a map of the human person, which is helpful. So I talked about memory and the heart and attention. And in this version, in the second part of what I'm doing, I look mostly at what you could call the peripheral elements, looking at problems of culture, problems of what happens when the image or the map of the person offered by tradition is denied or ignored or destroyed, and what that looks like. And so I look at the problems of culture we are facing, entertainment culture and a kind of nihilism around us, and hopefully offering some means in which to answer that in terms of a cultural answer, you could call it. So I think you might enjoy this discussion. As you know, everything I'm doing on the Symbolic World podcast is thanks to people's support."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":78.85,"end":79.97,"speaker":"Jonathan Pageau","text":"So if you like what I'm doing."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":79.97,"end":112.63,"speaker":"Jonathan Pageau","text":"If you appreciate it, please consider going to thesymbolicworld.com support for. For all the people supporting. I am offering all kinds of stuff, early access to some of the videos. There are different kind of tiers, tiers where you can ask questions in advance on the Q and A, tiers where you can have private discussions with me or enter into small groups that I'm leading. And ultimately though, for all the people who are supporting the podcast, I'm making an extra video a month, which is usually an interpretation of a myth or some legend or an old story."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":112.94,"end":113.78,"speaker":"Jonathan Pageau","text":"And I've been having a lot of."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":113.78,"end":134.7,"speaker":"Jonathan Pageau","text":"Fun making those, so I think you'll have fun listening to them as well. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":146.03,"end":499.42,"speaker":"Jonathan Pageau","text":"So, yes, I thought that after lunch a great thing to do would be a detailed analysis of Wagner's Ring cycle. So this is what we're about to do. No, not at all. And so I promise you that this talk is not going to be as intense and as heavy. Hopefully it'll be a bit lighter, although I will touch on some, I think, important subjects, but hopefully it'll be a bit, a bit. A good after lunch conference, hopefully. So what I want to talk about is I want to talk about the problem of culture and the problem of art. I am an artist. I'm an icon carver. I ended up adding some of my carvings into the presentation this morning because yesterday a lot of people were telling Me. Oh, I'd like to see your carving. So you'll see some of my carvings in the presentation. There are a few artists here as well today, and I want to talk about how is there going to be. How is it possible for culture to move forward? How is it possible for art to move forward, considering our situation right now? So in the 19th century, Wagner came up with this term the Gesamtkunstwerk, this notion of the total work of art, right? The perfect work of art. And it's in that notion, in that idea of a total work of art, that he developed his Ring cycle of operas. And his idea was to create a work of art which would join together all the different arts into one thing. And so he thought that the opera was the perfect place to do that, to take narrative, to take music, have dance, have also visual representation in terms of composition. All of that pull together into one massive, total artwork. We have. A lot of people have said that, in fact, the real, let's say Gesam Kunstverk is the movie. The movie does exactly that. It pulls together these narratives and it has an expensive, good movie, has this amazing soundtrack which as actually follows the narrative structure. They have a science, like a musical science of following narrative structure using music. And there's also the composition of the screen, there's color. All of that comes together into this example of the perfect, let's say. So I chose two images, one of high end, more, you know, artsy movie, and one which is the recent popular endgame movie, which was. I saw it. Which was absolutely visually astounding. It's astounding what they. What they can do in terms of narrative also pulling in all these stories dealing with myth, using mythological structures. It's pretty amazing what they're able to come together. And as we look forward, obviously we are looking towards a possibility of having absolute, total immersive narrative with all of that story, everything. We could have this immersive, complete experience of Wagner's Gesamt Kunstwerk, this total artwork coming into our field of vision. And so you would think, right? And then just for Father Stephen, I added that this, this morning, the holodeck from Star Trek, which is the ultimate imaginable, possible, perfect cultural experience, would be in the holodeck. But you would think, right? So you would think that imagine a culture that has come to create such perfection, that has come to create these works of narrative structure that cost millions and hundreds of millions of dollars to. To make and bring about hundreds of millions of people to come see them. You would think wow. If we've reached that level of cultural manifestation, we definitely should have a pretty beautiful, cohesive society, right? Turns out that is not the case. Turns out, in fact, that it is not. And as most of us have seen in the past few years, we have noticed, in fact, the very contrary. As we watch the social fabric in Western Europe, in North America, as we watch it start to fray and start to dissolve, and we're seeing things we haven't seen since the 1930s, people fighting in the streets. The signs are not good in terms of where our culture is leading us. So what's the problem? What's the problem? Why is our culture, which is so refined and you don't have to go watch the Marvel movie, you can go see an extremely elitist opera, an extremely elitist concert. All of these things you can go to. We have more culture available to us than any time in all the history of the entire world to. You know, you could see any show you want, anything you want. You could probably find a place and you could go see it. You go to Broadway, and there are tons of shows. There are tons of museums, tons of. So why is it that we are there? One of the problems."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":499.42,"end":500.1,"speaker":"Jonathan Pageau","text":"There is many."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":500.74,"end":2628.45,"speaker":"Jonathan Pageau","text":"One of the problems is the problem of entertainment. We have come to a point where we have confused culture and entertainment. We think that culture is to go somewhere and sit and have an aesthetic experience. And there's a book, a wonderful book called Amusing Ourselves to Death. Some of you maybe have read it by Neil Postman. And he says, when a population becomes distracted by trivia, when cultural life is redefined as a perpetual round of entertainments, when serious public conversation becomes a form of baby talk, when, in short, a people become an audience and their public business a vaudeville act, then a nation finds itself at risk. Culture death is a clear possibility. And social media is the ultimate version of this because. And I say that I am on social media, right? Father Stephen. We're all on social media. We're all using social media. But social media has tricked us in believing in relationships which are not relationships, which are performance and consumption. That's what we're doing on social media. We are posting things, and people are voyeuristically watching them. And I don't even know who's watching my. Who's interacting with my stories on social media. We have turned our relationships into performances and into audiences. That is how our relationships have been transformed into. By this problem of culture, traditional culture, traditional art. In every single traditional culture in the world, including, you know, Western medieval culture, Including Eastern Orthodox culture. Culture is participative. Culture is not culture. The ultimate act of culture or the arts are not spectacles, or not only spectacles, but that's all we have left of culture, right? Museums are places where things go to die. That's what museums are. They are giant cemeteries for objects, where we have removed objects from their actual use and we have put them up to gaze at. And I'm not saying that there's nothing wrong with that. There's nothing essentially wrong with looking at the past in order to learn from the past. But when that's all that's left of your culture, all that's left of your culture is this, you know, these spaces of performance and these spaces of showing objects that are ripped from their context. And we think that that's lively, we think that that's culture. Then we're in serious problem. We have a serious problem. One of the issues that has come is what we see happen in culture. I mean, starting even, I would say, at the Renaissance, we start to see what you could call a deincarnation. We start to see things start to rip, to pull apart, okay? We start to see this notion of high art start to rise up. And then we start to see this notion of objects production, let's say, or objects for use start to come down. So we separate this notion that. That we have these objects of cultural contemplation, and then we have these objects of pure use, and there's no connection between the two. We don't conceive that there's art in those objects, and we don't conceive that there's use in the high art objects. We have come to somehow glorify the fact that these useless objects, these useless events that don't have purpose in our society, that don't have relevance, that aren't there to bring us together like a folk dance or like a festival in a village, that we have convinced ourselves that that is in fact the highest form of culture. Now, the word art in the medieval world means fitting together properly. That's what it refers to. And so the notion of art, we still have that expression today, right? We still have this expression where we talk about the art of something. That's how the medievals understood art. There was the art of rhetoric, there was the art of painting, the art of woodworking, and there were these. And so art was not. We didn't have this idea of making art. Nobody ever made art. People used art to make things, and those things had purposes. So the very notion what we call artworks is a very disturbing perversion of the. The traditional idea of art. Because what we've been convinced is that somehow art has a value in itself, that these objects because. And so you have these arguments. Everybody's heard these arguments, see this painting, and they're like, is this art? Is this not art? What's art? Is this art? Is this. And it's been lasting for 100 years, since the beginning of the century, arguing about what is art and what is not art. And the answer is that it doesn't matter. It doesn't matter. Right. Those objects don't have value because they are art. Their value should be based on what they're doing in the world, not whether or not they are art. But I mean, we're kind of so far from that by now, it's very difficult to come back anyway. So here is this notion of the high art and the design. And we've come now, we've really. I mean, it's very extreme. We have all these objects in our houses that we don't even think about. They're just there for our use. They're just there for us to consume. And part of it is, of course, technological advancement, of course, is part of why we are able to think that a fork doesn't matter because you can get it for cheap at Walmart. In a time when an artisan would make your fork. And that was his, let's say, that was his vocation. The relationship to what you would receive was very different than the mass produced object. All right, so here we see the medieval arts. These are the traditional cultural events. Traditional cultural events were and are those that still exist. There are a few that still exist, are participative, you know, and of course. Well, we'll get to it. Of course. The church is one of the last vestiges of places where people come together and participate in a cultural event which is not just to be cultural, but is actually serving the purpose of uniting the community together, facing a transcendent God, you know, so it brings people together, but it also is there to kind of show us where we should be looking at. So there's an interesting. There's an interesting thinker from the beginning of the century. I really suggest that people read his book. He's actually not a Christian. He's a Sengalese man. His name is Ananda Kumaraswamy and he was the curator of the Boston Museum for many years. And he. Sometimes you need someone from the outside, coming from a culture that still is somewhat traditional, to see the monstrosity of your own culture. And Kumaraswamy really defended this real notion of art. So he said, art is not tangible. We cannot call a painting art as the word artifact or artificial imply. The thing made is a work of art made by art, but is not itself art. The art remains in the artist and is the knowledge by which things are made. So art is the human capacity to make things, the human capacity to create. In a way, you could say that we still have the word craft. We still use that word in its right sense. That is, it is the skill that the artist has and then applies to the world. And so, like I said, it removes this immediate value of the object that is being made. Just because it's art doesn't matter. The question is, what is the object? What is it doing? And so one of the thinkers, I think, especially for us artists, one of the thinkers that has helped to reawaken the possibility of traditional art. Because we see. I mean, I see because I came through the contemporary art world and several people. I don't know, Heather, if you did, Heather came through the contemporary art world. Several of the professional iconographers you'll meet in North America actually started out as contemporary painters, contemporary installation artists. We studied the contemporary art, and we came to the end of that. We realized that it was running out of steam and that the question we needed to ask was too big for the art system to answer. The question wasn't, what should I make this or that kind of art? Should I make this or that kind of painting? So should I make this or that kind of sculpture? The question became, what is the value of these objects? What is the whole value of your project, the entire project of contemporary art? What's its purpose in the world? So it became very difficult for us to remain in that contemporary art world because the question is too big. They can't answer it. I'm not asking you. I'm not asking you to interpret the paintings and to tell me what the paintings. I'm asking you, why does this painting exist? Like what. What. What is it doing in the world? What's what. What justifies its. Its taking up space in the world, right? And the answer ended up. A lot of the answer ended up secretly being something about prestige and something about financial transactions and investment and all that. There's a lot of that that was happening in terms of understanding what the true value of contemporary art ended up being. And so one of the thinkers that I think has helped us is Heidegger. Heidegger has wrote a few books. One is called the Origin of the Work of Art. But another one of his books that people don't think of in terms of art is the book called the Question Concerning Technology. Because the Greek word for art, for the Latin word art, the best translation of it is techne, craft. We still have that word. We use it in technology. The problem is that we've, like I said, we've ripped everything apart. Where we now have this notion of art that's up here and is esoteric and intellectual. And then we have techne, which is down here, which is making objects for consumption. But in the ancient vision, that's not how it was understood. And so Heidegger interprets Aristotle, and Aristotle considered techne to be a form of truth, to be a form of unveiling, right? I don't know how to pronounce this word. Aluthian, aluthien, aluthi, aletheia. Anyways, truth or unveiling. So this is Heidegger interpreting Aristotle. So techne is a form of Eleuthian un, unveiling or truth. Whoever builds a house or a ship or forges a sacrificial chalice reveals what is brought forth. This revealing gathers together, making that gesture for you on purpose, because I did it all morning gathers together in advance the aspect and the matter of the ship or house with a view to the finished thing envisioned as completed. Thus, what is decisive in techne does not lie in the making and manipulating of means, but rather in this aforementioned revealing. It is as revealing, not as manufacturing, that techne is a bringing forth. So if you think about what I talked about this morning, he is dealing with this question. He's realizing that making something is gathering things, gathering objects, gathering ideas, gathering all this together, bringing it into something which reveals the being of that thing. So if I'm making a cup, I am gathering elements, bringing them together in order to reveal to you the function, the purpose, the reality of this cup. So you get a whole other. A whole other vision of what it means for a human being to make, right? You get that sense of this participative act that to make something is almost. It's almost. It's almost an act of, let's say, lower creation, right? It's almost the possibility of, to the extent that we're capable of, to participate in creation, to be that image of God. But in order for it to be that, things have to actually come together. And one of those things is. And one of the most important things is purpose. And so it's not arbitrary that we have removed purpose from our culture, that we have removed the reasons for things in our cultural events. We have reduced them to distraction. We talked about distraction this morning. We have reduced them to distraction, to entertainment. And so they are spinning on the outside of that wheel, right? And we've lost that which brings it together. And there's a strange thing happening as well, very strange thing, because it's not only that we're dispersing out into this kind of fragmented chaos, but we're actually seeing things right now, seeing them flip upside down. It's very fascinating to watch because the last remnant of participative culture in our world was church. It was the last thing left. There were still people who went to church, you know, stood together, sang together. Even a Protestant church, you know, you were still at least doing something, right? It's music, it's narrative, it's words. And we're together, and we're all doing it together. It's bringing us together, focused on something which is beyond us. But it's very strange to watch today, right, when we've all seen it happen. We've all seen church turned into entertainment. And churches are doing everything they can to become as close to entertainment as they possibly can. Light shows, it's a concert. People don't know the words of the songs anymore because you have to change songs every time. Two weeks, because you always have to innovate. You have to keep people on the edge. You have to surprise them. Surprise is part of entertainment. The titillation of the new is part of entertainment. Every time someone asks me about icons and asks about why we should innovate in icons, and it's like, well, I'm not against innovation per se, but I do struggle with your desire to innovate, though. Like, I do struggle with a little bit of that. We have a name for that in the Orthodox tradition. It's called acidiyya. It's a passion, this incapacity to this desire, this instable feeling we have to always have something new, have something changing to kind of keep us feeling alive, you know, and everybody's felt that boredom, you know, you want to be entertained. And so that, obviously, is one of the strange events. But the other strange event is we're seeing the opposite happen as well. We're watching entertainment culture become liturgical. And that is the weirdest of all. So everybody knows about cosplay, right? So people will get make costumes of their favorite fictional characters. We'll dress up, and then we'll get together and we'll kind of reenact these things will, will, will, will celebrate their fictional characters. And it's a fascinating thing to watch because it is born. It's born out of that same desire we have, the desire that should be the desire for, for liturgy, the desire to come together and to act as one and to, to. To. To act together that is now flipping into these strange venues. There is a monastery near my house, about 10 minutes away from my house. And like all monasteries in Quebec, all the Catholic churches, all the monasteries, they're all dying. Everybody's going away and they don't know what to do with these buildings, right? What we have all these buildings. The most Catholic place in the world. It used to be. So now we have all these buildings. What do we do? And so this monastery, they've been struggling with it, trying to find a venue. And finally they were able to sell it and everybody celebrating because they were able to sell the monastery. And it was bought by an entrepreneur, someone who organizes events. And so what he's going to do is he's going to have Harry Potter events in the church. So the church, they'll have people dressed up as the students in Harry Potter and then they'll reenact scenes from the Harry Potter movies and books in the church because it's beautiful, right? Beautiful architecture. And he's going to do Game of Thrones events where people are going to come and react, reenact Game of Thrones and, and. And all of that. So, and this is not a joke. There is an organization, it's called Harry Potter and the sacred Text. And they have churches, they don't call them churches, but they have groups that meet every week and they have these liturgical readings of the Harry Potter books. They gather together and they. All over the United States, they sit together and they, they. They try to participate in the story of Harry Potter. They have this desire to participate, this desire for something to be. To not. They want their entertainment, to not just be entertainment because they have felt the emptiness of that. And so they want to enter into the story. They want to participate. And the ultimate example now is this last movie. Who's seen the Spider man movie? Oh, you guys are too Christian for me. No one has seen this. What is going on? What is going on? So this last Spider man movie was called Spider man Into the Spider Verse. And in this movie, the main character discovers, learns to be spider man. But by reading Spider man comic books, by interacting with another, like the original Spider Man. So he is being initiated into the spider man world. He's a Spiderman Catechumen. And so it's not just that we have Spider man, but now we have a story of Spider man where in the story there's a character who is learning from Spider man to become Spider man, right? And the whole movie keeps saying, anybody can wear the mask. Anybody can become Spider Man. Which is obviously really stupid because not. Most of you can't stick to walls, I think. I don't. Unless, if you have enough faith in Spider man, maybe you can stick to walls. I don't know. I'm not sure. But there's. I mean, but the desire, right? The desire is so real. This desire to participate in is. You can't blame them. You cannot blame people for having this desire to enter into the story, to be part of the story. And so that's the title of my talk was, Liturgical Art is the only solution for the Cultural Problem. And I think that statement is true in every single context. Whether or not people return to Christianity and discover the liturgical life, or whether they stay with Spider man or Harry Potter, liturgical art is the only solution to the cultural problem. People are looking to identify, to participate, and they're at the end of this bland, outside entertainment mode because it. It leaves you empty. But of course I will, you know, of course I have made my decision. I made my choice which side I want to go. And I. And so what I want to do for the last part of my talk is I want to try to explain why liturgy is the only Gemenskunstwerk, the only total artwork. And so what I mean by liturgy now is you have to see it as a little bit bigger than just the. Let's say, the actual ritual or the actual prayer. The actual services. Now, when I'm talking about liturgy and liturgical experience, or liturgical art encompasses the, of course, the services, the constant services, which exist actually, you know, that we have a small part of, but in the monastic world, exist to their fullness. And this totality of filling up time with prayer, right, you could see that as the ultimate version of it, and we participate in it at different levels. But it also includes, of course, the architecture of the church. It also includes the iconography of the church. It includes, of course, the music itself, not just the service, but the actual music. It also includes the objects that are made to participate, the vestments, the vessels, you know, the furniture. All of this is what I mean by liturgical. The liturgical. Full liturgical experience, you could say. And it not only includes that, but it also includes the very cycle of the liturgical year, which means that the liturgical year is this Entering into the story of Christ which follows the whole year, right? We enter into the story of the Mother of God, into the story of Christ. And that's the basic track of the. Of the year. And so what happens is we see. This is where we see everything come together, right? So Wagner said, talked about narrative, talked about music, talked about the visual aspect, let's say visual art. So we add to that architecture, and then we finally add the ultimate one, which is participation. And so the liturgical year is the true cultural manifestation. Why? Because it brings us together. It creates, it qualifies time, it gives meaning to time. And we all know that it's great now today. It's actually great today because we're so far from that. We're so far from the liturgical time that we can easily point to everybody and say, right now, in our world, is there qualified time? What's the difference between day and the night? It's barely gone. It's barely gone between day and night. It's barely gone between the days of the week. It's pretty much gone. You know, the stores are open 24 hours and they're always there. So time is just this strangely spread, you know, quantity across. And we don't have this rhythm that is found in the traditional cultures, this rhythm which marks time and which is like music. You can imagine the liturgical year as a giant orchestra, you know, as a giant opera, which lasts the entire year, which follows this story of Christ. And you can enter into this story. And it also, like I said in Mark's time. I have said this several times in other talks, but. But in a medieval village, where do you put the church? In the middle, right? You put the church in the middle of the city, and then everybody sees the spire of the church. It becomes the center of the village. It becomes the place where everybody meets. It becomes the reference of the village. And so all of this is qualifying time. It's giving us the reason why we even exist as units. We don't even know, like, what's the difference between this suburb and that suburb. We don't know. We don't even know why there's a limit between the two. It's just a bunch of houses spread over the terrain like that, a few malls. We don't have town centers anymore. We don't have anything which qualifies space. It's gone. And even the shopping malls are on their way out. Soon there won't even be shopping malls. Those are the last remainders of a place of communion, you could say in space. Those are Going away, all that is left are individual segregated habitations with people who don't know, barely know their neighbor and who are connected with all these other people and who are performing for all these strangers online. And so the church. The church qualifies space, and then it also gathers material culture. It creates the standard for architecture, the standard for space. It creates the standard for fabrication. And usually having the most beautiful objects, it becomes the standard for other objects. You can see that as a hierarchy, like the King's chapel or the Patriarch's church has the most beautiful things. And as you go down the hierarchy, you have more simple things, but are all looking towards those patterns, let's say. And so it qualifies even the fabrication of things. And so that is why I think those of us that have left the contemporary art world and entered into this participative art, it is amazing. It is. It's hard. It's so hard because when I meet artists, they don't. They don't understand, like contemporary artists, like, you make what you make religious pictures for churches. Really? Oh, okay. And then they think that I'm doing it kind of by default because I couldn't make it, you know, as an artist. That's what they think. That's what they think. It's hilarious. But they don't understand the joy because when I make. When I make an icon. So I'm going to start showing you some of my icons as I. As I go through this. So when I make an icon, I am engaging in the language of the church. So, like a poem, you know, like. Like any form of ancient art, you know, like a poem that has form, anything that has a basic structure which we can all agree upon and which brings us together, which makes us know that I am. I am part of this culture rather than this other culture. Like, I. I'm somewhere in the world. I'm part of a group. I'm part of a communion of people. So I participate in the language of the church, but then I'm also participating in the community of the church because I am making objects for specific uses. I am making an object for someone who wants an icon of their patron saint. I am making an object for a church who is looking for a specific icon that they want to have out there. I'm making a blessing cross so that the priest can bless, can bless the people. And so the object that I'm making is connected to the community. But at the same time, what's amazing about the luck that we have making liturgical art is that the subject of my art reaches as high, talks about mysteries that are as esoteric as. As powerful, as hidden as any contemporary artist would ever be able to touch. Right? And so it's not just that I'm. Liturgical art is not just that I'm. There's a nobility in making a chair, and there's a beautiful nobility making a chair. But when you're making an object which also participates in this language of narrative of the church, then you're also dealing with. So you're connecting these stories, these principles, and you're connecting them with actual objects that are then going to participate in the world. I always say that liturgical art reaches higher than contemporary art, and it reaches lower than contemporary art because it connects actual used objects with these higher principles. And so that's why I think that liturgical art is the only solution for the cultural problem. Now, I'm not. I think I just want to be careful. I was a bit hard on cultural manifestations, let's say modern cultural manifestations. I don't see that there's anything wrong with movies or with popular music in itself. I mean, obviously, a lot of it is trash, but not necessarily. Not necessarily. It doesn't have to be right. And novels or poetry, all those things are fine. The problem is the proportion. It's always a problem of hierarchy. Everything has a place. The problem is when things are not in their right place, is when there's a problem. When we live for entertainment, that's a problem. But it's okay to have a party, it's okay to dance, it's okay to have a carnival, like traditional carnivals are in every single culture. The problem is proportion. So, for example, I think that in the recovery of liturgical art, in the recovery of the biblical stories, in the recovery of the story of the saints, in the participation in those stories, what we will also gain is a amazing matrix of references, the matrix of references that built Western civilization, the matrix of references that made Shakespeare what Shakespeare was. As we lose those, we also lose. The profundity of the art just becomes this vapid nonsense because we've lost all these connecting threads that come from the Bible and come from our existence in this liturgical world. And so I. I do believe that to enter into, let's say, to rediscover the. The liturgical. I'll give you an example, like something especially that a lot of people know. Jordan Peterson. He's. He. He's a. He's a friend of mine, and he is working to help people rediscover the biblical stories. And I think that that's awesome because he sees that. He sees the problem that I'm saying. He says these biblical stories are underlying our culture. If we take. Take them out and we fall in vapidness and our culture will be nothing, our morality will be nothing. So he's like, let's rediscover those stories. But I think it's not enough. I think it's not enough to just know the stories. I think you have to jump in, you have to participate. You have to enter into the story and the liturgical life and the liturgical year and the liturgical experience. That is the best and most common complete way to actually participate and not just read the stories as an intellectual exercise, let's say. But like I said, I do think that once we have rediscovered, once we have entered in, I don't have a problem with other art coming out. And I've seen now several Orthodox artists and some Catholic artists also who are. Who are starting to use the. I mean, you see that in Tokin, you see that in CS Lewis, where they. They are bathing in biblical understanding, bathing in traditional, let's say, structure, traditional narratives. And they're writing things which are not directly liturgical, which are not directly, even in Tolkien's case, is not even Christian on the surface, but is so understood from underneath, is so bathing in all those references that. That it creates a powerful story. So right now I am working on a graphic novel with an artist. I wrote the story with my brother. And it's going to be a wild, very, hopefully very entertaining retelling of the legend of St Christopher. And it's going to be an adventure with. Can anybody recognize. Who do you think is on the pillar? Maybe can you see the pillar in the background? Yeah. So Saint Simeon is in the story. And so. And so it's. There's going to be dragons and there's going to be monsters and all of that, but the. The underlying references, the underlying mesh of relationships is going to come straight out of my own experience in iconography and my own experience in reading the lives of the saints and. And the Bible. But I don't. It won't be for Christians. I mean, it can be for Christians, but I'm not writing it for Christians. I'm writing it for everybody. It's not going to be this, you know, like, you know those Christian movies. Know those. Yeah, those are really, really, really bad. And they're. And they're very bad because they're. Because they don't have this depth of understanding, the relationship between the visual world and the narrative world."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":2628.45,"end":2628.7,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":2628.77,"end":2822.56,"speaker":"Jonathan Pageau","text":"And the patterns and the rhythm, they don't understand it. They just have this message that they want to get across. And it stinks. Literally, it stinks in the sense that you can smell. Oh, propaganda. It doesn't smell good. It doesn't smell good. And also, even the silliness, even the silliness is not totally absent from this structure, right? In the Middle Ages, they had what was called marginalia. Who knows what marginalia is? So the way that medieval manuscripts in the west were written is that they would write the text in the middle and then on the sides, they get wild and crazy, right? And so, right, these are on the sides. And he goes very, very far. So I have to apologize in advance. Everybody, everybody probably here has seen the. The. The. The Search for the Holy Grail by Monty Python, right? So who remembers the trumpeteers at the beginning, right? The. The special trumpeters, right? And you'd think. You'd think. You'd say, oh, this is. This is. Right, this is blasphemous, right? This is. This is a mocking Christianity. But they didn't make this up. Monty Python didn't make this up. They. This is from medieval manuscripts. This is in the Middle Ages, they had. But trumpets too, right? And so there is room for the margins. There's room for the gargoyles on the outside of the church. There's room for the carnivals. You know, the. The Mardi Gras, the carnivals. All those are part of the total story. But we don't live here. I'll just. For. So Father Stephen can stop, just move to something more glorious here. So it's part of the story. The problem is that we don't live in Mardi Gras right now. The whole year is Mardi Gras, and now the entire world is upside down. And so there's room for the. Upside down. You just keep it on the edges, and then it serves its purpose. Now, you know, the Jews, they celebrate Purim every year and they get drunk and they spin and they fall on the ground and they dress, they cross dress, they do all this stuff. But it's just one day a year, right? Just one day a year. And it's on the edge, right? It's the last, that book where God's not mentioned, right? So hopefully, I hope that this has helped you understand why I. Why. I think that that one of the reasons why a lot of us that are now entering into liturgical art, we're doing it, obviously for our own sake, for our own salvation, I think, and because of our love of God. Our love of the church and our love of this art. But I think we also know, at least I think that I'm also doing this. This is the only door. This is the only door that right now that can lead to something productive because all the others are out on the edges of the wheel. And so I don't want to. I don't want to fall off. So thank you very much."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":2827.68,"end":2839.68,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":2840.34,"end":2841.7,"speaker":"Jonathan Pageau","text":"You can also get involved."}
{"episode_id":"SW - #067 - 2019-10-26 - The Only Solution to Culture","start":2841.86,"end":2892.68,"speaker":"Jonathan Pageau","text":"There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
