{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":0.56,"end":26.56,"speaker":"Jonathan Pageau","text":"I hate to say this, but it does feel like I've been radicalized in some ways and radicalized, you know, not obviously to take up arms or to do anything violent, but radicalize in the sense that I realize that there are some things which are broken that I don't see how they can be repaired at this point. You know, we've reached over the line in ways that is beyond the pale."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":32.06,"end":32.38,"speaker":"Unregistered: Unknown Co-host","text":"Foreign."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":37.98,"end":582.95,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. All right, it's been a few weeks now since the assassination of Charlie Kirk and I wasn't sure I was going to make a video about this, but I thought that maybe it would actually be an opportunity to make a video, of course, about the event, about some of what I perceive to be its effects, but then also about politics in general. You know, I get comments all the time, people asking me why don't I talk more about the war in Ukraine or, you know, the situation, the war in Gaza or why I don't talk about, you know, Nigerian Christians being slaughtered or why don't talk about, you know, different political things. And in some ways the same thing goes with Charlie Kirk. Many people have written messages and they ask, are you going to talk about the assassination? And as you've noticed, I actually very rarely talk about politics. It's not that I don't have political opinions, I definitely do have political opinions, but at least in my public sphere, I feel like that is not my function. I will talk about politics if I feel that it's insightful and that it's helping you understand bigger questions. You know, as you notice, I started talking about the end of the World War II consensus. And it is because I have insight about what is happening to us, can help us understand what's going on, but then also help us understand deeper patterns and deeper stories and understand how worlds end, you know, how worlds begin, all of that stuff now. And you also notice, maybe, or maybe you haven't, that if I am going to talk about a current event, I usually take a lot of time before I talk about it. I want to avoid virality and I want to avoid, you know, getting into the fray and getting those rage bait clicks. So these are decisions that I've made and that we made as a team in the symbolic world. In some ways they are anti tension decisions, but that's just how it's going to be because obviously I am very worried about getting into the cycle of rage and of clicks and of and of finger pointing. Now, having said that, I have to say that there's definitely something that has happened with the assassination of Charlie Kirk. There's something very big that is changing. And, you know, I can see it really, in myself, I have to say, because I wasn't particularly a fan of Charlie Kirk. You know, I just wasn't paying that much attention to him in some ways. I think his public was much younger than I was. And. And his style, you know, and it's. I'm not an American, so I'm not in American politics. And his style weren't particularly the. The type of style that I appreciate. And. And some of his positions were. Were not my positions as well. But. But obviously, you know, when Charlie Kirk was shot, just after. Even before I knew that he was shot, we had a symbolic world meeting. And there were several people on the meeting, and my friend Jordan hall was on the meeting. And so we. We found out about it during that meeting, and everybody was kind of shocked and surprised at what was going on. Didn't know. We didn't. He wasn't dead yet. We found out that he was dead during the meeting. And Jordan Hollsent said something very wise to us. He said, now is a good time for network pruning. And what he meant by network pruning was, this is big. Like, this is something big that's just happened. And it is a good idea to pay attention to what people are saying at this particular moment, people who jump in, people who right away want to express their ideas, because you will see their hearts, you know, he said, both for the positive and the negative, you know, and so sometimes people will say something extremely wise and that it makes you want to pay attention to them. And then on the other hand, people will say something very foolish, and it will make you want to remove them from your circles. And I took that very much to heart. And I watched what happened. And I think, like most of you, maybe I'm wrong. I was very surprised. I was very surprised to see people that are too close to me, people that are friends of friends, people that are friends, people that are. Or even going to my church, who either celebrated his death outright or, you know, before his body was cold, started to make derogative comments against him, to in some ways not celebrate, but at least justify or excuse or suggest that he was asking for it, that kind of stuff. Suggesting also that it's not a big deal. Why are we even talking about this? Who cares? This person is not important. It's not a big deal. And so it was actually quite shocking to me because I think, like most of you it was shocking. It was shocking because like I said, there are some things that I disagree with. Charlie Kirk. I'm a Canadian. I don't necessarily agree on his position on guns. I don't agree also on his position on Israel, for example. But basically, apart from that, this guy's just a basic conservative. And I understand that there is, there are people that have been seduced by lies and let's say, reframing of the things that he said by the media, but even that makes it alarming as well, is that, first of all, so many of the things people were saying to, let's say, excuse his killing or to kind of say, well, he was kind of deserving it or was asking for it, was usually things that Charlie Kirk had actually not said that were reframed in torturous ways that were lied about. Like, for example, there was this famous thing about how Charlie Kirk said that now he has to think about. I'm not going to phrase it exactly right, but now he's going to have to wonder if a black pilot is qualified. And people said, well, that's racist. But it was weird because the quote is actually anti racist. He was saying, if you hire people only because of their skin color, you're forcing people that are taking the flight if they see someone who's black to now ask the question, were they hired for their capacity or were they hired because of their race and they're not capable? And so he's saying, no, let's not be racist and hire people for the color of their skins. Because what it does is it creates the opposite of what you think. It actually can encourage racist thoughts in people because now they're thinking, well, why was this person hired if I knew they were hiring for equality? And I see a pilot that is of a different skin color or whatever, whatever. I'm like, well, they know what they're doing. They're hiring qualified people. So that was just one example. But there's so many examples of people that were deforming it. So that was already obviously something that we've seen. Obviously. I saw with Jordan Peterson that we saw with Donald Trump that we saw in so many of the right wing. We saw Gavin McGuinness get destroyed because of people lying about what it is that he actually said. There were so many of that happening. And in some ways, how can I say this? Like, it felt like this part of the problem was being taken care of. Like it felt like in the past few years we in some ways have been able to break through and to Avoid the media misrepresenting figures in ways that are extremely damaging to them. But it seems like we haven't. It seems like we haven't and that this is still going on. And so that there are people use lies in order to misrepresent others and to stoke hatred against them. But even if those the lies had been true, even if the things that people said about him had been true, the fact that this would lead to people diminishing his assassination or diminishing or celebrating it or thinking he had coming. It's very telling about the state of our culture. Hello, everyone. We are finally announcing our Paradiso class. We have done two already. We have the Inferno, we have the Purgatory, and now we are moving to Paradise."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":583.43,"end":615.41,"speaker":"Unregistered: Unknown Co-host","text":"That is right. Dante himself says Inferno, that we prefer hell to Paradise. And similarly, most of us prefer to read Inferno. But when we come to reading Paradiso, we're very confused. So we're going to be actually taking you through that poem line by line, like we did with Inferno and Purgatorio, and actually looking at how. How Dante very carefully reconciles some of the contradictory traditions about the heavens in the Christian apocalyptic tradition and does that through the persons of the saints."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":616.13,"end":647.23,"speaker":"Jonathan Pageau","text":"And so this is truly important for us right now with the re enchantment of the world happening, we have to be able to look at those that did it in the most powerful way that were able to reconcile the ancient pagan traditions with Christianity, with his modern understanding, the most modern understanding of the cause cosmos that he had. And so this is the work that we need to do. And so we need to learn from Dante. So the course starts November 5th to December 3rd. Right. Is that what I've got? Five weeks, two to five on Wednesdays."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":647.55,"end":659.63,"speaker":"Unregistered: Unknown Co-host","text":"So the cost is going to be $190 US. But we do have an early bird sale through the month of October, which bumps it down to 161. You can use the code Early Paradiso, and that is good through the end of October."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":660.03,"end":675.69,"speaker":"Jonathan Pageau","text":"And the Inferno and the Purgatorio class are also on sale at the same time. So you have 50% off during the month of Octo, October, code Dante50. And you know that means you have no excuse. So if you haven't taken the first classes, now is the chance to scoop all that up."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":676.09,"end":692.13,"speaker":"Unregistered: Unknown Co-host","text":"Yeah. And if you don't want to watch live or it doesn't work for your schedule, you'll be able to follow along at your own pace. Just like with all of our courses, you'll have access to lecture, recording slides, additional readings, and you can still ask questions and interact with your fellow classmates in our circle forums."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":692.44,"end":699.08,"speaker":"Jonathan Pageau","text":"And so join us. After all of this suffering through Inferno and Purgatorio, the symbolic world finally goes to heaven."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":699.32,"end":700.2,"speaker":"Unregistered: Unknown Co-host","text":"Yeah, join us."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":706.28,"end":721.72,"speaker":"Jonathan Pageau","text":"And so in some ways, I hate to say this, but it does feel like I've been radicalized in some ways, and radicalized, you know, not obviously to take up arms or to do anything violent, but radicalized in the sense that."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":721.81,"end":722.05,"speaker":"Unregistered: Unknown Co-host","text":"But."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":723.81,"end":1468.38,"speaker":"Jonathan Pageau","text":"I realized that there are some things which are broken that I don't see how they can be repaired at this point. We've reached over the line in ways that is beyond the pale. And you see this with the kind of celebration of assassination and the desire for assassination for the President of the United States, how people celebrated the. What is his name? Manjoni, the guy who killed the CEO. All of this is very disturbing, but at the same time, it is not that disturbing. It is not that disturbing because the notion that violence is not a part of politics is a very recent thing, and it's a great thing. I'm happy that we have kind of come to the conclusion that violence should not be part of the national political discussion. But the. The revolutionary thinkers. I mean, revolution means cutting the king's head off, folks. No, that's. That's what revolution entails. Revolution means violence. And so it is not surprising that the people that are on the, let's say, further left are celebrating or at least seeing that this is normal fare for political action is to assassinate, to bomb, to do the things that the revolutionaries have always done. And at the same time, you will see that this goes both ways. It just does. This is how it works, is that there is also a kind of celebration of, let's say, authority violence that comes from the other side. And so the right in general tends to think that violence is legitimate if it comes from the source of authority and is there to protect and exclude. And the left thinks that violence is legitimate if it goes against authority, and it is there to remove authority in order to free us from tyranny and fascism and all of these types of things. Now, I am obviously more conservative. I tend to think that there is a legitimacy of state violence that is inevitable. You know, you put people in prison, you arrest them. All of these, in some ways, are inevitable. And, you know, for a very long time, you know, we had the death penalty for certain things. This is. This is something that is, I think, more normal than revolutionary violence. But you can understand the story and how, as People on the right, you know, are celebrating arrests, are celebrating deportations, are celebrating, you know, these gestures. Then the people on the left start to. And I'm saying one is the cause of the other. I'm saying these two are kind of happening simultaneously. And we're seeing a desire for revolutionary violence and a desire for assassination. I mean, you know, the former head of the FBI, for goodness sake, suggested on social media that we should assassinate the President of the United States. It means that assassination culture is growing. And I want to point out something. You know, my brother Mathieu is preparing to write his next book, and he recently put out a video. We can link it in the description where he was interviewed by a Spanish interlocutor, because his book has been translated into Spanish, which is great for all you Spanish speakers. You can get Language of Creation in Spanish. But I think Mathieu, my brother, had one of the best takes in terms of the Charlie Kirk assassination. Some of. He had the wisest take. And he mentioned that debate is something like the role of opposition within a society. That is, that within a system, within a family, within a. A country, you know, within whatever body that you can imagine, there are means by which to express opposition in order to make ourselves better. Right? So you need an opponent inside a system to tell you when you're doing something wrong that you can improve yourself. And we know as that's happening that we're all nonetheless working for a higher goal, for the unity of the nation, for the unity of the family or whatever group that you're participating in. And Mathieu points out that in some ways, debate is a friendly version of that, where we accept certain rules, we accept that we're going to duke it out in words. And the purpose is that, you know, we understand that we are not enemies, actually, that we are kind of opponent in the sense of opponent processing, really, that John Revaeke talks about this need for check and countercheck in order to get better and to align ourselves properly, that if you transform that into violence, then you are creating the true satanic relationship, right? So now the opponent is outside, right? Now the opponent wants to kill me. Now the opponent wants to devour me. And so it is, you know, political assassinations are ways to cause civil war, are ways to. To provoke true physical conflict in. In the country. And so I thought that his insight was very wise and that we should really pause and think about it and consider this as we move forward and as we see this happening. And once the problem is that once this is breached, once political violence starts to be acceptable in the world, it is going to be hard to stop it, you know, because the problem with political violence is that it works like it does what people want it to do, especially if what you want is to accelerate the conflict, you know, and, you know, it's very difficult to deny that terrorism works. It actually does the things that it tries to do. I mean, look at Muslim terrorists. Like Muslims kill Christians, they bomb, they create acts of terror. And because of those acts of terror, people are afraid to criticize Islam. And they don't. And they justify it in all kinds of ways, but really they're just afraid of violence. And so this is, of course, a frightening time when we see this happen. But one of the things that I've appreciated and that I've been in some way surprised about is that the reaction from many of the right leaning pundits has been to appeal to Christ, right? Appeal to Christianity and appeal to forgiveness, appeal to an understanding that in some ways Charlie Kirk is a kind of martyr. Obviously he's not a martyr, you know, in the strict sense, but he in some ways acts as a kind of martyr for the, for the conservatives, for the right. And instead of using this only as a battle cry, is to see it mostly as a way to unite their side and to unite their side under a banner of debate and honor and also forgiveness. So if that whole hold, I think that we will, we might have something powerful that is coming downstream, but we'll see. It's a very fragile thing because for the past few years, the conservative movement or the right wing, especially in America, has been very divided over the question of Israel. And so, you know, and so that's why you can see, like, it's interesting mythologically to watch it happen, but you can see is that, that, you know, this man dies, is killed, is assassinated in public, you know, as a kind of human sacrifice type gesture. And then what you see is, you can see the faction of the right be united immediately and say, all right, all right, let's this bickering, let's stop it. Let's, let's not, let's not fight over these secondary things. Let's focus on the fact that, you know, we have people that are trying to kill us and that we have to rise up and be better. But then also what you see right away in the second wave is you see factions of the right trying to claim the martyrdom for themselves, right? And so what you see is people trying to posit certain positions that Charlie Kirk had in order to align the martyr with their cause. And so we have to be very attentive as we see that happening, because it is a. It's kind of inevitable that that will happen. But it's good to notice it, to notice that. That's why there's this whole discussion now about, you know, this letter that Charlie would have written to Netanyahu about Israel and others, saying it's not the real letter, it's a. It's the fake letter. And that, in fact, it was a letter that was critical of Israel. All of that is, in some ways, people on the right trying to kind of claim the martyrdom for their side of the. Of the debate. Right. And so to continue to act as if this is uniting us, but to want to frame the unity in their side. So pay attention to that, you know, in terms of watching things happen. It's worth. It's worth noticing. But, you know, but I have to say that I've been very affected by this. Like, not. Because, like I said, not, not. But of course, a father being assassinated in front of his children, I mean, it's a horrible thing. But I think it's because of everything surrounding it, everything surrounding that event that is making it remarkable and worthy of paying attention to, because it's exposing things about our society. A friend of mine, Winston Marshall, who I've done interviews with, he went to the vigil in New York a few days after the. After the death. Right. You know, and he said that Antifa came and they were all dressed in black and masked and holding their phones, and they were laughing like little demons, he said, and they were creeping through and, like, putting their phones up in people's faces and coming right up to people, to people's faces, laughing and giggling as they were remembering this man who was just like two or three days, like three days before, who was assassinated because of his political opinions. And so you can understand how that has an effect on people. Yeah. And so I would say, you know, to everyone who's watching, I would say to watch your hearts, to make sure that your hearts are aligned properly. It's okay to have a political side. It's okay to have political opinion, but of course, we always have to couch those political opinions into higher truth. And if you're an American, into a higher unity, and if you want to preserve the unity of your nation, you have to be very cautious in formulating the other side of the political aisle as an absolute enemy. Because if you do that, then that at some point will yield. That will yield civil war. And we have to be able to recapture the possibility of opposition as debate within unity. So, like I said, different thoughts to consider. You know, don't forget to check out the video that Mature did. It's very insightful. He also talks about Antichrist in ways that is just in passing. He says these things in passing. Extremely wise and extremely, extremely worth considering. So thanks everyone for your attention. I feel like this was not completely coherent, but hopefully these thoughts are valuable to you. So talk to you very soon."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":1468.38,"end":1468.98,"speaker":"Unregistered: Unknown Co-host","text":"Bye bye."}
{"episode_id":"SW - #415 - 2025-10-10 - Charlie Kirk's Assassination - We have gone beyond the pale","start":1469.06,"end":1484.1,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
