{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":0.96,"end":93.11,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will be playing for you two videos relating to conspiracy theory. The first is called the Symbolism of Conspiracy Theory, where I look at the discussion that Alex Jones recently had with Joe Rogan on his podcast. And what I try to do in that discussion is try to break down some of the things he says and try to show that despite how crazy some of the outer aspects of what he says seem, that they often seem to reflect a deeper and more profound pattern. So you can check that out. And in the second part, I look at the symbolic meaning of flat earth and how these new ideas are coming out in terms of how people are starting to doubt the narrative that has been put out there. And both of those videos it's showing is how there is a breakdown in our trust of. Of the social narrative that we no longer trust our authorities, we no longer trust the stories that are being told. And that this is a symptom of a deeper breakdown of meaning that we are facing. And so don't forget that everything I'm doing here online, this podcast, and the videos is due to everybody's generous support. So go check out the symbolicworld.com to see how you can support this podcast. Of course, sharing, subscribing, and. And also leaving a review wherever it is that you listen to podcasts. I hear is extremely helpful in getting the word out there about the symbolic world. So hope you enjoy this discussion on conspiracy theory."}
{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":106.39,"end":109.99,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":120.89,"end":2409.43,"speaker":"Jonathan Pageau","text":"As many of you have seen, Alex Jones was back on the Joe Rogan Show. I think it was, was it yesterday or two days ago, and it seems to be blowing up on the Internet. I've been wanting to do a video on conspiracy theory and using Alex Jones as an example. And so I thought that because now Alex of this is going down, it might be a good opportunity to look at how conspiracy theory functions in terms of its symbolic structure. So if you watched the podcast, if not, I would suggest you do. It is long, it's four hours long, but it is worth watching because through the crazy discussion and the extremely dramatic presentation that Alex Jones gives, there are some interesting things that you can get from. From what he says, some interesting things that can help you understand the structure of reality and how things lay themselves out. First of all, I have to say that Alex Jones seems to be someone who has a very good intuition about things, and he doesn't seem to have the right language to express them. He also seems to be caught in what I would call a kind of Materialism, which means that he, his symbolic intuition is always pointed towards a kind of materialist explanation. And that is actually the case about a lot of conspiracy theory. If you look at a lot of conspiracy theory, they tend to see the symbolic structure, their symbolism, or if they see certain symbols appear, instead of seeing those symbols as pointing to principles or pointing to patterns of reality, they tend to see them as only pointing towards, let's say, specific historical events or specific historical structures. And so I'll give you an example that is very. That happened to me not too long ago. I was visiting a church nearby, a Catholic church. And in the church, in one of the arches of the, of the roof, of the ceiling, there was an all seeing eye, you know, a triangle with an eye inside. And there was a man there. We were being given a tour by a tour guide. And there was a man who looked at the tour guide and he said, oh, you know, that means that this was built by the Illuminati. And so, you know, I should laugh. You know, a lot of people see it that way. Obviously that church was not built by the Illuminati. Some church in Quebec, you know, in the 19th, 18th, 19th century was not built by the Illuminati. That symbol of the all seeing Eye is a very ancient symbol which we can find in medieval churches. We can find all kinds of plain in all kinds of places. It has a specific meaning. And whether or not it was an image used to represent God, because God is an all seeing eye, and whether or not it was used later by Freemasons or by, you know, certain, certain organizations, that is quite possible. But we cannot reduce the symbol to its historical contingency. It's the same with the swastika. A swastika does not mean Nazis the sweet. The swastika is a very, very ancient image which is one of the oldest images we have. And the fact that it was used by the Nazis does not eliminate its ancient language, its ancient meaning, because if you go to medieval churches, once again, you will find swastikas all over the place. You will find them. I visited Calvin's church in Switzerland and there were swastikas in the decoration. It is a very, very ancient symbol which has a meaning, a meaning about which is. Goes beyond its historical contingency. Okay, so that's first of all very important to understand. Now, despite that, despite the fact that Alex Jones seems to want to see symbolism related to historical contingencies, which makes him end up using all kinds of crazy language such as multidimensional and Trying to relate everything to some kind of scientific hypothesis. His intuition is. Is actually quite good. In terms of understanding symbolism, if you haven't watched the video, I would suggest you do, because one of the things that happens during the discussion with Joe Rogan is that they end up talking about conspiracy theory itself. And the way they talk about it can help you understand what conspiracy is, why conspiracy theories appear. And so conspiracy theories, the symbolism of conspiracy theories is that it comes about to show us that there is no longer trust in the structure. There's no longer trust within an authority structure. And so when conspiracy theories start to pop up, even beyond the way they pop up or the form that they pop up, what it points to is a breakdown of social cohesion because we start to doubt the. The intentions of those in power. We start to see them as being hypocritical, to see them as lying. And in the podcast yesterday, it's very interesting because Alex Jones at some point starts to say that even himself at some point had what he called a mild psychosis. Because the government in the 20th century have lied so much to us. Because there are now specific examples of times when governments have acted against their own people, where governments have said one thing and then done another in secret. Because of that, now we have a general culture of doubt. Whenever the government says something, whenever something happens, there will be people who will doubt the authenticity of the events, because it is because the government has lied so much that it has broken down the. The social cohesion. So when you remember, for example, someone like Jordan Peterson, who talks about how when you lie, you lead the world into hell. Now here's a very, very concrete example. By lying, many times in the past, our states, our governments have brought about a state of mistrust towards their intentions. And what that's doing is creating breakdown in. In social cohesion, and it is encouraging conspiracy theory even more. And so even Alex Jones, at some point, he said, at some point he started to doubt that anything was real, that everything that appeared in the media, any event, was staged, was that there was something behind it which was hidden, that was a conspiracy. Okay? And so that's really important to understand in terms of. Of conspiracy theory and what conspiracy theory means. Now, what's interesting about Alex Jones's ranting is when the social cohesion breaks down, you can imagine it as you have a society that has a center, that has a common memory, that has a common identity, that has a common leadership. All of this is what creates an actual society. Is that what we are attached to a Center or to several centers which are acting together. Okay, now once that starts to break down, we start to move towards the periphery. The periphery is the place where multiplicity starts to affirm itself and starts to break down. And then when that happens, what is the result? What is the result of that breakdown? In order, two things. One is a desire for tyranny, a desire to create something which will regain control over the control that's been lost. And you can hear that in the conspiracy theory about the notion of a one world government. The idea of a secret elite which is trying to control our society, our culture, is trying to control us. And so you, you see in the conspiracy theory a normal understanding of what happens when societal structures break down. When the center starts to stop holding, then one of the reaction is to overcompensate by this type of control. Now the other side is the fall into chaos, the fall into idiosyncrasy, and then going to the margin of the world where all the monsters are. You know, just like in the ancient times, we had this notion of the monsters on the edge of the world. Then you see that happen. So in the conspiracy theory, it is not surprising that you will find things like hybrids, like cannibalism, like monsters, like demons, like strangers, aliens. You know, all of that is going to almost necessarily appear in the conspiracy theory because that is what it looks like for a world to break down. Let's look at those, let's look at those. A few of those in particular. The biggest thing that Alex Jones has said, says, and which causes people to lose their mind is the idea that the government has been in contact with aliens for a very long time, you know, and these aliens are dictating to them what to do. And the aliens are asking for human sacrifice and blood and all of this. And you think like, whoa, okay, man, it seems like he's losing it. But let's look at it, let's look at it in terms of what it's referring to. Okay? If you listen to Alex Jones very carefully, at some point he'll start to switch between the name that he gives to these aliens. He'll say alien. Then he'll say something like elves. And then he'll say demons. And so what is he talking about? What is he talking about? Now, if we want to understand it symbolically, what is happening as the world breaks down from unity? What ends up happening is there's a remanifestation of the wild principalities that I've called them, these principalities which are not attached to the center principalities which have, let's say, a mind of their. Of its own, of their own. And that are leading towards fragmentation and towards chaos. And those will be what we call demons. They are related to our passions, our passions for power, our passions for sexual gratification. Those two things together are our passions for violence. And those passions represent themselves in different forms. One of the form, of course, is rape. One of the form is sexual domination. One of the form is cannibalism. Cannibalism is the ultimate image of devouring someone else in order to acquire power for yourself. And as you start to be focused on power, let's say external power, as you move away from that inner center and. And you look towards outer forces, one of the things you notice is that power comes from devouring it from other things. You know, even your own body. You get power in your body by eating, by eating things that come from the outside. And you can then represent that also symbolically, that whatever power you get, you get from imposing your power from taking someone else's power. They. That is not necessarily bad. It can be good. I've used the military example before. A military general is using the power of his men in order to increase his capacity to act in the world. Now, it doesn't necessarily have to be bad, but it definitely can be bad. And when we use the example of cannibalism, that's when we see how it can be bad, how an incruing of power in yourself can be the devouring of somebody else. Okay, you see, the same with the idea of human sacrifice and especially infanticide. Now, as you move towards paganism, it is inevitable that infanticide reappears. I've been saying this since I was 20 years old, that it is inevitable that as Christianity falls away, there are some things which will reappear. Infanticide, which is a traditional practice in many, many pagan cultures, and then also suicide, or let's say suicide of the elderly, will also be something which will reappear, which was also a normal part of many, many ancient pagan traditions. And so those things are going to reappear. Now, in terms of the way that he represents it, it's very difficult because he doesn't seem. He really wants to always use kind of scientific language. So he talks about other dimensions, and he talks about spaceships and flying saucers and all of this. And he wants his symbolism to represent material things. And so, for example, in the podcast, he talks about the vision of Ezekiel, and he's saying how Ezekiel is seeing, you know, basically wheels within wheels. Right. And these wheels within wheels are flying saucers. And so it's probably best to understand. To understand the opposite, to understand why the flying saucer has become such a marked image in our representation of extraterrestrials and of UFOs. Why. Why has this flying saucer become the image of the ufo? And. And I have to admit that I haven't totally figured that one out, but to me, that seems like the best move to make. Now, the one thing that people are going to ask me is, am I saying first of all, that he's full of. He's delusional? I don't think he's delusional. I think that his intuition about what's happening in the world is absolutely correct. The idea that we have created a society of human sacrifice, if you cannot get away from the fact that abortion can often act as a form of human sacrifice, you just can't get away from it. Because you see someone who makes the bet that they will have more power in the world, they will have a better life in, if they get rid of this unborn child. That is a form of human sacrifice. You can't get away from it. The fact that you sacrifice another life for your own is a form of human sacrifice. And so he is totally right in that. Now, whether or not this has reached the level of ritualized human sacrifice that Alex Jones suggests, I don't know. I have no idea. I'm not in the. Those. You know, we're not in those circles. We. All of this becomes hearsay and rumor and all that. And it doesn't. And even though that it's this hearsay and rumor, it's not surprising that it goes in that direction. And it wouldn't be that surprising if it ended up being true. Because those people who understand the power of ritual and who are looking to acquire power to themselves, it would not be surprising that at some point they understand how this has always been a manner to acquire power. And you can see it in everyday life. It's not. Ritual does not differ from everyday life. It is a condensation of everyday principles into a very synthetic form which is meant to, let's say, concentrate it so that it has more effect. And so whether or not there are ritual, human sacrifices, all of this stuff, I don't know. Who knows? This is conspiracy theory. But the most important thing for us in terms of those who study symbolism is to notice how coherent the examples that he's using are to be able to see beyond the language of flying saucers and aliens and Everything and understand about the connection between the foreign, the strange, the alien, the demon. All of those things go together, if you're interested in that. I did make a video called the Symbolism of Aliens, which tries to show systematically how in our stories, even in our modern stories about extraterrestrials, how all of those things fit together. And so, you know, I would say we always have to take some of the things. Obviously, we have to take the things that Alex Jones says with a serious grain of salt when he's talking. If your purpose is to understand the world objectively, but if you want to understand, let's say, the symbolic structure that are laying themselves out around us today, and you're attentive to what someone like Alex Jones says, you can get a good sense of what's happening in the world. And that this is not what he said. What he's saying is not arbitrary, and it does fit these patterns. It seems like Alex Jones is a kind of. Either unknowingly or who knows how. He is a kind of, let's say, someone who is tapped in to these patterns and can intuit them very well. Now, obviously, do not listen to Alex Jones when he talks about his idea of God and that God is like a comet in time space, and that the devil is behind and God is in front and that the whole world sees. Like, don't take that for Christian theology. Look at the image that he's representing, and notice that it's not completely insane if you see it in terms of a symbolic structure. He talks about this comet, and so you can imagine it as a hierarchy with a point at the end which is moving forward. And then as the comet, as you get further and further away from the head of the comet, then the effect of the comet is. Loses its. You know, it loses its coherence and becomes to be more and more chaotic. And the further you go, then the debris of the comet starts to fall away and starts to not be connected to the comet. And so, although it seems insane when he says something like that in terms of imagining a physical comet and thinking that that's God, if you can see it symbolically, which I don't know if he does or if he is a. That much of a materialist, but if you see what he's talking about in terms of how reality lays itself out, and he talks about Satan is in the back, and he's kind of. He's lost. I mean, he's basically lost the effect of being connected to the center. And so because of that, he wants to Subvert the centers like that. All of that makes total sense if you understand it in terms of a symbolic structure. But the problem is that because maybe even himself, definitely us, we have becoming capable of understanding the patterns and understanding those symbolic structures because of that. What's interesting is that so many people like to listen to him speak. That podcast that he made yesterday is blowing up millions of views just in a few days. So much that media outlets like Forbes or Newsweek Thinking feel forced to write articles about it. Why is it that people are fascinated by hearing these stories? It is because, just like when we watch movies, just like when we read stories that have a coherent symbolic structure, even though they look crazy at first glance, this is what we hear when we hear Alex Jones talking about psychic vampires and all of this thing, the structure in which he embeds all of this is actually more coherent than we might think. And so let's see if this video gets banned, because I'm not, you know, I'm talking about Alex Jones in a somewhat positive light. And so, yeah, and, you know, if ever Alex Jones, if you ever. I don't. It seems impossible, but you. I have been on Infowars before, not your show, but if you ever see this, if you. It is something that I would like to talk to you about and see if we can. If we can come to. If we can come to understand some of the things that you're talking about in terms of their pattern. So one of the most surprising things that have happened in the last few years has been the reappearance of a flat Earth theory on the Internet. There are many videos, many people talking about Flat Earth, and. And I think that it's a very important thing to look at. A lot of the insight I'm going to give you in this video actually also comes from my brother, Matthieu Pageau, who has, from the right from the beginning of Flat Earth appearing online, has been sending me links and has been sending me some of his ideas based on that. And so I have to give credit to him for helping me see a little bit about how important this Flat Earth thing is now. One of the very important things to understand as we look at how strange the world has become. I talked to you many times about this notion of when what happens, when the center breaks down and when things start to move toward the periphery, start to break apart, start to fragment. One of the things that happens at that time is the incapacity to. To see things clearly. The incapacity to know when something is true or false. But Also, when something is ironic or not, when it's a joke or not. And in the Flat Earth moment, we really see it as this laboratory of strangeness where so many people who are involved in Flat Earth are doing it for. For the laughs, are doing it to poke fun at people, to troll people, so that when people take them seriously, you know, they're just laughing. A lot of it is also a way to make fun of how complacent we are in our thinking and how we tend to accept things the way they're given to us without questioning them. There are, of course, people who believe in Flat Earth in a scientific sense. There are those people online as well. But even in those people, it's very interesting to look at the arguments they give for why the Round Earth theory was developed. Now, I am not a Flat Earther in a scientific sense, but as those who know about me, I don't see the world in those terms. I don't see the scientific vision of the world as being primary. I actually see the phenomenological vision of the world as being primary. That is that our experience in the world is the first experience. It is the frame out of which we then interpret the world. And so scientific understanding, which is abstract, which is removed from the viewer, I think actually comes second. It's very useful, it's very important if you want to make planes fly or if you want to make an iPhone work or this camera, whatever. Of course, that type of, of abstracted and alienated thinking, where you step outside yourself and try to analyze the world that way, is very important, but it is not the way we live our lives. We don't live our lives in the scientific world. We live our lives in an experiential world. We live our lives in a, what I call a phenomenological world. And so when we start to look at what is happening with this Flat Earth ideas coming up, this is where we can see that what we're actually experiencing right now in the world is a return of symbolic thinking. It's happening slowly. We can see glimpses of it. It's one of the reasons why I'm making the videos that I'm making is because I have perceived that this is going on. And so it felt like it was now time to speak into these questions. What do I mean by the return of the phenomenological thinking? What we see in Flat Earth thinking is we're seeing the empirical, logical, doubt, everything attitude of the scientific approach. We are seeing it eat itself. It has reached the end of its process, and it is now cannibalizing itself. One of the things we've noticed in the last few years has been a lot of studies which were recognized as being objective, as being true. Scientists are trying to redo the same experiments, the same studies, and they're not able to get the same results. And so old studies that people took for granted are now being dismissed. We can see it even in our own experiential life. We've seen, you know, a time in our life where scientists, rigorous scientists, were telling us that we need to eat four food groups. And, you know, you have to eat all these different things every day. And this is a balanced diet. And now we're finding out, it seems, who knows, who knows, you know, to what extent even this new thing is true. But now all of this is being cast aside and we're being told, no, that's not the way our body works. That's not the way our body absorbs nutrients. And so, because a lot of these scientific experiments are not being replicated, there is, like I said, the process of science is coming to its end. We're realizing that so many things that we believe, actually pretty much everything we believe about the world is not based on our empirical analysis of things. It's based on trust. It's based on the trust that we have in the authorities that are giving us information. This, of course, for someone who believes in a traditional world, who believes in a symbolic world, this is not strange at all. We know that the world is built on trust. We know that the world is built on the trust of that which has been handed to us before. We know that it's built on trust as a Christian, of the saints, of. Of the councils of the church, of the Bible. All these things we know because that's how a traditional world works. But the modern world presented itself as questioning all those sources, all those authorities. And, you know, we're going to do the experiments ourselves, we're going to do the studies ourselves, and then we will get a more real perception of what the world is like. But in the end, what ends up happening is because we are not doing those experiments, at least not you and I. We are not going up into the sky and seeing the world as a ball. We have to trust those who did it. We have to trust those who are giving us these extremely complicated explanations of how we can prove that the world is actually round. And because of that, now the people who. A lot of the people who are becoming flat Earthers are doing is the system of empirical data and the system of empirical analysis eating itself. And what's happening is it's actually bringing back in a very strange way. I've talked to you a lot about this double inversion where let's say the scientific enlightenment worldview flipped the world upside down. It, instead of looking towards authority, instead of looking towards essence, instead of looking towards, let's say, meaning and language as the origin of reality, we looked at the ground, we looked at phenomena, we tried to analyze phenomena itself. You know, and that, that flip is. Is major. And it has created some great things, A lot of the. The tools we use, but it holds. It has also created a problem. And we see it in the meaning crisis that we're experiencing today. Is part of. Part of that is what led to this situation that we're in. And now that it's upside down, when we reach the end of that, we realize that we are still based on trust and our world is still based on trust. It's just we decided to trust other people, not the same people that the ancient world started to trust. And so it's happening in a mythological way. This whole flat Earth thing is really a mythical structure which is showing itself in the world. And what's happening is a return to the basic experience of the world that you can have. And that basic experience of the world that you can have is true. It's true in the sense that it is true that this is our experience of the world to. Nobody that, you know, has ever experienced the planetary systems that is described in science. No one, you know, has ever experienced the Earth as a globe. We do not experience that. And so at the end of this process, we are flipping back and returning to a world where meaning is primary, where the human consciousness is, is first in then looking at the world through that filter of human consciousness. Now, a lot of the flat Earth type people don't necessarily frame it that way. To be honest. I don't think they totally know what's happening in a broad scale. They're just doubting everything and doubting everything and then coming back to the very, very ancient cosmic image of a dome and a flat. Of a flat surface, you know, and it's hilarious, but it's also. It's hilarious because we are in this moment where the world is wobbly and nothing is certain anymore, and people don't know what is true, what is ironic, what's a joke, what's serious. You know, if you look at even our political leaders, you know, Donald Trump is basically memeing and trolling people. The very president of The United States is saying things in a manner which is meant to create this kind of destabilization. But then what it's leading to ultimately, I believe, is a return of the symbolic worldview. And it's not just, of course, flat Earth which is going to do that, but flat Earth and also this whole science of consciousness, this whole return of understanding that hierarchies of meaning are inevitable, all of this is kind of coalescing into this crazy moment where symbolism is returning. And the image of the dome and the Earth below is really secretly, you could say, a return to the. This world of meaning. Now, if you look at some of the flat Earthers, it's very interesting to see what. Because obviously they have to. To imagine a vast conspiracy which exists, you know, from the time of Copernicus basically up to today. And you kind of have. And you have to wonder, like, why would they. Why would they do this? Why would they lie systematically until today? Why would they fake all these things? You know, the. The. All NASA and all this? Why would they fake it? And the solution that many of them end up coming to is that they did it in order to subvert the world, in order to remove God, remove all those things that make the idea that the Earth is the center, that man is the center. So they're faking all this conspiracy in order to reduce the idea of man in relationship to God and this notion of the human person as the center of the cosmos and Earth as the center of the cosmos. And so the truth is that they're right. They're right that that's the purpose. But you don't necessarily have to posit a scientific flat earth in order to see that, you know, the change which happened, which subverted this, the change which happened, which subverted and changed all this was the change from understanding the world as manifesting itself through the human person. Today, we could say something like manifesting itself through human consciousness, that without consciousness, the world has no form, has no hierarchy, has no structure. And so human consciousness becomes the vehicle by which the world ends up laying itself out in its meaning, in its hierarchy. And so the inversion, the subversion, by positing a world which is outside of human perception, which is more real, but more real. We say that it's more true, for example, that the Earth is turning around the sun. It's more true than the sun turning around the Earth. But our perception of the sun is that it turns around the Earth. That is, if we view the universe through the guise of human consciousness, that is the first Perception, you could say the first perception is that perception of the sun going around the Earth. It's not a mechanical perception. It's a perception which puts meaning first. That's the difference. Now, once you flip it for a kind of mechanical, descriptive meaning, that that is the most important, then what you're actually doing is you're putting the emphasis of meaning. You're putting the center of the world outside of the human being, outside of human consciousness. And consciousness itself as the vehicle for meaning. Of course, in the traditional manner, the ultimate summit of knowledge is not the human person. It's God, but God working through the human person, who is the image of God in creation. So that is the actual subversion which happened. So if you're interested in that, I have given several talks. There's a talk on my channel called A Full Affront on the Copernican Revolution. In which I discuss how this change, this. This change from a geocentric. In the sense of meaning, of anthropocentric, in the sense of meaning, worldview change, to this decentered universe of mechanical causes. What that means for us and how we're reaching the end of that today. And now we're seeing this flip as we understand the inevitable hierarchy, meaning, hierarchies of meaning which manifests themselves in the world. I've also written an article which is called Most of the Time the Earth Is Flat. And you can already see in the title that I am trying to explain how we do not have to posit other mechanical forces, other mechanical descriptions, to regain the anthropocentric vision of the world, to regain a cosmic vision of the world in which the human person, human consciousness, in which love, in which hierarchies of meaning are the center. And if we look at once, we understand that that's the key, the key to understanding the world is to understand how our first experience of the world is through consciousness and through that filter. Then all of a sudden, so many things open themselves up. All the stories, all the ancient stories, all the ancient rituals, you know, the shape of a church. The way that we have certain social rituals of turning around centers of. All of this suddenly becomes clear once we understand that the meaning that the center of things, that the hierarchy of things is not the mechanical description of them. It is the manner in which we experience meaning through consciousness. So I hope that this is a little helpful in terms of understanding why something like flat earth theory seems to be participating, maybe even despite itself, in a return of a symbolic worldview, in watching the analytical, empirical world eat itself by coming back, you know, despite itself, to the very, very ancient vision of the world as being horizontal and the heaven as being circular, which has a very profound meaning. I also wrote an article called Heaven is Round, Earth is Square, which you can find. I'll put all those links in the description in which you can read about how the ancient cosmologies describe the world and why it's important that they do that, and what it means for us in understanding how the world lays itself out."}
{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":2411.03,"end":2436.39,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World Podcast. As you know, this podcast is for now based mostly on my YouTube videos which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio and and please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast."}
{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":2436.39,"end":2437.39,"speaker":"Jonathan Pageau","text":"So share it to your friends."}
{"episode_id":"SW - #054 - 2019-08-31 - Conspiracy Theories and Flat Earth","start":2437.39,"end":2466.93,"speaker":"Jonathan Pageau","text":"Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
