{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":12.32,"end":15.76,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":25.69,"end":44.33,"speaker":"Sarah","text":"So, hello everyone. This is Sarah from Hamilton. And today I'm very excited to have Jonathan Pageau back on the channel. My last video with Jonathan was one of the most viewed long form videos on this channel. So I know people got a lot out of it and I definitely did as well. So welcome back."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":44.89,"end":47.37,"speaker":"Jonathan Pageau","text":"It's great to see you again. S always great to talk to you."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":47.37,"end":86.85,"speaker":"Sarah","text":"You too. So I want to talk today about a lot of things, really. But to start by returning to this theme of universal history, which you've produced a huge amount of content on. And I want to connect that a little bit to your recent work on Snow White. And so let me just ask you this question. What is the connection between the universal history of real quote, unquote nations, Ethiopia, America, Israel and unreal or fictional narratives? How do those two things intersect and what does that mean for the significance of symbolism in universal history?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":87.57,"end":177.49,"speaker":"Jonathan Pageau","text":"Well, what happens, I think the way to understand is that what happens with universal history in some ways is that the way that things are remembered at the origin, especially at the origin of something, they tend to have a certain form, they tend to contract towards certain, certain directions towards something we could call mythological storytelling, which is that the, the, the tropes become more and more condensed and you know, you find things that we don't usually find in everyday life when you look, especially the further you go back into the past. So if you look at early chronicles, it's always like giants and dragons and, you know, hybrid kings and all of this stuff that seems a little crazy to us. And I think that studying fairy tales can help us understand why it is that things get remembered that way and what importance they have. Some of the images and some of the tropes have an analogical coherence, you could say, that can help us understand why our universal histories look the way they do. And then to some extent also why those patterns happened in scripture as well. Similar patterns as to what happen in the fairy tales. Of course, in scripture we're talking about a different level of reality. We don't want to comp. We don't want to compare scripture and fairy tales too much. But to some extent we can in the sense that they, they seem to capture similar themes as the, the fairy tales seem to capture similar themes than what you find, especially in the Old Testament."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":178.13,"end":266.14,"speaker":"Sarah","text":"Yeah. And what do you mean? There's been a recent, I've noticed focus from a lot of different people on this idea of, you know, a haunted universe or a universe which is more populous than we're familiar with. Thinking of it, I know reading St. Perfirios, it was very interesting to me. There's a story where someone is talking to him and he's asking him, you know, is there life on other planets? Are there aliens? And he says, why are you even asking me about life on other planets? Do you know just how much stuff there is around us right now that you have no idea exists? And I just thought that was so interesting because St. Porphyrios is one of those saints who has, you might say, relatively unique spiritual gifts, in that he was able to see lots of different things in the material world and the non material world, which aren't accessible to us or even to a lot of other saints. And that was just fascinating to me in terms of this new kind of excitement or relatively new excitement about a more populous universe. So, yeah, when we talk about fairy tales, obviously we're talking in part about fairies. So do you think that at what point do we say that there is kind of a genuine, concrete referent to beings that we might call fairies? It's. Yeah."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":266.38,"end":452.25,"speaker":"Jonathan Pageau","text":"So let me back up a little bit and try to, I think, kind of contextualize what's happening in terms of this new interest in, like you said, a more populous universe. You know, one of the things that happened, of course, in 19th century materialism was the evacuation of agency in the cosmos as superstition, right? The idea that, that every time you see agency in the cosmos or that you see other consciousness acting in the cosmos, it's just superstition and, and projection. You know, that's the type of word they use. But that type of thinking, this materialist type of thinking was never trying, didn't come to the point of trying to account for our consciousness and our agency, and they were just ignoring it as this kind of blind spot from a point of view where they looked on the world with that agency and consciousness, but then. But then use their reason and their agency and consciousness to evacuate the rest of the universe of agency and consciousness. And so I think that we've come to a point where even a lot of scientists, and a lot of, you know, especially scientists that study cognition, they're realizing that this is a ridiculous position to stand in. It's a ridiculous position to ignore the categories of consciousness when we're literally using those categories to evacuate the cosmos of consciousness. So I think that's the point where we. Where we've come to where now there are people, very reasonable, you know, people that aren't Christian that are atheist or secular or all kinds of people that are willing and in some ways realize that using categories of agency and consciousness to understand certain phenomena is actually more useful than the kind of cold analytical description that, that they're used to, especially for understanding social movements, for understanding kind of large scale transformations, using things like agency to explain those. You know, what people use the term egregore, they use different. You know, they use things like emergence. Words like emergence. In some ways it doesn't matter to us at the outset what word they use, but they're noticing something like intelligent patterns kind of coming back and manifesting themselves on the world. So once you've crossed that threshold, and this is the, the funny thing that a lot of people don't realize, once they cross that threshold and they ride that out consistently, they will find themselves once again in a world of jinns and fairies and, and intermediary beings. And I think that, that you're seeing a lot of people talk about re enchantment. You know, you have broad dreher. I've just read an article by Mary Harrington today that tries to talk about re enchantment, people taking mushrooms, talking about all these beings that they meet and everything. And I think that that's the future. If you want to know what the future is, that's it. But it's a scary, it's not that great of a future. It's scary because without order, without the Logos, you know, ordering that world for us, then it's a. It's a very scary and dangerous world to walk through. So I think that fairy tales are a way to help people reaccustom themselves with these types of patterns."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":452.73,"end":537.94,"speaker":"Sarah","text":"It was really interesting to me that you just mentioned the danger of meeting these things apart from the Logos and then mention fairy tales again. Because I remember in that hideous strength which is called a modern fairy tale or a fairy tale for grown ups, that hideous strength has this wonderful scene where Jane encounters Venus and she goes into her room and she sees this burning woman and it absolutely terrifies her. And when she goes to ransom and talks about it, he tells her, well, you've met Venus, but you've met Venus kind of naked. You've met her apart from mellow or Christ in the story. And I think that idea really rolls together with a lot of things we read about in Scripture, especially I think in Galatians, where the. What life looks like outside of Christ is you are enslaved or subjected to these powers which are external to you. You are considered just as kind of A part of a kind of wild world. Whereas in Christ, humanity is really born so that humanity stands, you know, in relation to the world as its Lord, Master and bridegroom because of the incarnation of the Word, who structures all of these different things. So I know that's a. You know."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":537.94,"end":676.28,"speaker":"Jonathan Pageau","text":"No, I think you're, you're totally right. And, you know, you can. We can talk about it in different ways, especially for people who might struggle to understand this. Because, you know, obviously when you say something like that, as, as you and I, who've been thinking about this forever, it just makes sense. When secular people hear something like that, they just hear. They just like, see the, the wildness and craziness. And so, you know, one of the things that I've been trying to. To do is obviously to bridge these two worlds that people understand what the hell we're talking about and how. I think that, you know, understanding, for example, virtues and vices, you know, it's a. It's a completely traditional Christian way to help people understand how agency acts on us and how depending on how we approach certain agencies that are acting on us and through us, then they can either be liberating and pointing towards Christ or they can. They can simultaneously be, you know, tyrants that rule over us. You know, and so if you think of a. Of a. Let's say, of a virtue like courage, you know, that is. That is definitely a virtue if it's pointed in the right direction, if you're courageous for the right reasons. But then the same virtue can become a kind of prideful, you know, irascibility that will. Then that can trap you and that can make you a slave. If it's not pointed towards something higher, if it's not pointed to something, it kind of traps you. And that's what Dante, for example, tries to show in his Divine Comedy, which is that, you know, anything that is not. Not aiming up and always kind of giving itself up towards higher and higher goods can become a vice. And that's what we see in the Philokalia. You know, it's like the vices and the virtues are basically the same thing. That, that depending on how they're treated, will. Will will either be something like a, you know, angelic transport towards God or a demonic kind of rule over you. And so this is. It's more than that. It's not just virtues, obviously, it is actual agencies that can rule over you. But I think that to help secular people using the language of virtues is a way to, to at least help them see a little bit through this. So they don't think we're just like, in a marvel universe with, like, gods floating in the heavens that are just, you know, like this kind of weird materialist, ghostbuster type of spirituality that people, you know, immediately go to."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":676.84,"end":889.54,"speaker":"Sarah","text":"Yeah, and. And I think that's a really good point. And part of what has interested me, you know, since, I mean, it's now become something of a, you know, a buzzword for certain people. But I really remember the intense experience of having, you know, been a Christian, a believing Christian, and then in a very short period of time, entering into what you might call a re. Enchanted world, where all of these things which formerly would have an intuition of implausibility, had exactly the inverse intuition. So that, you know, before, if I read a typological pattern in history, I would say, oh, someone's fudging the details. Yeah. And afterwards, if I read a typological pattern in history, that's like, oh, well, this is more likely to be true than not, because this is just the way the world works. So what you just said there reminded me of one of those questions that I've had for a long time, which is, in a lot of circumstances, why does the occult, quote, unquote, seem to work? And let me just kind of throw a theory at you and then see what you have to say. So my idea about this, if you just think about what the occult is, it works through speech incantations, and you use incantations to alter and change things. So, you know, God makes the world through the word. You know, he's speaking throughout the six creation days. Then he makes man in his image, I. E. Man is the speaking creature. God speaks to man. God. A man can speak back to God, in other words, and then man reconstitutes and changes the world through that speech. Well, I think what the occult is, or at least a lot of it, what it really is, is it takes that principle, that nature, that human beings are tied to the world in such a way that their speech will alter and change things, and it severs it from its archetype, the super nature, which is the basis for its existence. And so what is going on in the occult versus what is going on in Christian prayer? Well, in a certain way, there's an analogy between the two in that both are trying to influence the world in one way or another. When I'm praying for someone to get well, you know, I'm submitting the will to God, but I am trying to get them well by the means of prayer. And I think what happens in prayer is we take our will, our intentions, our desires, and we seek to affect them in the world, but we always bring them through the crucified Christ so that we say, not my will, but thy will be done. And what that does is it perfects our intentions so that they can be realized with the maximum goodness. Whereas if a person does not transmit their will through Christ, this is incredibly dangerous because they say, oh, I want more money. But they don't have a sufficient understanding of the nature of what money is and everything else with which it is connected. So that when they realize their intentions in the world without transmitting them through the Logos, who is the archetype of all things, they get all this other stuff along with it that they weren't expecting because they don't have the comprehensive knowledge of the nature that the Logos himself has. So I think when you look at, you know, the occult and the ceremonial nature of it in a certain way, it's. It is a parody of the liturgy, because the liturgy is where we rule over the world. That is where we enter into Christ's throne room. And there it looks like that. But even for a person who doesn't believe in God or Christ, even for people who are interested in practicing it, there's something creepy about it. There's something that's wrong. I mean, I think that's. CS Lewis talks about that, you know, when he was a younger man interested in the occult, not a Christian. Something was just off about it. It seems to be detached from its actual end."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":890.57,"end":987.88,"speaker":"Jonathan Pageau","text":"Yeah, I think. I think your insight is absolutely right. That's what it is. So the way to kind of understand it is for normal people to think about this is that the idea that you use ritual, language, and incantation in order to modify reality is actually something that you do every day, all the time, right? It's like if I. If I ask my contractor and I signed a contract with my contractor to build my house, I'm using language, meaning, and ritual in order to get my house built. And so I'm not building my house, right. Someone else is doing my will for me through. Through. Through an incantation and. And a ritual signing of a document so that the contractor will then build my will, my house, for me, right? So it's something that we actually do all the time. So first of all, we have to be a little cautious about freaking out too much, like about some of this stuff, right? But we should freak out, because the difference between me asking, getting, signing a contract with my contractor to build my House and an occultist is that the occultist is conscious, spiritually conscious of the mechanisms by which things manifest themselves in the world. He understands that you are invoking certain principalities and certain realities in order to get things done in the world. But they are trying to utterly weaponize spiritual principles in order to get their will to be done by ignoring the way in which it connects to the highest good and to. To."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":987.88,"end":988.2,"speaker":"Sarah","text":"To."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":988.2,"end":1127.15,"speaker":"Jonathan Pageau","text":"To God. Right? And so the truth is that sometimes I'm doing that all the time in my life now, right? It's like I'm sinning all the time because I. I'm hungry and I want to eat. And so I'll ask my son to go to the store and get me a chocolate bar or whatever, and in that way, I'm doing all that stuff. But it's. It's kind of unconscious. It's. It's not. It's not great, but it's. It's. It's kind of unconscious. But when you become conscious of it, then the sin becomes much greater because you know what you're doing, you know, what type of action you're posing and what. What type of, let's say, misdirected power that you're using in order to accomplish your goals. And that's why, like you said, that's why it ends up looking more ritualized. That's why it ends up being more like liturgy, because it's people that are more aware of the mechanisms of reality, and because of that should be more, let's say, more aware of how they should ultimately, you know, participate in a. In a true liturgy, which is submitting their will to God and then through that, know, submitting their will and the wills of things around them to God so that God's. God's will can transform everything. But. But it's hard. It's hard because people ought to think, like, well, why would that work? Like, why would, you know, saying some incantation, why would, you know, doing some procession work? And it's only because they don't understand that they do it all the time. And just because they can. They can recognize the mechanical causes that is bringing about the change, that somehow now they. They believe in it. But. But, you know, when a. When a politician, let's say, makes a kind of statement on television about what needs to happen, you know, or. Or. Or some kind of thought leader, and then it happens in the world, they are not aware of the mechanical causes by which it's happening. They don't. They don't know who's Going to instantiate it or who's going to make it happen. But it's still. Ch changes the world. And so it's those types of understanding that the occultists are trying to weaponize towards their will. And in a stranger way and in a more subtle way, it's something similar to that, that we understand that if we address our prayers to God and we submit our will to God, then the greatest transformation for the greatest good is happening as we're doing that."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1127.71,"end":1130.99,"speaker":"Sarah","text":"So what do you think of the Global Consciousness Project?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1131.77,"end":1134.09,"speaker":"Jonathan Pageau","text":"I don't know what that is. What's the Global Consciousness Project?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1134.25,"end":1173.71,"speaker":"Sarah","text":"Global Consciousness Project sounds eerie to me. It's. It's so. It's been a while since I've looked at it. But what it is, is they set up around the world true random number generators, which are really actually hard to do because getting genuine randomness and not just a really complicated pattern takes a lot of doing, a lot of computer power. And so they set up these random number generators around the world and it's going to just generate random numbers, obviously. And then what they do is they look for patterns in it and they see if that's correlated with major events in, you know, world affairs. Whoa."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1173.71,"end":1176.51,"speaker":"Jonathan Pageau","text":"So like massive divination project here."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1176.83,"end":1224.67,"speaker":"Sarah","text":"Yeah, so they, what they did is they. I think it was set up in the 90s. And then they. I just looked at the data set in September 11, 2001, and they argued that the numbers become less and less random because there's a genuine kind of physical significance to human attention being focused at the same thing. In other words, that reconstitutes the actual structure of the world in some mysterious relative to our present state of knowledge way. So assuming for my viewers it's been a while since I've looked at this, I'm not going all in on the legitimacy of this, but assuming that that data set is actually true, how would you interpret that in light of what we were just saying?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1224.67,"end":1420.05,"speaker":"Jonathan Pageau","text":"Yeah, so, okay, so there. I think there are two things. Like divination is obviously it's going to say obviously. Well, it's obviously a real thing. Divination is practiced in every culture all the time from the beginning of time. There's. I don't think there's such a thing as a culture that doesn't have some form of divination. Even within the Bible. There are. There's divination, the. The famous Urim and Thummim. You know, there they were divination things. You have Joseph, who has a cup for divination that he hides in his brother's bag. And you know, even in the New Testament you have the decide the, the apostles drawing lots in order to decide who the next, the next apostle is going to be. These are divination. These are divination mechanisms. Now I think you're right. And, and the, the idea is that there's a, there's a relationship between the intention and question as a frame, right? You, you can understand it that way. It's like you're framing reality. You're looking at reality for a reason. And when you look at reality for a reason, then out of indefinite potential, right out of the, the chaos, tohu bohu, chaos that is still, I think, believe underlying all of reality. You know, forms will, will come up because it's like it's, it's, it's analogous to when God says, calls forth and says to the earth, bring forth, you know, identities. And then the, he sees them and then, and then, you know, man participates in naming them. So I think that's, that's actually how it works. Now there are obviously also reasons why divination is, is prohibited in Scripture because, because it is very, it is dangerous. The question is, why are you doing that? That's, I think that's the biggest question. It's like, why are you doing that? Are you doing that because you want to try to, you're doing that because you want to try to predict the future in the kind of base way? Or if you're doing that. Usually people do that stuff because they want to get rich really. Like, you know, they, they, they want to guess the numbers for the lottery or some kind of nonsense like that. And so you can understand that when humans look for that type of power, they're often doing it for, for their. More than often, you know, just doing it for the wrong reasons. And also the other problem I think is that the, the capacity to accumulate data sets and to notice patterns across, across massive amounts of, let's say, generated chaos doesn't mean that you'll understand them. The insight to understand those and the insight to understand the, the, the meaning from them don't come from that, from that generation. They come from heaven, you could say. And you know, the capacity to interpret dreams, you could say that you see in, in, in Joseph is similar to that. But just because you have the dream doesn't mean you can interpret it. And sometimes people will, will put their will. Like you when we talked about the idea of occultism, instead of being a transparent vehicle for a higher identity or, or or reality to manifest itself, then they'll just put their will in it and then it gets twisted right away into whatever it is that they want."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1420.77,"end":1483.2,"speaker":"Sarah","text":"Right. So what you were saying reminds me of that phrase in Genesis 11, where mankind, they come together, they build a city as culture and a tower cult, and they're all unified. And God says they're all one people. Nothing that they do will be impossible for them. And I think people read that and they're like, well, isn't God God? I mean, what is he talking about here? But I think this is actually a real statement of the ontology of creation. Mankind exists, and in Genesis 1, there's one image of God. It is the human family, male and female, who is the image of God. So when mankind is united, that is the image through which God develops the world. And so when mankind is joined together and is of one mind, but that one mind is directed contrary to the word, that is an existential threat to the integrity of creation. So that in the flood, the world just collapses, it falls apart. And I think that says something."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1483.76,"end":1530.93,"speaker":"Jonathan Pageau","text":"But let me just get on what you said, which is that it's a great, It's a great. Like nothing will stop them from doing what they want to do. And, and, and, and that's true. And like you said, it's ex. You're. You got it exactly right. Which is that the problem, like what you. When you talk about occultism at the outset, the problem is that is that you don't understand what it is that you want. You don't understand all the corollaries of what it is that you want. So maybe we will create a society where everybody has everything they need physically and everybody's super comfortable. And then we're like, well, why is everybody infertile now? Why does everybody. Why is everybody desperate? Why is everybody miserable? Didn't we do what we wanted to do? And I think that that's right. It's like. It's exactly right. So the story of Babel is like, they'll do what they want to do, but it's actually to their own destruction."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1531.49,"end":1566.68,"speaker":"Sarah","text":"Yeah. So let me just kind of take that and ask over the past couple years or few years, in what way has your kind of attention to symbolism in creation and in non biblical quote unquote stories, how has that affected your reading of scripture? And then how do they kind of ping back and forth? Because that's been a big thing for me, that reading symbolism in scripture. Then you see the world better and then you see scripture better. So on and so forth."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1567.08,"end":1613.7,"speaker":"Jonathan Pageau","text":"Oh, definitely. I mean, I think that, you know, if you think, if you take the Snow White project that we're doing now, that is definitely. There's been this weird back and forth between scripture and. So let me give you a little example. In Snow White, it's just that, you know, Snow White eats an apple and. And diesel, right? So you're like, obviously there's gotta be a connection to the other story. But it's kind of muddy, right? It's like, I don't totally see it. And then I realized that in the story of Snow White, in the original Grimm story, or, you know, based on the ancient traditions, the. The queen goes three times to see her, and every time she goes, she brings her something to supplement her beauty. She brings her a comb and then like a girdle or a belt in order to supplement her beauty."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1613.7,"end":1613.83,"speaker":"Sarah","text":"And."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1613.98,"end":1726.14,"speaker":"Jonathan Pageau","text":"And you're like, why is she doing that? Isn't Snow White the most beautiful girl in the world? So why is she trying to tempt her with this supplementarity? And then I'm like, okay, I'm onto something. This is definitely what's going on, related to scripture. And so then my, my insight was that, in fact, what the. What the queen is offering Snow White with the apple is awareness of beauty. She's saying, you will know that you are the most beautiful in the world. She already is the most beautiful in the world, but you'll know that you're the most beautiful. And so she trades like reality for the supplement or for the artifact of it or for the. The self conscious awareness of it. And she said, and she actually trades the real thing for that. And I thought, oh, man, there's already. There's something in Genesis going on with that because it says that Adam and Eve are made in the image of God. And then this, the serpent says, eat the fruit and you'll become like God. It's like there's something. So it's like I'm still. I'm still kind of bouncing off those two. Those two. Those two things. And then Snow White brought me back to scripture and made me notice that it's as if there's something that, you know, the idea that what God did want for them was them to become like him, that's actually what he wants for them. But that in taking that for themselves and becoming kind of becoming self aware of it through an. An act of will and power, they lose it. But if they had just submitted to God and, you know, been in the right relationship to him, then they would have been. They. They would have accomplished that, which is that ultimately, even because they, even what the serpent promised them, they could have, they would have accomplished it. And that's what we see in Christ, obviously. And so it's weird that. So Snow White. So it's like I, I use the Bible to understand Snow White. But then when I saw what happening, was happening in Snow White, it made me see back in scripture a pattern that I had kind of skipped over that I'd, you know, ironed over too easily."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1727.34,"end":1868.26,"speaker":"Sarah","text":"That when you're describing that story, it recalled for me, you know, this great biblical theme, which is that, you know, after the sin, one of the curses is that your desire will be after your husband. You know, in the context of the story, Adam has already been created in a relationship to Eve, which can be called headship. And so how exactly do we take that the way I've come to take it, to say, well, right now, what Adam is, what's happened made Adam a fallen creature, and Eve, the feminine partner, is now in a state of curse because she's in subjection to this creature who is fallen. And so then you see throughout Isaiah and so forth, Zion is described as a bride who is barren, who can't bring forth seed, and, and the servant and the God of Israel. So, hint, hint, they're both described as the true bridegroom who is going to marry this barren woman and raise her from the dead. And so there's that, that theme in a lot of stories, you know, that the bride is in a state to some degree of her own fault, to some degree, not of her own fault. It's a complex issue in Scripture. The bride is in this state of deep sleep or death and needs rescuing from the bridegroom. And obviously this is typical of Christ. And then in that theme of knowledge, I think we see there's a lot of stuff going on in Genesis 3 and following and then in the New Testament because they eat of the tree of knowledge of good and evil. And then Genesis 4, Adam knew his wife and she can see it, and she brought forth Cain. So what is the problem here? Well, the problem is that Adam and Eve have just been cut off from the presence of God. And the presence of God in the garden is the means by which their knowledge is joined to him. And, and having been cut off in the presence of God, they know each other to some degree apart from God. And that produces generations which lead down to the Flood. And then in the New Testament, what happens is we have a mode of selfhood that is from outside this world, but comes into this world that is the self of the only begotten Son in relation to the Father. And that enables us to then be human in a way that is compatible with God's knowing us fully so that we might be fully known. So those are just some."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":1868.5,"end":2002.1,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. There's definitely, there's definitely, that's definitely right. And the, the, the strangeness of the story too. The strangeness of the story when you see this, how Christ kind of resolves the whole pattern. It's a, it's interesting when you compare it to Adam and Eve and you see, you know, what knowledge does and how Christ reacts to, to his situation and how Adam reacts. His situation. And so I always have this image where, you know, the, the, the serpent, the, the serpent tells Adam and Eve, if you eat the fruit, you'll become like God. And then God told Adam and Eve, if you eat the fruit, you will die. And Jesus just said yes, like, yes to both of those, you know, and, but Adam didn't. And that was, that was in some ways part of the fall is that Adam refuses to humble himself, you know, in the, in the moment where he eats. He refuses to die. In the moment when he eats the fruit, he says, it's not my fault, it's her fault, it's not my fault, it's the serpent's fault. It's like it's everybody's fault but mine. And I'm going to protect myself, I'm going to hide myself, I'm going to cut myself off from God. Whereas Christ says yes, and then Christ dies. And, and you know, and so this image, you know, you, you, you Orthodox or you've seen it, like this kind of this icon that we have during, during Holy week of the bridegroom, you know, and it's like we have this, this icon which we call the icon of the bridegroom. And it's the icon of Christ being beaten and tortured, you know, and ironically being treated as king by, by Pilate and his, and his, his cronies. And it's like, well, that's the surprise. That's the surprise of the bridegroom, right? It's the surprise of what it is that solves the puzzle from the beginning, which is that in humbling ourselves, in being willing to die, you know, then that knowledge is transformed into glory. It doesn't cut us off, it actually leads us higher into, yeah, into, into the highest place. So it's a, it's, yeah. Blows your mind when you, when you See it?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2002.18,"end":2134.76,"speaker":"Sarah","text":"Yeah. In Genesis, you know, when God says, you eat this fruit in the day, you eat, you shall surely die. You know, one of the things that happens immediately afterwards is God takes Adam, puts him into a deep sleep, which is, I would argue, a type of death, you know, place where you're divided into and then you're reunited in glorified form. And then when you think about the way in which Christ, Christ is the bridegroom and the way that, that connects to his mission relative to the church. By the way, for my audience, I do live near a military base, if you can hear the plane outside. So I apologize for that. If you think about the way that Christ is bridegroom to his church, it says that he cleansed her by the washing of water through the Word. And then you read Genesis 3 and there's supposed to be a three way dialogue here or a trilog, the serpent, Eve and Adam, because it says that Adam was with her and yet he's utterly silent. The serpent is engaging in this dialogue with Eve and Adam is just kind of standing there. And I think one of the implications of the text is that Adam is very interested to see what is going to happen because God has told him something about the tree. The day you eat of it, you will surely die. But he hasn't learned that by direct experience. And now he has this other person who's standing there, there, and the serpent is saying, you're not going to die. Why don't you eat of it? And Adam stands there, he waits, sees she eats of it. She doesn't immediately drop dead. And then Adam says, I'm going to eat of it as well. And then it's the Divine Presence which comes. And James Jordan has argued that this is the first instance in scripture of the delay of the parousia, where the Divine Presence waits for, for us to kind of work our own will out before appearing and then implementing the consequences of that decision. So there's so much stuff here that I think you're right in that going to these mythological or fictional stories, these fairy tales, you know, we're less familiar with them. And as a consequence, sometimes the point of the story strikes us more directly. And then we read scriptural stories with which we are more familiar and we see them in, in a new and more profound light."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2135.16,"end":2254.22,"speaker":"Jonathan Pageau","text":"That's, that's absolutely right. And I see that all the time where people, you know, we've been. So especially if you grew up in a Christian world and if you, you're surrounded by these Christian stories, these Stories are so. Are. Have become almost invisible because people know them and they don't see their full implications. They don't see. And also because of the way the scripture is written, you know, the links aren't often made for you like they would in a movie, for example. Like, you watch a movie and it's, you know, it's like they'll lead you along. They'll make sure you understand how everything connects to everything else. And that's fine. It's like a training for stories. But in scripture, it's not like that in scripture, just like event, event, event, event, event. And, and you have to be able to see the pattern through it. They're not going to tell you. They're not going to hint at it. And so, and so looking at these, looking at ancient myths or looking fairy tales, even modern storytelling can be a training for us because they have to some way contain similar patterns because they're made of attention. You know, stories are made of attention. They're the things we care about. And, and we are created by God. We were created by the divine Logos. And so when we, when we are attracted to something, even if it's perverse, like, I'm not saying that everything we're attracted to is good, obviously sometimes it's bad. But hidden behind that is always something which is revealing reality to you. Which is why even when you're. You're attracted to something that makes you sin in that sin, there's always an opportunity, right? There's always like an opening where you're like, oh, no. Like, why did I do that? Why did I pay attention to that? Why did I, like, why did I move down that road? And there's an opportunity to actually see God. Like you talked about this idea of the divine presence manifesting itself. I think that happens almost every time you sin. That happens. It's like you sin and then you're like. And then, then you can feel the, the burning or like this presence of God that's reminding you of, of how, of how you misdirected your, Your will and your attention."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2254.7,"end":2361.53,"speaker":"Sarah","text":"Yeah. And that's. That is something which, you know, is. It's a way in which I think God works out all our evil intentions for good. And you know, know we talked about that hideous strength a little bit earlier. There's this part in that hideous strength where Jane is with Ransom. She's with the good guys, and she's learning the forms of things by direct acquaintance with their goodness. So they're coming the. The forms of the. Or the Archons of the planets are coming and revealing themselves and she is becoming acquainted through that with God. And at the same time, her husband, from whom she's been separated, is learning the same goodness because he's drawn into the objective room where the bad guys systematically pervert even the most mundane of things. So there's a set of dots which seem to be forming a pattern and yet they're not quite forming a pattern. There's beautiful art which has ugliness just stuck on top of it. And the mundane nature of the evil is meant to lead Mark to see that the only thing there is is evil. Lack of pattern. But he actually, it says in the story, Lewis says in that moment, through seeing the perversions of these things, Mark came to be conscious in a way that he never was before, that if there's a bent, there must be a straight. Yeah, so, you know, God wants to teach us of his own goodness by acquaintance with the goodness. But in divine providence, when we sin, we can also learn of goodness after we sin by repentance because we taste the bad. And then God says repent, we turn back and we see it by contrast. And then that habituates us to seek the good before we seek the bad."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2361.77,"end":2423.82,"speaker":"Jonathan Pageau","text":"Yeah, that's absolutely right. And you see that happening all around us right now, which is that, you know, certain forces are trying to twist reality into fantastical shapes and into upside down shapes, you know, the upside down patterns. And what it ultimately will do is restore truth. You know, it'll be a painful road for that to happen. It's painful and it's going to, it's not, it's going to get worse. Folks, every, I think most people know that by now things are going to get worse, things are going to get crazier. You know, the carnival is going to increase and the, and the clowns are going to rule. But you know, when you, you, when you sadly are faced with a clown king, then all it does is remind you of what is true. Like it, because it's painful and it's ridiculous. And so it's actually secretly shining a light on the true nature of kingship, of like the return of the king ultimately in the end. But, but I think so. At least we can, you know, that's why I always say I'm a short term pessimist, but I'm a long term optimist."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2424.46,"end":2492.92,"speaker":"Sarah","text":"Yeah, yeah, absolutely. And I think one of the things I've seen over the past several years is that people's, I don't know how exactly to Put it. But their plausibility structure has kind of been broken down because people have been disillusioned by, you know, we might call it the establishment, the intellectual establishment. They say, wait a second, a lot of this stuff is really, really bizarre. I don't buy it. As a consequence, a lot of people, I think, have really been attracted to things which are genuinely silly. But by the same principle, a lot of people have been attracted to what is not genuinely silly. But before they would have thought it's genuinely silly. That is Christianity. Yeah. And the breaking down of the plausibility structure, you know, it's a crisis and an opportunity. It's a crisis because people can embrace the genuinely nutty stuff, which is going to be bad for them spiritually and intellectually, but they can also embrace the true nuttiness, which is the foolishness of God revealed in the cross of Christ. And I've seen that latter point happen in people I never would have expected it to happen to. And, and I just find that super, super exciting."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2493.08,"end":2581.1,"speaker":"Jonathan Pageau","text":"Well, it is. It's an exciting time. It's a wild and exciting time. And I think that, you know, I hate making actual predictions, but I think, I do think that what we're going to see is while the world is getting crazier and crazier and, and as people accept things that, you know, we would have thought was impossible, you know, just 20 years ago, that people would accept it. You know, as they, as this kind of becomes, as this insanity becomes mainstream, we're going to see a little arc, you know, that's going to start to become more and more, that's going to congregate, you could say, you know, in, in, in Christianity we're going to see very intelligent, conscious people that are going to become Christian. And it's going to be, it's always going to be a minority, but it's going to be a very strong and, and lucid minority amongst the kind of increasing madness. So I think that's something we can hope for and it's something that we can also find joy in, like you said, because, you know, I'm seeing amazing people that are, that I, that I never would have thought also would become Christian and orthodox and are converting. And I hear wild things. Like, I meet, I meet people that I haven't talked to in years and they're like, oh yeah, and it's just normal for them to go to church when just five years ago they were absolute atheists and completely. And so, so it is a time, I mean, it's a Time to weep because things are getting crazy. But I think there's also, there's also a place for rejoicing as well."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2581.74,"end":2617.69,"speaker":"Sarah","text":"Yeah, yeah. So in all, in light of all this, what would you say to a person who is kind of in the midst of the kind of collapse of the plausibility structure? They don't know what to believe. And it, I think it's kind of scary. You know, suddenly you have no categories with which to assess reality. You have no way of differentiating what's nonsensical from what's actually legitimate. So let's say that that person could comes to you, they're in a state of crisis, they ask you, why Christ? What is your answer to that?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2618.41,"end":2776.97,"speaker":"Jonathan Pageau","text":"Why Christ? Well, so I mean, I think that the Incarnation becomes the key to re establishing a structure of reality, you know, because you want, you realize that in fact reality isn't just a bunch of facts. That reality has to be framed, that reality, reality has to be anchored in purpose. And so once you, once you notice that especially as you see the things fall apart, you know, and you see that if they're not anchored in purpose, then they go astray and they become insane and tyrannical and, and mad. The question of what it is that is the highest anchor becomes a plausible question to answer, a plausible question to ask, which is that now that you see that the world has to be anchored in purpose, what is the highest purpose? What is the one purpose that cannot be weaponized, that cannot become a tyrant or, you know, a kind of demon ruling over you? And you know, I think that we can argue that self sacrificial love is the one. There is really nothing. If you, if you work it through in your mind, all the other virtues, all the other things can become, can become torturous and, and horrible. But the relationship of the king that gives himself to others, that's it. Like that's the key. That's the top of the hierarchy, right? The top of the hierarchy is not the king that just rules on others. It's the king that rules and gives himself simultaneously. It's like you can't beat that story. You can't go any higher. And that is the story of the cross, you know, and so you could say, well, I like it, I kind of believe in it, but I don't like that it's this actual person and that was born 2,000 years ago that revealed this to us and, and, and brought us to participate in that. Well, you're going to, you can run around in circles as, as Much as you want, but that's the way that's where it happened, and that's where it was revealed to us. And that's the story that we can participate in. You know, truly, when you engage into the community, the body that was born out of that, out of that reality. And so, so that's why I think. I think that it's, you know, ultimately. And ultimately what happens too. What's interesting is that even as the world falls apart and there's still a remainder of these goods and a remain and a tortuous version of the virtues that used to guide us, when people strip them and start to look at them, they'll. They'll realize that it's always Christ hiding behind there. You know, as you kind of straighten it and you remove the parasitic aspect of these different values that people are. Are worshiping right now, you'll realize that it's. It's Christ that's hiding behind it."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2777.21,"end":2895.68,"speaker":"Sarah","text":"Yeah. Yeah. And my brother, my younger brother, he became, when he was a teenager, kind of and what I would call an unhappy agnostic for some time. And it was really exciting to me to watch him gradually then come to say, wait, I think God is real. It was a genuine intellectual and spiritual struggle that I think he handled very responsibly, you know, in not jumping into anything, trying to think through all the issues. And then I remember one day that he said, I believe Christ is Lord. And it's because, you know, he looked at history. And as you look at history, it really does seem that there is a center to it and that Christ really is at the hearts of. We can call it the human story, every human story. And this, this struck me when I was working through my crisis of faith, which is that how is it that this obscure Jew is crucified in the first century? A tiny little group of people announce he's Lord of the world and say, by the way, he's going to reign over all nations before they're more than a little cult. And three centuries later, the Roman Emperor is abolishing sacrifice. Yeah, that's an extraordinary thing. And for me, I sometimes engage in apologetics relative to Judaism who argue Jesus is not the Messiah from Scripture. And they say, well, when the Messiah comes, it'll be obvious because you'll look outside side and people will be worshiping the God of Abraham. And I say, well, look out your window around Passover seas and then look at thousands of Gentiles making a pilgrimage to Jerusalem to honor the God of Abraham, Isaac and Jacob in the name of the crucified Jew. That's an extraordinary thing. You know, that alone does not prove he's the Messiah, but it does put him to the top of the list and plausibility candidates."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2896.8,"end":2946.4,"speaker":"Jonathan Pageau","text":"Yeah, well, I, I always used to think, I use, I used to have this. At some point I realized, because people, because it's also because I grew up evangelical, which, which somehow obscured some of this to me because, you know, I grew in the evangelical church. There's this idea that it's, it's a, it's a self contradictory idea because they believe in everything, in the, in the creed. But then they also think Constantine is the devil and that the conversion of Rome is the beginning, is the fall of Christianity. Right? It's like, you know, but then when I actually realized that Christ, you know, the idea that Christ would become his king and that he would, that he would rule over the, rule over the Gentiles, it's like, well, that happened. I mean, it took 300 years, but it still happened. And when you read what St. Paul's saying, it's like St. Paul knew it was happening. Where St. Paul says he is at, at this time, Christ is ascending the principalities."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2946.48,"end":2946.96,"speaker":"Sarah","text":"He's."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2946.96,"end":2993.15,"speaker":"Jonathan Pageau","text":"He's subjugating all these principalities to him. It's like, you might not see the fruits of that yet, but just wait, you know, and so, and then it happens. So it's a, it's a pretty astounding, it's a pretty astounding thing. And, and you're right, I, I do also think that, you know, there is no way to view history outside of Christ anymore. You just can't, you can't view the world outside of what Christ came to reveal. And you know, even as we move towards weird internationalism and globalism, you know, a lot of the basic values that underlie that, even though they become twisted, you know, it, it is a kind of the idea that you should have compassion for your enemies. The idea that you should. All this kind of weird stuff, like even, like the rules of war and all that stuff, would you think that that's just normal?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2993.16,"end":2993.32,"speaker":"Sarah","text":"You know?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":2993.39,"end":3009.71,"speaker":"Jonathan Pageau","text":"You know, it's normal that we would have rules of engagement and rules of war and that you wouldn't just slaughter your enemies, pretend, you know, and then just slaughter your enemies. Like if you, if you believe in these, in these, these values and the idea of helping the weak and the marginal, like this is all Christian stuff. Guys, I don't know what to say."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3010.19,"end":3031.03,"speaker":"Sarah","text":"Yeah, I, you know, sometimes we can get kind of, we can Roll our eyes that, you know, this or that religious leader generically says, war is bad. And you're like, well, yeah, of course war is bad. And then I realized one day that is not something that everybody has taken for granted. There's a reason the cult of war is central to lots and lots of cultures."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3031.03,"end":3100.74,"speaker":"Jonathan Pageau","text":"No worries, Julius Caesar. So this is the thing about Christianity, too. It's like Christianity is rife with war and horrible and tragedy and everything. The difference is they always have to make excuses for it. They have to try to hide it. They have to deny it. You might think that's nothing, but Julius Caesar bragged that he slaughtered a million million Gauls like it was glory to him. It wasn't something that he had to hide or apologize for or, like, sweep under the carpet or try to find some excuse for. It's like, no, it's like when. When, you know, when Americans bomb not, you know, Hiroshima and Nagasaki, they. They have to find some moral, twisty reason to, like, make that plausible. They can't just do it with that. And I. And I. First of all, I think it's a. A horrible thing that happened, you know, But. But the. After that, they have to make excuses for it. They can't just be like, you know what? This is how we win a war. This is how we beat our enemies. And just, like, you know, let's say just. Just revel in the blood of your enemies like the Scandinavians did. It's like, you think, anyway, it's just weird to realize just how people don't. Can't see how much, you know, Christ has transformed reality."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3101.18,"end":3153.33,"speaker":"Sarah","text":"Yeah. Yeah, absolutely. And I think that connects to this theme you see in. In Scripture and outside of Scripture of, you know, liturgical warfare. And it's interesting to me that so many cultures have a story of creation through warfare. And then you read Genesis and, you know, you've got God forming, filling, brightening the world in these six creation days, and then he enters into his rest. But you follow the language of rest through scripture. It's also used in relation to warfare. So there seems to be, I think, some connection, some thematic connection between what's going on in Genesis and the broad idea of warfare. But the way in which Christ takes it is that, you know, these cultures say warfare upholds the world. Blood is what keeps the world pumping. And Christ says, yes, it is what keeps the world pumping. It's my blood."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3153.33,"end":3153.93,"speaker":"Jonathan Pageau","text":"My blood."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3154.49,"end":3236.82,"speaker":"Sarah","text":"And. And I think that has really profound implications for what the church's mission is in relation to her liturgy that you Know, in scripture, you know, you've got the idea of the heavenly court, the heavenly council. You follow that theme through, though, you realize the heavenly court is God's heavenly temple, and that's where liturgy is going on. So Christ is king and priest. He's king because he's priest, and priest because he's king and God is ruling the world through the heavenly liturgy. And then you go to the Orthodox liturgy. Why is it that we are praying for, you know, everything conceivable? We're praying for fruit. We're praying for, you know, that the nations be at peace, the unity of all mankind, and then we have all these names. We're putting these names into the Eucharist. Well, this. Because the liturgy is the throne room of God. This is where we enter into God's reign over the world. And I think we really need to, And I say this to myself as much as to anyone else, recover the sense that, no, this is actually something real. There is ontological significance to writing a person's name in the diptychs and having them prayed for. It changes things. When we do this. God really does take that into the Logos so that he's shaping the world in and through his union with those. Those intentions. So I know that's."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3238.66,"end":3330.54,"speaker":"Jonathan Pageau","text":"You'Re abs. You're. You're. You're absolutely right. It's difficult. Like, I find it hard. Like, I. I'll be honest with you. Like, I struggle to totally believe that, you know, but I know it when I stop and I look at how. How it happens for me, like, let's just say, like, if I carry someone's name in my heart, that transforms everything about them, right? It transforms. You know, if I. If I'm angry with someone and I'm annoyed with them and I say, okay, I'm gonna. Just gonna carry that person's name in my. In my heart with good intention. I will direct good intention towards that person. Then it changes everything, you know, and it will transform my perception of them. It'll transform my actions towards them. It'll transform everything. And so it's like, that's actually how it works. And so then the idea that we would take these names and that we would raise them up higher into the divine will and into the divine. Into divine providence, then of course, it would do the same at a cosmic level. I don't. It just makes sense because we know that that's what happens within us. It's just. It's harder because we're selfish and we're. We think we're little God. So we think it pretty much ends with us, you know, and that happens to me all the time, you know, and I forget to pray for people constantly. You know, people ask me to pray for them and I usually do it for a few weeks and then I forget and it's like, you know, it's like if I, like you said, if I understood the power of taking people's names and, and, you know, and, and, and bringing them up into the throne room of God, I would."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3331.18,"end":3331.66,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3331.98,"end":3333.66,"speaker":"Jonathan Pageau","text":"Probably be. Have more perseverance."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3333.9,"end":3363.33,"speaker":"Sarah","text":"Yeah. Yeah. So, so how has your kind of focus on symbolism and all of this stuff? How has that, if I can ask it this way, shaped the way in which you read the story of your own life? Not to make you sound self important or something like that, but are you comfortable, I suppose, reading the story of your own life symbolically?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3364.53,"end":3487.64,"speaker":"Jonathan Pageau","text":"I think so, but I think we, I think it's dangerous. We have to be a little careful. You know. The way that I do it is I try not to be too deliberate about it, like you said, not to become, not to become self absorbed. But I'm grateful for the insights that come to me. Maybe I would say it that way. It's like there are moments when I see parallels in the things that I'm doing and the things that are happening to me and I see the parallels with scripture. Sometimes it's not, sometimes it's frightful, it, sometimes it's actually quite frightful. But nonetheless I try to be grateful when I see that, that, that, that when I can see the relationship between these stories. But I would be, I would warn people to be careful because when you become, and I say this like really, because the, you know, I've seen it happen to many people where when they start to think this way, then they become the equivalent of paranoid because what happens is that they become very self conscious and they start to analyze all the things that are happening to them and all the things that they're doing in these symbolic structures. And then all of a sudden, you know, before they know it, they think that they're being spied on by, you know, the Illuminati and that they're, you know, and that, you know, they're demons that are constantly pulling at them this and that direction. And that's why this is happening and this is happening because of this. And you know, it's like if something bad happens to them, then all of a sudden they're trying to wonder if there's someone casting a spell on them. You know, they that kind of stuff. That is a very dangerous place to find yourself in, I think, which is why I think the best way to do it is to focus on God and on the stories of scripture, on the liturgy, on participating on your family, on all the things that you can have power on and not focus on your own story so much. But then once in a while, there'll be. You will encounter some insight, and then you can try to be grateful that God is using you in this way or that, you know, that God is shining a light on. On moments in your life. But I. I wouldn't warn against doing that too much, like, for those reasons."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3487.72,"end":3549.02,"speaker":"Sarah","text":"Yeah, yeah. I mean, the primary reality has got to be, you know, our direct relationship understood not to exclude, our relationship with the church and so on, our direct relationship with God and obedience to him. That obedience precedes wisdom. Obedience precedes knowledge. If you don't have obedience, you might get, like Adam did, knowledge. But because knowledge is ultimately rooted in God and we are smaller than God, if we try to get that knowledge directly, we're going to burst. We're going to burst open. And that's why I think there's. There's. There's a connection there with the way we talk about the Mother of God as the kind of archetype of the church. The Mother of God is more spacious than the heavens. It is only when God grows us to a sufficient size that we have the room to actually assimilate any knowledge. And the person who has grown to that size is a person who, like her, is defined by trust and obedience to his will. You know, one of the things also that I think is because it's interesting because what."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3549.1,"end":3559.46,"speaker":"Jonathan Pageau","text":"Using the Mother of God as an example is a really good one because it says, you know, when. This is one of my favorite passages about the Mother of God, which is that, you know, when the. When the."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3559.46,"end":3559.82,"speaker":"Sarah","text":"The."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3560.29,"end":3608.84,"speaker":"Jonathan Pageau","text":"The mages come to see her, it says that she gathered all these things in her heart. And I love that because it's like, first of all, that's symbolism. The word is actually symbolo. It's actually symbolism where she kind of gathers all these facts into her heart. And she's basically like. You get the sense that. Which he's starting to see the pattern like she sees. It's like, oh, this is. Show. This is manifesting something, you know, but there's a kind of a. There's a kind of attentiveness that is balanced by, you know, her discretion, you could say about it. Right. It's like she didn't start talking about it. She didn't start telling everybody about what's happening. She just. She's kind of gathered these, these hints and these, These events into. Into her heart and meditating on them. I think that's. That's the best approach, you know?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3609,"end":3654.33,"speaker":"Sarah","text":"Yeah, yeah. And in Luke and Acts, it's really cool. There's. There's a. There really is an incredibly developed Mary church typology there. You know, one way to see it is, you know, the Holy Spirit overshadowing Mary and then the Holy Spirit coming on the Apostles of Pentecost. While Mary is said to be there, it's described in the same ways, but also when she says she treasured up all these things in her heart, and Jesus will later say, where your heart is, there your treasure is also. And then in Acts, there's this emphasis on the churches of one heart and one mind, and they held all of their wealth together, together in common. And there's this idea that, well, what is wealth, really? We, We. We think of wealth. We're used to thinking of wealth as a tool to make you comfortable. But what's the difference between $1 billion and $50 billion? As far as comfort goes? You're getting diminishing returns."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3654.41,"end":3654.89,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3654.89,"end":3806.27,"speaker":"Sarah","text":"What, what is wealth, really? Wealth is, I think, is it represents the degree to which you can realize, you know, your intentions for the world outside of yourself. $50 billion, you can directly shape and change a lot of things. And I think when Scripture connects wealth to divine life, you know, the riches of God's glory, the idea is that in Christ we have received the treasury of God's own life. We would say in Orthodoxy, his energies, his operations into ourselves. And then it is really the church at prayer, which is the treasury of God's glory in the world. We are then taking that and directing it to shape and mold certain things, which goes back to what we were just talking about with the liturgy. And then you look through the Bible and there's really a huge amount of financial language in Scripture. You know, buy without money, I advise you to buy from me gold refined by fire. There's all that stuff there. And thinking of the Theotokos as more spacious than the heavens, who has this immense treasury, who is Christ himself in her, is a good way of, Of. Of conceiving that. I think the other thing that I think can be difficult or problematic in quote unquote, reading your own life symbolically is that people can. And I, I include myself in this. If you see certain symbolic Structures that really seem to be there. There's a temptation to kind of self importance, I. E. I'm the center of history. Look at how God is directing my life. You know, I might as well be a biblical character. But I think what you, what you always have to remind yourself of is, no, this doesn't mean that you're different from everyone else. It means you're like everyone else. Where those symbolic structures are really there because you read so names and lifespans in the Bible often have symbolic significance. People. Joseph dies at 110 years old, that has symbolic significance. Moses dies at 120 years old, that has symbolic significance. The names, even where the meaning is not explicitly drawn out, it really does seem to correlate, correspond to something about their life. I think that's, that's true. I really think that is true in principle for everyone's life, even if we don't know what it is. I think in the final accounting of things, we're going to see some symbolic meaning to all this stuff. One of the things that, that was very striking for me in my personal life and I'm going to have her on to talk about all of this. But, but When I was 18, 19, I did a 40 day AUS to St Nicholas to find an orthodox spouse."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3806.35,"end":3806.71,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3806.71,"end":3822.03,"speaker":"Sarah","text":"And it just so happened that the day of my engagement and I did not plan this was precisely 4,000 days after I completed that 40 day set of acoustics. And I think, you know, if you just look at a lot of stories in a lot of people's lives and a lot of stories and."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3822.51,"end":3823.39,"speaker":"Jonathan Pageau","text":"Are you married now?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3823.8,"end":3824.12,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3824.28,"end":3825.64,"speaker":"Jonathan Pageau","text":"Oh, congratulations."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3825.8,"end":3829.04,"speaker":"Sarah","text":"Thank you. Thank you. Yeah. So we got married on June 2nd."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3829.04,"end":3829.8,"speaker":"Jonathan Pageau","text":"Glory to God."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3829.88,"end":3845.96,"speaker":"Sarah","text":"Yeah, Glory to God. Glory to God. So seeing that in my life, I think what we need to do is we take these things as a sign of the way the world always works, not a sign that we are set apart or special or something like that."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3846.2,"end":3878.7,"speaker":"Jonathan Pageau","text":"Yeah, that's a good, that's a good way to talk about it. It's a good call because like you said, like we've been saying since the beginning, in some ways those, the patterns, the patterns in scripture are the patterns that inform reality. They're the patterns that make reality real. And they make. And so when we see them, we actually shouldn't be surprised, you know, and when, and if we see them, you know, only occasionally, it's, it's actually a reproach on us that we're blind to how in fact, God is always working through, through things and is always, you Know, bringing things together towards their good. So."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3879.99,"end":3976.86,"speaker":"Sarah","text":"Yeah, and. And, you know, one of those things that. When I was kind of still going through many years ago, you know, doubts about Christianity, one of the things that struck me was, you know, there's all these patterns in Scripture, you know, and the Book of Kings or Exodus, for example, you know, the temple was built 480 years, exactly 12 times 40 after the Exodus. And, oh, that seems a little too perfect. But. But then you come into that period of history which is close enough to us and well documented enough relative to us that we can say, okay, no, these numbers are real. One of the things that struck me is, wait a second. The temple was destroyed 40 years after the death and resurrection of Christ. And that little fact kind of wormed its way into me because it suggested that these patterns are not just literary, they are a real feature of the world. So that's been just one of the exciting things I've followed through over the last 10 years. So we don't have that much time left. But I did want to just ask, how does your project of universal history relate to the kind of mission of the Church in taking all nations into the story of Christ, I. E. You know, the home Christ is present in each one of us, not a little bit of Christ. The whole Christ is present in each particle of the Eucharist. The whole story of Christ, by implication, must be manifest in those nations whom he takes into himself. How do you see that project? Sacramentally?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":3977.26,"end":4004.97,"speaker":"Jonathan Pageau","text":"Yeah, I think. I think. I mean, I think you hit the nail on the head. And, you know, as we just, by the way, as we talk about, you know, universal history, I have to give a shout out to Richard Roland, obviously, because, you know, in those universal history podcasts, I'm usually pretty passive. And he's the one who's, like, teaching me about all these. These great stories that. That often I know a little or I don't know at all. And so I've been really grateful for him to. To. To help that. But I think that, you know, both of us, we kind of."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4005.21,"end":4005.53,"speaker":"Sarah","text":"We."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4005.53,"end":4162.84,"speaker":"Jonathan Pageau","text":"We started messaging each other on Facebook, I think, several years ago, and realizing that we both love this, we both had the same vision, which is similar to what you said, which is that if we believe that Christ created the world, if we believe that the divine Logos is that which. That orders, you know, chaos into being, then the story of the Logos should be hidden everywhere. And that the universal history that the ancients did is an example for us, a shining example for us at how people started to remember their own history through Christ and how this is possible not only for them, it's possible for us now and it's possible for all the peoples of the world that if you remember your story through the lens of Christ, then it actually shines brighter and it reveals more things about yourself, more things about your place in the world, and also your, Your possible purpose for your people, for your family, for, for, for everything that you can participate in. And so like you said, I think that ultimately this is a work that is not just something that happened a thousand years ago in Scandinavia or in Ethiopia, you know, 1500 years ago or whatever. It's something that can still happen now. And the, you know, and some of it, and it's weird because this is gonna, this is also gonna scrape at people in the wrong, wrongly. But some of it has to do with fiction and some of it has to do with what we, most would, we usually understand is kind of factuality. And, and there are moments when those, when the bridge between the two will, will, Will collapse. And you don't have to be too scared of that. You know, you also have to not. I mean, obviously you have to be careful, but you have to be not too scared of that. And so, you know, the way we're doing God's Dog, for example, this graphic novel series that we're doing, you know, we're, we're using fairy tale tropes with saints and Bible stories to kind of help people see the structures in the Bible and in the history and in the hagiography. And, and I, and I know that some people will probably find it, find it's the wrong way to go, but, you know, that I think that we are tapping into something that will surprise people and will help them look back now at their own history, at the Bible and understand it better because of some of the narrative connections that we're making through this fictional story."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4164.04,"end":4194.69,"speaker":"Sarah","text":"Right, right. And so what intellectual trends do you find most exciting now? Just outside the range of people who are already kind of familiar with universal history symbolism, say just a totally group of people who wouldn't have heard of you in your work? What intellectual trends do you think should be brought in and can have a positive influence? And who is most receptive to this kind of way of thinking? Thinking?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4195.57,"end":4355.88,"speaker":"Jonathan Pageau","text":"Well, I think, I mean, if you look at the conversation that I've had on my channel, you'll see that in some ways a lot of the people I'm talking to are, are, are that. So I think that a lot of cognitive scientists you know, like John Revake and, and other people like that are people that at least try to connect, you know, the, the most, the most advanced visions of science with cognition and try to see how they're related. You know, although some of it can sometimes get messy and, and maybe a little chaotic. I think that those are very. People that are very interesting, like Ian McGilchrist, people like that that are trying to look at how consciousness works. They will come to very similar, let's say they'll come to very similar answers as what, what it is that we find in the Bible. And then engaging with them and talking about it in those terms and can help move the conversation further and help bridge a lot of the, A lot of the, the, let's say, the gaps that exist between secular and religious culture. And I think that it, not only is it good for the secular people, but it's also good for the religious people too, because the religious people sometimes we have these, this kind of inner language that we developed, you know, this kind of inner religious language which is useful but can also be fetishized, where we say things like divine energies and, and, you know, and apophatic and kenotic, and we have all these really, these technical terms. And at some points it becomes like a language that doesn't even mean anything anymore. It's not connected to your experience, it's not connected to reality. It's just this inner theological language. And I think that engaging back into the conversation with, with, with thinkers like that, you know, for example, the question of consciousness and AI, the difference between intelligence and, and statistical prediction of, of. Of information, these are all questions that, you know, Saint Maximus can cast a light on, you know, and so we have to get involved in these conversations, you know, because if we don't, then even Christians will be seduced, you know, by these, these new machines and will think that they're actually intelligent when, when all they are, are, are basically divination, massive, massive divination machines that just predict statistical, you know, probable relationships between facts between points on the, on a grid. And so anyway, these are just examples. But I think that all the discussion about emergence, all the discussion about, about. About consciousness, all these are trends in thinking that, that are, that are coming back that I think Christians should, should take seriously and get involved in."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4356.92,"end":4374.68,"speaker":"Sarah","text":"You're mentioning AI reminds me of a question I've had for a while. What do you think the relationship is symbolically or metaphysically or whatever, between our modern discussion about AI and the medieval idea of talking head?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4375.72,"end":4379.96,"speaker":"Jonathan Pageau","text":"You mean kind of like the, the, the what you see in that hideous strength, that kind of thing."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4380.97,"end":4401.85,"speaker":"Sarah","text":"Yeah. And, you know, Albert the Great was said to have, you know, invented a device which he could then animate and it would give him answers to any question that he put to it. And there's also the idea in Judaism that with the right rituals you can. And it's prohibited in most forms of duties, and with right rituals, you can take stuff and animate it and it'll talk back. Yeah, yeah."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4402.09,"end":4579.21,"speaker":"Jonathan Pageau","text":"Well, I think, I think it's. There's definitely something, There's a relationship between the occult and the AI. I mean, I think that that's just inevitable, you know, and that the way that occultists would try, like, like the way you talk about it, the way that they would try to aggregate a kind of being, you know, and then use it as a, as a divination tool, this is definitely what's going on. I mean, this is clearly what's happening. You know, know, I had a, an interesting conversation with, with an AI developer. And you know, because the way, I mean, obviously the language models, you kind of know how it works, right? It's basically they create a semantic map and then what they do is they just measure diff distances between words and then, you know, if they do that well enough, then they can project what. What's going. What. What's the most probable relationship between the pro. Most probable. Next word because of the proximity, in terms of a massive, massive amount of data. And so, you know, it's like that semantic map, like the massive semantic map. Obviously no one has access to it or very few people because it has everything in it, right? It has, it has all your darkest thoughts, all your darkest desires, every, every, you know, underlying thing that humans don't want to look at is all there in that AI. And so I asked this AI developer if we could, if we could trace out in this, in this massive kind of data set, if we could trace out certain gods, like if we could, for example, summon the God Aries by basically finding the boundary in the semantic map and tracing it so that when you ask the question, you're, you're, you're within that, that relationship of language. Because obviously when you're, I don't know, when you're talking about war, you're not talking about flowers. Like, you're not talking about, you're not talking. So there is a. And he said, of course you could do that. He's like, that's just that, of course you. Once he understood what I was talking about, at first he thought I was woo wooing, but once I kind of explained it, it's like no, that there, there, there are, there's personalities and have semantic maps too. Right. And so you can imagine that the, the, the gods of the ancient gods have a semantic, you know, pro, let's say boundary. And he said yeah, of course. And it's like man. So, so in some ways it, in some ways a lot of the things that when we look at in the occult world we don't totally understand because often the, the, the mechanisms by which it happens aren't described. But I think now we, we have and we, and, and I say we know the mech. We don't even know the mechanisms by which it's happening. You know, the AI people, it's a black box. They don't know how the AI answers. They, they, they set up the parameters, but then they, they don't, they can't account for the emergence of the answer. And so it's like once the, the AI is running, they can't see the processes. And it's like that seems very similar to what, what the, the occultists were talking about."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4581.13,"end":4618.74,"speaker":"Sarah","text":"Yeah, kind of a, it's a way of existing, I don't know, self referentially. Right. So if you want to know the answer to your question, what do you do? You just kind of ask this instantiation of human beings, collective consciousness or whatever, maybe one way to think of it or if we think about the occult as idolatry, you know what idolatry is? We take our ultimate good to be something other than God. And because we become like what we worship and God is the only one with life in himself. Well, when we turn away from God, we just kind of collapse into ourselves. There's no way of kind of breaking out of that."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4619.78,"end":4701.33,"speaker":"Jonathan Pageau","text":"And it's interesting because it's like, I don't know how they're going to deal with it, but there's, you can see in, you can project into what's going to happen with AI at least one line, which is the problem of self reference, self referentiality, like the problem of self reference and a kind of cannibalistic system, you know, and you could say that that's why we, we believe that everything has to kind of move up into the, into the, into the apophatic and transcendent, you know, because AI, like the AI models right now, they're kind of cut off from the Internet, a lot of them for good reason. Because as we move forward in time, the AIs are going to be producing content which will go on the Internet, and then the AI will start to train on its own production. And so within a certain amount of years, there'll be this cannibalistic spiral that will. That will spiral, you know, obviously spiral into. Into idiosyncrasy and spiral down into kind a kind of madness. And that's almost inevitable because they, at some point, they can't have the AI just closed off forever. They need to have it reopened so that it stays with the times. But those times will have been built by the AI itself. So it's like you can actually see how the idea that this will. That this will give birth to like a. To some, like, God, that's going to be, you know, it's like, no, it's going to. It's going to turn into a monster and it's almost inevitably."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4701.41,"end":4764.89,"speaker":"Sarah","text":"So, yeah, it's. You know, that reminds me of. There's that bit in Voyage the Dawn Treader where they go into that. This portion of the sea and it's the place where dreams come true. It sounds so wonderful. Oh, my dreams are going to come true. But no, it's horrible because your dreams come true. That's right, dreams. And I think there's something profound in there because what happens in our actual dreams, not our daydreams where we have a measure of control, we can direct what part of ourselves we want to look at in our actual dreams. The reason they can be so disturbing is because we are encountering ourselves without the ability to choose which bits of ourself we're going to encounter. And that's what I think damnation is. If we pick ourselves as the ultimate reference point, there's no way we can differentiate which parts of ourselves we like and which parts of ourselves we. We don't like. By what standard are we going to do that? No, we get our whole self, our whole subconscious, and we might not like what we actually encounter."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4765.21,"end":4825.13,"speaker":"Jonathan Pageau","text":"So, you know, because that's the thing with. That's exactly the thing with these, these semantic maps and these. The. Is that what's in there is the, the. The idea that the. How can I say this? It's like as the, the AI models speed up, at some point the, the AI will know what you want more than you do and will know all the dark things you want more than you do and will not necessarily know. I mean, they'll try to control it, but they won't necessarily know not to give it to you. And so it's like, dude, that's Hell, that's literally hell. Like, like we're, you know, this image that C.S. lewis has, you know, of, of hell in the, in the Great Divorce, you know, of people moving further and further away from each other. Right. And becoming more and more idiosyncratic and more and more isolated and more and more in their own little kind of closed off world. I mean, can you imagine that? Like we're building that right now."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4826.17,"end":4906.62,"speaker":"Sarah","text":"Yeah. And it's, I think it's one of the things we've seen in just the last couple of decades. You know, there was some study, you know, teenagers are having less sex than they have in decades and decades. And well, in itself that might be a good thing. But what's the reason? It's because all of these things which drive people together by necessity are now dropping out. We can want to eat well, just get door dash and they can leave it at the door. I don't have to see anybody for weeks if I don't want to. And I think, you know, this is one of an instance of the way in which we can see the good through the bad. So at a certain point when the necessity of community is stripped away just for our day to day existence, those who choose to engage with people are doing so really deliberately because they've seen something good just in that. And that is where I think there is a real opportunity for the church to be the church as the extension and the form of all community, as the disclosure of God's trinitarian life in creation. And so people, they want to be alone all the time. Well now they can be alone all the time. And they get to see what that's like. And then they say, I don't want this. And that is where the church can be the city of God and says, you don't want this. You can have what God has to offer instead."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4907.18,"end":4969.65,"speaker":"Jonathan Pageau","text":"Yeah, that's a great insight you've got there, which is that in some ways the kind of spiral out of control of the west and the spiral out of control of our own lives is an opportunity to, to become, to become more even, you know, and, and even that in that image, in some ways that Santa Irenaeus presents of Adam and Eve as something like children. Right. Where in some ways what the Fall does is that it, it takes you through a kind of self consciousness which leads to more in the end and that, you know, that someone who needs community, like a village in, you know, in South America or someone, it's like they're living the good life, like they, they've got that, that goodness and. But they're not, you know, in some ways it's, it's the way the children, way the children have it. But if you lose it, really lose it, and you see all the consequences of that, then when you deliberately go back to it, then maybe it has even more than what it had at the outset. You know, like the heavenly Jerusalem is more than the Garden of Eden, you know, and it's, it's a little mysterious, but it seems to be that that's the case."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":4970.5,"end":5002.43,"speaker":"Sarah","text":"Yeah, yeah. When you're a kid, you can only have as many cookies as your parents give you. Yeah. Adult. It means you can have as many cookies as you want, which means if you're not having as many cookies as you want, you're doing that because you know what that means. And so there's more virtue in not having as many cookies as you want because you're choosing that. And it's the same, I think, with Community. So, Jonathan, as we, as we wrap up, I just want to ask, where are you going intellectually? What are you really excited about going forward? Is there anything new on your map that you're pursuing?"}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5002.75,"end":5091.46,"speaker":"Jonathan Pageau","text":"I mean, I'm really excited about the storytelling mostly. And so those that kind of know what I've been doing. In the past year, I've started this new fairy tale series. So we're going to put out eight fairy tales that are going to be a kind of self conscious treading through fairy tales, but in a way that hopefully will provide insight into what the meaning and the power of these stories is. And I'm also, we're still working on this series of graphic novels and I think that's the thing that excites me the most, is kind of where that's going, how it is that I can participate in helping to revive stories, you know, give people stories that are pointing to the good rather than, you know, just to this kind of crazy type of storytelling we're seeing. And so that's the thing that I'm putting most of my attention on because I think that explaining things, which is what I've been doing for the past six years, is wonderful. It's great. But doing them is probably better. And so, you know, and I, I started like that where I was carving icons and I was, I was involved and I was doing it and I was in the, in, in the life of the church and making these images and it was wonderful and amazing. And then this weird opportunity that I definitely didn't ask for to now be able to just like, talk to people and explain these things to them. And I think it's been an amazing loop and I won't stop doing that, but I think I am going to now start refocusing on doing things. So, you know, telling these stories is the thing that excites me the most."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5092.34,"end":5122.65,"speaker":"Sarah","text":"Well, that is awesome. I know so many people have really been changed by your work, and I'm very, very grateful that you're. You're doing what you're doing and super excited to see where it keeps going. So thank you so much for coming on. It's always a delight to talk to you and have you on the channel and hopefully at some point in the future, you can come back. But thank you so much for. For doing what you do."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5122.65,"end":5138.51,"speaker":"Jonathan Pageau","text":"Yeah, I think so. This is a great conversation. You always push me. You push me further in talking about things that I usually don't talk about. And so when that happens, I'm like, hey, I never talked about that, you know, and because, you know, when you're doing it, you're on your own, at some point, you. You kind of go around in circles."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5138.51,"end":5138.83,"speaker":"Sarah","text":"So."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5138.83,"end":5154.87,"speaker":"Jonathan Pageau","text":"So I appreciate it. Thanks for provoking me. And also thanks for. For all the work you're doing. I know that you know that your great love of scripture is also having a big effect on. On the Orthodox around you. And congratulations on your wedding again. That's amazing."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5155.03,"end":5164.87,"speaker":"Sarah","text":"Thank you, thank you. Thank God. So, Jonathan, thanks again and we will look forward to seeing what comes out of the Peugeot world."}
{"episode_id":"SW - #318 - 2023-12-14 - Seraphim Hamilton - Re-Enchantment Now - Fairies, Aliens, the Occult, Prayer, and Divination","start":5165.68,"end":5182.8,"speaker":"Jonathan Pageau","text":"Thanks, everyone. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld. Com and thank you for your support."}
