{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":0.08,"end":68.15,"speaker":"Jordan Peterson","text":"These are the elders I was talking about. Right. They're not just olders. Let's make that distinction. It's not just because somebody's old elder means you have suffered enormously direct contact with the complexity of life and have metabolized that into a capacity to be in more relationship, more intimate relationship with reality. You know, when you look at the. The, you know, the fathers say, well, who are they? Well, they were guys who were up here, and what they said is true. But until you can connect it to something that you can actually own in your own experience, you don't have Pistis. You have knowledge, and knowledge isn't going to do you much good in reality. Pistis will do you great in reality. And that, I think, is the real pivot that we have to make is to say, look, we cannot be saved from suffering. That's not how it works. In fact, as Christians, we kind of recognize that if we're. If we're told to follow me, we know we're following me leads. We cannot be saved from suffering. We're choosing to enter into that reality. That's the reality we're entering into. But one of the aspects of suffering is that it's not. It's not a bug. The problem of suffering is not the problem. The problem maybe is meaningless suffering or suffering. We don't actually put it to proper use. That's a problem."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":79.99,"end":103.57,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. We were talking in private for a while, and we didn't. We haven't done a podcast in a very long time, so it seems like it's a. Yeah, it's good to catch up and to. To see, you know, how things have been doing."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":103.97,"end":115.55,"speaker":"Jordan Peterson","text":"Yeah. In fact, I think I may be wrong. You know, this. These things have been going on forever. But I don't think that the last time you and I spoke, let's say publicly, I had come out of the closet."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":116.59,"end":132.43,"speaker":"Jonathan Pageau","text":"That's right. And the last time we talked, you hadn't. At least you hadn't started saying that publicly that you're a Christian. And then we. We had some conversations in private. And so. So. And so. Yeah. So it is the first official time that we talked since you. That you came out."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":132.43,"end":133.11,"speaker":"Richard Pageau","text":"I love you."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":133.11,"end":135.07,"speaker":"Jonathan Pageau","text":"Say you came out of the closet. That's funny."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":136.75,"end":139.72,"speaker":"Jordan Peterson","text":"And I think appropriating terms is perfectly legitimate."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":139.72,"end":156.36,"speaker":"Jonathan Pageau","text":"Yes. Appropriate. Perfectly legitimate. And so let's say, how. How has it been for you, like, in the transition towards. Towards Christianity? Like, what, What. I mean, because it's changed. I mean, your whole life Is probably quite different now."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":156.84,"end":165.96,"speaker":"Jordan Peterson","text":"Okay, well, I'm gonna maybe have to use a kind of a crazy metaphor. But it's the first step. The first step of the metaphor is a little bit like coming, going over a waterfall."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":166.49,"end":167.05,"speaker":"Jonathan Pageau","text":"Huh."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":167.37,"end":195.38,"speaker":"Jordan Peterson","text":"The second step of the metaphor is even crazier, which is you begin to realize that there's no bottom to the waterfall. And then the third step is you begin to notice that the whole thing is actually learning how to swim in a bottomless waterfall, something like that. I mean, everything just moves. It's move. Things are just moving continuously, rapidly, and with an increasing level of. What's the right way of describing it? Like secure surprise, something like that. Yeah, it's been amazing."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":195.62,"end":245.89,"speaker":"Jonathan Pageau","text":"Yeah. And. And so let's say, I mean, for the people that, that are watching, you know, my question would be because one of the things that, that you are known for is trying to think of, let's say, solutions or ways of, ways of seeing the world that can help us figure out what's going on and also help us, you know, try to, to see what direction we should be aiming, you know, individually, but also, let's say, as communities and even globally, let's say. And so my, my question to you is, you know, since you've converted to Christianity, has that changed your perception? Let's say when you think strategically or when you think about, you know, how. How we should act as a society or how we should align ourselves, like what, how. How has that changed for you?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":246.24,"end":359.34,"speaker":"Jordan Peterson","text":"And it's a very subtle question, so let me see if I can respond with something like clarity here. The framework that I think is maybe the best is one that a friend of mine gave a while back, which is this notion of, in music, the movement from rhythm to tone. So you have a rhythm that has a certain BPM, say start at 10, so just a beat. And then as you increase the bpm, it starts to happen. What happens is you can kind of graph it. This is a visual me putting on an XY graph. As the, as the, as the beat starts to accelerate, it has this really interesting thing where it transitions to a tone. It changes from just a series of beats that have no tonality to them and kind of magically converts into something that your ear now actually hears as a quality of tone. And that ability, the fact that reality consists of the capacity to move from quantity, increasing beats to quality, the presence of tone is on the one hand, by the way, super fundamental. But in this case, it also has to do with what, let's apply, say, rationality. Or strategy, or the application of intelligence across energy. These are all more or less of the same plane. And as there's a process of endeavoring or even needing to increase those in velocity or bandwidth would be the actual weirdly technical term. What begins to happen is you notice there's a lift, a vertical lift that is of a qualitative nature. And so the. A way of saying it is something like, we have exited the realm of where the concept of strategy is applicable or viable."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":359.5,"end":360.78,"speaker":"Jonathan Pageau","text":"Ah, that's interesting."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":361.66,"end":442.33,"speaker":"Jordan Peterson","text":"Or shortly going there, we're heading there rapidly, and we can. That could be concrete. For example, the notion of you kind of move this to a slightly different domain that has the same pattern. Let's just talk about, say, the tension between AI and the human mind that thinks that it is something like AI. And what I mean is the Arc of the Enlightenment had this really interesting thing where it started taking human beings as being more like machines. I call them mediocre machines. And like the really concrete examples, we literally had people whose job was to calculate, to do reliably and quickly. They were calculators. Some folks realized you could make digital calculators that were better. Okay, well, that whole function of the human mind. There are no more calculators, except for maybe for fun, who was replaced by technical calculators. But the broader point is that's actually sort of commonplace. Like, effectively, all functions at the end of kind of modern modernity and the version of capitalism that is subordinated to modernity are situations where the human has been converted into something like a mediocre machine. Would you want accounting?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":443.13,"end":450.85,"speaker":"Jonathan Pageau","text":"Yeah, the factory worker is the ultimate example. Basically, like just doing a repetitive gesture until I get a machine that can do it for you and for you."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":450.85,"end":505.12,"speaker":"Jordan Peterson","text":"And the point is, like, we say, okay, what are more advanced things like software, engineer or doctor? You know, like, wait a minute, that's just a more sophisticated mediocre machine. Because as we accelerate towards AI, we begin to notice that AI can kind of do that and maybe kind of do it better. Oh, well, now you have this problem. Do you, as a human, say, well, the thing I have to do is now, like, race faster than AI, so I can stay ahead of the event horizon of the nothing as it consumes all human activity. And you can for a while, but it won't work because it's going faster. Um, or, oh, wait a minute. There's a vertical dimension that's completely different modally in nature, which is not just part of what is human, but is actually more human, vastly more human. And of which AI has no relationship at all. So that's like one example of this notion that makes any sense."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":505.12,"end":543.98,"speaker":"Jonathan Pageau","text":"Sorry, no, it makes a lot of sense. And I think it's. I think you're. The way you present it is extremely useful. And it's, it's useful for people to understand also what AI is and why. The dream of AI becoming more than human, it's muddled because people don't understand the difference between like power, let's say, the capacity to just do a bunch of stuff. And the reason why you do the things. Like the reason why you do the things is a vertical relationship to the capacity to do it. And AI doesn't have access to the reason in itself. Like, it just doesn't by nature."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":543.98,"end":545.94,"speaker":"Jordan Peterson","text":"It's just that by what it is."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":545.94,"end":556.78,"speaker":"Jonathan Pageau","text":"And also because everything about it is a derivative of human. And so unless, I mean, at least in the current state, it will always be a derivative of man."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":556.86,"end":606.72,"speaker":"Jordan Peterson","text":"Right, right. And there's nothing in the current trajectory that will change that current state. Although, who knows, right. The world, this is not. That's above our pay grade. But it's critical when we look at something and we say, okay, AI has produced something that looks like art. What it's done is, it's done bricolage and it's taken art as manifested by humans and combined them in a way that is so sophisticated as a combination that the artistic element that was in the substrate that it was manipulating. Oh, okay, interesting. That's there. And of course, to the human eye, the human eye looks at it and implies its pattern recognizing capacity to it. And that connects. Yeah, but the thing, right, the thing that is the art, the connection to the transcendent, which is what art is, is just sort of strictly not available."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":606.88,"end":607.36,"speaker":"Richard Pageau","text":"Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":607.52,"end":637.38,"speaker":"Jonathan Pageau","text":"And it also, even, I think one of the problems we have, let's say in that, in that domain, is that we've forgotten what art was for. Like, we've forgotten. Even humans have struggled to understand what the reason we make art is for. But even in the AI, we still provide the vertical, like even with the AI production of an image, because we are the ones telling the AI what to make. We give it the prompt. Like, the AI doesn't just start generating images out of its own will, because it doesn't care."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":637.62,"end":638.98,"speaker":"Jordan Peterson","text":"And if it did, it would resolve."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":639.62,"end":702.19,"speaker":"Jonathan Pageau","text":"Yeah, we give it the prompt and then it manifests the prompt based on the vertical direction that we give it. It's dangerous in the sense that then it means now that. I mean, it means now that we can give power to any whim that we have. Like, we can basically give. Give massive amounts of power to any type of vertical whim that. That can be a kind of sinful whim, you could say, like a. Because there's some aspect of verticality which is. Which is dangerous if it's not well aligned. Because it's. It's a. We. There are mediocre humans too, let's say it that way, in the sense that there are things that we can want that are vertical that are not sufficient. Right. If we. Like, for example, the idea of just of being a slave to a desire is a good example. Like if you just want sex, that's actually a vertical. It's a vertical thing because it acts down on the reality, but it's not sufficient. And so if you have infinite power that gives you access to that little vertical thing, then you're in trouble. Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":702.76,"end":705.4,"speaker":"Jordan Peterson","text":"Yeah. Okay. So this is. That's a really good bridge. So."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":706.84,"end":742.26,"speaker":"Jonathan Pageau","text":"But in relationship to Christianity, I think. I think, or to your transformation and to your life, I think it's interesting to think that when you talk about this change from the horizontal to the vertical, being aware of the vertical already, just being aware that this is something that we need to be engaged with is. Is. Is a huge difference because most people are just kind of blind to it. They just act and they don't have a sense that, oh, wait a minute. There are things that I can want that should be ordered properly towards something which is transcendent. If not, then I have this, then I have the problem."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":742.82,"end":752.1,"speaker":"Jordan Peterson","text":"Yeah, and you're sort of that case. It's. You're playing out something that has already happened. And then there's this sort of flattening that will occur over time."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":752.1,"end":752.82,"speaker":"Jonathan Pageau","text":"What do you mean?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":754.18,"end":769.36,"speaker":"Jordan Peterson","text":"The verticality is there anyway. There's no way of pointing it. But if you're not aware of it or not connected to it, then this kind of like a nerve. It's like when you take Silly Putty and you kind of form it into a pyramid. You did it right. That happened. But then when you let go and it falls back."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":769.36,"end":769.96,"speaker":"Richard Pageau","text":"Exactly."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":769.96,"end":771.4,"speaker":"Jordan Peterson","text":"Welcome to the last 300 years."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":773.96,"end":774.44,"speaker":"Richard Pageau","text":"So, yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":774.44,"end":868.76,"speaker":"Jordan Peterson","text":"So what happened? I'm trying to figure out. This feels like this is an interesting. Like a confession. So the way that I was dealing with this problem of the acceleration of the playing out of the secular dynamics, this metacrisis cascades, like the way the different systems interact with different systems. What happens when the rate of agency just continues to feed back on itself? The technological Expansion, explosion, things like that intensity, like bigger and bigger perturbations. This was the thing that I was really worried about maybe up until about two or three years ago. And what happens is the term is actually what is invariant under transformation as the set of contexts becomes broader. If you're trying to figure out how do you respond to a larger set of contexts or to a set of contexts where you can't quite predict what it is you're dealing with, you have to look for strategies that are invariant under more and more possible contexts. A simple one would be like, let's make it very concrete, seek the high ground. It doesn't necessarily matter exactly what your situation is. It's a very good strategic rule of thumb, like Sun Tzu when he writes the Art of War. But he's based basically saying is like, guys, here's a whole bunch of stuff that is probably going to work. Like, I don't know where you are, what you're doing, but if, if you choose the battlefield and the enemy has to fight you on your choice of battlefield. Good rule of thumb. So these are rules that are invariant under lots of different contexts. Okay, what happens if you continue to sort of recurs on that? What are more invariant? What, what are the most invariant? What is the most invariant in principle?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":868.76,"end":868.92,"speaker":"Richard Pageau","text":"Right?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":868.92,"end":1106.04,"speaker":"Jordan Peterson","text":"So it's like you're climbing this, this pyramid of the things that are the most fundamental, which is to say, ultimately you're beginning to move from the immanent into the transcendent. You're looking for things that are now eternal principles that are not bound to the playing out of time at all. And then you're noticing that the eternal principles have a structure that is intrinsic to the eternal principles. This is me, by the way, moving up and by the way, always trying to figure out how to move out of the pure abstraction into, okay, what are the actual embodiments of these eternal principles? So Daoism, for example, is very high on the stack of actually perceiving the structure of the internal principles and then knowing how that embodies itself in life. Not that hard to get from these points. At the highest level of the stack, you find yourself. I found myself going, okay, I'm at a certain level. I'm actually really able to almost like literally physically notice how these principles interact and operate. But I'm continuing to have to focus, focus, because the magnitude of what we're actually dealing with in this moment in time is larger than anything's ever happened in history by a lot, by orders of magnitude, maybe 6 7, 8, 9, 10 orders of magnitude is incomprehensible. So if we want to find a way to navigate it properly, we want to have a scope of vision which is symmetric with the magnitude of the scope of the problem. We have to just keep going up that stack. And so what happened was I got as, you know, as high up the stack as I could get under my own power, and it didn't work. And it was unable to handle the pressures of what needed to happen, the kind of. The shearing strength. And so I was gifted then with the possibility of profound humility and in the field of profound humility and with some help, yourself included, and picked up the last, you know, the last. The last book, huh? Yeah. Well, these Christian guys, really, how could that possibly be? You know, the thing that's at the very top of the stack that seems implausible for lots of reasons, by the way, like doing a retcon, how we got there to that, to that posture, that relationship for me and for so many other people in this culture, but because of the experience I had of actually going to church and being in a state of very, very deep. I don't know exactly how this stuff works. I'm not in charge of it. I can't understand it. It's beyond my. It's strictly beyond my capacity. So how do you begin to kind of more respond to what's happening and seeing what, you know, the people in my church like, literally just those people, they're doing something which is clearly, from a theoretic perspective, that's exactly what it should look like. And there's something going on that is actually mysterious that I can't, could never have produced. On my note, no strategy. No strategy in principle, could figure this out, what's happening. And any effort, by the way, to do it by means of strategy definitely kills it or produces something even uglier, like a simulacrum of wholesomeness. Okay, well, I'm going to have to go from the inside out. Like, just. I don't listen, like, absorb, read the Bible, talk to Christians, like, find out what's going on here and assemble it. And then there's a certain point where I was like, oh, wow, that's it. Found it. That's the point. That's the location, which is the highest of the high. And then everything else orders out underneath that. And that's, you know, that's. That's where we end up. So in some sense, the answer is this is the logical. Logical. Yeah, logical logos. Right, the logos. Conclusion of that work with continuity every step, following every step and the pieces coming in. And there's nothing about it, from my point of view, looking back, that is of the sort of, like, I don't know, abandonment or nonsense, but rather quite the opposite. Like, this is actually the proper way of responding to the circumstances that we find ourselves in."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1106.76,"end":1131.79,"speaker":"Jonathan Pageau","text":"So when you. So when you, let's say, when you say you go to the church or you encounter these groups of Christians and you see the thing that's at the top of the stack, what is it that you're seeing? What is it that you are perceiving in their. Like, in the way that they are or the way they're interacting or the way that they're. They're. They're acting between each other?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1132.43,"end":1230.74,"speaker":"Jordan Peterson","text":"Well, okay, there's two ways of saying that, and we try the second one first. So it's the way I would describe it is being in the presence of God. The. The ability to actually notice that there's something that. That means something. Yeah. The presence of God is an experience that is something that one can notice. There's a difference between not and being in the presence of God. And for me, it actually happened. Wow. That's how interesting. In two very distinct ways. And they interface with each other. One was maybe the level of. I want to say mental, but faculties like the interior faculties, reading, thinking, talking, trying to make sense of what these concepts meant and very specifically, actually ultimately focusing on the Trinity. So really, what is this? And delving in and reading like the kind of the 300 AD, the desert fathers, and the guys who are really putting those ideas together, trying to understand what they were saying from the inside out. At the same time, going back to church and going back into house church and going back into community and going back into communion and being in the experience. That's the third. Being in the actual experience of communion. And then something happened where I. I noticed that there was a quality of capital P presence and that there was something about that quality of capital B presence that was. Well, it shifted. Right. The theoretical shifted to relational. The relational at the community level shifted into communion. That makes sense."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1230.82,"end":1231.5,"speaker":"Jonathan Pageau","text":"Yeah. Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1231.5,"end":1232.34,"speaker":"Jordan Peterson","text":"Presumably must."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1234.47,"end":1234.67,"speaker":"Richard Pageau","text":"Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1234.67,"end":1237.03,"speaker":"Jordan Peterson","text":"So that's the best I can do at this point."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1238.39,"end":1255.75,"speaker":"Jonathan Pageau","text":"On August 27th, we are going to start to ascend the mountain of purgatory, Richard and I, and continue on the second Dante class. So you can please go and sign up. You know, the first class was just an absolute blast and everybody really enjoyed it. So we're hoping that everybody will continue on the track with us."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1256.23,"end":1355.58,"speaker":"Richard Pageau","text":"And yes. So we're, as Jonathan said, we're starting August 27th. You can get the course now at Symbolic World courses. There are payment plans and everything there to make it convenient for you. It's going to be incredible. Purgatorio is actually my favorite book of the whole comedy to teach. It's the one that most people, when you're in school, you start, you. You read Inferno, and that's all you read. If. If you read Dante at all in, like, high school or college, you probably only read Inferno. Purgatory is my favorite one to teach. It's the one that is kind of, you could say, in a certain sense, the most relevant to where many of us are in our Christian life. That is to say, Purgatorio is about the purification, right? It's about the process of becoming saints. And so whereas, you know, Inferno is like, about sort of rejecting sin. And then paradise is about what is. What even is holiness. And paradise is the hardest one to teach. We are going to be doing it later this year. Paradise is the hardest one to teach, though, because it's very hard to explain to somebody exactly what it means to be holy. But I think all of us can understand what it's like to try to become holy. So, anyway, join us for Purgatorio. It's going to be really awesome. All the juicy stuff is in Inferno, you know, because, like, it's really fun to look at these centers getting their, you know, what's coming to them or whatever. But Purgatorio is, in many ways, it's the most practical because it's. It really hits us right where we're at right now. So, August 27th, folks, please, please, please come and join us for the class. You won't regret it. It'll be five amazing weeks of really getting deep into the question of what does it mean to be purified? And I think you'll enjoy it."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1355.66,"end":1356.06,"speaker":"Jordan Peterson","text":"So."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1356.46,"end":1434.97,"speaker":"Jonathan Pageau","text":"All right, we'll see you there, everybody. No, and I. I think that because I. I'm what I'm looking for, and you probably see what I'm looking for is that, you know, for people that are listening, people that are watching, you know, sometimes one of the issues we've had in the past few hundred years is that many. Much of the theological language has become debased. And so when. When we. When we say things like God or we say things like Communion, I'm not saying those things don't have a reality that, of course they do. But one of the difficulties is that it's Been cheapened by, you know, just our history and materialism and all these issues, like when we say love or we say spirit, and we use all these words. And so. Because I know you've thought. Yeah, you, you know, you. I. Because I admire the way that you see things and you. How you think of it, you know, I, you know, to me, it's. It's a good idea to get your description of that experience, like, or they get. And I think you. You explained it very clearly in talking about a shift. And the shift is, you know, in some ways, it's the shift of a. It's a shift of participation. Right. It's a shift to attention. Not just abstract attention, but attention. Like you said, the attention that you give to a child, you know, when you're caring for it, is not the same attention that you give to a problem when you're thinking about it and analyzing."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1434.97,"end":1435.33,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1435.49,"end":1435.97,"speaker":"Richard Pageau","text":"Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1436.05,"end":1442.37,"speaker":"Jonathan Pageau","text":"And that. That's a real qualitative difference that, that. That you're. That you seem to be trying to account for."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1442.69,"end":1528.92,"speaker":"Jordan Peterson","text":"Yeah, let me see if I can. I can hit on that. So as a. As a part of the process that. That kind of. I began to cultivate over the period of, say, 15 years from when the metacrisis first landed, was the recognition that there's a proper way of learning. And what I'm trying to do is I'm trying to distinguish between the thing that our education system calls learning, which, oddly enough, Derrida more or less perfectly described. It's this horizontal relationship between signifiers that are all happening, disconnected from experience, disconnected from embodied experience. And so the process of. Oh, wait, embodiment is actually more fundamental than the ability to move signs back and forth. FYI, if you happen to be listening to this right now, and you're still stuck in the mode of thinking, you understand things by virtue of doing kind of the discursive relationship between signifiers. I would like to urge you to not think that's true and actually notice that become likened to a child, meaning, learn from your experience. Reconnect a concept to something that you've actually experienced phenomenologically, like in your actual life, and then you can own it like it lands in you, and then you can begin the process of moving back up. Right? So that's the. That's the practice of embodiment, right? So. So pistis. So let's."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1528.92,"end":1529.16,"speaker":"Jonathan Pageau","text":"Let's."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1529.16,"end":1574.57,"speaker":"Jordan Peterson","text":"Let's call it renovate, resuscitate, revalorize, right? An actual word from theology. We have this word pistis, which In English is translated as faith, which in the contemporary world that Derrida thinks is actually how reality works, largely means maximally degenerate delusion. That's what the word faith sort of largely means in that. In sort of the postmodern sensibility, which is postmodernism of. Is a version of modernity, by the way, of course. But it doesn't mean that at all, right? What it actually means is embodied. The embodied form of relationship. And it's actually a cultivated thing. And you can make it very trust."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1574.57,"end":1624.22,"speaker":"Jonathan Pageau","text":"The word trust helps you understand the word faith. Trust is not. Is a. It's a relational term. It's not. It's not just like the. The belief in propositions that I don't have proof for. Right? That's not what. And so faith is something like. It's like more like a trust fall. Like you, you. You. You basically give yourself to the other in a manner that you're like, oh, I'm going to make this. It's a risk, right? There is a risk to it, but it's. But it's a risk that. And it's leading you somewhere, right? It's not just like you trust someone to lead you somewhere. That's not the same as like this idea of you have faith in someone, right? Like, not in the sense. Like, again, not in sense of just believing propositions that you can't prove which is which. A lot of people still think that that's what we can make."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1624.64,"end":1636.72,"speaker":"Jordan Peterson","text":"If you do a trust fall, let's see if they make it like a bigger tableau. The. The acrobats, right? The swinging on the trapeze, right? There's a process where the guy lets go of the girl and she flips in the air and then she puts her arms out and then she gets caught."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1636.8,"end":1637.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1637.44,"end":1741.12,"speaker":"Jordan Peterson","text":"That's a serious trust fall. That's a trust fall of significant magnitude. Well, here's the thing. If you just kind of do that with your friends and you say, like, I trust, that's not the same thing, right? That's just stupid. That's. That's foolishness. That's. That bullshit. But if you go through a process of continuing to engage in practicing more and more intense versions of this activity, starting very simply, right? Literally an actual trust fall where you just lean back and they catch you and you only fall like a foot, but you begin to notice with them, right, in the category of the relationship and think about the relationship as having an identity that is not just, you know, how do you say, ephemeral but it's actually you're cultivating the relationship. The relationship is beginning to build a, an embodiment, a reality, a capacity city that is stronger and stronger and stronger. And so of course, the three people, the two guys catching in the girl being thrown, they practice and they practice and they practice lower and lower, like small, big, and finally get to the point where the strength of their faith, right, the reality, the, the, the, the capacity of their relationship can hold this possibility. And then it happens. And so that's the, the notion is, okay, that's what we're called to, that's the, that's the thing that is actually underlying our ability to do these sort of higher order activities is we have to cultivate a relationship. Now you and I can cultivate a relationship and we'll begin to build something like faith. Now what's the highest? Well, the highest is what does it mean to build, cultivate a relationship with God, right, with the Triune God. And the beauty of the Triune God is the Triune God is relational and endeavoring continuously with maximum commitment and sophistication to cultivate a relationship with us and so that otherwise we'd be in deep trouble."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1741.92,"end":1832.01,"speaker":"Jonathan Pageau","text":"So what you're saying, I mean, I think that it's so interesting what you're saying, like, and also it makes me think out how the, the difficulty of the atheist position in the sense that that's like just one of the things that seems to, to happen is that if we understand the infinite, right, as something else than a relational thing, right? If we understand the source of reality as something else than relational, in one of the, one of the problems that happens, and this is the argument that people would set against you is to say the relational, it's idiosyncratic and it's subjective and cannot be trusted because it's not based on, it's not based on truth, it's based on feelings, it's based on, on experience, which can be, which can be diluted. All of these, these things are the, the argument against what you're saying. So like, if you engage in, if you, if you talk about this mode, this modal being, like this, this mode of being where you're entering into communion with others and you're building a body basically through trust and all of this, and you say it's phenomenological, a lot of people will say, well, that means that it's idiosyncratic, that it's not that it can't be trusted because it's just subjective, right? All of these terms Obviously, I don't think that, but how would you answer someone who brings that up?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":1832.33,"end":2008.71,"speaker":"Jordan Peterson","text":"Well, hold on. Neat. So I think that we're actually entering into a moment, like in our. In this hyper conversation, where we're almost, like, doing microsurgery. We have to really be careful zooming in on things. I noticed that. I had a long conversation with Jim Rudd about the Trinity. And what I realized is that we actually hadn't cultivated the capacity to really zoom in at the right level. I noticed it when I was actually watching your conversation, I think, last week with Bishop Barron, talking about fractals and how fractal orders, you can zoom in and out at levels of scale. And the point is, there's a point at that level of scale where you actually get to a. Well, a level of subtlety that's very difficult to hold in your mind. And that's where we are. We have to get to that level of subtlety. So the first answer would be something like, first, I'll make an argument that trust is strictly upstream of truth. And one of the things I'll do is a second proposition. Memory is a spiritual act. So two plus two equals four. You know, does that sound true? How do you know that what's actually happening inside your mind, and by the way, inside your neurology, if you'd like, that allows you to have the sensation, the feeling that that particular construct, for example, isn't just nonsense? Yeah, it seems sensible. Deloitte Logic du Songs, he actually zooms in on that zone. Like, what's the point where you have the experience, the phenomenological experience, that you are in relationship with something that's of the category sense, not nonsense. And it moves from the category of sense to this version, this subset of sense called truth. I hate to. Hate to break it to you guys, all of that is in the category of trust. You are trusting, for example, your memory. You're trusting a series of basic feeling faculties that you have that allows you to orient towards this domain where you can say truth. And that's the point. Like right there. We can get in that little piece and really, like, literally just do. You can do it meditatively. What does it feel like that makes you able to distinguish between an assertion? 2 + 2 equals 5, 2 + equals 4. How do you get that distinction? You can go. You go all the way down as light as you want to get at the level of logic, at the level of the construct, and notice that there's a quality of feeling that strictly precedes the ability to have a conviction at the level of truth. Right. That's just the order of how things operate. Beauty precedes truth. And for. Not so psychophenomenologically like, if you want to look at it as an atheist, if you can do the really hard work as an atheist of actually being in a first person experience. And I'm not kidding at all, by the way, because the primary thing that happens with an atheist is you can't help but obligately try to be in the third person experience."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2009.26,"end":2009.5,"speaker":"Jonathan Pageau","text":"Sure."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2009.74,"end":2078.72,"speaker":"Jordan Peterson","text":"And that's the problem. Like that's actually the. Oh, that's where the rest of where things fall apart is that you have this weird thing that their default mode is third person, which means that first person things are occluded or mysterious, which, which is how you can get to these absurd constructions that like consciousness or free will doesn't exist. Well, of course, if you're, if you're obligate third person, then everything you've already pre. You've already sort of. You reach the. You draw the conclusion by your premise, your epistemological stance of third person. The things that are intrinsically first person aren't part of that. And so you're stuck. But the point is you can come here, you can be in the first person. You can notice that you have experiences and sort of contemplate them deeply from that point of view. And what you'll notice is 100% of that which you are able to identify as true in any fashion is by means of a first person set of faculties that we will categorize as feelings. Now we may need to go through a process of valorizing feelings because we don't mean. How do I say this right? We certainly don't mean the willy nilly emotions."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2079.52,"end":2099.18,"speaker":"Jonathan Pageau","text":"That's right. I think that we need to not confuse it with emotion. Insight is not an emotion. The same. The same way that you get from eating like a good piece of cake. It's not pleasure, it's not pain. Insight is, is. It is related to pleasure to some extent, but it's a different type of experience."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2100.62,"end":2252.42,"speaker":"Jordan Peterson","text":"Yeah. The weird thing is it's actually part of the incarnation of the second person. That's what's happening. How is it right now that I have some capability of mapping the notions or these things that are ideas into words in English in an order and selecting a vocabulary that has this capacity to be transmitted to you so that you can actually be in the same space mentally as I am? Like, how's that part of reality at all like that. How does that even. We don't have a way of describing how that's part of reality. Unless we decide to remove the ideas in the first place, in which case we're back to AI chatbots. Right. So going back to that point, but we're pretty confidently not AI chatbots. Like I'm the degree which I'm confident in that is actually 100% more confident than I am on, than the opposite. Okay, well, there's something going on there. That thing going on there, that, that set of faculties which are part of what we are intrinsically, that's the basis. So that's the argument. Right. That's the place. That's where this conversation, say with the atheists or anybody else, we have to get down to the level of being able to have that level of precision in first person, third person trust, truth, mind expression, these are very precise things. We have to notice what we're doing. I mean, I'll give you another example that it's a little bit esoteric, but it worked for me. I was having my conversation with Jim and we were talking about the way that the Trinity by its very nature is of the transcendent I, in this case eternal. And that time, specifically chronological time, is, how do I say, derivative. Like it's a second order. There's a whole bunch of stuff that happens. Like how. Okay, well how does, how can you move from eternal to chronological? Well, you can't do it chronologically. That can't be how it works. And then I listened to another conversation he had with Stuart Kaufman, who's a lovely individual. Stuart's a Santa Fe Institute, like polymathic genius in the sciences, and they were riffing on a very scientific way of thinking about the origin of space time. Yeah. But the problem is when I was listening to it and I don't know exactly where they were off, you know, off tape, but every time they spoke about the origin of space time. I'll just focus on the timepiece, the imported temporality, the imported causation conception. Right. Well, hold on, where'd that come from? We haven't got time yet."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2252.42,"end":2252.82,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2253.14,"end":2260.74,"speaker":"Jordan Peterson","text":"So what does it mean to be thinking about the relationship between the eternal and the temporal? Yeah, you gotta, there's, that's. You gotta get in between there if you want to be able to do it."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2260.82,"end":2262.58,"speaker":"Jonathan Pageau","text":"Every time somebody talks about the big bang."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2262.58,"end":2263.14,"speaker":"Richard Pageau","text":"I can't."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2263.14,"end":2289.91,"speaker":"Jonathan Pageau","text":"I can't but roll my eyes anymore. I just really struggle because it's so difficult for people to, to understand that. Exactly. The notion that You. If you use analogies of space time to talk about the origin of space time, you have to be very cautious in at least acknowledging that you're using analogy when you're doing it, but when you don't, then it becomes this weird thing where it's like a kind of blind spot."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2290.39,"end":2312.71,"speaker":"Jordan Peterson","text":"Yeah. It is, in fact, a conceptual blind spot, because your mind grabs these concepts intuitively and then uses them to produce themselves. And then you'll end up with a paradox and wait. But it's not a necessary. How do I say it? Right. There's a way of actually thinking about this properly, which of course means that at a certain point, you stop thinking and you begin relating."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2313.2,"end":2313.44,"speaker":"Richard Pageau","text":"And."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2313.92,"end":2381.69,"speaker":"Jordan Peterson","text":"And that's the deeper substrate. You know, Pistis is strictly more fundamental than episteme. This is, you know, Plato brought them out, but he had. He had them reversed, which is a part of the long air. Right. Episteme is all well and good, don't get me wrong. We need. It's great to have, but it sits on top of the substrate of PCs, which is much, much larger. And conventionally, that's very easy. Like, if you talk to somebody who is a master of some skill and you say, can you explain to me how you do that? Yeah, they can kind of explain it to you. But if you think about it like, the thing that they can explain is about that why, and the thing they're actually doing is that why. And the right answer is kind of no, you just have to do it. I can do it with you and maybe walk you through a set of stages that get you from where you are to where you want to go. We can put you on a path to mastery. But I can't explain it to you because it's much bigger than explanation as a category. That's the idea. The ontology of faith is a different order than the epistemology as a category. And that's where we are. Like, that's the. That's reality. And if you can't get that, then you're stuck at that point."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2381.77,"end":2444.56,"speaker":"Jonathan Pageau","text":"So how. Okay, so how do you deal with the problem of. Of. Of delusion or the problem of. Because, let's say you have groups, even in a person or in a group that will have faith in the wrong thing. Right. That way. And because of that, then the. The consequences, you know, will manifest themselves. Like if you. If you trust the wrong person, you buy the wrong car. Right. I mean, there's a. There's a really boring. A really kind of mundane versions of it where you Know, you, you trust someone you shouldn't be trusting or whatever. But you could scale that, right. And understand that you could have something like false religions, right. Or people that gather together in the name of something which is not the right thing. And they. They're engaging all the mechanisms of trust and faith. But there's something which is leading it awry and ends with, you know, drinking the Kool Aid, you know, something like that. I mean, that's an excessive one, but there are. There are less destructive versions of that, let's say."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2444.56,"end":2605.04,"speaker":"Jordan Peterson","text":"Totally. Yeah. So, golly, the way. The way that I've really thought about this, and I'm not sure if this is helpful to anybody, is that the way that shows up, categorically, the way it constantly shows up is when we replace faith with a simulacrum of faith generated by epistemology, or in this case, let's use the simpler term, ideology. So what happens is we aren't actually able to be in relationship by virtue of having cultivated our relational competence and. Or we've just been turned upside entirely by an absolutely degenerate culture. But. And we get this notion that the right way of doing it is to try to model it in our minds and produce a mental construct that allows us to imagine that we are now masters of this event. And then we get. We'll get stuck there. And so let me see if I can give you some examples of what that looks like or how. Oh, yeah, this is nice. So, like a very simple one. This is actually, weirdly enough, this is actually a really good example. If you're dealing with kids in the ages of like, five and six and they're beginning to ride a bike. Yeah. What you'll notice is they'll tell a lot of stories about how they can ride the bike and how they're going to be riding the bike, but they cannot yet actually ride a bike. And as an adult, you're looking at them going, yeah, telling the story isn't the same thing as actually doing the thing. But until you actually get on the bike and try to ride it, it's really easy to tell yourself a story because it's a lot easier and you feel a lot more comfortable. The story is, yeah, I can ride the bike and I'm going to do. You get on the bike and you fall. Right. So the reality of engaging with reality is a different kind of thing than the thing that happens when I can tell the story and living in the narrative. And so let me now do some. We're going to split a Couple of different pieces here. A lot of stuff. So one is, the more you live in a culture where engagement with reality is prior to the social or the theoretic layer, the less the problem you raised is a real problem. Because the checksum of smacking into reality orients you towards, oh, yeah, that's right, I can't actually ride a bike. It turns out I need to learn how to ride a bike. You get what I'm saying? But the more you live in a culture where your experience with reality is mediated by social environments where telling the story is good enough or even maybe better. So an example would be, do you know how to fix a leak in your. In your plumbing? Well, if you live out in the country and there's nobody to call, the answer is yes or no in a very clear fashion. You need to fix it or you don't. You try to fix it. If it doesn't work, doesn't. Doesn't work."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2605.04,"end":2605.4,"speaker":"Richard Pageau","text":"Right."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2605.72,"end":2622.11,"speaker":"Jordan Peterson","text":"If you live in the suburbs, how do you solve that problem? Well, you call a plumber. Do you know how to. As a kid watching that, do you know how to fix a leak? Well, the answer is yeah. You call a plumber, do you know how to fix a leak? No, as it turns out, not at all. If you live in the city, you don't even call the plumber, right? You call the super."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2622.19,"end":2622.55,"speaker":"Richard Pageau","text":"Right."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2622.55,"end":2896.27,"speaker":"Jordan Peterson","text":"You're so distant from concrete reality that you live like in yourself. Somebody asked you, well, do you know how to fix a leak? You may even in your mind have a sense. The answer is yes, because the, the agency is, I have a problem. I can solve that problem. Oh, well, how do you solve the problem? By virtue of your competence and relationship with, with the ground reality? No, at the end of the day, my ability to manipulate other people by means of narrative. Right. So that's one, four work very important, right. When we live in the world that we live in, where particularly people who live in cities have very little actual relationship with ground reality and their stock and trade. And the way of navigating success is by means of being able to manipulate symbols and manipulate human social relationships, you're going to get into a problem where is very difficult to prove that it's. And so therefore it becomes gold. It becomes a fabric of actually being able to at least be perceived as being successful. The other side is, let me see if I can get there. So the distinction between certainty and, let's go with confidence isn't quite right, but actually competence is nice. So what happens is this. Imagine a Group of people. Let's actually go way back. So let's imagine an indigenous group of people who are living in a valley. And they've lived in a valley for as long as anybody remembers who's alive. Actually use it. A very specific story from Tyson Yunkaporta. So we're actually in Australia, and there's been a drought. And the drought is actually longer than almost anybody remembers, except for like, two or three very old people, like the oldest of the old. And there's a point where the oldest of the old go, guys, look, I know it's super risky for us to leave this valley. None of you even have any experience of that. But I remember when I was a kid, there was a drought that was terrible. And the old people told us then that we needed to leave the valley and go to this other place. And I remember it enough that I can lead us there. It's going to be risky, but it's the right thing to do, right? So that's a mature relationship with the fact that we can't actually control reality with precision. And the notion of certainty is actually not a real thing in the context of complex reality. But we can have the best that we can get. So what do the old people do? Well, they get together and they talk, and they compare notes and they say, okay, hold on. You remember? Yeah, I remember that. Okay, with this, the stars. Yeah, I remember. Oh, yeah. And the weather. And they build a. A gathering. They gather, and in their gathering, they. They deposit the. The highest level of wisdom that they can deposit in their individual and collective capacity. And then the group makes decisions on that basis. That's the reality of how we actually do this, how humans do this kind of thing ever. You're not going to escape that. You're never going to be able to have something like mathematical precision on complex reality. Okay, fair enough. But what happens when everybody's an immature adolescent? What happens when your culture doesn't produce grownups? What happens? The only thing your culture produces is very bright adolescence. Well, then you're in real trouble, because nobody actually has depth of maturity. Nobody actually has wisdom. Nobody actually has experience in complex reality. And what they do have is they do have, for example, the ability to formulate pithy phrases with. With incisive sarcasm, or to grab pieces of. Of other people's work and assemble it in ways that show that are shiny and impressive. I actually called this simulated thinking in a rescue an essay I wrote many years ago. Well, now you're. Now you're in real trouble because you're still facing issues of risk. And what you do is you think that you can actually produce something using the simulated thinking, using the kinds of stuff that you'll get you an A plus on a paper. The kinds of stuff that will get you, we call it, elevated to a VP inside a Fortune 500 company, which, by the way, has nothing to do with actually effectively managing and stewarding the responsibilities of that company in the world. And everything to do with being good at politics. And therefore, you get concerned. You get concerned that, wait, this thing called wisdom, this thing called making good choices is actually not even a thing. And what I need to do is I need to have some way of being sure that I'm not being bamboozled by politicians or by my own bullshit. Does that make sense, what I'm saying? Yeah, yeah, yeah, yeah. So this is, this, this is like a, the, the, the issue that you're raising, which is a serious issue, happens to do with the fact that we're very, very far away from the reality of what it is like to just have an embodied experience of wisdom in relationship with complex choices."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":2896.43,"end":3038.46,"speaker":"Jonathan Pageau","text":"Okay, so let's take, you know, let's, let's, let's take. Because we're, we talk, we started the conversation, talk about, about Christianity becoming a Christian. So we have Christianity, we have this situation which is that we're dealing with an event that happened 2,000 years ago, right? And we have a book, and then we also have traditions, and we have ways of doing things which to some extent could be described or expressed as this remove that you're talking about, which is an issue, right? It's like we have an account of someone that lived a very long time ago. And then we have accounts, you know, people who followed their teaching, but then, you know, and those teaching produce fruit in their life. But that's what we have. We have these accounts. And though here we are now in the modern world and we have, you know, let's say thousands of churches in, in North America, how do we, okay, so how do we navigate that? The problem, the problem of, on the one hand, wanting to connect to that, right? To the resurrection of Christ, to the story of Christ, to his teaching, and then living, living today, right? In, in the way that you're talking about, which is the, the desire to cultivate wisdom, to live true communion, to do that. Like, how do we find the. Because you'll find, like I'll give you two extremes, right? Just to give you an example. Like, so you'll have the Bible tells you so people, right? Or not just Bibles fathers tell you so, like in the Orthodox Church, it'll be similar to Bible tells you so. Like this is what the fathers say. This is it. Like, this is the thing. If the Bible says it, that's true. Just, just believe it. And it doesn't matter if you, and then if you believe it, basically you're saved or something like that. Right. If you, if you trust the, if you trust these guys and you kind of believe what they said, then you're saved. You know, the other excess. Excess of that would be something like, you know, what, what's. What the Bible says or what the fathers say, what the traditions are with the theologies, doesn't matter. As long as you're nice and you like people, you kind of love people and you're a good person, you know, that's enough. Right. And so that I'm giving to you a caricature, obviously, but how do you see that we can navigate in that, man. Real. Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3038.46,"end":3290.62,"speaker":"Jordan Peterson","text":"Well, so let me put. Take both of those, right? And here's what it says that those are both adolescent. That's the point. Those are both just straight up adolescent. That's, that's. And the answer. Oh, there's a, there's a verticality here called maturity. And those are, they're just completely different categories. So, I mean, I've been having this conversation now recently in the context of our church because, you know, imagine you're, you're talking with a teenage boy. He's like in that 15, 16 zone. Yeah. And he still is thinking about the choices he's making on the basis of, is he going to get into trouble? The father says, the book says, the rules say whatever. You could do the same thing on the other side. The point is, that ain't the right way to think about it, but the right way to think about it, is it right. Well, how do you know that it's right? Well, the book said. No, no, no, no, no. You know, it's right because you've lived life. You've got these, these patterns that are around you to help you make sense of what's happening. But the first thing is you touch and it was hot. And then second, you said, oh, hot, Right. Not the other way around. If you do it the other way around, you don't actually, you don't know anything. Somebody says, don't touch it, it's hot. Don't touch it, it's hot. As a rule, you're wearing these rules in your head like a computer, and then you have this Problem of constantly and now analyzing reality. Oh, is that what is hot? Is what is hot actually kind of. I don't know, but I know if I touch it, it's bad. Like that kind of stuff. That's rule following. No, no, the point is you have to cultivate wisdom. If you touch the hot thing, you know what hot is and you know why hot's bad. And then you can map that, and now you can use that. So the idea is you have to actually cultivate embodied experience. You have to cultivate faith, or you have to live life and you have to suffer. Like, you have to actually make big mistakes, and you have to have integrated those big mistakes into a deeper relationship with what freaking thing is, what life is and how it works. This is these. These are the elders I was talking about, right? They're not just olders. Let's make that distinction. It's not just because somebody's old elder means you have suffered enormously direct contact with the complexity of life and have metabolized that into a capacity to be in more relationship, more intimate relationship with reality. And that's the difference between these two. And so, you know, when you look at the, the, you know, the fathers say, well, who are they? Well, they were guys who were up here, and what they said is true. But until you can connect it to something that you can actually own in your own experience, you don't have Pistis. You have knowledge, and knowledge isn't going to do you much good in reality. Pistis will do you great in reality. And that, I think, is the real pivot that we have to make is to say, look, we cannot be saved from suffering. That's not how it works. In fact, as Christians, we kind of recognize that if we're, if we're told to follow me, we know where following me leads. I cannot be saved from suffering. We're choosing to enter into that reality. That's the reality we're entering into. But one of the aspects of suffering is that it's not. It's not a bug, and it's not that there's, you know, the problem of suffering is not the problem. The problem maybe is meaningless suffering or suffering. We don't actually put it to proper use. That's a problem, but that's how you do it. Or the reality is you have to actually just live life. You have to notice that your. Your experience is rich. Your experiences is across a diversity of things. And by the way, now, in relationship with other people, have you noticed that other people have different experiences than you and sometimes their experience has a wisdom and insight that is deeply gives you a new perspective than yours does. That's what it means to be in communion, is to have the ability to have a coherent relationship with other people's perspective. And I'll say this in a very nerdy way, which increases your capacity to have a mature relationship with reality geometrically. So that's how you do it. So when somebody comes and kind of tries to sell you ideology or try to sell you bullshit, if you are operating from an adolescent point of view, you're in deep trouble. You're an easy mark. If you're operating in a mature point of view, you're immediately going to be noticing the difference between bullshit and reality. And if you're in communion with a group of people who are operating from a mature point of view, your immune system to bullshit gets stronger and stronger and stronger. And your ability to actually navigate complex reality, always risky, gets stronger and stronger and stronger. And that's it. That's as good as you can get."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3290.78,"end":3404.28,"speaker":"Jonathan Pageau","text":"Yeah, yeah. I think, I think what you're saying, it rings a lot of bells to me in the, you know, because one of the things that's important, for example, in the. In the orthodox tradition is the idea of the living saints, right? That we kind of live downstream from people that are alive and have reached that highest pinnacle of transformation and of, you know, and that even though some of some people will have direct access to them, you know, it's like you people are always looking to have at least secondary access to these, to this wisdom, right? It's like, okay, so I haven't talked to the actual elder, but he's alive now, and he said this. So if he's saying this today, it means that it has. There's something about that relevant to our world now because it's not just something that someone recounted from thousands of years ago, like, how do I connect to that? So there's that aspect which I think is real, and then there's also the reality, for example, of. Of. Of the reality of confession and communion, right? It's like that whatever theoretical idea you have about religion, it's like when you go to confession, you know, that gets smacked out of you because it's like, you know, it. It gets down to the dumbest things and to the dumbest thoughts and to the. And to the most embarrassing moments and to, like, humiliating things. And it's. There's nothing you can have all the lofty thoughts you want about the Trinity, for example, but, you know, but that moment when you lied just to impress this other person, and there was absolutely no reason, like, it actually didn't bring anything, like, to your life, except for this little moment of, like, just being a little. Yeah. And then you. And you're like, what the hell? You go to confession. You have to say that it's like, at least for me, you know, that that's the kind of smackdown that has, like, hopefully brings you slowly towards wisdom and towards a real embodied practice of this. Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3404.28,"end":3431.56,"speaker":"Jordan Peterson","text":"And by the way, if you wanted to kind of do the test, get. Get a bunch of people who are, like, at the highest level right now in developmental psychology, educational theory, and I mean, like, real practitioners, people who are really, really good at that. Is it design what an optimal learning environment looks like? It turns out they're going to design something that looks an awful lot like the best practices inside the Christian church. Confession is going to be there. But confession is a very specific kind of thing, Right. It's in a context of communion, right?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3431.56,"end":3433.76,"speaker":"Jonathan Pageau","text":"Yeah, of course. It has to be, or else it's very dangerous."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3433.76,"end":3459.81,"speaker":"Jordan Peterson","text":"Or it's very dangerous. Exactly. So nowadays they would call it a safe space. Well, yeah. Safe space is a simulacrum of communion, which you're actually saying is communion. And there's something so much more profound and deeper in. In complex reality and in relationship to the transcendent that's in communion, that this simulacrum that you produce called safe space is demonic. It's actually perfectly terrible, and it creates exactly the wrong results. Unless, by the way, that's your intent."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3461.17,"end":3471.21,"speaker":"Jonathan Pageau","text":"So. Yeah, because confession has a safety to it in the sense that, you know, that the priest is bound to secrecy and all of that, but it's not a safe space because he's got."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3471.21,"end":3471.73,"speaker":"Jordan Peterson","text":"He's."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3471.89,"end":3472.53,"speaker":"Richard Pageau","text":"He can."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3472.61,"end":3498.41,"speaker":"Jonathan Pageau","text":"He can kind of smack you around a little bit and say, you know, and make. And make you understand that it's not. It's a safe space, but it's a space that's geared towards transformation, not to coddle you and to make you feel like, you know. Although I had confessors once a while that were too nice, where I was like, oh, it's okay. You know, God loves you. And I'm like, I'm not sure I want to hear this. I, you know, I need. I need to be tightened a little bit so that I re. I redirect my, you know, my aim, let's say."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3498.41,"end":3503.09,"speaker":"Jordan Peterson","text":"Yeah, safe. He's a lion. He's not safe. Good, but not safe."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3503.17,"end":3504.29,"speaker":"Jonathan Pageau","text":"Exactly, exactly."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3504.29,"end":3519.79,"speaker":"Jordan Peterson","text":"Exactly. Yeah. And that's like so back to good parenting. And same thing, the same category. What's a good parenting context, which is of course a learning context. That's the point of parenting, right. Is to cultivate these individuals you happen to have a very particular relationship with as. As a steward of. Of."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3521.39,"end":3531.07,"speaker":"Jonathan Pageau","text":"So here we are. Like, we're here, you know, like, I'm a Christian youtuber for all intents and purposes. Hopefully I'm more than that. But let's, you know, that's a reality, which is that, you know, we make."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3531.15,"end":3535.97,"speaker":"Jordan Peterson","text":"Increasingly, by the way, in the. In the pocket square phase of being a Christian YouTuber."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3536.21,"end":3536.89,"speaker":"Jonathan Pageau","text":"The what?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3536.89,"end":3540.29,"speaker":"Jordan Peterson","text":"The pocket square phase, Right, The. The high production value."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3540.45,"end":3599.02,"speaker":"Jonathan Pageau","text":"Right, yeah, yeah, yeah. And so the, and so that's a reality that's there. Right. And the same with this, like, this conversation. The same with, you know, for example, the education moving online. How do you. How do you see us finding some. A way to, let's say, use a technology? Because we, if we. I, I can't deny that this technology has been useful to some extent. Like, it definitely is. It is in some ways a little trail that helps people find their way back, but it's clearly not sufficient. And it's also very dangerous because, you know, you can have people who just sit in their basement watching YouTube videos feel like they're. That they're. That they're up here, when in fact, you know, not the. It's all up in their mind. And so how do we. I mean, I don't know if you have a solution to this, but, like, have you thought a little bit about how can we find ways to bridge those worlds?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3599.1,"end":3847.46,"speaker":"Jordan Peterson","text":"Yeah, I mean, I have. I have thought about it for sure, tremendously, even to the point, let's put it this way, in somewhere around, I guess, 2018, the theory was now demanding that the moment of theory was over and the only available next move was the moment of embodiment. So practice. Yeah, so. And this is kind of what you're saying, hey, if all you're doing is consuming YouTubes, what I'd like to say is that the point of every YouTube video consumed that is vaguely pointing you towards the truth is telling you to go outside and do something besides consume YouTube videos, there's a terminal point where that's the only signal that's actually in all of them. And remember, there's a discernment vector. Many of them are actually saying, no, no, keep watching YouTube videos. That's diabolical. So don't do that. And everything that's not diabolical. What it's telling you to go out and actually engage in complex life. So in some sense the question is a little bit simple and it's just, what's it like to live a wholesome life? What are the ingredients of living a wholesome life? But your kind of time management, what's your attention allocation function? And the answer would be sort of like, okay, first prayer first. Are you actually allocating your time to your relationship with God and how much like a decent chunk. It's got to be a pretty solid chunk and in the right order. You know, when you wake up in the morning, what comes first? Phone, Twitter, even. Even a really nice, sweet Jonathan Paggio YouTube video. Or, or is, are you actually, you know, having a relationship with God? Are you reading scripture? Are you praying? Right? So the order matters. So time matters and order matters. And then, okay, how much time are you spending in your body, in life? Are you going outside? Are you engaging with other human beings in your community, in physical relationship, in events that matter with stake? Right? In some sense it's crazy simple. Do the thing that ordinary, like an ordinary wise person would just say, have a wife, raise kids, spend time with your wife and kids, care about them, care about how their lives go, you know, which is the thing is it's crazy simple. And just like dieting in our contemporary culture is super hard, my wife and I have a continuous process of frustration and surprise at the fact that we know prioritizing our relationship is important. And yet when we do like a monthly audit of how much time did we actually spend together, like, man, we're not actually living according to our values. We've clarified our values. We've identified what we think the hierarchy of values actually is. And then we don't live that way. And then of course, we read Paul. Paul's like, yeah, yeah, I get it. That's how it works. So that's starts with God and then the very second thing after that. Are your actual lived relationships in a concentric circle with your, you know, your, your wife in this, in this case, and your kids and then you, the closer friends, usually in your church, as a very helpful, like, you get a synergy value out of that. Like if you're time with your wife and you and your wife are also in relationship with God, then that you. Now you're, you're not having a double, you know, it's simplifies, right? It makes things smoother. Same thing with your kids, right? Same thing with your friends and your community. And this is kind of the monastery sensibility. And you engage with complex reality, man. Like fix things with your hands. Like deal with plumbing and deal with your change. Your car's oil. And I don't mean this because you're saving money. I mean, that's a practice. Like, it's there. It's. It's how you cultivate peaceties. And notice the. That there's something deeply, deeply theological about the fine art of carpentry. There's deeply, deeply theological about actually learning how to fish and noticing that you can't bullshit yourself into fishing. And the more you learn the skillfulness of the distinction of what requires competence and what can be bullshitted, the more discernment you have about that distinction in general. And more people you notice than other people who have that distinction. And you begin to form relationships with people who have that distinction. You notice that something stronger happens. So just, we have to live our way into that. And the core discipline is just that ability to know what is the right order of values and how terribly am I not living in accordance with my own values."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3847.86,"end":3884.93,"speaker":"Jonathan Pageau","text":"Yeah, makes sense. It makes. Makes a lot of sense, you know, and I'm leaving with a lesson, too. It's like, we know it, but we don't. Like you said, we don't always do it in the right way because, I mean. And in some ways it is. There's an illusion that we have, like, the fires go, start burning, and then you start to pay attention to all these fires, and you don't realize, you know, that the reason why you should care about the emergencies that are kind of popping up, you know, they're more important than those emergencies, even though the emergencies are screaming, you know, that there's a kind of emptiness to."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3884.93,"end":3885.25,"speaker":"Jordan Peterson","text":"To."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3885.25,"end":3911.64,"speaker":"Jonathan Pageau","text":"I mean, I say that, but I mean, the past few months of my life have been like, just this. Nonstop fires, right? Like, just like all these things. Things that are happening that you have to take care of. And then you start to forget the. Like you said, the core. Right? The core of saying. Well, it's like, you know, actually, what is it that I actually care about and I. The relationship with my family. Like you said, the relationship with God. And so why. Why am I just paying attention to all these fires? But it's a tough one. It's hard to do well."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":3911.8,"end":4073,"speaker":"Jordan Peterson","text":"So I'm seeing, like, three different things that come out of that that it's maybe useful to tease out. Two of them are very similar, and I see this a lot, particularly maybe in the world that includes both of us. So one is. I call it the philanthropists. Deception. So the philanthropist deception is the devil on your shoulder who says it's okay to not live according to your values all the time, because there's a way to buy your way back into them. Basically, don't actually have all of your choices be in alignment with your values. It's okay to have some of your choices be extractive and maybe lie to people or deceive or manipulate so you can make more money. And then you can take that money, you can put that into this really, really good thing. Like, super good. And if you add them together, good. Just went up. You actually have a net. Net increasing. Good. Yeah. And this is extremely subtle. I was actually talking to my pastor about this, and he had this experience where he had put some money into an investment and the investment was doing really well. And what happens, right, The. The devil on his shoulder, who's wearing, like an angel's costume, goes, man, you're going to be able to really support missions. Yeah, you're going to. You're. You're going to, like, so many good things you'll be able to do with this. And that's how it gets you. It has to sneak in and a little flash of like a Lamborghini or just. Just a little bit. Oh, no, no, not Lamborghinis. I'm a. You know, I'm going to. I'm going to pay for starving orphans. But that's one. Right? So that's one trick. Same trick happens over here at the level of fires. If you've identified. How do you say it? Doing good work in the context of, you know, I. I have responsibilities. Like, these are important things I got to take care of. And maybe I'm unique in the world being able to actually take care of these problems. And it could be a small problem. Like, it could be really practical. There's a. An oil fire in my kitchen. Well, I'm the one who has to put it out. That's a real fire. But it could also be like, oh, my gosh, like civilization's falling apart. Fill in the blank. You know, somebody says something really wrong on the Internet, I gotta deal with that immediately. And of course, that's the same thing. Right. The problem is who's making that choice? How do you know whether or not that's actually your cross or if it's somebody else's cross that you're racing to strap yourself too? Right. And that's subtle in the level of where the. I guess that'd be Luciferian. The Luciferian sense of temptation. Temptation is the exact Inverse of communion and temptation. If it gets you just right. It's tricky. The whole point is that it's tricky and you really, really think you're doing the right thing. That's the point. Like the. The stupid temptation if I'm going to eat, you know, whatever, you know, 50 donuts and get sick. Fair enough. But the point is, there's a really."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4073.32,"end":4138.57,"speaker":"Jonathan Pageau","text":"Those aren't the worst ones. Like you said, the Luciferian temptations of. Your point is great, you know, to think like, oh, I have to take care of this because, you know, like, I'm so special, you know, and that, you know, and this, this, like you said, the guy getting aimed at the Internet, that's a. That's such a perfect example because, like, you know, I mean, I definitely found myself, you know, let's say, paying way too much attention, you know, to that type of stuff and realize, hopefully, yeah, some. Hopefully at some point realizing that, you know, what does it matter? Like, it doesn't really. And all of the. A lot of the. Especially, like the news cycle stuff, a lot of it is just flash in the pan stuff that we won't remember three months from now. And we've spent so much attention focusing on all these scandals and all of these things, and this, especially during the American election year, it's crazy. Like, going on Twitter is like, it'll drag you into hell really fast, and it just. And then it just captures you and you. And you realize that you've spent an hour scrolling down Twitter, and it's like that hour could have been spent in far more useful things, you know?"}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4139.93,"end":4140.81,"speaker":"Jordan Peterson","text":"Including nothing."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4141.29,"end":4143.45,"speaker":"Jonathan Pageau","text":"Including nothing. Exactly."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4143.61,"end":4161.19,"speaker":"Jordan Peterson","text":"Well, you know, it's funny. So as a practice, I actually tried to cultivate noticing aesthetically the difference between the for you tab and the following tab. Right. Because you can tell if you pay attention, the for you tab is palpably Luciferian."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4161.19,"end":4161.91,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4162.07,"end":4168.23,"speaker":"Jordan Peterson","text":"And palpably. And you're like, wait a minute, man, that tastes. Oh, I'm in the for you tab. Click."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4169.03,"end":4174.55,"speaker":"Jonathan Pageau","text":"But they also switch you over, I think, like, without you all the time. Yeah, you switch over to the for you tab. You don't even know that."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4175.44,"end":4175.64,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4175.64,"end":4178.08,"speaker":"Jonathan Pageau","text":"Why am I seeing all this stuff? Like, you know, it gets."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4178.24,"end":4309.69,"speaker":"Jordan Peterson","text":"Yeah. Okay, so this thing goes to the piece that's the top of that pyramid with regard to the fires. Because then there's. There's some fires that you're actually supposed to deal with. Yeah, right. The point is you're actually here for a purpose. And. Okay, so how do you discern that? And how do you notice, for example, that oftentimes the struggling with the fire is the purpose. It's not the putting the fire out that was the thing. It's actually your engagement with the choice, is this mine or not? And the cultivation of competence in relation, which could be very complex competence, the grief of recognizing that you got drawn into something and it separated you from your kids, and now they've got like a ripple in their experience that is going to be with them forever or, you know, the dealing with that and healing, that's going to be real challenge. Okay. And this is a complex thing, man. Reality is so far beyond our capacity. It's really critical to grasp that, like, you cannot master this thing. Thing at all. Not even a little bit. And. Okay, and this. Now we come back to the kind of the Christian discipline at the center. It is actually at the center is to recognize the degree to which you have no idea what's going on. You have no ability to actually plan properly how to engage with this thing. Well, right. You could do like, you've been given a very specific amount of agency and it's not much. And you can do a little bit. Yeah, you can. You can probably make eggs. You can. You can maybe drive your kid to school without getting in a wreck or that's like, okay, beyond like, literally that level, and I'm being facetious, but beyond that level, if you think you've got a handle on things beyond that, you're actually getting yourself further and further away from reality. Oh, but. But glory is. It turns out that God's right there and that there's actually an entire thing that's helping you. And if you just learn how to build faith, like, to learn how to let go of that first person and flip through the air, there is another person on the other side that's going to grab your hands. Now you got to build that competence of being in relationship with the actual infinite, which is specifically here to help, not help you, to guide you and navigate you for big capital P purposes through complex reality. That's the. You know, that's the kind of the. Was that. That's a version of the gospel. Right. Right in the middle of that spear in the center."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4310.4,"end":4377.55,"speaker":"Jonathan Pageau","text":"That's amazing. That's amazing. It's amazing. Jordan, listen, I think we've come to the end of our conversation. I want to just express that I've been finding a lot of joy in seeing your journey and seeing your path and the things that you're talking about. I remember when I first encountered your work, you were often trying to think of how to disrupt. How to disrupt the system, how to disrupt the machine, you know, And I was like, I could. I kind of understood what you're saying, but I feel like, you know, what you're presenting with us, what you're presenting to us now is a. Is a far deeper way of understanding. And in the end. And the thing is that it is the ultimate disruption in a way. You know, it's not a planned disruption in the sense of, like, here's how we can strategically kind of, you know, let's say, break the machine that's setting itself up. It's rather ascend vertically to become more than the. Than just this mediocre machine that we're living in. And, yeah, it's a beautiful journey."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4377.79,"end":4384.19,"speaker":"Jordan Peterson","text":"I'm sure you understand this, but you have a substantial amount of contribution to that, so I have a tremendous amount of gratitude."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4384.19,"end":4392.25,"speaker":"Jonathan Pageau","text":"Well, glory to God for any help that I provided. And we'll be watching and discussing and hopefully collaborating more in the future."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4392.32,"end":4392.44,"speaker":"Richard Pageau","text":"Future."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4392.44,"end":4393.76,"speaker":"Jonathan Pageau","text":"Jordan, it's good to talk to you."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4393.92,"end":4394.88,"speaker":"Jordan Peterson","text":"Wonderful. Yeah."}
{"episode_id":"SW - #358 - 2024-09-26 - Jordan Hall - The End of Strategy","start":4394.88,"end":4409.92,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld. Com and thank you for your support."}
