{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":0.24,"end":27.04,"speaker":"Jacob Howland","text":"Just to take one example, now we have this chat GPT and already students are using it to write their papers, and professors are using it to write their lectures. So it's like two machines talking to each other. Or for example, there are these programs. You can speak into it and then it'll translate it into Spanish or something like this. But every step that we take in that direction, our human capacities like reading, writing and so forth begin to sort of rust and disuse."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":27.48,"end":40.84,"speaker":"Jonathan Pageau","text":"Yeah, not only do they rust and disuse, but at some point there'll be a kind of cannibal element once they re open ChatGPT and it starts to now continue to analyze what's coming in terms of writing and in terms of. It'll start to eat its own children."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":41.16,"end":41.6,"speaker":"Jacob Howland","text":"Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":41.6,"end":105.39,"speaker":"Jonathan Pageau","text":"Then it'll create a cannibalistic monster that will start to devolve because it's going to be basically cycling back its own. Its own output. This is Jonathan Pedro. Welcome to the symbolic world. So, hello everyone. I am very excited to be back with Jacob Howland. He has been on the podcast before. He is the provost of the University of Austin, and he is an expert both on ancient thinking, in terms of the ancient Greeks, but also biblical thinking as well, and rabbinical thinking. So this is going to be a great conversation. We're going to talk about the question of technology and all the way leading up to the issues of AI and all of that. So, Jacob, this is. You're the. You're exactly the person I want to have this conversation with."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":105.71,"end":107.31,"speaker":"Jacob Howland","text":"Well, thanks. I feel the same way."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":107.71,"end":123.74,"speaker":"Jonathan Pageau","text":"So my big question, my first question for you is, have you thought a bit about the different narratives about technologies that we find both in ancient thinking, whether mythological or philosophical, and the way that the Bible portrays the question of technology, let's say?"}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":123.74,"end":264.17,"speaker":"Jacob Howland","text":"Yeah, I mean, you know, I think that a lot of the issues that we're confronting today were already identified by both of those traditions. And maybe one way to put it is if we go back to the Platonic texts, Plato makes a distinction between acquisition and production as sort of kinds of sciences or arts. And philosophy is categorized under acquisition. What does that mean? The acquisition of knowledge, which is a kind of openness or receptivity to the world. Right. So there's a kind of anthropology behind this. Human beings are these souls that relate fundamentally to reality. And our job, if you will, is to register those realities and to take them in. Now, production is. I mean, the Greek word is poiesis, which is. Could also be translated poetry. But it just Means production, making. And the thing is that there's no pure receptivity. I guess I would say if, if you're doing philosophy, for example, you. And this is really the ancient sort of epistemology, you register, right, what is there, and then you articulate it. There's no philosophy without articulation, but that always has a productive dimension. You're using the tools that you have generated, for example, language. You're selecting which of those tools you're going to employ. I mean, you could. You could represent reality mathematically or poetically or whatever. And so there's always this kind of productive element you're adding to what it is that you've taken in. Technology from the Greek perspective, and I think this applies to the Bible as well, is obviously productive because we're making stuff, we're transforming nature, we're building. And the danger there is that it can interpose itself between us and reality, and that ultimately, if we sort of follow the line of technological development far enough, and here I would sort of flag AI, we might create a kind of virtual reality, that is to say, a humanly produced reality that substitutes for the world to which this philosophical, and I would say biblical anthropology suggests that we are fundamentally meant to be open and to order ourselves by."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":264.17,"end":393.24,"speaker":"Jonathan Pageau","text":"Yeah, I think that, that. So I. You know, one of the things that I read even in college, also because of postmodernists, really, is the. Plato's Phaedra, where Socrates talks about writing itself as having that problem, which is something that a lot of modern people would be surprised because we're actually like, beyond writing. It's like whatever effects writing had on the civilization, we're way beyond it. But in some ways, it was exactly that problem, which is that we as humans are living spirits, right? We are breathing living spirits that manifest meaning, that take in meaning. But there's a kind of organic dance to that, right? Whereas as soon as you fix something, then it, on the one hand, it makes it more powerful because, right, you can send your texts out, you can send emails out, but on the other hand, it does in fact, it can in fact interpose itself. The way you said, it's a supplement, it's an. It's an adding to language. And then it can become a kind of opacity to what it is that you're. That you're saying. You know, if we're talking, you know, you and I face to face, and you don't understand what I'm saying, you know, you can ask me and I can answer, and then we can have this kind of back and forth where. Where we're tuning in and we're tuning closer to what we want. But if you read a text, that's what it. That's it. Like, that's what you have. And so. So on the one hand, it. It makes it possible for me to access the thoughts of people that I. That I can't meet, but it also at the same time creates that difficulty, which is that, you know, it's like this, these fixed words are my vision of what. What it is that's coming down to me. You know, it's a means, let's say. But it can. It can become something of an idol, like, because if you lose its connection to what it originally is, then it. Then it somehow has a life of its own, you could say. And it's interesting because a lot of the postmodernists, that's actually what they want to do. They want to, like, liberate the text from the author in some weird way, like, make it have a kind of life of its own where there is no. There's no like, thread that goes back to the. To the person, but rather it becomes almost something that you play with, you know, just on its. At its own level."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":393.64,"end":432.52,"speaker":"Jacob Howland","text":"Yeah, I think that's right. You know, the fetus is really interesting because, I mean, there are these interesting kind of contradictions. So this is a written Platonic dialogue. Yeah, thank goodness it's written because we have access to the thinking of Plato. But the little story there is two Egyptians. One is the pharaoh and one's a God writer talking. And one of them is displaying the arts that he's produced and finally gets to writing. And the objection that the other registers is that this will not be a tool of memory. That is to say, when writing is introduced. The idea is we're not going to forget stuff because we've written it down."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":432.52,"end":445.92,"speaker":"Jonathan Pageau","text":"It'll increase memory, is the argument of the. Of the God. And the God is like a. He's almost like a Hephaestus figure. He's like a kind of dark God of technology. Yes, right, version. Yeah, exactly."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":445.92,"end":612.57,"speaker":"Jacob Howland","text":"Yeah. Oh, and, and I mean, as a side note, it's interesting that this takes place in Egypt because I would suggest that Egypt, with its man God, it's pharaoh, it's magicians who exercise some kind of techni. Right. And causing little miracle, little, you know, strange, like unnatural events to occur and so forth. It's enormously impressive technological achievements by which, I mean, for example, the pyramids or. I mean, I was in Egypt A number of years ago. And I have to say I've never seen more exquisite jewelry. I mean, just the, you know, when you take sort of the sarcophagi and all these things. But what's interesting is, so Egypt devoted tremendous social resources to the production of these kinds of items. And obelisks and huge things like this, what were they for? Primarily they were to honor and be stuffed in the tombs of dead man gods. Okay. I should say incidentally that Egypt was also a kind of symbol in the ancient world. I mean, Plato associates it with, with death, with a kind of desiccation, a lack of life. Okay. And I would want to connect that as a long discourse perhaps, but with technology as a kind of substitute. Okay. So anyway, the God points out this will actually be a tool of forgetfulness. And the suggestion is. And what he means by there is, is. Or let me put another way, it will suppress recollection in a philosophical sense, which I would take to mean something like a living openness to the fundamental things that need metaphysically, religiously and so forth to be remembered by us, to be taken into our souls. So you're absolutely right. Writing then serves as a kind of mediation. Right? And obviously today where young people, and maybe not even that young people have, have sort of learned to, not to answer the phone, but to use text and so forth, there are all kinds of further layers of mediation between human beings. So Socrates favored this face to face discussion like we're having now. And I do think that, you know, if we look at, again, artificial intelligence, just, just consider the levels of mediation that are involved in. When I sort of look at my smartphone or something like that, or when I'm relating to, you know, a glowing electronic screen, what's happening there. Human beings are observing the world. They are representing it in language or mathematics or something. They're then encoding it into data, zeros and ones, and then that is being presented to us. Right. So there's a kind of, I mean, we've taken writing and kind of amplify, put it on steroids, if you will. So I think this is a really important issue, definitely."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":612.57,"end":790.57,"speaker":"Jonathan Pageau","text":"And all the imagery that happens in Phaedrus is related to this. And it's actually very similar to the one that you find in the Bible. The way that Egypt is represented also in this text, with all of the other symbolisms that are brought about in Phaedrus. It's similar to the way Egypt is represented in Scripture. Because Phaedrus and Socrates leave the city, they leave their city, they Cross a river. You know, it's like when you cross a river, you know what that means? Like you're either going out into the wilderness or you're coming into the. Into, into your home, you could say. So they cross a river. And then there are all these weird things that Socrates does. Like sometimes he talks, he covers his face and talks through a veil. And there's all these, these kind of weird symbolic things that Socrates is doing. And it seems to manifest what, what I've talked about quite a bit in scripture, which is the garments of skin. I think that the imagery of the garments of skin in scripture is very much akin to what is happening in this idea of the supplement that Plato is trying to help us see, which is the garments of skin. On the one hand, what they do is that they increase your capacity to live in a world that's hostile to you. That's what they do. But at the same time, they are made out of death, first of all, and they are also a weakening of you at the same time because you're always putting yourself in more danger as you're moving out. So that's what. And that seems to be what technology does in general and has to do with recollection as well. So think about, think about. The example I love to use all the time is, is fire making. So my ancestors could spend a lot of energy. They knew how to make fire, but it would take forever. And they would use a string and a bow or whatever they would use, and they could just kind of. And even that, they needed the string and the bow, but they could, they could make fire. It's like, I don't have to think about that. I just have to, to flick a lighter and I have fire. So I'm, I'm a million times more powerful than my ancestors, but if I don't have that lighter, I'm going to dive cold in the forest, pretty much. And so it's like, think of technology. If you think of technology that way, which is that we've, we've increased our power to the extent that we can move out and go into space. And, you know, I can live here in Quebec where there's like eight months of winter, but it, so it makes me more powerful, but it also makes me closer, brings me closer to death and makes me more fragile at the same time. And that seems to be what technology itself does, especially writing and especially what we could call now information technology, which is that I know I have access to more information than all my ancestors together, but I don't have to hold it inside me in any way. So I can pretend to be smart and be a complete idiot or not a total idiot, but I'm. I'm far less integrated than, you know, the ancients would have been. But I also have all this access, so it can. It can. It's like. It's that duality of. Of. Of power and weakness. Or. Or like using death against death maybe is the best way to describe it."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":790.57,"end":791.05,"speaker":"Jacob Howland","text":"Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":791.29,"end":854.8,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clip clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and. And the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, Medi Weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com it strikes me that there's."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":854.8,"end":876.43,"speaker":"Jacob Howland","text":"Some sort of optimal relationship between man, nature and technology. I mean, you know, you're absolutely right. So Adam and Eve sin God prepares them clothes out of animal skins. Obviously this then is a fundamental divorce between human beings and these animals with whom they communed in the garden."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":876.83,"end":882.51,"speaker":"Jonathan Pageau","text":"And also from God, because they use it when they first put on coverings. It's to hide themselves from God."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":882.51,"end":882.91,"speaker":"Jacob Howland","text":"Right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":882.99,"end":895.05,"speaker":"Jonathan Pageau","text":"So they hide themselves from God and then they buffer themselves from the animal and they create this like, buffer between them and between God and the animal. They're like isolated in the world or alienated is the best word to use. Maybe."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":895.13,"end":967.37,"speaker":"Jacob Howland","text":"So one of the things that flashed into my mind when you were speaking was Yuval Harari's book Sapiens. In the beginning of that book, he makes a rather strong case, I think, that the hunter gathering age of our existence was in some ways maybe the most intellectually stimulating and kind of rich compared to, for example, you know, I'm an accountant and I'm looking at a computer screen all day. Why is that? Because individuals had to possess a range of technical skills. Right. You've got to be able to kill animals, you got to be able to skin them, you have to be able to sew these garments, you have to be able to make fire. You've got, you know, you have to be able to identify plants to figure to pick things and just sort of respond to the clues of nature. Now, they obviously live much closer to nature. The thing about nature is that it's hostile. I mean, we know this from the Bible, we know this from the Greeks. It's not simply hostile. Right. It's also beautiful and splendid and nurturing and so forth. But we have to deal with the hostility element. In fact, I would. I would actually, if you sort of asked me, like, what's work? I would categorize work as sorting chaos. Right. Just kind of getting sort of figuring things out so you can. So you can survive."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":967.61,"end":981.61,"speaker":"Jonathan Pageau","text":"Yeah. Work is a good, though, in Scripture too. It's weird because it's like it's a consequence of the fall, but it. It ends up being a way to be saved from the fall, both personally, in terms of your own soul, but then also just because now you do have to work the earth to make things grow. But."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":981.93,"end":982.33,"speaker":"Jacob Howland","text":"Right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":982.57,"end":983.85,"speaker":"Jonathan Pageau","text":"That's also how you survive."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":983.93,"end":1026.07,"speaker":"Jacob Howland","text":"Yeah, so. So obviously we're not hunter gatherers. We've. We've advanced it. It, you know, it's interesting because people still talk about progress, you know, and so what is progress? Well, progress is also regress. Right. Yeah. And. And now we rely on all sorts of things that we have no idea how they work. I mean, this is something Ortega, I guess it writes about in the Revolt of the Masses. It's something Freud writes about in Civilization and Its Discontents as well. He speaks about technological man as a kind of prosthetic God. We put on all our stuff and we're, you might think of like a, you know, in the anime, like. Or enhanced with an exoskeleton."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1026.07,"end":1026.71,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1026.79,"end":1116.86,"speaker":"Jacob Howland","text":"And stuff like this. And technology obviously brings discontents. But what's interesting then is that we are unable to reproduce the conditions of our own existence. In other words, no single person can do that. A thinker named Rosenstockusi once said that a citizen is a person who, if need be, can refound civilization in the modern world. There aren't any citizens by that definition. If you see what I mean. I mean, well, there might be citizens in the sense that there could be people with enough practical wisdom and so forth to sort of refound political life. But if we're talking about civilization as we now depend on it, and we're utterly dependent, you're right, that becomes very difficult. One last thing I would say here is that every technological advance subtracts, and this is obviously implicit in what you were saying from our own capabilities. I'm going to wave at artificial intelligence again because just to take one example, okay, now we have this Chat GPT, and already students are using it to write their papers, and professors are using it to write their lectures. Right. So it's like two machines talking to each other. Okay, so why do I need. Or, for example, there are these programs. You can speak into it and then it'll translate it into Spanish or something like this. So. But every step that we take in that direction, our human capacities like reading, writing and so forth begin to sort of rust and disuse."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1117.42,"end":1137.42,"speaker":"Jonathan Pageau","text":"Yeah. Not only do they rust and disuse, but at some point there'll be a kind of cannibal element to the technology because, you know, Chad, GPT, once, once they reach open ChatGPT and it starts to now continue to analyze what's coming in terms of writing and in terms of. It'll start to eat its own children."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1137.98,"end":1138.26,"speaker":"Jacob Howland","text":"Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1138.26,"end":1152.7,"speaker":"Jonathan Pageau","text":"Then it'll create a cannibalistic. Cannibalistic monster that will start to devolve because it's going to be basically cycling back its own. Its own output. And so it's like, I don't see how they're going to solve that problem in the. In the long term, because."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1153.02,"end":1153.42,"speaker":"Jacob Howland","text":"Right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1153.74,"end":1167.16,"speaker":"Jonathan Pageau","text":"And. But even the fact that we know that it'll do that is an image of what it's also doing to us, which is ultimately a kind of diminishing of the human spirit as it is. As it increases in power."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1167.96,"end":1210.9,"speaker":"Jacob Howland","text":"Yes. Look, this is. This is already happening. I mean, weirdly, Jonathan, I took some solace from the fact that Chat GPT is cannibalizing itself in a way. So just to be clear, right. What does Chat GPT do? Well, it goes out there and it, and it kind of looks at all this data. Right. Goes to the Internet. Right. Which is not a particularly intelligent pool on the average. I mean, you just, you know, which is incidentally why ChatGPT makes stuff up, because it obviously it sort of can't sort out what's true or what's false. And so it kind of looks at things and Makes these what it thinks are logical connections, but so that if."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1210.9,"end":1214.06,"speaker":"Jonathan Pageau","text":"A student just calculates semantic distance, right?"}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1214.38,"end":1243.87,"speaker":"Jacob Howland","text":"I mean, there was. There was a professor told me about a paper he'd gotten on Romeo and Juliet, you know, and it was like Romeo, you know, the calculates and the Montagues and so forth. And then Julia catches a cab and she goes, you know, and so, I mean, because this is right. So. So you kind of take this low pool and you scoop it all up and you connect these things and you spit something out, and then that becomes part of the larger pool which the next chat GPT iteration, you know, looks at. And. And so. So it's sort of like consuming your own waste."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1243.87,"end":1283.52,"speaker":"Jonathan Pageau","text":"Now, what's interesting, actually, they cut. They cut jet GPD off from. They stopped training it a few years ago. Oh, they've actually cut it. It's only within itself. But they can't do that forever. Like, I know they probably did it because they know the problem that they're setting up in the world, but at some point they're gonna have to reopen it because they can't if they want Chad GBT to keep up with what's happening, they'll have to reopen it so that it goes back and starts to. To. To recal. To recalculate. So. So I think they're. Maybe they're looking for a solution for it, but they, at least for now, they have cut it off, which is. Which is something being hadn't done for a while. And that's why Bing was like a psycho. Like, Bing would. Would just go mode and just become like your. Your. Like your."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1283.52,"end":1283.88,"speaker":"Jacob Howland","text":"Your."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1283.96,"end":1294.84,"speaker":"Jonathan Pageau","text":"Your stalking ex girlfriend or you know, turned into, you know, like the. The like passive aggressive or whatever. Like, they were all. It had all these personality defaults because it was literally training on the Internet."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1295.24,"end":1397.03,"speaker":"Jacob Howland","text":"So that's. That's really interesting, but let's go back to your cannibalization thing. It. It certainly reminds me of, you know, a pagan God. I mean, I think maybe in an earlier discussion, we. We. I observed that the biblical God feeds us, right? Man in the wilderness or Christ, you know, the communion and so forth. But the pagan gods, really, one could argue, and I won't do it right now. They sort of dined on human beings. I mean, think of like the Athena and these various gods, you know, at Troy, sort of sitting like vultures. They're compared to vultures, and they're just so hungry to consume the bad, the blood and so forth. Now what that means is that again, human beings are relating only to themselves. But now through the mediation of this artificial intelligence, which is why, incidentally, I read somewhere that like thousands of writers were suing OpenAI because it was training its language on proprietarial works by these authors, which you've got to do because the movement, like if you just keep training on, you know, the Internet, you're going to get, you start at a low point and, and you're just kind of going to decline. It's going to be sort of mediocrity. But what that means is it needs to cannibalize sort of living thinking, right? It needs to like, it needs these human beings generating new stuff. And this is the large problem with our society. I mean, even before these, these kinds of artificial intelligence advances, Hollywood was cannibalizing itself, right? You know, I don't know such and such iteration seven, right? You know, exactly. Just Rambo 19 or something."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1397.59,"end":1527.65,"speaker":"Jonathan Pageau","text":"But think here, let me throw something out for you and see what you think about this. So one of the, so if you look at the Matrix movie, so you have a situation where the Matrix is this artificial intelligence and it's feeding off of our energy, right? So basically we're batteries. But what they mean by batteries is something like the electricity we produce. There's something a little naive about that. The, the way that the AI actually works now is it's, it's actually farming intelligence from humans. So AI isn't intelligent. But what it does is that we provide qualia, we provide quality, we provide judgment to the AI. So the way they actually train the AI, right, is that the AI generates a bunch of junk. And then there are people, actual people, who have to look at that junk and say, yes, no, yes, no, good, bad, good, bad. They'll use like the captchas, for example. You know, like when you're, when you're answering a caption, you're, you're, you're like telling it where the, the lights are. You're, you're training AI when you're doing that, because AI doesn't know the difference between a traffic light and something else. But if you got a million people telling, telling the AI, oh, that's a traffic light, that's a traffic light, that's a traffic light. Then you're, then the humans, you're literally farming intelligence from humans. And so this weird thing where in humans become like, so now you have these low paid, you know, farms of people that are like living in horrible like offices and all they do all day is tell the AI, like what's even in terms of social media and stuff, like, what's good, what's bad? So, you know, that's all you do even for, like, the social media companies, too. Like, you have people all day, all they do is watch horrible content, you know, like, and then all they do is. Is rated and say, this is bad, this is bad, this is bad. So that Facebook can now catch it automatically. Right. So you actually have the idea of this, like, monster, right? This, like, this monster that is eating our attention, our intelligence, and, like, subjugating us to it. But really, like, how can I say this? Swallowing our soul. Like, actually swallowing our soul. And it's like it's happening in front of us. That's."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1527.65,"end":1591.09,"speaker":"Jacob Howland","text":"That's quite amazing. And this brings up another thing, which is, how does a child learn what a cat is? Okay, it encounters a cat, and then someone says, that's a cat. And it takes a couple of iterations of this. All right? Why can't AI do it? Because human beings have what the ancients called intuition. What's intuition? Intuition is direct, unmediated access to reality. Now, let me stop. I can imagine the skeptic listening to this saying, oh, wait a second. Of course it's mediated, right? Your brain, optical nerves. This whole thing is extremely complicated. We construct, but let us say, okay, fine, it's all relative, but on the scale of relativity, this is the most direct, unmediated thing. Which is why, frankly, we have a critique of writing in Plato's Feedrus, because again, writing is this mediation, and what needs to be preserved is this capability of immediate intuition. Aristotle develops this and talks about noises, which is an intellectual intuition, Right?"}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1591.09,"end":1631.68,"speaker":"Jonathan Pageau","text":"Yeah. In the orthodox tradition, the noose and the idea of noetic capacity is. Is the highest form of. Of. Of knowledge, Right. It's more than knowledge in the sense of the way that we think of thinking or whatever it is, direct grasping. And in. In the orthodox kind of mystical theology, the noose is the capacity we have to also be united with God because it's the capacity we have to have, first of all, direct grasping of the things around us. But then ultimately, it's that which also makes us possible to, like, you know, enter into the embrace of God. Because it's a. It's a type of knowledge that isn't just intellectual. It's. It really is like the fullness of your being, you know, joining with something."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1632.16,"end":1691.32,"speaker":"Jacob Howland","text":"Yes. And look, it's not simply knowledge of God, but knowledge of human beings. I mean, we don't do this in English, but, you know, we've got Say in German, someone might say Kennedy Jonathan Pageau, which means, are you familiar with Jonathan? No one would say visenzi Jonathan Pageau, which means do I have epistemic knowledge? Do I have a scientific comprehension of Jonathan? Now, I would argue that anything that poses as a scientific comprehension of Jonathan is not the best kind of knowledge of Jonathan. Yeah. So if I say, oh, he's a good guy or he's smart or something like this, this is a response that is that, that I have, that has been elicited from me by my immediate face to face presence with you. And human beings have a kind of inner infinity like God. And that's something that we cognize sort of directly."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1693.17,"end":1693.41,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1693.49,"end":1728.46,"speaker":"Jacob Howland","text":"But going back to AI and this cannibalistic stuff, one needs to raise the question of what do we mean by intelligence? AI has intelligence in a very specific sense. It's a kind of discursive intelligence. It goes across data and it arranges it and moves it around. It lacks this intuition. So when we relate to AI generated products, we are relating to something that has lost its connection in some basic. Or never had a connection. Never had a derivative."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1728.46,"end":1731.3,"speaker":"Jonathan Pageau","text":"Derivative. It's derivative information necessary."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1731.78,"end":1754.57,"speaker":"Jacob Howland","text":"Which is why, you know, there's a kind of fundamental stupidity. You're. You're rather harrowing picture of people sitting in a, I imagine a kind of, you know, windowless road. Typing in like cat, cat, cat, cat or whatever suggests that, you know, like this. What does it mean? That that is the foundation of artificial intelligence."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1754.89,"end":1815.93,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clip clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and. And the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi weight loss is ready for you. Walk in, get started and see Real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1818.41,"end":1826.73,"speaker":"Jonathan Pageau","text":"And Doug Limu and I always tell you to customize your car insurance and save hundreds with Liberty Mutual. But now we want you to feel it. Cue the Emu music. Limu."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1827.05,"end":1829.75,"speaker":"Laura Diaz","text":"Save yourself money today."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1830.55,"end":1846.31,"speaker":"Jonathan Pageau","text":"Increase your wealth. Customize and save. We say that may have been too much feeling. Only pay for what you need@libertymutual.com Liberty Liberty. Liberty. Liberty Savings very underwritten by Liberty Mutual Insurance Company affiliates excludes Massachusetts."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1847.03,"end":1856.87,"speaker":"Jacob Howland","text":"I had a professor who very cleverly said, I don't know why everyone's interested in artificial intelligence. I'm looking for the real thing. Right. Real intelligence that's hard enough to find."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1856.87,"end":1857.83,"speaker":"Jonathan Pageau","text":"In the world already."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1858.07,"end":1895.06,"speaker":"Jacob Howland","text":"Yeah, exactly. So there's a kind of. Kind of unmooring. Yeah. And again, if we go back to what I said at the beginning of our discussion that this kind of biblical and Greek anthropology is the soul is open to reality. Both. Both the chaos of reality and the. And the kind of moral and intellectual measures, the, you know, transcendent, eternal things. If that's the case, then relating to AI is a. Is. Is. Is a kind of shutting down of that because we don't even have, Like, AI simply lacks any fundamental connection or direct connection with reality."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1895.06,"end":1992.25,"speaker":"Jonathan Pageau","text":"Yeah. And I think that this is. This is a good place to. To talk about how there's a really. A good. A good way to understand AI today is to understand the manner in which idolatry was kind of understood also in. In Scripture, for example. So if you want to take the idea of technification, because you talked about, like, what's the right balance of technology? Like, how can technology serve its proper purpose? So you have two images in the Bible. They're close to each other because, you know, they're in the same story, which is, on the one hand, you have the golden calf which Aaron built instead of the Revelation, and people end up worshiping the calf itself. You know, it's in worshiping the work of their hands, you could say. And then the other one is the revelation of the tabernacle, which is a technical thing. Like, the tabernacle is like a little city. It is like a microcosm of civilization. It's a microcosm of technicality. There are the use of metals, of gold, of silver and of bronze, you know, in a hierarchy. There's a whole cosmic image in the tabernacle and later in the temple. That seems to be the Highest image of what technology can be is an ordered supplementarity, but directed towards the transcendence, directed towards the transcendent and not captured within its. The fascination with itself, you know, and a kind of cannibalistic move where you. The fascination of the technical itself becomes the. Or the capacity for power itself becomes the motor which makes us engage with it."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":1992.57,"end":2168.05,"speaker":"Jacob Howland","text":"Yeah, this is. So a bunch of ideas popped into my head as. As you were just speaking. So the gold that made the golden calf, as you know, was. Was jewelry, earrings and things like this taken from Egypt. Now, it was intended for the adornment of the tabernacle. What's really interesting there, and this just occurred to me, is that that story could be interpreted as an answer to the question, how do we reorient technology? How do we take it in its really monstrous kind of exemplification in Egypt and reorient it toward. I mean, this is obviously something that probably has occurred to you, but. So let's talk about the golden calf for a minute. So Moses is up there on the mountain communing with God. He doesn't come back. The Israelites say to Aaron, you know, the guy's not coming back. Make us this God. And there's this weird ventriloquism that goes on because once Aaron makes the calf, which is definitely a technical thing, right, he has to shape it and all this kind of stuff. The Israelites say, this is the Lord your God who took you out of the land of Egypt. So they plagiarized God. There's another act of cannibalism, by the way, like in some sense, or. I don't know if that's exactly right, but. And what is the calf? Well, there's a weird connection between the calf and what's going on today. All right, what are. Like, what. Why do say Americans love, you know, digital stuff, Right. Well, I mean, if you ask anybody, you know, what's the highest traffic on the Internet? Porn. Right. Technology, by the way, will generate better and better sex robots and things like this. The golden calf was. I mean, after they made the calf, this kind of. Well, somehow it stimulated this Bacchanalian celebration the next day. So, like, the calf is connected with the unleashing of these desires, which no doubt were suppressed in Egypt. These people were slaves, but here they are in the desert, and they're like, the master's gone. We compelled this guy to make the calf. Now we're going to do our thing, right? Because now we're going to enjoy all those things that. That we were never able to enjoy in our enslaved condition. And so we've got that. The tabernacle. I think it's really interesting because what's happening there is to try to present in an architectural space the possibility for the encounter with the infinite. Right. So you've got this finite construction, and this is obviously how icons work and so forth. How do you solve this problem? You know, but it's a very interesting contrast because there is a proper place for gold and silver and adornments and these technical products. Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2168.29,"end":2389.37,"speaker":"Jonathan Pageau","text":"So, yeah, no, I think your insight is. Is very. Is very strong. You know, there is a. So you could say. So think about, like, even in the garments of skin situation, it's very interesting because God gives Adam and Eve these garments of skin, which, by the way, many, at least in the orthodox tradition, and I'm pretty sure in some rabbinical traditions as well, is kind of like it's basically your biological body. It's like it's your biological body of death, right? Not that Adam and Eve didn't have bodies before the fall, but that their bodies were more subtle, you could say. And that these bodies of death that we're in, you know, that you eat and that you excrete and all of this, and. And all the. The desires that come with it, they're. They're related to the garments of skin. And so there's a relationship. And what it does, it's an increase in power, right? Body is an increase in power. Just like a guy who is buff and has big muscles, has more power, more you have body, more you have power. And so it's. It's an extension of that logic, which is that if I add more body, I add more power. If I have a. If I'm strong and. Or if I. If I have a Mecca suit on top, like we said, then that Mecca suit makes me more powerful. But there's a connection between that and the animality itself, Right. A fall into animality, you could say, which is also an abandonment to our desires and to. To the. To the more, you know, appetite aspect of who we are. And so, like, if you think about it, it all kind of comes together. So we tend to oppose, for example, the world of technology and the world of animality because one is artificial, one is natural. But if you understand it as this idea of increase in body, then the idea of a metallic calf, right? A metallic animal which is, you know, God told Adam to name the animals, and now all of a sudden they take the animal and they put it up as a God. They're basically doing the opposite of what God told Adam to be, which is to be on top of the animals and name them. And now they become subject to it, subject to the body, subject to these kind of licentious desires. And so all of this stuff kind of goes together. You know, in the book of Revelation, there's this image of the. And the beast, right? So there's a whore sitting on the. On a beast. And the beast is civilization. You know, there are different ways to understand that in the text because the beasts are related to the book of Daniel and the perception of the different civilizations that like, you know, the different animals. And so it's like these two things go together, right? The technification and increase in power leads to licentiousness and leads to us being having more e. And you can think about it just like, just very practically, which is that if you. Let's say you. You have a little. Let's say you have a little fault in yourself, right? You. I don't know, you have. You. You look at women or whatever, you have a little thing. Then. Now I'm going to get. And. And that's kind of there. You're. You're trying to manage it, but you're struggling. And I'm. And I'll give you a million dollars, right? It's like all of a sudden your increase in power becomes a door for whatever that little thing in you was to increase. And so technology does that, does that on steroids, especially something like information technology, right? Which is intelligent technology. So the relationship between Internet and porn or Internet and. And all these things, this is something which is completely unavoidable. Like you couldn't have it anyway, else. Or at least not easily. You know, it's not accidental that these things develop the way they did, just as it's not accidental that they develop towards porn and the military. It's like increase in power, increase in desire, increase in desire to dominate, to consume. All these things are related to what technology is and technology does."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2390.17,"end":2599.99,"speaker":"Jacob Howland","text":"Yeah, that's very interesting. You know, one way to think about these things, or at least one way that I think about them, is in terms of the categories of work and leisure. So human beings relate to reality. Work is a kind of sorting of chaos. What's the point of work? Well, let's go back to the Greeks. So Aristotle says he's critiquing the Spartans. War is for the sake of peace. And in peace we have business and we have leisure. Business is for the sake of leisure. Now we need A sort of thick conception of leisure. So I think here are productive conceptions of leisure for Aristotle. What's leisure for? He critiques the Greek. He said they sit around, they drink and they tell myths and stuff. Although I think he's underestimating the importance of myths, Jonathan, and the symbolic richness and so forth. But what's leisure for from the biblical perspective? Let's take the Jews, Sabbath, the Sabbath. And what is that? That's an opening again to the highest things. This is connected, right, with someone like Joseph Pieper who incidentally, you know, I mean, he has got this wonderful book on leisure, the basis of culture. And he sees leisure as a kind of plugging into the life giving forces of the divine, of nature and so forth. What's happened? So why do I mention leisure now I'm thinking of AI Again, two things, work and leisure have become confused. So you were talking about the capture stuff, right? You're actually working for AI when you're doing capture. But why are you entering captcha? Because you want to get to the, the good stuff, because you want entertainment. Or every time I, you know, log into this or I'm like, I'm going to have fun, I'm going to watch this TikTok or something, they're getting information about you. So you're actually working but you're, you're working for somebody else. You don't even know it, but you're enjoying leisure. What happens with leisure? Well, this is a very serious problem. I mentioned Joseph Peeper, he's writing, he gives his talk on leisure, the basis of culture and another one called the philosophical Act. It's 1947, 48. After World War II, Europe is being rebuilt. The emphasis in education is on you got to have useful knowledge, right? It's all for work. And Pieper is worried about a world of total work where we don't have exposure to leisure. Another person who worried about leisure is John Maynard Keynes who wrote an article in the early 30s called economic possibilities for Our Grandchildren. And Keynes, this is very important. Keynes said this is the beginning of the Depression and he says, basically, obviously paraphrasing. Look readers, you're not going to believe this, but here's the good news. In 100 years we won't need to work, okay? Because our productive capacities will increase and so forth. And then we're going to confront the greatest problem in human history. What do we do with our leisure? And the reason that's a great problem is we don't educate people for leisure. Go back to Aristotle, he was critiquing the Spartans. They don't know how to be a leisure. All they knew is how to win wars. Yeah. So what happens with our leisure? Well, in leisure, you. You know, I have a statement around here somewhere. The. Some. The World Development Organization says something like AI is going to be awesome. It's going to liberate all these human capacities. We're going to be at leisure because it's going to put all these people. We won't have to work, right? And, you know, we're gonna develop ourselves, we're gonna paint, we're gonna have, you know, learn languages and all this stuff. Well, much more likely, you know, you're gonna have sex robots."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2599.99,"end":2600.99,"speaker":"Jonathan Pageau","text":"That's right. Most likely."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2600.99,"end":2635.23,"speaker":"Jacob Howland","text":"That's right. So. So there's this kind of, you know, we. This is why. I think. I mean, one reason why this is just profoundly destabilizing. But just to go back to your point, okay, so we, We. We. Our. Our bodies are bigger. We have more control. It's a disordering because the. The point of technology was to do the work part. And now the technology is like, oh, we're going to give you the leisure stuff, but you haven't ordered like you. You've lost the order in some way. Yeah. So then all that."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2635.39,"end":2717.13,"speaker":"Jonathan Pageau","text":"Oh, man, that image is per. Like, I think your insight is perfect. It helps me understand even more like the idea of the whore and the beast as these two radicals, right? It's like this, this kind of. This work and this leisure that is. That is licentious. Licentious And. And loss in terms of purpose, right. It's just kind of wasteful. And that there is something about the days of the week and Sabbath at the structure of creation itself, which are the proper relationship of all these things to. To all these things. So it's like in some ways you could say the whole purpose of the week is to lead to this moment of rest, like rest in God. And so it properly aligns things where it's like the work is there towards. So you can imagine like a ritual, like a ritual in the tabernacle or liturgy in church, right? So it's like we're doing all these things so that finally we come to the point where, you know, we receive the blood and wine and we kind of enter into this moment, this tencended moment. And so it's like that would that. And then we sit together and we eat and we. We feast. It's like that's the leisure. Like the leisure is. It's rightly ordered, right? So then the leisure, instead of being the lowest thing, which it is in our society, it becomes the highest thing, actually becomes like a kind of. It transcends work in that way, like in. In the. The right way of thinking about that."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2717.53,"end":2744.9,"speaker":"Jacob Howland","text":"Yeah. And I. It's so important. You said we sit together and we feast. Human beings are social and political animals. We re. We crave, even if we don't know it, the meaning that comes through through rich connections with other human beings. Technology today is sort of driving us apart. I mean, again, and leisure today and."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2744.9,"end":2747.9,"speaker":"Jonathan Pageau","text":"Technology and leisure today is actually fragmenting us."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2748.38,"end":2807.01,"speaker":"Jacob Howland","text":"Yeah, that's right. All these forces of atomization, even simply, you know. So I have a colleague, and he said, well, let me tell you, my daughter, she's like, 17, she had her iPhone, and it was ringing, and it was her best friend, and she said to her dad, what do I do? Like, why does she want to call me? And he says, well, you actually have to answer the phone to figure that out. Right. I'm just telling the story because, you know, now it's like text, Right? So. So. But you're right. Entertainment. I mean, what is entertainment? There used to be these things called movie theaters, where kind of cool things would happen sometimes, you know, with audiences and the way people reacting and just the buzz and all this stuff. And workplaces are emptying out. People are going to be put out of work. By the way, many people will think this is some kind of amazing blessing. So you were talking about money. I gave you the million bucks. My son had a teacher when he was in 8th grade who was doing a documentary on what happens to lottery winners."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2807.01,"end":2808.53,"speaker":"Jonathan Pageau","text":"Yeah, they all go sour."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2808.69,"end":2814.13,"speaker":"Jacob Howland","text":"They go nuts. And this is actually another problem that we can discuss."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2814.61,"end":2820.53,"speaker":"Jonathan Pageau","text":"That's a great image of what's coming. If it's true that AI is going to make us not work, then look at what happens to lottery winners."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2820.69,"end":2869.39,"speaker":"Jacob Howland","text":"Oh, exactly. And it also comes down to fundamental questions, sort of moral questions, because if you poll Americans, 60, 70% don't like their jobs. Okay, here's the thing, though. You go to work, you get a paycheck, you come home, you put food on the table, you can buy your kid a bike. You can. You know, there's dignity. Your. Your life has some meaning now. I just took that away from you. Right, and I took away from you. So the guy who wins the lottery, first thing he does, he quits his job, and he moves great. All that structure. Your friends. You used to have the. The kind of basic architecture of your life is gone. Yeah. Now what are you going to do? Yeah. So, I mean, these are really, really fundamental problems."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":2871.15,"end":3024.88,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting. I, I was, I actually, it's so funny because we were talking about this. I just came back from Greece, I went on this, this trip with Ralston College and we kind of visited all the ancient sites and we, we also went to Mount Athos together. And you know, you look at the life of the monks and the. They probably have more leisure than any of us. You know, it's a, it's bounded with a lot of work. So they have like a certain amount of hours of work and then they also have all this, this, you know, they kind of have this, this leisurely life, but their leisure is really directed in that direction. Like it's directed towards, you know, self transcendence really. Like, you know, worshiping God and moving, moving towards that which is, which is the good, the true and the beautiful, you know. And so. Yeah, so, so, so there's an image, you know, in, in the book of Revelation I talked about the, the horn beast, right. There's another image in the book of Revelation which is the heavenly city, right. The heavenly Jerusalem. And the heavenly Jerusalem is also a technical image, just like the tabernacle or the temple. A city. Now it's, it's. But it also has that order, you could say, where it's like everything is directed towards God. And so it says the, all the nations bring their glory into the, the, the city, right. All the kings give up their crowns basically to that which is high. And so it's like civilization, technology, but directed towards that which is good, serving in basically serving it and therefore making what they have meaningful. Right. And so there's a sense in which, you know, I want to, I want to be careful with people. Like I'm not anti technology myself and I'm sure you're not as well. That technology could be amazing. Like, of course if, if we were oriented properly, it could be, it could be an amazing thing full of glory. But the difficulty we have is that we approach technology like the, the ancient Israelites approach the Golden Calf or you know, like something to, or even how Adam and Eve approached the app was like something to take. It's like it's mine. I'm going to, I'm going to make myself more powerful. I'm going to make myself more. And in doing that already, like you said, the problem is that the very, that very mechanism makes it impossible for us to approach the rest properly because like, it's like we're we're trained to make more money now, right? It's like our whole education system become more powerful, make more money, develop technology. Everything is focused on that. But nobody asks what it's for. Like, nobody really is asking the question, like, what could this really be for?"}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3025.6,"end":3026.08,"speaker":"Jacob Howland","text":"Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3026.16,"end":3089.05,"speaker":"Laura Diaz","text":"Look, Tucson, the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3089.77,"end":3107.94,"speaker":"Jonathan Pageau","text":"Because Chevy SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the equinox trucks active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy tracks."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3107.94,"end":3113.1,"speaker":"Jacob Howland","text":"Will keep you moving from here to over here to way over here. Get to all the places you want."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3113.1,"end":3117.54,"speaker":"Jonathan Pageau","text":"To be with Chevy SUV's. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3118.26,"end":3292.89,"speaker":"Jacob Howland","text":"Of course I agree with you. I mean I. I'm not anti technology. I. Whether I were anti technology or not would be completely irrelevant because it's here to stay. We have to live with does make many wonderful things possible. This conversation right here where we're. We're talking to each other in real time and. And others can listen to us. I think it's. It's really wonderful but here. So maybe one way to. To put this is in terms of the thought of Henry Adams. So I. Within the last year or two I read Henry Adams the Education of Henry Adams. And it was quite, it's really an amazing book. So Henry Adams is born in 1838, and he's the grandson and great grandson of two American presidents, right. And so he's like, high up there and they live in Boston. And he says, and he has this kind of moral and religious education. And as a boy, he says Boston had solved the universe, Right. Like, look at these Unitarian clergymen, the wonderful civic. Everything is wonderful. Fast forward to 1900, right? You've got, you've got like a measure of electric lights, telegraphs, telephones, Right. Steam engines, railways, finally airplanes. You know, you've got Darwinism, Marxism, Freudianism. You have radioactive decay of the atomic nuclei had been discovered and so forth. And science is saying, oh, order is an accidental product. Like, it doesn't, it's not natural. And human beings are like vibrating balls of motion and stuff like this. And what Henry Adams says is in this period, what he symbolizes as the Virgin had been eclipsed by what he symbolizes as the dynamo. Okay. And he ran into the, had these big dynamos at like the Chicago World's Fair and stuff. And he saw these things. Amazing. So he has this theory of history, which is human beings. And this is, really relates to the ancient anthropology. We sort of are what we pay attention to and direct our energies to. And for millennia, it was Christianity, Right. It was biblical religion. And it, it produced, you know, crusades and cathedrals and music and all these wonderful things. Now it's the dynamo. So the virgin appeals, works through the heart and the mind through love and appeals to this higher element. The dynamo is something completely different. It promises material salvation in this life, not salvation, the afterlife. And it's dynamic. It keeps changing. And I, so I guess I would say the problem is that we relate to this moving thing, Right. And that Adams has what is famously known as the Adam's curve, which is he calculates, he's doing coal production from 1800 on. Every decade, the power available to human beings technologically doubles. Yeah. Now, so the rate of acceleration is saying, but the curve at some point becomes super steep. Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3292.89,"end":3293.65,"speaker":"Jonathan Pageau","text":"Like, it's like."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3293.89,"end":3301.49,"speaker":"Jacob Howland","text":"Yeah. And so the problem is we don't really know how to, how to deal with it. Because it's too fast. Yeah. It kind of explodes our life."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3301.89,"end":3362.67,"speaker":"Jonathan Pageau","text":"Yeah. So I, I, I, I don't know. It seems like that can't go on forever. I don't know. Because also, just for the, for human capacity to, to deal with it, because it will at some point. We'll also we also go insane because the right also, because we don't. It seems like that curve. There also seems to be a trade off that humans make, which is that, like you said, we are what we care about. And so we also can't care about this dynamo at the same level as we care about and care about wisdom at the same time. Like, it's either the hierarchy, as soon as it's inverted, it's real. So as this technological stuff improves our capacity for wisdom, our capacity to discern, you know, becomes less and less because the technological process makes it so. Right. A chip that increases the power of a computer doesn't care where it's used. Right? It doesn't. It can be used to, to power your video games or it can be used to power a missile or, you know, a weapon. It doesn't matter."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3362.75,"end":3387.36,"speaker":"Jacob Howland","text":"Well, and look, you know, you, you mentioned the computer chip. So doubling every decade. Well, since 1970, the capacities and, you know, memory storage and stuff like this and speed of processors has doubled every year or two. And now we add artificial intelligence whose curve or progression is literally unmeasurable by human beings because we don't actually understand how it works."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3387.36,"end":3389.64,"speaker":"Jonathan Pageau","text":"We don't even know what's going on. Like a black box."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3389.88,"end":3432.61,"speaker":"Jacob Howland","text":"Right. So Henry Adams actually says, look, you know, at some point the human mind might just crack up like a meteor bouncing into the earth's atmosphere. Right? Now, when you add in, I'm just going to throw this out. When you add in how technology is used today, social media and all these other things, well, you know, a rapid increase in mental illness, like the crackup is already happening. And because you also have, you know, you know, cyber bullying and all these other phenomena and so forth. And incidentally, AI is also being used. You know, Department of Defense and the National Science foundation are developing increased tools of manipulation and surveillance and propaganda and all these things."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3433.17,"end":3440.69,"speaker":"Jonathan Pageau","text":"So, yeah, whatever's happening in public, you know, there's 10 times more things happening right outside of our perception, let's say that."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3441.33,"end":3493.74,"speaker":"Jacob Howland","text":"So if we add in like the ideological component of it too, which is you, you know, you have your own thinking and you get shot down, so you put your head down. I think it actually encourages the development of two kinds of human beings. And let's use the image of hitting the, the, like the atmosphere, the hard, dense, aerodynamic soul that's like gonna just, you know, like, you know, and so my examples, like, you know, Homo Sovieticus, you know, the tremendous pressures of communism, and these are the commissars, you know. Yeah, but Much more common today is, hey, I don't want to crack up on the atmosphere. I am going to be weightless, I'm going to be empty. I'm going to throw over all my convictions. I'm just gonna, you know, because wherever the wind is blowing, that's cool, right? And, and so we see these kind of psychological reactions with this incredibly steep curve of technology with all the pressures that come with it."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3493.9,"end":3502.86,"speaker":"Jonathan Pageau","text":"Yeah, it's, it's definitely going to, it's definitely going to be interesting. You know, one of the images. Again, sorry to keep going back to the book of Revelation."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3502.94,"end":3503.58,"speaker":"Jacob Howland","text":"Yeah, sure."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3503.74,"end":3672.46,"speaker":"Jonathan Pageau","text":"It's just because it's one of the best images because one of the images that, that comes about, there's two actually. One is of course the Beast. The beast that speaks, right? The image of the Beast that speaks and that's what seduces everybody. It's very, it's very fascinating. But the other one is that at some point the beast kills the. Right in the story. So the idea is that this whore and these, this whore is riding this beast and it's like everybody is putting all their seed into the like, everybody's just like just, just chaos and mixture and you know, whatever all the possibilities. But at some point the beast kills the. And it's like, because like you said, at some point the, the, the, the, the, the, the control aspect of the technology and the, the surveillance aspect, all of this stuff is going to ramp up to a point where the very mechanisms that brought about like the like the licentiousness are going to turn into hard steel, right? And they're just going to, gonna control everything. Because as things fray and as things break apart and as people's mental health breaks apart, there's no other solution except to create top down structures that will hold things together. Because obviously you know, whoever holds the reins of these technologies has no, has no, there's no advantage for them for like anarchy to break out and things to kind of to become chaotic. And so, and so it seems like the vision of AI as becoming more and more just a use of tyrannical control seems like it is an inevitable. And this is like you think if you game theory it out, you see that it plays out. There's almost no way around it. Which is because I've been talking to a lot of AI developers. I think as I'm thinking about this and there are these cowboy AI developers, right? Some of them that are saying like kind of Elon Musk attitude where it's like, well this is inevitable. It's going to happen. So let's make us as powerful as possible. Let's put the AI in your pocket, right? Let's make your phone powerful enough that you can have OpenAI independently in your phone. And you are as powerful as any other AI. And it's like, I get it, but that's not going to work, right? Because so either the powers that be that hold the reins of our societies are going to use AI to control us, or either we're going to be cowboy AI people. And it means that the terrorist is going to be, is going to have it in his pocket too. And it means that the punk rocker is going to have in his pocket too, which means that the reaction will be the same, right? There's no other way. There's no, like, there's just no other way that it could play out. It has to transform into, into surveillance and control. I don't see an. If you, if you have another way to see it playing out. I don't see it. It doesn't seem possible."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3673.35,"end":3765.49,"speaker":"Jacob Howland","text":"No, I don't. I mean, I hate to say it, but I, I think you're absolutely right. And, and there are so many forces that, that exacerbate this. You know, there's a. There's this kind of feedback loop because the, the less we or the more atomized we become, the less we even remember what it's like to be in a kind of local community. The more we look at others through this lens of abstraction. You know, it's like, it's like Plato's cave image. You know, he's got this image of people sitting around, prisoners in the cave looking at shadows. The difference between my being able to turn my neck, which apparently you can't do in the cave image and look at the other prisoner versus getting all my information about the guy who's sitting next to me from the shadow on the wall. Like we're not doing that face to face stuff. This is a wonderful moment, right? Somebody comes down and unchains the prisoner and he makes him stand up and turn around and it's like the first contact with a human being, what's going on, right? We have to somehow be able to do that. But I don't see how that's going to work. So top down solutions. Well, actually even. Let me, let me go back. I said top down solutions. The word solution, I almost want to excise it from the political vocabulary because politics is a living, ongoing thing. It's a constant renegotiation. It's a constant putting new and fresh energy in. To the system. Like, you're like, you got to paint your house, you know, you got to take care of things. Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3765.49,"end":3767.01,"speaker":"Jonathan Pageau","text":"It's a living organism, really."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3767.17,"end":3767.53,"speaker":"Jacob Howland","text":"Right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3767.53,"end":3773.45,"speaker":"Jonathan Pageau","text":"It has a kind of opponent processing aspect to it where it's like you push a little harder this way, this way, like."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3773.45,"end":3862.58,"speaker":"Jacob Howland","text":"Right. So who talks about solutions? Well, it's a technical notion. Right. It's almost like a mathematical thing. And I, I, you know, I kind of repeat this phrase. It seems to me that all political solutions, like real solutions, are final solutions. Right. That is to say, I mean, it's, it, it's death in some way. Incidentally, Jonathan, I've been thinking about the 34th canto of the Inferno, where, Which actually begins with the line, it's quoted in Latin, you know, the royal. The banners of the king of hell advance. Right. So it kind of identifies Satan as the king. And, and we have this image of Satan. And remember that he's, he's like stuck in the ice. It's all frozen. It's all, you know, none of the, none of the condemned can speak to Dante. They're frozen in these things, right? And then you have Satan. And one of the translators has calculated that he's sticking up a thousand feet from the ice like, like Tower of Babel or something like this. Right? And in his mouth are, you know, Judas and Cassius and Brutus. And as the same translator, John Sinclair, mentions, these are the guys who, guys who served Satan best. You know, they're the guys who serve. But the revolution eats its own in a way, right? I mean, this rebellious angel falls down and crashes into the earth. And so, I don't know, it's just, it's, it's a, it's a very rich image, but it's rich."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3862.58,"end":3869.5,"speaker":"Jonathan Pageau","text":"It's rich in relation to what we're saying, which is that, you know, the, the image of Aaron making the golden calf."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3869.5,"end":3869.9,"speaker":"Jacob Howland","text":"Yes."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":3869.9,"end":4006.22,"speaker":"Jonathan Pageau","text":"You know, there's a, there is a relationship between that and the, the basic Promethean image of revolution, you know, and you see that, you know, the idea of taking that. We think that we're used to actually think of the Promethean story as something positive. You know, it's like Prometheus goes up there, you know, those horrible gods. He takes the fire, takes the technology, takes civilization, brings it down to, to the human, to the humans. And then, interestingly enough, Prometheus's punishment is that his liver is eaten every day. And, and for the, My understanding is that for the ancients, the liver was a An image of emotion or desire, the desiring part of the human. Right. And so it's actually an image of this whore and this beast again. It's like if he brings technology to the service of man and then falls into a cycle of desire that of his, like, being eaten, his own desire being eaten and returning. And being eaten and returning. You know, it's like you. The hunger of. Of insatiability, you could say, is. Is. It's a weird image of that. And so there is a relationship between. So it's like if. So once again, it's like it's not that the fire is. Is. Is evil. Right. Even in the story, the fires at first given by Zeus, if I remember, and then taken away out of. Because. Because people don't. Aren't offering proper sacrifice, then the fire is kind of taken away and then Prometheus takes the. The fire. And so think about that. Like, that's what the story of Cain is. The cane, the sort of. Cain is so similar. It's like because of an improper sacrifice, Cain has to steal, let's say, make civilization. You know, he. He's alienated from God and then he creates the first city out of this. Like, I'm going to do this for myself, to protect myself from others, to protect myself. And then in the story of the Bible, what happens that God saves that, you could say it's like God redeems that through stories. Like he takes what Cain develops and then transforms it into the Tabernacle. Transforms it into. To the temple, basically. But this idea of this kind of. And the frozenness is perfect for that. Right. It's like. Because that's what technology is. It's a fixing, right. It's like, let's fix these walls around our city. Let's make these limits. Let's make these artificial limits around things. And so, yes, your intuition is absolutely right that there's a relationship between all of these things."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4006.3,"end":4036.28,"speaker":"Jacob Howland","text":"Yeah. And. And actually it's a small detail, but in Dante, he compares Lucifer or Satan to. So he's got these bat wings, basically, which are blowing, and the wings are, you know, freezing, you know, freezing the ice and we. All this water. So it's like frozen chaos. He compares them to the wings, to sails on a windmill. Okay. And then when he talks about Lucifer's teeth eating these guys because he's constantly eating these. Eating them. Which is also, by the way, an image of insatiability."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4036.36,"end":4036.96,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4036.96,"end":4078.39,"speaker":"Jacob Howland","text":"He compares it to what he called. It's a hackle, which is some kind of agricultural tool. Okay, so this is kind of mechanistic thing. Prometheus is. It's actually very interesting. God Zeus finally gets back at the human beings with. By creating Pandora, Okay. And Pandora, it's very interesting. So this is where we get a mixture of erotic desire with technology. Why? Because what happens is Athena makes this beautiful garment for her, okay. It's this lovely thing. And Hephaestus gives her a crown, intricately worked. And of course, Hephaestus is the craftsman God, intricately worked crown on which all the animals are represented."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4078.39,"end":4080.87,"speaker":"Jonathan Pageau","text":"So it's like a whole cosmos, microcosm."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4081.34,"end":4171.88,"speaker":"Jacob Howland","text":"Right. And so here's man looking at Pandora, who's going to be a source of ill and, you know, trouble. And. And what's the attitude? The attitude is beautiful, attractive woman, sexually attractive, and check out her crown. You know, the ability to create your own cosmos. Like there's a technological desire there too. Right. Hephaestus is interesting, by the way, because. Well, in the Iliad, there's a scene where Achilles mother goes to him to make armor for Achilles, and he makes this incredible shield. But Hephaestus has these robots, the first robots in history, little maidens, lifelike maidens, running around helping him and stuff. So he's already associated fundamentally with the kind of technology we're developing today. But he is the most humane and decent of the gods. He has been thrown out of heaven, he's crippled. He's all this kind of stuff. But, you know, when Thetis, who's Achilles mother shows up, he's like, so welcoming to her because she saved him when he was thrown out of heaven by her mother or maybe her father, because they both attacked him. You know, I think it was her mother. His. His mother. And she and another nymph or something saved him and nurtured him, and he made beautiful jewelry for them and so forth. So there's a suggestion there of what it would look like to maintain one's. I know he's a God. Right. But, like, maintain his humanity. Yeah. And use technology."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4172.6,"end":4255.12,"speaker":"Jonathan Pageau","text":"Yeah. And I think we can. It's really important for people to always understand, like when we talk about these stories, that to be careful of absolute moral judgment. Because all of these stories all have a flip side to them. It's like, you know, you. You always have to be able to see both sides at the same time, you know, which is exactly what you said. You know, it's like the. For example, medicine is a good example, which is that medicine is technology. It really is. But there's a sense in which Medicine can be the type of technology which is this, the proper supplement, right? The. The type of supplementarity and technicity which is there to, to. To help humans. And I think that, like, the idea that you could represent Hephaestus as this incestuous, you know, like, freak that gets thrown out. And now because of that, he kind of. He's the one who makes all the, all the toys. He's kind of like the guy in his basement, you know, the tech, the tech freak in his basement because he can't fit into society. Like, that's a proper image of, of him for sure. But there's another image like the one you said, which is rather this, this desire to help. Right. You know, if you make a crutch for someone, you make it because you want to help them, you know, and so there's a, there's a powerful image. Like we have to always remember that Jesus was a tecton. You know, Jesus was the son of a tecton. Jesus was the son of a technical person. And it's not a carpenter, per se. It really is a craftsman, you know, so."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4255.12,"end":4295.37,"speaker":"Jacob Howland","text":"So when I was on vacation this summer, I read Paradise Lost, which I hadn't read before. And it's quite amazing. In the very first book of Paradise Lost, we're looking at Satan. He's down in hell. And Milton says something like, you know, you guys, you human beings, you take pride in things like Babel. He actually mentions Babel and, you know, mining and all this construction. He says you should see what they built in hell. Like that is, you know, there's no comparison between the technological capability of these fallen angels and spirits and human beings. And it's really quite remarkable. Right. Like, they excel at that."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4295.69,"end":4296.01,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4296.01,"end":4359.03,"speaker":"Jacob Howland","text":"In this hell where there's heat but no light, you know, it's like this. So that's a really interesting warning. And yeah, I mean, look, what, what has to happen today is that the dynamo has got to be informed. Like, we have to relate to the Virgin as well as the dynamo, just to put it very broadly. And I'm not making a religious statement here, I'm just saying there's got to be transcendence in some way and, and only then can we control it. And the reason I want to say that is you mentioned medicine. Well, you know, if you come in and you've got blood poisoning or something, and I can give you antibiotics or whatever it is, right. And I fix you, great. But now medicine is being used for, you know, anything, sex change, augmentation, whatever. It's because we've got the dynamo, but we don't have the Virgin, so to speak. That is, we don't have. We're not guided by some kind of moral or spiritual measures that we could attune ourselves to."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4359.11,"end":4416.94,"speaker":"Jonathan Pageau","text":"Yeah, no, I think that's the right. I think that's the right. I mean, we have. We saw. During the time, during COVID as well, we saw medicine become a political tool and, you know, become a strange. A strange tool for control. And so all of these. All of these supplements always have this duality to it. And, and you're right that in some ways, I mean, the only thing we can do. And this is because it's like we're just painting this. This monstrous portrait of what. Of where we are in the future. But I think that the thing we can do, which is actually the way to anchor the dynamo, is to, you know, is to go to church, is to go to participate with your family, is to re. Engage at the human scale because that will reverberate. It's the only thing that can really reverberate. You know, it's like become a better person, become a loving father, become you. Become a. A friend. Like, I know it sounds. It almost sounds kitschy to say that, but I don't see what else is possible."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4417.34,"end":4435.94,"speaker":"Jacob Howland","text":"No, look, what you're saying is we have to engage in the practices and it, you know, like, set the thinking aside. Engage in the practices, and the practice is a source of understanding. And that's what we've gotten away from it. But here's the thing. We have to be very deliberate about it."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4435.94,"end":4436.58,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4436.58,"end":4438.06,"speaker":"Jacob Howland","text":"We have to say, look, you know."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4439.16,"end":4449.56,"speaker":"Jonathan Pageau","text":"In some ways, that which was the most natural for humans, you know, a thousand years ago is now has to be the most deliberate behavior that we can. That we can muster."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4449.56,"end":4530.55,"speaker":"Jacob Howland","text":"That's exactly right. And that means that with regard to all of our institutions, say schools, they should be in person, they should be in a classroom, they should be with a living, breathing human being. They should be, you know, and as great as zoom is, the difficulty is that, you know, you and I came of age before. Yeah, the smartphone and all this stuff. So we actually have this anchor that we can remember, you know, what happens when. When that. That's not there. Right. Then we actually. And, and I'm just thinking of the future here because you, you, you know, you. You painted this unfortunately, rather plausible scenario about kind of totalitarianism and so forth. So how do we prevent that? Right. Well, we have to educate for the Future and we have to. But so it's, look, I mean we each have to do what we can do, you know, I mean, I know it's a sort of cliche, but it's not for us to finish the work. We all have to do what we can and set an example for others and devote ourselves to trying to resist. I mean, I, you know, I don't know. I mean you can also run away and try to get off the grid and so forth and I think that's fine."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4531.43,"end":4555.78,"speaker":"Jonathan Pageau","text":"Some will do that and I think we all have also our, our place. You know, you could say. I think it, I think that there are people that are going to break off and form communities off the grid and are going to create little, you know, Rodrier inspired, you know, communities, that's for sure. I think that is, that is almost inevitable and it's, it probably should happen, but it's, I think some people still have to stay in the fray and, and, and continue to."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4556.1,"end":4556.5,"speaker":"Jacob Howland","text":"Right."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4556.74,"end":4588.67,"speaker":"Jonathan Pageau","text":"You know, and, and it's hard to know who, who will do. Who should do what. It's in some ways that's between, you know, that, that's your. Our own. Each of our. Of our own story. But, but, but of course we also need to, to, to have. At least. I feel like I still need to have one foot in the Matrix and, and I often ask myself the question when, when it. Does it go too far? Like when should you just step out? I'm not sure I have that answer yet. At least for now. I feel like it's, it's, it's important to stay connected to the machine to some extent."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4588.99,"end":4604.87,"speaker":"Jacob Howland","text":"Absolutely. I would be very unhappy if, if you or people like you decided, you know, I'm not going to do the symbolic world. I'm not going to do anything. I'm not going to lecture. I'm going to go to Alaska and you know, make my own, you know, you're. Or something."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4605.75,"end":4606.23,"speaker":"Jonathan Pageau","text":"And that."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4606.23,"end":4626.79,"speaker":"Jacob Howland","text":"God bless you. Right. But that, that's, that would be a withdrawal of your best energies and intelligence from, from the public space. And what we need to do is enter back into the public space as living, thoughtful, creative, active individuals and, and give what we can. Yeah."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4626.79,"end":4645.64,"speaker":"Jonathan Pageau","text":"So Jacob, thanks for, thanks for this wonderful conversations and thanks for your time and also all the work that you're doing to. Yeah. To build some, to re. Sow the seed, you know, to kind of gather together the right minds towards the future. Thanks for your work as well on that front."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4646.04,"end":4648.12,"speaker":"Jacob Howland","text":"Thank you very much, Jonathan. It's been a pleasure."}
{"episode_id":"SW - #309 - 2023-10-13 - Jacob Howland - Technological Cannibalism","start":4648.44,"end":4663.48,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
