{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":0.16,"end":8.48,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I'm playing for you a video that I put out a few months ago called the Metaphysics of Clown World."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":8.64,"end":11.16,"speaker":"Jonathan Pageau","text":"It is in a way a, let's."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":11.16,"end":87.5,"speaker":"Jonathan Pageau","text":"Say a sequel to the video I did a while ago called the Metaphysics of Pepe. And it was prompted by the reappearance of the Pepe meme. But dressed as a clown and trying to help people to understand what's going on with this, how it's not necessarily a extreme right wing meme once again, but that it is trying to talk about the strange inversions that are happening in the world. And so we look at the symbolism of clown related things like the carnival and ultimately the clown itself, and it helps us understand some of the strange things that are going on around us today. So, as you know, the Symbolic World podcast and the videos that I do, it's all done thanks to your support. So if you like what I'm doing, please go to the symbolicworld.com support, check out ways that you can support the podcast. People who support have early access to some of the videos. There's also for certain tiers you can ask questions in advance for the Q and A. And ultimately I've also started making one video per month just for patrons to thank you for your support. And I'm doing interpretation of traditional stories or fairy tales, myths, ancient stories, and I'm also asking people to give me some ideas to do that. And so maybe I will choose yours."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":87.5,"end":88.9,"speaker":"Jonathan Pageau","text":"If you have a good idea."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":89.38,"end":92.18,"speaker":"Jonathan Pageau","text":"So. So enjoy the video and see you soon."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":105.22,"end":106.74,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":107.14,"end":108.82,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":119.72,"end":354.31,"speaker":"Jonathan Pageau","text":"Okay folks, I guess we have to talk about clowns. In the past few months there has appeared, let's say, on the horizon of the Internet a meme, the Clown World meme. In fact, the clown World meme has been around for quite a while, but it seems to have taken on a certain amount of popularity with also the resurgence of a clown version of Pepe the Frog. And so because I gave you all the Metaphysics of Pepe a few years ago with Jordan Peterson, I figured that I am. It is my responsibility to give you the metaphysics of clowns, I guess is the way to put it. And to explain this to you, the meaning of clowns is actually very important to understand right now at this time. I'm going to tell you right away as I start this. A lot of the insight that I'm getting to explain this to you is coming from my brother, Matthieu Pageau, who wrote a book on symbolism called the Language of Creation. And in that book you can deduce most of the things that I'm talking about. Now, although I don't think he talks explicitly about clowns, he talks about foolishness and about costumes and about many of the things which are related to understanding what the. The clown means. And so if you haven't read that yet, guys, check that out. And so here we go with the understanding of the clown. Now, in order to understand the importance of clowns, we have to kind of back up and start at something more broad. We could call it is to understand the meaning of carnivals. Now, when I talk about carnivals, what I'm referring to are we could call them feasts of excess or inversion rituals, inversion festivals. These festivals exist in almost every single culture in one way or the other. Sometimes as particular festivals, other times also as figures who are part of the life of communities. And in the west, we can find the meaning of the carnival in its word. Carnival means the feast of flesh. It is actually referring to the time just before Lent, which is Fat Tuesday in the Catholic tradition, and then also the meat fare, which is a direct translation of carnival in the orthodox tradition. And so in the time just before Lent, we have this meat fair, this carnival, which is the last moments in which we can eat food. It is the feast of flesh. And so you can understand that in that moment, it also becomes a moment of the more traditional things we think about when we think about a carnival. So what do we think about when we think about a carnival? We think of upside down behavior or excessive behavior, garish costumes, just the idea of wearing a costume itself, wearing a mask, hiding yourself, projecting some grotesque figure, some funny figure in the carnival. There's also this notion of noise making, noise making, and also acrobatics, all of this imagery that comes with the festival. Garish behavior, also sometimes inappropriate behavior, something which verges on sexual behavior as well. Of course, that today in the modern carnivals has been taken to. To the extremes where the, you know, near nude dancing and all this inverted behavior, extremely lewd behavior, has kind of taken over the carnival. But even traditionally, even Christian carnivals had probably hints of that that were laid in. There are other carnivals in medieval tradition. There is, for example, a feast which was called the Feast of the Ass."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":354.47,"end":354.73,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #059 - 2019-09-25 - The Metaphysics of Clown World","start":354.8,"end":2066.41,"speaker":"Jonathan Pageau","text":"And in that feast, it happened celebrating the flight into Egypt after Christmas. And it also always came around, you know, around New Year's Day. And so the Feast of the Ass in that festival, they would actually Walk a donkey with a woman on the back of the donkey and a child. They would walk the donkey into the church, all the way up to the altar. And then while the donkey was in the altar, the. At the end of the Mass, instead of saying the final words of the Mass, the priest and the people in the church would bray like a donkey, would make hee haw sounds like a donkey. Another feast which is similar to the, to the. That which is in the spirit of the carnival and in the spirit of the Feast of the Ass, is what was called the Feast of Fools. And this happened at the circumcision of Christ. And, and the Feast of Fools was once again an upside down feast where they would elect a lord of misrule or a foolish bishop, a fake bishop that would act upside down and do everything upside down from what a bishop does and make fun of the ecclesiastical office. Now, of course, these traditions were often condemned by the Church, especially later, after the Middle Ages, they were vehemently condemned by the Church, who wanted to kind of straighten things out. But it's important to understand some. It's important to understand why those festivals came about, kind of what they can mean and what their implications are to understand this upside down behavior, this carnivalesque behavior. One of the things to understand is to understand the, the basic cycle of existence. We need to remind ourselves of this basic cycle of existence, which is, you know, the day you work and then in the night you sleep, you go back into this chaotic state. You know, during the week, in the, in the biblical week, there is the week, and then at the end there's the Sabbath, which is the time where things stop to be productive and start to rest. We have also the same thing with the Jubilee. So we have these cycles where at the end, end of the cycles, you also have these moments where things where logic is no longer what is holding the world together. There is this notion of a little death or a little sleep, and you could call it a little chaos. Now, if you look at the Mardi Gras festivals, when you look at the symbolism, you can understand how it works. And so just as we get towards Lent, we have this excess, we have this moment of inversion, of upside downness. And then what we have is in the Western tradition, we have Ash Wednesday. And on Ash Wednesday it is a moment to remind us of our mortality, where people receive crosses of ash that are from the cycle, the past cycles, palms for Palm Sunday, which are burnt, and the ash is made of that, and they put it on people's foreheads and so there is a. From the excess we have this remembrance of death and also remembrance of residue, of the fact that we go back to dust, the fact that we also will break down and become dust. Now, that is very important in understanding that cycle. In the orthodox tradition, for example, we. The day, the very day of meat fare is at the same time the celebration of the Last Judgment, the remembrance of the last Judgment. And so in that moment of carnival is also linked to this idea of the end. And so the end of our life in terms of Fat Tuesday going into Ash Wednesday, and then the end of our. The end of everything when we think of the Last Judgment. And so to understand, understand that as well, we have to understand the amount that death, the cycle of death is a cycle where things break down into their constituent parts, where we decompose. A good place in the Bible to see a meditation on that is, of course, in the book of Qohelet, in the book of Ecclesiastes, where, according to tradition, King Solomon wrote at the end of his life, where he had reached the height of his reign and then started to tumble into different excesses. And in that tumbling into excess, you could say he comes to the understanding. You could call it the understanding of a holy fool. The understanding that things fall apart, the understanding that. That the world is this cycle, the world is this turning thing and falling, let's say, giving himself up or realizing this, the cycle of existence and how things go up, go down, how different things happen in different times. And so it is a kind of understanding of the vicissitudes of time, where time eats away at space, time eats away at stability and breaks it down. Of course, like I said, if you've read Matthieu's book, you will. You will understand more about that. I don't want to go too much into that particular sphere, but I just want you to see the relationship of this. Of this vanity of vanities. Everything is vanity in, you know, in the version of, that Simon and Garfunkel did of the Ecclesiastes, where they talk about where in everything turn, turn, turn. There is a season, turn, turn. And so this idea of turning and turning and turning, this is represented in the. The Middle Ages and in classical tradition as the notion of the wheel of fortune, where the world is this cycle, this wheel, where if you're up today, you're down tomorrow, and there's no accounting for this turning. You know, nothing is stable, nothing is permanent, and everything breaks down. And so it makes sense to understand how these carnivals appear at These moments in which things are getting ready to break down or a connection with the carnival and the margin. So, for example, I told you about the festival of the Ass. Well, the festival of the Ass is Christ fleeing Israel and finding refuge in a foreign land. And so it is this upside down world where he is leaving his own land, which has become dangerous, and finding refuge in the foreign Egyptian land where the Hebrews were once slaves. And so that going into Egypt is moving into that upside down world where, you know, you become a slave to the foreigner. Of course, Christ does not become a slave to the foreigner. That's a different story. But moving out towards Egypt is repeating that pattern of how the Hebrews went into Egypt as well. And in terms of the feast of the Circumcision, it's a little more complicated. But let's just say that it is like the Last Judgment. You could call the Feast of Circumcision the moment where the periphery is actually cut off. And so just at that moment when the periphery is cut off, there is this kind of celebration of the periphery. And then we cut off the flesh, we cut off the carnival, we cut off the carnal part of the body. Just like from Fat Tuesday to Lent, we cut off the meat. Okay? And so all of this is totally coherent. Even though these festivals were, like I said, often criticized by the church authorities, nonetheless they are very coherent in the way what they're talking about now in, in Judaism, it's quite interesting as well, because they also have a feast like this, which is the feast of Purim. And in the feast of Purim, they are celebrating the story of Esther. Now, if you listen to what I said before, you will see a resemblance in the story of Esther. Queen Esther is a queen in a foreign land and she is married to the king, but the king does not know she is Jewish. And it's a secret. There's this secret element to her identity, or her identity is hidden in that situation. And in the book of Esther as well, the name of God does not appear. In fact, God is absent from the book of Esther. And so you can imagine it as this moment at the end where things are upside down. And that God does not seems to be hidden as well. God is not appearing in the manifest world. It looks like there's this disjunct between the will of God, you could say, and the way that the world is laying itself out. But then in the story of Purim, there is this moment of uncertainty where there is on one hand, someone who wants to kill the Jews and You don't know what's going to happen. You. You don't know how it's going to end. And then finally, at the very end, it flips. And the Jews are blessed, and the ones who wanted to kill the Jews are put to death. And so I've often told you about this double inversion. And so the story of Esther is the perfect example of this double inversion, where the world has been turned upside down and now the people of God are under attack, are going to be killed. And. And in the last moment, through the revelation of some secret, then things flip back and the curse falls on the blessed, and the blessing falls on the curse. And so the Jews. Even today, there's a Talmudic law which says that on Purim, you must drink until you are so drunk that you cannot tell the difference between the blessing for Mordecai and the curse of Haman. For. Which means that, you know, Haman was the one who wanted to kill the Jews, and Mordecai was the Jewish leader who then receives the blessing. So this idea that you must put yourself in a state where you can no longer tell between your left and your right hand, where you can no longer tell between a curse and a blessing, you must kind of put yourself in a moment of absolute chaos. And the festival of Purim is also called the festival of lots of. Which is related to that. This notion of games of chance, you could call it games where you don't know what the result is going to be. Now, first of all, even the notion of games is important to understand in terms of the carnival. If I say carnival and games, obviously you can see the connection. If I say carnival and I say games of chance, you can probably also see the connection. Think of places like Las Vegas. Think of the aesthetics of the. Of the casino and the showgirls and the. And the entertainment and all of that which is related to the world of, let's say, games of chance as we reach, let's say, the end of a cycle, as we go into entertainment mode for a moment. Now, of course, today we. We don't have. We don't. We do celebrate a little bit of Mardi Gras. People do celebrate, you know, Fat Tuesday. But we mostly have. Our inversion rituals are there. We can't. You can't get rid of them. If you try to get rid of inversion rituals, they come back because they're important in helping mark the end. Because you need to be able to see a little bit of the opposite in order to know what the center is. You need to Be able to experience or to. To. To see what inverted behavior is. And so you can imagine inversion festivals as a kind of little. Imagine like a world where we have this chaotic tendency. And if you just bottle it up, if you try to make a system which contains all of our chaotic tendencies, it's just going to boil up. It's just going to accumulate, accumulate, accumulate until it explodes. But if you have a little valve and then every year, every certain amount of time, you let out a little bit of chaos, then what it does is it prevents the people from going into full chaos state. And it is particular to understand that after the Middle Ages, as the Enlightenment arrived, so some of the things that they did was to outlaw all these festivals, to outlaw all the carnivalesque festivals, especially in Protestant countries. These were extremely frowned upon. And you can just see today, you know, how certain types of Protestants oppose Halloween so much because they can see that it is an inversion festival and they're right to see it, but they want the whole world to be able to be contained in. In. In their thing. They don't. They don't. They don't understand the. That the monsters need to continue to exist on the margins, that you can't totally get rid of them, or that if you get rid of the monsters on the margins, there are bigger monsters behind them that you didn't know but those little monsters were protecting you from. So you keep getting rid of those monsters. All you get are bigger monsters. So in our society, we don't have the carnival so much. What we have is some things that have embodied the aesthetic of the carnival. The idea of the carnival is, of course, the county fair or the fairs, the circus, the traveling circuses, the traveling fairs and those really, if you want to see a cultural phenomena that has mythological implications because our world has gone, moved away from the center, a place to look at something which still has a. A kind of mythological form. It is these county fairs. And I don't say that to necessarily to praise these fairs. I say it just as a matter of fact, that if you look at what the fairs look like, you can see, understand, you know, what the carnival is and what it means to be at the end, near death, at the edge of a cycle, you could call it. And so the county fair, one of the things that it has, of course, is you can imagine it as a microcosm, just like everything is somewhat of a microcosm, but you can imagine it as a microcosm from the perception of the periphery, from the perception of the edge, right? And so what are the things that you see at a fair? First of all, you see a lot of spinning. Everything is spinning. The Ferris wheel, all these different rides that are spinning. The carousel with these animals that are spinning around and around and around. Go round and round. Every. If you want to see this going round and round, this pointless turning, or you could call this entertaining. This is entertainment turning, where you go around in circles in order to amuse yourself. This is taken to extremes, of course, in our amusement parks, in our fairs, in our circus, let's say the circus aesthetic. And so the rides are part of that. But also, if you go to a circus, for example, that's where you see the most of it. You see a lot of spinning in terms of acrobatics, flying through the air, turning and turning and turning. And we're getting to it. The ultimate example of this, the highest, let's say purest, most distilled version of this is, of course, the clown. Now, we need to actually analyze the clown, because a clown is that contradictory figure of the edge to an extent that is hard to fully describe. First of all, you can know this by the fact that everything the clown does is exaggerated. Everything that the clown does is, in a way, a parody of an actual action. The clown wears clothes that does not fit, shoes that are too big, pants that are too big. Not fitting is part of the entire aesthetic of the clown. Too many clowns in a car, you know, all of these things that clowns do, all of these types of jokes. Falling down, making someone fall down. The whole idea of accidental anything is this breakdown of meaning. An accident is a breakdown of meaning. So falling down, making someone fall down. The other aspect is, for example, something as simple as the pie in the face. Now, a pie. A pie is. Imagine a pie like the world, okay? Imagine that the pie is the world. I know this is going to stretch you guys a little too much, but the pie is a bowl, and in the bowl is food. So imagine it's the potentiality of the world, right? We get our food from the earth. We get our food from nature. So imagine this is the world. It's this bowl, and in it is a piece of. And then what are you supposed to do with a pie, right? You're supposed to eat it, but then you don't eat it. You take it in the face, right? You get covered in pie. It could be all kinds of other things that you can cover yourself with. You know, it could be covered in filth, could be covered in. The idea is to. But the pie is the particular one, because it's food that you're supposed to eat in order to integrate into your body and, and make it part of yourself. But instead of that, it becomes something that you're salted with and it makes you silly. It becomes a way to humiliate you. Okay? And so the pie in the face is of course, part of that. Another aspect of the carnival or the fair that I forgot to mention is, of course, the games. Now, the games are important at the festival because the games are always trying to hit a center from far away. So you're standing far away, trying to hit a dart in something, you're trying to shoot at something, you're trying to get a ring to go around a bottle. All of these are the same image, right this distance from the center, trying to get it. And obviously, in carnival games, we all know that most of the carnival games are rigged and you can pretty much never really succeed, or so rarely that, you know, you end up spending more money on the game than you could ever win. And so understanding that is also part of this kind of upside down carnival clown world. Now, another aspect is, of course, the noise making. You know, this honk, honk. This is exactly accidental noises. Honk, honk. This is a symbol of the breakdown in meaning. Imagine someone who's speaking and you interrupt them with what? Honk, honk. Imagine they're trying to say it's honk, honk. This is exactly the interruption, the eruption of chaos into, into. In a normal situation. I mean, the clown, of course, that's what the, the. The clown is in general. The clown is also a lot funnier when faced with a straight person, with a normal person. When they go up to them and then, you know, they make fools of the other people, then they end up making fools of themselves. All of that is part of, of this topsy turvy, upside down world. Another aspect is the capacity or the trying to balance yourself on something. Now, the ultimate image of that, of course, rolling on a ball, you know, walking on a high wire. But rolling on a ball is one of the best ones because it is turning. This turning it is changing. It is, you know, it's showing this turning, this turning, this turning, this spinning that I told you about in the carnival and in the fair and all of that in the circus. And it's bringing it into this idea almost of standing on top of the world and somehow making light of this spinning, you know, being in a certain manner above it because you're aware of it, you know, and this is this is really where I come to what I could call the. The possible redeeming aspect of the clown. Okay? Now, in several traditions, in several cultures, there are such a thing as holy clowns or holy fools. And the purpose of the holy clowns and the holy fools is to show the limit of your system, is to show the mystery, which is that you do not. Your order, your hierarchy cannot contain everything. And by doing that, it actually can reinforce the hierarchy. This is where it's difficult sometimes for people to understand because you could see the clown as being a subversive figure, as a figure that is there to poke at the hierarchy and invert it, put it upside down, make fun of it, mock it. And yes, that is possible. But by embodying the inversion in a conscious manner and by showing the limit of the hierarchy, what it's doing is one, pointing to the mystery, pointing to the fact that there's a higher mystery that is higher than your rules, that is higher than your conventions, that is higher than all that, but then also reinforcing those conventions as well by showing their limit where they pass into unacceptable behavior. And that can be done consciously. Many of the holy fools in the Christian tradition would actually sometimes pretend to be insane, would sometimes pretend to be mentally ill in order to bring out, let's say, the limits of people's behavior and to show that the limits of their behavior. In Native American cultures, for example, in the Lakota tribe, there are certain figures which are called heyoka, and they could call them holy clowns. And their purpose is to do the opposite, you know, to pretend that they're full when there's no food, to make potty noises, to fart during rituals, to show the exception, to kind of show the limit of the order of what is happening. And this is. It participates in the totality, you could say, of the story. It's the same thing that we had in the west with jesters. Jesters played that role in the king's court, which is that the king might tend to be to feel like his hierarchical authority is self sufficient, that it has, that it is completely right. But the jester was there because of his role as a nothing, because of his role as a fool. He was able to actually point out certain things which could be embarrassing to the king. Certain things, certain truths about the king which the king did not want to reveal, certain secrets that the king didn't want people to know that could be embarrassing to himself. He, the jester, was allowed to mention them and tell them because he was outside of the system. You could say, and everybody knew that that was the role that the jester played. Now we see the same, for example, in the story of King David. King David. There is a moment in King David's story where he is in the foreign lands. He's in the kingdom of Gath. And so David pretends to be crazy. He. He drools at the mouth. He pretends to be insane in order that they do not recognize him as being the king. And he's able to escape the foreign king. And so the thing that we have now, this is the problem with our situation now, with our society right now, is that what happens when the carnival is no longer an exception. What happens when the entire world becomes a carnival? And this is. Seems to be where we are right now. We are in this upside down world where the exception is the rule, where we. Where the most valued thing is a comedian. The most valued thing is a honk, honk clown. These are the things that we value. You know, our sexual mores are upside down. Our are, you know, we care about money more than we care about spiritual things. Everything about our society is topsy turvy and upside down. And so in a certain manner, this is possibly the ultimate meaning of the clown. This is possibly the ultimate possibility of the clown. I told you many times about the double inversion. What happens when everything is upside down? If the clown's purpose is to show is to turn things upside down, that is the purpose of the clown. What happens when things are already upside down? Well, possibly the clown is there to put things back right side up. And so if, for example, certain symbols like the rainbow symbol has been taken, you know, to represent certain values and certain morality of exception, certain exceptional sexual behaviors. And this has become a way to praise those and to make them the central tenet of our society, to make them normal, to normalize them. Well, it is possible that the clown can take that and flip it into a crown, flip it into a crown of glory. Just like the rainbow itself is this periphery where the white light breaks down into multiplicity of colors. But the rainbow goes. The rainbow is actually a circle. It goes down and it goes up, you know, and it is possible to flip that symbolism so that, you know, the circle turns once more and puts things back on their feet. And so I hope this. This description of clowns and the importance of clowns and maybe the profound meaning of clowns today might be helpful to you. And so thanks, everybody for your attention and I will see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon pageau videos as well and unsubscribestar. All those links you can find on my website or or in the show description. So thank you and I will see you soon."}
