{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":0.32,"end":70.07,"speaker":"Jonathan Pageau","text":"It is through the personal transformation of people that the world is transformed. It is not firstly through political action, through political activism, through all these things. True transformation happens through you becoming a saint. If you become a saint, then you will transform reality. I'm not against being politically active, but if you think that that's how you're going to fundamentally change reality, forget it. It's like, let's take the United States, for example. Like, you literally have a country that split 50, 50 down the middle, and then everybody's fighting for like the few percentages to win the next election. And so who is winning? Is anybody going to win? How are you going to win? Are you going to destroy 50% of the country? Are you going to just eliminate everybody? Like this kind of culture war stuff is. That's why I tried to avoid it as much as I can. Because the problem of the fragmentation is such a deep problem, it doesn't have a political solution. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":80.53,"end":136.14,"speaker":"Benjamin Boyce","text":"But I did want to understand more deeply what you were talking about, about the Enlightenment. And I guess if the world is going to be re enchanted, then what methodology can we use to explain the world to ourselves and each other? Because while the Enlightenment or that bundle of thinkers and primarily procedures that were born at that time and kind of came together, while it does have problems and certainly can't explain everything, it does have a way of like really drilling down into so called objective truth. Like it does like approach something more solid. And when we start speaking in terms of symbolism, like what is the underlying, like methodology and how do you know when you're going astray? How do you check your notes? How do you like, show your work? Like, like a math problem. Like, how do you like, verify?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":138.54,"end":281.55,"speaker":"Jonathan Pageau","text":"Well, how can I say this? I think we're looking at two different problems, right? One is the problem of, let's say, predicting phenomena, which is, let's take quantifying. And predicting phenomena is very different from understanding the very frame by which we look at reality. That is the frame of hierarchies by which we organize the world, right? Those are two things are very different. You could say it's the difference between a hierarchy of virtues, a hierarchy of values, a hierarchy of importance, and the drilling down of the identities that are identified once that hierarchy is set up, right? So it's like I decide what's most important and then I apply the tools of reason or of scientific methodology. I can apply them to certain phenomena that I identify and then I can analyze them. And so we can't we can't measure both with the same, the same scope. If we try, then we fail. It's like, it's like, it's as if I'm trying to tell you on the one hand to, to put on a scale, you know, the, the, the formula for, I don't know, for certain, you know, certain speeds or certain, certain phenomena. And at the same time, I'm trying to help you understand why you love your wife. And then you say, well, how do you, how can you prove that you love your wife? Like how. And then, and so we, this is the problem. And so it doesn't mean that love is a completely subjective, idiosyncratic thing. It's just that the, the, the, the forms by which we, in which we approach the world are a different type than the phenomena that we analyze and that we quantify. And so they, they, they require different tools, different intuitions. And those intuitions do not have to satisfy the requirements of someone who wants to know how to make, you know, like, gunpowder and what the chemical formula is. They're just not the same thing. I don't know if that makes sense."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":281.63,"end":287.39,"speaker":"Benjamin Boyce","text":"No, it does. But the formula for gunpowder works or doesn't work."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":288.27,"end":288.75,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":289.54,"end":298.34,"speaker":"Benjamin Boyce","text":"How do we know if the formula for hierarchy works or doesn't work? Some way to verify whether or not you're right or wrong."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":298.5,"end":444.11,"speaker":"Jonathan Pageau","text":"So let's use another example, one that's simpler. Let's say, how do you know? Let's say advertising works. Trying to convince people of something using certain methods can function, okay, but it doesn't function 100% of the time, doesn't function with every single person. It's not the same type of criteria. And so you know that there is a hierarchy of goods. Now the idea that people won't completely agree of how that hierarchy lays itself out, that is inevitable. But to deny that that's part of the mechanisms by which we judge the world, that is also a problem. Because what happens when people do that, and you see that in the case especially of the new atheist types, is that they do have a hierarchy by which they entertain the world. They do have a hierarchy of virtues and values. They take it for granted. They don't analyze it, they don't identify it, they judge the world with it. And then they act as if it's just the, it's just the water in which they're swimming. And they can pretend that they're just being scientists and, and reasonable. I'll give you an example that's very simple that I, that I noticed Once it was a discussion between Sam Harris and Dawkins where they were talking about a very controversial subject, which is race and iq, and they were talking about the studies that discussed this. And then Dawkins said, I don't care about that subject. I don't think it's important to talk about that. I thought like, okay, Mr. Dawkins, by what criteria do you decide that that's not high on your hierarchy of values, of things to study? And I would like for us to explore that, because as soon as you start to explore that, then you're in another sphere. You're not in the same sphere as the, the kind of rationalist scientist types think that they always inhabit. And so the, the difference of care is, is part of that. Like, what is it that we care about and how that lays itself out? And so the, the answer is not a simple one. The answer is not like, you know, if you follow this formula, then this is how it's going to, it's going to play out. It's, it's more subtle because it, it has the problem of being the. It has the problem of looking at the mechanism by which we. How can. Let's do it this way."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":444.11,"end":444.59,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":444.67,"end":533.28,"speaker":"Jonathan Pageau","text":"It has the problem of consciousness looking at itself, right? It has the problem of intelligence looking at itself. And that is, that is the, you could say it's the problem of human knowledge and the problem of human civilizations. And it's the problem that's encoded in every single mythology, every single, you know, worldview that, that, that has laid itself out since the beginning of time. It's a very, It's a difficult problem. It's the problem that's happening in the Garden of Eden. Right? It's the problem. These are the problems that we're dealing with. They're very difficult because they talk about the question of how to look at the frame by which I'm looking at the world. And so that's not easy. So it means that, you know, what, what the, let's say the saints would say, and what, you know, some of the philosophers would say is that, or even like, I don't know, a Zen Buddhist would say is that you can arrive at those things by a type of intuition. Insight, right? You can arrive at insight. And that insight is not contained in the mechanisms that I'm trying to bring about. It's contained in, in the, in the type of grasping that happens, right? When you see that things come together and all of a sudden you see a kind of shining light of, of, of unity and you Grasp it. That's insight. Yeah, but inside cannot be. Can very difficultly be explained by discourse that rationalists want to use."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":533.52,"end":534.96,"speaker":"Benjamin Boyce","text":"Okay, I just."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":534.96,"end":681.37,"speaker":"Jonathan Pageau","text":"So you have a, so we have a problem, which is that, which is that on the one hand, this is what all the traditional things are talking about, right? This is what so many of the religious, let's say the theologians, the mystics are talking about, which is the capacity for insight. But you can't totally describe it. You have to play around it, you have to skirt around it, you have to point at it. And then when you have that. So you could say the same like you could. Let's, let's use an example. That's very simple. It's not, there's no woo woo here. I, you know, it's. It's like I can tell you what it's like to, to be in love. I can say it, I can give you, tell you a million ways and what it, what it's like to be in love. But unless you, that happens to you, unless you grasp that, unless you reach that insight, you will never, you will never fully understand what it is. You have to, you have to enter into it with experience. Now the, the ways we talk about it can help guide you in that insight, can help stabilize that insight, can help you. But it's not enough. You have to have, you have to kind of enter into that experience. And it's this. Actually, this is the same for everything that you describe. This is the same for anything that has identity. You know, I can describe a hammer all day long, but the grabbing the hammer in your hand and using it, that's, that's the insight of the hammer. And it's not. It cannot be reduced to its, to its quantifiable things, can be reduced to its description, can be reduced even to its function. There's something about it which is more. And that is, that is the very mysticism that, like that, that, that someone like Lindsay wants to decry. But you can't avoid that because mysticism happens not just in someone in some saint's cave where they're praying and they're having a. It happens every time you encounter unity in the world, every time you transcend the multiplicity of, of of quantifiable things into the unity that binds them together. You're having a little mystical experience. Yeah, that's as true for, it's as true for a pencil as it's true for falling in love or going to church. All these or, or, or, you know, putting your hand on your, on Your breast and, and saying the pledge of allegiance like these. These things are all mystical in their nature."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":681.93,"end":705.58,"speaker":"Benjamin Boyce","text":"Yeah, but the issue then is that when we observe human beings unifying in their unification in a bigger group, like once they start to formulate or to congregate through religions, through creeds, through political parties, businesses, friendships."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":705.58,"end":706.02,"speaker":"Jonathan Pageau","text":"How about that?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":706.02,"end":722.46,"speaker":"Benjamin Boyce","text":"Friendships. Well, friendships is still like families, and friendships is still more organic. But once we get into a higher level, like something beyond a township, there's the capacity for authoritarianism, totalitarianism. There's the same unification, a unification, the."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":722.46,"end":731.58,"speaker":"Jonathan Pageau","text":"Same in a person. A person can have an authoritarian. A person can try to apply authoritarian principle to the multiple aspects that constitute it."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":732.23,"end":732.47,"speaker":"Benjamin Boyce","text":"Right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":733.35,"end":766.14,"speaker":"Jonathan Pageau","text":"All the time. Right. They deny something about themselves. Right. They just try to push it into the. As if it doesn't exist. And they try to compress this idea of repressing certain things in you. That's an authoritarian approach to a single being. And so the authoritarian approach can happen at every level of unity, from the person to the family, to the city, to the state, to the basketball team, to any type of unity is in danger of having that characteristic. There's no. There's no way around it."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":767.26,"end":785.98,"speaker":"Benjamin Boyce","text":"And so when approaching any given group of people, how does one analyze that to see if it's healthy or unhealthy or good or bad or evil or whatever? Like. Like what, what toolset. How do you describe that which allows you to assess whether this unity is proper or improper?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":787.29,"end":1065.97,"speaker":"Jonathan Pageau","text":"Well, the unity itself, I mean, how can I say this? Unities are always around a purpose, right? So first of all, the purpose can be bad, right? You can have a street gang who the fact of their unity is to rob people and kill people. And so the purpose of the unity, that's what unity is always directed towards, purpose. And so you can first of all identify the reason for the unity. And that can be a problem. And then you can also look at the mechanisms by which the unity is manifesting itself, which is that the. You know, the. The traditional vision, I think, of unity is something like a dance between unity and multiplicity, right? It's. It's this kind of breathing in and breathing out. Was it one of my favorite quotes from Rumi, who talks about, you know, he says, you know, if you. If you keep your hand always open, or if you keep your hand always closed, you will be paralyzed. But, you know, actual experience is in the very subtle moving open and closed of the hand. That's how reality works, is this. This subtle dance between unity and multiplicity. And that's how you can recognize if something is balanced or not. And it's. So it's the same in a family. You can see that, right? It's like, if there's too much multiplicity, then it's chaos in the house. And then, you know, everybody's doing their own thing and things are messy and nobody can, and everybody's screaming at each other. And if there's too much unity right then. Then everybody is afraid and everybody is just in line and just doing the things they need to do. And there's no variability, there's no joy. There's no kind of. And so you have to always. No matter what unity you participate in, you always have to find a balance between the two. And that's true of yourself, by the way, as well. If you work 24 hours a day, you will collapse. If you play 24 hours a day, you will collapse. And if you sleep 24 hours a day, you will collapse. Like, there is a balance of attention and distraction. There's a balance of reason and emotion. All of these things are part of how the human being functions. And if you deny one aspect of it, then it builds up and it explodes. And by the way, this is my critique of. Of the kind of rationalist enlightenment mode is that it ignores aspects of reality. It just says. Just says, don't do that. Don't be unreasonable. You know, don't follow your emotions. Just be. Just be reasonable and logical and, And. And scientific and you'll be fine. Right? And that's the equivalent of saying, you know, you could work 20, 24 hours a day if you just don't sleep, Benjamin, you know, just don't sleep. And if you sleep, I'll tell you, oh, I told you not to sleep. Why are you sleeping? If you become distracted, I'll say, well, why are you being distracted? Benjamin, I told you, just pay attention. It seems like you're not following what I'm saying. If you just did what I said, then the world would be perfect and everything would flow like. Like, you know, would flow wonderfully. And so this is the problem with the. This is the problem with the Steven Pinker and kind of, you know, hicks and all of these. These kind of enlightenment types is that they. They decry an aspect of humanity which is part of humanity and is not only part, but is inevitable to humanity. And then they're surprised when they watch it blow up. They're surprised when they see it explode in front of them. And they're like, well, no, we said, just be reasonable and you know, just follow these, these things, and if you do, then you'll be fine. And this is where we are now, by the way. This is the moment where we've reached, which is that the things that the Enlightenment ignored, which is, for example, the means by which we attain unity, that's now exploding at everybody's face. They said, just be reasonable, be rational. If we're just rational and scientific and we, we develop scientific things and more machines and more, and more, you know, and more technology and more science, then we'll all be. Will be. We'll have food and, and wealth and money, and then we'll be happy. Right. But sadly, that's not what's happening. That's obviously not what's happening. And now that narrative is exploding, and it's exploding in the very mechanisms that gave birth to it, which is that now we have people at OpenAI doing rituals and invoking who knows what into their AI God. And everybody's surprised. As if this was not something that has been building up since after World War II, basically."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1067.09,"end":1122.85,"speaker":"Benjamin Boyce","text":"Well, I mean, I guess we are in the shadow of World War II, where, let's just say various different powers and principalities organized in various different ways. We have Japan, we have Germany. Germany became. Or Italy became Fascist, Germany became National Socialist. And they began to purge their population to create some sort of very incredibly sharp, like, intention, like one very sharp unity. And since then, America and the Allies come and they break apart the unity, or the unity breaks itself apart, or it causes a reaction in other parts of the multiplicity of humanity to kind of counter it. But in the North Americas at least, we're very wary of unity. Again, we see, I guess, this guy Rob Reiner, who's like this bleeding heart liberal on Twitter, always decrying the far right. He never talks about the right, he always talks about the extreme right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1122.93,"end":1124.29,"speaker":"Jonathan Pageau","text":"There's only the far right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1124.37,"end":1159.08,"speaker":"Benjamin Boyce","text":"There's only the extreme right. And, you know, I think he's producing a documentary about Christian nationalism, but his entire mode is Christian nationalist. It's just progressive. It's just a version of Christianity that purged religious talk out of it, but just transferred all these religious concepts onto the notions of humanity and progress. But it's. It's the same. Like, that's the real Christian nationalism is woke. It's the one that's infected every part of our governing apparatus. That's Christian nationalism. It's just downstream from an older version of itself."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1159.08,"end":1216.06,"speaker":"Jonathan Pageau","text":"But so I have, like, I have sympathy for, for, by the way, for James's position which he says like this is preparing a big psyop. I totally agree with him. I agree with him that of what he's scared of, which is that the, the far left or the, the, the kind of activist left will use the, the resurgence of the relationship between Christianity and nationalism to attack the nation itself and to attack the idea of the nation and of the end of the, you know, your Constitution or whatever. By the way, I'm not American. I always have to remind people of that, your Constitution and all these things. Like I, I completely agree with them, but I think that, I think that the mechanisms by which he is approaching that are going to be counterproductive for his, whatever his cause is, you know, because. How can I say this? It's like, let's ask this question for America. Why is America a nation?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1218.7,"end":1220.5,"speaker":"Benjamin Boyce","text":"Because we are a nation at this point."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1220.5,"end":1411.4,"speaker":"Jonathan Pageau","text":"That's right. You go just take it for granted. We're just a, we're just a bunch of people in a land, you know, and that's it. That's it. And so that, so this is the problem that we're, that we're coming towards is that if we've haven't asked ourselves what makes something one for a few hundred years, actually we have. You're right. So there, it's, there's extremes in the Enlightenment world, right? The Enlightenment world, the, the world after the Enlightenment I tried to describe it in, as two extremes that are, are getting further from each other. So if you want to say enlightenment, encounter enlightenment, whatever, that's fine just as long as you understand that they're both caused by the same things that they're both causing each other. Right. If you want to use the word counter enlightenment, I, I don't like it because it makes it feel too simplistic. But you have in some, on the one hand you have an increase in, let's say you could, you could call it like lower identities, right? And then you also have the opposite, which is the desire to kind of break them down. And so you have nationalisms that become strong. Right? The, the nation state is a, is a post Enlightenment phenomena. It's not an ancient phenomena. The way that we understand nations and borders and governments and states and, and bureaucracies. These are not the, the ancient ways of thinking. These are post Enlightenment structures. And so you have the nation which grows and then you have something like the anti nation or, or globalism or communism or revolutionary. Like there's a tendency to want to, to deconstruct that which is being set up as being Stronger and stronger. And so this is still playing out now like that. The same things that led to World War II, you know, are still playing out today because we haven't dealt with any of it. We haven't looked at the root cause of, of the problems we'd brought about, both the nationalism and the communism in, in early 20th century. And so now we have the same problem happening in different guises. And once again, Lindsay is absolutely right to see the insane postmodernism as a continuation of the revolutionary and communist things that burgeoned up in the, in the 19th and early 20th century. But these things are going, are, are, are going to happen. And let's say the nationalism, the centralism is going to keep peaking too, at the same time. And so the globalist tendency towards centralism and the weird things we saw happen during COVID they're all playing out the same patterns of a separation of unity and multiplicity. So it's like people emphasizing too much unity and then people emphasizing too much multiplicity happening simultaneously. So we see kind of global structures of power manifesting themselves and deconstructing powers happening at the same time. You know, I, you know, we wrote. Jordan Peterson and I wrote an essay for ARC recently on this problem, you know, which is trying to articulate subsidiarity as the right relationship between unity and multiplicity all across different levels. Right. The idea."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1411.4,"end":1412.84,"speaker":"Benjamin Boyce","text":"What do you mean by subsidiarity?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1413.49,"end":1620.65,"speaker":"Jonathan Pageau","text":"Subsidiarity. It is the idea that, that there is this tendency to move towards unity, let's say, to a unified state. The ultimate image of this is something like the state and the people, right? So we have people that are just, where, they're just spread out on a, on a board, right? They, they have no connection between each other. They're just all atomized individuals. And then on top of that, you, you have a state which is becoming more and more powerful and more and more controlling. And those two tendencies play on each other. That is the, the anarchic tendency of the modern world. The tendency to deconstruct and to atomize individuals feeds the tyrant tyrannical system. Because as we atomize. Because as we atomize and as we're not no longer connected in little groups like families, like, like clubs, you know, like parishes, all of these things, those, those functions have to be covered by something. And so charity can't. If I'm not like, taking care of my parents when they're old, then the state has to provide for that. The state has to create old people's homes with like, you know, with, with, with taxation and funding or whatever. And so as you, as you disconnect from down here, you, you're, you're demanding even, even if you're, even if you're revolutionary in your attitude, even you're saying if you, even if you're hippie and you're like, yeah, screw the system, break this down, you know, you know, you have to liberate yourself from family, from religion, from all these things and all be a bunch of anarchists, you know, living, living all apart from each other. That's calling the system to, to become more and more powerful. And so those are the two like tendencies, you could say, of the words world since the Enlightenment. And you can see it from, right from the outset with Locke and Hobbes. You know, Hobbes is an authoritarian for a reason because he understands that reason is centralized thing that comes down and he's like, we're going to impose this reason and these principles on the people that are, that are going and that end up becoming more and more atomized as time goes forward. So what we're trying to articulate is that the, the, the principle of subsidiarity, which is the idea that you are, you are made of multiplicity yourself, right? You already have multiple subpersonalities inside you and that, and you have to unite them in a person and that person has to be united in a family and those family have to be united into neighborhoods, into, into cities, into all, all kinds of parallel structures like clubs, like, you know, like, I don't know, the boy Scouts or you and the church and the sports teams and all of these things. And this is actually how, how reality scaffolds itself, how it kind of builds both unity and resilience at the same time. Now the, the, the problem we've got now is you've got these two things. Like there's no, by the way, there's very little difference between like the libertarian anarcho libertarian types and the rainbow coalition types. They're basically saying the same thing. They're saying I can self define myself completely. I can just be me and I can completely be independent. And, and I don't need anything, you know, above me, which is, which is kind of exercising authority over me. And that's, and that when you do that, it calls for, it calls for tyranny. And that's what, that's why, that's what happened in so many of the revolutions is that revolution is followed by tyranny because anarchy calls for authority. Authority."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1623.13,"end":1704.98,"speaker":"Benjamin Boyce","text":"The problem that James brings up Is that there's on a certain level, like the right, the dissonant right, the counter enlightenment, they want to impose some sort of structure. Right. A religious person wants to impose their religious structure on the world. And James is saying, you can't tell me what to do. You're not God. No one person is God. So how does humankind. Because if you look at liberalism, it's nice that you get to be an orthodox person. I get to do my spiritual practice and my parents can be Christian and we can coexist and kind of have a different framework or a different practice, but still somehow come together. And the liberal project of allowing this multiplicity of religious belief, a multiplicity of higher level transcendent orders is kind of nice. It's nice to have Muslims getting along with Christians, getting along with Jews and then not demanding one, you know, one structure or who demands that. And, and if, if what you're saying is that it's unstable on some level to allow for multiplicity on some level, or we. Unity is going to happen. Unity is inevitable. Like, how does one navigate in a post post religious or post unified religious world?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1704.98,"end":1753.54,"speaker":"Jonathan Pageau","text":"Yeah, well, all these different, you know how it happens and you know how we navigate. We end up with, with the WF and the WHO and the UN and that's what we end up with. Right. It's funny that it's like, oh, I don't want any type of moral order over me. As you're saying that. And as the entire world, since the 1960s, hippies have been saying that you watch these structures become more and more powerful and become more and more encompassing and technology making it possible. And so it's like, can I say this? It's, this is not. Like, I'm not an idealist, I hope you understand this. Like, I'm not, I'm not saying we're going to reach some perfect utopia and that we're going to find the solution to everything."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1753.94,"end":1754.58,"speaker":"Benjamin Boyce","text":"Okay?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1755.86,"end":1813.29,"speaker":"Jonathan Pageau","text":"But what I can see is that there is, in this process of moving towards multiplicity and towards more and more unity right now, the nation state is in danger because there is no justification for the nation state. There's no like, basic philosophical justification for its existence on its own unless we have what I believe to be this kind of subsidiary, subsidiary notion that we kind of participate in identities all the way through. And so I agree that the problem of, you know, a kind of, let's say, Islamic approach to Christianity, you know, a kind of idea that right now we could impose, you know, I don't know like some kind of Christian hierarchy over the West. I think that's a ridiculous idea, and I've never advocated for that once in my entire life."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1813.29,"end":1814.29,"speaker":"Benjamin Boyce","text":"Why is that ridiculous?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1814.85,"end":1818.65,"speaker":"Jonathan Pageau","text":"Well, because. I don't know. Do you think that's possible?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1819.61,"end":1822.61,"speaker":"Benjamin Boyce","text":"I don't think it's possible, but so."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1822.61,"end":1848.51,"speaker":"Jonathan Pageau","text":"That it's a ridiculous idea. Okay, posit an idea that's not possible, is wasting your time and wasting your energy, and is not like, what are you trying. What do you think's gonna happen for anybody that. I don't. I don't think I've ever met anybody who thinks that, by the way. But if there are people who think that the only way to do that would be through massive violence, like on the. On your own people, is that what you would do? To impose?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1848.75,"end":1905.2,"speaker":"Benjamin Boyce","text":"Well, no, you're right. I think it is happening. It's just called progressivism, and it's. Oh, yeah, like, that is Christian nationalism. That is just Christianity without. Without the cross in some way, without sacrifice. It's really. It's an interesting phenomenon. It's exact. It's taken a lot of, like, the. What, morality of Christianity and then, like, try to liberate it from, like, this kind of crusty way of thinking that's traditional and symbolic. And it's tried to impose it on bureaucratic levels, you know, with like, these flags and these rainbows. And you can see it producing symbolism that keeps on getting really icky and yucky, you know, but it's because it. There's no order in it, but it is trying to order the world, and it is trying to take over you. You have to. In order to be, you know, increasingly, in order to get ahead in academia, you have to believe in this way of thinking, this DEI stuff, and diversity, equity and inclusion, they're all kind of adapted Christian values of unity."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":1905.36,"end":2069.81,"speaker":"Jonathan Pageau","text":"It's a religious thing, for sure. Yeah, it's definitely religious. But this is what this is. Again, if to come back to the statement that started this whole argument, for example, with me and James, is that this is happening, the world is. Is becoming religious again. I don't think it ever totally stopped being religious, but it's happening at a very fast speed. And the image of that religiosity right now is exactly that. It's like trans is sacred. That's the image of the religiosity. It's like. It's like, I am. You know, you saw that speech in the. In the Joan of Arc play that got put online for like, a week and then scrub from the Internet as If it never existed, where it was basically saying, you know, I transcend. I transcend categories. You know, I am transcendent because I am not one thing. I'm like the Trinity. I am, you know, transcendent in every way. And it's like, that's what we're heading towards, you know? And so the, the problem is that we do need unity in order to function. And what's happening now is, is we're being provided with a. A sacred narrative of unity, which is actually a kind of paradox of multiplicity, right? It's saying something like, multiplicity is our unity, right? It's. Multiplicity is the only thing that, that, that, you know, diversity is our strength, as said our friend Justin Trudeau. But that's what that aesthetic is. It's basically, it's like reducing us all to the most idiosyncratic thing that we can find and making that into a kind of transcendent good that is to be worshiped. But that, that, that. That leads to more. That just leads to tyranny. It just leads to more tyranny. That's why the globe. That's why, like, people are confused, by the way, like, what's the relationship between globalism and, and, like, LGBT activism, you think? Like, how. Because LGBT activism is, like. Is excessive, and it has a kind of aesthetics of, Of. Of carnival and jubilation and, and, you know, an excess and all that. And how does that fit with, like, environmentalism and Covid mandates and all of this kind of tyrannical thing? And the answer is, it does perfectly. If you understand how these two opposites basically feed each other, how one gives birth to the other, how the controlling state wants as much idiosyncrasy as possible. And the development of idiosyncrasy calls for centralization."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2071.57,"end":2079.25,"speaker":"Benjamin Boyce","text":"But what's the moderate answer to that? What's the alternative to that?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2079.25,"end":2201.87,"speaker":"Jonathan Pageau","text":"I think the alternative is really a subsidiary vision of reality. It really is this idea that we are all made of multiplicity. Multiplicity is part of unity, right? It's that which constitute unity. Everything has a center and a margin. Everything has an identity and things that don't totally fit. And so we, we both aim towards the center and have compassion for the margin, right? This is the Christian message, is to say, like, basically say, I, I, I see the ideal, and I aim towards the ideal, but I reach out in love to those that. That don't fit that ideal. I, you know, I give that. I give them a hand and in compassion and love without compromising the ideal. And so I say, I say things like, I say, I say very hard things like, you know, the, the purpose of sexuality is to have children. And sexuality should be lived in a monogamous, you know, marriage without divorce. That's the ideal. And then I look at myself and then I look at everybody around me and I realize nobody reaches that ideal. Nobody, nobody lives that perfectly. Everybody failed, everybody is broken, everybody is a part of that ideal. But I don't compromise the ideal for the fact that we don't fit. We. I rather use love and compassion, you know, to the people around me. So to me that's the only way to go is, that's the only solution for the problem of identity is that we, it's like it's neither tyrannical identity that eliminates all, all the, all the margin, which is what you saw in the Nazis, for example, and, and in kind of extreme nationalism. Right. Nor is it just pure idiosyncrasy. And anything goes and, and everything is equal and, and all values are equivalent. Like those two things are not, are not possible. And, and, and I don't say that as I'm not even talking about a political system. Like everything I talk, I never talk about political systems."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2201.87,"end":2231.08,"speaker":"Benjamin Boyce","text":"Well, that's the danger though, because it's going to translate into politics somehow. Like ark. If ark's gonna do anything, it's gonna have a political impact. So it's going to propose some sort of unity. It's going to propose some sort of alternative. Like you say, there's all these different identities. It's going to have to claim that there's a global, a proper global identity. It's going to have to claim that there's a proper use for something like the un, the wef, some sort of masters of the universe, experts, you know, who, who are in control of the large levers of power."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2231.56,"end":2255.2,"speaker":"Jonathan Pageau","text":"Ark, ark, one of the founding, founding principles of ARC is no compulsion. Like that has been from the very beginning from Jordan Peterson. And you know, there are certain reasons why I participated in Arkansas. You know, I have my doubts about ARK as much as anybody because I don't want it also to become a kind of right wing wf, which is possible. Like that could happen until up to now. I don't see that happening."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2255.2,"end":2264.2,"speaker":"Benjamin Boyce","text":"It can't not happen. If something, if something's going to propose to start to define things on that level, it's going to have to emulate that definition. So when you."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2264.2,"end":2269.8,"speaker":"Jonathan Pageau","text":"But what if the definition we propose is subsidiarity? What if that's A definition we proposed."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2269.8,"end":2284.66,"speaker":"Benjamin Boyce","text":"Yeah. Okay, so fine, you're saying that you're proposing that there's levels to the universe. You're still going to have to do the eye of the pyramid. Pyramid. What is at the top of that pyramid? And then what's next to be God. Okay. And then what's right under God? Like the Pope or the, the fathers. The church Fathers. Right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2285.38,"end":2298.34,"speaker":"Jonathan Pageau","text":"Well, I would say the, The. I mean, of course, as a Christian, I would say the saints, you know, and the testimony of the, of the saints. Not. Not the human authorities that are alive today and have power."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2298.42,"end":2311.64,"speaker":"Benjamin Boyce","text":"Well, yeah, but eventually you're going to get to the people. So you're, you're proposing all these things that are. But, like, there's eventually there's a line. Eventually there's the masters of the universe, like the highest human people who are alive. Like. And what does that system look like?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2311.72,"end":2339.35,"speaker":"Jonathan Pageau","text":"So the system, a subsidiary. The way a subsidiary system looks like is one which many people can understand, which is that higher levels of authority do not mean that they have power over direct power over lower parts of the pyramid, you could say. And so, for example. And you. We have that in our everyday world, which is. The president of the United States cannot tell the mayor of Chicago what to do. Okay, Right. Because the mayor of Chicago has its own. Has its own principality."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2339.67,"end":2340.23,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2340.23,"end":2342.87,"speaker":"Jonathan Pageau","text":"And what do you mean? What. Why are you hesitating?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2343.03,"end":2400.32,"speaker":"Benjamin Boyce","text":"Because. Yeah, directly. No. Indirectly, Absolutely. Federal funding, like the system itself incentivizes or disincentivizes certain sorts of behaviors through funding. That's why we have issues with the civil rights law right now, because it's being used to enforce extra. Like, like it's, it's being used to sculpt culture and to tell people what to do. That is not in the actual documents of the Constitution. Right. Like, the government's not supposed to tell you how to associate what to think, but through civil rights law, it now has the power to influence that, and then it has the power to tell schools what to do. That's why we have, you know, like, with, with the Obama administration, you just have. You watch this thing with the gender issue itself, like going into schools and, and, and pushing a certain ideology through the school. So, no, Biden can't tell Newsom what to do, but the whole system itself tells itself what to do."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2401.44,"end":2586.6,"speaker":"Jonathan Pageau","text":"Okay, so there is a, There is a unbalanced move towards centralism, let's say, that has happened over time in, in the modern state. That's what the modern state itself seems to lend itself to that, to that problem which is like to kind of move towards, towards centralism, but it doesn't take away the basic idea, let's say. So the problem is that what I'm calling for people to do is to participate in a kind of subsidiary from the bottom up, right? Is to understand that you are a person, that you are part of a family and that family can participate in communities, that you can be engaged in your local surroundings, in your church, in your sports teams or whatever. And to see that as being absolutely real and the, and the foundation on which your experience of reality functions and the scaffolding on which reality is built. And I don't see any other way except from a bottom up way of this proper. I don't, I don't. There's no other way because like you said, the only, the only way that you would do it differently would be to create an alternative tyranny to the, to the, to the tyranny that's there at this moment. Which is why just like, just like Jordan Peterson, I agree with him when he said clean your room like not in. Obviously it seems trite when you say that, but it's like the only thing you can really do is be the best friend, the best father, the best, you know, the best connected part of this scaffolding of reality. And that will have ripples, right? It will transform things because the system that we're in, this kind of move towards overt centralization and to more and more centralization and the move towards more and more insane levels of idiosyncrasy and kind of self naming and self creating. It cannot sustain for a long time. There's just no way. It can't hold. And so, you know, like, I'm not a, I don't want to be doom and gloom, but I think that out of the ashes of whatever is coming will be those that had, that had a strong network around them, that have friends and family and that have, and that are part, that are connected locally. That's what's going to rise out of this. Because, because I agree. And that's why if, if ARK ever tries to be something akin to the WF or the UN or some kind of legislating body or some, some type of institution that tries to directly influence laws in different countries, then you can, you'll watch me run out of that with that 100 miles an hour. But with the people that are there now, I don't think that's going to endanger happening anytime soon. Obviously any, any structure can be Captured. That's obvious. We've saw that. We've seen that happen. You know, you saw that happen over our generations. But I don't. Yeah, at least for now, I don't see that as part of the people that I've met there."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2587.88,"end":2629.08,"speaker":"Benjamin Boyce","text":"So we've been talking, like, at this really abstract sociological level. I kind of want to, like, invert the question because in my conversation with James, eventually we have to get to define what an individual is like. If, you know, that's like the building block for. At least he brought that up like, that nobody's really defined individual. Like, what is the individual? And I was asking him, and he's like, so he's working on that. It's like, so what is an individual? Because that's a very important piece of the puzzle. Because if you want to preserve individual rights, then you have to define an individual against a collective or in a collective. And you're saying that there's all this subsidiary multiplicity, identity, individuality, multiple, unity. Individuality, unity, over and over and over."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2629.08,"end":2704.52,"speaker":"Jonathan Pageau","text":"Well, this is the problem of even phrasing it as individual and collective. Like, to me, that's already a problem. Like it. To just understand someone as an individual facing a collective is the beginning of what we're seeing now. It's the beginning of the individual becoming more atomized and the collective being more and more, let's say, encompassing, so that you end up with these weird systems that we're in now. That is not so. I would say that even like, for example, like in Christian theology, we use the word person. It's a much better, I think, a better word than the word individual, which is that the person is already in relationship with others. Right. The idea that you are. That you can completely, completely isolate an individual from everybody else is very difficult. Now, I understand why you have to do that to some extent in the law that is that. That seems necessary to avoid certain problems. But I don't. I think it's dangerous to do it fundamentally, philosophically, to kind of isolate the individual. But you could see that you could just say that a person is a locus of consciousness like that. I don't. I don't think that that's. Is that that weird of a. Of a way to."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2704.52,"end":2705.36,"speaker":"Benjamin Boyce","text":"To. To."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2705.44,"end":2706.4,"speaker":"Jonathan Pageau","text":"To understand that?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2706.4,"end":2713.56,"speaker":"Benjamin Boyce","text":"Well, I mean, you're, You're. You're answering the question. Let me just ask the question so it can be on the record. What is a person? What is a man?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2713.96,"end":2714.68,"speaker":"Jonathan Pageau","text":"What is a human?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2715.08,"end":2716.04,"speaker":"Benjamin Boyce","text":"A human."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2716.76,"end":2788.75,"speaker":"Jonathan Pageau","text":"A human. And so I would say that. I think that's what the, that's what I would say. I would say, you know, a person is a locus of consciousness and that is, you know, in the image of God in the sense that it is not completely isolated. Locus of consciousness. Right. It's a, it's a locus of consciousness that reflects a higher consciousness or higher consciousnesses, however you want to say that. And then that, that engages with other persons, that engages with other faces, other people facing them and, and form bonds and communities and also to some extent exist with and in each other. Like we don't, we don't exist completely alone from each other. We, we. We exist with and, and in each other. And to me that's the, and so the, the ultimate image of a person is an, is a person in the communion of love. It's not a person on their own, you know, I don't know, standing on the corner with a, with a sign asking for their rights. Not that we shouldn't have rights of people, but that the ultimate image of a person is a person in a communion of love. That's. That's what a person is."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2789.23,"end":2791.71,"speaker":"Benjamin Boyce","text":"Okay, what is this love thing that you're talking about?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2792.51,"end":2798.37,"speaker":"Jonathan Pageau","text":"This love thing? Yeah, it's the thing that binds you. It's that love is that which binds."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2800.37,"end":2812.29,"speaker":"Benjamin Boyce","text":"Binds. How, how would you, how would you teach a 10 year old boy to, to, to move towards proper love and move away from improper love? Because there's improper ways of binding, of course."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":2812.69,"end":3023.51,"speaker":"Jonathan Pageau","text":"Yeah. And so that like the entire, you could say that the entire history of, of Christian theology is about understanding proper love, you could say. And you know, actually, you know, it's interesting, Dante is probably one of the best ones. If you want to look at how to deal with proper love. Dante has a great. Dante's comedy is one of the best examinations of that which is that care. Right? We could use the word care. The word care is, is, is, is, is better because it. Today with Heidegger, people kind of understand it a little more, right? It's like care is that which makes you move, right? You don't do anything without care, right? If I go from here to the door, it's because I have a reason to. If I. Right. If I eat an apple, it's because I have a reason to. It's like there's care that is motivating me towards. You could say the rest from that care, right? If I'm hungry, I eat and I hope to find rest from my desire in that, in that, in that movement. And that is what motivates all our Action, right? So you could say that the world is built in care, built by care. And so there are hierarchies of care. There are things that make us live more than others. And if we, if we get that wrong, then obviously we. We're in trouble, right? And so you could say something like, food is good and we should care for it, but there's a limit to which we should care for food. It should be anchored in something that we care for more, okay? Because if we just. If we care for food as the ultimate thing that we love, then, you know, we'll become unhealthy and fat and whatever. And that's true of all the things that we care about. You know, you can become. You can become possessed by anything if you care for it too much. You know, whether it's money, whether it's sex, whether it's, I don't know, it's like success or prestige or whatever it is like. And all of those things are good, all of them, but they're just good at the level that they should. And that's why we, we, you know, in the, the idea of Christian. The Christian theology, Rep. You know, structures the world that way. And so the love of others, you know, is more important, first of all, than, let's say, the love of things. Like, that's the. That's the beginning. It's like if I care for others, then I get more life than if I care for my car. Like, if I, if I love my. My wife and my kids, then I get more and I have more. There's more reality in my life than if I, if I love my car and my car is fine, I can love my car to some extent. It just has to. Right? That's properly organized and that. But that scales also. And you can understand that the love of virtues, for example. And if I, if I understand that certain virtues also provide life to me. Truth, beauty, you know, and that if I love goodness. Right, that's the. I'm almost like a Neoplatonist now. Like, if I love the good itself, then I am aiming towards the highest. The highest. And I'm kind of moving up this hierarchy of love, you could say. So does that make sense in terms of understanding what love is?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3025.67,"end":3027.27,"speaker":"Benjamin Boyce","text":"It was a trick question. But."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3029.27,"end":3033.91,"speaker":"Jonathan Pageau","text":"Asking me what love is a trick question. What did I not see in your trick?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3035.35,"end":3069.4,"speaker":"Benjamin Boyce","text":"I mean, can you really answer that question? Can one really answer what love is? I don't know. It's a tricky question. Let me put it that way. But when you get to something like making meaning of things on a collective level, like through religion. On the level of religion or on the level of absence of religion or I guess the. It's not really an absence. I guess that's your point. That's my point. It's like. Well, it's still there. It's just like. It looks like it's not there. You know, it's just the."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3070.82,"end":3076.18,"speaker":"Jonathan Pageau","text":"There is no absence of religion. That's an. That's. If there's any illusion, that's the illusion."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3076.34,"end":3078.02,"speaker":"Benjamin Boyce","text":"Why is that an illusion?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3079.62,"end":3252.64,"speaker":"Jonathan Pageau","text":"Because we. We need things to bind us together. And those things that bind us together, they are purposes and their orders, right? There's a purpose and an order to a binding together, right? There's a reason why there's a purpose for this pencil and there's an order to it. There's a pattern by which I recognize it's being. So there's a purpose and an order that's true for everything that we care about as humans. And then it's especially true of the things we care about as humans amongst each other, which is that a family meal has purpose and order. A family meal is a ritual. Is a ritual offered to the unity of our family. And it has to have a certain form. It's not. It. There's variability in the form. It's not like every family meal is exactly the same, but there's a limit to that variability, right? Because if I come to the family meal drunk, then I'm going to break the family meal, right? If I stand on the table or if I lay on the floor during the family meal, then I'm going to break the order of that meal which is aimed towards its purpose. That's a little religious ceremony. Family meal is a little religious ceremony. And then a game, a sports game is a little religious ceremony. We come together with a purpose. There's an order, there's a celebration. There's all these things that we're doing together. We wear uniforms and we wear funny hats. All the things that people make fun of or religion is there in a basketball game or in a. In a baseball game. And so it is the means by which we bind together. Now what people now call explicitly religious is when we come together and we unify under a transcendent good. We. We unify under. Into something which is beyond our particularities in every. In every way. Right? That's what that is. But if you. So if you take a. Take a. A village like in Quebec, it's. It's quite nice, like, because we, We In Quebec used to be very Catholic. I'm not Catholic, by the way. So every village had a church, right? And the church is the place where we would go and we would celebrate births, weddings, baptisms, funerals. All the things that help us recognize that we care for each other. We're celebrated at the church in light of something which transcends all of us and which binds us all together. All of humanity is bound together under this. This canopy that we're now celebrating, the things that bind us together in that space. Now, if you take the church out, you're like, well, we don't need this thing. Just get rid of it and all. Now we just need. We just."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3252.64,"end":3253.12,"speaker":"Benjamin Boyce","text":"We just."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3253.12,"end":3305.21,"speaker":"Jonathan Pageau","text":"We'll just be together with reason. We'll be reasonable, and we'll. We'll have reasonable reason together. And. And then you're surprised that. That, like, two generations later, people aren't getting married. Right. People have no initiations at all for their children. You don't know your neighbor. You don't care for your neighbor. You live in a suburb now, and there's no downtown, and there's no place to even walk as a. As a. Together as a community. You have malls, you have houses, and you just are scattered on a board like a. You know, like a bunch of dots. And then you're like, well, how did this happen? What happened? And it's like, that's exactly what happened, is that you try. You thought that you didn't need something to bind you together at a higher level. And then that unity breaks down."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3306.32,"end":3306.72,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3307.04,"end":3308.64,"speaker":"Jonathan Pageau","text":"At every level after that."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3309.84,"end":3390.84,"speaker":"Benjamin Boyce","text":"But pointing out the problem invites the answer, the solution. So, like, how do you go from suburbia back to village life? You can't. Like, how do you put the church back in? I mean, you have these megachurches. America comes up with these different ways of doing that, like, with, you know, like prosperity gospels, different things that serve that function, sporting events, stuff like that. The woke stuff, like, is kind of playing with the same thing in your role as somebody who. Whether or not you want to admit you're proselytizing a certain religious framework, and then you're not imposing, but superimposing it by taking bits of culture and explaining it. Like, you explain these little phenomena, like, okay, well, here. And you're describing a pattern, and you're very good at describing the pattern without imposing your framework on it. But you do have a framework that you live within. You're icon carver. You believe in the transcendent Christ, God, saints, all that stuff. It sounds like you it could be the case. I don't mean this as an accusation, but it's like you're kind of playing both sides. You're like, well, I don't, I don't want to impose my order, but somebody's got to impose the order. So the order is going to be imposed and my order is better than other orders. But maybe you don't want to say that. So you talk about in terms of virtues, you talk."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3391,"end":3395.75,"speaker":"Jonathan Pageau","text":"No, I talk about it in terms of. I talk about it in terms of ground up participation."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3395.91,"end":3399.39,"speaker":"Benjamin Boyce","text":"That's how I talk about, okay, not like I say go to church, but."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3399.39,"end":3426.42,"speaker":"Jonathan Pageau","text":"Like I say, I say go to go to church. Be deliberate about the communities that you have. Be deliberate about your family. Be deliberate about the people around you. Be deliberate about, you know, the, the ways in which you can participate. And that will in the end be the only bull work against what's coming. And so I really don't see, I really don't see."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3426.74,"end":3457.07,"speaker":"Benjamin Boyce","text":"So your humility or like you're stopping from imposing your order on other people is not. Because it's not false humility, it's not like a trick. You're saying you have to find that for yourself, but you're going to have to find it. So find it deliberately. This is what I've found. But you have to go forth and find it. So you're not really proselytizing. Apparently orthodox do that."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3457.07,"end":3490.8,"speaker":"Jonathan Pageau","text":"No, but I do believe that Christianity, I do believe Christianity is the, is the best story the way the truth and the lie, I don't hide that at all. But I, I also don't see how that if that's the best story, I really don't see how imposing it on people is going to be useful. You know, if it's, I'm trying to show the beauty of that story and the, the power of that story so that people, you know, want to participate. But I don't see the, I mean, I, the idea of imposing it top down."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3491.12,"end":3491.6,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3491.6,"end":3499.74,"speaker":"Jonathan Pageau","text":"You know, in this world is, is a ridiculous to me. It's just a, it would be a ridiculous proposition. Yeah. And are there really people who think that? Like, honestly."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3499.74,"end":3500.38,"speaker":"Benjamin Boyce","text":"No, no, no."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3500.86,"end":3510.1,"speaker":"Jonathan Pageau","text":"Anybody who, who says we should have, we should impose Christianity top down in the United States, like, as does. Have you ever met one person who."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3510.1,"end":3513.66,"speaker":"Benjamin Boyce","text":"Says that you can construe certain people's."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3514.62,"end":3524.06,"speaker":"Jonathan Pageau","text":"Is this Rob Reiner's like, fantasy? Like, that's what I think it is. I don't think that there are, I don't think that there are People who, who, who say that I."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3525.6,"end":3629.4,"speaker":"Benjamin Boyce","text":"But there is a worry. Maybe it's a. Maybe it's a straw man. I'm trying to steal me on the straw man. I'm trying to say, to what extent can you avoid tyranny? To what extent? And, and I'm just trying to flesh out your attitude of. And, and you said it, you, you indicated it or hinted at it and that you said, this is the best story. Why would I impose the best story? It's just the best story. I'll just tell the story and it'll prove itself. It's the same thing with two plus two equals four, which is something I kind of like, flippantly brought up with James when we were talking about symbolism. Like, two plus two equals four is some sort of symbolic order. And I'm like, isn't that authoritarian? Like, don't you impose that on the world? He's like, no, it's truth. You just say, it is truth. If you stray from the truth, you won't get anywhere. So it's just like two plus two equals four is the best story. Christianity isn't necessarily two plus two equals four. That's the weird thing about it. And that's when you talk, you kind of have to. I have to immerse myself in your way of thinking because you're not really telling me this, this methodology, but you're always kind of using this methodology. You're picking up symbols. You're. You're telling the story. You kind of have a map about hierarchy and subsidiarity and unity and multiplicity. You have key words that you're doing it. And then when we drill down into your story, you can talk about, like, the actual. We could probably go into, like, any given verse of the Bible, any given passage of the Bible, and you could start to play with that. And I could see in your relationship to that sacred text of yours the truth of it. But it's not like it's not going to be coded in the same way that two plus two equals four is going to be. So I'm just trying to say if people are worried about Christian nationalism, if people are worried that you are fomenting some sort of tyranny, like, I'm trying."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3629.4,"end":3637.38,"speaker":"Jonathan Pageau","text":"To see how you're not getting any of my content. How could anybody watch any of my content think that I'm fomenting a kind of tyranny? I don't think that's possible."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3637.78,"end":3669.44,"speaker":"Benjamin Boyce","text":"Well, because people are scared that in the post, if you're not for liberalism, if you're saying that liberalism is insufficient, that therefore you're trying to impose some sort of unity. But it sounds like you're saying unity is going to happen and there's better and worse forms of unity. So I would rather each individual work on their own unities from the bottom up, work on themselves, work on their family, and then that's the only way we can have order that's sustainable and that's good for all, is that if it comes from ordered people, it comes."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3669.6,"end":3679.56,"speaker":"Jonathan Pageau","text":"I, I totally think that that's true. You know, the, the pillar, you could say, you know, the pillars of the church are the saints. That's how we understand it in, in the orthodox tradition, which is."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3679.56,"end":3686.52,"speaker":"Benjamin Boyce","text":"That's a symbolic way of. What do you mean? The pillars of the church are the. Like, that's the, that's your total poetry. Like, what does that mean, the pillars of the."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3686.52,"end":3886.19,"speaker":"Jonathan Pageau","text":"What I mean is that it is through the. It. It is through the personal transformation of people that the world is transformed. It is not. It is not first and fore. And, and, and firstly, through political action, through political activism, through all these things, that true transformation happens through you becoming a saint. If you become a saint, then, then you will transform reality. If you, if you create. I'm not against being politically active, but if you think that that's how you're going to fundamentally change reality, then forget it. It's like, let's take the United States, for example. Like, it, the culture war is the most ridiculous thing in the universe. And when you look at it just, just from just one step, you know, away from each other, it's like, you, you literally have a country that split 50, 50 down the middle, and then everybody's fighting for, like, the few percentages to win the next election. And so who is winning, would you think? Is anybody going to win? How are you going to win? Are you going to destroy 50% of the country? Are you going to just eliminate everybody? Like, there's no. This idea that this kind of culture war stuff is. That's why I try to avoid it as much as I can. I get dragged in once in a while, but I try to avoid that kind of stuff as much as I can because, you know, how are you going to. The problem, the problem of the fragmentation is such a deep problem that it doesn't have a political solution. You know, the, the. Anyways, that's, that is, that is how I, that's why I don't advocate for political solutions. Because you're not going to conquer 50 of your country. With a, with what? With an election, like, what, what difference does it make? It. And, and people, like, even now, like, even when I see, you know, I'm a Christian, for example, I'm a Christian, I am against, like, I'm against abortion. That's a moral thing. I'm against all the things that Christians are against. But, but people rejoicing because they overturn some law in the United States and thinking that now they're, the tide has changed, like they're winning the culture war. It's just the most ridiculous thing ever. This is ridiculous. Like, you have half the population against you and you think that you've overturned the law and now, like, this is it. Like, we're gonna, we're, we've got it, we're moving towards victory. The, the problem is so deep that I do believe that the only thing that can solve it is saints in the sense of transformed people, transformed families, transformed communities that will be like beacons for a world that is, that is lost in despair. So if you can be someone that other people want to imitate, that is a much better thing to be than winning. Getting some law passed and thinking that now you finally got like the right amount of people on the Supreme Court, so now we can do the thing. It's like these solutions are heading towards civil war is what they're heading towards. I don't know. I'm not saying you should just do nothing and sit around and wait for the other side to take you over if you're on one side of that cultural divide. But you're not going to find a solution there. There's no long term solution in this kind of political fight."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3886.59,"end":3898.61,"speaker":"Benjamin Boyce","text":"Well, where does sainthood start? Where does this transformed person start to transform? Where have you seen it, like in, in your own life or in the lives of others where you start to see that change happening?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3899.25,"end":3995.08,"speaker":"Jonathan Pageau","text":"Yeah, you have to start. You have to look at your sins, right? Instead of just looking at the sins of others, you have to see your own sins, right? See the places where you fall short of the ideal. See the places where you lie, the places where you, where you, where you twist reality to fit your narrative. Where instead of just looking at how the others do it, right, Try. Start by doing it on your, on yourself. I mean, don't be naive, right? Don't be an idiot and just, and, and ignore when, let's say, things are being twisted by your enemy. But you have to start with yourself. And, and that is, I think, the solution ultimately. And so whether it's politically, whether it's personally, you know, whether it's in your personal relationships, whether it is in your own bad habits, whether it is all these things, that's the beginning. To not be a hypocrite, to not, you know, and we're all hypocrites. We, we, we all have to work on that. But I think that that's the, that's the place to start. Right? It really is. I mean, that's what, you know, it's like that's what the, that's what Jesus said. That's what the saints always say. The saints always say that, say, transform yourself, you know, forgive your. Forgive, forgive people. Right. And so we are looking at a world where forgiveness has become impossible. We see that on the political sphere, we see that in the world around us. So what's the solution? The solution is forgive people. That's the solution. It's not complain because, because forgiveness is impossible. The solution is forgive, forgive others. That's the solution. Forgive your enemies. Like, that's a rough one, it's a tough one, but that's the way to go. I don't see another solution."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":3996.44,"end":4001.32,"speaker":"Benjamin Boyce","text":"What helps you in the project of being a forgiving person?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4004.84,"end":4015.24,"speaker":"Jonathan Pageau","text":"Well, I, I would say the same. I would say that, that the, the testimony of the holy ones, like the testimony of the saints, that helps me, you know, going to confession."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4016.12,"end":4022.68,"speaker":"Benjamin Boyce","text":"Do you have one particular saint that's been with you, I guess recently or over the last few years or throughout your life?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4022.68,"end":4028.59,"speaker":"Jonathan Pageau","text":"Well, I, I, you know, I don't know if you, I mean, you know, I published this, this graphic novel called God's Dog. Right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4028.75,"end":4029.23,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4029.47,"end":4033.19,"speaker":"Jonathan Pageau","text":"And so that's about St. Christopher who is, who is a monster."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4033.19,"end":4033.39,"speaker":"Benjamin Boyce","text":"Right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4033.39,"end":4182.68,"speaker":"Jonathan Pageau","text":"St. Christopher is a dog headed man or a giant, you know. And I think St. Christopher has been very close to me because as someone who is more conservative. Right. That I'm more of a Christian, that I'm, that I'm more on that side, let's say, of the, of the situation. It's been helpful for me to meditate on the, on the saint, that's an exception. On the saint, that's a monster. On the saint, that doesn't quite fit. So that I can maintain compassion for that which doesn't fit, you know, that I can always keep that in mind. That we're all kind of not, we're all kind of broken, we're all kind of dog headed, you know, to some extent and that we should be careful in our judgment of people. Like when I watch people, you know, when I, and I, I, I To be honest, like, I, when I see people reposting tiktoks of obviously broken people that are saying insane things but that are obviously broken and then just like getting, you know, thousands of likes by reposting them to mock them, I don't think that's the solution. Like, I don't think that helps anybody. You know, a lot of the people, A lot of the blue haired, pink haired people that are, you know, cutting off their breasts or that are doing this stuff, they are in deep, deep suffering. And there's a difference between not thinking that their actions and the direction that they're aiming is good. You know, there's a difference between that. Like I can say I think this is not good. Like, I think that the direction which you're aiming, that you're aiming is, is damaging to you and is dangerous. But there's a difference between that and, and mocking them or you know, pointing to them like you would in a freak show. So I would say that those are, those are things that I try to avoid getting involved in. That's why I said, like the culture war stuff is something that I, and, and some people like, confuse me with. How can I say it? Confuse me with my friends or confuse me with people around me because obviously, you know, I've done some things for the Daily Wire. I've done some things for, you know, I've done things around Peterson and these are all people that I care about and that I, that I respect and that I admire. But you know, I, my, my life and my approach is not exactly theirs. Right? It is, it is my, it is my approach and I, and I, and I think, anyway, so I try to avoid that kind of stuff as much as I, as I can, let's say."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4182.92,"end":4183.4,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4183.96,"end":4224.09,"speaker":"Jonathan Pageau","text":"Which by the way, which is why that I love the, I love your approach. I think your approach has been very of all, of all of the, the kind of YouTube approaches. I think yours has been fruitful because you speak to people with compassion and you've been able to, to, to talk to people who would never speak to a right wing whatever or to a, to, to. But that, that are, you know, that, that are very far on one side of the culture war but that are willing to talk to you because they know that you'll give them true attention and you won't try to trick them. You won't try to, you know, and trip them up. And I think, I think that's a, I think that's a great approach. I think that's way more promising than A lot of the stuff that we're."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4224.09,"end":4231.41,"speaker":"Benjamin Boyce","text":"Seeing, it's not as prominent. Yeah, it's a, It's a. It's a different strategy. It's a long, slow."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4231.41,"end":4245.79,"speaker":"Jonathan Pageau","text":"Yeah, you won't get. You won't also get as many clicks, and you won't get as many views. Obviously, the culture war will get you attention. But, you know, I, I think that the sacrificing that for something better is. Is worth it. You know, it's worth it to not play that game."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4245.87,"end":4294.76,"speaker":"Benjamin Boyce","text":"Oh, we should start wrapping up. I do want to. You did just publish either a clip or a video on sacrifice. I think it was an excerpt from another, and I didn't get to watch it because I was watching another one of your shows. But could you just talk for a moment about sacrifice and what it is to you? I was debating with somebody about sacrifice and sacrifice being always giving something up. And if you're giving something up, then you don't really. I just want to understand it because it just means something to me. And I know that you deal with that symbolism as essential, and I think it's just essential to my moral framework that was given to me. It's just like sacrifices putting something aside to gain, not necessarily to gain something else. It's not just transactional in that way. I don't."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4294.76,"end":4295.12,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4295.12,"end":4295.48,"speaker":"Benjamin Boyce","text":"But."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4295.72,"end":4310.44,"speaker":"Jonathan Pageau","text":"No, I, I. So sacrifice, you could say sacrifice is the. Is the foundation of reality. And this is obviously hard for people to understand because we don't live in the. In an ancient world again."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4310.6,"end":4311,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4311,"end":4326.49,"speaker":"Jonathan Pageau","text":"And so the idea that you would take something that is good, for example, and that you would give it up for something better. Right. You would. Or you would. You would. You would kind of offer it up to something which is. Which is more."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4326.81,"end":4329.21,"speaker":"Benjamin Boyce","text":"Yeah. Not necessarily four, but two."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4330.49,"end":4536.33,"speaker":"Jonathan Pageau","text":"Yeah. You can't just give something that you sacrifice something. No, no. But how can I say this? Maybe it is a wager to some extent. There is. How can I say this? We have to. We have to be careful, like I said, not to make it purely transactional. So let me give you an example that's very simple that everybody can understand. It's not magical in any way, which is the way that sports team functions. Right. And so imagine all the players of the team, they want to be successful, they want to win, they want to shine, they want, you know, to be the star of the game. They. This is something that they. They wrestle with, like this desire that they have to do that. Now, the reality is that if they grab onto that, they'll lose they'll lose the game, they'll lose the prestige, they'll lose everything. And so the only way for that desire to embed itself properly in the game is for them to give it up towards a higher purpose. And they say, I will play in a way that my team will win, right? I will play in a way that will take into account the reality of the other players. So I will sacrifice an aspect of my aspiration to a higher good. And the. The. The mystery is that if you do that, that's how you get it in the proper way. That's actually how you. That aspect of you, which is the desire to succeed and to win and to do that, will actually shine. So that's the mystery of sacrifice, right? In the story of. In scripture, you see that especially in the story of the sacrifice of Isaac. It's the most obvious version of that, which is that God tells Abraham, you know, you're going to have a son, and he's like in his 90s. And it's like this ridiculous thing, like, there's no way I'm going to have a son. Not only going to have a son, but your son will have sons. And you'll have so many children, right? They'll become like the stars of heaven. And so finally, in his 90s, God gives him a son. And then God says, all right, now go up the mountain and sacrifice him to me. It's like, what you just gave me this thing, this whole thing that I've been. Everything's been moving towards. Everything's been moving towards me having this son. And now you're saying, sacrifice him to me. And so he goes up the mountain, and at the moment when he's willing to give that up to God, then God gives him back and says, now that it's. It's almost like now that you're. Will. Now that I know that you're willing to give this up towards a higher good. That's how you get it in its proper place. That's how. That's how it. And so you could say. So you could say that. That's. Now, again, this is true about everything, right? If you. If you. If you love a woman and you want to make love to her, but that's the only thing you want, and you're driving towards that, and everything's driven towards that. Like, you won't probably get it or not. Not much. But if. But if it's given up into a higher good, of love and of communion and of and of. Of. Of, you know, aim towards something higher. Then the surprise is that then it will be returned to you like it will. It will come back into your life. And that's true about everything. Right? That's how the world actually works. That's how goods scale is, is if they give themselves up into higher goods. And that's basically the nature of sacrifice."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4536.57,"end":4550.25,"speaker":"Benjamin Boyce","text":"And what does that tell us about love? I think that that's kind of one of the answers of love. Like love is the process that we witness when we participate in letting go towards something higher."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4550.41,"end":4629.94,"speaker":"Jonathan Pageau","text":"That's right. Yeah. No, that's a good, That's a good thing, is that when we. That love always, when you're attentive to love, you'll realize that it only finds its fullness if it's constantly giving up towards the higher. And that's the only place in which it reaches fullness. And every time we stop and we think that this is the top. And it's like, if I can only have enough money, like if I can only get my retirement fund, you know, then everything will be solved. Then you realize that now it's like, you're not going to find satisfaction in that. But if you, you know, if you, if you do those things, but you always scale them up towards something which is more meaningful and more powerful and more full. Full, then you know all those things. You know, what is it that Christ says? He says, search first for the kingdom of God and all those things will be given to you. That is, don't worry about the things, the lower things. If you aim to the top, those lower things, they'll figure themselves out. Like they will. They will play themselves out. But if you try to grasp any of them, then you lose them. You know, that's the, the mystery. It is, it is the mystery of love. But it's also. That's the nature of sacrifice. That's what the function of sacrifice."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4631.94,"end":4633.22,"speaker":"Benjamin Boyce","text":"God is good, but it's rich."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4633.3,"end":4730.51,"speaker":"Jonathan Pageau","text":"Yeah, but you can. So it's. But it's funny because, like, people don't understand it because they see the ritualized version and then they don't understand what ritual is for. And so they just see it as a weird thing. It's like, okay, so you go to this place and then you kill a goat. You know, you burn it and you give it up to God. Like, what the hell are you doing? Like, what is this? Like, what are you. Why does this matter? Like, why are you doing that? And you can only understand it if you apply it. Like, you can, you can understand. Let's take the family meal Again, a family meal is a good example to understand sacrifice. You know, you have a family potluck. It's a. That's even better example, right? And so everybody comes and everybody offers their food up to the family, right? To something beyond them. And so it's a sacrifice, right? It's like. It really is. That's. Now you're really in the world of sacrifice. Like, you know, Aunt so. And so she makes her casserole or whatever, she brings it to the potluck, and then she offers it up to the family. And then the, The, The. The. The blessing will come back down, right? And so we will sit around the table, and then we'll have a feast. We'll eat the food, right? We'll get the food. But the food is offered up to the family, right. It's not just you standing at the. On the corner of your. Of your. Of your table and just eating. Standing, right. It's like it's a ritualized offering up to the family. And if you make an improper sacrifice, you know, with that, what happens, right? If you make an improper sacrifice, if you do it, especially if you do it quite a few times."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4730.75,"end":4731.47,"speaker":"Benjamin Boyce","text":"What do you mean?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4731.47,"end":4741.91,"speaker":"Jonathan Pageau","text":"That. That is that if you don't offer your best. Right. If everybody brings their prepared meal and you come and you don't, you know, you don't put any effort into it."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4741.91,"end":4742.27,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4742.27,"end":4755.13,"speaker":"Jonathan Pageau","text":"That will affect, to some extent, your participation in the family. It will affect or it will reflect your participation in the family. It will reflect your unity. Your. Your participation in the unity of the family."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4755.29,"end":4755.77,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4755.77,"end":4794.42,"speaker":"Jonathan Pageau","text":"And so, so that's exactly, though the, the whole sacrificial system, the sacrifice is more complicated, but that part of the sacrificial system. Can you. You can understand it just by the way in which you do things like that, right? In the way in which you give. The way in which you give gifts to others, for example, in which you take something good and you give it to the friendship that binds you to the other person. Because obviously when you're giving a gift to someone, you're not just giving it to the person, you're offering it to the union of both of you together. That's a sacrifice. It's the same thing as when people would offer goats up to God. It's just at a very. At a lower level."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4794.58,"end":4796.74,"speaker":"Benjamin Boyce","text":"Yeah. With stacks."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4797.9,"end":4799.58,"speaker":"Jonathan Pageau","text":"It stacks. That's right. It stacks."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4800.54,"end":4803.66,"speaker":"Benjamin Boyce","text":"What's coming up for you? Do you have any tours or."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4804.3,"end":4852.18,"speaker":"Jonathan Pageau","text":"I'm trying to not travel as much. Last year was. Yeah, last year was crazy. You know, they after especially because when Covid ended, I just said yes to everything and then all of a sudden I was like gone all the time. And so I've been trying to. To tone down the travel, to have more time with the family and also trying to find ways to travel with my wife or with my family so that, you know, it's not such of a. You know, it's not such of a weird situation. And so that's. So that being careful with that. But I would say the thing I'm most excited about is the. Is the new publishing company. Do you know, I think you probably saw. Started a publishing company called Symbolic World Press and publishing fairy tales. You know, I'm writing eight fairy tales that we're publishing Beautifully Illustrated with. Yeah, it's so. It's. Yeah, let me show you. I got it right here."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4852.18,"end":4852.58,"speaker":"Benjamin Boyce","text":"Please."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4853.94,"end":4870.98,"speaker":"Jonathan Pageau","text":"This is our, our Snow White. Yeah. And it's. It was illustrated by Chris. By Heather Paulington who is an amazing illustrator. She's just like, just astounding. Yeah, she's just great. Yeah, she's really good. It's like, it's so I'm really excited about that and we're working hard to."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4871.46,"end":4872.62,"speaker":"Benjamin Boyce","text":"People can buy that now."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4872.62,"end":4915.38,"speaker":"Jonathan Pageau","text":"Yeah, people can. Well, I mean we're shipping them right now because we did it as a crowdfunder and so we actually today like it's. Things are being shipped like, like today and so you can. People can find it on. I still have a pre order store open on backer kit. People can find it the rights in the white Jonathan Peugeot or something. And that's what I'm most excited about because we're gonna, we're gonna continue to publish the graphic novels and then I'm gonna write these fairy tales as a kind of symphony of, of fairy tales. And. And yes, that's the thing that I'm most excited about. Although I still, I'm still making videos, still doing the YouTube thing. But it's getting harder, I feel. How so you're like. I'm running out of the things that I wanted to say. It's like at some point I pretty much said what I wanted to say and I'm thinking, okay, what am I going to talk about?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4915.78,"end":4919.7,"speaker":"Benjamin Boyce","text":"Yeah, yeah, yeah, that, that you find that."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4919.7,"end":4924.02,"speaker":"Jonathan Pageau","text":"But you have like these discussions with like all these people, so."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4924.02,"end":4958.35,"speaker":"Benjamin Boyce","text":"Yeah, yeah. Well, I mean you get into, you know, it just kind of comes and goes. It's like life, you know, it's like, you know, it rains and then it. Then it dries up and my entry. And also with My interest, you know, my, like, do I really, like, am I, do I want to talk about gender anymore? And yeah. And then I feel bad for my audience. They want to hear more about it. And then I publish a gender episode and a lot of people watch it. I'm like, well, at least, you know, at least it's working. At least the channel's working, you know, but like I'm always, I'm kind of looking for like, what's the new thing? What's the next thing? Like, what's cool? What's next? What's, what's good? Where's the good in the world? And I'm not really. That's really, that's the right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4958.59,"end":4962.86,"speaker":"Jonathan Pageau","text":"That's what I, that's why I'm trying to move towards the idea of telling stories."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4963.1,"end":4963.5,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4963.5,"end":4973.82,"speaker":"Jonathan Pageau","text":"Rather than just talking about it. So, yeah, I've been talking about symbolism for like five, six years now. And I thought, okay, well I've stopped just talking about it. Let's do it, let's tell better stories, you know."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4973.9,"end":4974.38,"speaker":"Benjamin Boyce","text":"Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4974.38,"end":4983.58,"speaker":"Jonathan Pageau","text":"And since all the companies, all the like big media companies are just dropping these, these fairy tales, they don't want them anymore. Just take them, you know, because they're."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4983.58,"end":4985.5,"speaker":"Benjamin Boyce","text":"Yeah. It's an opportunity. It's amazing."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4985.5,"end":4986.46,"speaker":"Jonathan Pageau","text":"It's a great opportunity."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4988.66,"end":4994.18,"speaker":"Benjamin Boyce","text":"So people can order. So these books will be coming out over the course of the next year or so. These books?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":4994.18,"end":5020.9,"speaker":"Jonathan Pageau","text":"Yes. I mean, so we're going to try to speed, we're going to ramp up. So basically the idea is to use the funds from the first books to finance the next one. And so we had a pretty good run with the crowdfunder. And so we're financing the second one, even starting the third one. And so hopefully we can start to put them out regularly, either two at a time or something, we're not sure. So, yeah, so they'll be coming out to try to do it as fast as we can, but we definitely want them to be as beautiful as possible."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5021.06,"end":5023.74,"speaker":"Benjamin Boyce","text":"Wow. I'll have to get my hands on."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5023.74,"end":5057.71,"speaker":"Jonathan Pageau","text":"In some ways like to go against the AI thing that's happening. Right. It's like to just say we're going to make the most beautiful, high quality, thought out story. And the idea is to use some aspects of postmodern storytelling, you know, this idea of self referentiality and also the idea of, of a kind of meta awareness that you see in postmodern stories, like in Shrek for example, when they, they have this kind of weird meta awareness of the, of their storytelling. But to do that towards insight rather than towards cynicism."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5057.95,"end":5058.43,"speaker":"Benjamin Boyce","text":"Oh, yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5058.43,"end":5060.23,"speaker":"Jonathan Pageau","text":"And so basic. Sorry. Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5060.23,"end":5078.93,"speaker":"Benjamin Boyce","text":"People. People mistake the postmodern tactics for the postmodern goal. And you can use those tactics. The tactics are very rich, especially the artistic ones. They just don't. They don't. They're not wedded to cynicism. People think that they're wedded to, like, being met as cynical. No, it's not necessarily. It's. There's a lot of fun there."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5078.93,"end":5079.57,"speaker":"Jonathan Pageau","text":"I mean, Shakespeare."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5079.57,"end":5112.87,"speaker":"Benjamin Boyce","text":"And there's a lot of, like. You break it apart to put it back together. You don't just break it apart to break it apart. You break apart to put it back together. That's part of, like. It serves the story, it serves the creator. It makes the story even more creative because it engages the reader. And the reader, you know, is invited to participate, embed themselves into the interpretation of the story, which is a part of the story. Interpretation is a part of the story. It's not something that comes after or controls the story or defines the story. It's a part. It's an integral part of the story. It's the participation part. It's like the word, the story. It's like the genitals of the story kind of. It's the part of the story that faces outward or that incubates the new."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5113.43,"end":5171.03,"speaker":"Jonathan Pageau","text":"Yeah, I totally agree. So all the postmodern strategies of storytelling are like. Are there in Shakespeare. Like, they'll have plays within the play. They'll have even a lot of the kind of confusing of identity where, you know, it's like someone, you know, pretending to be something, playing something else. And so everything kind of slips and starts to fragment, and there's a kind of awareness of the secret hidden behind it. All of these strategies are definitely useful. And that's what. So basically, that's what I'm trying to do with fairy tales is to. We're doing eight fairy tales, and they're going to become symphonic as you move forward. So we'll set up a little like a story and a world at the beginning. And then there'll be crisscrossing as you move forward, you know, with objects and people and characters and surprises in the story where, you know, you can use, for example, Sleeping Beauty Falling Asleep to help you understand Snow White Falling Asleep. So you can. It's not just like a. It's not just a. It's not just a. An Easter egg reference."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5171.19,"end":5171.51,"speaker":"Benjamin Boyce","text":"Right."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5171.51,"end":5207.49,"speaker":"Jonathan Pageau","text":"It's like. It's a reference that now connects you and helps you understand more deeply what is going on there. So basically using the repetitive nature of, of fairy tales to actually bring more insight into them. Anyways, those are a few of the strategies used, but that's the idea. And to make them in a way that you can read it to an 8 year old, but that as an adult you're also like, huh, okay, I didn't realize that that's what was going on there, you know, like the, the. Okay, so this is what, this is what's being referred to. So hopefully bring insight to adults as well. But that's the, that's the play."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5208.61,"end":5225.01,"speaker":"Benjamin Boyce","text":"Do you have a. My wife wants us to start a Bible study with the kids and I'm wondering like, what would be good for 12? Where would you start? Like if you're doing a, a Bible reading for, for 12, 10 year olds, what you think? David or Kings or Judges or."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5225.17,"end":5243.25,"speaker":"Jonathan Pageau","text":"Yeah, Judges, maybe not Judges, no. Well, I had to learn, I had to learn the hard way because with my kids I was like, I'm just gonna tell them the Bible stories. And then I had them like crying, you know. Okay, that's not the way to go."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5243.41,"end":5245.61,"speaker":"Benjamin Boyce","text":"Do you start with Lot and his daughters?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5245.61,"end":5315.31,"speaker":"Jonathan Pageau","text":"Is that exactly. I started right away with Law and his daughters. That was the first story I told them. Or like the, in Judges, right? The story of the judge that cuts his, the, his, his mistress into 12 pieces. Like all these crazy stories. There are crazy stories in the Bible for sure, but I think that kids should know for sure. Genesis is really important. You know, the creation story, the flood, the story of Abraham, Genesis, Exodus, those stories are, are crucial because they are pattern making. Like they are really cosmic in their implications. They, they have the, the deepest levels of storytelling in them. And then, then really the story of Jesus. So it's like the story Genesis, Exodus and Jesus is probably the best place to, to start with, with kids. And then later you can go into, you can go into other stories. Like you can talk, you can go further into the Old Testament, you know, taking the promised land and then David, King David, all those stories. And then some of the stories, the prophets, like some of the stories of Elijah and Elisha are really, are really interesting for kids. But I would start with that."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5315.63,"end":5318.59,"speaker":"Benjamin Boyce","text":"The one about making fun of a man, a bald man."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5319.23,"end":5327.87,"speaker":"Jonathan Pageau","text":"Yeah, I made a video about that. About the she bears that comes and eats the young people. Yeah."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5328.83,"end":5388.75,"speaker":"Benjamin Boyce","text":"Jonathan, thanks so much for taking time out of your busy schedule to speak with me about this. You know, I didn't want to talk, I didn't want a gossipy thing I just wanted to kind of drill down into this divide about how we approach this, like this really high level thinking about, like, well, if our society is just do whatever you want, how do we survive and how do we start to collectivize? And I think that you and James basically have the same answer, just in different formulations. Like, you have to start with yourself and you have to not be humble. You're not the God of anybody else. Like, you stand before reality and you have to be honest and humble in that and build it block by block. And he's more of on the reason side and you're more on the virtue side or like talking. Speak in terms of love, you know, and that. But I think that you're both. I don't see any terrible divide between you two. So I wanted to kind of facilitate for my own mind, for your own sake."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5389.23,"end":5448.51,"speaker":"Jonathan Pageau","text":"I agree. I don't have a problem with James at all. I always followed his work from the very beginning. I think that the work he's doing, you know, showing the relationship between communism and postmodernism and showing the line, you know, you know, to. To. Between the. Between Gramsci and how. Feeds into the 60s and then the postmodern. I think it's one of the most useful things that is being done right now in the. In the intellectual life. And so I was actually like, kind of shocked that he came after you with such vehemence. And I was like, okay, like, I guess. But I am a Christian. I don't know what to tell you. I'm not going to change that. And I do believe that Christianity is the best story, but I don't identify as a Christian nationalist. I don't even know exactly what that is. I think it's a bullshit category that was made up by people like Rob Reiner, honestly. So, yeah, so anyway, so it's too bad. But, you know, if he ever wants to talk, by the way, if he watches this, I'd be happy to talk to him. I don't have a problem with him."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5448.59,"end":5452.47,"speaker":"Benjamin Boyce","text":"Yeah, no, absolutely. Maybe someday. Hopefully, maybe."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5452.47,"end":5453.14,"speaker":"Jonathan Pageau","text":"Who knows?"}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5453.77,"end":5456.09,"speaker":"Benjamin Boyce","text":"I'm going to end the recording. Thank you very much for joining me."}
{"episode_id":"SW - #324 - 2024-01-30 - Benjamin Boyce - The Inevitable Fall of the Enlightenment","start":5456.09,"end":5473.77,"speaker":"Jonathan Pageau","text":"All right. Yeah, thanks. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
