{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":12.32,"end":58.9,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello everyone. It is my pleasure to be here with James Poulos. Some of you probably know his work. He is the editor at American Mind and at the Claremont Institute. He's also works for the Blaze editor there. You've seen him on all kinds of podcasts, TV shows. He's written for several publications and he's also written several books. And so I'm very happy that he's willing to talk to us about technology. It's planning place in the world today, it's weird connection to spirituality and a vision for the future. So, James, thanks for talking to me."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":59.38,"end":60.5,"speaker":"James Poulos","text":"Hey, good to be with you."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":60.58,"end":108.96,"speaker":"Jonathan Pageau","text":"Yeah, it's great. And so, I mean, I want to start in some ways in a weird way, because there's this recent article that came out, I think it was on future about what's going on at OpenAI and how there's this there, there's these rumors of people doing strange rituals and strange invocations about, and making kind of, you know, figures of the AI and you know, invoking certain things, kind of using we could call some kind of magical thinking or at least thinking that their intentions are related to the way in which AI will develop, at least if we tried to make it the least weird possible. But it also points to some strange things. And so tell me a little bit, I mean, we can start there. What is your perception about that in terms of what the hell is going on in the world of technology? Sure."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":108.96,"end":458.55,"speaker":"James Poulos","text":"Well, I think it's clear, and I laid some of this out two years ago in my book Human Forever. And regrettably, it's becoming more accurate with every passing year. Digital technology has advanced and been developed in a certain direction where it raises these ultimate questions about who we are and why. These are the kind of questions that historically admit of theological answers. And I think what we've seen over the past 500 years or so though, is that despite the best efforts of many different sort of ideologues and rationalists and materialists, these ultimate questions about who and why we are are still only really answerable in theological terms. And so what we're seeing around the world is if you're a civilization, state a big major power with a very old civilization contained within your borders. And you're also a first rank digital power. We're talking about China, United States, Russia, Israel, India, maybe. Europe is kind of in the maybe column on the bubble. If you're one of those powers, the challenge that you face as a result of digital Technology just sort of integrating and eating everything is a specific kind of challenge of statecraft. And that challenge is by what authority can you claim convincingly, legitimately in the eyes of your, your people to extend or even re establish your sovereignty over the technology within your borders? What I've seen unfold, and I think we'll continue to see it unfold, is that statesmen in those countries are resorting to the original or foundational religion of their people, of their civilization. In Russia, obviously we're seeing, and they announced this openly in 2020, built a big new cathedral in Moscow, said this, you know, this isn't just a new building. This inaugurates a fundamentally closer relationship between the military and the church. You see this, yes. In Europe, where the Vatican wants to be right at the forefront of these discussions about like, well, you know, maybe Europe's not the best innovators, but gosh darn it, we're the best regulators. So we're going to apply the laws in the way that has kind of the most rectitude so that we can get our arms around this technology. In China, I think there's a debate going on right now between really sort of Marxist or post Marxist materialists who think like quantity is equality all its own, and Taoists, and they've got Buddhism and Confucianism out there. Some of the best. I think most perceptive Chinese observers on the technological situation are pretty open about saying, you know, hey, we're going to get this right in a way that the west doesn't, because the west has this kind of dualism thing going on and we don't. We have this harmonious concept of the cosmos and that's going to help us with regard to digital technology. India, you know, the, the, the Hindu nationalists are definitely making decisions about how to chart a technological course based on that kind of religious fundament. And in the US and in the, the Anglosphere, you know, there is a, on a good day a very lively and rob and on a bad day, a sort of nightmarish conflict over exactly what theological presuppositions are going to be justifying the way that technology is treated and used within our civilization. So I'm laying all this out for the purpose of saying there's one other sort of religious framework that has been thrust to the fore by digital technology. And it's not any of the pre existing, you know, monotheistic or polytheistic religions. It is worship of technology itself. And what we are seeing coming out of large chunks of Silicon Valley and specifically with regard to OpenAI, you know, we've been seeing this for generations. It's really going to start coming to a head. Overt and however, you know, occultish. Very proud and unashamed worship of technology as such, or worship of whatever avatars of technology are seen as kind of opening the floodgates to fundamentally transforming who we are and why we are and carrying us into a fundamentally new sort of cyborg mode of post human existence. Sounds like a mouthful. I'm trying to condense 20 years of activity down into one answer to a question. I mean, you look at OpenAI, what are the religious foundations at work in the head or the heart of a guy like Sam Altman? Interesting question. Ilya. The guy who's sort of worried about Sam, was involved in some of the practices you describe. The guy's a joint Canadian and Israeli citizen. Doesn't seem to be recognizably operating within a Christian, Jewish, or even sort of vaguely Judeo Christian framework. So these things are coming to a head. It's difficult in the west because we created these technologies, we sort of assumed that they would be our friends or at least not be our enemies. And rather than consummating our form of rule over the world, enlightened and benevolent as we thought it to be, it really seems to be causing that form of rule to implode with obviously dismaying and confusing consequences. So I see that as kind of like setting the table. Try to understand where we are and what we need to do to kind of figure out a path forward."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":459.03,"end":566.47,"speaker":"Jonathan Pageau","text":"All right, so I have two questions. I'll start with the first one. It seems to me like that part of what's going on with the question of technology is somehow the playing out of the revolutionary trope that has set itself up since the Enlightenment, which is that if we understand revolution as a possibility for legitimacy, it's like if we think that by taking power for ourselves and, you know, having a hierarchy, but then from the, from the bottom of the hierarchy kind of coming up and taking it, whether we understand it in the different ways that it's understood Marxist or not, or just the French Revolution or even the American Revolution, that what you see in the, in the mythology, that's related to revolution, if you look at the, the, at the cosmogony, right, you, once you create this revolution, you're then you're always in danger of being revolted against, right? That's the problem. It's like, you know, the, the aristocracy think we'll just kill the king, we'll Just get rid of the king and then we'll rule. But then, you know, once they've done that, then the business people come for them. And then there's this kind of devolving of revolutions. And it seems like one of the things that we fantasized about in our fiction for 100 years now is the idea that the things that we make right, the things that are below us, the things that serve us, would ultimately come up and take power from us. And we can understand that with terror, like in the Terminator or the Matrix and all of that. But that terror also hides a kind of fantasy of what is possible. And so I wonder if there isn't something of a mode of thinking that we're in that makes not only it possible, but makes it almost inevitable that we're moving towards a place where we will be. We almost dream of being taken over by the things that we create because we believe that. We believe in that pattern of being."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":566.55,"end":925.73,"speaker":"James Poulos","text":"You could say, yes, that is, this is. This is going to be difficult for us to wrestle with because look for the past several cycles of major innovation with regard to communications technologies. I'm talking about the print era, the electric era, just sort of borrowing from Marshall McLuhan. You have these kinds of, of revolutions, or what appear to be revolutions, where the fundamental way in which we communicate and in which our faculties and our senses are extended jumps forward. In a certain sense, the west did pretty well, all things considered. And not specifically the west, but really the Anglosphere. Europe didn't do so hot when electricity arrived. The United States did very well. It's sort of interesting to ponder why. In the US it was sort of like productivity and flourishing, and in Europe it was like wave after wave of slaughter. Something to think about. But the Anglosphere did really well. And I think the way that the legacy of Puritanism in the US and similar trends in the UK and eventually in the Commonwealth, really culturally favored a kind of authority of the book, the authority of the scholar, the authority of critical reasoning, of critical thinking. That whole basket of practices and social institutions that grew up in the wake of the printing press and radio and television. Yes, there were some reasons to be concerned about propaganda and whatnot, but really in the Anglophone west there was a lot of trust and a lot of legitimacy and a lot of authority coming out of those kinds of practices. And I think that drew the Protestant English speaking world and the Jewish world closer together. They shared a lot of that kind of cultural competency and a lot of ambition and productivity flow through those channels. And so as I, you know, as I hinted a little bit earlier, that civilization created the Internet, created the computer, created digital technology, and really thought that like, well, you know, we're, we're on a pretty good streak here. So surely this is just going to be an incremental, linear, progressive advance toward our goals. And you know, maybe it took a crazy Catholic Canadian like Marshall McLuhan to throw a spanner in the works, but you know, when he was laying out his theory of media causes and effects, he said, whoa, it's not that simple. It's not just like, oh, we added more technology, so we're going to get closer to the intended outcome. These media can have profoundly different effects. They don't just have effects where they enhance what's going on, and they don't just have effects where they obsolesce certain things in their path. They also have retrieval effects. And so what that means, to make a long story short, is that when you have a sweeping transformation in the controlling or dominant mode of communications technology, suddenly things that had been pushed way into the background, considered to be obsolete might suddenly come roaring back. And what's come back to the fore as a result of digital technology, I think, are these kinds of deep seated theological questions that suddenly the traditional class of authoritative scholars and experts and culture makers in the west are struggling to answer. You can get up there and say, well, you know, we're going to use facts and logic, or we're going to use tradition, or we're going to stand up for our values, or we're going to, if we get the principles right, if we get the words right, then we're going to get the governance right. And that whole, like that whole movement served us quite well under previous technological conditions. But now all of a sudden technology comes along and says, well, actually no, nature can't stand up for itself. It can't justify itself in the face of technology. Tradition can't justify itself in the face of technology. Conservatism can't justify itself in the face of technology. It needs some kind of support or it needs some other source of authority in order to somehow rise to a more authoritative level, a more spiritual level than digital technology itself, which is being driven at this point in a very forcefully spiritual direction by the people who are, who are worshiping techne technique in its own right. So this is a big challenge for the west. And it's going to take a little bit of, I think, humility and a little bit of willingness to step in an uncomfortable or unanticipated direction in order for Westerners and people in the English speaking world not to kind of go down with the ship of the authority of the best talkers. I mean, here we are trying to be like pretty good talkers, talkers worth watching, and that's important. But I log on every day and I just watch these guys just talking until they're blue in the face, trying to mount these sophisticated intellectual arguments as to why there should be some sort of, not just surrender everything in life to technology. And it's not really working. And so I think bringing a focus to that problem set and being willing to kind of change our approach a little bit could bring, I think, some large and really very badly needed gains."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":926.77,"end":966.32,"speaker":"Jonathan Pageau","text":"So one intermediary question, but I want to get back to what you're saying now because I don't want to lose the thread from before too much, is what do you see the role of some of the global institutions? Because obviously one of the things we're seeing is, is, you know, what Justin Trudeau is saying, we're a post national nation and moving towards the U.N. you know, the WF these, these international institutions as a possible solution to the, the problems that are, that are brought about by the internationalism of technology itself. Right. It's like we, we have this issue of we live in nations, but now we have these technologies that connect us all over the globe. So I don't know if how, how you see the role of these types of institutions in that question."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":967.68,"end":1125.2,"speaker":"James Poulos","text":"Well, I think it's clear that we're going to need some new institutional frameworks. I mean, the World Economic Forum, some people see this as like the, this is it guys. This is the key to all the malevolence in the world. Would that it were so simple. We should expect to see evil or malevolent people at all levels of society throughout all time. So it wouldn't be that shocking if there were some of those guys up in the upper echelons of, of the World Economic Forum or, or institutions that we don't even know the name of. You know, people who, we don't, who are not household names, people who are not. You can't put them on a bumper sticker. Oh, Klaus Schwab bad, you know? Well, he seems to be pretty bad, but there are others and we don't even know who they are. And it's, it's natural, I think, to see people responding to the way that technology is, is eating the world and to the inability of those kinds of consensus institutions familiar to us over The West's many successful centuries, the inability of those things to stop or redirect technology in the face of that kind of trend. Yeah, if you're just a kind of middle of the pack nation state, people are going to raise fundamental questions, well, what is Canada? Why should there even be a Canada? What does it even mean at this point? And a lot of the answers are boiling down right now to, well, enough of all that. That's just a past filled with injustice. We need to purify, rectify the law and absorb ourselves into this. Really just kind of a Borg, like a big cyber regime into which everything can fit. Because it's really kind of like a virtual world and it's intended to be infinite in size and something that you can. You can pile everyone and everything into. You know, I'm an Alexis Tocqueville guy. I was a Tocqueville scholar at Georgetown. I was doing my PhD, wrote my first book on Tocqueville. And it's been, it's been interesting to me, to say the least, to see how many French theorists just over the past 25 years really seem to understand what was unfolding with regard to technology in a particularly insightful way. I'm thinking about, you know, not just Remy Girard, but. But Paul Virilio, John Baudrillard. Like it's. You know, you can go back there and. And read them and sort of like it's. Blow your wig back a little bit."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1125.2,"end":1245.51,"speaker":"Jonathan Pageau","text":"Yeah, no, I totally agree. I was reading Virilio in the 90s and. And he was part of. I mean, he, he was part of the. My change in perspective and kind of re. Understanding Heidegger in terms of what was happening and also seeing. Just moving away from this kind of weird rationalistic way of thinking and seeing that the way that Heidegger presents Dasein and the idea of care really, I mean, form my thinking. And this is what Relio, his work is. I mean, for those who don't know who really is, his work was on speed and scale quite a bit. The problem that acceleration beyond human, normal human interaction is actually affecting our entire worldview. And the idea of these gigantic skyscraper buildings that you walk through that completely obfuscate the sense of human scale are part of our images of the type of despair that come about with modern technology and this disconnection that we feel. But so how do you. I mean, I'm curious to know how you see this. So, you know, the. One of the, one of the solutions like that some people present is basically like, go live in the wood, like, like break off, you know, you have this with it. Saint Paisios, you know, he, he, he said, like, don't worry, my little children, you know, you just have to go live in the woods. Like, if things get too crazy in terms of the kind of techno state, you just have to break off. And I know some people that have been willing to do that. But there's also a sense in which this, this, this thing that's getting set up. Right. This kind of interconnected technological world is also the battleground, you know, for the future. And so I, I'm not sure, I don't know what you think, like, in terms of how you see, you know, actual implementing solutions, you know, at different levels, like in our lives, in the lives of our communities, in order to be able to, you know, I don't know what you think, but, like, integrate technology to the right extent or, or, you know, let's say, protect ourselves from the worst aspects of it."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1246.23,"end":1528.25,"speaker":"James Poulos","text":"Sure. You know, far be it for me to say Saint Paisios was wrong. Certainly, you know, listen, listen to your saints. They are not wrong. Of course, everyone can't go live in the woods or else it, you know, kind of stops functioning as the woods or the desert or. What have you become, another town? Yeah, yeah, it becomes another town. But it is interesting. Know those desert fathers who did, who did isolate themselves in the most radical of ways, you know, in spite of that fact or perhaps because of it, they nevertheless attracted followers. And in some cases, those followers led to the creation of monasteries that are still here. And I think that kind of mysterious way in which radical self isolation, at least from your fellow men can lead to creating these kinds of oases of civilization, of spiritual energy and spiritual strength, that is, I think, going to be a powerful part of the equation. And I think remembering the way that monasteries preserved wisdom and faith in the wake of the collapse of the Western Roman Empire by reordering the application of the most powerful communications technology, script scribal. Scribal technology. You know, there is a metaphor there or a model for, for what kind of monastic life can help us understand how to shape and guide technology, digital technology. That's something I think a lot about. But look, I think, you know, I think it is. It is important for people to admit that if we all just try to Irish exit from the problems of our civilization, many will die and many will descend into abject misery. And that decline which we're seeing everywhere now is going to fuel the longing and the desire for a purely Technological solution for the chip Me daddy, take the pain away. Why should we bother being human at all? It only brings misfortunes. Yeah, the, the priests say that we need spiritual disciplines in order to, to endure, but that stuff's really hard. I don't think I can do it. I'm a broken person. I'm lazy. I want shortcuts, I want fun, you know, all the excuses and all the reasons. And so it will be worth our while, I think, for at least some of us to focus on, on, on doing our best to bring to the attention of people spiritual solutions or at least spiritual practices that will be able to stand up in the face of technology and say, no, there is a higher authority and this is how it can be operationalized in your life right now. You know, the kingdom of heaven is at hand. You, you can right now adopt spiritual practices that will allow you to take what will feel like an almost superhuman kind of control over your passions, your dreams, your senses, your desires. All of these things that make technology seem so tempting and alluring and so much of an ultimate experience. Those kinds of practices. This goes back to the ancient church, to the. The Desert Fathers. The Greeks refer to it as kind of spiritual athleticism, spiritual heroism. This is a more challenging and uncomfortable path, I think, for a lot of Westerners than what so many of us have become accustomed to, which is, well, you know, just get the principles right, just get the laws right, writes down, People will just kind of do what. Do what it says. And because the laws will be rectified or pure, the people will be pure. You know, we can, we, if we get the laws right, we'll avoid misfortunes. People can kind of do what they want and everything will be fine. Well, you know, in some respects, that was kind of just the way things shook out before digital came along in many instances, but now it's not really that way. And now you have code. And code presents itself very convincingly as sort of the ultimate form of law. Law that is perfect and pure because it doesn't have the human element in it at all. It's, you know, it's just, it's just the ma. You know, it's like you remember the, the people who supported Andrew Yang's campaign going around just holding up the science, math as if that this is the answer. You guys, all we just need is."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1528.25,"end":1532.21,"speaker":"Jonathan Pageau","text":"More math, more statistics, and we know we'd solve all the problems, right?"}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1532.53,"end":1748.66,"speaker":"James Poulos","text":"Yeah. So, you know, in the US it's challenging because we do have a constitution. It is still at least Technically in force. And we're not supposed to, we're not supposed to resort to theocracy. Theocracy. There used to be a lot of, a lot of jabber about theocracy during the George W. Bush admin. Oh, these, these Mayberry Machiavellians are going to create this sort of evangelical police state. And you know, of course it didn't really go down that way for, for various reasons. But if you go back to the Puritans, you know, the Puritans were, were small r Republicans. They didn't like monarchy, but they had, you know, they, they did kind of invent a kind of American theocracy where, where the institutions of education became the way that this kind of strict spiritual instruction could be infused into a society that was not monarchical, that was not aristocratic. And I think that pattern, even though it's shed a lot of the explicitly Christian content and has really abandoned the church and the sacraments and saints and bishops and all the rest over the years, you look at what's going on with wokeness and it's really the same playbook. It is. Look, we're going to use strict spiritual instruction to make sure that the elite is able to go into the institutions and purify the law. And that's what we're experiencing right now. So we need to offer an alternative to that and an alternative that works for America, works with the Constitution. And that's going to be a certain amount of permissiveness legally with regard to the development of technology. This might sound strange coming from someone like me who's talking about, like, how, how badly technology is working out right now and how it's. Its trajectory of development is, is undermining our very humanity, and what a disaster that is. And that's true. But I think it only goes to show that if you try to rely on the law, technology will roll you every time. And so you got to be a little bit more permissive, especially in the US when it comes to the legal framework. You got to make sure that ordinary Americans can use fundamental technologies in the same way that they have constitutionally protected right to bear arms and a right to free association. They need to be able to use these powerful technologies in order to strengthen our form of government, strengthen our way of life, strengthen our humanity. And so it becomes all the more important that the backstop or the controlling mechanism that does shape and guide technological development in a more restraining way is not going to come from the law, not going to come from the government. It's going to come from spiritual bodies. And when you look at the size and the scope, the speed and the scale of this digital swarm, we've got basically innumerable, invisible, instantaneously intercommunicative entities here. I think the only body that is capable of. Of establishing a spiritual authority over that global swarm is the body of Christ is the church. And that's going to be something that I think Americans are going to have to kind of learn to look at the situation a little bit differently in order for that to really sink in. But that seems to me to be not just the Beth path, best path, but really, you know, for us, the only path."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1749.14,"end":1900.18,"speaker":"Jonathan Pageau","text":"Yeah. And I think that, you know, it's important for people to understand what you're saying, especially because it might at the outset, for some seem like a contradiction because you're saying, on the one hand, we have to be permissive, but we need the body of Christ to rule. And I think what's important to understand is that authority, true authority, does not manifest itself through just laws. It manifests itself through transformation of, you know, worldview, transformation of will, transformation of perspective. That is true authority. Right. If I can get my children to understand what we're doing and to love what we're doing and to feel like they belong in the family, then I don't need a million rules on how to live in their house. Like, I don't need to tell them every single little thing they need to do because it comes from something deeper. And the type of authority that the church can. Can procure is exactly that. It's a type of spiritual discipline that can bring people into right perspective regarding technology. It's like, if you, right now at this, like, a good example would be like, right now if you. You could try to pass rules to control pornography. But, like, good luck, my friend. Like, it just seems like that's an impossible thing for it to happen. But what is possible is for young men to go to confession and to, you know, to enter into a spiritual practice that will help them focus their intention on what's important. And in the end, that the people that do that, they will come out winners in the end. That is that they will take civilization with them because the rest will. And you can't. You cannot. You can. You cannot have indefinite, torn, addicted civilization like that. That means. How can I say this? It literally means no children. Like, at some point, it literally means lack of. Lack of reproduction. And so. And so I think. I think your. Your vision is the right one. It's a difficult one because it's Not a quick solution. It's not an easy solution. It's actually the hardest solution to propose. And it's one also that cannot be. It's kind of like saying, you know, what do you need to do? Become a saint? What do I have to do? And it's like, what should I do with this? Like, well, just become a saint, you know, and if you do that, then you'll have, you know, as Christ says, you'll have birds landing in your branches. Like, the world will lay itself out properly around people that, that. That are. That are aligned properly. But it's a big challenge to. To. To propose people."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":1900.34,"end":2205.09,"speaker":"James Poulos","text":"Yeah, well, it is a big challenge, but we also have to remember, you know, God can move immediately. And, you know, and Christ himself did not shy away from. From underscoring that if you, you know, if. If you open the door, he'll come in. If you ask, it shall be given to you. And, and so on the one hand, yes, patience is. Is a divine virtue, and humility is a divine virtue. And these things tend to slow us down and tend to take away from us the shortcuts and the substitutes that we are always so inclined to chase after being the mortal and impatient creatures that in this fallen world, we are. But that does not mean that we have to kind of give up on the idea that nothing can move faster than our own invisible robots. That's just not the case. And so, you know, theologically, it is. It is going to require a little bit more of sort of stretching old muscles than I think a lot of Americans are accustomed to. But it's easy to beat up on the wokies. But if you look at what the wokes are trying to do, and you try to take seriously or generously what it is that they're trying to do, they look at worship of technology and they say, well, that's not right. We should really just be worshiping justice. You know, peeling off one. One part of God's attributes and turning that into a God. Not a good idea. But justice is good, right? We like justice. We should have justice. We don't want injustice. And what we see, you know, we can see in the paradox that they're wrestling with, which is, okay, well, if technology is going to eat everything unless we put the right justice worshipers in charge, okay, so then we have this layer of woke virtue on top of technology, and that'll be the thing that controls it, and that'll be the thing to make sure that technology doesn't kill us all or just perpetuate Injustice forever. Okay, great. So, well, then, how do you do that? What is the new governance? What is the WOKE governance mechanism that is going to save us from the very worst of technology? Well, the answer turns out to be, and we just see this every day, and what the Biden administration is rolling out as far as tech regulations goes, goes. Awoke supercomputer, you know, okay, well, we need this kind of. This, this supercomputer that can understand better than any human being every time there's some kind of act of injustice, any microaggression, any micro injustice we need. You know, it's impossible for human beings to really properly understand in a divine way who deserves what at every given time and what ought to be taken from whom and given to someone else. This is clearly a math problem that only a supercomputer can solve. And so the solution is for us to catechize that supercomputer into wokeness so that it internalizes the WOKE religion and pursues perfect justice. Writing the law into everyone's heart, really, you can see how this can be just sort of lifted out of Christian patterns and categories of thought, turned into something else. And sure enough, that's what they're offering. A social justice, social credit system where the feds know every time a dollar leaves your pocket and goes somewhere else, knows what memes you've posted today, how much hate is in your memes, you might go to jail, really, just penetrating down into the most intimate level of human interaction and human conscience possible. And so what we see is that worship of justice ends up just getting folded back into the worship of technology. Well, where we can't have perfect justice unless we perfect the technology. And they get kind of stuck in this vapor lock or this loop, you know, where they're really just chasing their tail. And so worship of justice isn't going to work as an antidote or a restrainer. When it comes to technology and the worship of technology, we got to go all the way up. We got to go to the worship of God. And not just the worship of God as a distant Lord who, you know, maybe some miracles happened a long time ago, but that era is over. Basically, all we can do now is understand God's laws. I mean, that's some people's answer. And again, that worked okay until basically the smartphone became a commodity. Now it doesn't work like it used to. We have to worship God, the Father, who loves us and created us out of love. You know, these things become essential when technology is eating everything else up. Because our creation, by A God who loves us, gives us a degree and a type of spiritual authority that there is no technological substitute for. There can't be a technological substitute for. People can pretend, people can act that way, but you look at what actually happens to them in their lives, and it's, It's. It's a tragedy. It's horrible."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2205.09,"end":2210.09,"speaker":"Jonathan Pageau","text":"Come on, James. The AI can love you. You don't. You're just. You got it all wrong. The AI loves you."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2210.76,"end":2374.78,"speaker":"James Poulos","text":"Yeah, it can simulate love. And this is why they're so dangerous and powerful is, Is because, you know, yeah, they can take jobs or whatever, but really, you know, they're automated simulators. Simulators. They're not really artificial intelligence. They're. They're automated simulators. They can simulate love. They can simulate a boyfriend or girlfriend. They can simulate, you know, they can almost simulate a human soul. It's very powerful stuff. And that illusion is so strong that people begin to think that, like, well, you know, if the simulation is guaranteed, but the reality is going to take some work and, you know, no promises, you might end up being sad. A lot of them are in a sufficiently weakened spiritual condition where they're going to opt for the simulation. And, and if we're gonna. If we're gonna offer them something that is not just better because it's a. It's a traditional practice. It's not just better because, well, it makes you feel better. It's not just better because, you know, it's. Your elders told you that it was better, but it's better because you can actually experience it directly. Even just starting out with a very little bit, you know, and growing your spiritual strength and your, Your. Your spiritual athleticism through those kinds of aesthetic practices, you really can start feeling it almost right away. And that, that's not to say that you should be going after an ecstatic experience, but I mean, look, it's, you know, even just triumphing over something that, you know, is like a persistent sin in your life. Even triumphing over it for one day or even on one occasion, you know, not going to that website that, you know, isn't good for you, you know, like. Like not spending three hours sort of scrolling social media over and over again, cycling through the same four apps. The feeling of spiritual strength that you get from just like triumphing over that sin with God's help, through God's power and love is a real experience. It can be an immediate experience, and it can show you that what seems like an insurmountable task, you can really approach it one little step at a time and actually get real results in your life that start radiating through the rest of your life. That stuff is powerful and it is pretty basic, but it feels out of reach for many people. And the only way that they can really believe and experience otherwise, I think, is through example. You can talk about it a lot, and that's fine, but if they don't see their fellow human beings actually doing this stuff in their real life, it's all going to feel very abstract. So, you know, yeah, go into the woods, go into the desert, but we also got to go into the marketplace, got to go into society. We got to mix it up with our fellow human beings and show them and participate. That's how the Holy Spirit moves through us. And. And if we choke that off, we're going to, you know, it's not going to be a surprise what happens. Yeah, yeah."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2374.78,"end":2421.05,"speaker":"Jonathan Pageau","text":"So you're. So you're American, and we talked about, you know, the, let's say, the tradition of America, and you mentioned how you can see how different nations, different groups are going back to their, you know, their original revelation, or they're going back to the religion of their people in order to build. Have some kind of bulwark against the oncoming AI, whatever is going to happen. And. But my understanding that now you're an orthodox catechumen, and so I'm curious to know. So in America, that's not the most obvious path. And I mean, obviously I'm orthodox, so I have my own reason why I took that direction. So maybe you can formulate a little bit why you're going in that direction, considering it's important for you to be an American at the same time."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2421.69,"end":2922.65,"speaker":"James Poulos","text":"Yeah, well, I'm half Greek on my father's side, so there's a little context there. And ultimately, this kind of move is one that takes place in each person's heartbeat for reasons that can never really be captured, not in a book or in a blog post or on a podcast. And so what I'm about to say, I think, will hopefully be understood in that context. I think what we've seen in the US since the triumph of digital technology and the creation of this kind of. Of machine hegemony that is fundamentally different from, you know. Well, it's one group of people dominating another. No, this is. This is. This is a. A new form of rule. It is something that Americans in America thought, you know, we controlled this, we created it, we're in charge. Well, that just looks to not be the case anymore. And I think that's very Difficult for Americans to wrestle with in terms of their identity, in terms of their spirituality coming out of, you know, centuries of Judeo Christian civilization really just proving itself to be superior to, you know, Marxism or whatever kind of other major attempt ideologically to. To chart the way forward for human beings. And now, you know, gosh, you know, you look at Israel and I've talked to guys on the ground there, and you've got different strains of Judaism, but really no coherent or unified theological answer to what's going on with technology. You look at Christianity in the U.S. you know, once again, no coherent, unified answer to what's going on technologically. I think that's astonishing, really. And I think that it's indicative of the way in which digital technology has really taken the power and the efficacy out of these cultural and social institutions in the kind of Judeo Christian tradition that used to serve us so well. Conservatism, traditionalism, a certain kind of, you know, almost. Almost worship of the book. You know, if we just read the right books, then, then we'll understand how to order society properly. That, that. That had a really great run. And there's no question that, you know, when. When that civilization went up against international communism or went up against, you know, the. The Nazi occultism, it was victorious. And it was victorious in. In large measure because it had a kind of spiritual authority that seemed sufficient to contain and to rightly wield the most powerful technological weapons. You know, you. You got a bunch of Jews and Gentiles together for the Manhattan Project. You created something that could destroy all human life. And because we had a certain kind of spiritual authority that was operative and effective, we didn't destroy all human life. You know, we set a couple of these things off. It was obviously very nightmarish. But sure enough, the war did end, and there was a hugely productive period of, you know, tenuous but real peace and flourishing for the peoples of the West. Do we have a spiritual authority in place today sufficient to assure us that we can use our most powerful technologies responsibly and for the benefit of our form of government, our way of life, and our humanity? I think right now the answer is we don't really see it. Right now. We see guys like Sam Altman and Ilya and the rest of these OpenAI guys running around. We see a lot of. Of Jews and Gentiles sort of abandoning their, you know, the religion of their forefathers in favor of the. The tech religion or the. The woke religion, worshiping tech, worshiping justice, maybe trying to worship both this is a huge problem and you look for kind of theological answers and it's like, well, gosh, you know, if we go back to the Puritans, in a sense, if this is what brought us here, you know, it doesn't really, it doesn't really seem plausible that going back there is going to unearth something that we hadn't found before that's going to provide us the key to re establishing a kind of spiritual authority over technology. You know, the Puritanism couldn't even keep itself going for more than a couple generations. And why is that? Well, you know, it took out a lot of supports from the ancient church. Your town hall was your church. You know, no icons, no statues, no incense. Sacraments got filed down to just one or two. And within a couple generations you went from Jonathan Edwards to Ralph Waldo Emerson. You know, you got to Whitman and Transcendentalism, Oneida, Unitarian Universalism. The bottom dropped out. And I think that's because at its root, Puritanism was a kind of spiritually progressive creed. And it was in a sense concern to, to transcend itself in the quest for this kind of purity. A purity of rules, a purity of law, a purity of instructions. I think that is in large measure what brought us to this kind of reckoning or this crossroads that we're at, to this question mark about what's going to provide spiritual authority sufficient to contain and control technology so that we can wield these weapons well for our defense, not for the sake of destroying ourselves. And so if the solution isn't really going to be, especially in the US isn't going to be a juridical one. It's not going to be about encoding the Pentateuch into the criminal code like the Puritans did or whatever, or whatever woke cognate of that might be. I think it's really going to be something that takes place in the heart. And is it really going to be something that does involve rediscovering and reclaiming the spiritual life of ascetic discipline that was so core to the ancient church. And no church is of course perfect in all of its doings. But I think a lot of what we need most now in order to re establish spiritual authority over technology has been preserved in important ways by the Orthodox Church as a whole. And I think there's just a spiritual thirst, spiritual hunger for those kinds of resources right now. And that tradition has, I think, has been neglected too much in the US too much in the west, and neglected for reasons that might have seemed pretty compelling in Centuries past, but right now we need that and to turn up our nose at it or to say, well, that's not really my tradition, and that seems a little weird. Or, isn't Vladimir Putin a bad guy? Or aren't the Greeks weird? Well, yes, so the Greeks are sort of weird, but that's not a good enough reason. So I think these resources are really important right now, and I think that those who take a taste, who come and see, are moved and are touched by discovering that they can access those resources. And, yeah, it's going to be uncomfortable, and, yeah, it's going to take time, but lots of people are going to the gym now and they're experiencing these sorts of things physically, where it's like, oh, yeah, I realize that if I just kind of put the work in every day and I'm willing to sort of suffer in order to, like, you know, have a. Have a. Change my life, you know, in a way that's going to be more healthy and is going to free me from my dependency on the virtual world. Well, yes. You know, what if I told you you can do that spiritually as well as physically? I think a lot of people are hungry for that. And I think, you know, as Christ says, he's standing at the door knocking, and, you know, gotta let them in."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2922.73,"end":2947.76,"speaker":"Jonathan Pageau","text":"Yeah. All right, so I'm gonna ask you the. The last question. What would that look like? Like what? I know it's hard to predict the future, but, you know, what. How do you see. What would a world in which there is a spiritual authority which is helping us integrate technology appropriately. What do you see that looking like? Or do you have a vision of that at all?"}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":2948.87,"end":3280.29,"speaker":"James Poulos","text":"Sure, sometimes. I will speak of the Bitcoin monasteries, which is a little catchphrase in some of my circles. When I first started talking about this stuff a couple years ago, when it became clear to me that political theory would probably deserve to die along with the rest of the academic disciplines if it couldn't really talk about what's going on with technology. You know, a lot of people were like, james, you know, I don't really understand what you're saying. And now, a couple years later, mostly what I get is, James, I don't really understand Bitcoin. So it's progress. That's good. Bitcoin, you know, it's a world computer. I mean, Vidalik, Ethereum inventor, described Ethereum as a world computer. What's Elon Musk doing with Twitter? Turning into X, you know, the app for everything. He's trying to build A world computer. This is the game. This is the biggest game in town right now, and it's not surprising that it is. And the question is, well, if there's going to be a world computer, and I don't think the AI safetyists have it right either, where it's like, oh, well, just call in the airstrikes, blow up the servers. We got to bomb ourselves back to safety. I don't think we can bomb for safety like that. And I think that that's just a huge source shortcut, a huge act of what the hippies call spiritual bypassing. You know, you don't, you don't need to do that, and you don't want to do that. What you can do, though, is you can gather together people with great spiritual discipline, great spiritual authority, people who have to have proven through their work that they can be trusted. Spiritual guides, spiritual advisors, people who are willing and able to, to. To endure in the labor of praying for the salvation of the world every day. What happens when you provide those people with the opportunity to demonstrate the fruits of using technology in a productively restrained kind of way, channeling the energy of technology in a way that is good for us, body, mind and soul? I think that's an interesting question. I think it's an important question, and I think it's one that we ought to start answering. This is something that has happened throughout history. You know, whether you think of, you know, those, those, those monks in the scriptorium in Western Europe, or you think of, you know, the Byzantines with Greek fire or whatever, or, you know, or you think about peak Judeo Christian civilization, which was able to build a weapon capable of destroying the world and yet didn't destroy the world, used that ultimately in a defensive way and protective way. We can and should do that with fundamental digital technologies. And the kind of spiritual authority that is going to enable us to do that isn't just going to be a copy paste of what came before. It's going to be something that I think Orthodoxy has a great deal to teach people, and I think our Orthodoxy also does have, even though it's right now, a very small footprint in the US Sometimes small is good. Sometimes small can be very effective, sometimes in the same way that sometimes silence is better than just running your mouth about something and demonstrating living out experiencing is more important than explaining getting something like Bitcoin, which the technology's developed, it's mature enough, ordinary people can use it, might be a little uncomfortable, they might have some questions, but it's there, it's ready to be used. You can pick this thing up, you can wield it as a weapon, a defensive weapon, one that protects and strengthens us, gives us the opportunity to exchange goods and services, build algorithmic markets, do cool and productive things that are good and helpful for us rather than having to, you know, to bow and scrape before the board in order to, you know, to get some groceries delivered to your door or to buy a book on the Internet. You don't have to do that. And so marrying that fundamental technology with real spiritual authority is going to, I think, demonstrate how in America, we can still be a very energetic and productive culture where the goods and services flow freely and people with initiative will find ways to plow that insight and that thoughtfulness into their work and have it bear fruit. It can be done. And if those with spiritual authority, tested and trusted, do not put their hands on, on the world computer and restrain it and channel it properly, then others will. Whether it's the Chinese or the Israelis or the European. I mean, there are a lot of people scrambling to figure out exactly how to do this. A lot of those AI companies, you know, let's face it, they're not particularly American in any. In any deep and abiding sense. So, you know, if, if, if, if this incredibly powerful and foundational technology is not taken up by those of sufficient spiritual strength to wield it, well, then others will. And that's a future that I. I just assume not put us through."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":3281.49,"end":3311.98,"speaker":"Jonathan Pageau","text":"All right, well, I think that's a great place to. To end our first conversation. James, thanks for your insight. To definitely be thinking about that. You know, I. The bitcoin monastery thing, you know, it's like I. I have my doubts about it in terms of system. I'm not sure I'd have. I still have to think about it. People have seen me talk about crypto and my issues with it, but I think it is a good place to stop, have people think about. About the different ideas we propose here and maybe organize another discussion at some point. That'd be great. Anytime."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":3311.98,"end":3312.62,"speaker":"James Poulos","text":"Thanks so much."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":3312.62,"end":3313.92,"speaker":"Jonathan Pageau","text":"All right. Thanks, James. Good to talk to you."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":3314.55,"end":3314.95,"speaker":"James Poulos","text":"Cheers."}
{"episode_id":"SW - #329 - 2024-02-26 - James Poulos - Bitcoin Monasteries - Putting Technology to Good Use","start":3315.75,"end":3330.79,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
