{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":12.72,"end":16.16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":26.89,"end":79.73,"speaker":"John Vervaeke","text":"I've been really looking forward to this conversation. I sort of think of you, my conversation with you, as launching me into all of this in some ways. So it's your fault. And, you know, as you've probably noticed, in a lot of my videos, I make reference to you and make references to criticism and comments that you make and respond to them along the way. So I feel kind of like you've been at least virtually accompanying me along the way, and that's been very good for me and the project. It's been really intense, really busy. Luckily, I'm on sabbatical until January, so I've been able to. I'm going to have to cut back on sort of the virtual presence come January, at least a bit. But I did get some very good news. My tenure has come through, so."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":80.05,"end":81.81,"speaker":"Jonathan Pageau","text":"Oh, that's great. Congratulations."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":81.97,"end":94.83,"speaker":"John Vervaeke","text":"Yeah, thank you. So I'm officially get my tenure. So there's been a lot like that. How about you? I mean, are you through the grueling thing of returning to your home? It sounded horrible every time."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":94.91,"end":95.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":95.63,"end":100.83,"speaker":"John Vervaeke","text":"I can see often you were putting sort of a brave face on, like, oh, this is horrible. This is horrible."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":102.03,"end":136.86,"speaker":"Jonathan Pageau","text":"No, we're not. We're not back. We're gonna be. We're probably gonna be back in our house in the summer, like spring summer, just because there are too many things to do on the house and we just ran out of time in terms of winter. And finding a contractor also, that has been crazy because there's 2,000 houses that need to be repaired. And so just even finding a contractor was really difficult, you know, but it's okay. We're. I'm fine. I feel like I'm back into somewhat of a groove. I'm getting carvings out and I'm. I'm. You know, my videos are coming out, and so, you know, I feel."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":136.86,"end":147.5,"speaker":"John Vervaeke","text":"I feel. Yeah, you're doing really good work too, by the way. Really good work. Thanks. Thanks. Like I said, I often cite you in the series and podcasts and interviews."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":148.46,"end":198.62,"speaker":"Jonathan Pageau","text":"Yeah, I've been thinking a lot about. I feel like a lot of the language that you're bringing or the connection that you're bringing in terms of, you know, in terms of consciousness and then trying to connect that to religious language and using specific words, I feel has been really useful for me. I find myself using words that you're using or expressions that you're using because it seems like they're the right. They have the right. They talk about things in a way that people can understand. Because a lot of the problems with religious language is that a lot of the words have been ruined. They've just been completely ruined. And so people don't understand what they're referring to. And it feels like a lot of the words you're using are helping to find another way to talk about things so that people know what's going on. Like, what are we talking about?"}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":198.77,"end":275.65,"speaker":"John Vervaeke","text":"About. Thank you for saying that, because that was a, you know, that was an explicit goal for me. I phrased it from the very beginning about, you know, a conceptual vocabulary and a theoretical grammar. And that's what I would most want to do. Obviously, I'm going to argue for positions because that's the nature of what I'm doing. But that genuinely is secondary to me providing, you know, some deep tools by which people can reflect and think and potentially engage in transformative processes. And it's been. It's been very gratifying that I've received the same feedback from different religious communities too. So I've received similar feedback from Buddhists. I gave a talk, it's on my channel. I was talking with Hamza Tzorus, he was an Islamic intellectual philosopher. And I had a similar response from the Muslim community. So I think. I mean, I genuinely think that's great. And so I'm hopeful that the series that I'm working on now, because I'm putting a lot of work into it, both theoretically and sort of research, empirical, sort of participatory observation. I'm hoping that that will also be the case for the next series. So thank you for saying that. That's very important to me."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":275.89,"end":285.1,"speaker":"Jonathan Pageau","text":"Yeah. The concept of relevant realization, I feel, you know, when just saying it is. It can help people understand what is this about, you know."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":285.1,"end":285.54,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":286.1,"end":349.21,"speaker":"Jonathan Pageau","text":"And so I've been using that term a lot. And this idea of optimal grip and just the idea of finding the balance between two opposites, that the way that you are able to create analogies in different spheres about, you know, the problem of. The problem, for example, of thinking that efficiency is going to. Is if you're just more efficient, that it's going to work. It's like, no, it's not going to work because then you're lacking. You're going to miss the other aspect, which is to give yourself flexibility in order to change. And so I think that that type of discussion is so useful and can help people understand why a lot of utopias are just not possible. They're actually not possible because you always have to leave, leaving buffers and leaving. When people talk about, let's say, a kind of eugenics or some type of eugenics, you can see that it just even rationally can't. It just reasonably cannot work because you don't understand some of these marginal characteristics that you think are useless right now. You just don't understand what they can be."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":349.45,"end":401.08,"speaker":"John Vervaeke","text":"Yeah, I think messing around in our genetics is. Yeah, I agree with that argument completely as you. Well, I do. I just, I think it's. I think the frame problem, all the, all the unknown side effects and the fact that because the way genetics operate, they're going to be dynamically self organizing in ways we can't foresee. So, yeah, I'm deeply suspicious of that. I mean, I'm deeply suspicious of all utopias. I make that very clear in the series a lot. I mean, Alexander Bard has criticized me for that, along the lines, you can't leave the people without a vision kind of thing. But yeah, I'm very wary of utopias precisely because of that kind of concern. Um, they seem to be. It's hard to see them as anything other than hubristic. Right. It's hard to see them as anything other than that for the reasons you just articulated."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":401.56,"end":420.68,"speaker":"Jonathan Pageau","text":"Yeah, I think that one of the things, I mean. So this is as. I kind of discovered your series at first when we had our discussion, you know, it was great. It was. We were kind of discovering each other. And then watching your series, on the one hand, I was like, this is awesome. This is awesome. And then other things, I was like, oh, sir, sir, of course."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":422.35,"end":537.28,"speaker":"John Vervaeke","text":"And part of what I would like to do, I mean, I've tried to show that I take responsibility in the deep meaning of the word, of making myself available, respond to people and to respond to people in good faith and respect and even with affection. That is what I want to do. And I keep showing that this is not just empty words. I think it's fair to me to say I keep exemplifying that that is important to me and I want to give you an opportunity to do that if you wish to take this time to do that. And I trust, you know, the same way I trust Paul. Paul and I will disagree. But like I say, I often try. I trust Paul and I trust you often more than I trust people that I might share the same metaphysical presuppositions with. Because I get. I am convinced that, you know, because, you know, we've spoken at Lake at least a couple times. I've seen you a lot, I watch you a lot. I See you in interactions with Paul. Same thing with Paul. Right. And also now I'm entering in, you know, conversations with, you know, people that deeply influenced by you, like JP and so. And also entering into conversations with Mary. Well, what I'm trying to say there is I trust people who are like yourself and Paul precisely because I get. I have a conviction that you're coming to this in good faith and I'm much more interested in that. Like the last, the video that you commented on. And I commented on it too. I thought the video that JP and Mary made in response to, I thought that was excellent. And I perhaps like to talk about the. One of the points they made at the end because I've been thinking a lot about it because I thought it was a very, very good point and they didn't quite craft it into what I would consider a coherent argument. So I'd like to steal in it a bit, try and build it up into a stronger argument and then discuss it with you at some point because I found that really interesting. The three of us are going to all talk soon, by the way. But that's where you specifically put up. I wanted to put my hand up. No, no, it was with Jordan hall."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":537.28,"end":540.66,"speaker":"Jonathan Pageau","text":"That you did that one, the German hall conversation. The whole time I was like."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":541.94,"end":549.54,"speaker":"John Vervaeke","text":"It was with Mary and JP that you put the thing up about infinite relevance realization. That was. And I wanted to talk to you about that too. So there was two things there. Yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":549.54,"end":656.15,"speaker":"Jonathan Pageau","text":"Okay, so we can start to, I mean, maybe we can start to talk and talk about God because I guess that's the big thing that always keeps coming back up. And so I mean I, I've been kind of following what you were saying in terms of non theism and I understand, I mean I understand Buddhism and Taoism in terms of non theistic religions. I guess my big question is where do you put mind in your system? Like where at what level of reality does it enter into? Because if you, even if you look at these non theistic religions in practice, when they're actually practice, there always ends up being a hierarchy of minds that appears in the practice of it. And so even though you can say something like, I mean even Hinduism, ultimately if you look at kind of Advaita, Vedanta, Hinduism, like it all moves towards non being, but then there's a hierarchy of beings that appear right away right after, let's say the statement of non being. And then you have either, you know, hierarchy of bodhisattvas or a hierarchy of gods or whatever you so so my question is, how do you, like, where does it come into your system? And the second question is if, like Christians, let's say monotheists want to put it up as high as possible, they want to put it up as high as possible. And they do have the idea, like if you look at pronouncements about the divine nature, it's always, it always looks like something that is non theistic. Like if you look at the pronunciations of the mystics on divine nature, it always looks at."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":656.23,"end":670.63,"speaker":"John Vervaeke","text":"And I cite them, I cite them. I give credit, right? I give credit to saying, like some of these ideas, like the term epictasis and others I say I attribute it to the Christian mystics. I don't try and steal those ideas. I make it very clear. I make it very clear that, you know, those ideas are present there."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":671.05,"end":744.73,"speaker":"Jonathan Pageau","text":"But so I guess my point is that even if you, let's say in trinitarian theology, you say something like the divine age cannot be spoken of. The divine nature is non being. You have St. Maximus who talks about God as being and non being together, something like that, you know, like this ultimate aporia. But then as soon as there's, let's say as soon as there's manifestation, as soon as there's manifestation, as soon as there's, you know, persons, let's say anything specific, anything that you can say, anything that you can say, even negatively, like, then there's mind appears, right? And so that, that to me is. So I guess, like, I'm trying to understand, like how you. So if you want to not have, let's say God, like, where does it appear in your system? And then also if you don't want to put it somewhere, like in the system, like, then you have, to me, you have the problem of Maya. You have the problem of everything's an illusion. This, this, you know, the notion that the manifestation is, is always inadequate. Like, is always, is always, you know, verging on nothing."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":744.73,"end":749.05,"speaker":"John Vervaeke","text":"You could say, sure, sure, or nothing in the pejorative sense, not know nothing."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":749.05,"end":749.85,"speaker":"Jonathan Pageau","text":"In the pejorative sense."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":749.85,"end":1247.4,"speaker":"John Vervaeke","text":"Yeah, yeah. Okay. So that's a really complex question, so I might need to talk for a bit. I mean, the answer is seven. It's not going to be like that, right? So first of all, I want to acknowledge that. And I mean, and I can strengthen your argument by pointing to the fact that once you get sort of beyond Plotinus, Neoplatonism goes that way too. You see a hierarchy of godlike beings, for example, in Proclus. So is that a general Tendency. Sure. So I want to acknowledge that I'm a little bit hesitant to say that, you know, everything does it. Zen Buddhism, I think, is really strict on theism, sort of all the way up. But we can talk about that maybe another time. Let's take it that at least there's a preponderance phenomena that support your claim. I think that's fair. I don't want to offend any Zen Buddhists who might be watching and say, no, we just don't do. We don't make any images or have any persons, so things like that. So let's turn it over then. I mean, there's two questions that we have to distinguish and they interact, but they shouldn't be identified. One might be. And I tried to talk about this, and I tried to make a distinction between metaphysical necessity and psychological indispensability. And I hope you accept that I do not treat psychological indispensability as a dismissive thing. It's not like a New atheist kind of, oh, you know, and you just dismiss it aside. Right. It's much more that. I take it that there are certain ways of framing reality that might be indispensable for people's relevance realization to create the meaning that they need for their lives. Okay. So that's. I mean, that's not the same thing as just saying, oh, you know, people have these illusions or stuff like that. It's not intended like that. So might it be the case? Because the reason why I'm saying this is Paul has specifically made this argument in my presence and asked me to comment on it, you know, that it might be that and Paul. So, I mean, part of it is I wanted to be very charitable to Paul out of good hospitality he invited me on. And so I was trying to be very. Well, I wanted to be anyways, because I like Paul a lot. But I was trying to be very responsive, but I couldn't quite get clear. And we sort of run out towards the end because the argument had culminated. If he was making one kind of argument or another, because the argument he seemed to be making is we need to get into the spirit of finesse in order to enter into a proper relationship with God. It's a Pascalian argument. And that the best way we can get into the spirit of finesse is by taking a personalistic orientation. And then that's how we ultimately relate to God. And I. And I sort of. I didn't have any deep criticisms of that, but I'm afraid that I might have. I might have been Unfair to him in that, because I just sort of translated that into my, in my mind into this notion of well, you know, yes, that might be indispensable for people. They might, they might, that might be the only way many people can trigger the correct, you know, full being finesse to get into the proper relationship with ultimate reality or whatever we want, what neutral term we want to use until we talk more deeply about God. And let me give you, just so your viewers are clear, the analogy I use, well, the example I use about distinguishing indispensability from necessity. I'm not bilingual by any means, I'm not like you. So English is psychologically indispensable to me. I mean, I can't do this, I can't do the work, I can't write without it. I just can't do most of my complex meaning making projects. Right. But that doesn't mean that I should conclude that it's metaphysically necessary in that all cognitive agents have to think or speak English. That's, that's a ridiculous claim. So it's very. If there is no contradiction between saying something is psychologically indispensable, again, not in the dismissive sense, it really matters to me. English really matters to me. Right. And it's really, it really contributes to my functionality from concluding that it's metaphysically necessary. So I sort of translated Paul's argument in my mind to oh yes, you want to get into the spirit of finesse. That's the proper orientation. And you take on a personalistic framing and that gives you access. And I thought that's an argument for sort of psychological indispensability. I immediately also thought there are also ways in which people do this impersonally. I mean, Daoism is a religion of finesse that does, you know, interactional psychosomatic stuff that gets you deeply into a flow state, a finesse state. And it doesn't, in fact, when you're in, you're in Tai Chi, you're not in any kind of personalistic mode. So again, it strikes me that I could. Again, I'm trying to be very respectful here. I can deeply understand when a Christian says, you know, this is, seems right, indispensable to me. I just don't go the next step and say I think it's metaphysically necessary. So one thing we might think is it's clearly not metaphysically necessary. And here would be my argument because as you said, there are, you know, there are the exemplary figures that don't seem to need personalistic language to describe the ultimate within all of these traditions, you know, Plotinus and the Neoplatonic tradition. At least some. At least some of the mystical writings I've read within Christianity. You know, Eckhart famously said, you know, God saved me from God and things like that. And so I don't know if it is. So this is what it comes down to. I don't want to deny and I don't know if you would like. Mike, how am I going to use this word? I won't want, because I think it lines up with you, but maybe not. I mean, I think personalism is. At least John Hicks would like it. This is a deeply symbolic way, right? It's in that it's psychologically indispensable for people, and it might be indispensable beyond the personal, like an individual indispensability. There might be sort of cultural, historical reasons why certain, for certain groups of people, something could become indispensable to think and relate to God through, like the symbolism of personality. I don't know if, for reasons I've tried to articulate, if that licenses any claim towards it being a meta, being metaphysically necessary, and therefore an inherent feature of ultimate reality per se. Now I guess the question then becomes if. And this is part of the argument I wanted to make, like if we go that way, then we're into, you know, there's some sort of analogous relationship to personhood and godhood, if you'll allow me that term. And I don't mean any disrespect by it, I hope you understand that. I mean, Eckhart uses it, so presumably it's right. And then here's the problem I have. I mean, I'm just. I'm deeply. I made this argument in the series, so you perhaps are familiar with it. I'm just deeply impressed with Goodman's argument about similarity. There's no logical algorithm for similarity. There's no rule for deciding similarity, because similar. Everything is infinitely similar and dissimilar. And I mean. And isn't that technically the case? Isn't. It is equally legitimate to say that God is totally not like a person as much as he's totally like a person. And so Goodman's argument seems to have purchase here. So I regard the issue. I regard the argument about whether or not even it's symbolically true. If that means something beyond psychological indispensability, I regard that as. For the reasons I just tried to articulate, I regarded that as just undecidable. There's no way of coming to A conclusion that, you know, it's ultimately, this is the best kind of similarity that. The personal similarity. I just don't. I just don't see that if best means something beyond. It's often psychologically indispensable to people. So that's."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1247.4,"end":1247.68,"speaker":"Jonathan Pageau","text":"That's."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1247.68,"end":1259.01,"speaker":"John Vervaeke","text":"That's where I sort of stand now. I haven't answered your second question. I did say there was two, but I'll let you respond to the first thing. I am keeping a mental thing that you want to. Want me to place in the ontology question."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1259.01,"end":1260.29,"speaker":"Jonathan Pageau","text":"Where it is. That you place it."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1260.69,"end":1279.57,"speaker":"John Vervaeke","text":"Yeah, where it is. But I wanted to say first, I wanted to separate that first question from the ontological question because they're often spoken together, and I think it's often confusing to speak them, to address them together. So I want to pull them apart. I want to give you a chance now to respond to that first question. Right."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1279.57,"end":1411.16,"speaker":"Jonathan Pageau","text":"Well, I think. I mean, the way that I. That I would approach what you said is it brings back the problem of Maya, the problem of illusion, because, let's say our experience of person, or the experience of relational experience of a being that is, like you said, like me, different from me. And that communion that you experience, that has to come from somewhere, right? It has to come from somewhere ontologically. It has to come from some. Somewhere metaphysically. If it. If we can't. If we can't place it, then it is illusion. Then. Then it is. Then it has to be a kind of. A kind of. A kind of. A kind of Maya. A kind of. And. And so to me, that is. That is one of the reasons why, like you said, for sure, I think that Eastern Christians, they don't see God when we say. Everything we say about God is an analogy. It is never speaking directly about God. So when I say God is a person, I don't mean it in the same way as I am a person. But what I mean is you could say that he is the source of person. He is the source of these things. Yes, exactly. But he is not. He's not a person in the same way I'm a person. Every. You know, everything we say about God is always. Is always. How can I say this? Is always missing the mark. And I think that that's really important in terms of theology is that there is no. Every word we use about God is not. How can I say this? If we say God is love, there's a. There's a hierarchy, which means the way that we say God is love is. Is like the source of all manifestations of love. It's never equal to my experience of love or whatever. So it always kind of moves towards this infinite. And so that. To me, that, that. So I guess then you'll have to answer the second question because I'm bringing back the second question, which is, okay, where does it come from?"}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1411.16,"end":1563.15,"speaker":"John Vervaeke","text":"Like, yeah, okay, so. But there's. Yeah, but sorry, I'm going to be a bit of a philosopher here. I want to go step by step. That's okay. Yeah. Because I think. I mean, I want to be fair to both you and to me. And so I'm going to try. And so I like the move you made. And that's how I've sort of tried to think about it. To be fair to me, I've tried to think of what people are saying. They're saying, like, God is the source of personhood, but God is, of course, also the source of oceanhood. He's also the source of treehood. Right. I mean, that's the sort of the Neoplatonic idea. Right. And again. And you know, Pseudo, the Dionysus sort of does this. He says, you know, you could. You could even say, you know, God's a stone and the Bible. And he quotes verses where God's compared to a rock. And he says, you know. And so I guess what I'm trying to get at is why this. There might be an implicit claim here. So I'm asking you. I'm not hoisting it on you, right. That. Right when I'm communing with, again, Godhood, ultimate reality, whatever, the real, the really real, as people often describe it, phenomenologically. So at least that's a somewhat neutral term because it picks up on a lot that seems to be a convergent thing. I don't think the ground of my personhood is a person, like, within me. I mean, this is almost like a Jungian idea. I'm not saying that. I'm trying to point to other people who have talked in a similar manner or Tillich talks about the ground of my being, the existential. And I don't think that's a person. And to be fair to me, I tried to articulate that. I tried to articulate how the notion of personhood is grounded in something like the processes of relevance realization, and that our relationship to that is something that's a source. And so what I was indicating is, I think a lot of times what people are doing when they're trying to communicate, if you'll allow me, these metaphors. And I know they're problematic when I'm trying to communicate with external. You know, the external ground, the best symbol for me isn't actually the personal level. It's the level of my ground. Right. It's the level from which my meaning making and my consciousness and all of those things emerge. Maybe, I don't know, maybe that's something like what people used to mean by a soul. I'm not sure, but I think of that as well. I don't like what soul became. It just sort of in Descartes."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1563.87,"end":1564.67,"speaker":"Jonathan Pageau","text":"I hate that too."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1564.99,"end":1568.83,"speaker":"John Vervaeke","text":"Okay, so that's why I'm putting it in quotation."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1568.83,"end":1569.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1569.47,"end":1667.07,"speaker":"John Vervaeke","text":"And so I think, in fact, I think that when you look at the mystics, that seems. Because they make. When they're making identity claims, because they do make identity claims, they'll often say I am one with God and things like that. I don't think they mean that they're communing with God at the personal level because they don't talk that way. They talk about dropping into the ground of their being and that that is the only thing that allows them to commune or participate. And I don't think that's in any way an illusion. I don't see why that has to be an illusion. I mean, I've tried to articulate all kinds of language that I think makes that a viable way to talk. So I don't think I'm committed to the problem of Maya by saying that. I think what I see happening in a lot of the non theistic claims is that people are saying, no, no, the best, the deepest way. Right. The deep calling to deep, as it says in the Psalms. Right. The deepest part of me is actually the ground of my personhood is not itself a person. It's something deeper, more basic. And I think there's aspects of. I mean, that's where the deep participatory knowing comes in. The way my psyche is self organizing and the way it's sel presencing and all of that sort of thing. I think that gives me much better, if you'll allow me, analogs. Although again, given my own argument, I can't give you a logical argument that that's the best because I think they're all logically equivalent. So I'm back to saying I find that captures a lot more of the phenomenology and therefore is more responsible to the psychological indispensability than the level of personal language."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1667.38,"end":1725.25,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, because the person. Maybe it's just the problem of what a person is because I mean, maybe that's where we're. We're hitting a rock here. Because, you know, you. You read in the fathers, you read in the mystics. They. They always say, you know, you are not your thoughts, you're not your. Your feelings, you're not your desires. All of those things that actually doesn't constitute your person. Like a person in Christian language is. Is an instantiation of a nature. Like, that's a person. And so there's a nature which is human nature. And then a person is a person. Like it's a human. And that's what a person is. And so it's the actual. It's the landing of a nature. It's the landing of the nature in an actuality. So it has a. I need you."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1725.25,"end":1741.93,"speaker":"John Vervaeke","text":"To be a little bit more specific. Sorry for interrupting because I don't want to lose. Because I think I'm going to be misunderstanding you if I let you go on. So the word. When we say I'm just worried about everything instantiates a nature. Right? Like trees instantiate treehood. I mean, that's the Platonic."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1741.93,"end":1756.13,"speaker":"Jonathan Pageau","text":"Exactly. Well, you would say, I mean, in Christian language, it's the opposite. Like, it's the opposite of the. I mean, I don't have a problem with this emergent thing, but. Yeah, like, give me the language from top down, let's say."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1756.13,"end":1769.29,"speaker":"John Vervaeke","text":"Yeah, Jonathan, it wasn't a challenge question. I wanted you to. I need to. I need to. I need to. I need to see where the specificity of personhood comes in other than in the instantiation of a nature. Because everything instantiates its nature."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1769.37,"end":1770.57,"speaker":"Jonathan Pageau","text":"Exactly. Well, everything."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1770.81,"end":1771.29,"speaker":"John Vervaeke","text":"Exactly."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1771.29,"end":1776.09,"speaker":"Jonathan Pageau","text":"But so it's. The idea of. That is the notion of a hypostasis. Like, that's."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1776.09,"end":1776.65,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1778.17,"end":1791.41,"speaker":"Jonathan Pageau","text":"That's the idea of a. Of a person in terms of Christian language. You know, like, it's a. It's a. It's an act. It's an actual tree. It's not just. It's not. So that's what. To me."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1792.05,"end":1804.77,"speaker":"John Vervaeke","text":"So it's fair to say. You see. Look, sorry. You see personhood in the being meant as the active presencing of a tree. You see personhood in that. Oh, wow. Oh."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1804.93,"end":1814.43,"speaker":"Jonathan Pageau","text":"Person in the sense of hypostasis. Like in the sense of. In the sense of a. Of. I mean, not in the sense of. Can I say this? Not in the. Not in the common sense that we."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1814.43,"end":1814.75,"speaker":"John Vervaeke","text":"Understand."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1816.51,"end":1819.87,"speaker":"Jonathan Pageau","text":"Person in the sense of an individual, like a human individual."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1820.03,"end":1829.63,"speaker":"John Vervaeke","text":"But there's more to that. I mean, that human individual sense. We extend Moral rights and privileges to it. I extend those to you that I wouldn't extend to a tree because I consider you a person."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1830.19,"end":1869.37,"speaker":"Jonathan Pageau","text":"So, I mean, obviously it does also depend on the nature of what, what is being instantiated. And so, but so, so the idea, like let's say in terms of understanding personhood, in terms of Christianity, the way that we understand personhood is, Is that in commune. It's almost like emergence. You know, it really sounds like emergence that as a person I am in communion with other persons. And that is. That is what makes me exist as a person, because I am in. As a person, as an instantiation of my nature in communion with other instantiations of the human nature."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1869.61,"end":1870.01,"speaker":"John Vervaeke","text":"I."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1870.41,"end":1882.81,"speaker":"Jonathan Pageau","text":"That's how we exist as humans. That's what makes people. That's what makes. That's what makes human. And so the instantiation. So the Trinity is what makes God."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1883.53,"end":1887.69,"speaker":"John Vervaeke","text":"No, I understand that and I'd like. Sorry, I don't mean to. I'm not claiming to understand the Trinity."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1889.37,"end":1903.78,"speaker":"Jonathan Pageau","text":"I'm also not claiming to understand the Trinity, but I'm just trying to help, to help see things a little, maybe a little differently than. Because I feel like we always confuse a person with like an individual in the sense of my individual rights and my thoughts and my feelings."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1903.78,"end":1976.49,"speaker":"John Vervaeke","text":"No, no, this, this is good. I want to. I want to go with this carefully. So thank you. That was, first of all very helpful. I mean, because I'm very familiar with the notion of hypostasis. Because I'm deeply, I'm deeply. I mean, it. You know, it's, it's. It seems to emerge in literature, in Plotinus. Right. And I. And to be fair to me, many people describe it this way. They regard the emanations of the hypostasis as something non personal because of the way, you know, some of the things you're saying. We tend to attribute certain mental and dispositional properties to persons that the hypostasis don't have. For example. So there seems to be a key thing in that, what you're saying, if I'm understanding you, and please interrupt me if I'm misunderstanding you because I interrupted you. Okay, what you seem to be saying is there's two things. The first is at least the Eastern Christian. I'm pretty confident that I didn't hear this at all in Protestant circles when I was growing up. So I want to be careful here, but I'm gonna take you as an authority of Eastern Christianity."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1978.49,"end":1979.29,"speaker":"Jonathan Pageau","text":"That's dangerous."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":1981.85,"end":2021.65,"speaker":"John Vervaeke","text":"Sorry for putting that hat on you, but you're the only one here in the dialogue. So I've got to do what I can do. So you're saying there's a sense in which the idea of any of that, like, emanation. Right. I don't know what you. Like you said instantiation as a process as opposed to just a label, any of that. Instant. Instantiation. Right. The hypostization, if you'll let me, to turn it into a verb. You regard that as kind of. That's a personal. That's part of the personal dimension. And then there seems to be something specific in that instantiation of human nature that makes human persons, if you'll forgive me, as opposed to tree personhood. Is that."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2021.65,"end":2068.83,"speaker":"Jonathan Pageau","text":"Am I understanding for sure, in the sense that. So the way that St. Maximus understands it is that there is a. There's a hierarchy of natures, you know, and the human. Human nature, because it has mind, because it has meaning, because it makes and participates in meaning, it gathers. Like, it also gathers all the other natures in himself. So the human person gathers all the natures in himself. So the image that Saint Maximus talks about is that the human person is like at the top of the mountain. He's in the center. He's in the center. He's. And he's in the middle. And he gathers all the natures in himself. And then when he does that in love, then he unites himself with God. Like, it's actually by doing that he's actually uniting himself with God."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2069.71,"end":2087.95,"speaker":"John Vervaeke","text":"I mean, I understand it, so I'm not going to make an identity claim here, but this reminds me of Aristotle's notion that everything has a form, but the human mind is capable of gathering all the forms into itself. And then you get Plotinus idea that that allows that. That gives the human mind a capacity to conform to the source of all the forms, which is the one."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2088.19,"end":2110.92,"speaker":"Jonathan Pageau","text":"Yeah, that is definitely. That is definitely how Christians see it. But they don't. They don't. They really do see it in terms of love. Like, and the reason why they see it in terms of love is that it prevents the problem of the. The hypostasis or the actual manifestations of things being secondary or being illusions."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2111,"end":2124.44,"speaker":"John Vervaeke","text":"No, no, I get that. So remember, I have noted you making that point, and I take it very seriously. So I do want to come back to that point because this is really."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2124.44,"end":2138.87,"speaker":"Jonathan Pageau","text":"Important in terms of understanding why Christianity is part of. Let's say, why Christianity is also part of what made science so powerful, because we believe that the instantiations are real."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2139.27,"end":2150.31,"speaker":"John Vervaeke","text":"Yes, yes, yes. And the idea that Christianity. Okay, you've triggered about four things in my mind right now."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2150.31,"end":2150.91,"speaker":"Jonathan Pageau","text":"Sorry, sorry."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2150.91,"end":2222.95,"speaker":"John Vervaeke","text":"No, no, no, no, no, that's good. Okay. So first of all, I want to go back. So the question now seems that maybe then if I'm happy to extend sort of personhood in that sense, if you want to use that term, to that notion of the process of hypostasation, with the idea that what is hypostatized, oh, my gosh, is not illusory, so that's fine. But then the question becomes like, then we did it, we ended up doing it. And you sort of agreed with my presentation back to you that I'd understood you, that mind seems to be something ontologically different in that it is a logos of forms. It can gather until forms belong together. And that gives it an ability to conform source. And so the question then becomes, I guess for me again, is the degree to which I see the logos as equivalent to my mind. And that's going to be a little bit tricky. I understand what you're doing here, but."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2222.95,"end":2247.65,"speaker":"Jonathan Pageau","text":"Maybe let's ask the question this way. Let's look at it this way. And so let's say you say that mind is different because it gathers, it's able to gather and it sees and participates in patterns. Okay, so in terms of your, let's say, ontology, does that come to the human person and then stop? Or can you see mind above in higher beings?"}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2247.65,"end":2308.13,"speaker":"John Vervaeke","text":"Well, why I was hesitating. Sorry, I didn't mean to be obscure. Is the term mind has multiple reference. I even have a talk on that. Right. When we use the word mind nowadays, we point to many different things at many different ontological levels that have different ontologies, have different ways, and people do this. To be fair to me, they mean brain sometimes. They, they mean information processing, they mean behavior. Right. They mean language, communication, they mean participation in culture. They mean, you know, what's available to us. And distributed cognition through call. They mean all of those things. And the disciplines that study them don't speak the same language, don't use the same methodology, don't gather the same evidence. So that's why I'm hesitant about just using this word mind, because I find that term deeply, deeply equivocal for us. That's why I was trying to shift off of mind and I was trying to get at the grounding of our ability to sort of make sense."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2309.41,"end":2332.17,"speaker":"Jonathan Pageau","text":"I'm fine with that. I'm fine with making meaning, making sense, gathering patterns, recognizing patterns, even the idea of relevant realization let's say use that word. So if we want to use that expression, that's fine. But my question is, does it go up to us and then stop or does it continue to. Is there more? Is there that, Is there relevant realization at higher levels?"}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2332.17,"end":2345.17,"speaker":"John Vervaeke","text":"Sure, sure. Okay, now that's okay. So now I feel like I've got the question. And thank you for giving me that, that was generous on your part. But I do think, I do think there is a deep consonance between the ancient notion of logos and what I'm talking about in relevance realization."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2345.17,"end":2346.21,"speaker":"Jonathan Pageau","text":"Oh, for sure, yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2346.21,"end":2491.44,"speaker":"John Vervaeke","text":"Okay, great. Thank you for acknowledging that. And so I think that it's. And I'm demonstrating that I'm committed to this, I'm committed to the idea that there is forms of relevance realization that exceed individuals. And I've acknowledged this to jp. I'm doing a lot of work right now. And this is a big thing. You can see it being a big topic in places like Rebel Wisdom, the idea of distributed cognition possessing collective intelligence. And there's been some rather horrific experiments, by the way, sort of demonstrating this. There's a scientist who literally wired rats brains together, right? Yeah, yeah, it's very Orwellian. And what you can show is that system of rats, right, can solve problems that the individual rats can solve. So we always knew this sort of intuitively, but now you have sort of quantified measurement evidence for this claim. So it's no longer just the woo woo claim. Right. So I mean, yeah, what's really frightening, Jonathan, just to portend what might be happening is they've done some preliminary experiments with humans with direct linkage through the neural chips. And so, yeah, that's scary stuff. Yeah, that's scary stuff. So let's put the Orwellian stuff aside. So I think, I mean, I think I should be, and I think I have been a responsible scientist in acknowledging, I think, and the reality of collective intelligence and distributed cognition. That's why I'm very interested in the Socratic project, because I think the Socratic project is a project of trying to do something analogous where we do an individual cognate, where we take intelligence into rationality, into wisdom. And the Socratic project is can I take collective intelligence, bring it up into collective rationality and bring it up into collective wisdom? And I think all of that is viable. That's one of the things I'm exploring in the next series. So I think all of that is the case. And you should know that this is taken very seriously in cognitive science, this idea of Distributed cognition, having something like collective intelligence and having a kind of problem solving. So I think I'm happy with saying that relevance realization extends beyond us into something, I don't know, is this sacrilegious? I don't mean it to be, but like the Ecclesia, a gathering where people are gathering together and trying to a form a cooperative."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2492.72,"end":2531.38,"speaker":"Jonathan Pageau","text":"And you see that. I mean, in Scripture you have the idea of the angels of cities. You have these notions that there are, you know, that there are patrons and those beings manifest the communion of a group. They are like. They're the head. But I mean, I think that, I guess maybe now is where I want to get back. Because once you express something, which I was like, ah. I was like, you're on the track that I wish you were on. You talked about, about Eurogenia. And Eurogenia obviously takes a lot of his stuff from Dionysus and Maximus. He translated Maximus into Latin."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2531.38,"end":2539.34,"speaker":"John Vervaeke","text":"Yep. That's why I'm so interested in him, because he's the last great sort of synthesis in my mind of east and West, Eastern, Western Christianity."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2539.58,"end":2560.92,"speaker":"Jonathan Pageau","text":"And so you. Cause I. Let's say I used to always. I would think top down, like I'm a Platonist, I'm a Christian Platonist, I think top down. And then it's always. It's discovering Jordan Peterson and you and being in contact with agnostics and atheists. It's like I was. I kind of forced myself to think bottom up."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2561,"end":2561.56,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2562.04,"end":2576.64,"speaker":"Jonathan Pageau","text":"And to think of communion and to think of things coming together and these complex systems coming up. And once you said, you said. It seems like Urogena is saying that those two, like the emergence and the top down."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2576.64,"end":2577.32,"speaker":"John Vervaeke","text":"Emanation."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2577.48,"end":2580.72,"speaker":"Jonathan Pageau","text":"Emanation. They're actually happening at the same time."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2580.96,"end":2585.6,"speaker":"John Vervaeke","text":"Yeah. And his notion of creation, I'm still, I'm still committed to that and still committed to discussing that."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2585.76,"end":2617.37,"speaker":"Jonathan Pageau","text":"And I think that that's. That is. So that you see the same in St. Maximus. He says that explicitly. He talks about. There are some quotes of him where he talks about how, you know, when you. When the mystic sees, let's say, the particulars separate from their essences, you know, and he can see it. He also sees that they're the same. Like they're actually the coming together of the particulars is the same as the naming coming from above, you know."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2617.37,"end":2632.41,"speaker":"John Vervaeke","text":"Yeah. And what's interesting. Yes, totally. And I'm reading some Maximus. Well, I'm reading about Maximus right now quite a bit because as you said, if you want to understand neurogenia you've got to understand Maximus. So I'm not claiming to understand in the way you do, but I'm trying to."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2632.49,"end":2636.98,"speaker":"Jonathan Pageau","text":"It's easy to understand. It takes a while to get there through, get to the language too well."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2636.98,"end":2757.97,"speaker":"John Vervaeke","text":"But that's usually what it is for a great philosopher. You have to. It's not just the words, it's their. It's their mindset. You have to. You have to habitat. You have to learn how to inhabit it. And that's what's often most. I often find that that's what's most valuable about a philosopher, other than the particular propositions they assert. So I like everything you said because I'm trying to get beyond an ontology that privileges emergence and emanation. And why this connects up to what we're talking about is, you know, Erugea specifically uses dialectic. He writes the parafusion, the division of nature as a dialogue. And many people comment on it. They sometimes call him the Hegel of the 9th century, which I think is a disservice to Erigina because his notion of dialectic is, I think is much more Christian Platonic than it is Hegelian. So because he sees creation as an inherently dialectical. Because it is this complete interpenetration, top to bottom. Yeah, right. And for me, you know, I tried to indicate also that that's our best models of cognition are inherently, you know, bottom up, top down, completely interpenetrating. Right. And so there's something deeply analogous between how the mind works and that kind of ontology. And so I find, I think I can make a case for that. Well, I think I just did that. We've already countenance that ontology deeply in our practice of cognitive science. An emergence up in some kind of top down thing. And then the idea that maybe that's the best way because the problem with each one of the two emergence has. The problem, like many people you've pointed out, is like, how do you get to this sort of normative? Right. And then emanation has the problem of why doesn't it just stay in the one. Why does it."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2758.21,"end":2760.57,"speaker":"Jonathan Pageau","text":"Yeah, why does it. Why does it come down. Exactly."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2760.57,"end":2791.05,"speaker":"John Vervaeke","text":"Yeah. Now if you'll allow me. So first of all, I'm happy with. That's what I mean about an analogy at the ground of my cognition as opposed to like an identity with my mind. See, the top down, bottom up aspect isn't a content of my mind. It isn't an aspect of my will. It's a constitutive Structural, functional, eidos that makes mindedness possible. Are you okay with me?"}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2791.05,"end":2814.28,"speaker":"Jonathan Pageau","text":"No, I agree. I mean, in. In the Christian mystics, you all. They really do separate the notion of noose from the idea of mind or mind in the sense of thinking and all the active, you know, processes. That nous is this direct connection. It's like. I mean, you could describe it as the ground of your being in that."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2814.28,"end":2823.15,"speaker":"John Vervaeke","text":"Sense, and then the connectedness would be, I don't know, bottom up, top down, as a thought. I know it by participating."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2823.87,"end":2825.47,"speaker":"Jonathan Pageau","text":"There you go. That's great. Yeah, that's perfect."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2825.63,"end":2840.91,"speaker":"John Vervaeke","text":"And then there's the participatory connection is vertical and horizontal at the same time, which is, by the way, the same thing in dialectic. Dialectic is happening ontologically within the individual and then horizontal between individuals. So I think I can sort of. I'm sort of making sense of what Erogena is doing there."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2840.99,"end":2968.08,"speaker":"Jonathan Pageau","text":"So what if you look like. If you look at. Then if once you. Let's say you see that or you understand that those two things are happening at the same time, then when you look at. If you. Let's say, look at Christ's pronunciations with that. With those lenses, with that lens, all of a sudden you're gonna see that he's constantly shifting between both. He's shifting between the two. You know, where on the one hand, when he talks about. When he says things like, you know, where two or three are gathered in my name, you know, I'm there. I am also there I am. And that's it. That's exactly it. It's like, if you gather in love, then the Logos is there, but then there's also the whole image of the head, of the idea of the head of the body. St. Paul has that analogy, the head and the body. And so that is more of a. Like, you get the sense of a. More of a top down. But then he also talks about the members of the body that are fitted, well fitted together in love. And that is the totality of the Messiah. Like the totality of Christ is both, you know, the head and then the joining of the members in love. And so you get that. I think it's an interesting exercise to do, is to look at some of the. To look at those. And so then when you get, for example, an image of Christ who talks about the seeds, you know, when he tosses the seeds and he. So the seeds come from above and they fall. And if they fall on the right ground, then they grow. And so you have that meeting of the heaven which comes down and meets earth. And then the earth also, let's say, brings forth, like God says, in the emergence in creation. And then ultimately, then you have the image of the creation of Adam, which is the gathering of dust and the blowing in of spirit. And that's it. Like, that's the two at the same time. There's the gathering of dust and the blowing into the spirit. You have the bottom up, like, gathering, and then you have the top down, which is like the naming or the."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":2968.08,"end":3048.37,"speaker":"John Vervaeke","text":"You know, this is wonderful. I mean, first of all, I'm really happy to be involved in this conversation. No, no, Jonathan, this is not empty flattery. Your symbolic skills are really, really, really powerful, and I respect them. I'm liking what you're doing. Now, I would say in response, I mean, the reason why I don't associate this with classical theism is Erigina was persecuted as a heretic. Right. And so this model, which I think is articulated very well in Erigina, it's not clear why he was persecuted as a heretic either. It's really obscure. And he just sort of disappears historically. And part of the, you know, the people I'm reading, and I believe everybody I'm reading there, Gino, is self identified as a Christian. So this isn't hostile Christic. And part of what they're pointing out is this was sort of rejected and thrown away. And it's too bad that it was because it would have been very helpful for us right now. That's sort of the tenor of what I'm reading. And so that's why, I mean, I'm very hesitant to apply this model to classical theism because it looked like, at least in the west, the church said no. Right. It sort of officially said no, and no, we're not going that way. That's not how we should understand things. Yeah."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3052.48,"end":3144.6,"speaker":"Jonathan Pageau","text":"There's also a reality which is that to a certain extent, this is gonna sound weird for a lot of people, that there is a. Not a necessity, but there is an inevitability of a certain amount of suspicion coming from an institution. And that suspicion. How can I say this? The way that I see Christianity, maybe it's very different from a lot of people. I see that there are different actors and they're playing out a story. And so I think that when we see, let's say the church give us warnings about, okay, we could use even. Let's use an Eastern. So I don't bash on the Western church. I use an Eastern example. It's like they go after Origin, you know, and it's like. They go after Origin and it's like, origin is bad. This, this, this, this, this. But it's like origin doesn't go away. Origin is still there. We have Evagrius. Evagrius is brought back into the Christian literature using different names of different saints and pseudo texts and all of this. And so it's like it never goes away. But there's something about the institution which, in serving its role, it also has the danger of crystallizing and of, let's say, of wanting to fix things, which is good sometimes and sometimes can be dangerous. And so it's like you always have to see all the stories at once. I don't know if that makes sense."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3145.4,"end":3153.04,"speaker":"John Vervaeke","text":"That's fair. That's fair. I guess part of also. Yeah, I think that's a reasonable response."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3153.04,"end":3154.6,"speaker":"Jonathan Pageau","text":"I don't want to get us off track, though. I don't want to get."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3155.16,"end":3241.05,"speaker":"John Vervaeke","text":"No, no. And I don't want to equate criticizing Christianity with criticizing God or anything like that. Yeah, I want to keep those apart. I was just trying to tell you one reason. I'll give you another one. I'm sort of hesitant. I see the same kind of attempt to get. And I think I make a really strong case for this. And especially, you know, coming out of Nargajuna within Buddhism, of trying to get an ontology in which there's the deep interpenetration of emergence and emanation. This is, you know, form is emptiness. Right. And emptiness is form and nirvana is samsara. Right. It's the idea that the form, the emergent. Right. The structuring and the emptiness, the source, are completely interpenetrated because the identity claim, there is not a logical identity. That's very clear from the text. So it's. No, it's what they're trying to do with the is. Is they're trying to say the emergence and the emanation are completely, completely interpenetrating. And it's the realization of that in the sense, not of an idea, but of existential conformity, that actually brings. That actually brings release. Right. That brings salvation, that brings the amelioration of dukkha. And so there again, like I said, the reason why I keep using the sort of saying, I want to say this as non theism is I'm not quite convinced that. Sorry, I don't want to call you a heretic. I'm not trying to say that."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3242.17,"end":3245,"speaker":"Jonathan Pageau","text":"You can try. Some other people have done it."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3245.47,"end":3492.86,"speaker":"John Vervaeke","text":"Yeah. What I'm saying is the way we're talking, I think would make a lot of people who identify with classical theism uneasy, but it's also a way of talking that would make a lot of people in Buddhism, Nagarjuna, for example, very, very happy. And so this is why I try to use the notion of non theism, because I'm not trying to commit to a. A particular frame. And I'm hesitant to say that I. I see this way of talking very prevalent in a lot of the people that identify with classical theism. So. But this goes back to. I mean, this goes back to two points. One is the degree to which, I mean, because you have this interesting thing that I keep referring to, where you think Christianity is itself going through potentially some kind of resurrection process. And I think that's very interesting. And then the other one goes back to the point that I wanted to do with Mary and jp, and that goes maybe back to the main thread of our conversation. So if you want to come back to the other thing about Christianity, I'd be happy to do that. But the thing that they said, something very interesting and it didn't quite. But because I basically, see, to be fair to me, also, when I was talking with jp, I was also sort of challenging a panpsychist interpretation of sort of a super. Of sort of a supra consciousness, because I'm not. I don't have evidence of consciousness. I don't even have evidence of a consciousness for the ecclesia, for the distributed cognition. I have evidence for intelligence. I don't have evidence for anything like consciousness. And I was trying to get at like this problem of I don't see relevance realization sort of ontologically writ. And this gets back to your point of infinite relevance realization. So let me try and. Let me try. And they don't quite say this way, but I'm trying to strengthen their argument in good faith. So I'm not trying to straw man it. There's something like the idea that, because I've acknowledged sort of the idea from Whitehead, that possibility, first of all, as you know, I think possibility is real. It's ontologically real. The possibility has to be structured right in some way. And that sort of emanation is how that plays out in how constraints are found within reality. Constraints are instantiated from the way possibility is really structured, something like that. And that's a very Neoplatonic notion. You can see it clear and white. But they were sort of. Mary sort of brought this idea and then JP did something interesting with it that isn't there something analogous to relevance realization? In that infinite possibility, self constrains down to the finite things. This is an act of self constraining that's very analogous to the self constraining that's at the heart of relevance realization. And it's very much kind of analogous to love, because in love you're doing this sort of, you're doing an inherently self limiting thing that's also a self transcending thing. Because Erigena sees creation as God's ultimate act of self transcendence. God is sort of, God is sort of. All of the creation still remains within God. Right. And so there's this ultimate act of self transcendence. And I thought, I thought that was a really strong argument because you could say, okay, there's something analogous, it's not the same as our finite relevance realization. But this, this, if you'll allow me a metaphor drawn sort of from the language of physics, there's a collapse of infinity into finite things. It's a self constraining. And we, we always find that bound up with how we care about things. And so analogous, analogous for us, it feels like, it feels like kind of like what love is. I'm being very hesitant here. Right. And then of course we, we can enter into a communion with it that gets the mutually accelerating disclosure, which of course is experience as we, we can fall in love with that. So I'm sort of prepared to acknowledge all of that."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3493.02,"end":3494.14,"speaker":"Jonathan Pageau","text":"Okay, interesting."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3494.22,"end":3502.54,"speaker":"John Vervaeke","text":"Yeah, but like I say, I don't. So I. Sorry, give with one."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3502.86,"end":3593.21,"speaker":"Jonathan Pageau","text":"No, no, no, but this is, this is, this is a good, this is a good line. You know, the, like the way that I, that I would, that I see it is similar to what you say. I don't like the, I don't use the word possibility, I just use the word infinite. I just, I like the word infinite because infinite can really just mean non. Even categorically infinite. That is there it is boundless in every manner. So you can imagine that the notion of God as boundless. So we believe in one God, the Father. Right. And this. Boundless, completely boundless. And then the sun, like the Logos is exactly what you said. It's the, it's, it's the, it's the, that it's not limiting, but it's like the expression of the boundless. And through that expression, that's how limited things appear. But what's important, like I think, and that, what's important Christianity, this is the most important thing in Christianity is that the, the expression of the infinite is Equal to the infinite. That's the most important thing. That's the most important thing in Christianity. And that's why the whole, the whole fight in the 4th century was all about that is to say that the expression of the infinite has everything, the infinite has. Which is. Which seems contradictory, but what it does is that it makes the world exist. Like it makes the world exist and be real and not just be an illusion."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3593.77,"end":3625.88,"speaker":"John Vervaeke","text":"Okay, so the first thing is I use the word possibility because I want to use something that has the same scope but is paired properly with actuality. Because I'm trying to get out of kind of a metaphysics in which actuality is equated with realness. So I think the distinctions are orthogonal. I see what you're saying. But I could say you could have an infinite actuality in some sense and that might not include possibility. Infinity is a weird thing."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3626.28,"end":3627.24,"speaker":"Jonathan Pageau","text":"Is a weird thing."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3627.24,"end":3837.83,"speaker":"John Vervaeke","text":"Yeah. And the reason why I use. And the reason why I use possibility is because, as I tried to argue, possibility is a real, although not properly acknowledged ontological category. In science itself, there's one thing, because, you know, laws and potential energy, these are all real possibilities. And science absolutely needs those also. And constraints in biology, for example, but also using possibility because it overlaps with combinatorial explosion. So that's why it's my chosen term. I'm not committed to it in an idolatrous fashion in that I'm just. And it also lines up with how, like I said, how Whitehead tries to articulate how God fits in his model. Right. Although he ultimately says that God has to be an actuality in a way that I think gives into Aristotle. Put that aside. So there's that. So what I'm trying to get at is, yeah, I don't want to get into. Well, it's not that I want to avoid it. I don't know if I can do anything of value to you or your viewers talking about the incarnation. Because I mean, like I said, I see other places. I mean, the Tao Te Chen says there's the Dao and the manifestations, but they're ultimately one and that one is darkness. Or, you know, form and emptiness are one and it's a non logical identity. Here's another point that I would want to make, that there's something analogous. Again, it's not part of my mind, it's not part of my consciousness or my intelligence. I'll use those two words then. Okay? But this is a feature in my personhood. I participate in non logical identity because I'm in Some sense personally identical to the child that was 1 years old born in Hamilton. Now that child and I, we don't share a lot of properties and we don't even share any atoms. Right? Right. And yet, so there's non logical identity. And I think my participation in non logical identity gives me the analog for participating in the non logical identity between form and emptiness, the Tao and the manifestation, or perhaps if you'll allow me to do it. Right. God and the sun. That's, that's again, that's not something in my consciousness or in my intelligence. It's part of the. Well, I think that's part of again the logos of my being. And I'm also willing to grant to Paul that. Where I disagree with Paul, he calls out our machine code. I think it's clear evidence it's not a machine code if he's using that term the way I would, because we have to practice. He says narrative is our machine code. And I disagree with that because the machine, we have to teach people narrative. We have to practice it. We do practice. You have to teach kids narrative. That's the narrative practice hypothesis. You have to teach them and teach them and teach them and teach them and teach them and teach them. And you have to really water down narrative to something like the Teletubbies. Right. I did this twice with my kids. Right. And you go through, oh, right, it's horrible. Right. And you have to practice and practice. And that's why they take a long time to get a sense of humor properly to be able to tell a joke. Right. There's all this developmental stuff and we keep practicing it with each other all the time. So I'm not convinced that it's part of our machine code. What I think, Paul, what I could agree with Paul saying is narrative is where we practice non logical identity. So narrative is where we get a temporally extended sense of self that allows us to get that non logical identity."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3838.31,"end":3874.08,"speaker":"Jonathan Pageau","text":"Well, the thing is that narrative does for time what names or identities do for space. Like that is that in order to create, in order to create patterns, time, you need narrative. And in order to create, let's say pattern in space, you need, you need things that are connected together in a certain manner, in a recognizable manner so that you can see them as an identity. And so narrative does that in time and let's say more usual categories and naming does that in space."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3874.48,"end":3875.72,"speaker":"John Vervaeke","text":"Like geometry. Geometry."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3875.72,"end":3887.6,"speaker":"Jonathan Pageau","text":"I mean, yeah, so geometry. There you go. Like, or just, you know. And so to me, that's what narrative is. The capacity to identify with time. Like to have."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3887.6,"end":3929.67,"speaker":"John Vervaeke","text":"Yeah, you experience temporarily. Temporarily extend itself. But I think what I want to say is, if you'll allow me these metaphors, I mean, there's not only non logical horizontal identity through time, there's non logical ontological identity through the levels of being. And I think that people pass. I mean, because that's what I'm reading and that's what I've experienced, you can pass it to a trans narrative state. Perhaps it's a state that transcends both the spirit of geometry and the spirit of narrative in which you get this non logic. You get this ability of not to participate in non logical identity that is not just the non logical identity of narrative."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3929.82,"end":3983.46,"speaker":"Jonathan Pageau","text":"Yeah, no, I think this is, this is probably where. This is where I get the biggest confusion in terms of. So there's a story that my brother told me. He studied kung fu for a very long time. And that story really stuck with me for a very long time. He was talking to me about the different legendary swords that exist in this kung fu mythology. And he was telling me that the very like, let's say the second highest sword in their mythology was a sword where if you put the sword in the water, all the twigs and the branches and the leaves would come and would strike up against the sword and cut in half. And that was the second most important sword and the most. The highest sword. The highest sword was a sword that if you put it in the water, the branches would come and avoid the sword and would never touch it."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3983.69,"end":3984.09,"speaker":"John Vervaeke","text":"Okay."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":3985.05,"end":4071.65,"speaker":"Jonathan Pageau","text":"And so to me it's like if you say something like that you can reach a state which transcends narrative. I would say yes. And then I would say, but that, that when it comes back down, it's narrative again. Like so, so it's not. So the denial of something in a hierarchy, the denial of the particulars actually is the. Is the invisible essence of their coming together on the lower aspects. And so to me, and so if like for example, so that's why, you know, that's why I really struggle with the arguments sometimes where someone would tries to kind of like step up above religion and then look at the different religions and say there are examples of different, of different things. And it's like, yeah, but if you come down, you have to be on a path and that path is coherent. Like, I don't know if that makes sense. Like in terms of, let's say that if you can reach a state, let's say a mystical state where you're above where you encounter Something which is above narrative and is above even identity and is like, you know, this kind of infinite moment that doesn't destroy reality. It actually. It makes reality real."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4071.97,"end":4283.09,"speaker":"John Vervaeke","text":"Oh, and that's exactly how people respond to experiences of onto normativity of the really real. They come back and they transform their cells and they transform their lives to try and bring it closer into conformity. There's a inspiration in that sense, right? It informs and transforms their cells, their relationships in the world. I wasn't denying that. I mean, I think I agree that if you use your language when you're coming back down that. And that's where I think you get the gap between sort of metaphysical necessity and psychological indispensability. You fall into a particular narrative. I do think the different narratives do emphasize different things. I think. I mean, I think Christianity speaks about and does the best, the best sort of. On agape. I've made that argument. But, you know, I think there are other experiences that are deeply contributory to meaning in life. And I have good empirical evidence for this. I think flow is really deeply important. And Christianity doesn't say much about flow that much. When Taoism is the religion of flow, it's got a lot to say about it. It's got a lot of practices. And you're gonna. If you want to. If you want to become a much better flower, Taoism is the place to go. And I'm speaking not just from the outside. I've been a practitioner for like 28 years. So again, I'm trying to. And I said this to you at the very beginning in our first talk. And so not that it gives us any special authority. I'm just trying to say that there's a consistency. I'm trying to reject both relativism and perennialism. And I'm trying to use the notion that I got from cognitive science of synoptic integration. Cognitive science doesn't try to eradicate neuroscience or computer science or psychology or linguistics or anthropology. It's not trying to put them out of business. It's trying to create an overarching framework so that they can insightfully talk and transform each other so that we stop equivocating in powerful ways about when we try to talk about mind and meaning. And that's a different thing than both perennialism and relativism. I'm trying to get beyond both of those, and that's a different thing. So I'm definitely not. I'm not Huxley. Oh, they're all saying the same thing. And I'm not Katz oh, they're all talking about totally different incommensurable things. I'm not trying to say either one of those. I'm trying to say. No, no. It's much like what cognitive science tries to do between the various disciplines. That's what I'm trying to talk about. And so people often. I guess that's where I'm getting misunderstood, where people are trying to say, John. It's funny. I think the fact that I get both sides indicates that I'm being misunderstood. John's trying to destroy religion. Oh, no, no. John is actually trying to defend. And both sides are. I'm gonna suddenly pull this philosophical rabbit out of a hat and show. Aha. Right. All along I was drawing you in so that I could. Jonathan. I mean, I want to take this opportunity to say. And I've said it in the comments, but I want to say it here because that way it'll reach more people. If people can. If they can use my work and they can return to Christianity, but also if they can return to Buddhism or Islam and Taoism, and that will enrich their ability to find meaning and cultivate wisdom and compassion, great. I'm happy. Right, Right. I am not anti religious. That is not."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4283.09,"end":4289.05,"speaker":"Jonathan Pageau","text":"No, no, I don't think. I don't. I think it'd be very difficult for people to get. Come to the conclusion that you're anti."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4289.05,"end":4293.93,"speaker":"John Vervaeke","text":"Religious and I'm not simply eclectic. And that's. I've tried to."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4293.93,"end":4296.13,"speaker":"Jonathan Pageau","text":"That I'm not. That I'm not so sure about."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4297.17,"end":4298.45,"speaker":"John Vervaeke","text":"Okay. Okay."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4298.69,"end":4303.93,"speaker":"Jonathan Pageau","text":"I mean, I think. Look, I see we've been going for a while, and I have an appointment in 15 minutes, but I would."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4303.93,"end":4305.82,"speaker":"John Vervaeke","text":"So. So do I. I. So do I. All right."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4305.82,"end":4322.94,"speaker":"Jonathan Pageau","text":"So I would like. So maybe we could have a conversation sooner rather than later, because I do want to talk about your project, like, the actual project. I have, like, you know, I've been thinking a lot about some of the things you're saying, and I have a lot of questions in terms of."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4323.26,"end":4326.62,"speaker":"John Vervaeke","text":"Sure. And I expect you might have criticisms, and I'll take them in good faith."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4326.86,"end":4327.34,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4327.58,"end":4329.5,"speaker":"John Vervaeke","text":"I've tried to do that here with you today."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4329.82,"end":4333.66,"speaker":"Jonathan Pageau","text":"Well, I appreciate. I love these discussions. I really appreciate it."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4334.18,"end":4337.82,"speaker":"John Vervaeke","text":"I really appreciated this discussion. Jonathan. Thank you very much. All right. Okay."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4337.82,"end":4338.02,"speaker":"Jonathan Pageau","text":"Bye."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4338.02,"end":4338.34,"speaker":"John Vervaeke","text":"Bye."}
{"episode_id":"SW - #084 - 2019-12-28 - God and Relevance Realization","start":4339.62,"end":4404.61,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on Subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
