{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":0.32,"end":10.96,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 26 of the Symbolic World podcast. On this episode, I will be playing for you an interpretation of the fairy."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":10.96,"end":12.16,"speaker":"Announcer","text":"Tale Puss in Boots."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":12.48,"end":28.96,"speaker":"Jonathan Pageau","text":"And so enjoy. This is Jonathan Pageau."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":29.36,"end":31.04,"speaker":"Announcer","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":41.91,"end":1507.03,"speaker":"Jonathan Pageau","text":"And so what I want to talk about is a story that a lot of people maybe find a bit strange. And it's the story of Puss in Boots, the story of the cat who wears boots. I remember when I was a child, I was fascinated by this story, but at the same time, it seems so strange and so absurd that it was difficult to understand. And as I started to understand symbolism, I saw that in fact, the Puss in Boots story was a very. Had a very, very powerful structure. And it's a very powerful structure that's helpful for us right now. If you followed some of my videos, the videos where I talk about how a world gets turned back on its feet. How when something is chaotic and upside down, how it can come back up out of the water, let's say. Or. Well, the story of Puss in Boots gives us a great example. And so I'm going to go through the story and I'm going to show you how it compares to other traditional stories. And hopefully we can pull out of it, let's say, an understanding of how the end of something can become a new beginning. The story of Puss in Boots is rather simple. A miller dies and he has three sons. He leaves. To his oldest son, he leaves his mill. To his second son, he leaves his donkey or his ass. And to his youngest son, he leaves his cat. And so obviously, if you look at the structure in terms of existing in the world, in terms of production, the two first sons get something which can help them to exist in the world. So obviously, the mill will help the oldest son become a miller himself. The second son, with a donkey, can maybe plow a field, can become a farmer, but the third son gets a cat. And so the idea of an animal which doesn't have a function, which is just there to provide company, is important to understand in the sense that we're moving from meaning, from order into, let's say, the absurd, or rather the recreational, let's say, so the animal is there, doesn't have a function in productive society. And so the youngest son gets the cat. And so there's nothing he can do with the cat. And so the youngest son is. He's sad, he's despondent, and he's wondering, what am I going to do? And all of a sudden this cat starts to speak to him. And he says, my master, if you get for me a pair of boots and a bag, then I will find your fortune or I'll help you out. And so the miller's son is extremely surprised to see this. But he bets on this, right? So he takes his last amount of money or whatever, he spends his last little amount that he has, and he buys boots for this cat. Now, the cat goes out, and with the bag, he's able to catch a. I think it's either a rabbit or some birds. And he brings those to the king, present them as a gift. And he presents them as a gift of the Marquis de Carabas, like a noble man who gives these animals to the king. And the king is extremely happy. And in the story, usually he does it few times, does it usually twice. And the second he. The second time he brings it again, and he's like, you know, this is a gift from the Marquis de Carabas. And the king is impressed. Who is this Marquis de Carabas? You know, what's going on? So while the cat is in the castle, he finds out that the king and the princess are going to go out on a stroll. They're going to go out for a stroll in a carriage. And so he quickly goes out, tells his master, okay, take all your clothes off, get into the water. And then when the king and the princess comes by, I'm going to come and say that, no, he probably doesn't know. He doesn't tell him what to do. He just says, take your clothes and get into the water. It's even better. And so the miller's son takes his clothes out, gets into the water, and he said, just stay there and don't. And so when the kings arrives, the cats are screaming, my master, my master, he's out in the water. He's going to drown. He was attacked by some thieves, and they took his clothes, and now he can't come out. And, you know, he paints this dramatic picture of a situation where the Marquis de Carabas, you know, lost his clothes and now is naked there in the water, and he can't come out. And so he's in trouble. So the king tells his servants to give to the Marquis de Carabas some new clothes, obviously, to help him. And that the king, of course, because the marquis has been so generous in the past, and because he was so impressed by the gifts that he brought him, he's going to take the marquis back to his castle. And so the king takes him out, puts on these new clothes for the young miller's son, and he puts on clothes that make him look like he's noble. Now remember that because that's important when we interpret it. And the son gets into the carriage as they're moving towards the miller's castle. He doesn't have a castle, obviously. The cat runs in advance and he sees these people, you know, plowing a field. And he tells the people, plowing a field. The king comes by and asks you to who belongs this field? You tell them that it belongs to the Marquis de Carabas, or else you're gonna get a serious beating. You know, you're gonna be in trouble. And then he goes on and he finds. Usually it's something else, like a beautiful forest grove. And there. There are peasants there. And he tells the peasants the same thing. And as the king is coming by, you know, he comes by this beautiful field and he's like, wow, what a beautiful land. What a beautiful field. Who does this belong to? And the answer, of course, is, this belonged to the Marquis de Carabas several times in a row. And the king is starting to think, wow, this marquis is impressive. You know, he's quite the something to have all this beautiful land. And so as the. As Puss in Boots continues, he gets to the castle, and in the castle is a giant ogre. It's a monster. And the monster owns this castle. So the cat knocks on the door. The ogre answers and is impressive and very scary. He's like, what do you want? What are you doing here? And the cat says, well, I've heard that you are an extremely powerful ogre and you have. You have amazing magical powers. And so I've come here to. To see, you know, this. If you really live up to this amazing reputation that you have. And the ogre is like, he's a bit flattered, but he doesn't want to show it. So the cat comes in and he says, is it true that you're able to transform yourself in anything that you want? And the ogre says, yeah, of course. And he changes himself into a lion. And now, you know, the cat is. And kind of moves away. And the ogre is happy because he scared the cat. And the cat says, oh, that's very impressive. But it would be way more impressive if you could transform yourself in something that is really small because you're so huge. Imagine if you could transform yourself in something tiny, like a mouse, let's say. So the ogre transforms itself into a mouse and then the cat eats the mouse. And so as the king is coming up in his Carriage. The cat runs out, and he says, your honor, your highness, welcome. Welcome to the castle of the Marquis de Carabas. And the marquis comes in, and the king is so impressed by the marquis and by everything that's there that he gives to the marquis, he gives to the miller's son, his daughter, in marriage. And by now the miller is legitimately, let's say, as much as you can imagine, has become the owner of a castle, the owner of these fields, because the fields happen to belong to the ogre, actually. So he owns the fields, he owns the castle, and he now has married the princess. And so one of the things that people think in terms of fairy tales, especially in terms of the more modern, let's say, the more modern era fairy tales, is they tend to think that fairy tales are there to give a moral lesson. And that's not actually the case. And in this story, and there's a few stories like this, like, for example, the story of Jack and the Beanstalk, where you really struggle to find in the story a kind of simple morality tale where, you know, if you're good and you're honest and you're nice and all these things, then you'll get what it is. What the story is actually discussing is how the world flips, how the lowest thing can become the highest thing, how one world ends and another world begins. Okay? And so I'm going to tell you a little, little bit of another story, and you'll see how it's related. Now, you have to think of the story of Noah and the ark, okay? Now, in the story of Noah and the Ark, the world is getting worse and worse and worse. And the way it's getting worse is through this increase in artificial things, like the increase of civilization, the increase of society, but also the increase of kind of entertainment. So in the Genealogy of Adam, you hear talk about cities and then technology and then music, and finally the development of iron and iron weapons. And the world is getting more and more corrupt because the world is being changed, but also the world is living more and more in its margin. Let's say if you imagine a person like the heart, then as you move out of the heart, then you add these layers of. Of clothing and tools and civilization and everything, and it makes the world more fragile. And it also leads us out into our. Into our passions, let's say into these strange obsessions. Anybody who thinks about the Internet will understand how that works quite easily. And so the world is kind of coming down, down, down, down, down. Now, God says to Noah, build an ark. And it's really important. People miss this detail in the story is that what we've seen is the world become more and more technical. But then God tells Noah to build an ark. That is to use technical means to create something by which now you will be able to survive the end of this world. Now, another thing that also happens in the story is that there's these mixtures of the sons of God and the daughters of men. It doesn't matter how you interpret it. Some interpret it as angels and men. Some interpret it as, let's say, a higher. A higher, more noble people that kind of mixed and mixed with, like, more decadent types of people and that created all kinds of chaos. But Noah himself, there are several traditions which says that Noah married Naamah. Naamah is part of the lineage of Cain. And so Noah also. Did you know that's not in the Bible. But the reason why it's the tradition is to help us understand how Noah is an ambiguous figure himself, that he follows God, but he's also a product of all of this increase in technology, but also this increase in mixture. And then he's the one who builds the ark and then puts all these animals in a boat and then crosses over to the other side. And in that story, before he crosses over to the other side, the world is filled with these giants. Okay? So you have. Think of the terms of the Noah story. You have a world that's coming down. You have giants that. That are kind of causing this bad thing to happen. You also have animals, and you have this ambiguous figure which is able to cross over, then take on the other side, start the world again, let's say, okay? And so in the story of Puss in Boots, you can see the same terms. Let me tell you another story to help you kind of see the pattern. Once you see the pattern, it'll help you to understand what this can mean. Now, I've told you this story before in other talks, but it's the story of St. Christopher. Now, St. Christopher is a giant. In some traditions, he's also a hybrid. In other tradition, he's a mixture of, you know, he's like a dog man, a man with the head of a dog. And so he's an ambiguous figure. And St. Christopher, he's a monster. He can't really do the things properly. And so because he's not able to pray, he's not able to. He's not able to pray, he's not able to fast, he's not able to do all these things, he Stands on the side of the river and he crosses people over. Okay, and now the child, the Christ child comes to St Christopher and he tells St Christopher that carry me to the other side. So St Christopher carries him to the other side, but as he's crossing over, there's this immense weight and you know, he can't hold himself and he's sinking into the water as the child is on his shoulders. But he doesn't understand what he why. And once he reaches the other side, this. The child tells him that St. Christopher asks him, like, why was it so heavy? Why were. Why was it almost impossible for me to cross you over? And the. The child tells him, because I was carrying the sins of the world on my shoulders. And so what has happened is that Christ has actually tricked St Christopher into becoming a vehicle for himself, becoming a vehicle for crossing the waters of chaos and reemerging on the other side. Okay, now here's another story. A princess, you've heard me tell this story quite a few times. A princess has a golden ball. She loses it in the water. A frog who talks, right? We have a cat that talks. Now we have a frog that talks. We also have a dog headed man that talks. So the frog that talks tells her, I'll get the ball if you accept to take me into the castle to give me some of your food and also to let me sleep in your bed. And so the princess accepts. And then the frog goes to the sadness of the princess who doesn't want to do it. She's forced to do it because she's promised. And in a way, this frog tricks the princess into loving him. She doesn't really love him, but it's like this weird artifice that he sets up. And in some stories she actually kills the frog, she throws the frog against the wall. And then after, after all of that has happened, this kind of weird inversion and trick, then he turns into a prince and they get married. So you have this talking animal, you have water, you have this crossing of the water, and you have it happening in terms of a trick, in terms of this. In this kind of this inverted thing that happens. Okay, now that's. The story of Puss in Boots is exactly the same. You have a talking cat. And the talking cat is there to take the loser of the story. Who is the prince? Who. He's not a prince yet. The son of the miller who doesn't have anything. All he has is this cat. And so by giving him these boots, the fact that the cat wears boots, important because it has to create the confusion between a person and an animal, there has to be this ambiguous figure right there that helps you cross over the waters, okay? And so by making the cat speak and making the cat wear clothing, because obviously only human beings naturally wear clothing, by making him wear clothing, he's able, we're able to create this ambiguous figure. And this ambiguous figure, this trickster, this jester, is able to turn things back and bring them back so that what is below what is on bot when the bottom now comes to the top. Now, you've heard me talk about this quite before. The role of the jesters at the end of a cycle. The role, I've talked about it in the talk I gave with Jordan Peterson in Vancouver last year. I'll put links to that in the video. So if you haven't seen that, you can see it. But this idea that at the end there's some kind of trick which brings us to the next world. And so the cat uses this trick and the Miller son himself is actually innocent. All of this, okay? The miller's son is not complicit in the trick. And so the fact that the miller's son benefits from the trick, he remains innocent across the story. It's actually the cat who's operating these tricks, you know, below him, let's say, so that the miller's son can cross over the water so that the just can now attain what in the end would be. The idea that the Miller son was actually always the prince, let's say in his heart was always, you know, in his being was always, that's always what it was. But there needed to be a crossing over for him to become that. And so you can see that he tricks, but he also, he also kills the giant by tricking him. And so you can see the, in the stories you'll always see there's a giant type figure and a hybrid type figure. And those can sometime interchange, but they'll be facing each other. So a place where you have these two kind of giant and let's say hybrid figures facing each other at the crossing of river. There's one version that can help you see it, but where it actually doesn't succeed, where the crossing over and the flip that I'm talking about doesn't succeed is in the story of Hercules and Nessus. So Nessus is a centaur which stands on the side of the river. And Hercules comes and asks Nessus to cross his wife over to the other side. And so here's this hybrid horseman figure who goes to cross the Hercules wife to the other side. But then he's going to steal her from him and take her for himself. And sometimes either he clubs Nessus or he shoots an arrow and he kills Nessus. And the idea is that Hercules is able to kill Nessus before the. Before the whole thing flips over, let's say, and then Nessus takes. Takes Hercules wife. But you can see the terms kind of play each other out. This idea of this crossing over the river and how there's a trick that happens inside the river or related to the river. Another amazing version of this is in the Three Billy Goats Gruff, where the three billy goats are crossing a river to go to the other side. And there is a. There's a monster on under the bridge, a troll under the bridge. And the troll asks, goes to eat the first billy goat. And the billy goat says, I'm too small, I'm too small, don't eat me. And the second billy goat says, I'm too small, I'm too small, don't eat me. And then the third billy goat, who's the biggest billy goat now the troll is saying, okay, this is the biggest billy goat. I'm going to eat him. But it's actually a trick because now the billy goat is so big that the billy goat is able to kill the troll, and then all three have crossed over to the other side. Okay? And so you can see how the story of Puss in Boots follows that exact pattern. And what the pattern is is that as we reach the edge of something, as we reach the end of a world, of a civilization, of anything, what happens there is. There's a trick, there's something, there's a flip that happens, and then that flip is a surprise. And then what comes out is this new world. And the ultimate version of this is in the story of Christ. Now, when there's a tradition about Christ which takes the story of Christ and kind of expands it, it's called the Gospel of Nicodemus. And a lot of these traditions from the Gospel of Nicodemus were probably there in the church before and were taken up by the church in different forms. Forms, you know, in different imagery, different iconography. And it's this idea of the descent into Hades. And so in the story of the descent into Hades, Christ dies, and then he descends into death. And now in death, you have these. These characters of Hades and the devil who are cheering because they've taken, you know, the light of the world into darkness. But then it ends up being a trick, because if you take light into Darkness, obviously it's darkness that disappears. And so the death of Christ actually becomes the manner in which the world starts again because of that inversion which happens at the bottom in the darkness. And so this is just to kind of show you the pattern. And it would be interesting for people to think about it, think about other stories that you know that have this pattern of a crossing of the water and how there's an ambiguous aspect of it which carries, let's say. And the ambiguous aspect is death. Of course, it's an image of death. Now, the story of Christ, it's actually death. It's actually. But in other stories, it can be these ambiguous figures, like Puss in Boots, like Nessus. It can also be, for example, in the story of Elijah who crosses the river, it can be a garment of skin, a garment of dead animal skins which help him cross over. And it all can be an ark full of animals. This whole idea of flesh and animal and death, all these images that are kind of the support of. For the pure thing or the highest thing to then cross over and start the world anew. So that gives you a little bit of an idea of how these patterns work and how these structures work, how they work through different stories. And so, yeah, so I'm looking forward to reading your comments and your questions, if you have any. I'm doing these more improvisational style and so sometimes I might be missing a few details and so make sure you remind me if I do. And so, yeah, looking forward to hearing from all of you. All right, bye. Bye."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":1508.23,"end":1525.43,"speaker":"Announcer","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":1525.46,"end":1525.62,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #026 - 2019-01-14 - The Cosmic Significance of - Puss in Boots -","start":1525.85,"end":1564.15,"speaker":"Announcer","text":"And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
