{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":12.16,"end":81.68,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic World. Hello, everyone. I'm happy to be back here with Timothy Petitsa. Many of you have seen him on my channel once before, but most of you know him, you know, as a, as an author and of the Ethics of Beauty, especially because it's a book that many people that have come to the Symbolic world and many people even that are coming to orthodoxy today are reading as part of their path on the way to that, to that world. And it offers such a powerful vision, you know, of, of. Of human engagement and what beauty can do for us. And so, you know, Timothy started a new film company that I, I just saw the first movie on, on St. Anfilocos of Patmos. Wonderful film. And so I thought it'd be a great opportunity to maybe talk a bit about that, but then obviously continue to talk about beauty and its importance for the. For the meaning crisis. So, Timothy, thanks for showing up."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":81.84,"end":84.16,"speaker":"Dr. Timothy Patitsas","text":"Thank you, Jonathan. It's. It's great to be here."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":84.88,"end":98,"speaker":"Jonathan Pageau","text":"And so, you know, how do you go from, you know, professor, teacher at a, At a. Dean at some point of, of the Hellenic College and now starting a film company. What, what was the impetus for this?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":99.36,"end":174.67,"speaker":"Dr. Timothy Patitsas","text":"Yeah, that's a good question. I mean, I, I like cinema. I, I certainly like. I, I think of film as, you know, I think of it as well, I think a lot about, you know, how information has been recorded and transmitted over, you know, human, the span of human existence. And this idea that, you know, long before there was writing, there were people sitting around campfires telling, you know, fires at night, you know, telling stories, and it's so primordial and it seems like such a good way to transmit information from generation to generation. And, and to me, the film on the big screen, it is. The story is in the fire. You know, you're in this, you're in this. You're in the dark. The campfire or the fire is the screen. That's the light, and the story is there too. And I think that's just so powerful and such a beautiful experience. And any, Anything that can be told in that way, I think is worth trying to tell. Of course, you know, followers of Plato will say, you know, we're looking at the shadows on the, on the wall of the cave and that it's, it's really the worst way to tell information."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":174.91,"end":220.06,"speaker":"Jonathan Pageau","text":"But I think as Christians, we don't, we don't also believe that. We think Christ actually fills the cave up. And so the idea that, that, you know, Christ fills up the world with his glory. And. And all things are. It's a different vision than from what Plato presented. You know, it's like the images on the wall, the cave, in the Christian vision have a reason for. For being there. And in some ways, they're the ones that would lead you up out of the cave if you were able to see them as an anagogical ladder. And so I think that it's a. It's. I think that's a more consistent vision with how reality functions than the simp. Than the one Plato presents as just the. As the. The illusions, and then someone kind of pulling you out of the illusions into this. This pure light."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":220.94,"end":227.58,"speaker":"Dr. Timothy Patitsas","text":"Did I? Did I. That's. That's so well said. Did I ever tell you the story of meeting the Patriarch of Antioch?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":227.82,"end":228.86,"speaker":"Jonathan Pageau","text":"No, it was."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":228.86,"end":282.98,"speaker":"Dr. Timothy Patitsas","text":"It was. It was a. Not the current Patriarch, but the previous one. I don't remember his name. Maybe it was Ignatius. But I was at a conference, a Bioethics Conference in 2008 in Balamand, and someone said, the Patriarch wants to meet you. Like a hundred people at this conference. Like, what's that about? And we were summoned to a room, and we waited. It was like, you know, one of these sort of appointed rooms, and His Beatitude came in, and we stood up and took his blessing. It was another guy from Greece. And the. The Patriarch sat down and he said. And he had this very classic voice, as patriarchs tend to, and his was kind of like a little like rough sandpaper type of voice. And I won't try to impersonate him, but he said, the trouble with you Greeks is that you are all dualists. And while. While we were, you know, reeling from that opening statement."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":283.06,"end":289.78,"speaker":"Jonathan Pageau","text":"The opening statement, yeah. If you asked me to come here, I want to remind you, you invited me. You know, I'm just saying."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":290.5,"end":297.38,"speaker":"Dr. Timothy Patitsas","text":"And his next statement was, even a rock has a soul. And that was it. That was the whole meeting."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":297.54,"end":298.5,"speaker":"Jonathan Pageau","text":"That was the meeting."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":299.46,"end":333.58,"speaker":"Dr. Timothy Patitsas","text":"And, and. And of course, you know, I had done Old Testament here at seminary, so I knew that the Semitic view. You don't say. I have a body. You know, you, You. You speak much more in terms of I am a body, I am this unity, or. Or at least my task is to make that integration even more so. And. But certainly people think of Plato as, you know, as having introduced a kind of dualism into the West. Although. Although Lev Shestov thought, you know, just depend what. Depended which dialogue you were reading, you know, whether. Whether Plato was the problem, you know. But anyway, Plotinus was good."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":333.74,"end":406.24,"speaker":"Jonathan Pageau","text":"Yeah, definitely. Plotinus is. I mean, and there, there's such a connection between Christianity Plotinus that you, you do find some vision, a non. Dual vision that takes you out of this problem. So tell us now why you started. Why you started this film company, because we haven't answered that question yet. I just saw the movie. I just saw it last week. I was in B.C. at doing a parish retreat and. And someone said the, the. The. The movie and Philochios Saint of Patmos is playing. And so there you were. I could see you and you were part of actually in the movie. I didn't know you were going to be in the movie as well. And one of the things about it that really astounded me was, you know, it was obviously the, the, the life of the saint, the powerful testimony, but also not shying away from some stories that were really out there like that were really the story the old lady saying how in the saint when he was a baby would not suckle, you know, on fasting days. Like that kind of really legendary type of way of speaking about saints. It surprised me and in some ways I thought like, of course Timothy is gonna. Was not going to shy away from those types of stories, but I thought it was wonderful."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":407.44,"end":417.32,"speaker":"Dr. Timothy Patitsas","text":"Yeah. So, so what did you think of the film as a film though, overall? I mean, it's, it's. It's. Yeah, I want. I won't. Is it well done?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":417.32,"end":443.62,"speaker":"Jonathan Pageau","text":"I enjoyed it. Of course I enjoyed it. You know, I mean, it's a, it's. It's a documentary and it has all the tropes of the documentary, you know, panning visions of the, of the, the areas with, with voiceover. You know, I thought it was very. Is very. It was very well done. It did, it did what it had to, you know, and I mean, I'm also, I'm. I'm curious to know why you chose that subject as well. So maybe you can tell us a bit about, you know, the, the birth of this project."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":444.26,"end":582.22,"speaker":"Dr. Timothy Patitsas","text":"So one of my closest friends is Tamaida Houdanish and she was the director of missions and evangelism for the San Francisco metropolis. So she was on the West Coast, I was here on the East. We would work together professionally or run into each other when she was in Boston doing stuff. And we both had. Had wanted to do something in film or television that would help people experience pilgrimage. So I think both of us felt like pilgrimage is just such a central aspect of renewal and of joy in, in orthodox life and in Christian life. And we've gone on lots of pilgrimages. And many times when we've been cool places, we've thought, if only I had a good camera right here, I could just say something, even if it's, you know, 30 seconds or a minute. And so we were, we were looking in, you know, in those terms. So we founded Beauty First Films and people want to know. The film is called Amphilochios Saint of Patmos, and he reposed in 1970, but we were looking for projects of what to do and that would, I mean, for me as an educator, it's just, it's just a different way to educate. I don't mean that a film should be didactic. I, I mean that, you know, because obviously as a Beauty first person, I don't think, you know, I don't think education is, you know, involves the whole soul and everything. But, but, but we realized that the first ever feast day of this saint, Saint Amphilochios of Patmos, was coming up in April of 2019. And we realized that, that it would be like a, a very, a very defined window that, to tell the story of his life in the words of people who knew him or were big devotees and happened to come to the first feast day on the island of Patmos. I mean, the story sort of already writes itself. Right. And, and it's not like a six month production or three year production. It's just four to five days of interviewing everyone you can. So we knew it was a kind of a, a manageable bite sized chunk. And that was, you know, one reason why we went with it. And then of course, we love the Saint."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":582.38,"end":590.78,"speaker":"Jonathan Pageau","text":"Yeah. And so is your plan to do documentaries mostly, or you also would like to do some fiction?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":592.04,"end":642.7,"speaker":"Dr. Timothy Patitsas","text":"I, well, we, this is 2019, so we went from, we went from Patmos, you know, through Athens straight to Tel Aviv and we filmed all of Orthodox Holy Week that year of 2019, which, you know, may have been a kind of special moment in time. The end of an era, as it turned out. So that is now in post production. So that'll be our next film and we'll just, we'll just take it from there. I mean, we would certainly like to find, you know, more financial support that could get one of us, not me doing this full time, because I think we can do a lot more. And as I don't know if you've seen our Beauty first films, liturgical seasons calendar, so we've got creative ideas and Tamaida has a, a beautiful eye, so she knows how to make things."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":643.77,"end":693.78,"speaker":"Jonathan Pageau","text":"Yeah, you know, you know, I mean, I Think it's a great, it's a great project, it's a great idea. You know, what, what do you see? Because of course, you, you know, you wrote the Ethics of Beauty and Sal, you're involved in making beautiful things. What do you see the role of beauty playing in the meaning crisis in general? Because, you know, we both are probably in a similar position in the words for people that, that are coming at it and are learning about orthodoxy. It seems like beauty is also part of how they find a kind of solution to the, the meaning crisis, which would have seemed surprising to someone even 50 years ago, would say that one of the solutions to nihilism is beauty. But if you want to tell us a bit about how you see that."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":693.78,"end":788.86,"speaker":"Dr. Timothy Patitsas","text":"Functioning, I mean, there's so many levels in which to answer that. And I, I, I, you know, there's more philosophical, more theological. I mean, I, I'm just starting with basic biology, which is that, you know, most living things out there are, are, do not have a cerebral cortex, and yet they're making decisions just fine, and they're surviving and they're propagating and they are, they are able to discern in the structure of the world, you know, to the extent they need to and to, to respond appropriately. And so, you know, how are they doing this? They're doing this through sensation. And if you go down to, you know, the most basic cellular level, it's somehow at the level of chemistry that you, you know, things are, you know, the paramecium, the bacteria is out there sensing and reacting. So to imagine that human beings, you know, unless you are, are an exceptional theist, I mean, not even a theist, but a gnostic, then, then to imagine that human beings can divorce feeling from knowing or divorce knowing from feeling and sensing is really ridiculous. I mean, it's just nuts. Everything is out there making decisions and, and flourishing without the brain. I mean, yes, some things have brains, and then that's another story, you know."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":790.86,"end":818.63,"speaker":"Jonathan Pageau","text":"And so why do you formulate it as beauty? Because if, you know, the way that I would formulate it originally is I would, I would talk about goodness, you know, in the, in the way that Dante talks about goodness, or in the idea of that which is desirable, maybe even just that, like the idea of, of moving towards that which is desirable, you know. And so why is it that you feel the need to formulate it as beauty?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":819.11,"end":896.97,"speaker":"Dr. Timothy Patitsas","text":"Well, didn't Aristotle say that the beautiful is the radiance of the good or something? So, yeah, so to survive, we need, we need to, to Remember again, you know, how to, how to think visually, how to think in terms of holes. We're, we're trying to design a new major right now at the college. And I can't say what it is, but the thing that convinces me that it's worth doing is the beauty of it. And, and then the question, you know, has arisen, well, is that a sufficient grounds? It isn't. Maybe. But maybe it is because a feeling for beauty or for harmony is, you know, it's. It's the fastest way often to discern the health of a situation. And health, you know, is a cipher for that underlying. Underlying, you know, good functioning. So, I mean, we're not computers. We are, you know, we're, we're biological beings and we're, you know, we're just. That's. We have that capacity and we don't have the possibility of thought without that capacity."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":897.53,"end":993.97,"speaker":"Jonathan Pageau","text":"Yeah, and there's. Yeah, I think that's right. And. But there's a. There's an intuitive aspect to the way you're presenting it, which is that, you know, our capacity to perceive health is a good. It's a, It's a good way to talk about beauty in a way that, that might stretch people. You know, when I look at someone, I perceive health very much so because I'm. So I'm. My whole being is there to detect that, to know, even in terms of, like, infection, even something like that, or to understand in the situation I'm dealing with. And a lot of our markers for physical beauty are really just health markers and, and symmetry markers, you know, to, to. To be able to tell, you know, how, how aligned someone is towards reality. And so we can then. We can then understand that humans have that capacity in general, not just towards people, but also towards situations. You know, when you, you enter a room and there's disorder, you know, you know, if people are moving in ways that is not normal, like, you know, let's say you walked into a room where people have just had a fight. You will be able to detect that intuitively without thinking yet, because there'll be. Things will be laid out in a manner, and the movements of the people will be happening in a. In a. In a disorderly way. And you'll catch that really fast, even with. Before you're thinking. And so, you know, I think that's an interesting way of talking about a very, very immediate manner in which, in which beauty matters."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":994.45,"end":1119.37,"speaker":"Dr. Timothy Patitsas","text":"There's so many aspects of this, and one of them is, you know, I, I think, you know, the, the Pivotal chapter for the 21st century is chapter 22 of the Death and Life of Great American Cities of by Jane Jacobs, my friend and mentor. And that's the chapter where she presents Warren Weaver's summation of the past 360 years of science. You know, science since we've had the scientific method. And he says, although science, you know, is vast and does a lot of things, in fact, there are three kinds of problems that we know how to solve. Three, three, you know, as, as a genus of problem, there's only three. And, and, and one of them is the problem in organized complexity. And what Jane Jacobs does, you know, the, the problem was a living system. It's an organism. And society is like that. The economies are that, cities are that, families are that, institutions are that, you know, companies are that. And, and when you are in that realm, Jane Jacobs gives you, here are the tactics for, for. Here are the tactics for understanding those kind of systems. And in chapter eight of my book, I lay this out and I add several tactics of my own that are implied in her work or that I've. So how. But an eye for beauty, Train. Training in beauty or training in grammar? Because, you know, for me, beauty, goodness, truth is the trivium of grammar, logic, rhetoric. But training in pattern is, is, is the best training for understanding living systems or just systems. And you'll. A person trained, they know in a flash all the, all the. And Jane James specifically says this. All the statistics that you can compile about, in this case, it was Boston's North End, just, you know, they don't tell you the full story, but to go there and observe unaverage clues. Now you said, well, we better look for different statistics."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1119.85,"end":1208.12,"speaker":"Jonathan Pageau","text":"Yeah, yeah. I mean, that's. And I think the city example is a great example in the sense that, you know, and I mean, everybody's had these experiences, like you're walking in a city that you don't know, all of a sudden you take a turn and then all of a sudden you realize that you've taken the wrong turn and that now you know that you're not in a place you probably should be or that you're in a place where all of a sudden the risk has gone up, you know, substantially. And you can tell that even if there's no people there, like, even if there aren't people there that are suspicious or whatever, you can tell by, by, by a myriad of signs that are, that are coming together in a pattern, you know, that is saying that to you, you know, and that I think is a great example to, to understand and, and you can understand how sometimes, you know the, the cliche of fixing a city by saying we don't want broken windows. Right? That kind of cliche where it's to say that if you actually transform the pattern of the city itself, you can't even transform the culture that people live in. Because if I, if I'm walking through a dump, I know that I can just toss something on the ground and it doesn't matter even if usually I might even not do that. But if I'm walking through a place that is cared for and pristine and, and is full of care and attention, then even my worst, my worst habits might be reined in by the space in which I'm in. I mean, that's a powerful testimony to beauty right there."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1209.4,"end":1304.24,"speaker":"Dr. Timothy Patitsas","text":"So, so yeah, I, I think training in the liberal arts or the fine arts, you know, is, is vital for people to acquire wisdom or to, to lead at, at big picture level. Like you shouldn't trust leadership who don't have a good aesthetic sensibility. And anyone, anyone could see that our approach to farming this like highly centralized government, subsidized the car gills and all this and the, you know, the, the, the erasure of the family farm and of rural culture and the, the chemicals and you know, of different kinds, the fertilizers and the pesticides and all this, that compared to regenerative agriculture. Anyone who, with a, with a liberal arts degree will know one is, is sick and one is healthy. But people with. Trained in the other kinds of science, reductive or statistical, will not see that and they will push us to the point of collapse. And, and that brings us eventually now or later to Ian McGilchrist, the master and his emissary. Because what, what he's doing in that book is saying, you know, is basically saying that the, this, the, the brain hemispheres really are meant to unfold in a beauty, goodness, truth sequence and that we, we've lost that we've lost the, the right hemisphere, we've lost the feeling for holes and we are reflexively repeating things, you know, that are good, that are driving us to exhaustion and destruction."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1305.76,"end":1319.04,"speaker":"Jonathan Pageau","text":"And so, I mean, it's interesting because I imagine when you wrote the Ethics of Beauty, you weren't aware of Ian McGilchrist. So what does his work, how's it transformed your vision or how's it affected the way you understand beauty?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1319.76,"end":1332.26,"speaker":"Dr. Timothy Patitsas","text":"I think it just made me want to kind of just collapse. Exhausted. Like, we don't need my book. We've got that oh my goodness. I, I, no, I, I think."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1334.82,"end":1335.1,"speaker":"Jonathan Pageau","text":"He."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1335.1,"end":1343.9,"speaker":"Dr. Timothy Patitsas","text":"You know, he, he ought to read the Ethics of Beauty and I ought to finish the Master and His Emissary. And then he's got this other one that's called the, the Matter with Things."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1343.9,"end":1368.44,"speaker":"Jonathan Pageau","text":"Oh my goodness. That book, it's a, it's like if Ian McGregor, if you ever see this, that book, you're not allowed to write books like that anymore. We're not in the 17th century. It's like this is, this is an attack on us, this book. And so, you know, I know people that have bought it and they keep it on their table as a, as like daunting as a daunting thing. I'm not even there yet. I, one day I will buy it, but then it'll stay on my table for like a year before I even touch it."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1368.92,"end":1460.26,"speaker":"Dr. Timothy Patitsas","text":"But I mean, you know, the thing, the thing there with just what he shows you is that essentially you're meant that the two hemispheres do everything together, but that the quality of the kind of attention that the right hemisphere, for right handed people, the right hemisphere brings is it's concerned with holes and then the, the left hemisphere is concerned with parts and the way thinking ought to proceed. He says, is this a sense of context, handing off to the left brain for analysis, handing back to the right brain for reintegration? So that's exactly what I lay out. I mean, the Ethics of Beauty is, you know, it's a book about cognition, it's, it's a book about many things, but it's a, you know, the structure of, of what it means to know and as a human being, not as a computer. So it's the same exact parallel. So, so no, what, what does that really add? I think just confirmation. For me, it's confirmation. And then he has, you know, kind of a theory of history of, you know, that civilizations start out with a balance between the hemispheres and then as they, as they, they succeed, they get greedy. And as they get greedy and gluttonous, they start to rely more and more on the left hemisphere. They just want to, they want more. And, and then this coincides with a, a decline in intelligence, like real intelligence, that global intelligence. And so they exhaust themselves, they just drive themselves to destruction."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1460.58,"end":1575.62,"speaker":"Jonathan Pageau","text":"Yeah. And so how do you see that in like a, you know, this to me is, there is a challenge, let's say I would say to us, leaving as orthodox Christian because you know, we have, at this point, it wasn't the case forever, but at this point we have something that we could call a liturgical algorithm. Like, we have a program. We've got it all. Like, we've got all the books and we've got a. We've got all the, all the cannons and all the matins, and, you know, it's all there. And you could run it, like, you could probably run it, you know, on a computer. You could have a computer running the services and, and it would just be all timely and you would have all the right canons and the right, the right different. The different hymns at the, at the right time and everything, you know, and I, I'm being. I love Orthodoxy. I'm Orthodox. I. I became Orthodox. And so I'm. I'm being. Playing devil's advocate here, but, you know, there, it seems like from the outside, there is an argument to be made that there's a danger of that fix. Fixity in the liturgical practice, which is that, you know, take the book out, read the book. This is how it goes. You just follow the rubrics. You know, that's how it works. And that, that we've lost the flexibility. You know, that. Because we know the early liturgies had more improvisation in them in the sense that then we knew the sections, but that there was probably variation in different places in. In. In some aspects, although the liturgy was universal. I don't know if you've thought about that in terms of, like, the use of. Of written prayer and all that. If it. If it is an example of the danger of, of fixing right and of. Of following the, the rules and the rubrics. I didn't know I was going to go here, by the way. This is just. Just came to me."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1576.18,"end":1762.22,"speaker":"Dr. Timothy Patitsas","text":"No, I, I've been thinking about this because it seems to me that to. To balance these two modes of, of awareness, the this right hemisphere, left hemisphere, or the, you know, this holism and, And a more analysis. It's helpful to have. You need some kind of a ritual that will help you. The purpose of ritual and of liturgy is, you know, to convert chaos into order, right? It just. It beats chaos and it puts out order on the other side and, but not just any order. It produces cosmos. And I think, you know, the liturgy is not enough. You have people formed by the liturgy. You need liturgy at fractal scale. You need people who have. Are internally liturgical who are deeply prayerful and deeply repentant and whose consciousness has been transformed. So the point of what. What McGilchrist is worried is that. That the left hemisphere deals with a representation of reality, not reality itself. And because that is easier to work with, and it can. Is more efficient to work with it. It prefers it. Liturgy is supposed to be openness to the radical unknown, and it's supposed to be openness to a God who is so vast that, you know, without a mediation of liturgy, the encounter would crush us. And so. So hopefully it's the opposite of that. Um, there's really no way to ensure it. I mean, it's just the adventure of freedom. But I think what happens practically, you know, like this. Our saint, you know, in the movie Saint Onios, the moment his spiritual life started to get intense, he went straight to Saint Nectarios. Saint Nectaris was 75, 80, whatever he was, and Saint Onus was 19, 18 years old, and he would, you know, travel from one island, you know, quite a ways to the other for that guidance. And who. What other saints that amphilochios know? Well, he was the spiritual father of Kalistos, where he was the person who tonsured Saint Gavrilia, the Ascetic of Love. He, you know, those saints, they run to each other because beauty, goodness, truth is grammar, logic, rhetoric, truth comes at this synodal level. It comes in some kind of a communion. We're constantly. It seemed good to the Holy Spirit and to us, and. And. And. And hopefully liturgy is unleashing that c. But I'm not worried about liturgy for the same reason. The. The Big Book of Alcoholics Anonymous isn't worried about who's. Who's going to make sure an individual chapter of AA sticks to the rules. They don't, because they said the disease and death will take care of that. And if. If people are faking liturgy, then, you know, their spiritual lives will wander away to nothingness, and the organization will dissipate."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1762.38,"end":1846.72,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's a good point. That's a good point. And. And I think that the way you describe it as being held by the lives and the testimony and the. The. The experience of the saints, you know, is. Is. I think that's the right way, because obviously, you know, the fact that I have to go to confession, you know, you know, at some point if I want to commune, that's a. That is not. That's not a program. Right. It's not. I mean, you could probably do it as a program, you know, if. If you wanted to, but it. Definitely not running a program. It is. It is. It is always terrifying. It's always this kind of internal eye, this kind of this, you know, this, you know, and so to, you know, and no matter how many times you do it and no matter how many times you repeat the same stupid sins over and over, it still, at least for me, is existentially fills you with a kind of existential terror that does not have the. Cannot, could not traffic in the kind of, you know, limited certitude that McGilChris talks about in terms of the left brain and just of the. Of this kind of rational understanding. And so, you know, if that is what feeds us through the liturgy, you know, then the liturgy becomes, you know, a dance playing out, you know, those inner. Those inner struggles and that. That. That inner compunction."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1847.36,"end":1903.91,"speaker":"Dr. Timothy Patitsas","text":"I mean, the reason I didn't, you know, mention beauty at first and I mentioned, you know, protozoa or something, is. Is because, you know, to the. To the. The. The. The. The. To Mrs. Blowfish. Mr. Blowfish. Look, it's. It isn't. Yes. Beauty in. In symmetry. Beauty that is something real. But spiritually, we are asked to look beyond that or to, you know, and we are. And there's other kinds of beauty that we encounter and that, you know, we see in the poor or in the. In the. The person who's broken down by life or the person, you know, it's not just. It's not. There's something sacred about, you know, a beautiful face. There is. But, you know, you start to see other dimensions of beauty that are equally or more important and."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1905.27,"end":1930.59,"speaker":"Jonathan Pageau","text":"Yeah, well, I think. I think that there. Even. Even to argue it from a biological point of view, you know, because life is costly, and it seems like it would make sense that at some point humans would be able to recognize the value of those that are willing to make that, pay that price, you know, and so. And so the. The idea of a."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1930.59,"end":1930.91,"speaker":"Dr. Timothy Patitsas","text":"Of."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1930.91,"end":1966.47,"speaker":"Jonathan Pageau","text":"Of someone. Warrior coming back that's maimed, that scarred that someone, you know, a woman who. Who gave herself into. In childbirth and, you know, is affected physically, and she has the marks of that transformation, it seems like at the very basic level, of course, you know, the beauty, like you said, you know, but. But at a. At a deeper level and also over. Over time, it seems like it would be necessary that people learn to recognize the beauty of those sacrifices, which is why girls love scars too. Chicks dig scars."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1966.95,"end":1967.43,"speaker":"Dr. Timothy Patitsas","text":"It's."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1968.31,"end":1970.94,"speaker":"Jonathan Pageau","text":"Sorry. Sorry to take you off that, but, you know."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":1970.94,"end":2038.18,"speaker":"Dr. Timothy Patitsas","text":"No, no, I was. I was thinking of something. Yeah. You know. Yeah, I. I think that's. This is true. And. And certainly the aesthetic of the church, which has. Is not sweet or merely externally perfect, but it has, you know, bears scars within it, that joyful sorrow or whatever the word is Bright sadness. That's. That's the aesthetic of the church. And it's more like, you know, blues or. Or. Or bluegrass or. Or jazz than it is like. Maybe then like, is like classical music. Although classical music, you know, depends on the composer. Had balances, joy and sorrow, you know, and it's great compositions as well. But Christopher Alexander talked about, you know, that somehow that the building has to age to be truly beautiful. It has to kind of, you know, it has to incorporate the passage of time and that. That where is. Makes it start to come alive and. And glow with. With a certain fire."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2039.54,"end":2056.42,"speaker":"Jonathan Pageau","text":"I think. I think that's right. I mean, our own experience of things that are supremely beautiful. Often. You know, this is actually one of the. This has been my thinking about beauty because, you know, we. We tend to say that beauty is harmony and beauty is symmetry and all these things and."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2056.62,"end":2056.86,"speaker":"Dr. Timothy Patitsas","text":"Sure."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2056.86,"end":2115.04,"speaker":"Jonathan Pageau","text":"And. But then my experience of that was that it's just. That's not true. Like, it's not completely true. It's partly true, but it seems like my perception of it. It seems like what we find beautiful, even visually, aesthetically, is something like symmetry adapted to a particular. It seems to be something like that. It seems to be something like balance that is well suited to a particular situation. And therefore it has to encompass some type of play with its environment, whether it is the dings and scratches of use or whether it is a beautiful church that is laid in a slope or whether it is. You know, so there's this. There's always this sense of. Of order, but that is in. That is embedded in particular. That is more chaotic or more. Yeah, that can be a little. That can be off even. You know, and that. That. That seems to be part of how we experience beauty."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2116,"end":2215.54,"speaker":"Dr. Timothy Patitsas","text":"It's, you know, it's because. I mean, it's because in the kenosis of the logos, you know, which brings about the creation of the world, the kenosis is so complete that it's continually adapting to the. The creature or to the situation of the creature. And. And this is fractal order, right. That. That. That in fractals, everything is exactly to its place. And, and by the way, that's the. The Plato's cave answer too, because within the cave is another kind of. You know, it's at every scale. And one of my former students, Georgia Williams, you know, she said. I think that she wrote an article about this somewhere, but she said, I think that what we call fractals is what Dionysius called the hierarchies. Yeah. And. And once you realize that the celestial hierarchies and the ecclesiastical hierarchies are fractal shapes, then everything, you know, just a lot more things make sense. And first of all, hierarchy is not a dirty word anymore. It's just fractal structure. This is the way the world has to be, because what's being given is so infinite or beyond infinite, and what's receiving it is so, you know, we're so weak. And, yeah, we need. And. And that's another reason why, you know, go film. Look, not everything. We can't. I cannot be in liturgy 24 7. So what about, you know, what fills the space fractally? Other things, you know, the other times. And yeah, that's."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2215.54,"end":2357.41,"speaker":"Jonathan Pageau","text":"I mean, I think that that's the. Some of the things that I've been talking about in terms of, you know, I use the family meal as an example of, you know, a type of liturgical act which is not strictly liturgical, but participates in the same. In the same structure. This. And, and you could bring that all the way down to having coffee with a friend or a conversation or breathing, right? It's like these, These. These structures of. Of. Of kind of moving in and out of the mystery and is there at every, at every level. And, you know, the Jesus prayer, for example, as like the basic liturgical structure for your thoughts, you know, kind of expands and, and, and, you know, and can be seen through all aspects of life and then into the grand cosmic liturgy of the angels. And I, I. I think your perception about how our. How it's fractal, obviously very akin to the things that I talk about, but the idea that that's how that hierarchy is actually just the way the world works. It's not a. And it's not. It actually is condescending. People always think of hierarchy as something which separates, but hierarchy is also something which unites because it adapts its glaring light to the particular situation, you know, and sometimes, you know, we. We don't understand that even in our lives, we don't understand that we're not ready for the vision of the divine Logos. You know, it's like you don't want that, actually. And so you have to. When you receive the little graces that you receive, this is. This is God loving you, right? Even if it's the smallest grace, it's God loving you. Because the reason why you receive the grace, the small graces, where you receive them is because that is your capacity to receive them. They're the ones that can provide fruit. You know, if, if the, if the, The Faucet was open and the grace just fell on you. You'd be, you'd burn like, you'd burn in hell, like which you would be. You would be, you would be overwhelmed. And so it, that's why I think hierarchy is so if we can help people understand how hierarchy, what it is actually, and that it's not just like a, you know, authority and power coming down, but it is this condescension of, of. Of authority down to the level that's appropriate."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2357.41,"end":2445.53,"speaker":"Dr. Timothy Patitsas","text":"You know, Saint Siloan, you know, he had a vision of Christ when he was still a novice at vespers. He said afterwards, if that vision had lasted even one more second, I would have died. And so, so that, that is that we. We. And, and I'm thinking of a, a recent elder in, in Russia who, a man came to him, said, I'm dying of cancer. I want, I've heard you, you know, you're a miracle worker. Heal me. And he said, do you believe in God? He said, no. Then the priest said, priest said, do you want to believe in God? He said, no. And so the priest, without really, you know, missing a beat, he said, well, do you want to live? Do you love life? And the man said, yes. And so the priest healed him. And this is a true story from the 90s. And I, I think, look, I know in the film, you know, some things happen in our said that, you know, are, are, you know, like, like that people like to mock the thing about babies that won't nurse on fast days. But Mother Nectaria, my other great mentor, you know, this was said about some, some elders that, you know, we knew and she went to Cyprus and talked to like, the women of the village and, and they didn't. They just said, hey, it was, it was the darndest thing, really feel out of it. But it's amazing it still continues to happen that, you know, some kids are just born with that much grace. But it's not something I think about a lot because that's not my reality."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2445.93,"end":2489.78,"speaker":"Jonathan Pageau","text":"Yeah, well, that's why I loved it when you put it in there, because I think like a more, I think like a more modern type of. Of person, like a modern type of filmmaker would have not put that in because it's so counter the way that, that our lives are. Because our lives are so mundane to some extent. But like you said, you know, the, the, the medieval world was full of these stories and to think that they're all made up is ridiculous. It's just, the world was just, you know, Some people live in a. In a world that is more like, more of a dance than ours. And. And in the moments where you actually experience that dance, you should understand that maybe that dance could be 10 times more than the one that you're experiencing right now in this. These little moments."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2493.38,"end":2499.46,"speaker":"Dr. Timothy Patitsas","text":"It is a thing, you know, but. But I think the danger is, you know, to. To, you know, like, chase those things for themselves."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2499.94,"end":2500.78,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2500.78,"end":2546,"speaker":"Dr. Timothy Patitsas","text":"The thing is, you know, the first. The first commandment Christ gave us, you know, in his incarnate ministry was repent. And. And Saint Paisio said, just pray for a spirit of repentance. Don't ask for anything else, because you won't be able to handle it when it comes. And. And that's the found. And if we can just pray for a spirit of repentance, and then miracles can come and go, or, you know, people can tell stories, and sometimes, you know, people tell stories and they do seem kind of made up. And, you know, you let that go and it's. It's not. It's not a huge thing. The point is, you know, to have your own hopefully, you know, dynamically alive relationship with Christ and to let. Let that, you know, hold these other things along."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2546.24,"end":2585.11,"speaker":"Jonathan Pageau","text":"Yeah. You know, and so. So the biggest. The biggest affront, at least on its face to beauty is the cross. You know, because the cross is. It is the most horrible thing. You know, it's presented that way in. In scripture. It's. It's presented that way in. You know, it's an object of torture and Christ is tortured. But nonetheless, we have the intuition and we hear it in the church, and we. That. That in fact, the cross is beautiful. And so how do you square that? Like, how do you see that coming together?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2585.99,"end":2700.38,"speaker":"Dr. Timothy Patitsas","text":"Oh, I don't know. I mean, I certainly said I don't know. I certainly find my cross is hard to bear, but. But I find yours very beautiful. I. I find, you know, meeting someone who's willing to. To risk their lives for me. You know, I was in a fiery car crash on. In. In 2017, and thank God the car didn't tip, but, you know, it was really on fire. And, you know, as I. As I emerged out of the fire, there just happened to be a fireman getting off duty. And, you know, when I. When I thank God that the car didn't flip, you know, because then that might have just either been the end of me or I would be even uglier than I am. No, just kidding. I would have, you know, really been, you know, had all kinds of things going on would be hard road to hoe. And my faith is not, you know, infinite, but my main reason I'm happy is that that poor guy, he was just coming home from work on a Sunday morning and would he have had to go into the flames? For me, that would be awful. I mean, but had he done it? Yeah, it. It's just beautiful that God put him there and that, you know, that he was ready. Seemed ready. So. So certainly. And when we encounter in a relationship that the other person is unwilling or unable or psychologically unready to bear even the smallest cross for us, that's really sad. You know, that's really. That's much harder, you know, than. And, and then we re. Then we realize, well, we've got to up our game and we've got to carry a few more crosses for the life of the world and stop trying to be so pretty and focus on being beautiful or on being good and letting the beauty come out of that."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2704.06,"end":2762.87,"speaker":"Jonathan Pageau","text":"Yeah. Because, you know, it was interesting. You know, I'd never had that experience before, but I was on Monetos in. I mean, you actually helped organize my first trip there, by the way. Thank you. I'll say that in public. That was wonderful. But I went back again, as, you know, with Jordan Peterson, you know, and we met the abbot of the. Of Xenophon monastery. We were. And you know, to me, that was really something of an experience of. Of the deep beauty because he was a broken old man. You know, I mean, his back was out and, you know, he had all the characteristics of a very elderly person who's had a very full life. But, you know, it was impossible to stop looking at him. Like it was some. There was something more than just the. Just the, The. The usual advertisement, you know, Hollywood aspects of what we find to be beautiful. And it was a visual thing. Like, it."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2762.87,"end":2763.19,"speaker":"Dr. Timothy Patitsas","text":"It."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2763.43,"end":2844.85,"speaker":"Jonathan Pageau","text":"Part of it was visual. Not just visual, but part of it was visual is that I really. He was hypnotizing like it was. There was. It was difficult to stop looking at his face because there was so much simple joy and, you know, and. And a kind of presence that was exuding from it. And so I think I did have like a little bit of a. Of a vision of how the cross can be beautiful. You know, although we, you know, when we make icons of the cross, we. We're careful. You know, we try to make it in a way that won't attract to the. To the. The kind of torture aspect of the. Of the cross. And I think it's good that we do that, but we also know that that's what it was. I mean, we know that Christ on the cross visually did not look the way that we represent him in the. In an icon. You know, we're trying to represent the inner aspect, that. That kind of transform aspect, but the outer aspect would have been horrible. But I. That was a. A moment where I felt like I was able to see a surprising, you know, in someone who is, you know, old and close to death and. And has had this full life of sacrifice, that there was something shining. So anyways, I'm sure other people have had experiences like that, but to me, that was helpful to help me understand what beauty is. You know, in a deep. In the deepest way."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2846.45,"end":2902.67,"speaker":"Dr. Timothy Patitsas","text":"Somehow as a society, you know, we had our kind of Disneyland phase of beauty. And, you know, we took that into our personal lives somehow and expect, you know, even our spouse or something to be like that. But the. The. I. I mean, I think, you know, in McGilchrist's point is that, you know, we're in a societal crisis or a civilizational crisis, you know, and somehow the thing is, I don't think that he can really. All he can really do is point very dimly, you know, to religion or to even philosophy. Something that. To say that the brain, you know, is. Function, functions in this way doesn't really give you a program. It just tells you that you might want to pay attention to people who have the program. And. I don't know."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":2903.71,"end":3022.22,"speaker":"Jonathan Pageau","text":"Yeah, there. There is. I mean, there is a. A. You know, I think that his recent book, like I said, I haven't read it. I think his recent book is different, you know, in the sense. I think that he is trying to. To give more of a. Of a. Of a vision of. Of how to live. Because it's true that in the Master and His Emissary, it's. It's like a. It's a critique. And saying to someone, you know, use your right brain more doesn't mean anything. Right? It doesn't mean anything existentially. It's not a. It's not a phenomenological proposition. It's a. It's a prop. It's an analytical proposition. It's a left brain way of talking about the problem. When you say this. It's a brain problem. Like, it's. It's. It's an experience problem. It's an engagement problem. It's. It's not actually a problem of the brain at the outset. And so I think in some ways he's a bridge because he's actually using left brain way of talking about the world in order to exit, to. To show the problem, you know, and it helps people kind of understand what it is. But honestly, like, the brain has very little to do with your experience. Like, you do not experience your brain and your brain, you know, you, You. You don't. Your brain is an abstraction in your life. It's not something that you. You don't experience things through your brain. You don't. You know, I'm not. I'd be careful. People understand what I'm saying. I'm not saying the brain doesn't do what we say it does. I'm saying that it's a. It's. It's like the motor of your car, right? You know, you drive the car and you have a steering wheel and you have the pedals. That's your experience of the car. Like, you don't experience what's happening inside the motor is. Is sec. Very secondary to your experience of driving. And that's the. That's also the. I think one of the issues with. Not the issues, but I think that that's in some ways where Midgil Chris and the master's emissary kind of leaves us off with this more. This kind of technical way of talking about it. But, but I never, like, I wouldn't use that. I wouldn't say right brain, left brain."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3022.54,"end":3080,"speaker":"Dr. Timothy Patitsas","text":"Thinking, because, yeah, I think chapter 22 of Death and Life is better in the sense that it just tells you that we have three modes of science, and we prefer the first two because they give us the illusion of control and the illusion that the universe is a dead thing, and the other one is just a lot harder. But the fact is, see, if I were a corporation, how would I just absorb all this and try to stay unrepentant? I would just say, well, let's just get out there and, you know, fund some great liberal arts programs and let's just hire their graduates and we'll have them and the engineers, you know, balancing each other like you would. You. You could just try to operationalize it like that. Like, we'll get your artists involved or just get. The problem is that life is a. A much harder form of art. And yeah, the liberal arts are indispensable, but then you've got to have the way of the heart. You've got to actually pursue the sacred and the holy, and you've got to do it well."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3080.48,"end":3114.97,"speaker":"Jonathan Pageau","text":"And it's all. That's. It's. It's education too. It's about people. That's the. You're going to have to do. You can't make it into a system. It really is the difference between a good teacher and a bad teacher is the world, you know, and, you know, we just send our kids to high school and we just don't know who their teachers are, you know, and we just. But the reality is that all the great colleges were built on people. They're not built just on abstract knowledge. And, you know, I, I was. I don't know if you know about Ralston College. We. I just came back from there, did a. An event there. McGill, Chris, also."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3115.05,"end":3116.05,"speaker":"Dr. Timothy Patitsas","text":"Good things. Good things."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3116.05,"end":3147.32,"speaker":"Jonathan Pageau","text":"Yeah. And they're. They're building it, I think, in the right way. They're building it based on, you know, it's like connections and people and understanding that, you know, a valuable person is more than a program, that we need the program. But to have the right person in the right place, you know, that has the right intentions, connecting with the students is more valuable. And anyway, it's been. It's pretty. It's pretty astounding what they're able to. To do. It gives you hope, you know, for liberal arts, for sure."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3147.4,"end":3227.07,"speaker":"Dr. Timothy Patitsas","text":"Yeah. I'd like to learn more about it. Of course. Of course. I think Hellenic College has the edge right now of any liberal arts school in the nation, just because the. You know, the reason I became friends with Jane Jacobs is because I noticed that she was describing cities as if they were really liturgies. And, And I think when you. When you study living, you know, real, real organic life, it always has this, you know, that. That breathing that you mentioned that that sign of liturgical living. Things are constituted liturgically, and it's. And to have. To have that be part of your college experience. Now, if some young person is listening to this and, you know, they can't come here necessarily. We don't have an engineering program. But if you can put pilgrimage into your life and get good at liturgy and understand what is the way of knowing that's imparted. Of course we have this. We have them both here. And it's still a struggle. That's just life. I mean, you just. Every day is a struggle and. But yeah, in some sense, we're the ideal college at the moment, although thankfully not. No one seems to realize that. Well, we'll see how handle 30 freshmen a year, but. Or whatever."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3227.31,"end":3238.3,"speaker":"Jonathan Pageau","text":"Well, I can't wait because for people who don't know, I am going to be at Heleni College in a few weeks on was it April 17th."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3238.38,"end":3240.82,"speaker":"Dr. Timothy Patitsas","text":"It's 17. That's a Thursday, right? Thursday night."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3240.82,"end":3244.22,"speaker":"Jonathan Pageau","text":"Is that, Is that when the event is? Because I have three days. But it's, it's around there."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3244.22,"end":3252.7,"speaker":"Dr. Timothy Patitsas","text":"It like you're coming on Wednesday and. And we're hanging out on Thursday, and it's Thursday night. I think it's Thursday night. And there's. And tickets are available on Eventbrite."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3252.7,"end":3278.37,"speaker":"Jonathan Pageau","text":"All right, so an Eventbrite. I will be Atlantic College selling out fast on the 18th, so get your ticket. I can't wait to see the college because, you know, I've never been there, and so I can't. I, you know, and, and I am definitely interested in the future of education and also especially liberal arts education. So it's, it's wonderful to see an orthodox based community trying to do liberal arts in, in the right way. I think it's great."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3278.93,"end":3309.9,"speaker":"Dr. Timothy Patitsas","text":"You know, liturgy has to have a, you know, a component of long being long and boring. If it's, if it's, if everything is as an, you know, as a purpose function, then you remain mired in the left brain, and all you're really doing with your Christian faith is doubling down on, you know, the mistake of the civilization, which is to not be beauty first. And it's to be so entranced by, you know, the power of utility that, you know, you just are. You're just a danger to yourself and others."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3311.02,"end":3317.02,"speaker":"Jonathan Pageau","text":"I love, I love you saying that, you know, your liturgical life has to be long and boring to people watching."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3317.28,"end":3323.44,"speaker":"Dr. Timothy Patitsas","text":"There has to be. It has to wait out yourself and your own flighty mind and come to something deeper."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3323.6,"end":3365.12,"speaker":"Jonathan Pageau","text":"Yeah, because, I mean, anybody who's been through a long liturgical service will notice that at some point, your thoughts just go crazy. Like, your thoughts just kind of go all over the place. And at first you don't notice it, but after you've been through several services, you're like, wait a minute, I'm not here anymore. Like, I'm just not even here. I'm somewhere else. I'm thinking about especially you're a creative person. Like you, like me, who has plenty of things to think about, plenty of stories to write, plenty of, you know, so it's so easy to write stories when you're enduring liturgy. Right. It's like, oh, yeah, but it's, it's a good exercise because it makes you realize to what extent, you know, you're a slave of your thoughts and of these, you know, of these logis moi, that kind of drop in. So, yeah, it's good to do that."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3365.36,"end":3427.9,"speaker":"Dr. Timothy Patitsas","text":"I Feel bad for mentioning Hellenic. I'm not trying to hijack, you know, the podcast, I mean, but the. The. Because the larger issue, though, you know, is. I mean, I've been reading a lot of Wendell Berry this Lent. I'm trying to make that part of Lent because, you know, he's calling for some kind of social repentance, and it. You can see how it. It really syncs with McGilchrist. And there is. Repentance should lead to kind of social renewal. And. And I think, you know, we see very clearly now that our mental inability to comprehend beauty or its importance or to give it the respect it's. It's due is something is a mental state that needs to be repented of. And that's what repentance is. You know, it's change to renew and transform the mind. I don't. I don't know. I mean, we didn't get into something else. Maybe for another time. But it's. It does seem like, you know, our civilization is a. Is a struggle between the nominalists and the realists."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3428.14,"end":3428.62,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3428.7,"end":3447.42,"speaker":"Dr. Timothy Patitsas","text":"The only solution is, Is the symbolic. And that's, you know, what you're trying to lead us back to. So, I mean, I think the things that I'm saying are kind of just very small pieces of that. What your work is the main work, that somehow to recover the symbolic vision. That's where the nominal and the real are reconciled."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3448.02,"end":3466.74,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. But no, I think. I think that we're. Both of us are very much in parallel, which is why people, when they read your book, they. They feel like they're. That we're cousins and thinking, you know, like that. That you're completing some of the things that I. I'm saying, and I'm coming close to the things you're saying. And so I think it's a wonderful. Oh, what's wonderful?"}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3466.74,"end":3467.62,"speaker":"Dr. Timothy Patitsas","text":"Yeah, sorry."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3467.62,"end":3472.82,"speaker":"Jonathan Pageau","text":"It's wonderful to know you're on my team, is what I was going to say. Or that I'm on your team. That we're on the same team. Let's say it that way."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3472.9,"end":3517.84,"speaker":"Dr. Timothy Patitsas","text":"You were saying something I'd never. I'd never heard before, which. Which is the best thing ever. You said that the word for the devil. Right. Is the. The avalo to separate is the exact opposite of simvalo symbol to symbol. And that's the. That's the best thing ever. That really just puts it all right there, doesn't it? But. But this war between nominalists and realists, and of course, the Anglo American response is to sit on the sidelines and, and through this faint, faint memory of their Byzantine, you know, inheritance and the Celts to. To be skeptics of both, you know, but. But that Anglo American skepticism is kind of wearing out. People want the thing itself."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3518.24,"end":3626.17,"speaker":"Jonathan Pageau","text":"No, I think, I think so. But, you know, the thing is that nominalism is. Is going to. Is going to end with a lot of. It's ending with blood. Like it's the Enlightenment thinking and that all of this is crashing. It's all. It's all falling apart. It's happening rather fast. Covid was. Was like an accelerant of all of the. The aspects of, you know, let's say, religious impulse and, and all. And, you know, all of that kind of crashing back in. So, you know, I think that we. It's time to deal with this. You know, it really is time to be able to formulate and to participate in meaning in ways that are fractal instead of, you know, swaying crazily between, you know, chaos and tyranny, which is the tendency that we. That we've embarked on, you know, I think since the beginning of the Enlightenment. And so I think that being. Helping people to formulate, but not just formulate theoretically, but also engage in practice this fractal relationship between unity and multiplicity at all the different levels. The music, right, the music of the spheres, really, that, that's, that's. And, and the thing. The great thing about it is that when people understand it and when people kind of see rings so true that once you. Once you've seen down that once you've seen down that door, there's no turning back. It might be difficult to do it and integrate it. It's difficult to live it completely. But once you've seen this hierarchy of fractal relationships, you can't go back to the, to the. To the old way. I don't think so. And so, so at least I think we have reality on our side, is what I mean. You know, like liturgy. The."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3626.17,"end":3626.45,"speaker":"Dr. Timothy Patitsas","text":"The."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3626.45,"end":3642.6,"speaker":"Jonathan Pageau","text":"The idea that the reality is liturgy is just true. And so, you know, as the more people can perceive it and engage with will win in the end, no matter how crazy it becomes, you know, truth will."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3642.68,"end":3643.08,"speaker":"Dr. Timothy Patitsas","text":"Will."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3643.08,"end":3646.04,"speaker":"Jonathan Pageau","text":"Will rise. There's no, there's no other way."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3647.8,"end":3648.04,"speaker":"Dr. Timothy Patitsas","text":"You."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3648.04,"end":3675.36,"speaker":"Jonathan Pageau","text":"Know, because if you. It's like if things decompose and then the seed, the fractal seed that came from the tree that's planted in that decompose, that's the one that's going to grow. So I know it from. Because that's how it works. And that's actually how it works in the world, and that's how it works at all the scales, you know, and the stories tell us about the remnants that are taken out and that are planted and grow again. And so I don't see. I don't see another. Another way."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3675.6,"end":3761.55,"speaker":"Dr. Timothy Patitsas","text":"You know, in his letter to the Soviet leaders, Solzhenitsyn is calling for a societal, social repentance for the. For Russia, because, you know, he says it's time to let the republics go and find their own way. One of his regrets is that all the best minds were studying military electronics. You know, all the young people were drawn to that, and they were neglecting the humanities. I mean, it's such a sacred thing if a person can give themselves to the study of literature and the classics, or literature and theology, literature and art. You know, there's so much the. The great, you know, when we talk about education, as, you know, the great conversation, right? This, this beauty, goodness, truth or grammar, logic, rhetoric, the rhetoric stage. It's blood work, but it's. It's sin. It's. There's a c. You've got to enter the communion of saints. You've got to engage with the other great writers and the great. You know, everything or whatever you're doing, you've. You've. It's, It's. They are summoning you. And to their company, they. I no longer call you disciples. I call you friends. They are summoning you to that friendship. And it's just that life is so busy and people don't have time to read if they don't feel, at least with film, they're getting something."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3762.03,"end":3765.95,"speaker":"Jonathan Pageau","text":"Yeah, but, you know, audiobooks, they're the solution."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3766.11,"end":3769.07,"speaker":"Dr. Timothy Patitsas","text":"Everyone likes the audiobooks. Yeah, that's the way to go."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3769.15,"end":3820.03,"speaker":"Jonathan Pageau","text":"There's something that are hard to read with audiobooks, but for sure, audiobooks have been a lifesaver for me, especially as a. As a dad with three kids working full time. You know, it's like. And then doing all this other stuff. The audiobook is wonderful. You know, then you want to drive. Like, you actually want to drive your kids places because you get to listen to the audiobook. So, so that's been. That's been wonderful. And it's weird. It's a, it's weird technological version of the, you know, the monks reading in the. During dinner at the, in the monastery. It's. Yeah, it's not completely the same. It lack. I mean, obviously it's a. It's a superficial version of that, but I think that we're Attuned to listening to things, being told, told to us since we're children, you know, being read to. And so I think there's something intuitively right. About the audiobook that you can easily, you know, kind of pay attention while you're doing other things and let it seep into you."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3820.03,"end":3869.35,"speaker":"Dr. Timothy Patitsas","text":"So, so, so more people need to. More young men in the Orthodox tradition need to come to the priesthood because if the, if, if that's their symbolic act is, you know, the defeat of the disintegrative act, then that's, That's a different way to present this, calling, this ministry, because someone has to stand like Moses, you know, with their arms up. So maybe that is part of the answer, just that increasing. But all of us participate in that priesthood of the church. And that's, I mean, the problem is us, right? Like, and, and that's, that's the great thing, you know, about, I think, all Christian faith, but Orthodoxy in particular, I mean, the one I know well, like, you know, you are encouraged to realize that, you know, you're the issue, you're the problem."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3870.07,"end":3897.7,"speaker":"Jonathan Pageau","text":"The problem is you. I think this is a, that's a great way to, to, to, to end our conversation. The problem is you. But the communion of the saints are calling you. And not just the saints, but the communion of all those that came before us, the great thinkers, the great writers, those that have, you know, showed us what is, what is beautiful, good and true. They are calling us in to participate."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3897.7,"end":3930.92,"speaker":"Dr. Timothy Patitsas","text":"So can I. Can I mention a dream I had recently? Because it's so fun. I, I was meeting LeBron James for the first time, and it was such a spiritual dream. I was in tears. It was like. It was like this. And I was, I, I just said you've, you've given so much effort to excellence. You've worked so hard to be excellent at what you do. And it just brought me. I don't even. I'm not really even a basketball fan, but I just. There's so many people out there giving their all for, for beauty in different ways."}
{"episode_id":"SW - #336 - 2024-04-19 - Timothy Patitsas - The Vital Sign of Beauty","start":3931.08,"end":3971.89,"speaker":"Jonathan Pageau","text":"Yeah. So, you know, come in. Come into the dance, everybody. So, Timothy, thank you for everything. Can't wait to see you again at Holy Cross and, and at Hellenic Helena College in a few weeks. And I wish you all the best luck. Also with, with the, the. The. The movie and the upcoming movie on, On Holy Week. You know, I can't wait to see that as well. So thanks, Timothy. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
