{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":0.4,"end":6.32,"speaker":"Jonathan Pageau","text":"Does Zen, let's say, formulate the infinite as relational to the finite?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":6.8,"end":7.28,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":8.16,"end":8.72,"speaker":"Jonathan Pageau","text":"And so."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":10.56,"end":13.92,"speaker":"John Vervaeke","text":"Emptiness is form, form is emptiness. Exactly. Explicitly."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":14.8,"end":20.8,"speaker":"Jonathan Pageau","text":"So, I mean, I know this is going to sound weird, but then why isn't. Why don't people pray in Zen?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":22.24,"end":30.51,"speaker":"John Vervaeke","text":"They do. So I happen to know a Zen Roshi, and he prays and he chants and so forth."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":31.63,"end":36.59,"speaker":"Jordan Hall","text":"What's the infinite like? Does it have a sense of humor?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":38.51,"end":41.79,"speaker":"John Vervaeke","text":"I'm sorry, Jordan, you're going to have to be more precise in what you mean by that question."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":42.75,"end":50.91,"speaker":"Jordan Hall","text":"Well, you know, one of the things of something that has a character relationship is that it has a character relationship. And so the question is something like."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":53.38,"end":93.83,"speaker":"John Vervaeke","text":"Well, okay, let me answer that. Let me answer that first. Okay, so, you know, this is Schellingberg, who's an atheist, but he says what we're talking about, we're talking about sacred, is, you know, it's ultimately real. And again, not in the neutral sense, in the ontanormative. I want to participate in it. So that's a relationship term. I want to participate in it. I want to conform to it. I want to reciprocally open. I want to be realized by it as I realize it, all of that. So secondly, it's ultimately orienting, like people reorient towards it. Right. And it's ultimately transformative. It causes, you know, this deep, deep, the deepest possible transformation from being egocentric to being profoundly reality centric."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":93.83,"end":96.67,"speaker":"Jordan Hall","text":"But does it care about you? That's the question. Does it care about you?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":97.63,"end":98.99,"speaker":"John Vervaeke","text":"Why does that matter to you?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":99.63,"end":100.51,"speaker":"Jordan Hall","text":"That's a question."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":114.01,"end":202.65,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everyone. I am here with Jordan hall and John Revaque. All of you know them very well. I am really excited and a little befuddled. And we're wondering what's going to happen because John Revecki wrote both of us. I watch your conversation together, and I really would like to have a discussion, the three of us. And so I'm definitely looking forward to seeing what it is that he's scheming and what's going on in his mind. But before we start, we're making an announcement today. In a few weeks, we'll put the links in the description that you can go see on our website. But in a few weeks, John will be teaching a class on cognitive science and ritual for the symbolic world. And so he's going to go into his own ideas and his own research and all the way that he connects his study in cognitive science with ritual. And then in the last episode, he's going to go through the theory, and then the last episode, we'll have a discussion together. And so that will be, of course, Live, like the other classes you can join live. You can also buy the class and watch it later if you don't have time to join Live. But we'll have Q&As and everything the same way we're doing our. Our other classes. So before we start, maybe, John, you can tell us, give us a little something about the KAG Psi class."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":203.13,"end":307.18,"speaker":"John Vervaeke","text":"Yeah. So, first of all, deeply appreciative of being here and also very appreciative of you inviting me to teach on the symbolic world. I'm very excited about this, especially the fact that it'll at least have a dialogical culmination. I think that's just wonderful. Goes with a lot of things that I believe in and stand for. So there's lots of theories of ritual out there, but there's very little theory of ritual that actually covers what you might call the cognitive dimension of ritual. So I'm not going to be offering. That would be pretentious and hubristic to say I'm going to give you a comprehensive account of ritual. I mean, there are socioeconomic, there are historical, there are cultural, there are philosophical, there are theological aspects of ritual. And I'm not here here to comment on them, and I'm not here to deny that they exist or that they're important. All I'm saying is there has been a missing dimension in a lot of the discussion of ritual, which is the cognition of ritual. Is ritual a way of knowing, for example? Is that a reasonable question to ask? And there's a lot of work on that. And I want to bring all the work I've done on the imaginal, the relationship between the imaginal and the rational and the reasonable and the relationship between, you know, what it is, what kind of knowing are we talking about? And is there a rationality to ritual? Those are all the things we're going to be talking about. The quick answer is yes, there is cognition in ritual, and it's a very powerful and important form of ritual. And it's bound up very deeply with, I think, a more proper understanding of what we mean by rational. If what we mean by rational isn't merely logical, but being reasonable in a much more comprehensive sense."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":307.82,"end":322.62,"speaker":"Jonathan Pageau","text":"All right. Well, we are definitely looking forward to that. So, Jordan, it's good to see you. And we want to know. I mean, I want to know what it is in our conversation, John, that that sparked this Discussion. So you have to start us off."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":322.94,"end":936.63,"speaker":"John Vervaeke","text":"Well, first of all, I'm going to do a few things that would be provocative, but, you know, as is my want. But obviously, I'm not doing anything ridiculous like attempting a refutation. I loved the conversation. I love both of you. I consider you friends that I respect and have a lot of affection for. And so it was like, yeah, but what about this. What about this kind of issue? It wasn't like, I think you're. It's not that. Okay, so. And I think it's fair to say there was a lot of John Vervaeke running through the conversation. So I don't want to be ungracious or anything like that. So I just want to frame very quickly where I'm coming from and what I'm trying to do here. I'm trying to be Socratic. I'm not trying to be a skeptart. Okay. So if I could, I'll lay out what I heard, what I. And of course, you'll be free to correct me when I'm done. What I thought I heard around a central thing I want to talk about. We don't have to stick on that topic. This is just. But this is what brought me into. I want to talk to you two about it. Right. So there was a discussion of Pistis as faith. And then there was. There was very much moves I agree with, like moving it off belief, at least in the sense of asserting propositions without evidence or argument. You both said something along those lines. And then there was. There was a movement of. And then I would want to. I would have wanted to slow down a little bit there, because the problem with the word trust is it's very equivocal. There's two different meanings of trust. There's one meaning of trust is based on empirical, like observation and inference. I come to a conclusion about the probability of somebody's competence. So I trust that if I give this to Peter, he'll do a good job. That's not particularly relevant to your conversation in any important fashion, because that's just how we sort of get about the world where we can't operate with certainty, which is like everywhere. Then you made a. So I just want to make clear that that's not what we're talking about to my mind. And then you move to something which was deeper. I'm going to use a little bit of my own language, and we can play with it if you don't like it. But it was something like. Because you were trying to draw to my mind you were trying to draw together notions of participatory knowing, because that was invoked a lot. And it's something like participation in sort of primordial presuppositions. These are presuppositions that you can't get outside of. They are presupposed in the very act of trying to make sense, make judgments about what's intelligible, et cetera. And so they're primordial in that sense. To doubt them would be to invoke them, to try and doubt them kind of thing. And so although you can't give an argument for them, there is no place you can stand to call them seriously into question. And this is. This is a good model, by the way. It's not unique to me or to both of you. Alvin Plantinga has, who's an important Christian philosopher, has a very similar kind of, you know, presupposition model of what's going on. And I'm a little bit different than him on this, but so that's cool. So far so good. I think everybody's nodding and smiling. But then. So a couple issues came up to me. Well, one is, okay, that's fair, but. And for me, that's great, because that sort of grounds the philosophical silk road really wonderfully, because it means that we're not all automatically. We can't dismiss faith. We're bound at this level. I think, Jordan, you even said even the atheist has to have this kind of faith in some sense. You said something to that degree, and that's a great strength. But it also opens up this question that means at that level of the argument that both the Buddhist and the Christian have equal faith, because if they equally have a set of primordial presuppositions, that makes the world fundamentally intelligible to them in a way in which they can profoundly participate. They both have faith. This is why I think it's a philosophical silk road move. Now, what I want to then wonder. So again, that's why I'm posing it to you. It seems to me you need an additional argument for talking about faith in the specific Christian content, because that faith doesn't follow from the argument you gave, because the argument you gave is a properly pluralistic argument. Okay, now there's potential moves available to you, and I'll lay them out, how I see them and what I find problematic about them, and then I'll stop talking. Okay? So one move you can make is to say something, well, like, I mean, you know, well, Christianity makes the most sense or something like that. That's problematic. I'm not going to repeat my thousand arguments and publications and videos about intelligibility grounds and relevance realization. And relevance realization is properly pluralistic, right? You can't, in an. We just published a paper on this. You can't give an. There's no way to give an formalization of relevance realization that allows you to say this is the optimal final version of relevance realization. Relevance realization is non computational, to put it in a phrase. And that's really important because that grounds meaning in life, that grounds a lot of the stuff we're talking about, but that also commits you to certain consequences of that. Now, what you could do, and you could make use of James Filler, I'm talking to him tomorrow, by the way, and he's got a second book outcoming where he's got the critique of substance ontology. So I'm looking forward to that. And then you could say, oh well, what we could do is we could make a move where say, you could say intelligibility or information are properly relational and therefore we should go to a worldview. I'm trying to use a neutral term here that gives the most proper place to relationality and doesn't commit to like a substance ontology or something like that. And then James, as you know, maps that into the Trinity. The Trinity is the most powerful symbol, according to James, of pure relationality. And therefore it's a great symbol for ultimate reality. And that's why it makes the most sense. And it seemed to me that arguments along those lines were being made and you know, push back when I'm done and we're here as friends. But then the concern that I had with that is, well, the problem with that is, and we'll see what James says about this, I have a critique of James, which is his main argument, to cut it short. And I won't make the argument, I'll just give you, the conclusion is you can't get relations out of ralada. You can't. There's nothing. If you start with things and substances in the real statelian terms, you can't get relations out of that. And if you can't get relations, you can't get intelligibility, et cetera, et cetera. That's the core argument that he makes. The problem is there's an exactly symmetrical argument. And Jonathan will probably recognize this. This is a Neoplatonic argument. You also can't get relata out of pure relations. You can't get. The arguments are exactly symmetrical. So pure relationality doesn't mean at the bottom there's relations. Pure relationality means at the bottom there is that that is below both relations and relata and makes them both possible. And of course, this is the Neoplatonic one, right. It's not a relation, it's not a relata. It's what makes relations and relata possible. Or something like Zenyatta, which is. Okay. Now what does that mean for the mapping onto the Trinity? Because I could say, well, Zen does a really good job because Zen prioritizes non duality. And that's the central message, not the trinitarian nature of relationality. And this goes into the deeper argument. This is a mapping function. And the problem with mapping functions is that reality is combinatorially explosive and there is no perfect map. What kind of map do you want? Do you want a contour map? Do you want a geographical map? Do you want a political map? Do you want a thermal map? It depends pragmatically on the goal you're trying to solve. So there is no way of saying that's the absolute best map of reality. It can't work. Now, you may think, and I'm going to use all these terms with deep respect, so I'm not being dismissive, okay? But you say, well, I can map Yahweh, the goal, God of Israel and Jesus of Nazareth and the Spirit of Pentecost, which I take to be at least one way of understanding the Trinity. There's a mapping going on there. And it's like, I think that's great. I think James is great. But the Neoplatonists have a way of mapping and there's other maps and there's nowhere to stand to say this is the absolute right map. And so we keep coming back to. We keep coming back to a proper pluralism for which I don't under. Like, I don't see why you come to a particular faith in. Right. As opposed to just having. And I. Sorry, this sounds silly, having faith in faith itself. And I don't believe that. You obviously know that. But do you understand what the gist of the argument is? Because there was the reason why this matters, because it has existential import. Because. And you know, and Jordan matters to me a lot. Right. Jordan was talking about what led him into Christianity, not what led him into faith. And that's what I was trying to understand. Right. So I think it's fair to me to bring up this set of problems. Okay, how is that? Was that okay?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":939.19,"end":945.77,"speaker":"Jonathan Pageau","text":"I think, I mean, I think I definitely Understand the different arguments. I know. I think, Jordan, you. You should have the. You should start."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":946.17,"end":995.41,"speaker":"Jordan Hall","text":"Okay. I'm mindful of the concern. Jonathan, you mentioned earlier. Jonathan mentioned that he's concerned that when he and I talk, it may be maybe too abstract or too high level. And I think it's fair to say that we added Revaeki into the conversation and where he's actually bringing a point that is very, very precise. So I think maybe the think doers say, forgive me, there's nothing I can do about the fact that this may be at the borders of intelligibility. So let's see. Yes. This notion that there can be no map, that is the funny. That is the ultimate map, is actually the same as the critique I have of metamodernism."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":995.81,"end":996.29,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":997.42,"end":1082.58,"speaker":"Jordan Hall","text":"And so the answer is something like, is there something that is more fundamental than mapping, that is primordial in the sense that it is prior to all possible maps, which is not itself defined as a map, but is a proto map? It's the process whereby maps are formed at all and constrains and defines all possible maps. If such a thing we're able to enter into relationship with it, by the way, and also point number two, then that's the thing. That's the thing that we would ultimately have to be looking at. Okay. Roman numeral number two. In this kind of a conversation. It's beautiful that all three of us are. This won't be controversial, but in this kind of a conversation you have to be very particular about the fact that we cannot bias any particular quality of relationship meaning in this specifically intelligence or semantics or cognition. Narrowly understood. But actually be saying what we're seeking to do is to enter into relationship with that thing which is primordial, or prior to all possible maps, with the wholeness of our capacity to enter into relationship at all. And maybe then just to add the third piece, and I really do think it was you who added this piece to a conversation we had years ago. Oh, yes. I can say it in a way that's definitely yours, which is reciprocal opening."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1082.82,"end":1083.3,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1083.38,"end":1109.2,"speaker":"Jordan Hall","text":"Meaning that this is also an alive relationship, that in entering into this quality of holistic relationship with this primordial, both we and our capacity to are in a continuous reciprocal opening. So notice what's happening in all this. Right. So that is what I think Christianity is."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1110.88,"end":1165.96,"speaker":"John Vervaeke","text":"Okay. Yeah. So I mean, there's two ways in which you could be meaning that one is Christianity is that. And so is, you know, fair. We're not going to compare good Christians to bad Buddhists or some silly. We're going to say the best of a Christian, the best of a Buddhist, we'll play fair. It seems to me that I can say everything you just said, the reciprocal opening, a transformative relationship to ultimate relationality, the one in Neoplatonism, or that makes all relationality possible. That is also available to the. The good faith Buddhist, the good faith Taoist, the good faith Neoplatonist. And of course, the trick here, of course, is Filler relies on Neoplatonism even to make his argument. Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1167.4,"end":1172.84,"speaker":"Jordan Hall","text":"I'm going to pause for a moment because I feel like something has to happen at the level of dia logos for this to work properly."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1174.68,"end":1177.48,"speaker":"John Vervaeke","text":"Oh, I hope I'm not being stultifying. I'm not trying to be."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1177.72,"end":1194.71,"speaker":"Jordan Hall","text":"No, no, the opposite. I think that there's something like. To be able to respond to this properly, we have to come into a quality of communion that affords a vastly greater capacity than we have as individuals and have yet cultivated."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1195.83,"end":1255.05,"speaker":"John Vervaeke","text":"Good. I'm open to that. Like I said, I'm not here to refute things. That's not what I want. I want to get this because I want to look what I don't, what I don't see in the two of you. Let me. Maybe saying this will help to do what you're talking about, Jordan. I don't see a simplistic sort of liberal tolerance, and I mean that in a pejorative sense. Well, you have your Christianity and I have my Buddhism or what, and we all just live together and that's all wonderful and a sort of relativism. And you know, I don't. I take it that's not what you're saying. You write good. So we're in agreement. And I want. Right. And I. So I'm trying to say, tell me how you address these issues and yet keep the depth from just, just degenerating into, well, I like you and you like me and we like that, we like each other and all that sort of stuff that really doesn't help with what's going on in the world right now."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1260.83,"end":1284.11,"speaker":"Jonathan Pageau","text":"So maybe while you're. Jordan, while you're meditating, maybe I'll throw out the things that came to my mind when you were talking, John. So a few things came to. To, to my mind. One is, we've talked about this before. One is that the, the map that Christianity proposes is, is eschatological."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1284.5,"end":1284.82,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1285.38,"end":1482.42,"speaker":"Jonathan Pageau","text":"And it's presented in a manner that is actually not a specific map. Right. It's presented with language that is Mythological, that is structural, you know, like a city with something which represents the top of the hierarchy, son of man, a king figure, something which represents the bottom of my hierarchy, the sacrificed lamb, which are joined together as the light of the city. And then that gives way to a world where there's balance between the natural world and the human world and the artificial world and the human world, and that all multiplicity can bring its quality into that participation. So all the kings bring their crown into the city. And so I think that that is one way of answering the question of the absolute map, or like the perfect map is that the perfect map is given as something which is coming but never comes, or at least doesn't come in the way that we think. I mean, I'm not saying there isn't an eschatological moment, but that eschatological moment cannot be measured by the measurements of time that we give to time now. Like, it's the end of time in the sense it's the purpose of time. It's the end of history in the sense that it's the thing toward which all things are moving. And I. And I think that in terms of, let's say, a map, like, if we talk about the idea of mapping reality, I think that that's important to always remember, is that Christ is the one who came and the one who's coming. And when he's coming, in the end, that which he will offer is a new heaven and a new earth. That is not the one that we have now. Everything that we have now is. Although we don't want to say that it's arbitrary, it's not arbitrary at all, but it's a glimmer. It's always a glimmer and a kind of small participation in something which is coming. And there are sometimes, you can read. There are mysterious ways in which, you know, for example, like the saints will talk about when you take communion, you are already in the eschaton, you're right. You know, but it's something which, when you're in the eschaton, you're also not in regular time. You're not in the normal time. You're not in the way that the world is laid out. And coming back from that in some ways will always relativize and make things imperfect and, you know, and somewhat. Somewhat off from the. And so I think that. That in terms of the idea of the idea that Christianity offers a map for reality, I think we always have to remember that. That. That eschatology is a central part of how we understand that how the Logos manifest themselves in the world, because the Logos, the fullness of the Logos has not yet been seen. The fullness of the yogos is coming. It's over the hill. It's come. Lord Jesus. Right. This sense that we're calling it into being, but it never. It doesn't arrive in the way that we expect it."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1482.42,"end":1482.62,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1482.62,"end":1507.29,"speaker":"Jonathan Pageau","text":"Even in the book of. Even Christ says, if you say, here he is, here he is, don't listen to those who say, there he is. That's not how it's going to happen. So in terms of mapping, that's one of the things I want to offer. And the other part though, I want to offer in terms of relationality, terms of the Trinity is we always have to remember that the Trinity is not just relationality, it is one."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1507.85,"end":1508.65,"speaker":"John Vervaeke","text":"Yes, of course."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1508.65,"end":1555.18,"speaker":"Jonathan Pageau","text":"Right. You always have to keep that aporia present for it to be the. So it's both the one in some ways of the Neoplatonist, but it also is the fullness of relationality in the multiple. Right. So it's those two things at the same time. It avoids, it avoids the problem of Gnosticism and. Right. The problem of the degenerate. Of the degenerate. Manifestations, you could say, Right. That manifestations or, or, or. Or things that proceed from the one are immediately, you know, degenerate for that, for that. For that reason. Anyway, so those are a few things I wanted to offer, but it's mostly. Jordan, you have to. I think you're the, you're the. A lot of it was. Was about the things that you said. So go ahead."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1555.18,"end":1567.2,"speaker":"Jordan Hall","text":"Yeah, well, when you said about the Logos, so what I was noticing was perhaps the crux. Precisely."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1567.76,"end":1569.12,"speaker":"John Vervaeke","text":"Ah, nice pun. Yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1570.96,"end":1722.82,"speaker":"Jordan Hall","text":"Is known as the hypostatic union. Because the Logos incarnate affords a different quality of relationality than the Logos in general. So if I'm Lao Tzu, endeavoring deeply to come into relationship with the way, there's so far I can go. If I'm a NeoPlatonist contemplating the one, there's so far I can go. But John, not you. The apostle John actually meets Jesus. And that's a completely different kind of thing. It's very different. It's as similar as saying my ability to know my wife by virtue of reading her biography and by virtue of actually loving her directly, and so the ability to actually enter into a human scale relationship with the Logos incarnate is a qualitatively different kind of thing. And I think there's a lot going on there, it's the inverse and a very powerfully bound inverse of then the crucifixion. These things are yoked together powerfully. I was also, Jonathan, mindful of the talk you gave at the Symbolic World Conference on the Son of Man, seeing whatever images were coming to me when you were talking then I was seeing those images coming up when John was speaking earlier. So, I mean, ultimately what we're really talking about is Christ. We're really talking about, obviously, in some sense the thing that differentiates Christianity as a way of doing this sort of thing is Christ. And Christ is the Incarnation, the actual, not just the Logos as an abstraction that we can contemplate, which the Greeks do at the highest level and Lao Tzu does at the highest level the way the Logos, but the fact that there's something about the particularity of the eruption of the eternal into the chronological in a particular moment in space and time. And what that does in terms of affording our ability, as in fact quite distinctly finite beings with very limited capacity to enter into relationship with the ultimate in terms of affording that what would be called the hypostenic union, right, this paradoxical aporia that happens at that level of how the finite and the infinite can actually grow in that relationality."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1726.58,"end":1733.86,"speaker":"John Vervaeke","text":"I want to properly pause here in case either one of you want to say some more, because that was a lot and it was good and it was rich."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1739.79,"end":1740.03,"speaker":"Jordan Hall","text":"So."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1742.35,"end":1895.99,"speaker":"John Vervaeke","text":"The eschatological, that the map is incomplete, that is of course also not unique to Christianity. Buddhism has Maitreya, the coming Buddha, and there is no map. So the eschatological sense is again found elsewhere. That's just one example I can give others. And so although I think I hear an argument building, yeah, all these things are found elsewhere, but you can only find all of them in sort of your one stop enlightenment shop or something. That's Christianity. But maybe that's the argument that's building here. We'll see if that's what we're working towards. Now, the idea that the Logos is incarnate in a specific historical person. Well, Buddha nature was present in Siddhartha Gautama, and people met him historically, and that's how Buddhism was founded. And so that's not the Christian doctrine of incarnation. But that's not playing fair. You can't say the Buddhists don't have the. They have that the Dharma was embodied in a way. Right. That ignited a religion. Right. And so again, that would be the case. Jonathan, I agree with you about the rejection of Gnosticism and many versions of Neoplatonism. But as Filler himself argues, if you properly understand Neoplatonism, it doesn't have the One. And the relationality are always held together in the notion of ultimate reality. It's not the one. And relationality, because it's not a numerical one and it's not a substantial one, it's the oneness of intelligibility in that sense. So now you may say, but what I have, I want to do this very carefully. You might be saying that, but in some sense you both feel. That's the wrong word, sorry. You both sense that you have had this personal relationship with Jesus. And I'm not saying that in a dismissive fashion. You understand that, Please. Okay. Is that what this is coming down to ultimately? Because."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1898.43,"end":1900.91,"speaker":"Jonathan Pageau","text":"It really depends what you, what you mean by that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1900.99,"end":1902.79,"speaker":"John Vervaeke","text":"Yeah, yeah, fair enough, fair enough, fair enough."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1902.79,"end":1907.87,"speaker":"Jonathan Pageau","text":"Because I, I've heard versions of that that are. That I wouldn't identify with. Let's just say."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1910.43,"end":1939.22,"speaker":"John Vervaeke","text":"Well, let me say, Let me, let me help you there. Because, you know, here's. Here's where. Here's ways in which it doesn't work for me because people will say, I feel the presence of Jesus and he's telling me to do X. And then this person over here says, I feel the presence of, of Jesus and he's telling me to do not X. And it's like, oh, really? Oh, this makes no sense to me whatsoever. Like, that kind of stuff isn't going to track as an argument because it just doesn't line up with the facts. Okay, so go ahead."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":1940.1,"end":2032.17,"speaker":"Jordan Hall","text":"Yeah, so I don't know this about you, Jonathan, but I imagine, for example, when you have an actual experience of, of profound grief, utterly shattering again, well beyond maps, well beyond any notion deeper than your faith and a grief deeper than your faith, and you notice that there's something there. You're not alone in that grief. There's nothing else that you can imagine. You're beyond mind. You're definitely beyond meditation. And as you enter into that, you notice that that something has qualities. And a way of naming those qualities is love. So that would be an example of what that means when you really, really, really go to the experience of a profound relationship with how loss works and the shattering of your ability to enter into identity at all, you notice that non duality is not the actual thing that's at the bottom, that there's something more fundamental than that. And the only way we can talk about it would be the thing that is called love. The same Thing happens, by the way, from my point of view, if you go all the way to the highest level. But that's a little bit trickier in my experience."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2032.89,"end":2090.87,"speaker":"John Vervaeke","text":"So can you say that last thing? Because I. So, first of all, thank you for that. That's a powerful and rich thing to say. So I'm not. You're aware that it's deeper than non duality. You're invoking. You're invoking spatial metaphors, which of course are transcended by non duality. So I'm trying to get out what that. So I might have a sense of what you're talking about. People talk about a sensed presence which is neither objective nor subjective, neither emanating nor emergent, but deeper. And that you don't know it by. You don't know it by other than participating it and being it. But I don't mean in a logical identity sense, like when you're very. When you're deeply in love with somebody in an agapic way way. Is that what you mean? And again, I'm not trying to do a judo move on you. I'm trying to understand."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2091.03,"end":2135.76,"speaker":"Jordan Hall","text":"No, I get it. I mean, think about what we're talking about here. Talking about doing neurosurgery, which is perfect. This is where we are, by the way. I mean, we, meaning the species. The species is actually here. We got to get this shit figured out. There's no more and knocking around, beating around the bush. We have to take the level of care and precision and actual embodied love and clarity that's necessary. So let's see. Oh, man. Yeah. What I notice is that. Oh, okay, nice. So what I'm going to do is I'm going to say something and it's actually going to be trike."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2137.03,"end":2137.39,"speaker":"John Vervaeke","text":"Okay?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2137.39,"end":2143.83,"speaker":"Jordan Hall","text":"But it's the best thing I can get out of my mouth right now in an endeavor to collaboratively get there."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2143.99,"end":2146.79,"speaker":"John Vervaeke","text":"I'll take it charitably, Jordan. I promise I'll take it charitably."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2147.27,"end":2256.44,"speaker":"Jordan Hall","text":"And by the way, I'm going to reinforce. This has to be three. Don, you're participating. So if we go towards the direction of joy. So joy and grief being gates to this relationship, what we notice when we get to profound levels of joy is a feeling of the presence of the infinite, like a proximity towards something which is of the nature of the transcendent, yet in the realm of the imminent. Something that is something that we are able to experience, but is increasingly accelerating beyond planet, anything that could actually be present or contained within experience, within the finite. So we accelerate in that direction. And as we move in that direction, what we begin to notice is that we do not actually dissolve into that, but rather are embraced by it. That's the, the key or the key difference is that the relationship between the infinite and the finite is not a mistake. There's nothing about the way that creation is that is not good and that the ability for us to be in a relationship that is governed by that as a fundamental is. How do I say? Heli. I can't. It's not my words. Somebody else has to say it."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2259.08,"end":2293.66,"speaker":"Jonathan Pageau","text":"Well, I think that the thing that comes to me when you're saying what you're saying is that the. I believe Christianity really does, in its highest instantiations really does have a sense that the source of reality is, is non dual. Right. That the way that we describe God as a trinity is a way, is a way to describe the infinite. Right? Not a way, but it's a manifestation of the infinite in a, in a type of aporia that joins unity and multiplicity together. You know, Saint Maximus says things like God is being and non being, you know."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2293.66,"end":2294.54,"speaker":"John Vervaeke","text":"Yeah, exactly."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2295.66,"end":2469.1,"speaker":"Jonathan Pageau","text":"Now I think what Jordan is bringing up, which I, which I think is really important in the vision of Christianity is that Christianity deeply understands that non dual is not, is not in other. It's not a vortex that swallows the world in Twitter. It. Right. That's not something that out of. That wants to call you out of being, that wants to call you out of reality into, into, into some like infinite bliss or whatever. That in that, in fact what it does is that it affords all of reality in it, but in a specific way. Right? There's a specific manner in which it, it makes the world exist, you know, and, and that way it is surprising at the outset because in that way is something like self sacrificial love. And that self sacrificial love is the mode of existence. And so Christ manifests that in the extreme. He manifests that in the, you know, in a way that is kind of almost unbearable to watch. But it becomes an image of how it is that we can participate in non duality without escaping the world. We're not escaping our desires, we're not escaping our bodies, we're not doing any of that stuff. We're not denying any of the goodness of the world. And what that looks like is that image. I think it's that image that I mentioned in Revelation, which is the king and the sacrifice together, the highest and the lowest joined together and one of them affording the other the reason why Christ is king is because he was on the cross and vice versa. That image of Jesus on the cross with the sign above that says the King. This is the king, folks. And I think that all of Christianity is about that. And that's why everything that Christians argue in the first centuries about the nature of Christ, about preserving his divinity, preserving his humanity, you know, all of these questions are about the way in which non. The transcendent is actually the that which makes the imminent exist. And that's the balance that Christianity brings about. Now I don't know if there are other, you know, I'm not an expert on all world religions. I don't know if there are other forms that have that, you know, that, that anchor, right, that, that hold. What I see in many other religions is, is a tendency to emphasize the escape."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2469.34,"end":2469.74,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2470.06,"end":2502.35,"speaker":"Jonathan Pageau","text":"Like we have to. And Christians, I by the way, fall in that all the time. Christians actually will tend to say things, die and go to heaven, like that kind of language. It's, it's actually profoundly not Christian. It's such a profound, it's such a habit that humans have to want to want that. But when you look at even the Bible or if you look at the way that the fathers talk about Christianity, it's not, it's not at all that type of. It isn't that escape. Right. It's like the kingdom of heaven is not the same as heaven. It's the, it's that joining together. Right?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2503.63,"end":2548.85,"speaker":"Jordan Hall","text":"Yeah. So again, I'm actually going to be playing with like wooden knives right now. But you're going to get there. I think this might get there. So an invitation to break the wheel of karma. A vow not to leave the wheel of karma until every other conscious being, sentient being, has done so. Sentient, Sentient being compared to an invitation to get on your cross the throne? The proper orientation of the transcendent with the immanent is to pour itself into it, to actually so utterly love creation. Yeah, this is it. So the key is like man, Christians get this wrong all the time."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2549.97,"end":2563.21,"speaker":"John Vervaeke","text":"By the way, can I just interject one phrase? I respect the fact that you are demonstrating genuine reasonableness of entering into self criticism. So I just wanted to appreciate that. So please go ahead."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2564.97,"end":2677.82,"speaker":"Jordan Hall","text":"Yes, I think actually in some sense you may be speaking for the comments as well everybody. John just said this is genuine reasonableness, not just incompetent. Okay, let's see. So it's almost like the reverse direction, this notion of escape versus immerse. The call is not to alleviate suffering. The Call is actually to recognize that the world is so rich, that suffering is intrinsic and meaningful. Something like that. God, the actual transcendent Buddha nature, but in this case comes into reality and lives directly with other people and suffers, in fact, not just suffers, but allows himself to take on the fullness of suffering. Not to have us escape it, but to remind us that that's actually the thing we are not. It's not like, oh man, suffering was an error. Tell you what, guys, I'll give you a suffering band aid so nobody ever suffers anymore. That's not the thing. It's rather. No, the way this thing is supposed to work is you're descending into a deeper and deeper capacity to suffer. Because that's what engagement with reality actually is, is to undergo, to undergo reality experience and to grow and to mature. And so instead of dying and escaping what happens is you die and you enter into even deeper capacity to enter into relationships with a large and ever expanding reality. And this, again, this is the opposite of a naive notion of non duality, which is an elimination of difference."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2677.98,"end":2678.38,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2678.62,"end":2688.78,"speaker":"Jordan Hall","text":"It's actually. No, no, it's an embracing of difference and a deeper wholeness that produces a deeper capacity for differentiation in an ongoing unfolding."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2690.94,"end":2813,"speaker":"John Vervaeke","text":"Okay, this was really good. None of these compliments I'm giving you are facetious. So I'm trying to put a couple things together. You got that this is like an extended version of the reciprocal opening that what you just did. So you're acknowledging that that's good. And I take it that that's what you mean by joy. The problem with when people hear joy is they just mean, they think intense pleasure. And that's not what we're talking about here. And of course you can forgive them for that because we have this stupid word enjoyment, which just means enjoy intense pleasure, which really messes people up. Okay? So we've got that and we've got the idea that this reciprocal opening can be very. Jonathan was pointing to, like there's a universal temptation to misunderstand, misconstrue, the reciprocal opening as escape. Rather, it's an entering into deeper and deeper relation. Right? And that's properly agapic. Right? Because it's agapic. Together is that landing fairly. Okay, and then the idea here is that what Christianity offers is an alternative in which onto normativity being as fundamentally good, not ethically good or aesthetically good, or even epistemically good. Right? Beyond the true and the good and the beautiful, it's just being is good in this ontological sense. That's what I heard you saying, in some sense. Is that fair? Like you're getting a sort of a reading of Genesis. God looks at the world is good. He's not making a moral judgment, he's not making an aesthetic judgment, he's not making an epistemic judgment because he's God, right? So he's saying something else. He's saying that being is intrinsically good. Qua being just by being, it is good. So that's why escape is fundamentally wrong. Because if being is intrinsically good, seeking to escape from it is intrinsically wrong. Am I getting your argument correctly?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2813.16,"end":2815.12,"speaker":"Jordan Hall","text":"Yeah, yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2815.12,"end":2932.53,"speaker":"Jonathan Pageau","text":"And that's interesting too about for example, Christian theosis. Like the notion of Christian theosis is. You know, I remember when I was first interested in orthodox theology and I had read a lot of esoteric, esoteric texts from other traditions. There was something about Christian theosis which annoyed me because it was like it wasn't the real, it wasn't the full thing. It wasn't like the complete, absolute, ecstatic, you know, elimination of me. And then after that I thought, I realized, well, actually no, wait a minute. Like I think that all things are good. And so, right. St. Maximus says that we participate, that we become God. To the extent that that's possible. That's, that's just the, that's the phrases he uses is what he means is in something like we become God to the extent that the world can. That you continue to exist, that you continue because your being is good, as is good, it has a goodness. You don't want to completely snuff out the particularity that God has put in the world. And so, and it's when I kind of understood that that I realized that the image of theosis that Christianity presents is something like the fullness of all things, right? So all things are mirrored, are these reflections of God. And that, that is the fullness, that is the fullness like that, that is more full in a very mysterious way. I don't know how to say it metaphysically, but that is more full than just the non dual God, right? Just the complete. The God that transcends all things, that God that transcends all things, creating the world in love so that it becomes a transparent reflection of himself in a way that doesn't destroy any of that particular, but rather gathers it in love, in multiplicity and unity. That, that's a bigger vision actually than being a drop that goes back to Brahma."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2934.29,"end":2937.21,"speaker":"John Vervaeke","text":"Yeah, I'm not here, I'm not going to. I'm not Trying to defend Vedanta."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2937.21,"end":2946.43,"speaker":"Jonathan Pageau","text":"No, no, no, I don't want you to defend Vedanta. I'm just using examples to say why. I think, you know, even my own process of kind of seeing what was precious about."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":2947.07,"end":3039.14,"speaker":"John Vervaeke","text":"I think this is good, by the way. I think you're making. So, like, I mean it again, I think this is. I think we're getting into Dialogos. I feel like these are good answers that are, like, are provoking me in a Socratic way. I feel that. And I just want to share that it's happening for me. Okay, so that's good. So now can I. In that spirit, there's two things here. So, I mean, this issue has been broached in some very deep interpersonal, inter. Religious, I should say, but also interpersonal dialogue, which goes on to Dialogos. There's Cobb's book, you know, a Buddhist and Christian dialogue that is mutually transformative. And then even more importantly, the anthology around the work of Maso Abe, which Christians and Jews and others replied to, in which he said, it's called emptying God. In which he said, well, what we're ultimately talking about here is kenosis, right? And he, he basically says, well, doesn't kenosis ultimately require. Right. The emptying of emptiness itself, this Zen notion. And he says, I don't see Christianity getting to that in some way. And a way of making this perhaps a little bit more concrete, as Jonathan sort of Jordan keeps calling us back to is. I get what you're saying. How. How do you make sure this isn't just a crypto egoism, which is, I don't want to. I don't want to cease to exist. And that's why this is so good."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3039.46,"end":3052.39,"speaker":"Jonathan Pageau","text":"But think about how. What it looks like in practice, but it looks like in practice is I am constantly trying to cease to exist. That's in the sense that, that Christianity, the idea of kenosis and of self emptying."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3052.39,"end":3053.59,"speaker":"John Vervaeke","text":"Yeah, yeah, yeah, keep going."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3053.99,"end":3103.23,"speaker":"Jonathan Pageau","text":"Christianity functions. It's like humility, self sacrifice, you know, of giving yourself, giving yourself in love. And the surprise, or the surprise to relay that that's the actual anchor of being, that that's the actual anchor of how you. How you exist, you know, and, and. And the resurrection. In the end, you know, what is resurrected is all my gestures of self sacrifice are resurrected into me. But me in. I mean, obviously, in a mysterious way, in a mysterious. So there is something. Everything about Christianity is this kenosis without understanding that you can understand any of it. Like, why is, why do we. Okay, martyrs why do we have all these things? Like, you know, it's like everything about it is this emptying that brings fullness."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3103.63,"end":3180.24,"speaker":"John Vervaeke","text":"Okay, so you're saying something really good, and I want to push on it because I believe you're not making a performative contradiction. A performative contradiction is when you're making a claim that undermines your ability to make the claim. Right. Like as if I was to say right now I am completely unconscious. No, no, I have to be right. A performative. And I agree with Whitehead that performative contradictions are much more important than. Right. Propositional contradictions. Okay. Okay. So good. So one way it sounds like you're doing is you sound like saying, well, I'm pursuing this because. Right. I think dissolving or disappearing is really good. And then what I'm trying to do is, I follow this is to try to dissolve and disappear. And that sounds like. Well, no, like, who are you to make that? Like, do you see why there's a bind there? Right. And. And you are pushing up against that. I want to give you space because I agree with what you just said. I think we're really, again, good dealogos. We're really moving into the heart of this. This really hangs on kenosis, obviously agape, but. Right. It hangs on it in a really, really crucial manner. Okay, so I'm presenting this as a bit of a paper tiger. I hope for you it's like, oh, you're not saying that. But say why you're not saying that more."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3180.4,"end":3288.26,"speaker":"Jonathan Pageau","text":"Okay, well, so St. Paul, you know, St. Paul has this image where he says, it's not I that live a Christ that lives in me. And you know, it's a beautiful sentence because it captures the paradox which he's not actually saying, I don't exist anymore. No, saying it's Christ that lives in me. And so he's affirming himself, Himself to the extent that he is a manifestation of the, of the Logos. And that is what is left. Now. The, the. The. The way to go to get there is to, you know, is to shed. Right. To shed a lot of the things that I, my passions, the things that I care about, but that ultimately once I do that, once you do that and you, you can experience it fractally, it's not like I'm going to get to the end of it. And all of a sudden I'm going to realize, oh, I've been, I've been self sacrificing this whole time. And so now finally, it's like you see it happening non Stop. Which is that when you, when you enter into a loving relationship with someone and you let go of your just proper desires and all the things that you want and you kind of seed way to that, then you realize that it brings the person, you and them together, and what, what comes out of it is more than what was there before. And so you're like, oh, wait a minute, it's not, it's not like this one thing that I'm doing, like, you know, I'm stacking all my good work so that when I die, then. You know what I mean? It's like, no, I'm noticing it happen every day, every time that I, that I enter into that mode of being where I'm. Where I'm. Where I'm not holding on and I'm not grasping, then what happens is I see more come out of it and I see more of myself. Like I see more of who I truly am. Right. Did they?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3288.34,"end":3318.07,"speaker":"John Vervaeke","text":"Yeah. So you're saying, first of all, I hear a couple things here. There's the realization that the self is inherently dialogical. Not a monad, a self isolated thing, but it exists dialogically because that's that. Your argument, I think, depends on that. Secondly, you're invoking reciprocal opening again. And you're saying if you put those two together, the self is dialogical and reciprocal opening, you can move from being egocentric to reality centric, but that doesn't feel like a loss, that feels like a gain. Is that okay so far?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3318.39,"end":3320.07,"speaker":"Jonathan Pageau","text":"Yeah. Yeah, I'd say that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3320.39,"end":3359.94,"speaker":"John Vervaeke","text":"Okay. Really good. This is very good. So is it fair to say I'm not trying to be. I'm not trying to be deductive, I'm trying to be dialogical. So I'm not trying to be reductive. But is this, is this the grounding of your faith? Do you know what I'm trying to say? Again, I'm not talking about propositions being derived from more deeper propositions. We've gone through this thing about how do you get the particularity of your Christian faith? Is this, in that sense. Please be fair to me. In that sense, is this the grounding of your Christian faith the way I just described it?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3361.29,"end":3386.37,"speaker":"Jordan Hall","text":"Hmm. Okay, so I'm going to say it back to you a slightly different way, but I think I heard you. So all three of us happen to be fathers, children, and we have the first person experience, therefore, of the kenosis that is intrinsic in parenting, all the way down to the color of your. The hair in your beard."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3388.61,"end":3391.89,"speaker":"John Vervaeke","text":"Yeah. And the loss of your Life, you lose years for every child."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3392.21,"end":3438.21,"speaker":"Jordan Hall","text":"Yes, absolutely. And to the unique qualities of possibility, of joy that are exclusively possible in this creative act, gated or mediated simultaneously by both the kenosis and the communion and the unparalleled degree of new qualities of grief that are available also in this experience and in the recognition in yourself that both in spite of and because of the aforementioned, it is incomprehensible that you could be even vaguely who you are after."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3440.12,"end":3441.48,"speaker":"John Vervaeke","text":"Right, right, right, right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3442.76,"end":3473.08,"speaker":"Jordan Hall","text":"That's probably the closest to the grounding of my faith that I can get to. I have a process where I go, oh, oh, oh, right. If my grief at the suffering of my children is X, how much greater is God's grief at the suffering of all of creation? And I noticed that there's something about the. These connections where I can have a sense of real empathy down and suddenly have a really weird sense of empathy up."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3474.2,"end":3474.76,"speaker":"John Vervaeke","text":"Huh?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3475.08,"end":3514.65,"speaker":"Jordan Hall","text":"I get it. I get it now. You know, I get you, God, in a weird way because I kind of now I get my dad. Oh, my actual dad, which I didn't get before. When my kids do something like, oh, I get it. I get what was going on in the experience of a being who loves me from the outside, like from before I existed and understands me in a certain context. And then through that line, there's a way of having a quality of relationship with the Abba. And so that, like the rightness of that, the way that, that actually develops the way that grounds everything else. And by the way, in this note, also philosophically and metaphysically, yeah, I would say that's probably the ground of my faith."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3516.81,"end":3570.4,"speaker":"John Vervaeke","text":"So I heard you saying, I want to put two grounds together if you'll prevent me from, I hope I'm not grinding things. But like, so there was this one which is the, the onto normativity, the goodness of being. And therefore any attempt, and I'm picking up on Jonathan here, any attempt to escape is ultimately misguided. And then I'm fulfilling that commitment to. Onto normativity, yet entering into reciprocal opening deeper relationship with the goodness of being. And, and the best way I experience that is in the kenosis, understood as agape, because of course parental love is the metaphor, the paradigmatic example of agape love and Christianity captures that. Sorry, I don't have the right verb here, but just let me use that word captures that very well for you. Is that. Did I say it back to you in a way that lands."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3570.4,"end":3574.29,"speaker":"Jordan Hall","text":"Well, the captious part is not quite right. So yeah, it's right with It, Yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3574.29,"end":3580.65,"speaker":"John Vervaeke","text":"Yeah, I don't like it. But something like that, it's more like strengthened, clarified."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3580.65,"end":3581.17,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3581.17,"end":3585.25,"speaker":"John Vervaeke","text":"Affords makes possible and supports."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3585.25,"end":3596.53,"speaker":"Jordan Hall","text":"So Affords is pretty good. It both pattern matches. But more than pattern matching provides a model and more than modeling provides the embodied body of the church."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3596.85,"end":3597.17,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3597.17,"end":3611.12,"speaker":"Jordan Hall","text":"An actual living incarnation of the thing that the model is confined, conveying that is real in the sense that all the things that I know in my deepest wisdom are the right ways to be in relationship with other people are lived in the community of my church."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3613.28,"end":3690.03,"speaker":"John Vervaeke","text":"Okay. So first of all, thank you for this. You're both being very charitable to me and I appreciate that. I do think there are versions of Buddhism that are committed deeply to non escape. Zen is a clear example of that. The idea of nirvana as escape is explicitly, completely, repeatedly rejected. And there is the self emptying aspect in relationship to that. And then there is the, you know, it's not I who live, but the Buddha nature that lives in meat. All of these, if you'll allow me, and I'm searching for words, all of these functions, I'm trying to use a neutral term, are found there equally well. Now I'm not saying they're found equally well in all religions. I'm not saying that. I'm not saying that. Okay, again, you're doing what I'm asking you to do. You're showing me why this doesn't degenerate into, you know, a liberal toleration kind of thing. Right. So what would you, I mean, well."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3690.35,"end":3698.67,"speaker":"Jonathan Pageau","text":"Does, does, does Zen, let's say, formulate the infinite as relational to the finite?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3699.15,"end":3699.63,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3700.51,"end":3701.07,"speaker":"Jonathan Pageau","text":"And so."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3702.91,"end":3706.23,"speaker":"John Vervaeke","text":"Emptiness is form, form is emptiness. Exactly. Explicitly."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3707.59,"end":3711.75,"speaker":"Jonathan Pageau","text":"So, I mean, I know this is going to sound weird, but then why."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3711.75,"end":3725.35,"speaker":"John Vervaeke","text":"Don'T people pray in Zen they do. So I happen to know a Zen Roshi and he prays and he chants and so forth."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3726.39,"end":3731.43,"speaker":"Jordan Hall","text":"What's the infinite like? Does it have a sense of humor?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3733.44,"end":3736.56,"speaker":"John Vervaeke","text":"I'm sorry, Jordan, you're going to be more precise in what you mean by that question."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3737.6,"end":3745.76,"speaker":"Jordan Hall","text":"Well, you know, one of the things of something that has a character relationship is that it has a character relationship. And so the question is something like."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3748,"end":3790.21,"speaker":"John Vervaeke","text":"Well, okay, let me answer that. Let me answer that first. Okay, so you know, this is Schellingberg, who's an atheist, but he says what we're talking about, we're talking about sacred is, you know, it's ultimately real. And again, not in the neutral sense, in the ontanormative. I want to participate in it. So that's a relationship term. I want to participate in it. I want to conform to it. I want to reciprocally open. I want to real. I want to be realized by it as I realize it, all of that. Secondly, it's ultimately orienting, like people reorient towards it. Right. And it's ultimately transformative. It causes, you know, this. This deep, deep. The deepest possible transformation from being egocentric to being profoundly reality centric."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3790.21,"end":3793.09,"speaker":"Jordan Hall","text":"But does it care about you? That's the question. Does it care about you?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3793.97,"end":3795.33,"speaker":"John Vervaeke","text":"Why does that matter to you?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3795.97,"end":3800.69,"speaker":"Jordan Hall","text":"That's a question. It might matter a lot, but it's definitely a question."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3802.61,"end":3807.69,"speaker":"John Vervaeke","text":"Well, so here's. Okay, let's do that. I mean, I'm basically trying to do."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3807.69,"end":3815.16,"speaker":"Jordan Hall","text":"Like, what are the dots? And see where the patterns match. And if they're isomorphic, they're isomorphic. And this ends up being something that may not be isomorphic. And then we can talk about it."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3816.68,"end":3829.64,"speaker":"John Vervaeke","text":"Right. Okay. So the concern there is. I would. I guess I'm going to try and speak on behalf of a Zen person. That's a little bit tricky, but speak."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3829.64,"end":3831.72,"speaker":"Jordan Hall","text":"On behalf of the Buddha specifically."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3832.28,"end":3910.6,"speaker":"John Vervaeke","text":"Oh, yeah, yeah. John will now be the Buddha, the Tathagata. Right. You know, so my concern. And I mean, this is. This is. And this is not a concern. That's like, weird. A lot of Christian theology has been responding to this concern, which is the. Onto theological critique. The problem when you start saying it cares for me or he cares for me is it sounds like you're turning God into a person. And persons are prototypical Aristotelian substances. In fact, that's Aristotle's primary example of what a substance is a person, which I don't think is a good translation of hypostasis, by the way. And it's like that seems to me to be making a category mistake. If ultimate reality. I'm going to let you use the word God for what you're talking about. Right. Because we're trying to see if the two meet, if ultimate reality is pure relationality in this non escapist form of non. Duality that seems to preclude it from being any kind of thing. Mm."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3912.92,"end":3918.2,"speaker":"Jonathan Pageau","text":"So, I mean, you could. I mean, I think we're using analogies here, but obviously it's hard to talk about this."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3918.42,"end":3919.02,"speaker":"John Vervaeke","text":"Yes, it is."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3919.02,"end":3931.38,"speaker":"Jonathan Pageau","text":"It is, I think, the way to. To understand the Jordan's question, which. Which is perfectly legitimate from a Christian standpoint because we say God loves me. Right. And so, yeah, but I don't love."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3931.38,"end":3939.78,"speaker":"John Vervaeke","text":"My child because they love me. That's the. That's not Agape. I love God. Spinoza. Right. You shouldn't."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3940.18,"end":3948.1,"speaker":"Jonathan Pageau","text":"If you genuinely love God, is there a sense of, of that relationship with the infinite? Like, is there a sense that they love it?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3948.1,"end":3950.74,"speaker":"John Vervaeke","text":"They love. They love shunyata, if that's what you're asking."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3950.74,"end":3952.54,"speaker":"Jordan Hall","text":"The question is, is shunyatta love them?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3953.58,"end":3957.34,"speaker":"John Vervaeke","text":"Why do you want that? You're agape. You don't want what you love to love."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3957.66,"end":3959.82,"speaker":"Jonathan Pageau","text":"I'm not saying what you want. I'm saying if I'm looking for the."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3959.82,"end":3974.15,"speaker":"Jordan Hall","text":"Ultimate, then I need to have the totality of all possible relationality contained within the ultimate. And an ultimate that does not contain the affordance for. Relate to. For loving John, literally, logically, is less than one that does. So that's it?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3975.11,"end":3991.51,"speaker":"John Vervaeke","text":"No, no, because you're engaging to what sounds to my mind like a performative contradiction. You're involved, you're invoking ultimate relationality and then pinning it to the existence of a specific subject that is capable of a predicate, namely loving Joan."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3991.51,"end":3997.71,"speaker":"Jordan Hall","text":"Okay, good, good, good. No, so that's, that's, this is the Aristotelian error."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":3998.35,"end":4002.03,"speaker":"John Vervaeke","text":"Okay, I like that name. I don't like Aristotle. So go ahead."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4004.35,"end":4005.71,"speaker":"Jonathan Pageau","text":"John. Going all out here."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4006.83,"end":4014.43,"speaker":"John Vervaeke","text":"Yeah, yeah, yeah. So what I mean is, I don't like the standard reading of Aristotle that's got taken up in modern philosophy."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4015.15,"end":4028.72,"speaker":"Jordan Hall","text":"Yeah. So this, this notion that. How do we say it? Right. For God to love you, God must be a person in the sense of the substance. It's not."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4028.72,"end":4031.32,"speaker":"John Vervaeke","text":"Right. Yes, we agree on that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4032.6,"end":4056.09,"speaker":"Jordan Hall","text":"For love to unfold the infinite qualities that are intrinsic to the nature of love, it must include within itself the quality of loving John. In fact, loving all of John's selves and all the John's quantum states. Right, but John specifically is the example we're using right now. And any version of love, all my."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4056.09,"end":4057.37,"speaker":"John Vervaeke","text":"Quantum states, I love that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4058.57,"end":4064.89,"speaker":"Jordan Hall","text":"Hey, the infinite is really big. That's actually."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4064.89,"end":4071.13,"speaker":"John Vervaeke","text":"The infinite is not really big. The infinite is not really big. Cantor was going to jump all over you for that one, but go ahead."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4074.7,"end":4083.66,"speaker":"Jordan Hall","text":"And so any way of endeavoring to. How do you say it? Any ontological. That's not right either."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4084.86,"end":4091.18,"speaker":"John Vervaeke","text":"Yeah, this is hard. And I understand that I'm pushing you both really hard, but you're being very kind to me."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4092.14,"end":4099.92,"speaker":"Jordan Hall","text":"Yeah, I don't know about John, but I've been doing a Monday, Wednesday fast and. Sorry, Friday, Wednesday, Friday, are you doing strict fast?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4100.16,"end":4102.4,"speaker":"John Vervaeke","text":"I'm sorry, I'm sorry, Jordan, Am I."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4102.4,"end":4104.8,"speaker":"Jordan Hall","text":"Going to break fast? I'm ready to go with John on this."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4104.8,"end":4108.32,"speaker":"Jonathan Pageau","text":"You Know what? You don't have to do a strict fast. Nobody's forcing you."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4108.8,"end":4115.68,"speaker":"Jordan Hall","text":"Actually, being faint is probably perfect. The perfect state in my weakness. His strength is."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4117.76,"end":4162.1,"speaker":"John Vervaeke","text":"Jordan. Can I say one thing that might be helpful? Not because I think it's full agreement, but I might close the distance and give you something to work with. I feel welcomed, enveloped, afforded by agape, by logos. Right. But I don't. I wouldn't say that. I wouldn't want to create the sentence agape. Logos loves me, even though it's analogous to what it's like when somebody's loving me. Are you saying that because Spinoza's fine with that, too? The same love by which I love God is how God loves himself. And the love by which God loves me is the same love that I have for reality. That's that kind of thing."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4162.5,"end":4178.78,"speaker":"Jordan Hall","text":"No, no, what I'm saying is that the totality of all possible ways of entering into the relationship of love, including the ones that you have with your son, but not limited to, and much more, is contained in love, which is the name of God."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4180.3,"end":4243.69,"speaker":"John Vervaeke","text":"Right, but it. I mean, so again, I tried to say something, and this is a little bit trite. It's something like saying like. And, you know, to be fair to me, Nicholas of Cusa says this. Love loves, and love is one with the beloved. He gets the Trinity out of love. There's love, there's the beloved, and there's the loving. Right. But he. But he says there's ultimately just love, and you shouldn't think of it as love loving, although you can talk that way. So I'm quoting a Christian here, by the way. I'm not trying to impose something from the outside. Like I said, I don't have any problem with the idea that. Well, I said it a long time ago when I talked about agape. Agape precedes me. It'll be after me. It is through me, and I am totally indebted to it. And therefore, I feel gratitude and gratefulness. And of course, I mean logos as well as agape. And for me, that's what it's like to. That's what I hear when people say I'm being loved by God."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4244.25,"end":4255.21,"speaker":"Jordan Hall","text":"So what about something like intimacy? Oh, sorry. Quick, I got to do a rule check. So I got to go to our resident ortho bro, because I don't know this stuff. Is Nicholas lacusa a heretic?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4257.09,"end":4261.57,"speaker":"Jonathan Pageau","text":"Is he a heretic in the Orthodox Church? It's irrelevant. What date is Nicholas of Cusa?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4262.77,"end":4265.01,"speaker":"John Vervaeke","text":"He's what, in the 1500s. Yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4265.01,"end":4268.57,"speaker":"Jonathan Pageau","text":"So it's irrelevant. It's like we don't talk about that because they're all heretics."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4268.57,"end":4271.33,"speaker":"Jordan Hall","text":"They're all heretics. Okay, good. So we could just throw them out with the gun. No, I'm kidding."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4273.09,"end":4282.11,"speaker":"John Vervaeke","text":"He's not a heretic in the Catholic Church. Which means, unlike Eckhart, none of his propositions were considered heretical either. Yeah."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4282.18,"end":4285.86,"speaker":"Jonathan Pageau","text":"And Eckhart. Even Eckhart, like, we don't know which proposition we're questioning. Like."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4285.94,"end":4287.22,"speaker":"John Vervaeke","text":"Yeah, yeah, he's being."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4287.22,"end":4290.5,"speaker":"Jonathan Pageau","text":"He's. Eckhart has been pretty much re."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4291.86,"end":4292.66,"speaker":"John Vervaeke","text":"Exonerated."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4292.98,"end":4301.14,"speaker":"Jonathan Pageau","text":"Exonerated at this point. His statements are probably. The places that were. That were questionable are probably not in his writings anymore anyways. We can't."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4302.34,"end":4398.29,"speaker":"Jordan Hall","text":"Yeah, so the topic that maybe I would put on there and maybe even leave it there for the moment is that there's this notion of the concept of intimacy, the quality of intimacy that must be present for. And again, I'm just sticking here as a straight logic. If it exists at all in reality, then it must be an expression of that which is the ultimate. And the question is, is that actually part of this? Of. Of the infinite or the one or the ultimate? If you have a relationship of intimacy, and intimacy is reciprocal in nature, yeah, you're vulnerable. Yes. But there's also something like a reciprocal vulnerability. Again, back to the fact that Christ incarnated and actually died on a cross for a variety of different reasons. But part of that is actually the. There's a reciprocity of relationality here. You're actually entering into a quality where. And by the way, an actual person, which is important. The quality of personhood does not define God, but it's a part of something that God is actually expressing. I agree with you, of course, that hypostasis is deeper than Persona E. So that's, I think, a question that's probably worth circling around is this very precise point of what is the essence of the quality of the relationship of love? And where does it sit in the larger kind of cosmologies and theologies?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4400.13,"end":4605.03,"speaker":"Jonathan Pageau","text":"I just want to say something also about the idea that God loves us the way. I think the best way to also understand that is the way this reciprocation Proko. Reciprocity that we have that, you know, God says, Christ says, love God and love your neighbor. That's also how God loves you. Right. It's similar to what you were referring to before John in Dante. You see it very beautifully. We're actually doing a class on Dante right now. And the sense that God, the people that come into your life with love, that you enter into a loving relationship with, they are the call to love God. They are in some ways the draw. They're drawing you into the love of God by their love, right? You have this beautiful image in the Comedy where basically it doesn't even say that God called because it's too high, but there's a sense in which the mother of God, the Virgin Mary, calls upon Dante's patron saint, who then calls upon Beatrice, who then Beatrice then goes and gets Virgil. And now Virgil comes to encounter Dante. And so you have this chain of love which moved up, right, the ontological ladder into God's love, which is pulling all these things into him. And so, you know, you know, we can, obviously we can experience sometimes glimmers of this directly God's love. But to say God loves us is to state is the same thing as to state that the world is good, right? It's the same thing. It's to say that. That. That all these. All these aspects of reality are a piece of the ladder. There's. They're an aspect of. Not in a utilitarian way, but they're a ladder into God. They're a step. There's something which is possibly revealing God to me at this moment. And if I can be in the right posture, then I can climb that ladder. I can see through the love of those around me, through all of this that's pulling me into God. And the mysterious. The most. The hardest part of it, and the most mysterious part of it is that sometimes when the love of those around me is evacuated where I actually encounter hostility, that also becomes a ladder for the love of God to pull me into him. Because it's as if now it's a more direct. I can have access to a more direct relationship with God even when I'm being. When Christ says, blessed are those that are persecuted for my sake, that there's. So there's. Both of. Those are ways in which we can have this experience of the way that God loves us both through the hierarchy of love of all the others. But then also when we are attacked for wrong reasons and for the name of Christ, you could say, you know, and then all of a sudden the love of Christ will also pull us into. Into him. And if you haven't experienced it, obviously it's hard to describe, but it's something that you definitely do experience."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4608.47,"end":4800.82,"speaker":"John Vervaeke","text":"So those two terms, those two things, Jordan's point about intimacy and what you just said seem to go really well together in My mind and I understand intimacy as the affordance of reciprocal opening. So I can. I have intimacy if I can indwell somebody and then they can indwell me, a deep, profound, participatory knowing, and then that affords reciprocal opening. And again, I think I can have that kind of intimacy with what we've already agreed with onto normativity, which is really real. And I love it because it's really real. And I do experience it in, like Jonathan said, in logos, agape, horizontally with other people and upwardly and downwardly into the depths and up. Ontologically, all of that is the case. I. But like I say, and maybe this is me, but I find that I don't deny that I can whatever everything I can resonate with that in Christianity. Jonathan. I was there in the Gospel seminar and I made that clear. But. Right. I also have that in the depths of Buddha, Zen especially, are the depths of Neoplatonism. And again, and maybe this is ultimately, maybe we're pushing on something that is maybe something that we can't ultimately get out into a formal thing. Right. And I may be, you know, I may be asking for something that I can't ultimately get. What I hope I've offered is a way of explicating a lot more what you were saying, Jordan. And this is, I think this is a much better answer, if you'll allow me to, Jim, than the one that you were trying to work out, because I think that's. As a friend, because I think this is the kind of thing that is the way you try to persuade people why you're a Christian in a way that I think is profoundly has a potential to be. What I hope is you think it is or want it to be, which is profoundly calling to them rather than right. Do you know what I mean? It's like we, we went down this and there was a, like, I thought this was really good. I thought there was. This was genuine. And I'm not trying to escape now or anything like that. But, but do you understand what I'm saying? I. Like there could be a point where we're looking for a difference that we can't. That's ineffable that like. Because I keep saying, yes, I have that right. And not trivially so. Because I'll say this and you'll go, yes, that makes sense. Right. But I'm not trying to be reductive either. Sorry. Now you can see that I'm running out because I'm starting to go into aporia. So I'll stop and let you two respond to what I just said."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4801.22,"end":4816.11,"speaker":"Jordan Hall","text":"Well, it's interesting. So what I noticed was that I definitely don't want to persuade anybody. I don't necessarily even want to call anybody, which is weird because I know that that's, I think, what you're supposed to do, but whatever."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4820.11,"end":4823.11,"speaker":"John Vervaeke","text":"Yeah, it is kind of all I."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4823.11,"end":4880.13,"speaker":"Jordan Hall","text":"Want to do is tell the truth. And all I want to do, though, all I want to do is too low as best I can, the model that Christ laid down for us. And to the degree to which the Spirit put something for me to do, to do it with as much skill as I can, which is not much, because I don't think it's critical. I don't understand. I definitely know that it's the weird thing. It's like the invert, that Socrates thing. I am quite certain that I don't understand how any of this works and that anything that I might try to do is definitely a bad idea in a very particular kind of way. And so I'm really glad that you asked us to have this conversation. I had a very distinct sense that this is. It will rile a bunch of people up. But, you know, as you said, though, was it called Persecuted in His Sake, in His name? But I feel like what we did was useful in a big way and. Good, Very good."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4881.49,"end":4938,"speaker":"John Vervaeke","text":"Well, thank you. I mean, this is. If you'll allow me, this is. I'm trying to. And I'm showing up in good faith. So this wasn't instrumental or anything. I have affection. I showed up in good faith. But this is the philosophical Silk Road. I'm trying to get to where we can get into these deeply mutually transformative dialogos about relationships to sacredness, such that it's reasonable to believe in the B laban sense, that we're affording the advent of the sacred, we're affording its presencing in people's lives in a way that could matter to them. And so that's what I wanted to do. I wasn't, and I hope I showed up that way. I wasn't trying to refute anything. I wanted to get the juice out, if I can put it that way. Sorry."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":4938.32,"end":5061.7,"speaker":"Jonathan Pageau","text":"I think there's also something that this is. And I want to be careful that people don't take this the wrong way, because I really am a Christian in every way. I really believe Christianity is the fullest revelation. But there's also a more practical aspect, which is that there's a real practical aspect to the idea that we can't Be meta. Like, there's no. That we're not meta practitioners. And I think that that's what that's important too, is that though the reality of being a Christian is not lived in asking, you know, how better is it from Zen, let's say, right? It's lived in your morning prayers and going to communion and to confession and to, you know, and, and living it with your family and your community. So, so that's also like a, that's something that can't be completely ignored, right. In the discussion that although there are probably better people than us to argue like the defined points of theology and of, of, you know, and the differences, let's say, in, in the metaphysics of, of the different systems, at least I know that there are better people than me to do that. But there is also that other part which is, which I think is important, which is, like I said, that the Christianity I live is. That's it. It's like I go to church on Sundays and I live my life in relationship with God. And it's something that, that's real and existential. And, and, and I actually, although it has happened in my life where I've had to ask myself that question, you know, about different systems in moments of crisis, let's say that is definitely not something that feeds my everyday life. Like, I don't, I don't ask those questions most of the time."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5061.7,"end":5063.38,"speaker":"John Vervaeke","text":"You know, I don't want to trespass."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5063.7,"end":5068.6,"speaker":"Jonathan Pageau","text":"Most people don't either because they live in the world that they live in."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5069.16,"end":5121.91,"speaker":"John Vervaeke","text":"I'm not trying to trespass on that at all. But you don't want that to become a justification of insularity. No, obviously, because, I mean, and this is part of, I think Jordan and I still agree the world needs to form some kind of common unity or else we're in a lot of trouble and it's not going to happen. Now we're in the practical domain now, so we've all agreed, we've left down the theology. It's not going to happen. By converting the world into Christianity, at least you've been trying for 2,000 years. It hasn't happened. And so I have a good inductive argument. And so I think, again, we're now agreed that we've moved into the practical domain at this practical domain. Trying to afford this kind of deep dialogos is, I think, what is pertinent now in that practical domain."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5122.95,"end":5189.7,"speaker":"Jonathan Pageau","text":"Well, I think there's always room for learning from each other, you know, and I think that that's not, I Don't think that that's not a problem at all. I don't see that as an issue. You know, and you can even learn from other people's. You know, you can, you can meet a Muslim, meet a Zen practitioner, meet a Jew, meet someone who's not in your religion and find deep admiration of their moral strength, of their, of their faith, of how they're transformed by something that is beyond them. And I think, at least in my opinion, I don't think that that's an issue at all for me. And so I think that there has to be ways that we can encounter others and learn from each other and see what's good about other, other, other world without it being. Trying to formulate constantly which world is better. Like. No, you see what I'm saying?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5189.7,"end":5197.28,"speaker":"John Vervaeke","text":"Like I, you, you just articulated the philosophical Silk road. That's exactly the philosophical silk road project as you just articulated it."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5197.28,"end":5212.32,"speaker":"Jordan Hall","text":"Yeah, it definitely isn't ideological. Right. You can say for certain this definitely has nothing to do with competing ideologies or the desire to create a totalizing universal meta ideology. Definitely not that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5214.08,"end":5265.69,"speaker":"Jonathan Pageau","text":"Even eschatologically. You know, if you look at the way that it's described in scripture, the idea that all people are going to become Christian, just not there. It's just not, just not in the, it's not in the story. Like, it actually seems to go the other way. It actually seems to go like, you know, a bunch of people are going to become Christian and then people are going to hate you and they're going to persecute you. So it's not going to, it's not going to play out like in this. I think that, that Islam has a more. Might have a, more of a, of a tendency to think that we're just gonna get, everybody's gonna become this thing. Although Christians have, you know, definitely are evangelized. But I don't, I don't see how, how even in the. Christianity's own cosmo cosmology, you can imagine that at some point everybody's just going to become Christian like in the eschaton, you know?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5266.89,"end":5274.6,"speaker":"John Vervaeke","text":"Yeah. I mean, again, I mean, there, there are Eastern Orthodox David Bentley Hart who are universalists in the eschaton."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5274.6,"end":5277.16,"speaker":"Jordan Hall","text":"Though he's not a universalist in Kronos, is he?"}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5277.8,"end":5303.55,"speaker":"Jonathan Pageau","text":"Yeah. David, I love Dave Bentley Hart. I loved his writings for many years. I thought he was amazing. I think, sadly, I think he's slipping into syncretism. His universalism is pushing him towards more of a syncretic approach. And so I think that. That's kind of. That's kind of too bad. A lot of his ideas are still really useful."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5303.87,"end":5308.51,"speaker":"John Vervaeke","text":"You mean bad syncretism, because all religions are syncretist in some fashion."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5308.59,"end":5318.43,"speaker":"Jonathan Pageau","text":"Yes, but they're not. They're not. So every. Everything that exists is syncretist to some fashion. And then it finds unity in the multiplicity. But if you, when you."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5318.43,"end":5320.43,"speaker":"John Vervaeke","text":"You mean a fragmented syncretism, what I."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5320.43,"end":5337.67,"speaker":"Jonathan Pageau","text":"Mean is that when you formulate it as syncretism, like when you formulate it as a kind of. As a. As. As a kind of multiplicity, that. That isn't joined, that has to be joined in some kind of unitary practice. And I think that that's a dangerous, like, hodgepodge. I think that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5337.67,"end":5341.75,"speaker":"John Vervaeke","text":"Yeah, yeah, I get what you're saying is very. Yeah, that would be temptation. Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5341.75,"end":5368.36,"speaker":"Jordan Hall","text":"Temptation, which is the inverse of communion. That which brings a multiplicity into a false unity that is actually just a con. What's that called in material science? Like we take sand. Sand is actually not actually a whole thing. If you melt it into glass, it is. So something that's interesting just to think about is the degree to which we each have particular callings. We're friends and I think becoming better friends, which is really fun."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5369.16,"end":5370.6,"speaker":"John Vervaeke","text":"Yeah, I love it too."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5371.56,"end":5373.68,"speaker":"Jordan Hall","text":"And those callings are distinct."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5373.68,"end":5374,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5374,"end":5420.22,"speaker":"Jordan Hall","text":"John is called to this philosopher, philosophical self road. And that's a thing. That's a role. It's a critical element of what's going on. And Jonathan is clearly just getting better and better at looking really good on the Internet and embodying beauty in a way that is just impossible to avoid. With any luck, my calling is to retire peacefully and quietly in the mountains of North Carolina and eat barbecue. So it's very liberating, actually, I think, to recognize that if we live the way that we're living, following our calling and entering into relationships that are truly grounded in this requirement to love one another, then whatever else is happening, we're doing the right thing."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5423.18,"end":5479.33,"speaker":"John Vervaeke","text":"Yeah, I'm happy with that. And I think it's fair to say that was my intent from the beginning. It was to try and do that. I'm sort of done the problematic. I wanted to bring and have you two respond. And again, I think you both responded very well. Genuine dialogos. I got to places I couldn't get to on my own and that matter to me and make me think deeper. On a more personal note, I'm on a long journey of a kind of rapprochement with Christianity. And this has been not. I'm not saying I'm going to become a Christian or anything like that, but this coming to a place where I think I can as much as possible, be healed from just a traumatic apprehension of Christianity. So I wanted to thank. Thank you of that."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5482.13,"end":5550.5,"speaker":"Jonathan Pageau","text":"Happy we can play a role in that. That's wonderful. And so I think this was the time we had allotted to ourselves. I think we came to a good spot. As you know, these conversations, they're always the beginning. It can go on forever. And so thank you, both of you, for your time and your forthright, you know, stance. I really always appreciate it. It's wonderful. And remind everybody, by the way, that I am going to be in Florida with Jordan hall also. And so there might still be tickets to that event. I don't know. We'll put a link to it if there are tickets to it. But we're going to spend a whole weekend together with a few people having feasting and drinking wine and having wonderful discussions. It's going to be absolutely great. And don't forget that John will be doing a course on the cog sci ritual, and I'll be part of that as well. So let's keep finding reasons to speak to each other and work together. All right, everyone, thanks for your time."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5550.5,"end":5551.34,"speaker":"Jordan Hall","text":"Much love, guys."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5551.74,"end":5552.46,"speaker":"Jonathan Pageau","text":"Bye. Bye."}
{"episode_id":"SW - #359 - 2024-10-05 - John Vervaeke and Jordan Hall - Why Christianity -","start":5552.86,"end":5553.42,"speaker":"John Vervaeke","text":"Take care."}
