{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":0.32,"end":76.04,"speaker":"Jonathan Pageau","text":"Jason Brubaker is a graphic novelist. He's an artist who worked for several years in Hollywood for DreamWorks. He worked on projects like Blade. He also worked on Kung Fu Panda. And he finally decided to leave LA and leave Hollywood, which didn't fit with his own values, and decided to go on his own and create his own projects. Since then, he's put out two series of graphic novels. One is called Remind and the other is Cithra. I've read both series and really enjoyed them. My kids also enjoyed them as well. It is very beautiful art and very dramatic storytelling. Very much worth your effort, if you're into that kind of thing. So we talk about his creative process, how he inserts symbolism into his work. We also talk about graphic novels in general. My own project, God's Dog, which is in the process. So there's a lot of great stuff. And I was really excited to talk about him because I really enjoy his work. And so I think you'll feel that excitement and you'll enjoy this conversation as well. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":87.01,"end":92.53,"speaker":"Jason Brubaker","text":"So will you do it? Be doing any editing after, you know, once you get the video, I might."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":92.53,"end":94.77,"speaker":"Jonathan Pageau","text":"Edit in some pictures of your work."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":94.77,"end":95.65,"speaker":"Jason Brubaker","text":"Okay. Okay."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":95.65,"end":98.05,"speaker":"Jonathan Pageau","text":"But I usually don't edit a lot of the actual content."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":98.85,"end":99.73,"speaker":"Jason Brubaker","text":"Yeah. Okay."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":100.61,"end":101.73,"speaker":"Jonathan Pageau","text":"Unless you say something."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":101.81,"end":110.05,"speaker":"Jason Brubaker","text":"Really? I'm always so hesitant to say weird things."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":110.05,"end":119.4,"speaker":"Jonathan Pageau","text":"I was gonna say. You're not. You're not at all. Of what? I've watched quite a few of your videos, and you're not at all. You're not the edgy. You don't seem like the edgy type who's looking to create controversy."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":119.4,"end":122.72,"speaker":"Jason Brubaker","text":"It just keeps me up at night too long, you know, I don't. I don't want to go there."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":123.04,"end":123.84,"speaker":"Jonathan Pageau","text":"Yeah, I understand."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":123.92,"end":125.2,"speaker":"Jason Brubaker","text":"I'll leave it for my books."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":126.48,"end":173.81,"speaker":"Jonathan Pageau","text":"I think I'm kind of the same, too. I don't. I don't like. I mean, I will. If I need to go somewhere, I will, but I don't like to provoke. I don't call people out. I don't do all that stuff that a lot of people do on the YouTube world. So. So we're kind of. We're kind of. So. I think that's probably why. One of the reasons why I liked your channel, too, is it was straightforward, talking about comics, the world of comic books and how to do it, how to make it work. And there's a generosity about your approach, and even in your books, there's such a generosity in terms of having a lot of your Stuff even free online for people to access. I think that approach is. I think it's exciting. It's an exciting approach to see that happening, to see it be possible. And you, I seen. Seems like you're still making a living with this. I don't know if I'm wrong."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":174.29,"end":221.35,"speaker":"Jason Brubaker","text":"Yeah, it's still going, you know, I mean, I've been doing it for four years full time now and it pays all the bills and so I figure, hey, you know, I might as well keep doing what I'm doing. There's something working that I'm doing, you know. And yeah, that excitement about putting stuff online was because I saw other people doing it back in the day. Like in 2009 I saw people doing that and there wasn't really any money in it, but it was just so exciting to see that, wow, people are sharing this information and they're getting their stuff out there and they're passionate about it and it's better than this other stuff that's professional, you know. So it was just. It kind of just changed my whole perspective on it because I was really pursuing agents and publishers at the time and wow, it just jumped right into the conversation. Sorry."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":221.35,"end":256.96,"speaker":"Jonathan Pageau","text":"Yeah, no, that's. I'm recording. So this is going to be it. I think it's exciting when I see one of the things that the online space seems to have provided too is a way for people to be directly in contact with your base. When you're going through a publisher and you're publishing books and they're going out and it's deadline and all of this, you have to actually physically go to comic shops or whatever to get any form of return from your readers. But I guess on the online space it must be way more satisfying to have this immediate connection."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":256.96,"end":353.94,"speaker":"Jason Brubaker","text":"Yeah, yeah. You get. I like to say that I have online editors, you know, I'll post my stuff online and then I'll get a bunch of people responding to it and then I know what to edit and they'll even call out like spelling errors and grammar. I think you should say it this way. And then I'll use that for the editing purposes before I actually publish the book. So it's really helpful to really test the product as well just by putting it online. And yeah, it's great. And it is kind of a double edged sword because I do like to step back away from this kind of being this public face that is always communicating because that's really tiring and it really fractures my time and then I can't get into that Deep focus that I need to, to make the thing really good. And it takes, you know, a year of deep focus to be able to do that kind of thing. So jumping on and off of line is really just really fractured my brain and I kind of have to pull away from it and unplug from everything. And like, I don't like to do social media much anymore because, you know, it's just, it's just too much and it does, it doesn't give me any. It doesn't give me very much. You know, I feel like social media is more like something I can just share with my friends, but not people that I don't know. Even though I know it's marketed to everybody, that social media is the way to share with the world and you get famous that way. But for me it's just like, no, it drives me nuts and then I don't get anything done and then I'm focusing on the wrong things and then, you know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":354.26,"end":401.55,"speaker":"Jonathan Pageau","text":"Yeah, I know. I think, I know. I know exactly what you mean. What I've been trying to do is I start really early. So I try to start work at 6 in the morning. So I get up, try to get up at like 5:30, whatever started, you know, do my prayers and kind of beginning the day stuff. And then at 6 I try to work and just carve. So from 6 to 10, that's it. Like it's just carving and listening to podcasts while I'm carving, you know, not engaging with anybody. And then I come back and I eat breakfast and I do my, I start the more email stuff in the online stuff. So by the time I'm online I feel like, okay, I've actually accomplished something. I don't feel like I've lost, wasted my whole day, you know, on social media, which can totally happen even before breakfast."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":401.55,"end":401.91,"speaker":"Jason Brubaker","text":"You."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":401.91,"end":402.75,"speaker":"Jonathan Pageau","text":"Oh yeah, yeah, yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":402.75,"end":403.07,"speaker":"Jason Brubaker","text":"Network."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":404.11,"end":413.23,"speaker":"Jonathan Pageau","text":"Well, it just depends on people. Like for me it's the best time. You know, I'm just, I haven't eaten, I just have a cup of coffee and I'm just, I'm there in the carving and then that's it, you know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":414.75,"end":468.91,"speaker":"Jason Brubaker","text":"Cool. That reminds me when I was working at DreamWorks because I worked at DreamWorks for about seven years and that's when I was working on my first graphic novel and, and I finished it and I just couldn't put in the time to make the next one, which was the conclusion. So I found myself getting up at five and working for about two hours before I went into work. And yeah, I would go in I'd be like, yeah, it was just super satisfied and like, it doesn't matter if I don't get anything done here at work, you know, like, I've done my thing, you know, and I was able to get that second graphic novel done by just getting up really early. Yeah. And it was a stressful time in the family. Like, just had kids, wife was having postpartum depression, so there's a lot of things going, going on, but yet I still was able to block out that time and, you know, help with the family. When everyone woke up, I was, I was serving breakfast and taking kids to school and I had already gotten in my two hours, you know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":468.99,"end":514.39,"speaker":"Jonathan Pageau","text":"Yeah, to me, that has been the, the only solution, really. And so what I, what I try to do is I start, so I start really early. I, I get my first four hours of carving done. Then after that, if I don't get back to carving, I don't feel totally guilty if I'm doing online stuff, answering emails, doing these kind of conversations. And then at 5, that's it, I'm done. Like I'm finished. And then I'm with the family, I'm helping with dinner with the kids. And so it's like you can. Getting up early is like the solution to so many problems. Yeah, yeah. If you can do it. I'm not an, I'm such a night person. You know, in college I was the guy who would go around the clock. Like I would stay up so late at some points and it was like, oh, there's no point in going to bed again. Might as well stay up until late afternoon the next day because it's like five in the morning. I've just been staying up, just kept staying up later and later and later until it kind of cycles back."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":514.79,"end":539.46,"speaker":"Jason Brubaker","text":"Yeah. Until I had kids, I was a night person. And then now it's like I've been forced to be a morning person. And I really like it. I mean, I love being up before the sun comes up, but sometimes, you know, I just can't do it. But. Yeah, but I, what I do is I have a really late lunch. So I have a lunch at like 2 or 3 o'. Clock. I'll try to work from the time I get into the office all the way to lunch. And then after that it's just, you know, hit and miss."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":539.54,"end":669.58,"speaker":"Jonathan Pageau","text":"Yeah. Then not that much happens. It's tough. It's tough. Especially when you're doing the kind of work you're doing. You know, you just need that ultra focus or else, man, you're just gonna get sucked in. So I want to talk about. I want to talk about your work. I've read two of your series. I read the Remind series and also Cithra. First of all, my kids just swallowed it up. Like, they just loved it so much. My son, who's 14, he read it twice. And my daughter, you know, she's not as good in English, but she read the whole thing on her own once and now she's. She started reading it again. And so there's something about, and I think I was trying to figure out what it is about the books that is so compelling. And I think, I mean, I'm gonna speak, I'm speaking also because I'm not objective in this. You know, I have my own, my own perception. But I do think that there is, in both books, there is a deep symbolic intuition. So the way the world is structured, you know, even before the actual story, it's like the way that you structure the world is so intuitively right, even though it's fantastical, that I think that it just connects right away with people. You know this in your remind story, you have this underwater world where there's these kind of like lizard type creatures. Then you have an above water world that isn't aware of what's going on underneath. And then connection with that underwater world leads to a disjunction between mind and body, a kind of confusion where like mind and body don't fit and then they try to fit them back and it doesn't work. And so there's like crazy adventure about, you know, you know, the whole like, you know, different persons in different bodies, which is exactly the experience of death. You know, it's exactly that experience of being underwater. Whether it's dreaming or dying, all of that is all about disconnecting mind and body. And so it just, it just. Because you wouldn't think about it, but it just makes sense that that's what happened if you go underwater. And so it all. It's crazy and it's wild and it. And it just keeps getting crazy and crazier as it goes. But it's still the basic logical symbolic structure makes sense. So you gobble it up no matter what, you know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":669.83,"end":679.91,"speaker":"Jason Brubaker","text":"Yeah. That's awesome to hear you describe my stories because I've heard you describe so many other stories. That's great. I love it. That's cool."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":679.91,"end":718.32,"speaker":"Jonathan Pageau","text":"This is something that I'm curious about. Is that in terms of your process, do you. So like, let's say I described it that way for You. Was it just an intuition in terms of this story just makes sense, or do you feel like you actually worked at making it? I don't know how to say it. Like, did you use your kind of rational mind to make it make sense, or was it just like. No, this is just an intuitive process where, like a songwriter. I've heard songs where it's obvious that the songwriter didn't totally understand what they were doing, but they tapped into some reality and they were just. They're just laying it out even though they don't. It's not rational."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":718.8,"end":856.47,"speaker":"Jason Brubaker","text":"Yeah, I don't think I ever went into it, like, knowing what I was doing. And I mean, part of the reasons I like to kind of stretch into, like, these different worlds is because I've realized that in retrospect, it is because it kind of, like, nullify it, like, stops people from having presuppositions when they start reading your thing. And, you know, if I start talking about a story that has to do with my past religious experiences, suddenly people have these, you know, they. They might put up roadblocks because they don't want to hear about religion, you know, and yet I can. I can talk about that all through these. These metaphors and allegories and all that stuff. And. And, you know, also I've read the Bible my whole life, and so it's. It's just kind of like, I think it's ingrained in how I think about stories and the structure of the world and how life is. And so to me, that's, I think, just kind of a natural way that I look at storytelling is what's the. The hidden meaning of all this? You know, and then also I look at it like parables. Like, I feel like our stories that we write are. Are like parables, and they're not meant to be understood. The same to people who have the knowledge to understand them versus the people who don't, you know, Like. Like. Like if someone really wants to dig into the parables, they can find a lot of different hidden meanings versus, you know, and even Jesus himself said, you know, like, if you have eyes to see and ears to hear, then you'll. You can understand what this means. If not, then, you know, maybe I'm understanding that wrong. But so. So he was saying them to everybody, but there was a certain group of people that could understand the deeper meaning. And so that's kind of the way I look at my storytelling too. Like. Like, yeah, most people will probably interpret this wrong, but, you know, but I would like to Think that there's a certain group of people that will really get it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":856.67,"end":856.91,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":856.91,"end":859.47,"speaker":"Jason Brubaker","text":"And they'll be really obvious. Yeah. You know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":859.87,"end":985.9,"speaker":"Jonathan Pageau","text":"Well, in terms of, like, if you, in terms of symbolic structure at some point, it's not, it's not even about interpreting it right or wrong, because the structure is there and the structure is making the story happen. And so there is like, especially in Cithra, in your second series that I, that I read, there was more of that, let's say, kind of parable sense where you could feel that certain characters are pointing to certain things. Kind of like you see in CS Lewis where you have Aslan. It's like Aslan is Jesus. It's not as explicit as that in that story, but you have certain things which seem to be pointing to some Christian aspects, let's say. But the best type of symbolism, I think the place where it works the best in your stories is where it's the actual structure of the story. It's like the structure of the story is laying out reality in a way that helps you to, you know, that is fantastical. But it also feels so right, you know, like in Citra, you know, why, why does it feel right that there is a. There's this desert with all these like kind of parasite creatures that are there and that will come out and kind of attach themselves to you. It's like, why does that feel right? Because that doesn't. It's not a reality. But when you read it and how you see how it's related to sin to a certain extent and it's related to passions and being kind of sucked into something, some kind of desire that you have and it all makes sense. My 14 year old son, he was reading the books and he said, oh yeah, I really love how he made the. These, I forget what they're called. These like parasitic creatures, how he made them like demons. Like he made them like your passions and there's like a visible version and an invisible one and they kind of mirror each other. And so it's like all of that makes sense. Even though when you think about it in terms of reasonable world, it doesn't connect to anything in the. Well, it does, but it. Not directly. It is really structural."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":986.35,"end":1088.24,"speaker":"Jason Brubaker","text":"Yeah. And I don't think I like to just do like C.S. lewis does, where it's like, it's a metaphor, like this character equals Jesus or whatever. I, I, you know, acknowledge that exists. But. But yeah, I like to kind of like trick people. Like if there is a character that's a deceiver I don't want to make it obvious, you know, because he'll deceive the audience, you know, and. Yeah, so. So, yeah, I don't. I don't really know if there's, you know, I wasn't trained in it necessarily. I just absorbed a lot, you know, as a kid and storytelling and I just knew what I loved and didn't love. And, and so when it came time to write and finish my first story, which was remind that the first graphic novel did you finish? That's like the first thing I ever like, really finished. That was a big story. And so I kind of just put it out there going, man, I hope I finished this right. You know, I hope people like it because I don't know how to tell stories. But. But, you know, the thing I've learned through working in Hollywood is like, it's. It's more about as an artist, just like your, your interpretation of how you see things and, and, and, you know, telling a story in a unique way is kind of the. Is kind of like what I'm trying to do. Like, like Miyazaki stuff is a great example of it. Like, it's a different culture, different world, different fantasy, fantastical things, but it's just a window into this other world. There's a lot of times not even a real good middle beginning and end to his stuff. It's just kind of like opening the curtains. Here you go. There's this weird land, you know, and. And I hear he doesn't even know how they're going to end when he starts on them."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1088.24,"end":1088.72,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1088.72,"end":1124.84,"speaker":"Jason Brubaker","text":"He's just waiting for him to figure out. And that's how I work. You know, a lot of times I have these loose structures in place, but. But I kind of just. I mean, honestly, I just pray about it a lot that God will help me to, like, right. You know, figure out what this is supposed to mean, you know, and. And so a lot of times, like with Citra, a lot of it really evolved as it went. It started out just as a story of the little girl, and the kid was the kind of the side character, the boy. But as it ended, the boy kind of got more dominant in the story."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1126.28,"end":1236.67,"speaker":"Jonathan Pageau","text":"Yeah. And the character of the little girl is great. It's such a wonderful character. I think that's one of the reasons why kids like it so much, because the character has that kind of. It's kind of forthright and buoyant. You know, she's really, is the best, like the best of what a little girl can be. So you really get that in her. And I think that's probably one of the reasons why the kids like it so much, is that character. But the other thing that I really, really was impressed by the way you were putting things together in the book is how you use. You really take your time to tell the story. Especially in the first books of Cithra, you kind of just take your time and you're using page turning as a dramatic tool. And I'm wondering if I've seen that as much in other comics. I'm not. I haven't followed comics in a very long time. But there are some times when you get to a point and you know that on the next page, it's going to kind of reveal some secret. And then sometimes you turn the page and there's almost nothing on the other page. It's like this moment of weight. So it's a. You know, it's just like a. It's just a breeze of wind that goes by, and you're. You're expecting to find the solution to the problem that's being set up, but it's like, no. This little pause and it's like, oh, you know, and it's just like pulling apart and you turn the other page, and then you finally get the payback, you know, And I really appreciate that. I was really surprised at how effective that that can be. I never. I had never thought about it so much. Like when I remember being a kid and reading some comics where you're having something being set up and your eye can't stop from going to the last. You know, your eye can't stop from jumping ahead. And so you're. You're ruining the surprise for yourself as you're. As you're reading it because you can't stop from. But if you have to turn the page, then there's this whole dramatic sequence is being set up."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1236.75,"end":1311.15,"speaker":"Jason Brubaker","text":"Yeah. And I think I started thinking that way because I would put it out as a webcomic, so it would be one page a week. And I was really. I mean, a spread. One spread a week for remind. And I was really trying to just make sure that people came back. So I was really trying to set up those pages to where, you know, you would. You just want to turn that page and you want to wait for the next week. And another thing I was thinking about was, you know, when you pause a film, you pause that mood and the color palette and all that stuff. And I was always turned off by the comics, that every panel would be a different mood and Tone, color palette and scene and location, and it's just like flying all over and every panel's competing for your attention. And I really wanted to be like, when you, when you have the book open on a spread, it's, it's, it's almost like you've hit that pause button and you can absorb that mood one scene at a time and then you turn the page and can go into a new scene in a new mood, you know, so those are some of the things I was, I was actively thinking about in, when I was designing it. But yeah, the. I had a lot of people talk about the page turning."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1311.56,"end":1311.96,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1312.04,"end":1319.36,"speaker":"Jason Brubaker","text":"How I do it. Well. And I didn't realize I was doing it that well, I guess, until so many people started mentioning it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1319.36,"end":1319.8,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1320.04,"end":1320.44,"speaker":"Jason Brubaker","text":"So."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1320.44,"end":1386.95,"speaker":"Jonathan Pageau","text":"Well, for kids, it was great because it was also because the first time I read it, my nine year old daughter, she doesn't read in English, she just, she reads only in French. And so I read it to them. So we sat there with the book open and we would read and I would read and I would point to the, to the bubbles, like where I am in reading it. And then at some point we'd have to stop. Right. Because it was too late or we had to just, you know, and it was always this, it was so frustrating for them because obviously it was so easy to stop at the end of a page and they're like, no, no, you have to turn the page. No, we're shutting it down now and we'll start tomorrow. So it was a lot of fun. It was actually quite pleasant to read that to my kids. And also it's great to read a story. I mean, it's also great to read a story that you can read to your kids and you don't have to worry about what's going to be there. It almost seems impossible that that happens now. You know, your kids are watching something on Netflix and it's supposed to be for kids, and then you get a glimpse of it and you're like, what, what are they? What is this? You know, or the same. They get a book from the library and you're like, what is this monstrosity? Like, how, how is it that they're marketing this to, you know, 10 year olds?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1387.11,"end":1404.45,"speaker":"Jason Brubaker","text":"Yeah, yeah. And the themes do get pretty heavy and dark. But, you know, I'm curious how parents are going to take that. But so far no one's said anything really bad about it. I mean, that's the nature of reality though. Like, yeah, evil is evil."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1404.45,"end":1404.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1404.97,"end":1422.59,"speaker":"Jason Brubaker","text":"You know, you know, I'm really against the whole concept of kids stories being like, I want to go to this grocery store and get some bubble gum. That's my goal. Yay. I did it. You know, it's like, no, we got to show the. Show the evil and how you can resist it or whatever it is."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1423.47,"end":1455.87,"speaker":"Jonathan Pageau","text":"It's all. It's mostly about subversion is the problem in a lot of kids stories today. It's that it's not that they show evil and good or that they show something playing out is that they really try to show something upside down. Like they just. They just really want. Because it's also because of the desire to surprise and the desire to shock. And so. Well, if I'm going to write a book and I want to get attention, then I might as well write a book where vampires are the good guys, you know, and human beings are the bad guys. Because how am I going to get attention if I don't do something that is shocking and surprising?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1455.87,"end":1456.31,"speaker":"Jason Brubaker","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1456.31,"end":1466.67,"speaker":"Jonathan Pageau","text":"So it's almost like a. It's a strange, revolutionary process. Just because we need to get attention, we tend to want to do these upside down things."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1466.91,"end":1467.79,"speaker":"Jason Brubaker","text":"Yeah, yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1468.43,"end":1478.64,"speaker":"Jonathan Pageau","text":"We're in a good space now. We're in a good space now because everything is so upside down that all we need to do is tell real, real stories. And then, like, we're the ones are going to get attention."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1478.64,"end":1483.84,"speaker":"Jason Brubaker","text":"Exactly. Yeah. Yeah. Suddenly, wow, you're really thinking outside of the box."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1483.92,"end":1495.84,"speaker":"Jonathan Pageau","text":"Exactly. Here's a normal world and a normal story, like a normal hierarchy and a normal relationship between people. And it's like, wow, you're just so creative. I can't believe. How did you think of this?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1496.16,"end":1516.76,"speaker":"Jason Brubaker","text":"But you still, you know, but now it's. The trick is to mask that. To mask that it's not going to be. Go down that path. Go down the wrong path. I don't know how to say it. You know, you almost have to set it up so that people think that it's going to continue inverting it when really it doesn't. Well."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1518.92,"end":1558.22,"speaker":"Jonathan Pageau","text":"That'S, you know, I think, you know, that I'm working on a graphic novel with an artist court, and that's exactly the strategy that we had, my brother and I, when we wrote this, was create a story that at first glance, when you look at it in terms of the. Terms of the story, you think, oh, this is gonna be. Everything's gonna be upside down. And then just turn everything back in the story and just put everything back in place. So it's like, let's have the main character be like a dog headed monster, you know, who's a saint. So it's like this dog headed saint. Oh, that's gonna be subversive. But then it just, everything kind of turns back. I think it's possible to do it. I think it's possible to do it. Definitely."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1558.22,"end":1582.06,"speaker":"Jason Brubaker","text":"Yeah, that's kind of what I, I'm thinking. I actually want to talk to you about my next story sometime later. And it kind of has that same thing. I know when I launch it, it's going to be something that people are going to immediately go, oh, you're talking about this. Yeah, I'm on board. But then when they get to the end of the story, they'll be like, oh, you weren't raising the same flag as us."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1582.06,"end":1593.87,"speaker":"Jonathan Pageau","text":"Yeah, exactly. It wasn't the same flag. But I'm curious though, like who, what is your, what have you seen to be the people that are following you? Like who, what type of people are buying your books? Do you have a sense of it?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1595.31,"end":1677.17,"speaker":"Jason Brubaker","text":"It's a lot older people than I thought it would be. I've always kind of thought, well, it's comics, so it's gonna be kids. But there's a lot of my age group is like 30 to 40 year old men. You know, there's a lot of women in there too. But I realize it's just kind of me. It's like my demographic is me, you know, it's mainly the age, you know. And so I'm trying for my next books to try to hit a younger audience by making it a little bit easier for them to embrace. Not necessarily by making it more kiddie, you know, Cithra is already a, a pretty young story that everyone can embrace. But like for instance, my next, my next book is that I'm gonna be working on is this thing called Phobos. It's a spoof on the classic horror. And so I'm trying to make it more teen friendly, like having a cute girl on the COVID instead of, instead of a little girl, you know, obviously 40 year old guys are have little girls and so they're gonna be like, oh, it's a little girl, you know, Whereas a teenage boy is gonna be like, yeah, there's a cute girl on the COVID but I'll try not. I still, you know, my goal is not to make it like sexualized and all that stuff. You know, there's plenty of comics that do that for us. So."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1677.49,"end":1681.33,"speaker":"Jonathan Pageau","text":"Yeah, it's not, it's. Yeah, you just be drop one more drop in the ocean."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1682.21,"end":1683.97,"speaker":"Jason Brubaker","text":"Let's do the same thing everyone else is doing."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1684.05,"end":1697.7,"speaker":"Jonathan Pageau","text":"That's right. And so what about the like. So you're using, you're using Patreon, you're using crowdfunding mostly. Do you use Indiegogo? Which, which platform are you mostly using?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1697.94,"end":1786.51,"speaker":"Jason Brubaker","text":"I've used Kickstarter mostly. I used Indiegogo this last time for crowdfunding and it worked really well. I still am not sure which one to do going forward. So I like both Kickstarter and Indiegogo as far as Patreon. I do, I do like it. I just, I don't. I, I'm not convinced it's the business model I want to have mainly because my product is not necessarily me and my behind the scenes and all that stuff and my how to content my product is my books. And so I want the books to be the business model and to sell and to make enough money to support the business. I feel like if Apple were to say, hey, support us on Patreon so we can keep making computers, then there's something wrong with their computers, you know? Yeah, that's just how I think. If I wasn't, if I was selling myself as an artist who was given classes and teaching and stuff like that, then I think Patron would be perfect, you know. But the strategy I've been using with it that's been working is almost treating it like a Kickstarter campaign. So every so many months I'll have a, a pledge drive where people who are $5 and up will get a free copy of my next little floppy book. And it's only for patrons, but it's a physical reward. And so that drains a lot of the money from Patreon as well."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1786.51,"end":1790.19,"speaker":"Jonathan Pageau","text":"Right. It makes it almost like you're pre selling the books themselves."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1790.27,"end":1799.23,"speaker":"Jason Brubaker","text":"Yeah. And then eventually I will launch a Kickstarter for that next book and it will be like a hardcover graphic novel, you know, that the public will be able to consume."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1799.64,"end":1827.88,"speaker":"Jonathan Pageau","text":"And so this is, I guess, in terms of just ideas. So when you move from your, let's say crowdfunding to the market, how. Because now you're on your own. This is the biggest thing I've always wondered about self publishing is, you know, you have your real fan base and you're doing your crowdfunding. You get the book done through crowdfunding, then you put it out on the market. So then how do you get like, how do you get do that other step? Like, are you doing distribution yourself? Are you doing all that on your own?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1829.21,"end":1949.95,"speaker":"Jason Brubaker","text":"The first book I was. And I was shipping out books every day and sending boxes to Amazon and boxes to, you know, libraries. And it worked, it was successful, but it was just, it became a full time thing after work. And so eventually I realized like, this is, I'm gonna go crazy doing this and I don't have time to actually do the next book. So a friend of mine had a distributor he was using which was an independent distributor called SCB Distributors. And they just do like art books and little comics and graphic novels. And I pitched him my book. And because the first one won the Xeric Grant, which was an old award back in the day, before Kickstarter was big, it won this grant. And so they said, well, we like books that go through this grant and since you're selling so many of them, we'll pick you up. So I signed a contract with this distributor and they've been handling Amazon and all the bookstores and diamond, so they'll do the comic shops as well. And it's a full service distributor, so that's really helped. And they also have the doors into the bigger distributors so they can get into all the bigger bookstores. At least people can order the books through the bookstores, but it doesn't mean they're on the front shelves, you know. And so that's taken a big load off of my back. And then I've kind of pulled the plug on my online stores because that's just too much work to keep getting orders and fulfilling, you know. And you know, I know some people are like, what, what are you, what are you complaining about? This is great. You know, it's great to get orders, but it's just that fracturing that time that makes it so difficult for me at the end of the day and at the end of the year, I really wanted to get that next thing done because that's the biggest thing that sells. My last book is the new book."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1949.95,"end":1950.75,"speaker":"Jonathan Pageau","text":"Is the new book."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1953.87,"end":1987.99,"speaker":"Jason Brubaker","text":"So yeah, I found the best strategy for me is unload all the distribution on my distributor as much as I can. Don't sell anything online until I have a Kickstarter or an Indiegogo campaign and then I can fulfill it all at once, like one time a year. And maybe during a Black Friday type sale, I can do a sale. But then beyond that, this is lock myself in my room, work on the books, do the things that I need to do to get the actual project done."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1989.03,"end":1996.88,"speaker":"Jonathan Pageau","text":"So I'm curious about, because you said that your stories, you don't necessarily know the ending when you start Is that what you mentioned?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":1999.44,"end":2031.91,"speaker":"Jason Brubaker","text":"I think I do have a general idea of the ending. I just don't know how I'm going to do it. I don't know how those pages are gonna look or maybe how that last character will look like the character in Cithra at the end, the reveal that was. That came to me right when I was drawing those pages. I didn't know. I didn't even know. I don't want to give it away for people. There's a lot of things I didn't know until I got to those pages."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2032.07,"end":2032.63,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2033.19,"end":2077.21,"speaker":"Jason Brubaker","text":"For Cithra. And so. But I did have that, like a. Like a bullet point list kind of written out. Like, okay, now there's the confrontation with this character and blah, blah, blah. But I didn't realize it would unfold the way it did and that it would be that I would design it that way. And so there's a lot of unanswered questions. And I think I like that because it keeps me excited about it in the process. You know, when I discovered. I'm like, oh, yes, I want to draw that now. You know, like, let's get this part going. And I'm obsessed over it. But if I thought about it two years ago then and now it's time to execute those final pages that I've already figured out all the details of, then it's suddenly just the job. It's like just."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2077.37,"end":2078.81,"speaker":"Jonathan Pageau","text":"Just kind of have to put it out there."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2079.05,"end":2079.45,"speaker":"Jason Brubaker","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2079.45,"end":2092.89,"speaker":"Jonathan Pageau","text":"And so do you think. Do you. When you're thinking about your stories or when you're thinking about your. Your thinking about your process, do you think imagistically or is it. Do you think of story? Like, in a linear man, you see images first."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2093.53,"end":2162.52,"speaker":"Jason Brubaker","text":"Yeah, it's. It usually starts out with. If I can just. If there's a mood that I'm feeling for a certain subject and it kind of. There's an image associated with it, then I really want to try to figure out how to preserve that image with that mood that I. That feeling that I felt when I was thinking about it, and transcribing that into a story somehow is kind of the most critical thing for my storytelling. And if I can string together enough of these and convey those moods and those feelings and emotions, and then I feel like it's working. You know, my newest story, the one I was going to start next year, I don't have any images for it. I've actually started writing a script, and so it's very backwards compared to where I've usually Worked, but I think I need to for that story because it's very complex and all the pieces need to fall into place. So it doesn't mean I have to work that way. It's just. I think I choose the method I'm gonna work based on the enjoyment in the process. Yeah. So, you know, like."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2162.6,"end":2205.04,"speaker":"Jonathan Pageau","text":"Yeah, I can understand because like Citra really feels like this bubbling. Like the whole thing is bubbling in terms of moods and colors and. And you can just feel the joy of exploring, you know, even just these, these moments where you just see the sand, you know, in the desert kind of coming up. And, and there's this whole. So there really is this exploration of mood and through color and everything. And I think that, that like you said, a story wouldn't have to be that way. You could tell a different type of story. But in that context, especially with the character, that little girl, it almost feels like that. Like you're a 10 year old girl again. You know, you're. Again, I'm just never a 10 year old girl."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2206.16,"end":2208.48,"speaker":"Jason Brubaker","text":"Turn things upside down. Yeah, Exactly."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2208.56,"end":2218.76,"speaker":"Jonathan Pageau","text":"You're a 10 year old again and. And it's like you're just. You're discovering you're on this adventure with her. And the actual drawings make you feel like you're on this adventure with her."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2218.76,"end":2219.24,"speaker":"Jason Brubaker","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2219.24,"end":2233.08,"speaker":"Jonathan Pageau","text":"Not just doesn't feel as much from the outside where you're just kind of looking in the story that's happening, the setup of Mood and these color panels that are just kind of streaks of color kind of bring you in as if you're experiencing it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2233.56,"end":2299.23,"speaker":"Jason Brubaker","text":"Yeah, yeah. And that's kind of what I wanted. I have trouble doing like the history stories where it's. Let's just imitate what's been done and try to get it right. Because it's. Because I really like to have these worlds that are not really our world. It's kind of like a parallel world because that way you don't know what to expect from page to page. And so you're always wondering, okay, is there going to be a spaceship in the next scene? I don't know. Is that part of this world or not? I don't know. And so I really, I just love those kind of stories. And I think that's how all of my stories are like, I have, you know, another three stories that I've have in line to do next. And they're all the same, you know, none of them are just like, okay, let's do a history period piece now. You know, I do like reading period pieces, but as far as investing the time and creating it, it's like it sucks a little bit of the creativity out of it if I'm just imitating what's been what. What history was like, you know."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2300.59,"end":2315.63,"speaker":"Jonathan Pageau","text":"And so tell me a little bit about. Cause I don't know anything about your own. Cause I know you're. You're a Christian. It seems like you're a Christian. What is your, like, what is your journey like? Where, where are you in that sense? Like I don't. Are you protestant? Are you Catholic? I have no idea. I have no idea."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2316.75,"end":2321.55,"speaker":"Jason Brubaker","text":"Well, we go to a Nazarene church, so I consider myself a non denominational."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2321.55,"end":2322.19,"speaker":"Jonathan Pageau","text":"Right. Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2323.2,"end":2337.28,"speaker":"Jason Brubaker","text":"My parents were missionaries in Africa and Switzerland. So when I was like 2 to 5, we were there. So I knew French, but I don't know it anymore. I know voitu. Am I saying it right?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2337.28,"end":2339.76,"speaker":"Jonathan Pageau","text":"No, not at all. You're not saying it right at all."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2341.28,"end":2388.08,"speaker":"Jason Brubaker","text":"So that's the only word I remember. I know a couple, but I'm. Anyway, so yeah, they were missionaries and then when we came back when I was five and I just love drawing ever since I was a kid. So that was my goal, was just to draw. Started my career when I was 20, went to Hollywood, worked in storyboards and concept designs and then transitioned into animation. About a 20 year career. And I just never really felt fulfilled with. Wasn't until I kind of went back to my parents house and saw all these old drawings that I made which were all stories. Surprisingly all my little stick figures were stories. Nothing was a drawing just for the sake of drawing."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2388.08,"end":2388.48,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2388.8,"end":2482.42,"speaker":"Jason Brubaker","text":"And so I realized that I want to tell stories with drawing. That's what inspired me to draw was to the drawing should accompany a story. And so I started kind of at the age of 30 trying to just do my own stories again. And that's when started kind of enjoying art again, you know. And so I just started making animation and started working on graphic novels on the side of work. And then, then I eventually moved back here because I just felt like LA was. I was beautifying the wrong message. And it just became really clear to me. And you know, it came down to this point where I woke up and I don't know if it was just a dream or whatever, but I woke up and I. And I hear over a repeating in my head come out of her my people. You know that line from Revelation before the destroyed Babylon of Hollywood. And you know, at one point I was just like, you know, I've always felt like my art and My storytelling is, it's a gift from God to do something with it, you know, and I, I didn't ever know what it was, but I always knew there would be something that I could do with it, you know, and, but I just never felt like I was doing that. I was, I was being trained in art in my career, but I was always just, yeah. Beautifying the, the wrong message."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2482.42,"end":2482.78,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2482.78,"end":2506.02,"speaker":"Jason Brubaker","text":"Making something beautiful that I don't believe in at all. And so, so it really bothered me and just got to where it's like I don't want to do art anymore if that's what it's going to be about. Just, you know, I don't feel like that's what I should do with my gifts. And so that kind of drove me to move out of la. I moved back home to Idaho, convinced my wife of it. We made a one year plan and everything worked out and she loves it here now."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2506.02,"end":2506.78,"speaker":"Jonathan Pageau","text":"Okay, great."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2507.02,"end":2517.46,"speaker":"Jason Brubaker","text":"And it's relaxing and I'm actually getting stuff done and you know, I've been able to pay the bills because it's a lot cheaper here than it is right in la."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2517.46,"end":2518.06,"speaker":"Jonathan Pageau","text":"Imagine."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2519.47,"end":2579.4,"speaker":"Jason Brubaker","text":"And yeah, so I mean, I kind of have the same, I have the same faith all my life. You know, I can't really name a point when I feel like I became a Christian because I've just always grown up in that environment. I've always believed and it's just more of a wrestling with how I believe and if I'm living my life in a way that's, that's, you know, I'll hear well done, good and faithful servant. So I guess, and that's kind of the reason I do what I'm doing is it's like I just want to make stories that, that mean something to, to me and to God and you know, that will make him happy, you know, I'm saying and that, that when I'm gone, like it can, it can keep, can keep reflecting some sort of light into the world, you know? Yeah. So anyway, so I'm curious about what."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2579.4,"end":2647.04,"speaker":"Jonathan Pageau","text":"You'Re like, what your inspirations are or at least like what. Because one of the things that, I mean, I'm putting what you're saying through the lens of my own experience, which is that as when I grew up, I grew up in the Protestant church is more not Denon dumb. It was a Baptist church, kind of conservative Baptist. And I always felt, especially when I got a little older, when I was young, I didn't feel it as much as maybe very. It was underneath the surface. But in my 20s, I started to really feel like there was a tension between me making visual art and wanting to use visual symbolism and use visual representations and this kind of Baptist tradition that I was part of. And so it was like this tension that I struggled to. To get. To get through because there weren't that many inspirations from, let's say, the Christian tradition that I could pull from. And I. And I was like, so where am I pulling my. My influences from? And I was. And it was this, like, it was a. It was a difficult time for me, at least, to try to figure all that out. So I don't know if that's something that you've experienced or that you've kind of had to think about or deal with."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2647.52,"end":2801.84,"speaker":"Jason Brubaker","text":"Yeah, I never, you know, when I moved to LA and when I was pursuing, like, getting the career started, my parents were really encouraging. And so that kind of gave me the feeling that, okay, you know, God's got my back, if my parents have my back, then, you know, then there's some good in this. But I never did see the connection between God and art. And it was always just make money and make a living and make a living and do, you know, do the things that sell and stuff. And there was moments in the career when I'd be like, I can't. I'm sorry, I'm not going to draw that. You know, I just thought, that's just not me. And so, you know, I wouldn't get the job or I'd get fired from the job. There was one job where this guy was like, make it as satanic as you can. Like, it needs to be satanic. And I was trying and trying and finally fired me. He's like, I'm sorry, you just can't do it. I'm like, I don't know. I don't know how to draw stuff that looks really satanic. So anyway, you know, I'm drawing chains and stuff, but it still has, like, a cartoony look. Anyway, totally lost my train of thought there. But, yeah, I remember having conversations with other artisans just saying, well, you know, their artists just aren't. They don't have. They don't have, like. I don't know what I said exactly. Like, they don't have faith. Like, they're not thinking about things. And they're like this artist, like, well, yeah, they're, they're, they're the more faithful ones. I'm like, what? You know, so it was just kind of a strange. Like, what kind of faith are they Are the artists thinking about. Are they kind of making up a faith? You know, is it just about feeling spiritual? You know, so. So anyway, I was always kind of confused that just, like, where did my art fit into this? And I think it was when I was in my 30s. That's when I really started realizing, like. Like there, you know, you can beautify. You know, we can beautify things with our art, and we can beautify the wrong things. And I don't want to be a contributor to that anymore. And so I really felt like God put me there to train me and to give me that ability to tell stories, to learn from all these directors, to learn deadlines. And then he said, okay, now it's time to leave, and now it's time to do something else. You know, now that you've been trained and you can beautify anything that's been given to you, start beautifying this. Yeah, you know?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2802.96,"end":2813,"speaker":"Jonathan Pageau","text":"Yeah. Makes sense. And so what are your. What do you feel like, are your influences? Have you identified some of the things that you. That really kind of, when you were younger, kind of got you excited?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2813.48,"end":2823.32,"speaker":"Jason Brubaker","text":"Well, I loved the newspaper comics like Garfield, the Far side and Calvin and Hobbes, so that was kind of what I wanted to do at first."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2823.32,"end":2825.96,"speaker":"Jonathan Pageau","text":"Yeah, Calvin and Hobbes. I can kind of see that a little bit in your work."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2825.96,"end":2872.06,"speaker":"Jason Brubaker","text":"Yeah, especially with Citra, because I used inks like. Like he did. So that was a big influence. And then. And then I started getting into Japanese animation kind of in my teen years, and that's when I moved to la. So things like Akira, you know, the animation and all the Miyazaki stuff, all the, like, Spirited Away, like, really influenced me when I was in Hollywood. And the storytelling that I wanted to do, I just wanted to do a Christian or a Western version of a Miyazaki film, you know, because it's very much rooted in what he believes, and yet it's so anyone can absorb it, which is so neat about it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2873.58,"end":2903.32,"speaker":"Jonathan Pageau","text":"No, I think that your approach is great. And I think that looking at Miyazaki as a way to. Because one of the problems, and I'm sure you've had this same experience as I have, is that a lot of the problems with Christian art and Christian storytelling is that it's so shallow. It's just. Yeah, it's so message driven and it's. And it's so shallow that it doesn't resonate with anybody or it resonates with people who are so, like, that's all they'll read. And so they won't read anything really good. They won't have the problem of having to hear them."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2903.88,"end":2956.5,"speaker":"Jason Brubaker","text":"Yeah, I have a real big problem with a lot of Christian art and Christian music and stuff. It's like, to me, the ones that really rise up are the ones who are not following the mainstream paths that are done. And they're just. They're brilliant artists. Like, as far as musicians go, there's this guy named Josh Garrels who is just an independent musician, and his. He. He does music, but. And it's not really labeled Christian, but it's definitely Christian. And it's some of the most amazing music I've heard, you know, and it's. So anyway, there's that kind of thing. And. Yeah, you know, it's like, I know people's hearts are in the right place, but it's kind of like that. It's like that zeal without knowledge. Like, you got to have the knowledge of the art and of the craft and of storytelling to really be able to tell the stories you want to tell in a meaningful way that will impact people."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":2956.82,"end":3023.86,"speaker":"Jonathan Pageau","text":"Yeah. You know, and the strange thing is, we have the best stories, like the Bible stories. They're amazing, you know, in terms of how profound the story of Christ is. You can never reach the end of it. You know, you always. Every time I read the gospel, I'm always surprised. Even sometimes I'm like, wait, this detail, let's say it's like, how is it that I've read this story my whole life and then this one detail I've never noticed? And so, yeah, we have the best story. The thing is that we have to be able to see the Bible stories as stories again without feeling threatened by that, without us thinking that the fact that these are stories is somehow threatening to our faith. And that's what a lot of the kind of American evangelical Christianity has struggle with, which is like, either it's a literal telling of something in a. I don't even know how. I can't. I'm really struggling even now to think that way anymore. But it's like this is just a description of something that happened, and it doesn't actually have a story structure. Like, it does have a story structure, and so does your life."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3024.34,"end":3024.82,"speaker":"Jason Brubaker","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3024.82,"end":3030.24,"speaker":"Jonathan Pageau","text":"Like, so does everything you go through all also has a story structure. You know, your day has a story structure."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3030.24,"end":3040.24,"speaker":"Jason Brubaker","text":"If it doesn't have a story structure, then it's a miracle that it was written the way it was written, because it's so, so much more dense than any stories that can Be written today."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3040.24,"end":3055.68,"speaker":"Jonathan Pageau","text":"Yeah. And it's also. Who would care? Like, no one is interested in, you know, me. I don't know, like, describing me tying my shoe for five pages. It's like, no one is interested in that unless I can make it into a story, which is not impossible. But. Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3057.76,"end":3072.88,"speaker":"Jason Brubaker","text":"Yeah. So, yeah. Yeah. I kind of worry that after so many stories that I've written, people be like, this is kind of the same story as Remind. Oh, this is kind of the same story as Citra. Well, this is kind of the same story as that."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3072.88,"end":3079.6,"speaker":"Jonathan Pageau","text":"Yeah. You know what? I don't want to be condescending to your readers, but it's all the same story, so don't worry about it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3079.76,"end":3082.68,"speaker":"Jason Brubaker","text":"Yeah, that's what it comes down to, really. Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3082.68,"end":3106.07,"speaker":"Jonathan Pageau","text":"I mean, you can see all the stories have a. Have a basic pattern. You're not going to be worried so much about telling the same story. You're just going to be worried about telling the same story in a way that will be able to get. Get people's attention and get them excited about it. But it's not going to be a different story. It's just going to have a different. Different clothing. You could say something like that."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3106.15,"end":3112.88,"speaker":"Jason Brubaker","text":"Yeah. Yeah. So I'm curious about your graphic novel. When are you gonna have that thing out?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3112.88,"end":3187.16,"speaker":"Jonathan Pageau","text":"Well, we're in the same situation you were when you were working at DreamWorks, which is that Cord, he just had a baby a few months ago, and he's doing this in his spare time. He's a graphic designer, so he tries to get up early and get at least an hour out, you know, an hour in the morning, to be able to illustrate it. We finished. We. It's gonna be about five. Four or five books, I think we're hoping four books. There might be more and more. And we've done the thumbnailing of the first book is completely thumbnailed, and now he's drawing it out. And so I think he's inked about 15, 16 pages. And the book is. I think it's like 120. So it's gonna be. So it's still gonna be a while before he gets. And he's really putting the effort in. For those who have seen some of the art, he's not. He's really wanting to make it beautiful and take his time, and I'm fine with that. Like, I'd rather it be a quality product. And we put it out. And so what we're hoping is that, is that we can put out the first book and then There'll be enough excitement that we can crowdfund the second book, and then he can quit his job and just do this full time. Like, if we could do that, that would be amazing because then we could just speed it up and start putting the books out once a year or something, or maybe less if we can."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3187.56,"end":3193.33,"speaker":"Jason Brubaker","text":"Could you crowdfund? Once you get enough pages done, could you crowdfund that first book and then get enough money to."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3193.81,"end":3215.81,"speaker":"Jonathan Pageau","text":"I think I was hoping to, but, I mean, Cord has a family. He's got. You know, it's like, I think he doesn't want to risk everything right now, and I can understand that. If I was in a situation, I might think the same. Like, he doesn't want to risk everything. So we're probably going to wait until it's almost done before we start the crowdfunding for the evening."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3216.61,"end":3217.37,"speaker":"Jason Brubaker","text":"Got it. Okay."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3217.37,"end":3221.49,"speaker":"Jonathan Pageau","text":"But it looks. I mean, I don't know if you've seen some of the images, but I'm really excited. I think it looks great."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3222.06,"end":3251.87,"speaker":"Jason Brubaker","text":"Yeah, I've. I was actually, you know, he was. He submitted it to my. To my art review board forum, Reddit thing when I was doing that, and. And the pages looked really good, and I was like, huh, interesting. And then I saw a lecture you did, and you showed the same pages. I was like, wait, what? So then I looked again. It's really strong stuff. It's not. It doesn't look amateur at all. It looks really strong, really well done, and it's something that I would definitely want to consume."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3252.59,"end":3314.05,"speaker":"Jonathan Pageau","text":"And the story, I mean, we worked. My brother and I worked on that story for years, like, four years. We wrote it as a screenplay, and we hired even a reviewer to kind of go over each draft to get it really set up. And so I feel like the story really is tight. Like, I'm not worried about the story, and so I'm excited to see how it's going to do, because in a way, when we wrote it, you know, in 2010, it's almost like 10 years ago. We finished it in 2009, I think even it was almost as if the world wasn't ready for this story. The references were so weird. You know, it was like this St. Christopher character with a dog head and these, like, a pillar of saints and all these, like, warrior saints and giants and dragons, and it was just so strange. But now it's like, I've been talking about this stuff for, like, four years now, and so by the time it's out, I think there'll be enough people who will kind of at least understand the references for them to get excited about it, I hope."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3314.61,"end":3326.57,"speaker":"Jason Brubaker","text":"Yeah, well, that's cool. I didn't realize it was about the St. Christopher and the dog head. I remember you talking about that in one of your videos. And I looked into that because I was like, that would make an interesting comic, man."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3326.57,"end":3327.89,"speaker":"Jonathan Pageau","text":"Don't. Don't go there."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3328.23,"end":3329.35,"speaker":"Jason Brubaker","text":"So I won't go there now."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3329.67,"end":3330.59,"speaker":"Jonathan Pageau","text":"Well, you can try."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3330.59,"end":3331.71,"speaker":"Jason Brubaker","text":"I'm glad I found that out."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3331.71,"end":3492.24,"speaker":"Jonathan Pageau","text":"Exactly. Well, I bet it's funny because that I had the same experience. I found out about St. Christopher for, like 2002, I think, or 2001. And there was a book called. I forget what it was called, the Myth of the Dogman, written by some scholar and really subversive book, but a lot of good information in it. And I was reading and I was like, man, why isn't this not. Why has no one made a character out of this story? And so I. Even the first time I thought about the story, I actually thought about it as a joke, as a comic book. At first I thought about it as a comic book, but as a joke. So I was like, oh, so we could have St. Christopher and St. George, like the two monster killers, the monster and the monster killer fighting together. And it was kind of like making fun of almost like these movies that make fun of Christianity. I kind of thought about it that way. And then after a while I'm like, no, I could flip this. Like, I could turn it back so that it becomes actually something that is showing truth. But it has a. Has an. The imagery seems subversive at first glance, and so just slowly working on the story forever. But it has an epic background. Like it. The idea was to try to. I don't know if you read it was Neil Gaiman's Season of Myths was part of my influence for writing this. He wrote this graphic novel, Sandman graphic novel that had. He used Milton's paradise as the basic structure for his world building. And so he created this world where there's like, the. Satan is in hell and you have this hierarchy of angels. And then in this hierarchy of angels, you also have all the pagan gods and everything. Obviously, he's a, you know, whatever. He's Neil Gaiman. And then. And then. And so it's like he tells this story that's inside the story of the Paradise Lost, and he has Cain and Abel as characters, and then he has the devil. The devil decides that he's quitting his job and he's giving. He's like. He's giving hell over to whoever wants the keys to it, and he leaves. So that's the basic of the base of the story. But I thought, man, Sneil Gaiman is so subversive, but he can write. He's using a Christian structure, which is Paradise Lost, which is based on Dante's structure, and he's able to tell a story inside that structure. And I thought, can you imagine if we could do that? But it wouldn't be to, like. It wouldn't be to upheave everything, but it would actually be to kind of show the power of this structure. And I'm like, okay, all right, Gaiman, I'm taking you on. I'm gonna try to outdo you here. I. Probably not. He's an amazing storyteller, but at least that was my impetus. Try to outdo Neil Gaiman."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3492.72,"end":3504.56,"speaker":"Jason Brubaker","text":"Yeah, I saw the Amazon version of his Good Omens where it's kind of a similar thing where he takes, you know, the biblical structure, but he really just."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3504.88,"end":3530.01,"speaker":"Jonathan Pageau","text":"Yeah, he just tweaks it, twists it, tweaks it, does everything. Yeah, No, I agree. I agree that I watched the. I had read Good Omens because he wrote it with Terry Pratchett. And then I. I watched a series, too, and I had the same feeling again. I'm like, oh, man. It's like there's so much of it that's interesting, and there's so much of it that is just obviously just being subversive to be subversive. And so it's like, why can't. Why don't we have storytellers like that?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3530.41,"end":3547.22,"speaker":"Jason Brubaker","text":"Yeah, exactly. I mean, oh, my goodness, it would be so amazing, the kind of stuff that could come out, because it's not like you have to destroy it to make it good. You know, there's so much there. Like, if he would have done his research a little bit more into the roots of all this stuff, it could have been even better."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3547.78,"end":3556.66,"speaker":"Jonathan Pageau","text":"Yeah, but he. I mean, he is who he is, and he represents what he represents. It's like he's not. He's not. You know, we had a bunch of people."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3556.66,"end":3559.38,"speaker":"Jason Brubaker","text":"It would be better to me, but it probably wouldn't be better to his audience."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3559.54,"end":3660.45,"speaker":"Jonathan Pageau","text":"It's like, this is the thing that happened, and this is the thing that happened. And I think that we need to be. The answer to is that in the 60s, 70s, and 80s, let's say, even maybe in the 90s, the people who understood symbolism were the revolutionary types. Like, they were the ones who understood symbolism. And the Christians and the More traditionally minded people, they didn't understand symbolism, and so they didn't have any of the tools, you know. And so in the comics world, like, if you have. You have the British Invasion. Yeah. Alan Moore and Gaiman and what's his name, the other one. Anyways, you have these guys coming in and they had such a grasp of symbolic structure, but they were all chaos magicians. They were all. They were all like, you know, they're all witches and they were. You know, they're all. That's what they were. And they were. They were putting it out there. But their grasp of structure was so powerful that their stories ended up being convincing. And so it's like, yeah, man, we need to flip that back. Just take it back. Because the imagery is ours anyways. Like, the imagery is. It's this. You know, Alan Moore wrote Constantine and it's. He's using a Christian structure. He's just so twisted. You know, you have Hellboy, you have all these stories that use. That are in a Christian mythological structure. But Christians have. Have been so wary of seeing their worldview as a mythic structure that they don't. They don't dare go there. Like, they don't dare do it. It was like, no, let's jump in, let's do it. Like, this is the best mythological structure, you know, and so let's just use it and anyways, we'll see what happens."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3660.53,"end":3696.96,"speaker":"Jason Brubaker","text":"So it kind of reminds me. It makes me think that my story, Phobos, that I'm working on this next year, it's kind of a reverse of that. It's like I'm trying to take all the classic horror characters, which I've always looked at as an escape from God. Like, these stories are all presented so that you can. So that people can not have to think about if God was present in that universe. Right. At least that's one of the reasons. You know, Harry Potter. Where's God in that? No one. No one knows. But all these stories are kind of an escape mechanism."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3696.96,"end":3697.44,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3698.56,"end":3758.34,"speaker":"Jason Brubaker","text":"And so. But I was always fascinated with them, with them growing up. So. So I made this story back when I was a teenager, but I infused God into it. Like Frankenstein actually meets God. He's having nightmares when he sleeps, and he's experiencing the afterlives of all the characters that he's made up of. And so he eventually meets God and Peter and he gets his own soul. And that's what I wrote when I was a teenager. But I realized when I was rewriting it now that I want to Take all these classic horror characters and stories and say, okay, what if God was in the picture here? How would that. How would that story go? You know, and the general theme is every knee shall bow, you know, meaning it doesn't kind of really matter what you are, you know, you can't escape because you're not in the category. Yeah, but anyway, it's. That's the."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3758.66,"end":3788.14,"speaker":"Jonathan Pageau","text":"No, it's a great idea. In terms of monster stories. Monster stories have an underlying. Even horror movies, a lot of horror movies actually have an underlying traditional structure. Like they have an underlying. Most horror movies are actually very conservative. If, you know, if you. If you look past the. The gore and the killing, you know, and they. They kind of deconstruct that in the recent horror movies where they show that a lot of the stories always have a kind of break of morality. Like you."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3788.14,"end":3788.38,"speaker":"Jason Brubaker","text":"You."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3788.38,"end":3837.64,"speaker":"Jonathan Pageau","text":"They break. Someone breaks a taboo, and then the. The killings actually end up being a. A retribution for that break of the taboo, which gets resolved in the end by like a virgin or whatever, some kind of character that's innocent. And so they're in the horror structure. There's something that is. That is actually close to a kind of fall redemption story. It's just that it's out of whack and obviously it's appealing to all our lower. All our. All our lower passions and everything. And so I think there definitely could be a way to knowing it instead of deconstructing it, just flipping it back, you know, not like the Scream movies would just want to show how smart they are and how they can. They can figure it out, but actually just dive into that structure and make it as potent as possible. Into a redemption or a. Like, into a redemption story."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3838.12,"end":3838.6,"speaker":"Jason Brubaker","text":"Yeah."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3839.08,"end":3852.29,"speaker":"Jonathan Pageau","text":"I'm telling the one story that has to be written that no one has written yet. And I'm giving this to anybody who wants to do it, because I don't have time to do. It is a story about a zombie that wakes up. That story has to happen. No one seems to be able to."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3852.29,"end":3856.49,"speaker":"Jason Brubaker","text":"Write that story that wakes up and is not a zombie anymore."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3856.49,"end":3866.61,"speaker":"Jonathan Pageau","text":"That he's. That he's. That he's a zombie, but that all of a sudden he becomes self conscious. And then what does that mean? Like, what would happen if a zombie became self conscious?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3866.69,"end":3869.53,"speaker":"Jason Brubaker","text":"Because that. That would be the redemption story right there."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3869.53,"end":3886.57,"speaker":"Jonathan Pageau","text":"Yeah, I think it would be the redemption story. It would be like. It would be like a flip, you know, and so there's a little bit of that in. What's that. What's This. I forget the name of the story, so people are gonna kill me for not remembering the story. The one they made a movie with Will Smith about. What's the name of that story?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3887.05,"end":3887.93,"speaker":"Jason Brubaker","text":"I am Legend."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3887.93,"end":3890.41,"speaker":"Jonathan Pageau","text":"Yeah, I am Legend. In the original novels, there's a little."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3890.41,"end":3892.01,"speaker":"Jason Brubaker","text":"Bit of that where the novel's good."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3892.09,"end":3902.65,"speaker":"Jonathan Pageau","text":"Where they. Everything kind of missed it. They missed the whole point of the novel. I know. Which is a flip. There's a flip. You know? I know. It's so weird. I watched a movie and I'm like, what?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3902.65,"end":3903.05,"speaker":"Jason Brubaker","text":"Really?"}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3903.05,"end":3927.75,"speaker":"Jonathan Pageau","text":"What is this even about? I don't even know what it's about. It's like, it's supposed to be a flip where, you know, they become soc. You become the monster. It's like, that's what it's supposed to be anyways. But. But there was a little bit of that where there's like an awakening of this. Of these zombie creatures that awake and become an actually self organized society. But I think a zombie story of the zombie that wakes up. I think that would be great. Anyways, that's my. Interesting."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3928.55,"end":3940.55,"speaker":"Jason Brubaker","text":"Maybe I can work that into Phobos. I don't have any zombies in there. And it's only because, oh, I do. But it's saved for later as an afterthought because there's so many zombie things. I just."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3940.72,"end":3946.76,"speaker":"Jonathan Pageau","text":"I'm like, yeah, but that's the one story, the one zombie story that no one's told. And anyways, if you do it."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3946.76,"end":3950.56,"speaker":"Jason Brubaker","text":"Yeah, I have a zombie story that I think no one's told off to tell you about later."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3950.56,"end":3950.92,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3950.92,"end":3952.32,"speaker":"Jason Brubaker","text":"Yeah, Private."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3952.48,"end":3952.96,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3952.96,"end":3962.28,"speaker":"Jason Brubaker","text":"There is something that I just. I don't know how to present it to the public yet. So maybe that will save for a private conversation."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3962.28,"end":3979.59,"speaker":"Jonathan Pageau","text":"All right, all right, all right. Well, now everybody knows that we're going to be having private conversations about the future of Christian storytelling. All right. We've been going for a while, Jason. I think we should probably call it quits for this conversation. But I. It's been a lot of fun and I. And I'm hoping we can. We can do it again."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3980.15,"end":3982.71,"speaker":"Jason Brubaker","text":"Yeah, definitely. I really appreciate you having me on your show."}
{"episode_id":"SW - #090 - 2020-01-25 - Jason Brubaker - Symbolism in Visual Narrative","start":3983.27,"end":4062.36,"speaker":"Jonathan Pageau","text":"I'm really happy. I really like your work and I'll point everybody to it. I'll put links to your webpage and to your different projects and so everybody. Yeah, Jason, thanks for coming on and I will talk to everybody else very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
