{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":0.72,"end":12.64,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the 13th episode of the Symbolic World podcast. In this episode, I am playing back the first discussion I had on my channel with my brother Matthieu."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":14.4,"end":15.12,"speaker":"Jonathan Pageau","text":"Matthieu."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":15.12,"end":44.3,"speaker":"Jonathan Pageau","text":"As we were discussing what you will hear, he was writing a book, and his book has been published since then. The name of the book is the Language of Creation by Mathieu Pageau. And so you can look that up on Amazon. It is very much worth reading as it presents powerful synthesis of symbolic ideas and symbolic structure. Reading the book of Genesis in the Bible, but in a manner which applies to reality as a whole. And so this was the first discussion."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":44.3,"end":45.1,"speaker":"Jonathan Pageau","text":"I had on the channel."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":45.1,"end":69.68,"speaker":"Jonathan Pageau","text":"And we're looking at helping the modern person understand what symbolism is and what function it can have for us today. And so enjoy. This is Jonathan Peugeot."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":70.08,"end":71.76,"speaker":"Matthieu Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":82.24,"end":144.79,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I'd like to introduce you to my brother Matthew, and some of you might have seen Matthew. We did a conversation with Jordan Peterson, all three of us, discussing the story of Abraham. And so Matthew and I, we're used to speaking. We're used to talking about symbolism together. We've been talking about it for. Since we were teenagers. And so we decided that we're going to try to have this conversation online to talk about what symbolism is, you know, what are the categories and what are the criteria for a proper symbolic interpretation of a story. But hopefully we'll be able to do it because we have our own shortcuts and our own way of talking about things. So we're going to make a big effort to be comprehensible to everybody. So here we go. Now you even have to use your name in English. I'm used to speaking to you in French. That's not easy. All right, so I'll call you Mathieu, because I can't say Matthieu."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":144.79,"end":145.79,"speaker":"Matthieu Pageau","text":"That's not possible."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":147.84,"end":190.78,"speaker":"Jonathan Pageau","text":"All right, so Matir. One of the things that. One of the things I want to start with is I've been getting a lot of the comments that I'm getting about symbolism, and these comments keep coming back. And I tried to address it a little bit in my video about symbolic versus literal interpretation, but people seem to really want to oppose those two things. They really want to oppose this idea of, like, a factual, literal world and then a world of meaning. But for both of us, in our discussions, it seems like that it's just not how it works. So maybe you can start by giving us your vision of that and we can start the discussion that way."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":191.98,"end":312.39,"speaker":"Matthieu Pageau","text":"Yeah, well, I think that's one of the major problems with people in symbolism today is that we understand the world in a completely different way as it used to be understood. And it's such a fundamental difference that trying to understand the world in a truly symbolic way requires such a transformation of your mind, of your presuppositions. It's a really hard pill to swallow to be able to understand symbolism in a way that won't force you to make a distinction between meaning and fact. So if you're used to thinking in a materialistic way, which we all are, everyone's a materialist today, in my opinion, because science has completely dominated everything. So it's helped us to understand a lot of things, but it's also hindered us to understand other things in completely different field of things. So basically, if we want to recapture what symbolism really is, we have to go way back and think of the universe in completely different terms as we do today. So basically, the way we understand things today is we interpret everything in terms of matter and energy, basically, and structure. So that's how everything's understood. The only causality left today is a sort of mechanical causality where there's a transfer of energy or transfer of matter. So it's a mechanistic way of understanding reality. So if you understand reality like that, you can't really understand symbolism the way it was, the way it was understood in the past, and the way it's described in the Bible."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":314.07,"end":359.34,"speaker":"Jonathan Pageau","text":"I mean, I think one of the ways that I've been trying to help people to see symbolism again is to try to get people to dive back in their experience, to kind of go back to the lived experience, let's say. So the way that you encounter a tree is not the same. You don't encounter a tree in the same category that a scientist would analyze a tree or the way you encounter, you know, the heavens or the way you encounter earth. They're not the same categories. And so trying to get people to go back to categories, and the craziest thing is that those, the symbolic categories are really. They're there at the base of our. Our existence, and they're still there even."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":359.34,"end":360.66,"speaker":"Matthieu Pageau","text":"If they're still there today."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":360.74,"end":376.38,"speaker":"Jonathan Pageau","text":"Right? Even if we pretend that they're not like, you know, categories like high and low, you know, you know, even. Even things like hot and cold, like hot and cold are not scientific categories. They're categories of experience. And so these. These basic categories of experience there."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":376.38,"end":392.53,"speaker":"Matthieu Pageau","text":"There are still hierarchies. They're still. And they still have exactly the same meaning. As they used to. It's all still there, but we don't interpret it in the right way to make it significant enough to pay attention to it."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":392.53,"end":432.87,"speaker":"Jonathan Pageau","text":"Yeah. One of the ways that you've talked about, that you talked about to me before and you've even written about in some of your texts is this idea of at least for a moment, at least for, let's say, the experience, to try to get a sense of. Of how things come together and have meaning is to, To. For. For. For a specific moment to shut down. To try to shut down the, The. Let's say the, The. The quantitative, you know, scientific way of approaching the world, you know, so, so I mean, and it's the craziest thing is it's not that. That hard to do. I remember because we."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":433.99,"end":437.43,"speaker":"Matthieu Pageau","text":"We still think in the other way a lot of. In a lot of ways."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":437.72,"end":470.53,"speaker":"Jonathan Pageau","text":"I remember hearing recently a podcast with Sam Harrison, and he was talking about. He said something like, when you drink water, it doesn't matter what you think. You're always drinking H2O. And I'm like, that's not true. No one drinks H2O. We drink wet, we drink cold, we drink warm, we drink flavor, refreshing. That has nothing to do with. I mean, it has not completely nothing to do, but the category of. Of two, you know, hydrogen and is like, that's not the same as the categories of experience."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":471.09,"end":500.29,"speaker":"Matthieu Pageau","text":"Yeah. Yeah. So the only problem with that, I guess, is that people will think that it makes it arbitrary, which, which it doesn't because there's still universal experiences that all humans have. It doesn't mean it because it's interpreted through the lens of our consciousness. It doesn't mean that it's arbitrary in the sense that every. Anybody could say whatever they want, can interpret it however they want."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":500.53,"end":501.01,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":501.33,"end":527.31,"speaker":"Matthieu Pageau","text":"So that's the only problem with the idea of bringing it back to your experience. I agree with. That's what people have to do. But they have to keep in mind that the human experience is a universal experience. Some things are universal in the human experience. We all eat, we all sleep, we all work, we all rest, etc. Etc. So the human experience is not random or arbitrary. It's universal."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":527.31,"end":605.21,"speaker":"Jonathan Pageau","text":"And in a way, it's funny because to get to true symbolism, you almost have to go. You almost have to destroy what people usually think, what it is to give meaning to something. It's like you have to go beyond the emotional or personal version of what happens and then go back to the really basic, basic ground level, kind of almost, you know, prime Primordial experience of something. It's like, so the grass, the experience of the grass isn't that. Isn't like that. You know that that nice Saturday that you spent with your family and now the grass for you reminds you of that nice moment that you spent. You know, the reality of grass has more to do with the fact that it's below your feet, that it's down there. You know that it. You know that it's. It's all these. It's like a chaotic mix of different things that are just there on the surface of the earth rather than, you know, that. But maybe that participates in the reason why laying in the grass on that nice Saturday was a pleasant experience. Probably it does, actually. But you have to go beyond that little that, like, psychological, literary type of interpretation to get to the baser reality."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":605.61,"end":672.81,"speaker":"Matthieu Pageau","text":"Yeah. Just because it's interpreted through human consciousness doesn't mean that it's like a personal, individual interpretation. It can be, but those. That's not how symbolism works. Because I don't care about some person's individual interpretation of something when it. When that interpretation is based on nothing but their little ideas. Symbolism becomes important when the interpretation is universal. I mean, that's one of the criteria which. By which we can distinguish real symbolism from the kind of symbolism you can find in a movie or in a story that's just been made up by someone on the street. And even then, most of the time, when people tell a story or write a movie, they will use universal symbols because otherwise nobody would care. Exactly. So even when it is interpreted through individuals, if they want people to care about their interpretation of reality, they'll make it universal. Otherwise nobody cares."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":673.13,"end":713.1,"speaker":"Jonathan Pageau","text":"Right. So in a way, the idea would be to say that symbolism is really. It's really the way that our consciousness is written. In a way, it's like what makes it possible for us to even perceive and engage the world is these basic structures that we're made out of that our experience is made out of. I mean, that's symbolism. It's really very. I mean, it's really at the base. It's really what makes us. What makes it possible for us to engage with the world. That's the same. The same structure as the religious. The religious hierarchy. Like the religious symbolism."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":714.86,"end":807.05,"speaker":"Matthieu Pageau","text":"Yeah. So, yeah, in fact, the basic structures of symbolism are so universal that even people who would like to deny them are into those structures. They can't escape it. So. So like a scientist, let's say, even an atheist, he's working on a scientific discovery or something. Like that he's trying to perform an experiment. He can't escape the basic structures of symbolism. So what is this person doing? He's trying to unite a theory that he has, an abstract theory, a metaphysical idea. He's trying to join that with the facts that he observed. So this scientist is. He's a human between heaven and earth, trying to mediate between heaven and earth. He's trying to mediate his abstract theory with a concrete fact. So the scientist, whether he likes it or not, is participating in the symbolic worldview. He's a mediator between heaven and earth, whether he likes it or not. And when I say, I talked about this with, when I went, Dr. Jordan Peterson, when I say heaven, I mean meaning, so theoretical meaning. And when I say earth, I mean the factual reality, concrete reality. And that's what it means in the Bible. And that means in, in pretty much all traditions. So."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":807.93,"end":874.55,"speaker":"Jonathan Pageau","text":"Yeah, and it's funny because I made, I made recently I made that video about how science is nested in religion, trying to talk a little bit about that as well. And it was funny because just what is it? Like a few, A few. Like a week later I heard, I heard, I hate always harping on Sam Harris, but I heard Sam Harris speaking about the phenomenon of emergence. And he was talking about how we see these different patterns appear at different scales of reality and how, you know, like, let's say the same patterns appear at a, at a biological level that on. As a city. And he was trying to, like, he was really struggling to, to make those jumps, those qualitative jumps between, you know, quarks and atoms to, you know, a person, to a city. And he used, he kept using the world higher order phenomena. He kept using this hierarchical language about these higher orders of manifestations. And I thought, wow, man, you're a religious thinker, you don't even know it."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":876.07,"end":893.71,"speaker":"Matthieu Pageau","text":"Yeah, and I think I listened to that also, and I think the answer was also interesting because what the person said is, you don't want to explain higher levels of phenomenon with the lower levels because it's extremely complex. So complex."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":894.03,"end":895.63,"speaker":"Jonathan Pageau","text":"Samuel didn't like that answer."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":896.83,"end":897.67,"speaker":"Matthieu Pageau","text":"Okay, I don't know."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":897.67,"end":900.67,"speaker":"Jonathan Pageau","text":"But the other, the scientists. Go ahead, keep going."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":900.83,"end":993.93,"speaker":"Matthieu Pageau","text":"Yeah, so it's so extremely complex that giving an explanation at that order would probably be impossible. And even if it is, it wouldn't be coherent to us as humans, you see, so right there, yeah, it's important. You can't get away from it. You can't get away from the fact that we are humans, we are Observing phenomenon. We can't abstract ourselves from the equation of knowledge. So the scientist, the materialist, tries to step away from the universe and look at it as if he's not in it. Yes, and which is fine to a certain degree. And it's fine to understand certain things like mechanical causality. The perfect way to do that is to abstract yourself from, from reality. But you still can't escape the other reality, which is the ancient way of thinking where it's centered on, on the human, it's centered on consciousness. And so basically the scientists can try to create a worldview in which he's not there and in which his theories don't exist in that model of the universe. But it's problematic for certain things. It's problematic. So it's also probably problematic to include it. So there's a reason why science has discovered, materialistic science has discovered a whole bunch of things that the traditional worldview hasn't discovered. Yeah, because it's useful to get out of this system. But so ideally, I think it reaches."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":993.93,"end":996.05,"speaker":"Jonathan Pageau","text":"A limit, though at some point. It reaches its limit."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":996.21,"end":1032.17,"speaker":"Matthieu Pageau","text":"I think it has reached that limit. I think, I think quantum physics is one of the signs that this limit has been reached because they reached a point where the observer can't, can't get out of the equation. So you have to admit as an observer that when you look at the phenomenon, you, you are impacting the phenomenon. There's no way out now. There's no way out. Yeah, so they, they have reached that limit and so it's going to come to them soon. They're going to have to deal with that limit. I don't, I don't think they're dealing with it. I think they're going to have to deal with it though. I mean, what does it mean?"}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1032.57,"end":1042.01,"speaker":"Jonathan Pageau","text":"Yeah, it seems like there was a whole bunch of things that happened at the mid, at the mid, maybe like post war period that, because it was not, it wasn't just that observation, but."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1042.01,"end":1047.61,"speaker":"Matthieu Pageau","text":"It was also Goodell's, Goodell's theorem, completeness theorem, same problem."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1047.69,"end":1111.62,"speaker":"Jonathan Pageau","text":"Right. And then, and then Heidegger, I think Heidegger was part of that. And Heidegger presenting the idea of presenting this idea that the way that being presents itself to us. Like I was saying at the beginning, the way that we encounter the world as consciousness is not the same as the technical, let's say kind of scientific way of viewing the world in that you can't discount the other completely. You just can't because then you don't know how to act in the world. And so it seems like maybe it's taking a while for people to kind of come to the finale of what that's going to give. But I mean, hopefully this is it, this is happening right now that people are going to start. And I think that one of the things that Jordan Peterson seems to be doing is tapping into that uneasiness that people have about seeing the limits of science, but then coming at it from a scientific point of view and trying to, to help people see it without, completely, without, without. Because people."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1111.62,"end":1112.82,"speaker":"Matthieu Pageau","text":"Without becoming insane."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1112.9,"end":1113.38,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1114.42,"end":1161.99,"speaker":"Matthieu Pageau","text":"No, seriously, because you can, if you, if you delve too much into this kind of universe of self referential contradiction, you, you can go insane. So you can lose everything. So the idea is not to, I mean, my interest in traditional cosmology doesn't come at the cost of scientific knowledge, in my opinion. Not at all. They're not opposed. They are, but they shouldn't be. They should, they should team up if possible. So. But one of the things the people who are materialists have to understand if that is going to eventually happen, is that traditional cosmology should not be interpreted in terms of materialism."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1161.99,"end":1162.39,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1162.55,"end":1189.69,"speaker":"Matthieu Pageau","text":"Because when you do that, it's ridiculous. So they're right. But when they laugh at religion, when they laugh at the religious worldview and the traditional worldview, they find it ridiculous. They're right, because the reason is they're trying to look at it with their own lens, their own materialism. They're trying to look at something that's fundamentally not materialistic. So yeah, it doesn't work. It's ridiculous."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1190.01,"end":1198.81,"speaker":"Jonathan Pageau","text":"The worst part of that is that, is that it's not just the atheists that are doing that. They're reacting to religious people doing that."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1198.81,"end":1199.93,"speaker":"Matthieu Pageau","text":"Yeah, exactly. Yes."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1200.41,"end":1213.73,"speaker":"Jonathan Pageau","text":"And then interpreting the religious traditional cosmologies with their materialist point of view and then saying absolutely ridiculous things in doing so. And so the atheist has every reason to mock them."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1213.73,"end":1214.33,"speaker":"Matthieu Pageau","text":"Exactly."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1214.49,"end":1215.45,"speaker":"Jonathan Pageau","text":"They're totally absurd."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1215.93,"end":1329.57,"speaker":"Matthieu Pageau","text":"I have zero animosity towards, towards atheists, I have zero animosity towards skeptics because they're not responding to religion really. They're responding, they're answering to the problem of people who are essentially materialists and don't know it and interpret the Bible, for example, with materialism. And even though it doesn't work, they still stick to it. So I think you gave an example in one of your videos. I'm not sure which one, but an example, you ask somebody, what does it mean when it says he went up into heaven? So let's say, for example, Elijah goes up into heaven. What does that mean? Does it mean that he goes up into the atmosphere and then into outer space or something like that? It becomes ridiculous immediately. So there has to be a stage where people who are scientifically minded stop interpreting like that. Okay? Don't worry about what certain religious people say. If they interpret it like that, it's not, it's, that's not what has to be critiqued. That's simply wrong. What has to happen is we have to re understand what it means to go up into heaven. That's just an example. Pretty much everything has to be, in a way reinterpreted according to a cosmology that allows it. And that cosmology is the one I was describing with Jordan Peterson. It's a man is a mediator between heaven and earth, and that's how things have to be interpreted in the Bible. So when it says go up into heaven, you have to interpret it like that. Heaven has that meaning. It doesn't mean the atmosphere. It doesn't mean that."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1329.81,"end":1353.62,"speaker":"Jonathan Pageau","text":"So, yeah, it doesn't mean the atmosphere at the same level that when, when Sam Harris says higher level phenomena, it means that one phenomena is stacked on top of the other. You can't, you can't use the language of hierarchy to describe this, these higher levels of manifestation and then mock the idea of, oh, you're silly, sky God in heaven. It's like you're using the same word."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1353.62,"end":1356.06,"speaker":"Matthieu Pageau","text":"They're using exactly the same language. Yes, exactly."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1356.06,"end":1358.5,"speaker":"Jonathan Pageau","text":"They're using the same structure. And so you're mocking mine."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1359.06,"end":1397.62,"speaker":"Matthieu Pageau","text":"Yes, but that's the thing. They're not mocking your structure. They're mocking the people who still insist on interpreting it in a materialistic way, as in the way the one you were just laughing at it means going up into the atmosphere. So they are not mocking that. They're mocking the people who are, who still interpret it in a way that doesn't make sense. If we can make people understand what it means, then I don't think there's going to be as much discrepancy between science and traditional cosmology. In fact, I think there's none. Yeah, because they're not talking about the same things hardly ever."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1397.78,"end":1501.39,"speaker":"Jonathan Pageau","text":"And what's interesting is what I found in kind of my own research is one of the difficulties that people have is that when you read medieval writings and when you read, let's say, the ancients, it's difficult for people to understand because those medieval writers were not comparing themselves to something that didn't exist yet. Like, they weren't comparing their discourse to a scientific discourse because the scientific discourse just wasn't part of their world. And so they just speak forthrightly. And now when we look at it with our own lens, we see it just seems to be absolute gibberish. It doesn't make any sense. But what's interesting is that in the transition, you can catch, like, in the transition between the traditional worldview and the modern worldview, you can catch glimpses of people saying, oh, wait a minute. No, no, no, no. Don't, don't. Don't think this is like, the same way that you're. You're like, you know, hitting a hammer on a piece of wood. So like in Dante, for example, there's places where he actually says. He talks about ascending into heaven and encountering higher spirits in the different heavenly spheres. And then he says, no, the spirits don't actually inhabit the heavenly spheres. It's a condescension of the heavenly language for us to be able to understand the higher truth that we speak about it in those terms. And it's like, well, you know, and he was right at the transition before, like, the scientific. The scientific revolution. And so he was already seeing that people were changing the way they're thinking, and he was trying to prevent them from getting. Having, like, a science fiction version of, like, a Marvel Comics version of spirituality. Like the gods live on other planets."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1501.39,"end":1618.32,"speaker":"Matthieu Pageau","text":"Yes, because that's what happens. That's actually a good point, because that's exactly what happens if you don't make the proper language shift because the words shift. I mean, if you're naive, you don't realize that the meaning of words shifts constantly. So if, like, what you were saying before, water is H2O, it might be that today, but it's extremely naive to think that in the time of the Bible, for example, when the book of Genesis was written, that that's what water meant. It didn't. It meant something else. It meant something. It had nothing to do with any chemical composition or anything like that. So we always have to be aware that words shift. So, for example, I mean, and there's a natural way that word shift. The words shift when your knowledge of the universe increases. So if you say, for example, earth means matter, okay? So that's what it used to mean. And there's a reason why it meant that. Because all matter came from the land, from the earth, okay? So when your knowledge of the universe expands, then you realize that there's matter that's not in the soil, in the earth. So then you have to expand your category. Right. So now you invent. You use the word matter instead of earth, let's say. So now you've separated those two categories, but they weren't separate before. When all things came from the earth, then there was a coincidence between the metaphysical category called matter and the concrete reality that we call the soil the earth. But when your knowledge expands, then the word shifts. But if you don't keep up with that shift of language, then you start to say things that don't make sense."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1618.96,"end":1663.18,"speaker":"Jonathan Pageau","text":"Yeah. And then things look ridiculous. And it's funny because it's like people who criticize the religious worldview or criticize the ancient vision of the world. It's like either you really have to think that everybody was on drugs or something. That's what you would have to think because it's so disconnected to the materialist way of interpreting the world that it's like either they were completely delusional and lived in, like, a delusional world, or maybe they were as smart as you were, they just were talking about things in a different way. Yeah, I prefer the second because it's. It's more generous and more. And it actually. And when you explore that direction, you find an amazing. That's where you find amazing things."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1663.18,"end":1663.66,"speaker":"Matthieu Pageau","text":"You find."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1663.74,"end":1673.81,"speaker":"Jonathan Pageau","text":"That's where you can discover the pearls that are hidden in the ancient text. Or else, you know, you read stories and it just seems like it's just a bunch of nonsense."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1673.81,"end":1791.31,"speaker":"Matthieu Pageau","text":"Yeah. And that. And that's how atheists interpret it. And so they're right to laugh at it. They're right to mock it. So there has to be an effort to understand what the ancient language was at some point. You can't just assume that you know automatically what things, what words refer to. I mean, the example I always use when I talk about these things is the example of the fish. I always use that example because I think it's an easy one to understand. So I remember when I was. When I was a kid, there was this Sunday school teacher who said something like, he was talking about this story of Jonah. And I don't remember who that person was, but that person said, well, we know that Jonah wasn't swallowed by a whale because the text says it's a fish, and whales aren't fish. Okay. So. And I was pretty young at that time. I don't remember exactly. Maybe 8 years old or something. And even then I knew there was something wrong with that. I knew that didn't make any sense. To think that you can Use a modern definition of a fish and apply it to a story that's thousands of years old. I mean, obviously, when people talked about a fish, it didn't mean the same as what it means today. Like, today a prerequisite to be called a fish. I think you have to have gills. I think the animal has to have gills. But obviously that's not what it used to mean. Fish were things that lived in the water, and that's about it. Probably that was the definition of a fish. And it wasn't a wrong definition. It wasn't an incomplete definition. It was just a different definition of fish. The word shifted, and now the word fish means something else. So we have to be careful not to use modern interpretation of words to interpret ancient stories. It's very naive."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1792.03,"end":1838.82,"speaker":"Jonathan Pageau","text":"It was something. It was a definition. Like, we still have definitions like that. Like, I used the word grass before. That's a perfect definition, which is similar to the. The definition of fish just underwater. I mean, if you. If you took the time to analyze all the different types of botanical species that are. That are on the ground that you call grass, you'd think, like, you're an idiot to say that. That they're all the same. Of course, they're completely different in terms of their. Their species and their different origins. But that category, grass, is a perfectly fine category of human engagement. So it's like, yeah, I mow the grass. I don't mow, like, all these. I won't enumerate for you all the different types of plants that I'm mowing. When I'm mowing the grass, it's like, it's the grass. It's fine."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":1838.82,"end":2070.36,"speaker":"Matthieu Pageau","text":"Yeah. And it's a word that refers to the human experience. So that's a good example. We don't care about the scientific definition of what grass is. Like, we don't care what it's composed of. Really. We. We don't. We care about the fact that it's in our backyard and makes it look nice or something like that. But anyway, the idea is we have to be careful not to interpret ancient, ancient stories with modern categories. And I keep repeating that because that's what 90% of the people who misread traditional stories and biblical stories do. So it solves about 90% of the problems that people have when they read a text. So when you at least try to find a proper meaning for the categories already, the problem of the distinction between a symbolic interpretation and a literal interpretation usually vanishes. It usually vanishes right there. If you try to find the proper meaning of words, that dichotomy is usually enough to make it completely disappear. So one of the examples I use. I use in my mind for that to show that is, you say, for example, in the Bible, the snake in the garden, okay, if I say that's a symbol of time, the snake in the garden is a symbol of time, let's say, okay, so if you have a modern scientific definition of time, that makes no sense, it looks like I'm just arbitrarily assigning a meaning to that element of the story. It looks like I'm just making it up, basically. But if you have a proper definition of time which fits with. With an ancient understanding, then it does work. It doesn't. It's not arbitrary anymore. Because if you say, for example, that time used to be understood in a way where it meant the cause of transformation or an influence of transformation, something like that, that's what time is, change. That's not change. Yeah, it's cause of change. It's the influence of change. It's change itself. Something like that. It's not what scientists call time today. What physicists call time has nothing to do with what we just said. I mean, it's become just an empty quantity used to describe a mechanistic world in terms of times and event, events in time and space. It's not the cause of change. It's not an influence of change. I mean, in the modern way, time, it's not seen as a cause of change, but it certainly was seen as that in the ancient world. Time was a cyclical transformation, like a powerful influence that transformed things, changing them into their opposites, actually changing light into darkness, darkness into light, life into death. That was time. So that definition of time, if you use that, then you can say the snake in the story of the garden is a symbol of time. There's no metaphor. Yeah, there's no metaphor. It is the cause of transformation in that story. Where's the metaphor? It's vanished. Just because I use the right definition of the concept of time, and I stopped using the scientific, mechanistic one all of a sudden. When I say symbol, it doesn't mean metaphor anymore. It doesn't mean an allegory. It means nothing of the sort. The snake is a cause of transformation in the story. It. It is a symbol of time."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2070.6,"end":2132.09,"speaker":"Jonathan Pageau","text":"Yeah, and what, like, for example, and one like, I like. I kind of like, you know, this usually is not my usual way of going about understanding symbolism, but for people who are kind of coming at it from the outside, the way that Jordan Peterson kind of traces that idea that the snake is like a symbol of time, let's say, is a good way for people to kind of understand it in the sense that if you're a community, let's say, and there's a predator that arrives, you know, a predator that comes from the. Comes into your camp, that is. That's exactly a perfect. That's the most archetypal image of change, is that there's a threat that comes from the outside. The threat. It's both a threat, but it can also be a kind of seduction. Like it could be either way. Like it could be either a threat or a fascination or something that appears from your corner of your eye and that thing is going to. Is going to tumble. It's going to make things tumble. It's going to make things move."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2132.41,"end":2153.98,"speaker":"Matthieu Pageau","text":"Yeah. It can potentially change, transform things. If it bites you, it will definitely transform your life into death. So in that sense, symbols are not metaphors, and they're certainly not arbitrary metaphors. They're certainly not conventional agreements on meaning."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2153.98,"end":2210.5,"speaker":"Jonathan Pageau","text":"Yeah, I think that's really. I think that's really. If we can get something out of this conversation today, I think that's really one of the biggest things that is an obstacle for people to understand symbolism is that people constantly think that symbolism is something which is added onto literal facts. And that, for example, like we both grew up in Protestant, in the Protestant world, and not everybody, but for a lot of people we grew up with, it was almost as if the idea that something had a symbolic meaning was almost like a threat to the integrity of the thing itself, like it was going to swallow up the factuality of the thing. Whereas that's not how it works. The very reason why that's part of the story means that it's symbolic. It has to be, or else why would you care about it? Why would it be part. Why would it be set up in this pattern story?"}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2210.98,"end":2449.26,"speaker":"Matthieu Pageau","text":"Yeah, well, actually, unfortunately, it's kind of a vicious cycle. Because when all you have left in a story like the Bible, in stories, biblical stories, is the fact, then you want to defend that. If you're a Christian, let's say, when there's no more meaning. That's what I mean. It's a vicious cycle because when you have the meaning, you're more interested in the meaning than the fact, really. Because that's what informs you. That's what tells you how things work. That's what shows you how reality works, and it gives you guidance as what I do in this situation. If the text has meaning, it helps you understand the nature of reality. That's actually what it's really supposed to help you with. But if you don't have that anymore, and you only think that the text is a description of an event without meaning, then if you want to remain a Christian, you're gonna guard that with your life. That's what they're doing. The last remnant of your identity is it happened. You gotta prove that it happened. You gotta show that it happened. And you don't care. I don't care about the meaning. I just care that it happened. Well, that's a mistake, because the real way to understand the, the Bible is through a traditional cosmology. It's the, the events that are described in the Bible are embodiments of metaphysical truth. They're embodiments of cosmic truth, they're embodiments of social truth, they're embodiments of individual truth. So at different scales of reality, of our experience, there are constant truths. So these are the truths that the Bible are trying to communicate. And it's unfortunate that it's been lost to, to a great degree, but there's work to be done. There's work to be done. We have to do that work of reclaiming the meaning of, of these things. Just doggedly defending the factuality of, of a story is pointless. It doesn't do anything. It doesn't help because it's the fact contains the meaning, but it's the treasure is in the meaning, it's not in the fact. So the whole point of the fact is to support and express and help us to understand higher meaning, spiritual meaning. Just like a scientist who performs an experiment, it's not the experiment that has value in itself. It's, it's the general truth that the experiment reveals. So, I mean, it's interesting. I always find fascinating the story of Galileo that drops two cannonballs from the Tower of Pisa. Okay, I like that story because it's a perfect example of this dichotomy of meaning and fact. So in that story, why do we keep retelling that story? Do we really care if it happened or not? I mean, it would be interesting to think that it happened. But the reason why we keep restating that story is because that specific event expresses, proves, manifests a cosmic truth, which is gravity, which is the nature of gravity. So why do we care about that event? The dropping of those two cannonballs at the same time from the tower is because it proves a cosmic truth. The same can be said about what's in the Bible and who. The event of them dropping the two cannonballs. I mean, some people say that it actually happened. I've seen other people say that it doesn't happen. And what I say in my mind is I don't care. I don't care that as much if it happened. I care a lot more that it revealed the nature of gravity."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2449.26,"end":2522.34,"speaker":"Jonathan Pageau","text":"Right. I think that even when we use the word fact when we talk about a story, especially if we talk about ancient stories, the notion of what a fact would be in a story that's been. That was told 3,000 years ago is not. It doesn't mean a scientific fact. Right. One of the things that I've been trying to get people to see is that to remember something and to attend to something for thousands of years means that whatever it is that happened, whatever event that happened has to be compressed like it has to be. It has to be brought into something that has meaning for everyone. So I kept thinking about the idea. Let's say that, you know, let's say that I. That I tell the story of a modern story to an ancient person. And in that story, the person has a gun in it, and that other person doesn't understand what a gun is. But I can still tell the story. I just reduce it and I use the word weapon, let's say. And then I find a word, and then maybe the word weapon in his language means a lance, and then finally it ends up being a lance. But it doesn't matter. It's the same thing."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2522.98,"end":2525.62,"speaker":"Matthieu Pageau","text":"You're still telling the story, compressing the."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2525.62,"end":2545.78,"speaker":"Jonathan Pageau","text":"Categories in a manner which makes them universal. It doesn't have to be. It doesn't have to be forensically the same thing for it to have. For it to be a fact. Because categories can be enlarged and detailed and can be compressed into more and more compressed categories anyway. Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2545.86,"end":2577.28,"speaker":"Matthieu Pageau","text":"And that's important to understand because one of the reasons why the texts are written the way they are is because they focus on the meaning. So, I mean, we don't have the events. Like, let's say we're talking about the story of Abraham. We don't have the events anymore. We only have a story about the events. So the story was recounted in a certain way. And the way it was recounted, the purpose of it was so that we understand what it means, the meaning."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2577.28,"end":2652.9,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah. And we see that. I was thinking about that the other day. I was thinking about kind of trying to find examples of that for people to understand. And one of the things I kept coming Back to. Was the idea of crossing a body of water. And, you know, like, we have in the Bible, we have the Flood, then we have the crossing of the Red Sea. But then I was like, okay, let's keep going. And then it's like, oh, that's funny, because we have Caesar crossing the Rubicon. Then we have Constantine winning his becoming emperor by fighting a battle on a bridge. And then we have there's all these examples. Then you come up to Washington, crossing the Delaware. It's like, why is it that all these stories of a change of power happen at the crossing of water, a body of water? And then some cynic 200 years from now would say, oh, well, none of that happened across the Delaware, you know, because of course you didn't. It's mythological. I can see that. It's the same structure as Moses and all these other mythological structures. And it's like, no, man. That's how reality works. We remember that event because that event in those series of events is the most conducive to bringing about the universal meaning that's in that story. It's like, that's how we remembered it."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2653.39,"end":2744.97,"speaker":"Matthieu Pageau","text":"Yeah. It doesn't mean it's not. Because something has a cosmic meaning that. That it didn't happen. Yeah. It's ridiculous to think that. Well, that doesn't. That doesn't take away from the possibility that some traditional stories are fictional. That's what people have to understand as well. I mean, it doesn't mean that every story is factual either. But what's problematic is this dichotomy, this impossibility of accepting the coexistence of a fact and a higher meaning, a general universal meaning. That's what's problematic. So it's. It's what. What's happening in a lot of cases is a lot of the Christians are defending a materialistic worldview. When they do that. I don't know. I don't think they realize, but when they. They get annoyed by a symbolic interpretation of the Bible, they're essentially defending their enemy. Basically, they're defending a scientific, mechanistic worldview because that's how they think. They might not be aware of it, but. So a lot of people, a lot of religious people, not just Christians, a lot of religious people are essentially materialists. Yeah. But they. They believe in God. They happen to believe in God, but they're still materialists every other way. In every other way."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2745.05,"end":2777.89,"speaker":"Jonathan Pageau","text":"And the materialism has two sides. And it's interesting in terms of meaning, because what happens is you meet. You meet like, conservative type Christians, and they're literal. Like, they're, they're real materialists in the sense that they read the Bible and they see it as like, what's written there. That's what happened. In the same way that I, you know, ate my, my muffin this morning and, you know, and I, you know, I cut my mustache. Like it's the same level. Like it's the same level. Then you meet liberal Christians who are like, oh, you know, like, whatever happened, the Bible, none of that happened. You know, it's all these stories and then they."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2778.05,"end":2780.05,"speaker":"Matthieu Pageau","text":"So, like, yeah, it's the other side of the coin."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2780.05,"end":2794.08,"speaker":"Jonathan Pageau","text":"And then those liberal types, they. Then they feel like that it's their now that they can interpret it in whatever way they want because it doesn't really matter anyway. So then they come up with crazy interpretations. Then the conservative Christians, they go crazy because they're like, yeah, well, they're right."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2794.08,"end":2794.4,"speaker":"Matthieu Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2794.4,"end":2818.02,"speaker":"Jonathan Pageau","text":"If we agree that there's meaning in these, if there's symbolism in these stories. Look at them. We don't want to be like them. We don't want to be these, these crazy, falutin people. And the other people on the, on the top, on the, on the, on the, like, liberal side, they're looking at the conservatives and they're thinking, what a bunch of morons. Like, they really think that there was a snake on, you know, like in an apple and, and then like two naked people, like, what a bunch of idiots. So it's like there's this crazy sides."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2818.02,"end":2818.7,"speaker":"Matthieu Pageau","text":"Of the same coin."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2818.7,"end":2820.46,"speaker":"Jonathan Pageau","text":"They're just two sides of the same coin."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2820.46,"end":2828.82,"speaker":"Matthieu Pageau","text":"Like, it's a detachment. It's, it's. That's the idea. Symbolism is the union of fact and meaning."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2828.82,"end":2829.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2829.22,"end":2872.82,"speaker":"Matthieu Pageau","text":"So both. If you, if you lose that union, if you use the possibility of a union like that, then yeah, you either fly up into heaven, you lose your mind, you interpret it however the heck you want, and it doesn't matter. There's no reason or rhyme to it. It's just anything goes. Or you just refuse completely to have any kind of meaning and you just stick to the fact. So one of them keeps the fact and the other one keeps the meaning, but goes a little bit crazy. Because when you get detached from facts, your ideas, your theories about what things mean can go fly off in any direction. But if you remain attached to a fact, it limits what you can say about it. It limits the meaning that you can give it. Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2873.3,"end":2924.9,"speaker":"Jonathan Pageau","text":"One of the theories that I've had for, like, the modern age is that it's been. It's been like a de incarnation. Like, it's been like taking the idea of like, let's say, the human and divine nature of Christ and like ripping them apart and creating these two, like, wild opposites. Because we often see modernism in terms of materialism and everything. But there's a whole other, like, occultist, occultic, like the occultism and New Age and all these kind of spiritist type movements that are the counterweight of the more kind of scientific materialism that's there. And those two things develop at the same time. Like Descartes. Rene Descartes was developing his mechanical, scientific things. And then he spent the rest of the. Most of his life, like, searching for the rosy cross, like looking for some esoteric, you know, invisible society."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":2925.86,"end":3031.92,"speaker":"Matthieu Pageau","text":"Yeah. Something that's. Yeah. That's detached from reality, basically. That's not concrete. Well, that's what's ironic about all this. All this stuff is the people who are preserving the true spirit of traditional thought are scientists because they care about the union of meaning and fact. They care about the fact that as much as they care about the theory. They don't just want theories, they don't just want facts. They want. True knowledge is joining meaning in fact together. Theory in fact. So like a universal theory with particular facts. That's what. That's their job. They're still doing that. So they're preserving that spirit. It's completely ironic. The scientists are the ones who are the most good at preserving the union that we're supposed to be preserving as religious people. So it's. It's a little bit ironic, but at the same time, it's kind of their fault that we lost it. Yeah. At the same time, because they're materialists, so they don't view the theory as something real. They view it as completely artificial. And that. Well, it could be argued that that's their problem. Their main problem is they view the facts, the matter is real, but they don't view the theory that they're using to interpret the fact as real. Yeah. Why is it not real? It's. It's not material, perhaps. Why did. Why is it not real? Well, there you go. Because they're materialist. If something is not material, they assume that it's. It has no reality whatsoever. But it's a strange way of thinking."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3031.92,"end":3032.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3032.28,"end":3032.64,"speaker":"Matthieu Pageau","text":"Because."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3032.64,"end":3035.84,"speaker":"Jonathan Pageau","text":"And they use math like they use meth. They use math is."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3035.84,"end":3068.61,"speaker":"Matthieu Pageau","text":"It's real. There you go. It's a kind of a real. It's not material yet mathematical structures, patterns are real. They're not real in the sense that they are physical. That's stupid. They're real in the sense that they are universal. They're actually more real than individual facts. I mean, a mathematical pattern has more reality, has more universality, has more applications, implications than any fact I could find."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3068.61,"end":3069.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3069.17,"end":3072.61,"speaker":"Matthieu Pageau","text":"So why is it not real? It's real. It's more real than real."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3073.17,"end":3094.01,"speaker":"Jonathan Pageau","text":"And, and the hierarchy of value is the same thing because you can't, they can't avoid it. Like they, Even though when they're doing their hardcore science, they try to avoid it. You know, when they're even justifying why you would study something rather than study something else, they have to put it in a hierarchy of values. There's no way of avoiding it. You can't get around it."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3094.33,"end":3108.41,"speaker":"Matthieu Pageau","text":"Yeah, it's one of those structures like mathematics. It's one of those structures that are so real that there's no way out of it. You can't get out of it. Even by denying it, you're probably going to enter into that framework of meaning."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3109.35,"end":3149.78,"speaker":"Jonathan Pageau","text":"So, so one of the things that I think is a big deal is that, I mean, I've had people who have written me who are interested in symbolism. And what happens, the problem that happens when people start to discover symbolism is that not always, but often they kind of go a bit insane. They go crazy. They start seeing. When they start seeing connections between things, it's as if some strange valve is opened up in their mind and. And it's like they drink a gallon of wine and it's like everything's connected. And then they write these long. I've gotten these long emails of people who like, just connect things together and it's just completely crazy."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3150.1,"end":3166.74,"speaker":"Matthieu Pageau","text":"And this is one of the reasons why rational people don't want to have anything to do with symbolism. Because a lot of people end up making all kinds of weird connections and it's clearly irrational. It's based on, largely on personal experience. And that's what they want to avoid, which I understand."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3167.38,"end":3183.3,"speaker":"Jonathan Pageau","text":"So the idea is like, so what? So let's talk about this. What could, what could we say are some of the criteria by which we know that something is, has meaning, by which we know something is, is worth attending to and is, and is actually connected to something else."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3184.74,"end":3429.5,"speaker":"Matthieu Pageau","text":"Okay, so yeah, the criteria, let's say you and your interpreter, you give an interpretation of a narrative in the Bible, let's say, or an element in the Bible in a story. So how, what criteria can we use to determine if this interpretation is just some crazy association or if it's something that's valid. If it's a valid meaning that's given to this event in the Bible or this part of the story. So the way I see it is it's exactly the same as what scientists use to determine if a scientific knowledge is valid. It's. First of all, you have to look at consistency. Okay, so if somebody says, I'm gonna use the example of the snake again, like I did before. If somebody says the snake is a symbol of. I don't know, what do people usually say when they don't know what they're talking about? It's a symbol of good fortune and fertility. Something like that. That's an exact. That's what people usually say when they don't understand symbolism. Yeah, well, usually when people don't really understand symbolism, they always. Everything's a symbol of fertility for some reason. Okay, so. So that's. So how do you know if an interpretation like that is valid? Well, you have to look at consistency. So if you read the rest of the Bible and then there's other examples of a snake, and then your interpretation of the snake fits nowhere except at that particular first example that you were looking at, then you don't have it. You're wrong. Think again. Okay, so that's. So it's like the same thing as science. I mean, if you have a theory about reality and it only applies to a very specific phenomenon, then keep working. I mean, you don't have anything. You're just describing it. You just made up a theory to describe just that fact. You're trying to have a universal theory that explains a specific fact. So it has to apply to different examples, different phenomena, not just the one. So it's the same thing. If you're interpreting a symbol, you don't want it to work on just that story. It's ridiculous. It has to work all the time. So if you say the snake is a symbol of fertility, then look at all the other examples of the snakes in the Bible. Does it. Does it make sense? The answer is no. So it's not that. So that's one criteria. Another one which goes with the first one really is. It has to be comprehensive. So it has to be. Include a lot of the stories. So if you have a specific pattern that you use to interpret a story, that pattern, you should be able to use it to interpret a lot of other stories. So if you say, for example, one of the most fundamental patterns in ancient cosmology is the tree. Okay, the tree, the snake. Those are usually seen as opposites. So if that's true, then you should find the tree, that pattern. You should be able to find it in a whole lot of other stories. So if you use that, if you think that pattern is fundamental, then fundamental means it explains a whole lot of things. So just like scientific theory, like let's say the theories in relation to gravity, you should be able to explain a lot of phenomenon with that single theory. If you don't, there's. You're missing some. Some point. You're missing a simpler truth, a more universal truth. So that's the other thing. Well, the other I would say criteria is does it provide insight? If you have an interpretation of a symbol and it provides you with zero insight into the nature of this story, into the facts that follow and the facts that precede it, it's worthless. What's the point? So I think you were talking about that at the beginning. You were saying about interpreting things horizontally. Were you talking about that before?"}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3429.5,"end":3431.34,"speaker":"Jonathan Pageau","text":"No, we talked that before our conversation."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3431.42,"end":3431.82,"speaker":"Matthieu Pageau","text":"Okay."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3431.82,"end":3479.52,"speaker":"Jonathan Pageau","text":"Before I can mention that one of the things that we see with symbolism, one of the problems we see with symbolism is the kind of. I'm going to probably do a video about this, but it's like the conspiracy version of symbolism where symbolism is interpreted like on the same level. And so an image doesn't refer to a higher reality or to a more, let's say, unity, universal, universal truth. It only. It's only a code that hides a secret, like a secret meaning of something someone's trying to hide from you. Like the fact that maybe they're aliens or, you know, like there's this secret society that wants to. Some, for some reason, they. They want to hide their communication, but then make it available for others. Like that type of symbolism, like, who cares about that stuff?"}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3479.83,"end":3481.43,"speaker":"Matthieu Pageau","text":"Yeah. That doesn't exist."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3481.75,"end":3483.19,"speaker":"Jonathan Pageau","text":"It doesn't help you live your life."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3483.59,"end":3516.5,"speaker":"Matthieu Pageau","text":"Yeah. And the funny thing is that type of symbolism does exist, but it's absolutely secondary. I mean, if you want to understand the Bible, forget about that. It's not going to help you to understand anything. So. Yeah, but I had. I've seen an example of that. I don't remember exactly where, but it was somebody who was trying to interpret the story of Elijah and he was talking about the raven that feeds Elijah. And then the interpretation of the person was, well, the raven actually refers to a secret society."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3516.5,"end":3517.46,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3517.78,"end":3523.66,"speaker":"Matthieu Pageau","text":"That went and fed Elijah. Okay. That was the interpretation. I don't remember where I got that from."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3523.66,"end":3525.14,"speaker":"Jonathan Pageau","text":"That's a lateral interpretation."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3525.46,"end":3662.15,"speaker":"Matthieu Pageau","text":"And in my mind, when I Saw that, I was thinking to myself, that gives no understanding of the story whatsoever. It doesn't give any more understanding to the story than to say that it's a raven. Not at all. So that's an example of a faulty interpretation. It provides you with no higher understanding of a specific story. So the idea, just like a scientific theory, you find a scientific theory. Why is it valuable? Because it allows you to understand a whole bunch of things. Yeah, that's. It's the same thing with this symbolic interpretation. You have certain patterns that are universal. And if you use these patterns to interpret the story, it will reveal the nature of the story to you. It will make it obvious, it will make it clear, just like a theory reveals the nature of reality. When it works, when it's right, of course, it has to be correct. If you have a wrong theory, then it doesn't help you at all. Same thing with an interpretation. If you have a wrong interpretation, it will mislead you. But if you're honest, if you're honest about it, you'll see that it doesn't work if you're dishonest. So you can always fool yourself. Of course, anybody can do that. But. But that's not. This is one of the reasons why certain people are against the idea of a symbolic interpretation, is they're worried about this possibility of interpreting things however you want. Yeah, but that problem is an everyday problem. It's not just a problem of interpreting the Bible. I mean, the problem of having a faulty interpretation of reality is a problem that everyone's faced with. So it doesn't go away when all of a sudden you refuse to do it. With a biblical narrative. It's something we do every single day in everyday life. We interpret reality with a theory. If we're wrong, we're screwed. It hurts us, it harms us. So that that problem doesn't disappear. It's always there. So it's there when you interpret the Bible too. It's there when you interpret something that somebody tells you outside or at your job. It's always there. So there's no way out of that. Out of that problem. So."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3665.75,"end":3690.36,"speaker":"Jonathan Pageau","text":"One of the. One of the craziest ones, the craziest ones that someone wrote me recently about, about that and about this type of lateral interpretation of symbolism. Whereas, like, every symbol that he could come up with was basically a symbol for mushrooms. It's basically like drugs. Yeah, drugs. It was all drugs. And it's like, you know, that doesn't help. Like, how does that help you? Like, why would you read A story that hides all."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3690.52,"end":3692.76,"speaker":"Matthieu Pageau","text":"A hidden code for drugs that hides."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3692.76,"end":3694.44,"speaker":"Jonathan Pageau","text":"References to drugs in it. Like."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3694.6,"end":3750,"speaker":"Matthieu Pageau","text":"But the funny thing is, the funny thing is, the funny part of that is if that person has the right understanding of what intoxication is, then that person would be able to find places in the Bible that actually are about intoxication and understand the deep meaning of intoxication. See, so if that person had the right honest mind frame about understanding a story, then his fetish about intoxication would be answered in the Bible. Because intoxication is part of the Bible. There's the story of Noah. He drinks wine and I mean, it's not absurd to say, for example, that the tree of the knowledge of good and evil was a form of intoxication. Yeah, I mean, if he interprets it like that, that's not what they're doing. Yes, you're right."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3750,"end":3772.11,"speaker":"Jonathan Pageau","text":"They're saying it's like a hidden veiled. It's a hidden meaning, which is to show that, that, you know, ancient people took mushrooms to, to have, to have like, spiritual experiences. Like, that's what the story means. It's like, I'm not, I don't even know. I'm not even denying that maybe ancient people took mushrooms to have spiritual experiences. But like, does that really think that that story, like, that's the point of that story?"}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3772.59,"end":3776.19,"speaker":"Matthieu Pageau","text":"Yeah, that. Yeah, when it is, when it is, it is."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3776.27,"end":3780.83,"speaker":"Jonathan Pageau","text":"Western civilization is just about someone taking mushrooms. My goodness."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3781.35,"end":3800.39,"speaker":"Matthieu Pageau","text":"I don't think you're very good at building a civilization when you're always high on mushrooms. I doubt it. But the funny thing is that symbolism is important in the Bible. It is important. And that's the thing. When you have an honest approach, you will find those places in the Bible."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3800.39,"end":3806.39,"speaker":"Jonathan Pageau","text":"But not just honest, but also a desire to go to more unitive forms of meaning instead of."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3806.39,"end":3807.99,"speaker":"Matthieu Pageau","text":"It's not all about being intoxicated."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3808.47,"end":3847.8,"speaker":"Jonathan Pageau","text":"Not just about being intoxicated, but about act. But about this idea of a veiled, A veiled illusion to some, some like, social practice that they're not talking about. So it's like it doesn't even show you the meaning of intoxication. It's just to show you that people used to take mushrooms and now they're hiding it from you. Yeah, the church is hiding from you. That, that, that, that, that, that people used to take mushrooms because they, they're, they're evil and they don't want you to know that that's a way to. They want to control some spirituality. So they're hiding the fact that people used to take mushrooms, but it's still there kind of, you know, lingering in the stories, and it's like. It's all about people used to take mushrooms. It's like."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3847.8,"end":3850.4,"speaker":"Matthieu Pageau","text":"Yeah, well, that, that's. Yeah, it's a good example."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3850.64,"end":3852,"speaker":"Jonathan Pageau","text":"The nature of the universe."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3852.08,"end":3887.78,"speaker":"Matthieu Pageau","text":"It doesn't even tell you anything about the nature of taking mushrooms. But the. Yeah, that's. It's a good example of what you were saying of a. Of a horizontal interpretation. You just replace something with. With something else. It's like symbolism is just a replacement of one thing by another. That means something else. So that's not what symbolism is. It's the opposite of what symbolism is, actually symbolism. The idea of true symbolism is to reveal things, not to hide them. Reveal things that we usually wouldn't understand easily because they're too abstract."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3888.02,"end":3889.22,"speaker":"Jonathan Pageau","text":"Yeah, they're."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3889.87,"end":3940.36,"speaker":"Matthieu Pageau","text":"So it's this exactly the same thing as a scientific experiment. You're performing an experiment. It makes the abstract concrete, it makes it real. Then you can recognize it. So like the example I was before of dropping the two cannonballs from the tower of Galileo. Well, it's an event which has cosmic meaning, cosmic implications, because it reveals the nature of gravity. So the whole point of that is not to hide the nature of gravity, is to reveal it in an event. So. Yeah, so the idea that symbolism is like a crypto language or something like that, a cryptic way of talking with opposites, because that's what it ends up being. Yeah, it's completely false."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3941.8,"end":3975.4,"speaker":"Jonathan Pageau","text":"I think that comes from what I was talking about before. Like that something happened in the late Middle Ages or during the Renaissance where there was this split, you know, of. Of like the more kind of literal things and then the. The higher falutin type of. Of spiritualism, let's say occult. Occultism and all that stuff, it seemed like that's part of it, like that. And so the whole tradition of secret societies in the west and stuff, had they. They did have that idea somehow hiding, you know, like Freemasons have that idea of, like, hiding, you know, the meaning."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":3975.56,"end":4027.14,"speaker":"Matthieu Pageau","text":"I think when they have that idea, it's because they've lost the meaning. That's what I think. I mean, I've recently read some people talking about the meaning of Freemason stuff, and it was supposedly written by a Freemason. And I was. I was amazed at how dumb it was, what it was saying, because when I looked at their symbolism, I thought it was. It made sense. Yes, it was expressing universal truth. But when I looked at the explanation that the person who wrote the book was giving, who was supposedly a Freemason. In my mind I was saying you lost your symbolism, you lost your own symbolism. And now you're trying to explain it as a cryptic thing. But it's the only reason you're doing that is because you've lost it. You don't know what it is. You don't have what it takes to get to understand it. So you're trying to give it some other meaning that has nothing to do with, with what it is. That's why I see it."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":4027.14,"end":4052.9,"speaker":"Jonathan Pageau","text":"Anyway, no, I, it was the same, I had the same experience. I, I, yeah, I spoke, I spoke with it two years ago with a 33rd degree Mason and I was, I never met like a high level, high ranking Mason before. So I was like, I was asking a lot of questions and they were telling me about some of the symbolism that they have. And I was like, oh, that's actually pretty interesting. Like they, they have like, they have like this uncut stone and cut, uncut wall and cut wall. And I was like, wow, that's actually."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":4053.27,"end":4055.55,"speaker":"Matthieu Pageau","text":"Like really, it's traditional symbolism."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":4055.55,"end":4064.23,"speaker":"Jonathan Pageau","text":"But then it's like. And I was trying to get him like to talk about it and it was like there was nothing beyond it. Like it was just, there was no sense anyways."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":4064.39,"end":4064.95,"speaker":"Matthieu Pageau","text":"Yeah."}
{"episode_id":"SW - #013 - 2018-08-22 - What Is Symbolism - With Matthieu Pageau","start":4067.03,"end":4152.1,"speaker":"Jonathan Pageau","text":"All right. I think that now that we've, now that we've entered like talking about Freemasonry, I think that means it's a time to finish our conversation. All right, So I want to just for the people watching. So we tried, Matthew and I, we tried to say things, to speak in a way that's understandable as much as possible. But we're so used to discussing symbolism together that it's possible that maybe sometimes we're off. So I'm asking all of you guys in the comment section to go ahead and ask questions or to tell us if we're, how, if our aim is right, like if the level that we're aiming at in the way we're describing things, if it's at the right level. So hopefully Matthieu will agree to do this again with me. That would be great. I hope he does. And like I said, we announced this during Jordan's, the interview with Jordan. Matthew just, he's finishing a book now. It's not totally finished, but he's almost finished a book about symbolism which really explores the structures in a very concise and very powerful way. And so we haven't figured out how we're going to get that out to people, if we're going to have it published by someone, if we're going to self publish, he's going to self publish. But just so you know that that's on the horizon and that we're going to keep announcing the steps of that coming towards you. So I hope you all enjoyed this video."}
