{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":0.08,"end":56.41,"speaker":"Jonathan Pageau","text":"It's been now several months since the ARC Conference in London. And in retrospect, there are a lot of things to think about, a lot of things that happened. One of the great things that happened at this conference was that I was able to invite a whole bunch of artists, including a large group of Orthodox artists. And so Andrew Gould, who is an amazing building designer, has been on my channel before, had the idea of doing a round table where, where we would talk about the possibility of saving civilization, but not from a political lens, but really from a art and culture lens. And so it was a great conversation late at night with some wonderful people. And I think you will definitely enjoy this. This is Jonathan Peugeot. Welcome to the Symbolic."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":67.59,"end":95.18,"speaker":"Andrew Gould","text":"Hello, everyone. We're here at the ARC conference in London. There's 4,000 people at this conference, but there were quite a few very interesting Orthodox artists present. So I thought let's gather us together and do a little roundtable discussion about the renewal of civilization from an arts and culture standpoint. We have here artist and illustrator Heather Paulington, Martin Shaw, author, mystic, hermit, Jonathan."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":98.46,"end":98.94,"speaker":"Aidan Hart","text":"Poet."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":98.94,"end":99.82,"speaker":"Jonathan Pageau","text":"We forgot poet."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":99.98,"end":100.62,"speaker":"Aidan Hart","text":"Very good."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":101.02,"end":144.89,"speaker":"Andrew Gould","text":"Jonathan Pigot, icon carver, runs the Symbolic World Publishing company. We have Ben Stamper, filmmaker. Vesper Stamper, artist, illustrator, author. Andrew Gould, designer of Orthodox churches and other traditional style buildings. And I run the Orthodox Arts Journal. We have Aidan Hart, British iconographer. We have here Kate Degrade and Neil Degrade, composers, musicians, filmmakers, and John Hears, restaurateur Tamada of Georgian Feast. So we've all been a bit frustrated here at the art conference because who."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":144.89,"end":145.65,"speaker":"Aidan Hart","text":"Are we talking about?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":145.81,"end":146.77,"speaker":"Jonathan Pageau","text":"It's supposed to be."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":150.83,"end":151.23,"speaker":"Martin Shaw","text":"For yourself."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":152.83,"end":186.8,"speaker":"Andrew Gould","text":"Well, what I mean is, here at the ARC Conference, most of the speakers are kind of on the policy and economics end of things. And so when they talk about the renewal of civilization, they're mostly talking about legislation and human rights issues. But we artists want to talk about civilization from an arts and culture standpoint. So Aidan here, I know, was recently speaking about the topic of the effect of architecture and the environment on humanity. Would you like to."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":187.36,"end":319.13,"speaker":"Aidan Hart","text":"Thank you, yes. I've been recently reading a book by Timothy Batistas, and he talks about beauty first and then truth follows. And I think we tend now to think of beauty as the icing on the cake. But I think true beauty has a profound effect on the soul. I have a. A saying I've developed recently that we act as we see. So if there's wrong action, if our civilization is decaying, then the question we need to ask is how are we seeing incorrectly the Greek word For repentance, metanoia means change of noose. And noose is often described as the eye of the heart. So a change of action is always preceded by a change of seeing. So I think the question if our civilization is in crisis, what's wrong is because it's seeing incorrectly. And I was very interested in what Mike Johnson said today in one of the talks is that the foundation of concepts like human rights, human freedom, is that we're made in God's image. If you have a society that forgets that we're made in God's image, which is beautiful, then all the other structures that develop from that collapse. So to me, repentance is really to do with becoming beautiful again. Something beautiful again. And orthodoxy, of course, means rights, glory. But doxa can mean teaching and worship, but also glory. So really, orthodoxy can be, I think, understood as right. Beauty becoming beautiful again. And I think architecture, which is your field. We were talking about this earlier that in England after the war, a lot of destruction had been wrought by Roman. They had to build lots of dwellings. So in Birmingham, knew where I lived, they put lots of really ugly, cheap concrete blocks. The social problems were enormous. Right. It brutalized the people living there. And it became so expensive because of all the social problems. It was cheaper to blow these hideous things up. And I got photographs of them blown up. And then they invest more money in making something a bit more beautiful. So ugliness is a precedent. I often thought we should revival of human rights and include in that. I don't like the term of rights, but let's just say man has a right to beauty. It's not icing on the cake. It's a human need."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":319.21,"end":319.85,"speaker":"Neil Degrade","text":"It's a need."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":320.73,"end":326.89,"speaker":"Aidan Hart","text":"So a good civilization puts beauty at the heart of it. Genus, town, players, architecture."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":327.29,"end":390.66,"speaker":"Andrew Gould","text":"Absolutely. And of course, civilization, somewhat specifically means civitas. It means city dwelling. A civilized people means people who live in cities, as opposed to hunters, gatherers. And we can see, looking at the art of, I would say the Victorian period more than any, that civilization was built largely through civic architecture. When the British Empire would go around the world, they would. One of the first things they would do, in a sense, to civilize countries was build things like train stations and government buildings and so forth. And because these buildings were beautiful, it was actually a vision of civilization that people could understand and believe in. And I do feel that the habit of the modern world to build even public civic architecture. Ugly is surely one of the things that has made modern people lose faith in all of the systems and Institutions that supposedly constitute civilization."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":391.46,"end":443.5,"speaker":"Aidan Hart","text":"Well, it's interesting that the Bible begins with the garda but ends in a city. So the city should be the culmination of all human endeavor because the city is the union. Obviously in the Bible it's the union of the bride and the bridegroom, but it's also communion, a marriage of one to another, which is beautiful. That's there's some. I mean the meaning of beauty. I mean the word art means joined together. It's this literal meaning of Samar's artist. And the city is described as joining together, isn't it? Of the architecture, the people. Do you think architecture can be described as a garment that's tailored to fit the body and basically the ultimate city is a loving relationship with God. That's the body. So the architecture, as it were, should start with man made in God's image. And ugly architecture is like a misfitting suit that can contorts me to get into it. Is that a good."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":443.5,"end":444.5,"speaker":"Andrew Gould","text":"Oh, for sure, for sure."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":444.5,"end":444.78,"speaker":"Ben Stamper","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":444.78,"end":507.16,"speaker":"Andrew Gould","text":"There's a wonderful humanity in beautiful traditional architecture that it's human scaled and it seems ennobled by the presence of people in it. One often gets the feeling with modernistic architecture that people are a sort of impurity imposed upon it. You know, in magazines it's photographed empty, with no people looking pristine and clean, nothing. But then when these modern buildings are actually used for a few years and there's smudges where people have rubbed up against the walls and everything's getting patinated and discolored, the building starts to look kind of terrible. In contrast to traditional architecture built out of timber and stone, these buildings get more beautiful with age. You know, the floors get polished by people walking on them, the timbers get burnished, the stones get beautifully discolored where people brush against them. And you look at a 500-year-old stone and timber building and most of its beauty is the beauty of the people who have been using it for 500 years. It really does have a symbiotic relationship with humanity."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":508.6,"end":514.76,"speaker":"Jonathan Pageau","text":"There's also in the. In Revelation when it talks about the new Jerusalem, it says that Jerusalem is."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":514.76,"end":517.56,"speaker":"Andrew Gould","text":"Adorned like a bride prepared for her groom."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":517.88,"end":519.24,"speaker":"Jonathan Pageau","text":"So there's a sense in which the."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":519.92,"end":523.04,"speaker":"Andrew Gould","text":"The wall of the city now that's made out of precious jewels and is."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":523.04,"end":524.84,"speaker":"Jonathan Pageau","text":"Gold is a vestment."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":524.84,"end":525.12,"speaker":"Aidan Hart","text":"Right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":525.12,"end":528.2,"speaker":"Jonathan Pageau","text":"It is that wedding dress that civilization."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":528.2,"end":531.28,"speaker":"Martin Shaw","text":"Is putting on to encounter the son of man."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":532.24,"end":595.55,"speaker":"Unregistered: Kate Degrade","text":"That's nice. Well, I've been getting into something kind of strange which is every once in a while on Netflix, I'll pull up one of these ancient civilization documentaries and. Well, why am I bringing that up? Well, because I want to talk about something I think we don't see often, like we can maybe bring to the conversation, which is that as soon, it seems as soon as civilizations began to appear and to develop architecture and buildings, they were attuned to what was above the heavens. And there seemed to be a natural human impulse to connect the heavens and the earth in that capacity, whether it's the pyramids that are aligned to the radius of the Earth or the astronomical events. And I don't, when I go out and look at architecture and the way we're building cities now, it doesn't. I don't ever hear a discussion of that impulse or see that that's what people are trying to do anymore. So I'm always trying to get to the bottom of how did this happen? Because I think this is. Well, as a Christian, the Lord's Prayer will be done on earth as it is in heaven. I think this is something innate to us that God put in us that either our technological build or the pace of our culture, what we're doing is kind of blur the idea that this is one of the points of architecture."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":596.51,"end":608.32,"speaker":"Neil Degrade","text":"I feel like we saw this at the Guild Hall. Like, I mean, just that building was glorious. And it's built on what, Roman. On a Roman amp theater. And the beauty is like we're supposed to be reminded of what we're fighting for."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":608.32,"end":608.52,"speaker":"Aidan Hart","text":"Right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":608.52,"end":609.44,"speaker":"Unregistered: Kate Degrade","text":"Or the English were."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":609.52,"end":611.84,"speaker":"Neil Degrade","text":"I was so overwhelmed by the beauty of that building."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":612.64,"end":613.12,"speaker":"Unregistered: Kate Degrade","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":613.28,"end":615.52,"speaker":"Neil Degrade","text":"It reminds you what you want."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":616.16,"end":616.52,"speaker":"Ben Stamper","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":616.52,"end":637.3,"speaker":"Andrew Gould","text":"Even in civic architecture, secular civic architecture of the 19th century, there is a cosmic symbolism in it. Like in the US Capitol building, you know, it's got a huge dome representing sort of universal dominion. And at the top of the dome is painted the apotheosis of George Washington. It's sort of the civic pantocriter, you know, America's God up there."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":637.46,"end":638.26,"speaker":"Martin Shaw","text":"Yeah, right, right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":638.42,"end":675.89,"speaker":"Andrew Gould","text":"Yeah. And then it has the sense of sprawling out as a big four square footprint up on hill that's like dominion over the four corners of the world. You know, classical architecture has a lot of the same symbolism that we see in Orthodox churches, you know, with the dome of heaven and the square of the earth and the union of the two. But you're absolutely right that modern civic architecture, modernistic architecture, is anti symbolism. It's abstract forms that the architect may claim they symbolize something or other, but it's something personal that is only meaningful to him. It's not Something universally recognizable, do you think?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":675.89,"end":702.56,"speaker":"Aidan Hart","text":"As well as architecture fitting the human person made in large image, it can also work the other way, where it's actually larger and more sublime than we are. So we actually expand into it. We go into a beautiful building. Actually, it says, you're not a groveling worm. You actually stand up and fill that space. Can it work that way as well? Actually, it's ahead of you as well as fitting you. Yeah, that's just a thought I've had now."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":702.56,"end":704.56,"speaker":"Martin Shaw","text":"Is that St. Maximus, you know, he."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":704.56,"end":718.22,"speaker":"Jonathan Pageau","text":"Talks about the cosmos as macro anthropos. The idea that on the one hand, we are a microcosm of the cosmos, but the cosmos is an expansion also of the humans. And that's necessarily so because we also are the ones to perceive it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":718.22,"end":721.02,"speaker":"Unregistered: Kate Degrade","text":"We're the ones to give it meaning and to engage with it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":721.02,"end":734.82,"speaker":"Jonathan Pageau","text":"And so it appears. And so it's normal that people would build these buildings that would be almost like kind of like this expansion of the human scale into the cosmos. That's probably why we feel the way we do partly in these buildings."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":735.28,"end":738.48,"speaker":"Unregistered: Kate Degrade","text":"Rather the difference between, for example, here."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":738.8,"end":740.4,"speaker":"Jonathan Pageau","text":"Like this building here, where we are."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":742.4,"end":743.68,"speaker":"Andrew Gould","text":"It's so arbitrary."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":743.68,"end":752.52,"speaker":"Jonathan Pageau","text":"Like, everything about it is arbitrary. The spaces are contrived and the sizes are mirrored. We don't totally understand what these large."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":752.52,"end":755.68,"speaker":"Unregistered: Kate Degrade","text":"Halls that are just very strange and abstract. And so there's."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":755.68,"end":763.49,"speaker":"Jonathan Pageau","text":"Everybody feels awkward in the space and kind of disoriented. It doesn't actually know. And it's made to know what to."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":763.49,"end":764.25,"speaker":"Aidan Hart","text":"Do and where to go."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":764.25,"end":765.85,"speaker":"Unregistered: Kate Degrade","text":"But you actually feel the opposite."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":767.21,"end":785.61,"speaker":"Aidan Hart","text":"The art, the architecture of a table at a supra. If you try to do it at a circle, immediately the commandant is confusing who's the leader of the table, who will eat toast. And immediately the toast become democratic in nature. You see it all."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":785.61,"end":786.89,"speaker":"Jonathan Pageau","text":"Who's the head of the table?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":787.17,"end":810.49,"speaker":"Aidan Hart","text":"And you really can speak that you can still be the head and present as an image of the head. But the toasts change. Much like if you build a certain kind of building within it, I might grow into it. You change the table and the toasts change. And the way people interact change. Better or worse, you can argue, but you can't do a super the same way. You can't do a Georgian fish the same way."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":810.49,"end":811.09,"speaker":"Unregistered: John Hears","text":"It changes."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":812.05,"end":818.13,"speaker":"Unregistered: Kate Degrade","text":"Unless the novelty of King Arthur in the round table, right. There's inequality to the perceptions in that setting, right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":818.13,"end":818.61,"speaker":"Jonathan Pageau","text":"That can."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":818.61,"end":825.05,"speaker":"Unregistered: Kate Degrade","text":"There's moments where that's good, but also you don't know where to look. Like we were used to focusing On a thing and the other things blurred in the periphery."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":825.05,"end":828.29,"speaker":"Aidan Hart","text":"Did you feel that in. In the room today?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":828.37,"end":828.85,"speaker":"Ben Stamper","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":829.09,"end":834.05,"speaker":"Aidan Hart","text":"Did you feel it? I think everyone wants to say God, but you said it last year."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":835.09,"end":836.13,"speaker":"Martin Shaw","text":"I said it this year."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":836.13,"end":837.21,"speaker":"Aidan Hart","text":"You said it this year? Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":837.21,"end":837.89,"speaker":"Unregistered: Kate Degrade","text":"How dare you."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":837.97,"end":840.05,"speaker":"Martin Shaw","text":"I think it's rich. A lot of people said it's."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":840.45,"end":841.56,"speaker":"Aidan Hart","text":"I was surprised so much."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":841.56,"end":843.48,"speaker":"Jonathan Pageau","text":"And last year very few people said it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":843.48,"end":908.58,"speaker":"Aidan Hart","text":"By the way, I think a lot of people, in my opinion today did try. Oh, yeah. But there's a lot of vocabulary. But I wonder if the hall. When they understand anthros is made in God's image. I think we say it. I don't think we really know. That's a crazy concept. That's the way I'm not sure people actually believe it. I'm not sure I believe it half the time, you know, and that's. I kept seeing that in there, which is like they know what they're saying. Helen. I'm interested, Martin, that the phrase you use, you're like an architect of words. You said you want to rehydrate the expression of a Christian truth. So we're talking about an architecture that, as it were, follows archetypes. So there's a continuity. But you're wanting to say the same things, but in a fresh way that wakes us up, that, you know, it's like each actual Orthodox Church can 10 Orthodox churches equally beautiful, but there's diversity. So each one of those must have been a little bit different than what people have seen before. Enough to wake them up. I'd like to hear what you have to say about this Rehydrating the expression of timeless truths."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":908.66,"end":1059.14,"speaker":"Martin Shaw","text":"Well, whenever a culture is in crisis, the genius required never comes from the center of the Round Table, comes from the edge. It's something that the Kalahari Bushmen know. This obsession with screens that we have, it's hypnotic and it's trance involving. And good Christianity causes you to see out of the edges of your vision all these strange trembling bells that are around us. So that's why you have all these Arthurian knights charging off all of the time into the forest. Now, yesterday, only yesterday, I was at liturgy in Galway and it was a wonderful experience. The deep interior was reached. And then someone asked me, what was the most meaningful part of the liturgy for you yesterday? I said it was when the door briefly opened and I heard seagulls. That was the moment. That was the moment. And that's the Irish in me. That's the Irish in me. Where it is. We talk today about the Notion that the soul is probably much bigger than the body. You know, we're always gesturing to our chest. But any aboriginal understanding, any. For me, a deeply Christian understanding of the soul is something that you go walk about in. And so when you build culture, and I'm a fan of Christian culture, I believe in Christian culture. But the word culture comes from Kolair, which means to dig, means to dig. So as artists, we dig. Whether as Seamus Heaney says we did with our pen or we dig with our quill or we did with our spade, we're involved in something that actually is taking us down. I'm interested in the Christianity of the Lascaux Caves as well as I am the Notre Dame Cathedral. I'm interested in a way, the underworld of Christianity as well as the overworld, that once you can design things, you have a different kind of sacred space to going into the caves. And just because of the way, some of you will know the story of how God revealed himself to me, it came in a very unusual fashion and I have to be loyal. Here's a lovely. I will be loyal to the bells of my village, will be loyal to the bells of my experience. And that is telling me to keep an eye out for the Gospel of the Cormorant and the Gospel of the seagulls and the Gospel of the. The green teeth of the river. Anyway, sorry, I'm taking space. No, that's beautiful."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1061.86,"end":1129.55,"speaker":"Unregistered: John Hears","text":"It reminds me of a time that I gave a drink of water to a friend in this great glass. It was like. It was this green goblet that we had and it was just this really handcrafted hand blown glass cup. And he. And it was very heavy and he picked it up and he took a swig of water and he said that is a Christian drink. And what he was saying, I think it touches on what you're saying, Martin, is this idea that their Christian culture, that's like a testament to what Christian culture can be. Something that is so has weight and it has substance that is rooted in reality. It's rooted in something that that has. It extends beyond its use, you know, And I always remember that because it can transform a cup of water and give it something. It's like it's full essence of its wateriness."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1130.27,"end":1196.4,"speaker":"Andrew Gould","text":"Consider how material things are able to bring out the image of God in people. That of course, clothes are ennobling. Someone wearing really beautiful clothes looks like. Looks like a far more complete human being, a more noble creature. And architecture, of course, does this as well. Just yesterday I was Touring Hampton Court Palace. And I was so struck that in the setting of that palace and gardens, just seeing another person, a tourist, anybody in that setting, they look like princes and princesses. I was just amazed how beautiful people look like. They look like storybook characters, more real than the mundane people of the everyday world. And a whole city can do this. Of course, when you're in a really beautiful historic city where all the buildings and streets of Europe, beautiful people seem more real than when you're in an ugly city and people seem like mere shadows of themselves. You know, mindless ghosts suffering through life."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1197.92,"end":1205.04,"speaker":"Unregistered: John Hears","text":"Sort of the Giacometti sculptures, you know, the people wandering. The very thin sculptures."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1205.12,"end":1205.72,"speaker":"Andrew Gould","text":"That's right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1205.72,"end":1211.76,"speaker":"Unregistered: John Hears","text":"They're wandering in space, but they're not interacting. They're walking in different directions, and they're. They're never intersecting."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1212.79,"end":1227.75,"speaker":"Andrew Gould","text":"So I see beautiful civic art and architecture in general as, in a way, an analogous project to the work of churches, of actually trying to make the image of God shine through us more clearly."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1228.15,"end":1235.03,"speaker":"Martin Shaw","text":"Do you remember the old Ethiopian idea that the church is a little dodgy if there isn't a forest around it? Wonderful."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1235.11,"end":1235.59,"speaker":"Ben Stamper","text":"Yes."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1235.59,"end":1278,"speaker":"Martin Shaw","text":"A lot of these Ethiopian churches, they build forests around the church because the forest, the church on its own, is going to die of loneliness. It's going to die of loneliness if it doesn't have a forest around it. I'm thinking now of the great patron saint of orthodoxy, William Blake, who would say Jesus is the imagination and you can't be a Christian without becoming an artist, because once that wily quixotic teacher gets inside you, he's going to bend your head and you're going to start seeing the fall, and you're going to start seeing the rapture and everything else that is happening through his eyes. And I just wonder, throwing the question out to us, if you could make a city, what would it look like?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1278.56,"end":1295.09,"speaker":"Aidan Hart","text":"What would yours look like, do you think? Every prophet, every city needs its prophets, and the prophets need a city. So you idea the seagull outside flying around free, the seagull by itself without the church are being complete and the church without the forest, the ocean."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1295.25,"end":1295.73,"speaker":"Martin Shaw","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1296.05,"end":1314.49,"speaker":"Aidan Hart","text":"When I was a hermit, I had this fresco de chapel, which is like the city you had all the saints around. It was organized at a geometric pattern on the floor. But I spent a lot of time there playing the liturgy, which is like the work of the city, if you like. But then also I'd go up to the hills, the wild hills, the cypress stones, to pray the Jesus prayer. And one needed the other."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1314.49,"end":1350.28,"speaker":"Martin Shaw","text":"That's it, it's, it's the thread. It's why we need the monastic so desperately. But there's something about chivalry, there's something about gallantry, there's something about that happened in the 12th and 13th century that has enormous clues for us as Christians that are going to have families and we're going to have kids and we're going to have to reach out and touch the world. And the wonderful thing is we don't have to choose one over the other. We can live, as this psychologist say, in the tension of the opposites. So as Christians, we are both steadfast and restless and I think that's artistically cool."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1351.96,"end":1476.7,"speaker":"Jonathan Pageau","text":"This is it, folks. This might just be the culmination of my life's work. Join me for the symbolism masterclass this April 2025. During this course, I'll take you by the hand into the essentials and depths of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a consistent, concise and comprehensive way, I'll teach you everything about how I think so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and and changing at an increasingly rapid pace, being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class we will talk about so many things, about heaven and earth, the sacred and the secular, the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years and and much more as well now. All in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas and to make sure you have a strong foundation of the fundamentals. Plus getting some hidden gems that I've never shared before. So don't miss out on the live experience and register Today."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1477.64,"end":1575.1,"speaker":"Vesper Stamper","text":"There was A few years ago, we were in the Tate Modern, and my family knows this was a really rough experience for me. I don't do well with brutalism. And the entire time that we were in there, I felt like the building was going to fall down on me. I felt extremely threatened and claustrophobic. And as we're talking, I was thinking about that experience as the Tate is built as a temple to art, you know, and in all of this civic architecture that you're talking about, there's a sense in which these buildings are temples to human beings. You know, whether it's a civic building or a church, that they're ennobling to the human being. Right. But when you have a temple to art, it's kind of like the underworld. It's the upside down of that, you know, and you can feel like the artwork is sort of this disembodied thing that we. That we worship. And it doesn't have. Have anything to do with you. It's externalized. And this is a really modern thing. When we started building these temples to art, or taking art out of the churches or out of the palaces and putting them in their own buildings, it was at the time where the conception of the human being was really falling apart. And so now we have this. This myth of the genius artist as the person to be worshiped, as the entity to be worshiped, and the things that they make. But you can just as easily fake those things if they're not connected to the human person creating them from a body that's just one of you. You know what I mean?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1575.26,"end":1597.99,"speaker":"Aidan Hart","text":"Something you said, Heather, yesterday, today really struck me. Your set designer and films. You said the first thing is to capture the spirit, understand the spirit spirit of that epoch. Whatever the details had to be true to that spirit, otherwise it doesn't work at Jazz. So what you're saying, you've got to know what. Why you're creating that city, why you're creating a building. Have a vision, and whatever's undevicient, it will be an unguarded building."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1598.15,"end":1615.21,"speaker":"Vesper Stamper","text":"If these are sort of temples to human beings, in a way, right. It's because we're made in the image of God, that we deserve it, in a sense. And so if it's removed from the human aspect of it and it's just a temple to itself, that's why it feels like, to me, hell."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1615.69,"end":1655.88,"speaker":"Unregistered: John Hears","text":"But I think also, I think that's talking about the intent of the architect, but also I think it's important to consider the patterns of humans and how they move through space and what space does to them. Because good architecture, or good art in general, includes that information in its design. And so that. Why do you walk into a building and suddenly feel at ease? It's likely because it follows the patterns of human nature and accommodates as a human centric."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1656.12,"end":1684.73,"speaker":"Ben Stamper","text":"I was talking to Andrew today about the layout when we had lunch, and I think that's one. The single most thing that's most disturbing about ARC environment is I didn't understand at first. I was like, why are we directed like this? And Andrew said, oh, it's a completely flexible space, so you can open all those doors and reconfigure the whole thing. And I realized there isn't even a single purpose to the thing that we're in, which is why we all feel strained. Like this building would have a sense of an entrance and an exit. But this is even worse."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1684.73,"end":1694.98,"speaker":"Andrew Gould","text":"It feels like. It feels like a laboratory rat maze. They keep opening a door or moving a wall to see if the rat can figure out where to go next. Absolutely, that's true."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1694.98,"end":1697.26,"speaker":"Aidan Hart","text":"Like an IQ test or let's get to go out."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1698.3,"end":1754.29,"speaker":"Ben Stamper","text":"When we were in the film world, it's like architecture kind of on steroids because everything gets decided very quickly and you basically have a story or an idea, and we'd have to move quite quickly and test it. And actually we found that building something is a way of testing out your ideas. So I know you said at the beginning, Aidan, it's like you have the principle has to be right at first, which is true. But then the process of building will test those ideas out and show things that are false that could fall away. And I've had the sense of the last arc and this one indeed, that some of the ideas I've been hearing, they don't quite hear. They're inconsistent. And what I want to say is, like, show me the building that represents that philosophy and then we can see. See what it is. Because at the moment, that to me, doesn't make sense. You can't build that temple. Yeah, but a church can stand, because there's been thought about how to represent that."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1755.41,"end":1764.17,"speaker":"Vesper Stamper","text":"Oh, sorry. There was the one talk about energy where it was presented as a positive that people were pulled out of the fields and put into factories. And I thought, what?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1764.17,"end":1764.77,"speaker":"Unregistered: Kate Degrade","text":"Heartbreaking."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1765.17,"end":1765.89,"speaker":"Andrew Gould","text":"Heartbreaking."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1766.29,"end":1767.01,"speaker":"Vesper Stamper","text":"No, no, no."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1767.57,"end":1905.39,"speaker":"Andrew Gould","text":"You know, in America, they used to be a phrase, the palace of the people. When the Victorian era, Americans built these huge domed capitol buildings, the state houses, that's what they called them as a palace of the people, to Distinguish them from a palace for the king or the aristocrat in the old world. And yet these buildings, they actually are kind of laid out like palaces. They'll have a huge sort of rotunda and grand staircase that's mainly for the purpose of sitting, seeing well dressed people coming and going theatrically on display. And then they have exits out to the grounds and the gardens just in every direction. You can just come into the building, you can see and be seen, you can walk out. It's a very old fashioned aristocratic concept of civic architecture. In fact, all of those state houses have to have another ugly modern building next to them or buried in the earth under them, where they have all, all of the offices with secure corridors and locked doors. That's where the real business takes place. Because really the actual palace of the people, it's totally public, it's designed that way. But that's. But those buildings, they have the ennobling quality that all these talks we're hearing at ARIC are about of the fullness of human civilization. People have to interact, they have to see each other. They have to go up and look down and go down and look up and everybody can find their place in a building like that. The extroverts can come out under the dome and the introverts can walk back under the balconies. And it's really beautiful. Yeah, yeah, yeah. It's where you contrast that to a modern building that's, you know, designed as a machine for some social purpose. Like, you know, compare a classical art museum that's sort of like what I just described described to Frank Lloyd Wright's Guggenheim Art Museum in New York, where the only way to go to that museum is you take an elevator to the top and then you walk down the descending helical ramp and then you get spat out the bottom. It's like you can only use that building one way. So the people in the building just feel like ball bearings going down. A kinetic sculpture. There's no place for people to have any individuality in the. That concept of architecture."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1906.11,"end":1915.59,"speaker":"Vesper Stamper","text":"I'm interested to. To know from like the musical. We've been talking a lot about architecture, but like from the musical perspective, how do you. How can you create a space for people?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1915.59,"end":1932.09,"speaker":"Neil Degrade","text":"The thing that keeps coming to my mind, which I'm certainly not an expert, but is that today I keep having people come to me and tell me that the songs were their favorite part, our song, and then someone else sang too. And they're very nice. Yeah, but no, but many times it's like, that was the moment for me."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1932.09,"end":1932.41,"speaker":"Aidan Hart","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1932.41,"end":1937.85,"speaker":"Neil Degrade","text":"Thanks, Neil. So. And that's what that represented. Ten minutes, maybe."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1938.01,"end":1938.41,"speaker":"Aidan Hart","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1938.41,"end":1949.77,"speaker":"Neil Degrade","text":"You know, at least the songs. And so I do think that something can get across through music that can pierce the heart. If it's beautiful music."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1949.77,"end":1951.05,"speaker":"Unregistered: Kate Degrade","text":"Well, it's a presentational art."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1951.05,"end":1952.09,"speaker":"Neil Degrade","text":"It's not representational."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":1952.09,"end":2032.68,"speaker":"Unregistered: Kate Degrade","text":"We can't explain exactly why it works. How do we take these frequencies and time and turn them into something we can name and have a feeling that you can't experience all at the same time? It's linear, like reading versus looking at a picture, which is simultaneous. So music, it falls into a linear art. But when I think about what you guys are talking about, too. So this is something I've been working on in music a lot, because it's very hard in just music to point at a thing. Like, what thing are you pointing out to me? What does that remind me of? It's like, you know, you can think of classical pieces like Peter and the Wolf where it's mimicking animal behavior and stuff, and you can get a sense on why these things translate back and forth. But I think that part of the problem of what we're talking about and has hit the music industry and it's hit architecture and civilization in general, is that I have so much abstract art I really love, because I love the game of abstract art to a point where it is, how far can we take it from what you're familiar with? And you still see the golden thread in the image. And there's some abstract art that does this so wonderfully. But the exploration of that also began to blur what things really are and what they're not. Because, for example, if people on both sides and someone in Hollywood gets up and they're like. They state their political views, you're fine with it. So you disagree. And then you're like, artists should shut up about their political views."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2032.76,"end":2033.04,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2033.04,"end":2085.92,"speaker":"Unregistered: Kate Degrade","text":"It's because, okay, so the problem with the naming, the definitiveness, and the idea that we're looking for something objective, a solid place to stand, that doesn't afford people their own dominion. So there was something about abstraction where that blur, like, you know, you go to the art museum with your art teacher, and I'm in Boston, this actually happens. And we're looking at this abstract piece of art. And he's like, what do you guys think it is? And someone's like, it's a Mediterranean villa. And the other person's like, it's a duck. And you're like, this is not necessarily helpful. Like, this is a weird game. But that blur allows us what it affords us the opportunity to take sort of that idea of God naming and deciding and ordaining and bring it into our own hands and using it for our own purposes. So I think this is part of what we're fighting against, is that when things point, it doesn't fit the modern mindset that we've been brought up on, where the subjective is what's important."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2086.16,"end":2091.92,"speaker":"Martin Shaw","text":"We live in a culture that supports any spiritual seeker. They're going to hate you if you find something."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2093.04,"end":2094.24,"speaker":"Aidan Hart","text":"It's racist yourself."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2095.73,"end":2168,"speaker":"Martin Shaw","text":"They're gonna hate you when you find something. Now, Tolkien, Tolkien had a very interesting thing to say about Irish myth. He said Irish myth as opposed to Anglo Saxon or the wonderful Norse pantheon. He said it's like a beautiful stained glass window that someone has chucked a stone through. He said it is unreasoned. And he said the Irish are unreasoned. And I'm writing a book at the moment explaining why that's part of the journey. Genius of the Irish. And actually, as an artist, as a brick alert, there's a lot you can do with things when you're left in the rubble. Don't despair. Take courage. Take courage. Because actually, and I think this is. This leads us towards talking about orthodoxy. Orthodoxy I find tremendously interesting as an artist because from a distance it looks like it's all about tradition. But you get in there, you get in there and there's tremendous creative vitality. And actually, simply by the business of being troubled human beings, we can't help but keep the thing moving along. But often it's about accident rather than a trance state with innovation and originality being the thing. When the thing comes, God is in the house."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2170.08,"end":2196.36,"speaker":"Jonathan Pageau","text":"When people often ask me if I'm making icons, how do I express myself or should I express myself or should I even think about that? And I always tell them, just do the thing and then you'll be in there. Don't worry about that. If you worry about it, that's when it becomes weird. But if you just do the thing and you make the images in service of God and in service of the church, then people will see your hand in there, but you don't have to."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2196.36,"end":2197.84,"speaker":"Unregistered: Kate Degrade","text":"Make it the purpose."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2197.92,"end":2198.32,"speaker":"Martin Shaw","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2198.32,"end":2204.08,"speaker":"Unregistered: John Hears","text":"Art, as it turns out, is not primarily a form of self expression."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2204.08,"end":2213.34,"speaker":"Jonathan Pageau","text":"Yeah. But I mean, I can recognize Aiden's icon from very far away. I'm like, well, that's Aiden's icon. Yeah, but that's the point of what he's doing."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2214.22,"end":2248.15,"speaker":"Aidan Hart","text":"It's fascinating how the book of Revelation, it talks about a name being given to someone. They don't take it, they don't invent it. And often it's written at the forehead in one verse. I can't read my own forehead. You have got to reveal my name to me. Beautiful. So immediately I make up the name. It doesn't really express me. And Transseraph said that when Adam named the animal, it wasn't arbitrary. He's perceived the logos of that animal and that name is a manifestation of the character of that particular thing."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2250.15,"end":2251.19,"speaker":"Vesper Stamper","text":"I think a lot about."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2252.95,"end":2253.51,"speaker":"Ben Stamper","text":"The current."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2253.67,"end":2269.92,"speaker":"Vesper Stamper","text":"Mindset of artists as activists, and it seems like it's, you know, you start with the activism, you start with the message that you want to convey, and you sort of apply it to a medium, whether that's painting or music or architecture or whatever."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2269.92,"end":2270.32,"speaker":"Ben Stamper","text":"And."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2272.08,"end":2326.37,"speaker":"Vesper Stamper","text":"This is why it doesn't feel right, because it's applied. It's not coming from the soul or from the heart. And I think a lot about how as artists, we begin the work in the body, we receive stimulus, we process it through our five senses before we. Before it is pre verbal, you know, and that's where the work comes from. And that's the work that people respond to on, on that same pre verbal level because they're feeling it in their own bodies. Whereas when you start with a kind of, you know, message based or vehicle based kind of thing, it's forgettable. It's. It's instantly forgettable. It doesn't touch people on that level. And I think that it doesn't matter what your political persuasion is. People on the left can do it. People on the, you know, I see the conservatives trying to, you know, get into the. To the art making world. And a lot of it is really bad. I'm sorry, you know, I'm gonna say it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2326.37,"end":2327.29,"speaker":"Jonathan Pageau","text":"No, no one here."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2328.81,"end":2329.13,"speaker":"Andrew Gould","text":"No."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2329.13,"end":2340.17,"speaker":"Vesper Stamper","text":"But a lot of it is really bad because it's like, well, you know, we have this. The moral of the children's book, you know, have a book about this thing and it's like, that's not what stories are."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2340.25,"end":2341.61,"speaker":"Unregistered: Kate Degrade","text":"They almost killed Martin with that."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2343.22,"end":2344.26,"speaker":"Vesper Stamper","text":"But that's not what a story is."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2344.26,"end":2345.38,"speaker":"Aidan Hart","text":"I saw his soul start to leave."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2345.38,"end":2348.5,"speaker":"Martin Shaw","text":"His body and he died in front of."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2349.06,"end":2350.18,"speaker":"Unregistered: Kate Degrade","text":"It was a sad day."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2350.18,"end":2355.78,"speaker":"Vesper Stamper","text":"But it's not what a story is. It's not what a book is. It's not what a child is, you know."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2355.86,"end":2356.34,"speaker":"Andrew Gould","text":"Yes."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2357.3,"end":2376.97,"speaker":"Neil Degrade","text":"And what about the healing aspect of art as a creator? Not just the art we make for others, but what it does to you to create and how that changes society. Like how many addictions have been healed through learning to garden or taking up a craft? Like, we need art to heal also individuals, artist presence."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2377.53,"end":2378.33,"speaker":"Unregistered: John Hears","text":"Human presence."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2378.33,"end":2378.65,"speaker":"Neil Degrade","text":"Right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2378.65,"end":2379.13,"speaker":"Unregistered: Kate Degrade","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2380.09,"end":2383.29,"speaker":"Unregistered: John Hears","text":"To be present and hold the thing."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2384.33,"end":2409.33,"speaker":"Martin Shaw","text":"I think Aidan, something Aidan said at the beginning was terribly important. Beauty and beauty. The etymology of the word, you know, is Anglo, French, and there's beautiful in it. And it's also to do with. A wonderful thing about beauty in the etymology of the word is to do with actually how you behave. It's new with courtesy. So with brigands like us, the good news is that we can work on ourselves. So know, there's."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2409.33,"end":2409.77,"speaker":"Ben Stamper","text":"There's a."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2409.77,"end":2428.09,"speaker":"Martin Shaw","text":"There's. The best form of beauty has theosis in it. And theosis, from an Irish perspective would be this phrase. And I'm going to give you gold now onto yourself. It means. It means be wise to your nonsense. Be wise to your."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2428.09,"end":2429.13,"speaker":"Unregistered: Kate Degrade","text":"Be attentive thyself."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2431.69,"end":2466.5,"speaker":"Martin Shaw","text":"Try that in a Galway bar and see how it goes. I love the notion that real beauty actually has trouble in it, because reverie always leads to participation. It's not passive, actually. Beauty is going to open a door. And if ever I meet someone who is significantly irritated by the Christian part of my life, which is my whole life, you go to beauty, lean into beauty, find out what temple they serve in, because we're all serving in one or another, and take it from there."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2466.5,"end":2466.9,"speaker":"Ben Stamper","text":"But this."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2466.9,"end":2472.86,"speaker":"Martin Shaw","text":"This notion of beauty and how we recognize it, very interesting in me, the."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2472.86,"end":2535.41,"speaker":"Aidan Hart","text":"Art of tamada in Georgia is a oral tradition handed down. There's a debate about how far down. Some people say it's really 17th century. I think it goes back to the agape feast. Tamada's job is to literally not think about what he wants you to know, but it's to imbibe what you need as per this moment. And so there's something about what you were saying is the artist job is to fall back. Right. And to fall into everyone else. And so I like the idea you're really adhering to others and making the art. And I really resonates as automata because there's so many times you want to tell the table about what they should know, which I think that's bad art. That's the art you're describing, but somehow you have to say something. And so I find myself imbibing you in the moment. And then the toast to all of us is really about you, and it's not about me if I do it right. It's hard to do It. Right."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2535.65,"end":2549.81,"speaker":"Vesper Stamper","text":"I think it's revealed through the doing, you know, it's not. Again, it's not applied through my will, but it's. It's. By making the thing that's occurring to me to make at the time, it reveals its own meaning."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2549.98,"end":2550.3,"speaker":"Ben Stamper","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2550.3,"end":2564.74,"speaker":"Aidan Hart","text":"Is that the equivalent of. Novelists would often say, you've got to show, not tell. You've got to be the thing. Let it be completed in the reader. Now I get what they're getting at now. They haven't told me they've manifested it in the story. Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2564.74,"end":2600.2,"speaker":"Unregistered: John Hears","text":"This goes back to what you were saying earlier about beauty and how, you know, if the. What Jesus said, if the. If the eye is bad, the body is full of darkness, and the opposite is true as well, you know, and if die is good, the body is full of light. You know, our work as artists, the real work is done behind closed doors. The real work is. Is done offline. And so that we can bring an offering that isn't centered on ourselves, does that mighty thing."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2600.2,"end":2630.05,"speaker":"Aidan Hart","text":"One of the same short books in Orthodoxy, Philokalia, the Love of the Beautiful and what it's About. It's all about the inner life. I was looking at the original Greek in the Prodigal Son story. The original Greek can be translated as. And he came into himself before they'd been wandering around in the material world. When all the material world had been wasted, he returned into himself, went to his monastic cell, went into the closet and prayed, and that became beautiful. He remembered the beauty of his home, then returned."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2632.38,"end":2648.94,"speaker":"Martin Shaw","text":"Tolkien calls that the recovered thing. He has this idea that it's great to always have something, but to lose something and find it again has an entirely different energy to it. The recovered thing you will treasure, you will hold on to."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2650.54,"end":2665.25,"speaker":"Unregistered: Kate Degrade","text":"You'll have a reasonable defense for it. So when something. As a kid, we receive stuff implicitly, we take it for granted, and then maybe we move away from it, and then we don't know it was good until we start to feel the loss of it. And sometimes you don't even know what you lost and where you're looking for. And where did I lose it?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2665.25,"end":2665.69,"speaker":"Aidan Hart","text":"And then."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2666.33,"end":2673.69,"speaker":"Unregistered: Kate Degrade","text":"But when it's recovered, if it's recovered correctly, you don't just get it back. You get the ability to defend it to yourself and to others back."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2673.69,"end":2685.29,"speaker":"Aidan Hart","text":"Isn't that the energy of the convert? Yeah, that's what you see. Some would say, no, they got something new. But I think they were returning to what they already were. Yeah, because there's a lot of energy in These converts."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2694.41,"end":2696.05,"speaker":"Andrew Gould","text":"The only cradle, I think."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2696.05,"end":2697.89,"speaker":"Aidan Hart","text":"Is there a cradle here? I don't think so."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2697.89,"end":2698.17,"speaker":"Neil Degrade","text":"You."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2698.33,"end":2698.69,"speaker":"Martin Shaw","text":"You."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2698.69,"end":2699.37,"speaker":"Unregistered: Kate Degrade","text":"No, you're not."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2699.69,"end":2700.69,"speaker":"Jonathan Pageau","text":"No, you're not. 30 years."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2700.69,"end":2709.7,"speaker":"Aidan Hart","text":"I saw a picture. I'm 14 years. I'm almost crazy. 43 years. So he went dinosaur? Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2710.58,"end":2711.34,"speaker":"Neil Degrade","text":"No, no. I was."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2711.34,"end":2768.52,"speaker":"Unregistered: Kate Degrade","text":"I was going to ask a question because there's a thing that happens and I want to know some. There's a part. Sometimes when I talk about art, it's a reverse engineering of something that's happening to me intuitively in the sense that my process does not reflect the way I talk about it after. Do you guys raise this? Well, I don't mean to. So what you do is you can kind of like. Like, I'll have moments, things will hit me. I'll be working on a problem, like, in the world, in my life. I'll cry, I'll pound the floor. When I'm creating, like, I'm weird and emotional. Like, not. Well, you guys probably could guess so anyway. But I get really. Like, my whole self gets involved in it, and I'm not truly thinking. Like, I wouldn't say I'm thinking right. And you do it. And for some reason, something just lands with you. Like when someone gives you a riddle and you go away and you solve it. You know you had the right answer, even though the person isn't there to tell you, because it locked, it landed, and something locks and it lands, and I love it, and I fight for it, for it, and I make it come into existence, and then I figure out why, and then I talk about that, but that's not how it came to me."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2768.52,"end":2769.2,"speaker":"Andrew Gould","text":"You know what I mean?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2769.28,"end":2769.72,"speaker":"Vesper Stamper","text":"So, like."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2769.72,"end":2796,"speaker":"Unregistered: Kate Degrade","text":"Because we're talking about this intentionality, and I don't know how to. My worst stuff I've done is someone hired me for a project with a goal, with an outcome. Here's what I wanted to do to the audience. And it's like, I don't know how to do that. Like, if you ask me to do it that way, I don't know how I. Like, so. But do you guys feel that way? Can you like what we're talking about? Can you think about it and then go and do something and make it achieve that in civilization? Or is it just something you're in tune with and hopefully it has that effect?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2796.16,"end":2829.19,"speaker":"Jonathan Pageau","text":"Well, I mean, civilizational art is the opposite of what you're saying in the sense that, let's say Aidan or Andrew and I, if we make icons, we are making something that is commission. Ask for something and Then you, you attend to their, to their need and then you adapt obviously your skill and your thought to that need. And so there's a discussion between the patron and the person doing it. But I also know what you mean. Like I in on in other ways like with stories and other parts of my creative life. I have more of that experience which."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2829.19,"end":2829.99,"speaker":"Unregistered: Kate Degrade","text":"Is more of this."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2829.99,"end":2833.79,"speaker":"Jonathan Pageau","text":"Something just drops into you and you don't love it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2833.79,"end":2864.3,"speaker":"Unregistered: Kate Degrade","text":"It's got to exist because that's how I started as an artist. My. There were movies I couldn't see. My parents went to see Jaws or something like that. I couldn't see it. And so mom, tell me about Jaws. Oh, I can tell you about it. So I went home and like drew it. I drew the panels. I'm like man, my clothes. Is this what it looked like when the kid got bent down and because I wanted to see it so bad. But that's never stopped. That's always the thing. So yeah, I feel, I do feel like a little bit of a fraud when I talk about on the other end because I think that's what's happening. It's just me reverse engineering the intuitive process. But what you're talking about with civilization art makes perfect sense to me. I just don't live there. So I guess I should leave the table."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2864.94,"end":2897.82,"speaker":"Aidan Hart","text":"Strange. As far to master how you write, you said you tend to write in two phases. The first is about two in the morning. The morning and it's the same Talking about Ian McGilchrist, the lift and right side of the brain you deliberately don't stand over and judgment. You've got just right 90 struggling. Then the next day when your rational faculty is alert, then you will critique your work. So you're allowing your intuition, your whatever to do the right sided brains to do the main work. Then the judgment is pointed. But if you do it the other way around, it doesn't work."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2898.23,"end":2898.51,"speaker":"Andrew Gould","text":"Yeah, no."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2898.51,"end":2899.67,"speaker":"Unregistered: Kate Degrade","text":"I get stuck in the mud."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2899.75,"end":2903.95,"speaker":"Martin Shaw","text":"Wouldn't you say that you have daytime intelligence and nighttime intelligence?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2903.95,"end":2904.55,"speaker":"Andrew Gould","text":"Absolutely."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2905.99,"end":2911.03,"speaker":"Martin Shaw","text":"You should make no lasting decisions. I know in my own life."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2912.63,"end":2916.71,"speaker":"Unregistered: Kate Degrade","text":"But have you tried and you go in the morning and you look at the thing you did and you're like what was I doing?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2917.35,"end":2979.22,"speaker":"Martin Shaw","text":"What I would say, I think, I think really great art should have a secret in it that the artist knows nothing about. Yes. It just has to be. And it will reveal itself to you over time. And often if you're on a book Tour and you're 30 gigs in and you've been saying the same old thing and then One day the penny will drop or, you know, a divine wind comes through and you go, actually, it was this. I'll have to leave in a second, but I'll leave you with this thought. I've been working on a book for two years, which is quite a long time for me. And I was sitting in bed proofreading the book, and suddenly I wrote one sentence. And the sentence was this. In each experience of beauty, we are being prepared for eternity. In each experience of beauty, we are being prepared for eternity. And it was a little overwhelming because I realized at that moment that was what the secret of the book had arrived. Not the secret of the book, the secret of mice. Whole life."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2979.78,"end":2980.34,"speaker":"Unregistered: Kate Degrade","text":"Yes."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":2980.74,"end":3054.82,"speaker":"Martin Shaw","text":"You know, it's hard for me to talk about, so, you know, I'm in for that. Arriving ahead of time and preparing me. But, you know, we talk about eternity and it's easy to terrify people. Once you get into medieval images of bubbling cauldrons and cherubs on clouds. They both seem as bad as each other in a strange kind of way. But what folks will roll with, they're. What they will roll with is if you say, look, the thing that you lean into when you're alive picks up a kind of magnetic pace. And it's likely that when you die, you find yourself living in the consequence of where you lent to in this universe. There's very few people that actually get upset about that. They go kind of follows. So in other words, you've started to map out a bit of theology, but in a way that it doesn't immediately trigger them. So in other words, I think beauty. Beauty for me matters because it changes the way I behave. Beauty was the thing that took me from Paul's notion of an unknown God into a known God. And the known God turned up and he had a little bit of a mission statement, you know, living in the consequence of that episode. I have to go to dinner. And so."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3057.18,"end":3126.06,"speaker":"Andrew Gould","text":"Well, in closing, I want to say something about the church architecture that I do. There are certain moments when I'm standing in my own church during a service and I'll look back into the congregation and I'll be shocked to see some individual back there looking as beautiful as any saint in the icons. It might be because there's a sunbeam coming through a window, and it just falls on a woman in a colorful headscarf, and she's juxtaposed against an arch with a shadow behind it. And it's suddenly a little moment that's as beautiful as any oil painting. It's like a Rembrandt, sort of this inner illumination shining through in a beautiful architectural setting. And she'll sort of visually join in with the frescoes of the. The saints on the walls and really look like an icon of a saint. And that, that when I see something like that, I feel like that is the actual end purpose of my art is a moment like that. You know, if. If I."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3126.14,"end":3126.78,"speaker":"Jonathan Pageau","text":"When I."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3126.78,"end":3148.11,"speaker":"Andrew Gould","text":"When I get to feeling like the physical building that I'm trying to design or build is the end purpose of my work, I. I get kind of depressed because it's. Because it's. Because it's just a dead object and it won't last forever. But when I see that the light and shadow and beauty in the building I've created has caused some person in."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3148.11,"end":3148.63,"speaker":"Ben Stamper","text":"That building."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3151.03,"end":3196.25,"speaker":"Andrew Gould","text":"To suddenly experience theosis. Like I can see the divine image in that person because of the setting, I feel like, ah, that's why I do this. My work is complete. Now I'd like to ask the rest of you if you have similar stories. I'm guessing all of you, the different media or genres of art you work in. I'll bet all of you have a similar moment where you actually see some person using your art or hearing your song, reading your book, venerating your icon, and you see a moment of that divine beauty in humanity because of how they're interacting with your art. Do you feel. Do you feel similar that that's the end point, just when you see a moment like that?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3196.41,"end":3262.85,"speaker":"Aidan Hart","text":"I suppose my equivalent experience of that was in this hermitage where I lived for seven years as a hermit. I frescoed this small chapel and I continued doing the rest of the buildings up. So sometimes I'd have 16 tons of stone delivered and one load arrived and the man said, what are you doing? And I told him, and I said, come and have a look at the hermitage, at the chapel. So I went ahead and he came and. And I just stood there and I noticed he didn't say anything. So I just looked at him and he was crying. You know, big muscly man. You got tattoos and everything. And I've not seen anything like this in my life before. And it wasn't something. It's a physical view. It's got really dark, deep, rich colors. I created an atmosphere. It's like being the heart. This works well. I want to share one from our art of Kamara. There's a young man that came to learn this. This oral tradition. And he came the very last day and he was very afraid. His name was Ethan. And just last week, I got a call from his parents that he had taken his life. Remember him?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3263.33,"end":3264.85,"speaker":"Unregistered: John Hears","text":"He was very happy to see you."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3265.49,"end":3291.38,"speaker":"Aidan Hart","text":"And that week, four of the people that came to learn this tradition toasted him on the fifth toast, which is the toast to the souls of the dead. And they toasted him at their homes, much like you did the Dharmas, and then sent a video to our group of them toasting to this gentleman that they had met. And I cried like a baby. Not unlike you must when you see."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3291.38,"end":3292.54,"speaker":"Unregistered: John Hears","text":"People worship in the church."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3293.42,"end":3312.1,"speaker":"Aidan Hart","text":"It's so similar. I. I had to share that because then his name is again membered at the tables, at the altar of others. And it just goes out into eternity. And it's the most beautiful thing. Of course, not his death, but the idea that we haven't forgot that. And the table teaches us that as an art."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3312.42,"end":3313.06,"speaker":"Martin Shaw","text":"Art form."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3314.18,"end":3354.73,"speaker":"Unregistered: John Hears","text":"I'd like to share a memory of answering that question. I had written a film that was to be acted by deaf people. And I wrote a scene for this one actor to recite this monologue about losing her hearing and what it was like when the Hearing. When she was born hearing, but then she lost it, and what that experience was like. Now, this actress was."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3355.21,"end":3355.93,"speaker":"Aidan Hart","text":"She. She."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3356.01,"end":3429.67,"speaker":"Unregistered: John Hears","text":"She was born deaf, but she. She was interested in doing this, the scene. And so I had to write this just sort of using my. Just. Just trusting that this would translate and that. That she would be able to. To do it, because everything was in sign language. And so. So I. I wrote the scene, you know, having no experience in this. In this world, just purely using my imagination, but trying to do it in a way that felt true. And after we did that scene, she just said, that was the most. That was the greatest gift that you could have given me. Because I could imagine what it was like to hear, because it was all imagery. It was all using sound as imagery. And she said that it brought her closer to what it must be like to hear. And I had never expected that. But I was like, you say, I was just. I was in the flow, and I was just trusting. And then to have that experience, it was like, this is why I'm doing this."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3429.91,"end":3430.47,"speaker":"Ben Stamper","text":"Yeah."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3431.19,"end":3453.31,"speaker":"Unregistered: Kate Degrade","text":"No, I get these emails from people who are like, they're at their end of their rope, and I'm grateful that they reach out to me, but it actually breaks my heart too. Like, sometimes people are like, oh, my gosh, this record helped me so much. It's like, how. How is the world so such a desert of encouragement that some artist who just made an album you liked, like brought you back from the brink in any capacity."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3453.31,"end":3453.91,"speaker":"Andrew Gould","text":"It's just."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3454.47,"end":3463.91,"speaker":"Unregistered: Kate Degrade","text":"It's terrifying to think that some people live in that world. And so that helps when I don't want to get up and work, you know, sometimes, like, well, maybe this is one of those things where sometime someone."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3463.91,"end":3466.59,"speaker":"Aidan Hart","text":"Else, you know, it makes you feel better. I died when."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3466.59,"end":3468.55,"speaker":"Unregistered: John Hears","text":"I mean, I cried when Prince died."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3470.87,"end":3473.27,"speaker":"Aidan Hart","text":"Yeah, so me too. He's awesome. Sorry."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3473.43,"end":3502.43,"speaker":"Neil Degrade","text":"I don't think I've had a live performance in my life that I've been satisfied with. I come away disappointed with myself every time, and yet people will come to me and say that so moved me or whatever. And that's, that's the redeeming moment, you know, and so it's like I know that I have my own issues that make me a perfectionist and whatever, and I can't enjoy it. Like, maybe I will one day when I grow up, but that them being moved is the fulfillment of it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3502.43,"end":3503.47,"speaker":"Ben Stamper","text":"That's why you do it."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3505.23,"end":3536.06,"speaker":"Neil Degrade","text":"I'm wondering, and I'm sorry if I'm changing the subject. You can shut me up. But my question that keeps coming to mind when I'm listening is like, if we go back to like a political thing, like people do things because there's laws, but what about the idea that it's better to do things because of beauty? You know, to be inspired to be right and to operate rightly rather than be made through laws or legislation. You know, like a man who's fallen in love with a beautiful woman and what. How would he change to win her?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3536.06,"end":3536.58,"speaker":"Ben Stamper","text":"You know?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3537.7,"end":3548.95,"speaker":"Unregistered: John Hears","text":"Well, it's like lovers will always be better workers, you know, like you'll. No one has to tell you if you're in love to go to the ends of the earth for your beloved."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3549.51,"end":3551.19,"speaker":"Aidan Hart","text":"To be good, you'll do anything."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3551.35,"end":3555.63,"speaker":"Neil Degrade","text":"And what about Christians will be known for their love? You know, like, it goes back to."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3555.63,"end":3557.23,"speaker":"Ben Stamper","text":"That, that it, it's."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3557.23,"end":3561.03,"speaker":"Neil Degrade","text":"There's a better reason to do things than politics."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3561.51,"end":3564.23,"speaker":"Unregistered: Kate Degrade","text":"Yeah, no, make. Trying to make something beautiful is an act of love, isn't it?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3564.23,"end":3564.87,"speaker":"Aidan Hart","text":"Absolutely."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3565.51,"end":3650.04,"speaker":"Ben Stamper","text":"I think what I want to share is when I was watching Andrew describe that moment in church, what it reminded me of is how film director thinks. Because when filmmaking is human centered in that way, we actually think about a shot, a face, and then we put the architecture and the design around them, around the human. And I'm so used to that language and that way of working. I did that for 20 years. And then when I went back, went back to church, it was absent. And I think that's what I noticed was this isn't human centered in the same. In the way that my brain works, because I was looking at the. At the environment and thinking, you know, how does this frame the parishioners or how does this make the parishioner feel? You know, as a filmmaker, you think where the camera is in terms of close ups and how you might be interacting with details of the church, candles or an icon and that had kind of gone out the window certainly is the churches that I was in. So it's almost like rediscovering that vision of a filmmaker, but within, you know, within these spaces, whatever they may be, and to thinking that way. Yeah, it was just. It was just. It was just beautiful. It was like a. It was like a movie. That, what you described, that scene, I could see it. I could see the light coming in and I could see her head split up and, you know, what she's wearing. It was one of that."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3650.04,"end":3661.24,"speaker":"Andrew Gould","text":"So when you were illustrating the Snow White book, I. I'll bet you were picturing vignettes of a. Of a little child sitting in bed reading that book."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3662.6,"end":3663.88,"speaker":"Unregistered: Kate Degrade","text":"No, she's not that nice."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3664.04,"end":3664.44,"speaker":"Aidan Hart","text":"No."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3670.68,"end":3684.57,"speaker":"Ben Stamper","text":"I don't know. That's definitely one of the things that I didn't know what it was going to be like until it was done. And then when it was finished, I was like, oh, that's what it looks like, because I'd never done it before. So it was a real. It was quite a risk, actually."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3684.57,"end":3688.17,"speaker":"Andrew Gould","text":"Have you been able to have the experience of seeing children reading the book?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3688.41,"end":3692.33,"speaker":"Ben Stamper","text":"We've had a lot of feedback, haven't we? Yeah, yeah. My daughter."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3694.09,"end":3700.25,"speaker":"Andrew Gould","text":"What about you, Vesper? Have you been able to watch children read your books and see how they react to them?"}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3701.81,"end":3762.93,"speaker":"Vesper Stamper","text":"Not as much with the picture books because I don't really do school visits in that way. But what I kept thinking of was the importance of my sketchbook and that I don't really have any control over how the audience reacts to my work. And a lot of times it's completely unseen because I make a book and it goes out there and I maybe I get, you know, a letter from a reader or something like that. But for me it's. The books really come out of a lot of preparatory. I carry sketchbooks, multiple sketchbooks with me wherever I go, and I'm just always processing the world and the books come out of that sort of indirectly. But I feel like that is sort of my interaction with the world is to try to follow that curiosity and that understanding more and trust that the work that's coming out of that is going to be what the reader or the viewer needs at that time."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3762.93,"end":3763.41,"speaker":"Martin Shaw","text":"Yes."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3764.45,"end":3769.97,"speaker":"Vesper Stamper","text":"So it's a lot of the work that never gets seen by anybody. That's actually maybe more important."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3770.45,"end":3780.06,"speaker":"Unregistered: John Hears","text":"Although there is a lot of interaction with your sketchbook with people, it does draw people and there is a lot of really interesting."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3780.46,"end":3781.62,"speaker":"Neil Degrade","text":"I enjoyed your sketchbook."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3781.62,"end":3782.34,"speaker":"Vesper Stamper","text":"Oh, thank you."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3782.34,"end":3784.3,"speaker":"Unregistered: Kate Degrade","text":"I've liked, comment and subscribed."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3784.38,"end":3785.1,"speaker":"Neil Degrade","text":"Oh, my gosh."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3785.98,"end":3796.74,"speaker":"Vesper Stamper","text":"But if anything, you know what I kind of hope, if anybody sees that process, is that they feel that maybe they could do it too, because it's just playing, you know."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3796.74,"end":3797.34,"speaker":"Martin Shaw","text":"Yeah, there's."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3798.38,"end":3806.38,"speaker":"Vesper Stamper","text":"Yeah. It doesn't have to be right or perfect. It's just about. It's encountering the world through. Through that kind of play."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3831.19,"end":3844.07,"speaker":"Aidan Hart","text":"Sam."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3856.72,"end":3860.4,"speaker":"Martin Shaw","text":"An amateur philosopher."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3863.04,"end":3865.64,"speaker":"Aidan Hart","text":"For hardened hearts."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3865.64,"end":3886.97,"speaker":"Martin Shaw","text":"Are no defense when you have a softer head. Lady Wisdom cannot rest in a man without a chase."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3899.69,"end":3991.74,"speaker":"Aidan Hart","text":"And she longs to hold his little hand and gaze in his seals blind and a song stirs in the silence like the wind in the bow above she listens and stirs and trembles Tis the first little song of love. Roses are shining in Picardy in the hush of the silver dew Roses are flowering in Picardy but there's ne' er rain like you and the roses will die in the summertime Though our roads may be far apart but there's ne' er a rose not in Picardy Tis the rose that I keep keep in my heart."}
{"episode_id":"SW - #395 - 2025-05-31 - Beauty First - Envisioning a Civilization Worth Restoring (ARC Roundtable)","start":3999.18,"end":4014.22,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
