{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":0.4,"end":74.5,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I'm sitting here with JP Marceau. You probably have seen him on my channel. JP Is the editor of the Symbolic World blog and also a contributor to that blog. He's written several really interesting articles. He's becoming, I would say, a kind of bright star in the world of symbolic interpretation. He also is able to provide other aspects or ways of talking about symbolism that I don't have, and so more philosophical to talking more about science. And so I really enjoy talking with him. He recently wrote an article about miracles, which is something that I've been hinting at once in a while, talking about miracles, trying not to talk too much about miracles, because I know it's a stumbling stone for a lot of kind of secular types or atheist types. But I knew that we had to kind of slowly get there. And so here we are with that article. I think it's very important to start talking about miracles and how they relate to notions of emergence and eminence, how they participate in reality, how they are, in a way, let's say, the summit of reality. And so JP Wrote this article about CS Lewis and Vervaeke investigating miracles with Vervaeke and CS Lewis. I think I'm getting the title wrong."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":74.58,"end":75.7,"speaker":"Jp Marceau","text":"But the pattern is right."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":75.78,"end":97.51,"speaker":"Jonathan Pageau","text":"The pattern is right, but the title is wrong. And so, yeah, all right. So I'm looking really forward, Looking forward to this conversation. This is Jonathan Peugeot."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":97.91,"end":99.59,"speaker":"Jp Marceau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":108.55,"end":115.79,"speaker":"Jonathan Pageau","text":"So I think to begin with, maybe JP you can give us the basic gist of your article, what your argument is, and. And then we can dive into it."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":116.03,"end":218.39,"speaker":"Jp Marceau","text":"Yeah. So the article itself is trying to summarize the key insights of Lewis in his book Miracles, using the metaphysics of John Verbecki, the source of metaphysics that he's been defending in these discussions in our corner of the Internet. Because the main key is that the way Lewis used to talk about miracles back in his time was sort of set against the naturalism of his time, which was a fairly simplistic kind of materialism where nature is sort of one big interlocked mechanical system. And Lewis's strategy to introduce miracles in that worldview was to take something closer to us. So take our rationality and show that our rationality is not something that can be fit in that or interlocking old system. And is his argument is something that actually John made in his series, and he also made it in the last discussion you had with him and Paul Dernoukley, where, okay, well, if all that is real, ultimately is the mechanical level of reality, Then this will not make our rationality real. Like our intellectual concepts and so on will have to be somehow reduced to something mechanical. But this, this makes not the ideas themselves, not our theories themselves real. It makes only the mechanical level real. So it means that our theory, which points to materialism, doesn't fit in the system, so it's not rational, so we don't have to believe it. So it's, it's self defeating."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":218.55,"end":248.71,"speaker":"Jonathan Pageau","text":"And there's a blind spot. I think this is a blind spot we've been all been pointing to for a while, which is that a lot of materialists take for granted the invisible part of their world. They take for granted these theories as if they don't even exist. And then they use them to talk about the material world. And we've been trying to say, no, look up, look at, you have patterns that you use to interpret, but you can't pretend as if those patterns are physical because they're not. And then you also can't pretend that they don't exist because you're using them to interpret reality."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":248.79,"end":542.06,"speaker":"Jp Marceau","text":"Yeah, yeah, yeah. It's fascinating. I rewatched your conference discussion with Jordan and also with Bet Weinstein, and I was surprised to see how strong positivism is still going. Like how strong the old school modernist positivism is still going in the sciences. It's like we. Because in philosophy itself this has been sort of debunked and it died, I don't know, maybe 100 years ago. It's really in dire straits and people are going towards like non reductive kinds of physicalism that I'm gonna explain just bit later in this discussion. But yeah, definitely the blind spot is real. And there are interesting reasons why it isn't clear yet why let's say it hasn't trickled down to the whole of academia, but it's definitely making its way, I would say because in cognitive science, like the source of metaphysics that you see John put forward is totally aware of the problems of modernistic positivism and he ends up with something that is much more traditional. Yeah, and what is much more traditional is non reductive kind of physicalism. We talked about it in more details last time we had a discussion. I think I'd like to introduce it with a sort of a series of examples that become more and more complex and make up their way progressively to miracles so that we jump into the subject sooner rather than later. If you look at, let's say, what happens at the lowest level of physics, it's gonna look super weird. You're gonna. And you often see physicists and reductive physicalists say this sort of thing and maybe blind blindly not recognizing the issue there, but they'll say, for instance, that from the fundamental fields of probability at the bottom of physics, you can see that particles just appear there. And if you leave it there, it's a very poor explanation of what is going on. It's super strange. Things don't just pop out of fields of potential. That's a strange thing to say. But the reason why you accept it, the reason why we accept this strange emergence is because we also know the top down pattern that informs this potential. We know that there are certain laws of physics that tell us that the probability that certain particles will manifest themselves out of potential there. And so this meeting of the potential at the bottom layer of physics and the emanation of the laws on the potential explains to us why the particle appears. And because we have this pattern to explain the emergence, we were okay with it. So you already have two layers of reality there. And it just keeps getting more and more complex as you go up the different layers of reality. And to explain the emergence of something, you always need to know the top down pattern that informs it. One layer that I find really cool and useful is the one that happens in our brains. If you were to look at what happens in my brain as I'm saying these words, it would look completely insane. Like it's so unprobable. There are billions and billions of neurons which coordinate just the perfect ways so that I send the right signals to my muscles and my lungs and so on my mouth so that I just say these words and, and this kind of coordination is insane. If that's all you look at, like there's too much possibility there for this to cohere correctly. It's insane. But once you know the emanation of the top down pattern there, which is my fairly simple desire to say these words, then this whole coherence makes sense. You can explain the bottom up emergence by simultaneously knowing the top down emanation of my thought. So you have two layers of reality there. And the way that, for instance, non reductive physicalists like John will explain it, is that you cannot reduce my brain as a whole to its individual constituents. If you try to do that, you get the problem of like all of these possibilities that don't cohere. You need to explain that there are constraints that come from, let's say, my brain considered as a whole. And it gets even more interesting than that. Because modern cognitive scientists will include also the environment. Like the fact that it's not just my brain, but it's my brain in my body, my environment. And who knows how far this goes. Like it's this old structure, this pattern, this abstract spirit, you can say, that informs, that shapes the potential that is emerging from my neurons. Okay, so this is going from say, the cellular level to the level of mind of an individual person."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":542.38,"end":548.38,"speaker":"Jonathan Pageau","text":"Yeah. Maybe synthesize what you're saying. You're saying that when you look at something top, bottom up."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":548.94,"end":549.34,"speaker":"Jp Marceau","text":"Right."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":550.22,"end":562.46,"speaker":"Jonathan Pageau","text":"When you look at something bottom up without understanding the pattern which informs it, then you can't make sense of it. The sense actually comes from the manner in which they join together and they connect with a top down pattern."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":563.03,"end":563.27,"speaker":"Jp Marceau","text":"Right."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":563.35,"end":578.63,"speaker":"Jonathan Pageau","text":"And so if I look at a painting and I look at all the, all the individual specks of paint on the painting, it's just a bunch of jumbled specs of paint until I understand that it's a painting of an apple. And then when I, when I know that it's a painting of an apple, then all of a sudden the jumbled."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":578.63,"end":581.11,"speaker":"Jp Marceau","text":"Specks of paint make sense. Yeah."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":581.27,"end":582.79,"speaker":"Jonathan Pageau","text":"They find a reason to be there."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":583.11,"end":816.45,"speaker":"Jp Marceau","text":"Yeah, yeah. And that's. It's. One of the things I'm open to bring out of this conversation is I tend to speak from the outside as like the old school philosophers like Aristotle or Aquinas would do of seeing that there are layers of patterns in the world. And the way that you tend to speak on your channel is more as a phenomenologist, looking from how we perceive things, as if we can take a simple object, like you took the painting, we can look at it from the first person perspective where there is a combinatorial explosion of facts in the painting. And I have to take all of these facts, like this layer of infinity of facts, and I have to abstract a pattern from it so that I can then understand this combinatorial explosion. So this happens in my consciousness so that I can actually see the painting, so that I can see anything really. I have to make out the pattern behind this emergence. And what I want to put forward here is that this, while this does really happen phenomenologically in my consciousness, it also happens independently of me in the painting itself. Like in the painting too. Like the whole structure of the canvas is informing all of the fundamental particles or whatever in the painting, and they're always changing. Like there's all kinds of chemical interactions and like photons are going in and out of the painting. And so on so the form of the painting, which exists even if no human is looking at it, the form of the painting still exists and it is informing really the multitude of atoms and particles and so on that are in the painting. So the meeting of emergence and emanation within my mind that allows me to precede the painting is also occurring within the painting in the meeting of the emergence from all the particles and onwards from the form of the whole painting. Okay, so we talked about a few levels and if we keep going higher, we'll get closer and closer to miracles. The sort of top down causality, the way that ultimately what I want to get at, and it's what Lewis was getting at as well, we want to say that the way that I can smoothly have causal influences on my neurons, for instance, the way that rationality can smoothly intermesh with the brain, is the same kind of smooth interaction that God, who is behind emergence animation altogether, can have on creation. But it's useful to go through a few layers, I think, to get at this. So one example I like and I use in the article is the example of the placebo effect. Because there, what you have is a situation where you need the narrative frame to make sense of what's going on. Because you have a patient who goes to see his doctor because he has serious migraines, for instance, and the doctor hands him just a flower pill and tells him that it's secure for his migraines. And surprisingly, this happens all the time. Within a day or two, the patient is completely ill, there's no more migraines. You've had this weird coherence of different chemical reactions within the patient that really did like lower his intracranial pressure and really did lower stress enzymes and so on. So something physical really happened. But it doesn't make sense if you try to explain in terms of what the flower pill did in a system, because flour doesn't have those causal powers. Like flour doesn't do this. But once you know the story, once you know the pattern, once you know the placebo effect, then this whole emergence makes sense. Once you know the top down emanation of the placebo effect, then you can make sense of the emergence of all the chemical reactions within the patient that really did cure his ailment."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":816.53,"end":847.56,"speaker":"Jonathan Pageau","text":"Yeah, I always use that example too to talk about how the placebo effect is the last remainder in a kind of materialistic world, one that they can't totally get rid of. How more traditional societies thought of causality in terms of top down causality and can Help you understand ritual. Placebo can help you understand ritual, can help you understand magical acts, can help you understand how you know, exorcism. All these things you can understand through understanding how, let's say, or at least realizing that placebo is a real effect in the world."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":847.8,"end":897.33,"speaker":"Jp Marceau","text":"Yeah, yeah. So you just have to keep going higher to get closer and closer to miracles. For instance, I don't talk about this in miracles, but you can. Sorry, I don't talk about this in the article, but see what happens in a church, in a prayer group where lots of people will pray on someone to heal something more drastic than just a migraine. Sometimes this sort of thing works and it makes sense once you know the narrative of, you know, there's a whole group praying, let's say, to a certain saint. And this whole story is very powerful, and it can smoothly influence the emergence of a real healing in the same way that I can smoothly influence the coherence of my neurons when I think a certain thought. Okay, yeah, makes sense."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":897.33,"end":900.57,"speaker":"Jonathan Pageau","text":"All right, so now let's get to miracles here. Go for it."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":900.89,"end":1012.34,"speaker":"Jp Marceau","text":"Yeah. Okay, so following what we just said, Lewis will give us a useful criterion to think about even just what a miracle is and how to recognize them. The idea is, okay, now we're looking for events that require not, let's say, the level of explanation that you find in certain physical laws or even in a story that to explain miracles, you'll need the highest level possible. You'll need God himself, with beyond emergence and animation altogether. You'll need something that seems to. Okay, so, for one thing, you'll need something that looks kind of alien, that doesn't fit neatly into the normal way that emergence and munitions meet. But at the same time, it's gonna have to make sense. It's gonna have to be coherent in that once you know the pattern, it really does have to make sense of everything below it. In the same way that once I know the pattern of, let's say, the laws of fundamental physics, I really need to be explaining things. For it to be a legitimate explanation. It really needs to explain what we observe in fundamental physics. Or once I know the level of cognitive science thinking, once, let's say I can detect your intention and not just your neurons, I really need to be able to explain how you behave. I really need to be able to explain how your person and your cells will interact with. I really need to be able to explain things. Same thing will go on for God and miracles. And that makes things obviously more complex because now the claim is, is Huge. We're claiming that once we take that frame to explain a miracle, it should make all of reality more intelligible. It should make all of emergence in the nation more intelligible. Once we know that a certain event was a real miracle and it was caused by God. Yeah."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1012.34,"end":1129.04,"speaker":"Jonathan Pageau","text":"And I think that that's really the point we need to drive towards, which is that when we talk about emanation, when we talk about the notion of these different level. Talk about emergence, these different levels emergent, emerging. The question is, what are they emerging towards? And inevitably they're emerging toward. Towards the different levels of unity at the levels of which they're jumping out of. And so, you know, you have multiplicity. It jumps into a one. And then these ones join together. They jump into. They jump into another one. But a way to understand that in a more kind of phenomenological way is to understand that they're emerging towards identity, they're emerging towards name, they're emerging towards pattern. And they can also be emerging towards narrative, or at least how they fit inside stories and how they fit inside facts coming together in terms of narrative. And that's also why you can understand how miracles ultimately end up. Like you said, if you look at the miracles, they're not just random things that happen without explanation, which is somehow how people want to characterize them. But they're rather. There are rather moments where meaning shines like no other. And so Christ walking on water is not just a thing weird thing that happened that you can't explain. It's an event which happens and which manifests the manner in which, like you said, in which heaven and earth come together. It manifests the manner in which pattern can be above the chaos of manifestation and how it ends up ordering it. When Christ tells, for example, the storm to stop, it's like how Logos, how meaning will stabilize phenomena. And so all the miracles of Christ and all the miracles in Scripture are not just like freak things that happen, but are rather super events that help us make sense of this whole process of emergence and emanation."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1130.4,"end":1341.67,"speaker":"Jp Marceau","text":"Yeah. And Louis, as he genius way of putting it, I think, because it's okay. I had been trying to write something about miracles for a while, but I could never sort of pinpoint down to something that was, let's say, manageable because, like, it explains too much. And it's hard to pin it down to something that you can digest into just one article. And Lewis's strategy is very good at this point. What he does is he focuses on a few key aspects of Nature. Nature, which is in our modern language, the meeting of emergence and nation. We can recognize the miracles of Christ because they will be manifest. They will shed light on all of those key aspects of nature. The key aspects that Lewis thinks about is first, there is something we already mentioned, the fact that nature can actually, this gets a bit tricky and I only talk about it briefly, but the way Lewis was talking about nature is a bit different from the way that we talk about it today. Because the naturalist now agrees that there are different layers of nature, whereas the previous naturalist only saw it as sort of one big mechanical layer. Yeah, but Lewis says that, okay, we see in the world that there's an intermachine of something that doesn't fit into that system, into that one layer mechanical worldview with, namely the mind. The mind doesn't fit into that one layer of mechanical causality of the world. So there has to be an intermeshing of mechanical reality with something higher. And we can see this in the incarnation as well. There will be actually the whole of creation will be intermeshed with God, who is outside of creation altogether. Okay, so this is one aspect. And then you will talk about three things. You'll talk about selectiveness, the fact that, and it's funny the way Lewis says it, it says that if you look at the way that nature selects, and also that God selects, it can somewhat hurt our democratic sensibilities. Because in all of the world, for all we know, there only seems to be like one planet that has life on it. And in that life there's lots and lots of species and organisms that just dead end, that don't reproduce. It's very undemocratic. And the same thing goes on in the incarnation, because out of, let's say, all the planets, of course, God selects the earth to incarnate. It wouldn't make sense to go on the moon, for instance. And then he selects just one people, namely Israel. And then you'll select just one girl, namely Mary, to fashion a body for himself. And then it'll be sort of all on the shoulders of Christ until he found the church and so on. But this selection, well, it can seem sort of evil from the outside because, I mean, nature is fallen in certain respects. There really are bad aspects to selectiveness, the way that it exists right now. But in using this, the Incarnation shows us that selectiveness doesn't have to be evil, like at its roots. It can be good, provided that, for instance, Israel is selected, but is selected to save the whole planet. It's selected to save, ultimately all of reality. And it will do so through very difficult trials. In many ways, it's much harder to be an Israelite than to be someone from some other tribe. And then similarly for Mary or Christ, who were selected, but they were selected to save the entire world."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1342.07,"end":1384.72,"speaker":"Jonathan Pageau","text":"And I think that's the mystery, let's say the difference between Christianity, because every type of empire, every type of government will have that process where you have a chief, you have people above and people below. And so the selectiveness is inevitable. Those who think that it can be, communists who think that you can avoid it, end up creating an insane parody of that very selective process. And so it's inevitable. And the mystery that Christianity offers is that the true selectiveness happens through how the thing that is selected then sacrifices itself for that which is it is selected out of. Which is the huge difference between Christianity and other aspects. Anyways, continue with the miracle part."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1384.72,"end":1613.08,"speaker":"Jp Marceau","text":"Yeah, but that's true. That's where I was heading. Because Lewis then focuses on vicariousness, the idea that when the selected devote themselves to the unselected, you see something that's good and that actually redeems several aspects of nature. Again, because no living thing survives on its own, like it doesn't happen in nature. Everything eats something else. There are even parasites and all kinds of very bad interactions by which something survives only by being made parasite on something else. But this vicariousness can also be great. It's also the instance of, let's say, the child depending on his mother, or the fact that we depend on Christ. It can actually be beautiful to see some people sacrifice themselves and for us to accept this in gratitude, it redeems an aspect that is fundamental to nature. This always happens. Everything that exists exists because of something else, except God. But this gets complicated. Let's say everything in nature exists because of something else. And then the third point is the pattern of death and rebirth, which is also universal throughout nature. Everything, let's say everything that we see around us will die. And then Lewis has a very beautiful way of putting it that I had never seen before. He says that by letting Satan introduce death into the world, God so was doing a master move, sorry, master strategist move. Because by letting Satan introduce death into the world, it allowed Christ to die precisely to redeem the world. So it introduced something in nature which is that everything we see dies, but also it allowed Christ to use that and turn it into glory, to turn death into glory. Because right now, and we can see it even within nature, that there are aspects of this pattern that it's not just all tragic all the time. The fact that certain trees die, for instance, is also what allows the entire forest to remain alive. This pattern can be beautiful. And of course, its highest expression is in Christ himself and the way he sacrifices Himself for the entire world and is reborn. So these are the few patterns that Lewis selects. And I think it makes convincing that in the Incarnation, the process where God selects to incarnate himself, to then reemerge in the church that will remake the entire world. This is so coherent with the way that we see nature work at its most fundamental level that it makes miracles very plausible. And this is at the highest level of the Incarnation. So this is the biggest pattern. And the individual miracles of Christ will make sense within that overarching pattern. So he notices that you can break up the miracles of Christ into two categories. There's miracles of the old creation and miracles of the new creation. So miracles of the old creation are the miracles that focus sort of in one precise moment. Patterns that already occur on the grand scale, patterns that God already does at the grand scale. So for instance, the virgin birth is an example of a cosmic pattern just focused at one particular point where in the virgin birth, God creates nonviolently a body for himself, sort of out of nothing. There's a spermatozoa missing, and yet he creates a body for himself in there. And this seems crazy for us once we see it this way at our human level. But the same thing happens at the cosmic scale, like all the time. The fact that the world is created out of nothing."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1613.4,"end":1613.92,"speaker":"Jonathan Pageau","text":"I know."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1613.92,"end":1615.48,"speaker":"Jp Marceau","text":"For instance, it's crazy too."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1615.48,"end":1632.41,"speaker":"Jonathan Pageau","text":"It's just people, people believe in. People think the virgin birth is insane, but they believe in the Big Bang. It's like, okay, so everything comes out of nothing. But you don't like the idea that let's say that that miracle would show you how the reality works, but you believe that's how reality works."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1632.41,"end":1832.25,"speaker":"Jp Marceau","text":"Interesting. And it's the same for a bunch of other miracles that Christ does that just replicate old patterns. A cool one is the miracle at the Wedding of Cana where it turns water into wine. And this is a normal pattern for win wine that's put into certain jars by the work of human hands to turn into wine. It happens all the time. And it's crazy, just when you think about it, that this works. It's insane that something as bland as water by the fruit of human hands can become it's euphoric liquid. It's weird, but we only notice this when it's contracted into one moment where God himself tells people to go fetch some water from a well, put it in some jars and then pour it. So after working water into some earthen vessel or some rock vessel, it will become wine. It again focuses something that always happens in creation into one point. You could also talk about, let's say, the multiplication of the loaves and fishes. This happens all the time, of course, as well, where fishes multiply all the time. And when we plant seeds, it grows again. So it always happens. And it's also one pattern that is strange when you think about it. It sort of opens your eyes to just how beautiful and kind of crazy it is that fruit can multiply this way. But so what Christ does is he. And one way to see it maybe is as a microcosm, because Christ, then Christ is becoming the head of creation. Christ, Creation was in rebellion. And then God comes down to become the end of creation once again. Bring creation into himself, into right prayer, right worship, you can say. And by doing this, he takes something that is a pattern that is sort of on the broader scale, the way that Christ creates the world in general, he brings it into a microcosm so that it can be the head of creation through the seed that will bring all of creation back into himself. And it was super important that he did those old creation miracles because it allows us today to recognize him as God, as the creator of this world. But it also allowed people to do the same at the time. And it was a part. It was an important part of the story. It's what allowed people to recognize him as God back then. And some people followed him. And lots of people just wanted to kill him because of it. And that was an important part of the story. It was important that he. The miracles that he did were uncontrovertible. Like people couldn't just dismiss him. If he hadn't done miracles, not that many people would have wanted to kill him. But he was really despised because people couldn't dismiss him. They didn't like what he was saying, but they couldn't dismiss his powers. They couldn't dismiss the fact that he was clearly doing something miraculous. And that was a way that Luis puts it, that is really beautiful, I think, is he. It's not as if God was coming and just sort of wrecking random miracles like you see in some pagan myths. Sometimes there's weird stuff that happens, just doesn't. Miracles don't seem to make sense. But what you see rather in Christ's miracles, it's more like a king Coming into his own kingdom, a king, doing some things that will sort of seamlessly fit into creation in the same way that my mind seamlessly informs my brain, for instance."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1833.37,"end":1834.29,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1834.29,"end":1835.09,"speaker":"Jp Marceau","text":"Yeah, makes sense."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1835.09,"end":1905.04,"speaker":"Jonathan Pageau","text":"One of the things that I like is to really use that very pattern of, let's say, emergence and emanation to look at the miracles of Christ. Because like I said, I think that every single miracle of Christ bring together or show us the secret of this process. They show us how, in Old Testament terms, how heaven and earth meet together. And so the idea that Christ heals the sick is exactly that. The notion of a sick person is someone who's parts don't fit together. That's what a sick person is. They have different aspects of themselves and they're not properly fit, they're not properly working together. And so the word, the seed, the light comes from above and brings it together, remanifests, like re imprints the normal pattern on that broken vessel. And so that's one of the types of miracles Christ does, like I said, walking on water, healing, stopping the storm. All of these are the same. They're all the same thing. They're all, you know, something from above coming down and calming, bringing order, making sense of that which is, which is below."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1905.6,"end":1906.04,"speaker":"Jp Marceau","text":"Yeah."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1906.04,"end":1951.35,"speaker":"Jonathan Pageau","text":"And I think that every really, every single miracle that Christ does the same with, you know, something as crazy as this notion of the healing of the woman that bleeds. Right. And so here is a woman who's leaking stuff, like it does not clear exactly what's going on, but she's leaking. And so it's like she's not contained. And so Christ comes and just by touching Christ, then she becomes contained, like her identity and her body kind of come together and she stops to lose herself on the world. She starts to spread herself out on the ground, you could say. And so every single miracle that Christ does is just manifesting in a super manner, in like a super condensed manner, the very process of how reality shows itself to us."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":1951.51,"end":2106.15,"speaker":"Jp Marceau","text":"Yeah, yeah. And one thing that Lewis brings out, and we touched on a few of those, for instance, in the walking on water and other miracles, like there will be the transfiguration and also the raising of the dead and the resurrection of Christ himself. Lewis calls those new creation miracles in that they're not just the old patterns of creation, not just the old ways in which heaven and earth meet, like multiplying loaves and fishes and turning water into wine and so on. Those are old patterns. Those are the old ways in which heaven and Earth meet. But in the Incarnation, Christ doesn't just sort of come down to show us the patterns of the old creation. The purpose is also to bring all of creation back into himself. And in doing that, this will include setting all of the powers and principalities right. This will involve, you can say, rewriting the regularities, rewriting the patterns that hold in nature. In modern language, you can see rewriting the laws of nature. And you can see that Christ was smoothly moving from the old creation miracles to the new creation miracles in his ministry. So it's towards the end that he raises Lazarus from the dead, that he is transfigured, and also that he is ultimately himself resurrected. Those are all cases where it's not only that in the old creation, heaven and earth meet, that patterns and matter can meet to form loaves, fishes, and so on. In the new creation miracles, which points to the new creation, where heaven and earth will meet even more directly, like the relationship will be more intense. Mind will be able to inform matter more. So that's an instance of walking on water, where it's not just that our minds can inform our bodies, our minds will be able to inform even water, even other aspects of creation that are chaotic and unruly at the moment. The transfiguration is another instance where Christ's body was shining and close to Moses and Elijah. This idea that you can sort of be in tune with older patterns and bring them back into a new and richer and transformed body. And then same thing with Christ's body after the resurrection. It's not just that his head was able to govern his body, that he didn't die like Lazarus or the other one or two people he raised from the dead, I'm not sure. So it's not just that it reverses the normal course of nature, let's say the second law of thermodynamics by."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2108.6,"end":2108.76,"speaker":"Jonathan Pageau","text":"By."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2108.76,"end":2170.46,"speaker":"Jp Marceau","text":"Recreating order that was lost. His body was also able to do a bunch of stuff that he couldn't do before. He can sort of go through walls. He can kind of appear and disappear. All kinds of weird things happen that show that the. The purpose of the Incarnation was to ultimately change the laws of nature. So to set creation right after, after we consider the patterns of nature had fallen and that the patterns that I laid out before were wrong, Christ lays them out right again. So in showing us that in using the patterns of selectiveness, vicariousness, death and rebirth, Christ shows us that at their deepest nature, they were meant for good. And yah actually sets them for good in the incarnation, like he really does use selectiveness, vicariousness, and death and rebirth to set those patterns, set nature right again. And it's been unfolding for 2,000 years, obviously, and it's not perfect, but it's already better than it was 2,000 years ago."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2171.02,"end":2354.91,"speaker":"Jonathan Pageau","text":"Well, that's at least what we think. But yeah. And so I think that we've probably gone for quite a while. But I think that at least what I kind of take out of this is really understanding miracles. It's almost like reversing the way that our kind of new atheist type of person sees miracles, which is that instead of seeing miracles as the freak thing you use to disprove religion, it's almost as if it's the contrary. The miracle becomes the very key to showing you how reality works. It actually becomes shining moments that are so bright. And there's something about that where the pattern appears so strongly in the miracle that. And it becomes difficult for us to see the secondary causes. It's like, I can't. If you ask me, like, okay, how is it that Jesus walked on water? It's like, I don't know. First of all, I wasn't there. I can't tell you. But what I can tell you is when I see that story and I hear the story of Christ walking on water, I recognize that it's showing me how reality works. It's manifesting to me some very deep secrets of how the world exists and also how we are called to exist in Christ. That is, we are also called to, through our own, like our attachment to God and our Logos, to inform and to stabilize the reality around us, whether it's our relationships, our families, and also the physical world in terms of, terms of, you know, in terms of building things and creating cities and creating civilization. And so. And so then at that point, the secondary causes, it's like you don't care what they are. And I know a lot of people will get angry that I say that, but I don't know what the secondary causes are. And I don't. It doesn't really bother me. I don't ask that question. Just, just like you said, in the way that I also don't understand the secondary causes of how my own thought works. I don't understand how all the neurons align and how all the, you know, all the cells, you know, whatever, all this. Things that's going on at lower levels. I don't understand it. And I don't attend to that because if I try to attend to that too much, then I start to lose what exactly this is about. And I've seen this in kind of modern approaches to miracles where they try to kind of explain the secondary causalities. I heard crazy, crazy things. Even Christians saying crazy things about how, you know, like when the Israelites crossed the Red Sea, that, you know, at the Red Sea at that point is really thin. It's really not. It's really shallow at a certain time of year. And if there was a really strong wind, maybe it could, like, split open the sea and then they could walk through. And I was like, dude, you're. You're losing the plot here. Like, I don't know what you're. I don't care what you're talking about. You're losing you. Don't you stop to understand what this miracle is about and how it manifests the very pattern of creation by pulling dry earth out of water through the spirit coming down from above. It's like if you can't. If once you start attending too much to the secondary causes, the. You'll start to see how it's showing you the pattern of reality."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2354.99,"end":2428.21,"speaker":"Jp Marceau","text":"Yeah, yeah, yeah. I was hoping we would get to this because there's something I want to stress at this point. And it's not just a pragmatic move of focusing on the pattern, focusing on the higher level pattern rather than focusing on the multiplicity. It's like, I've seen this in reading papers in philosophy of mind. Like, it would be technically wrong, for instance, for me to try to explain something why you're talking to me on zoom right now. If I was to look at the precise neuronal events that occurred within your brain, it would be technically wrong. And we can do this using counterfactuals. So let's say if I say, okay, so if rather than the neuronal configuration A, you add something else. If this neural configuration didn't happen, would you still have come to talk to me on zoom? And of course, the answer is yes. Like, you wouldn't have done it in the precise way, let's say that you move this morning at whatever time. But the overarching pattern of you coming to zoom and talking to me, this is still true. The real explanation is at the level of your intention, at the level of your consciousness, and not at the level of your individual neurons."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2428.37,"end":2468.83,"speaker":"Jonathan Pageau","text":"Yeah, and I think that's really important to understand because. Because of the multiplicity and because the possibility of difference at the lower level. If you start to notice the differences at the lower level, then. Then you. Then you don't realize that multiplicity, different multiplicities can. Can manifest the same pattern. Like a pattern can manifest. It's a. For example, like if you take two cups and you focus on how they're different, and you start looking at all the different chips and the different things in the paint and everything, and that's what you're talking about. It's like, okay, dude, both of those are cups. Stop focusing on the. On the details because you're going to forget what's going on. And he's got his Christmas cup, too. Look at that. It's not even Halloween yet."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2469.31,"end":2471.55,"speaker":"Jp Marceau","text":"Because, yeah, we had really Christmas weather."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2471.55,"end":2472.91,"speaker":"Jonathan Pageau","text":"Here in Kobe, snowing."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2473.39,"end":2530.76,"speaker":"Jp Marceau","text":"Yeah, it's going away now, but anyways, it's gonna come back. Even this cup, like at every instant, it's different. Like it's exchanging neurons and whatever. There's all kinds of vibrations that are happening there. And it's still the same cup. All the multiplicity at the lower level doesn't remain the unity at the level of the cup. So I think the same thing happens in the miracles of Christ, for instance. I think a great illustration of this is the fact that we have four accounts of his resurrection and they're somewhat different. And I think this is telling us that it doesn't matter which precise physical manifestation happened of the pattern. What matters is the pattern of the resurrection was there. This is what matters. It could have been like either of the accounts, it could have been something different. As long as the same pattern holds, the precise manifestation isn't what matters any more than when I'm speaking to you now. What matters is the thoughts behind what I'm saying, not the precise neuronal configuration. There could be a million different neural configurations that would give the same manifestation of my thought."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2531.16,"end":2589.42,"speaker":"Jonathan Pageau","text":"Yeah, and there was, you know, even in the early church, there was a temptation to synchronize the gospel. There was a desire. Some people had the desire to take the four gospels and then kind of streamline them and then make one gospel that everybody would follow. And the church fathers refused that. They refused that process. And I think that there is a hint in there. There's a suggestion of what we said, which is that multiplicity comes together in unity. And even sometimes things that look contradictory or look like that, they're not the same, that it's the pattern which brings them together. And so the thing that brings the four gospel accounts together is Christ. Christ is beyond the gospels. Christ, you know, when. When some people call God, call the Bible, the word of God. Got to be very careful. The word of God is not the Gospels. It's what's above it. It's Christ, which is. Which is holding together these different, sometimes even different accounts of his life."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2589.66,"end":2629.93,"speaker":"Jp Marceau","text":"Yeah, yeah. And I can't. I want to use that occasion to come back on, especially the very old miracles in the Bibles, because it happens sometimes that. I've seen it in Q and A's, where people ask you about, let's say, the Exodus and so on. And I think with what we've said, we have the key to answer, even like some. Some of the more reluctant people, when let's say it says that Moses split the water. And you alluded to this miracle earlier. I don't know what the. Like, the precise physical manifestation of the pattern was. And it doesn't matter. What matters is the pattern. There was a physical manifestation of the pattern. Like, it. It's necessary."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2631.37,"end":2642.05,"speaker":"Jonathan Pageau","text":"I think that's important too. It's not people, because they don't. They stop to realize that symbolism is the pattern of reality. They always want to tend to go towards. Oh, it's an imaginary thing. Well, what do you mean?"}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2642.05,"end":2642.29,"speaker":"Jp Marceau","text":"What?"}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2642.29,"end":2652.13,"speaker":"Jonathan Pageau","text":"It's like it's just a story people told? No, it's like that's the pattern of reality. They're talking about how the world manifests itself. It's just maybe not in the way you would want it to be described, but, you know."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2652.29,"end":2700.14,"speaker":"Jp Marceau","text":"Yeah, I think it's when. Let's say you often talk about this on your channel, the way you. You often talk phenomenologically. And it's sort of implicit that when you describe the way that we humans perceive patterns, this is how we contract stories in the past, making them more and more mythological. The fact that we do this in our phenomenology reflects something that is real in the outside world, outside of our phenomenology. So whatever happened during the Exodus, like, I don't know if it was. I don't know what the physical manifestation was, but whatever happened, it was crazy. Like, it's as crazy as what you imagine when you imagine Moses splitting the waters. And it's the pattern that matters. The precise physical manifestation isn't a big deal. It's important that it happened. But the precise one doesn't. And whichever manifestation happened, it's gonna blow our minds anyways."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2700.79,"end":2747.76,"speaker":"Jonathan Pageau","text":"And it was important enough to. In the eyes of the Israelites, to seal for them what was happening and to understand that they were going through a recreation, that they were moving out of the flood, that they were finding new land again, that all of the Patterns that they had learned as children in terms of the story of the flood of Noah is what was happening to them. And it was happening in a dramatic manner that was about to launch into. Into. I mean, they didn't know at the time, but was gonna launch into basically the most influential story in all of humanity. Like these stories that have basically molded all of. All of civilization, all of Western civilization, and is also not just Western civilization, but is also molding other civilizations through the kind of the spread of Western ideas."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2747.92,"end":2778.37,"speaker":"Jp Marceau","text":"Yeah, yeah. And even, let's say if you try to look at the story of Judaism by naturalizing miracles, it's not gonna be any less weird. It's so strange. Like the kind of laws they have and circumcision and all those rituals and like, what do they have against idolatry? Like, the only ones who care about this stuff, they're such a weird people. Like, no matter what genesis you come to use to understand them, it's always going to be strange and it's always gonna express the same pattern as the Israelites themselves described in the Old Testament. Yeah."}
{"episode_id":"SW - #130 - 2020-12-17 - Miracles and their Role in Creation","start":2778.69,"end":2882.47,"speaker":"Jonathan Pageau","text":"All right, jp, I think we've gone around miracles and we've created a few headaches to some people watching this. I imagine the process and so. All right, guys, the comment section is open. I know it's going to be crazy and there's going to be a lot of stuff going on, so go nuts and we'll have fun reading the comments and maybe engaging on some further time on this as well. And I want to tell everybody to go to the symbolicworld.com check out the blog. The articles that are being put out are all very good and JP's article especially. So check that out and stay tuned for more discussion on symbolism with other writers on the blog as well. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to. To get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on Subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
