{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1.28,"end":7.52,"speaker":"Jonathan Pageau","text":"In this episode of the Symbolic World podcast, I'm playing for you a discussion that I had with Father Stephen Freeman."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":7.52,"end":7.76,"speaker":"Fr Stephen Freeman","text":"Fr."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":7.76,"end":48.38,"speaker":"Jonathan Pageau","text":"Stephen Freeman is an Orthodox priest. He is also an author and a famous blogger. And I wanted to discuss with him many things, especially his vision and his understanding of beauty, of the importance of beauty in the world, of how it can transform us. But we also ended up talking very interestingly about the necessity to recognize the individual, to recognize the particular, and how although we are attached to the transcendent, as Christians, we also need to understand that the transcendent always manifests itself within the particular. And so I hope you enjoy."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":62.04,"end":65.48,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau. Welcome to the Symbolic world."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":75.16,"end":89.05,"speaker":"Jonathan Pageau","text":"Father Stephen, maybe you can tell us a little bit about yourself. I know you're a priest, but you're also an Orthodox convert. Maybe you can tell us just a quick glimpse of, of what you're doing, what you're interested in, and then we can dive right into the subject."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":90.17,"end":168.99,"speaker":"Fr Stephen Freeman","text":"Yes, thank you. It's good to be with you. And for myself, I am a convert. My family and I entered the Orthodox Church in 1998, for about 20 years before that, I served as an Episcopal priest. So if there's one thing that would tie those two traditions together would be Anglicanism, for a long time had a real feel for beauty, for liturgical things and some feel for the tradition. My sense for Orthodoxy, maybe this is, you could say this connected to reality. Orthodoxy can be kind of messy. It's got a 2000 year history, unbroken. But, you know, that's real. That's different than getting in arguments about whose church is better, whose ideas are better. I kind of look at this as, as a given. Like this is the Christianity that was given and it has, you know, all kinds of complexities and stuff and gets tied up in things. But that's my life too. In your life, it's. I kind of think of it as the real life and not some ideological construct."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":169.07,"end":209.16,"speaker":"Jonathan Pageau","text":"So, yeah, and I think that that's, for most people, I think they find that very strange because liturgy is something that at least the modern mind has to accommodate themselves to. And the kind of, let's say, this holistic practice of the church here and the hymns of the architecture and the icons and everything, it's something that seemed alien at first to the modern viewer. But maybe you can tell us a little bit about how it is that this experience of the liturgy and the encounter of this holistic beauty, how does it connect to our life and to who we are as human beings?"}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":209.64,"end":394.39,"speaker":"Fr Stephen Freeman","text":"Well, one of the ways I think about it really is under the word tradition, meaning just that which has been handed down to us. To me, tradition is not something made up by people. When people say, this is just, you know, the ideas of men, a tradition is just, you know, like my father telling me about how things work. My grandfather was a mechanic. My father was a mechanic. My two brothers are mechanics. How did they learn how to do that? Somebody had to teach them. They didn't reinvent the notion of machines in the same way. There's so many things about our life that are just like that in liturgy as well. In a sense, liturgy is a very traditional human behavior. I like, for instance, when people come into an Orthodox church, there are some stands with icons, holy pictures on them, and that sort of we kind of connect with that. We'll traditionally greet them with a kiss or whatever. I built a small little stand, a little short one with icons on it for the children because about half of my congregation are toddlers. And you can watch a child 18 months to 2 years old. And this is all the time. You see this on a Sunday morning, who come in and literally just sort of lay on the icon stand hugging it and giving it a kiss and go in. And nobody told them to do that. Nobody gave them a theological explanation. The simple connection between a child and this. This image of something they're coming to love is just natural. They might do the same thing at home with a favorite stuffed toy. I also would say the most natural thing that children do is play. The theorist Piaget, one of your French buds, Piaget, his theory of learning was that children learn by playing. You know, they act stuff out. You know, you're gonna play house, you're gonna play. We played mechanics when I was a kid, constantly taking our bicycles apart, kind of going through the ritual, because play is actually ritualized behavior. And so I sometimes say to people that a liturgical life in the church is we're playing heaven. We're doing something, the most natural thing, which is adults engaging in a ritualized behavior in which we're acting out outwardly something that is inwardly true. I mean, we do these things all the time. You come home from work, you kiss your spouse. It's a ritual. Why do you do that? I mean, there's nothing. It's just a ritual. You don't do it, and you're in trouble."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":395.03,"end":505.17,"speaker":"Jonathan Pageau","text":"No, I agree. I agree. I think that there's something that I've been thinking about for quite a while, is that this, the inevitability of ritual, you know, we have so many that we don't realize. We, you know, you shake hands, the way we look at people, we have all these manners of these matter that we've agreed upon of how to act with each other. And so when people talk to me and they say, I don't like churches that are ritualistic, I don't like the ritual, I think, okay, that's odd. You seem to be disconnected with a very important aspect of what it is to be human. And so I would say that ritual is something like ordered action. Just in general, it's action that is. It's like hierarchical action that has an order within it, and that we can. We all together, acting together. You need that, you know, if you're going to act together, you need there to be some kind of implicit order in which you're acting together. And so. And in the church, we. We kind of take that to the next level because we're also. We're also celebrating. You know, it's a celebration, but at the same time, it's not a. It's not a disorderly celebration. It's an ordered celebration. It's a. You know, it's also everybody looking together in the same direction, everybody singing the same things. And there's this. There's also multiplicity within it. People have their different. Different parts to play, but it all comes together in kind of this great symphony. I always think that, you know, this. This idea of Wagner that he talked about the perfect work of art, and he said that opera was, you know, the perfect work of art because it. It had all that, you know, it had narrative, but it also had music, and it had visual aspects and everything. And I always thought, no, Wagner's wrong. The liturgy is the perfect work of art because you're inside the art. You're not a spectator in the liturgy. You're actually participating in this kind of this giant dance that's going on around you."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":505.65,"end":517.77,"speaker":"Fr Stephen Freeman","text":"Well, I think the element of song, poor old Wagner, could go on for hours, and he's still trying to get it, waiting for the fat lady to sing."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":518.25,"end":518.65,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":522.33,"end":655.66,"speaker":"Fr Stephen Freeman","text":"I think one of the things that works for the church, particularly the tradition of liturgy, is that, you know, it's funny, like, Protestants technically rejected all of that sort of thing, and then they invented things like masons, in which they do highly stylized ritual things in which when you're doing it, you just feel very, very hokey. And, you know, and it's not. It doesn't feel authentic. And I think of. I mean, liturgy is an extremely natural behavior, and you Kind of learn how to do it and you walk within it. It should not be highly stylized, it should not be self conscious. But actually you're doing it because, I mean, as a Christian, you're not just acting in a symbolic manner. You're doing what you do because you believe what's going on is real. It's reality you're dealing with. And these things, they reveal things to us about who we are, about how the world is, about how to teach things. For instance, I think I tell parents you've got children coming into the church, and typical of an Orthodox church, it's highly decorated. You know, there's icons, various things like that. And I say to them, I believe the human soul cannot be whole without the experience of beauty. But oftentimes, in our extremely, you know, marketable world, beauty is, you know, we build things for utility, practicality. And you know, here in the suburbanized south, frankly, cities are just. Are oftentimes ugly or areas around them are just ugly. And so I think of our kids as coming into church and for a little oasis of time in the space of a week, they're exposed to beauty and wonder and things that they can't get anywhere else. Music, even music that they can sing and participate in."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":656.06,"end":701.58,"speaker":"Jonathan Pageau","text":"And so what do you think? Because we talked about beauty, how do you see. Because beauty, you know, especially for someone who's a, let's say, like a strict materialist or someone who is really focused on kind of scientific thinking, the beauty becomes almost a subjective idea. You know, it's like. What I like is what's beautiful. But I think what you're talking about or what you're bringing us to is something which is more. More objective. That there is something about beauty which kind of imposes itself on us or surprises us or kind of, you know, or brings us together. And that this, this, this notion of beauty or this aspect of beauty is something that we almost need, that it's a. It's a. It's a human need that we have something that makes us feel human."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":702.06,"end":930.18,"speaker":"Fr Stephen Freeman","text":"Yeah. And I think if beauty were purely subjective, there couldn't be art museums. When people go into art museums, they're going in to see. Agreed. Beauty. Right. And, you know, if it was all, you know, just subjective, who would pay to go see something beautiful? The, the. It's something within the modern mind. And some of it has to do with various streams we've had in our, you know, sort of philosophical, cultural things is we've lost all confidence in ourselves that, you know, the notion that it that beauty is just subjective means that I don't really believe it's beautiful or that my belief that it's beautiful is very tenuous and ready to be knocked off its feet because it's merely subjective and there can't be any communion with that because you think it's only inside you. And part of the experience of beauty, first off, it's outside you, but then it's also inside you. It's an act of communion that you're reaching out and you are engaging with it and it's engaging with you. And that's a very fundamental human experience. The first primary experience of beauty we have as human beings is of the human face. It is mother and child nursing in normal circumstances up into recent years, when we were told as mammals that we should not use our mammary glands. Every other animal on planet Earth, that's a mammal, but it's a face to face thing for us. There's all kinds of psychological studies about the impact of this, that a child is. The mother and child mirror each other's emotions and the child has an experience of communion with that. The child smiles, the mother, child's. It's an affirmation and experience of that experience of beauty as they mirror each other. When that's broken for varieties of reasons, it is just simple fact that the impact is, you know, is going to. The negative impact is going to be real. And sometimes if it's great enough, can be an impact. We experience for all of our lives that, you know, that the earliest experience of the world is that I cannot have communion with it. It's very difficult to learn it and to trust it. And so beauty has a sense of wonder. It has a sense, as you described, of order, of hierarchy, of it. I mean, the one thing you can, if you go back to, say, cave paintings. One of the things that's most striking about some of the cave paintings in France, for instance, in Spain, they're amazingly beautiful, simple. But I mean, just the. I couldn't do them. I don't have enough artistic talent to draw animals like that. They're not stiff figures. They've got a flow and a form. They draw you in. They have a kind of mystery about them. Despite how primitive they are, they work, they're beautiful. And no doubt the person painting them thought that, experienced that and taught the next guy, the next woman how to do that as well. Yeah, you know, it wasn't just John Cave painter. It was a whole tradition, of course, of course."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":930.5,"end":1031.39,"speaker":"Jonathan Pageau","text":"But I think there's something that you said that you brought up. This idea of the human face, I think is really important, especially in the Christian. The Christian revelation really then ends up centering on this experience, you know, this kind of immediate experience of the person and centering beauty and truth. And let's say this communion in the human face, I think is extremely important. It also reveals us something very important about ourselves, about how we're connected to the others. And so we. Because in the orthodox tradition, we do, let's say everything has come now to flow. Especially our notion of beauty is so centered around the icon. We kind of are constantly engaged in this relationship of this encounter with a person, this idea that you're looking into a face which is both a mirror of yourself, but is also completely another person. So you stand. If I look at you now, I'm doing it through a screen. There's still a little bit left. There's still a little bit left. I have this mysterious encounter of. Of communion. And I think that's really one of the most amazing things that I keep telling people that this idea that Christianity, that God is love, that's really the central element of Christianity and how all of this connects together, which is this encounter with a person, with persons that reveal how different they are from you, but also reveal how connected they are to you at the same time you. This kind of push and pull between. Between two people."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1031.79,"end":1169.44,"speaker":"Fr Stephen Freeman","text":"Well, I think, you know, that's. It's precisely the. In an orthodox understanding, when we talk about God, we're not really talking about an abstraction, a set of ideas, a set of doctrines or something like that. It's always grounded. I mean, our notion of salvation that is being changed, becoming whole, becoming fully what we ought to be, is most completely expressed in the phrase of beholding him face to face. That this change. Paul says that beholding Christ face to face were changed from glory to glory. That in that sense we're being healed. Which makes it. You are looking outside yourself, but you're not looking past the human. You're looking into the face of love, of complete self giving love in the face of a human being, which we as Christians say is none other than God himself. And so that's a. And it's something, as I say, we've been doing since the day we were born. I always try to stress when I've got newcomers to the faith that the. The essential act of what we call salvation is also simply becoming truly human. That the wonder is that we were created in the image and likeness of God. And so being truly and fully human is simply being conform to that which we were always made to be. We discover our true self. So when I look at, say, an icon of Christ, I'm also looking at a reflection of who I am. You know, it's. He's my mirror. When I. If I were staring at a mirror of myself, you know, it's like the. It's because I tell people these days, as I'm getting older, when I look in the mirror, mostly I see my father, and I see my father as an old man. It's actually forcing me to love him more."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1173.2,"end":1267.79,"speaker":"Jonathan Pageau","text":"I think that such a key point for me is, you know, when you start to have a kind of, let's say, intellectual awakening in your 20s, often you meet all these kinds of people who, even if they can believe in God, they have this idea, okay, I believe in God, but I. I believe God is more like an abstract force, is more like something that's, like you said, something that's abstract, something that's an idea, but that is just not our experience of reality. Because we view the world through our own consciousness, our own human consciousness. We don't know of any other world besides the one that we can view through this human consciousness. And we encounter, you know, the highest thing we encounter is always other people. You know, the more. The richest thing, the most. The thing that can transform us the most, that can make us, like you said, more human, are always other people. And so I always find it strange when people think that the highest aspect, let's say the highest ontological aspect, that, you know, the image of the infinite would be something that's abstract, like. No, the image of the infinite has to be connected to our experience of the world, which is a personal experience, which is an experience that is through consciousness. So the idea of it, when you start to see it that way, the notion of the divine mind or that God is, you know, the best image of God is Christ, then it makes so much sense in that, you know, it doesn't seem so strange at all anymore."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1268.34,"end":1430.13,"speaker":"Fr Stephen Freeman","text":"Well, something I think that's important is the distinction between the general and the particular. The truth is, you can't ever, ever, ever know anything in general. We only encounter anything in a particular. And so, for instance, in the fathers in teaching about icons, they said, you cannot paint an icon of, say, the divine nature, Right? What would that look like? Instead? It's like, why can we paint an icon of Christ? Because he became a man. Not man. Because you can't just sort of paint man. You have to paint a man, a woman, you know, a particular thing. And there's actually been a drive in certain aspects of modern art to in fact try, when we talk about abstraction, to somehow another capture or express the generalized. And in a way, the more we do that, the people begin to have this sort of cognitive dissonance in which they're all standing and staring at something that no one knows what it is. And they're thinking, even to themselves, is that art? And what can be things about it? I mean, my youngest daughter is an artist. You know, I appreciate that you can have, you know, I mean, of course, on the other hand, I mean, you know, Picasso can draw a line and it just has genius about it. And you'd have to look at it and figure out why that is. So his lines are better than my lines. But on the other hand, you finally, abstraction just fades away into nothing. It is the strange act of communion is that we discover in the particular something that unites us with that which is beyond it. I, like a term that I've used in referring to God, is calling him the transcendent particular. He's actually the ultimate particular, because there's only one of him. There's not two. There can't be general God, because there's only a God, one God. And so he's utterly. He's so utterly and transcendently particular, you know, and so he makes himself known to us in the God man, Jesus Christ. And in a way, that's also a revelation in me. I am not humanity. I'm just Stephen. And, you know, and this is how we encounter each other. And I mean, there's the old saying, I love humanity. It's people I can't stand."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1433.04,"end":1438.08,"speaker":"Jonathan Pageau","text":"Yeah, exactly. You meet that. Oh, you encounter that all the time. It's like, I love the poor."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1438.24,"end":1520.07,"speaker":"Fr Stephen Freeman","text":"Yeah, well, I hear this. I mean, people are going to attack some group that are going to attack blacks, are going to attack old, privileged white men, whatever, like that. And I'm thinking, well, which one of them? I mean, when we reduce each other to abstractions, that's actually first off, you have to generalize anybody in order to kill them. We find it very difficult to kill particular people because particular people are always not quite what you imagine. I have to actually sort of stigmatize you and paint you as something broader that I can just paste my hate on, make you stand as a false symbol for all that's wrong with your, you know, your race, your nation or whatever that way. This is always a ticket to violence. We find love in the particular. We find forgiveness. In the particular, we find union and communion with the particular, the other, after a fashion. And I would say this. I've written that modernity, that is the modern project, is inherently violent. It wants to manage, control, change. It doesn't want to be. It doesn't want to behold. It doesn't want communion. It wants to make things be what we want them to be. And in doing so, create the better world. It's a very dangerous slogan."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1520.63,"end":1588.8,"speaker":"Jonathan Pageau","text":"So I think that that's something that. I mean, I think some people are starting to see it. Some people are trying to try to separate the wheat from the chaff or try to. They want. They don't want to see the relationship because we. Between, let's say, the modern project and modern thinking, or the Enlightenment thinking and the environmental crisis, or this kind of the manner in which we treat reality. As Heidegger talked about, this idea of the standing reserve, that we treat the world as just this reserve of physical potential that we can just take and make whatever we want to make. But I think that it's an essential relationship. And it's very difficult because it's hard to see. It's hard to see a way out of that. It's hard, at least socially. It's hard to see how you've gone so far down that road that it's very difficult to imagine it in political terms. The only way that I can imagine it is in, like you said, in particular terms, to say, I, you know, I will myself try then to inhabit a different life as much as it's possible. You know, it's very difficult to do."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1588.8,"end":1597.66,"speaker":"Fr Stephen Freeman","text":"The first habit of modern thought is to see something that's wrong and then think about fixing it. Which is like we leap to the political."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1598.14,"end":1599.02,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1599.02,"end":1647.69,"speaker":"Fr Stephen Freeman","text":"Because I'm going to make a better world and think, no, no, no, that was the problem to start with. Be a better world. You know, that sort of. In the Christian spiritual tradition, if anything, it wants to tell us to slow down, to pay attention to who you are, to where you are, to pay attention to the particular. And of course, when I start talking like that, modern listeners get extremely nervous because they're afraid if they do that somehow another, you know, when we stop and slow down and we're not going to control the world. The truth is, I like to ask people, when they go all political about stuff, I kind of want to say, how's that working for you? When was the last time you thought it actually, you know, changed anything? It mostly just changes and makes you angry."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1648.17,"end":1664.01,"speaker":"Jonathan Pageau","text":"Yeah. And they'll fight as well. That's what happens is we feel self righteous because we can look at the world and see how bad it is and say, well, shouldn't we change this, shouldn't we change that? And we don't. We're not looking at our own sins, at our own frailties, at our own broken, at our own broken relationships."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1664.09,"end":1780.48,"speaker":"Fr Stephen Freeman","text":"Yeah. One of the, one of the benefits of older times of living in a monarchy is you actually knew who you could blame. It is the king. And so sort of one of the illusions of democracy is those who actually have the power have us all convinced that we're in charge. And I mean, it's like in the Soviet Union everybody voted for the same guy because you only had one candidate. But they were called like the Democratic Republic of so and so and so. Solzhenitsyn writes and says basically refuse to participate in the lie. You know, don't do things you don't actually, you know, agree to or whatever. It's sort of trying calling his fellow citizens back to the particular and not being allowed to be abstractions. As a Christian, I just don't know anything about how we change the world. I don't think that we're given that as a commandment. We're given commandments about how to live, how to actually live. And I suppose, you know, you could do the math and say if we actually live like that, it would add up to a better world. But that's not my problem. That's, that's in the hands of God. When I start thinking like that, I've exchanged being someone who lives right to someone who wants to make everybody else live right. And there's the violence again of the modern world. And so instead you slow down, you take a look, you start seeing beauty, you start living truth. You try to do the good thing. And you know, in doing this, in the face of the particularities made known to us, for me, as a Christian, made known to us in Christ, this is what it looks like to do that."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1780.8,"end":1787.25,"speaker":"Jonathan Pageau","text":"Yeah. And we have examples in history where we see how it actually changes. It actually does change the world."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1787.25,"end":1787.61,"speaker":"Fr Stephen Freeman","text":"We."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1788.33,"end":1846.25,"speaker":"Jonathan Pageau","text":"The example of the Christian martyrs is, I mean, is the most glorious example where here are these people basically just saying, no, this is, this is, you know, I'm going to stay true to what I believe, stay true to who I am, but I'm not going to fight the social system. I'm going to accept to die, you know, and not protest. And then changed it, transformed the Roman Empire, it converted the Roman Empire. It's it's crazy to, to, you know, to think that that's possible. But we, we've seen the Christian story do that. Saint Francis of Assisi is a great example of that, where he just said, it's just me. I just, I'm the. I'm the smallest of all. I am the servant of all. I'm, you know, I'm the. And then he changed Christianity, you know, until today. He transformed the all. He transformed the Catholic Church by. By not wanting to revolutionize anything, by just wanting to follow Christ and to do these humble things. You know, everything changed."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1846.41,"end":1966.65,"speaker":"Fr Stephen Freeman","text":"You know, it may not always work out like that, but a couple of years ago here in the US and maybe still going on big, big debates about guns and things like that. And I, you know, you get on social media and there's just, you know, no guns, lots of guns. Hate, hate, hate. And I posted and just basically said, my response to it is, I promise I will not kill you. That as a Christian, this is my promise to the world, is I am not going to kill you. Because I believe in God and because I believe that he's in charge of history and its outcome, I can tell you that I don't need to kill you and I won't kill you. Someone immediately said, but what if you live in a dangerous neighborhood? And I said, well, then I'll move. I mean, it's. I mean, I. It's kind of the response to that isn't, well, let me get enough guns so that, I mean, you can't outgun them. They'll just, you know, it's like, don't live like that. Don't live like that. And I, you know, people can argue, is that practical? I just, you know, I, We. All I can say is, you know, bless God, it's not working out that these things and the arguments are endless and people are never getting around to just living. And, you know, I think this is a fundamental part of the Christian vision, is that we should live. I mean, I think one of the great present tragedies in Christianity is the highly politicized things that are going on, that in which many Christians are absolutely convinced that there's a culture war and that their greatest Christian duty is to be a culture warrior. And you can get that from both left and right."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1966.81,"end":1967.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1969.1,"end":1990.38,"speaker":"Fr Stephen Freeman","text":"And in that frequently they're all engaging in generalities. I mean, the culture war is us versus them, and us and them are both generalities. And there's no, there's no, There can be no love in it. And there's no transformation. You know, if either side won, you still wouldn't want to live in their world."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":1991.34,"end":2041.07,"speaker":"Jonathan Pageau","text":"Yeah, and I think that that's, I mean, but it's. At the same time, it's true that that's the hardest thing is. The hardest thing is to. It's so much easier to be. You know, I say that because I'm on social media, I'm on YouTube, I'm doing all this. And it's a lot easier to do that, to comment on different posts than to pay attention to the people who are around you, the people, you know, to your family, to the. To your neighbors, to the community that's directly around you and engage with them, see them as people and be a. You know, be that particular who's who. Who is manifesting Christ and is seeing Christ in others to the most that they can do. But yeah, we get pulled. I mean, I feel it. I feel getting pulled in the political sphere, I try to avoid it. People on my YouTube channel know that sometimes I like, I go a little bit in and then I'm like, no, I need to get back."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2042.91,"end":2223.49,"speaker":"Fr Stephen Freeman","text":"It's a great temptation. But you think about Christ and his interactions. There were, you know, in some ways, Israel at the time was a highly politicized thing. You had your groups, you had your Pharisees and Sadducees and other groups, and then you had the, you know, those who were religious and those who were considered the unrighteous, you know, prostitutes and tax collectors and things that way. And he, he not only, you know, they talk about him meeting and eating with prostitutes and tax collectors and these other ne' er do wells. But more amazing than that, I think about it, we know some of their names. I mean, for instance, there's a short little man in the town of Jericho named Zacchaeus who was a tax collector and hated by everybody in the town. But the amazing thing is, I mean, how obscure is that? Two thousand years ago, some dude named Zacchaeus, and we know his name why? Because Jesus called his name out and said, I'm going to go home and eat with you today. He didn't just sort of say, you know, some general invitation to all local tax collectors come and we'll have a meal. He goes, zacchaeus. And it's interesting, Jesus is walking along, sees this guy in a tree, and he knows his name, and he says, zacchaeus, come down. Not you and the tree come down, but Zacchaeus, you come down. And we have this consistently, these encounters that are highly personal and which he sees the person not for their sin, not for their brokenness, not even for their. Their larger commitments, like Pharisee or whatever else. He just sees them. We know the name of a Pharisee, Simon, whose house he ate in and a woman washed Jesus feet. We know the name of the Pharisee Nicodemus. And of others. We know them by name because this was personal. Encounters in the Book of Revelation. Talk about art in the Book of Revelation. One of the sweetest things in it of the vision of heaven is, I will write a new name on you. Like, I will reveal to you the, you know, the truth of who you really are. I will tell you your name. And it's sort of like. And when you hear it, I think that the sense would be of at last that the complete revelation of the truth of your being would be made known in the name God speaks to you. That is, you know utterly who you are. And I mean, a name is in that sense, uniquely personal. You know, you walk into the room, you say, stephen, you have my attention. And so there's this. This particular. But the particular isn't to reduce things. It's just. It's actually the only way we ever have communion with anything. Yeah. You know, it has to be."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2223.89,"end":2290.29,"speaker":"Jonathan Pageau","text":"You see it like. I mean, one of my favorite, let's say I'm gonna paraphrase, but one of my favorite quotes from, from Saint Maximus the Confessor is when he talks about, you know, he says, you know, as the person, you know, even a person who's discovering, let's say, the spiritual essences of something. And he sees these spiritual essences, let's say, separate from the particulars. He sees that. No, there's no contradiction. They're not opposed to each other. They're actually. They're actually made to be together. Like, that's the whole. That's the whole key of the Incarnation, is that we're not called to this kind of, you know, this abstract world, but we're called to encounter the world as a embodied reality. And so. And I think. I mean, it's very. It's very mysterious. It's very mysterious when you think of it in terms of the totality. You know, we think, we talk about revelation, we think of it in terms of this kind of final revelation. When everything is. Comes together, it's difficult to fathom how this particularity is all going to come together. But we can, you know, in our experience, like we've been talking about, and we. Our experience, that's how we experience it. That's how we experience the world."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2291.25,"end":2330.2,"speaker":"Fr Stephen Freeman","text":"You can say that to a degree. The great revolution, intellectually, I can say it that way in Christianity was already in Plato. There is a discussion of the transcendental, that is goodness, truth and beauty. And there's a recognition that this is important, this is what we should be talking about. What happens in Christianity is that language gets taken up, but there is a recognition that the transcendentals are in fact to be encountered in the particular. And that becomes the revolution in which, for instance, the word person as we know it today is a Christian invention."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2330.52,"end":2334.6,"speaker":"Jonathan Pageau","text":"Yeah, it used to mean task, you know, the right word for what we were talking about."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2334.6,"end":2428.31,"speaker":"Fr Stephen Freeman","text":"You were just. You had a thing, you were a helot, you were a slave, you were a something, and suddenly you become a name. Every person of equal value. We couldn't say that all people, all men are created equal without that revolution having occurred. It gave infinite value to the particular, whereas prior to that, there was only infinite value to the infinite. And in a way, you can't get it in your hands and in the incarnation and what that sets in motion, the life of understanding is a drive towards mean. When God becomes man, the infinite enters the particular, and the particular, you know, is revealed to have infinite value. And that's a complete change. But nothing is just dispensable. Everything has infinite value. And that's, you know, that's really the drive of Christian ethics is understanding that human life is uniquely particular thing, unrepeatable, with infinite value and worth, sacrificing, loving, sacrificing for loving, doing all of that. And that it's only, you know, that without that, I'm only speaking vague generalities, it's only in the particular that we encounter goodness, truth and beauty. So that's. That's really the root of incarnation for us."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2428.63,"end":2504.74,"speaker":"Jonathan Pageau","text":"Yeah, And I think that it's almost as if we haven't completely. We haven't completely understood the ramifications of that until today, you know, we haven't. It seems when you think about it, it just creates such a. There's. It creates such a jam in your mind, you know, to think about it that way. But it also, intuitively, there's also something very deeply intuitive that makes it. That it has become the core of our ethical thinking. I mean, like, we talk about this all the time, that even now, the secular ethics, they are based in this incarnational thinking, even almost without knowing it. This notion of this, the value in the particular and the value of the individual is something which has come through the incarnation. But now, you know, in the modern project, we've seen also how it has slipped aside. When Christianity is completely knocked out of the arena, then all of a sudden that has to go too. And then this crazy collectivism just appears and just takes over. And then human beings become numbers. They become just human fodder for whatever ideology you have."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2505.22,"end":2595.76,"speaker":"Fr Stephen Freeman","text":"GK Chesterton said that when the tradition gets jettisoned, like the Christian tradition, the consensus of earlier times gets jettisoned, he said, it's not that virtue disappears from the world, he said, but what you get is the virtues gone mad. And so, you know, most of the people out there are actually basing whatever they're thinking on some version of the traditional Christian virtues, but they've lost their connection, you know, to, to one another. And they're grounding in the particular and in these things of life, and they just, you know, they run wild and drive us crazy. And so you have competing virtues. You have, you know, the love of. The love of tribe versus, you know, other kinds of things, and it makes us crazy. I think also, you know, I have great respect for people who don't believe in God. Father Thomas Hopko of Blessed Memory once said that oftentimes it takes an act of grace for someone to become an atheist, meaning that, you know, that they have, in fact, rejected a false God. That's a good thing. That's a very good thing. And I always say to people who say that they don't believe in God is. Tell me about the God you don't believe in. I'll bet I don't believe in that one too."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2596.08,"end":2596.72,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2599.84,"end":2755.35,"speaker":"Fr Stephen Freeman","text":"You know, and it's, in fact, when I deal with people who are coming into the Orthodox Church, we have a lot of inquirers and people. One of the things we spend a lot of time with is not just me trying to tell them about God, but us working about with. With what is not God, like getting rid of a lot of false images and things. And so, I mean, there's some terrible, terrible things that had been done in the name of Christianity, particularly in the modern period, for God's sake. I mean, a whole range of the genocide on the American continent was, you know, done with, you know, under some sort of Christian banner, you know, that the. The Indians get to be Canaanites and we get to be the Israelites and we're going to drive them out of our promised land. Gee, that's unfair. I mean, in a terrible and tragic thing. So if someone rejects that, if that's what they take to be Christianity. Well, good for them. You should reject that. It's false, it's not true. I would say as an Orthodox Christian, though, and I'm not arguing denominations or something, just talking about a different way of doing. Take a look at what happened in Alaska in which the missionaries from Russia who arrived there in the 1700s were taught that they were to behave as a guest in someone's home. And they lived like that. And it's, you know, a very peaceful story without genocide, without anything that way, but a settling in and an even and ennobling, an acceptance of many things that were native to the peoples, that were incorporated into their faith and life and practice, just as it had been for many, many centuries across the world. And so meanwhile, on the other hand, you can take anything else that you think of as noble and true and good that human beings have done and practiced. And it also has things about it that are ignoble, not true and not good. And including in my personal life, I have all those things too. And so why should I expect the world to have acted any different than I act? You know, instead I have to be about being different and by the grace and wonder of God to show that this is actually possible. And so, you know, and you know, one of the things I say is I start by promising not to kill you."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2756.63,"end":2757.51,"speaker":"Jonathan Pageau","text":"It's a good start."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2758.31,"end":2761.79,"speaker":"Fr Stephen Freeman","text":"I mean, you know, it's amazing how killing someone can just mess up a."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2761.79,"end":2764.86,"speaker":"Jonathan Pageau","text":"Conversation, just mess everything up."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2765.42,"end":2765.9,"speaker":"Fr Stephen Freeman","text":"Yes."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2768.14,"end":2791.7,"speaker":"Jonathan Pageau","text":"All right, Father Stephen, I think we've had a really good conversation and I really appreciate. I was really hoping people could see you, can hear you, could get to know you. And I hope that all the people that are watching this that you will look at Father Steven's blog. It's called Glory to God for All Things. And you can find his book is everywhere present, I think. Is that the, Is that everywhere present?"}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2791.78,"end":2794.18,"speaker":"Fr Stephen Freeman","text":"Christianity in a one story universe."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2794.34,"end":2798.78,"speaker":"Jonathan Pageau","text":"Yeah. And I think you're. I think you're working on a book now, if I am. Yeah, I am."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2798.78,"end":2825.67,"speaker":"Fr Stephen Freeman","text":"I'm actually, Interestingly, it's tentatively going to be entitled Face to Face in which I look at shame. The role of shame in human life, the role of shame in our encounter with God and both its abuse and its proper place. It's a, it's been a. I've been working at it for a few years now and it's been hard."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2827.35,"end":2829.99,"speaker":"Jonathan Pageau","text":"That's not a subject that anybody likes to talk about."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2830.15,"end":2837.19,"speaker":"Fr Stephen Freeman","text":"I was gonna say, like, the worst thing you could put on the title would be shame because nobody would want to buy it. That's right."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2837.19,"end":2868.1,"speaker":"Jonathan Pageau","text":"Exactly. So I really, I really, I really appreciate you talking to me. And I will put all the links to your website down there so people can kind of follow through. And, you know, when you read Father Stephen's blog also, it's really interesting to go down to the comments and see these amazing conversations that are happening between people who are helping each other understand and who are kind of giving each other advice, you know, so it's like it's a whole ecology of people trying to help each other to be better people. So thank you for doing that, Father."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2868.26,"end":2870.9,"speaker":"Fr Stephen Freeman","text":"Thank you, thank you and ecology. Wow."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2875.35,"end":2930.15,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with. With people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #039 - 2019-07-02 - Stephen Freeman - Goodness, Truth and Beauty","start":2930.15,"end":2931.03,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
