{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":0.16,"end":61.85,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com but I have a feeling."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":61.85,"end":152.28,"speaker":"Paul Kingsnorth","text":"That the west itself needs to die. In fact, I think it may already have died. Actually this thing we call the west is a sacrifice and is being sacrificed so that the plant can die, so the seeds can grow. Exactly as you were talking earlier, right? You don't get the growth without the sacrifice. And I think we've got to such a point where we have created a culture that is irreligious and Babylon like and top heavy and it's just fading away. And I don't mean that there should be a giant catastrophe or we should destroy it or anything like that. I just think that it's dying if it's not already gone. And we have to let that happen because it's not going to be stoppable at this point. And instead of doing that, instead of like fighting to protect X, Y and Z aspects of the superstructure, we can go back to the root of the culture and write about that instead and build that and protect that so it's not an all or nothing situation. We don't say, oh well, the west is in trouble. Let's let everything burn like the joker, you know. But at the same time we don't say, well, let's get out there and fight for our right to, I don't know, form transnational corporations and have economic growth forever and ever and mine the asteroids with Elon Musk. Right. That's not anything to do with what we're talking about. Why don't we step back from that battle at the moment, which is going on anyway, and go back to our roots, which we'll find in those stories. Let's tell the stories of the saints. Let's tell the fairy tales anew. Let's go and write about how Christianity manifests in the landscape. And let's do that not with a plan in mind that this is going to build a civilization, but just because we think it's the thing we need to do. And then it will. Then things will happen, you know."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":163.56,"end":221.37,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Center Symbolic World. Hello, everyone. I am here with Paul Kingsnorth. I think everyone who watches these videos knows who Paul is. You know, we've had been having discussions for a few years now, and recently Paul did a talk at First Things, which was very poignant. It was. A lot of people were very touched by his talk where he. He really criticized the dangers of civilizational Christianity and, you know, the dangers of people who. Who put civilization first and see Christianity in some ways as a. As a tool to get there. And I felt called by that, you know, because, you know, because of my involvement with arc, because my discussion with Jordan Peterson and a bunch of other people. And so I thought it'd be a good idea to talk about it with. With Paul and kind of see."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":222.15,"end":222.31,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":222.31,"end":228.31,"speaker":"Jonathan Pageau","text":"And kind of explore his ideas and see where we. Where we touch and where we don't on these questions. So, Paul, thanks for talking to me."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":228.63,"end":230.71,"speaker":"Paul Kingsnorth","text":"Yeah, well, thanks for the invitation. It's always good to be back."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":231.19,"end":248.87,"speaker":"Jonathan Pageau","text":"Yes. And so maybe you could start with. Just obviously people can watch the talk. We'll link it in the description, also the written version of it. Maybe you can give a basic synthesis of what it is that you were trying to get across and then we can start the discussion."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":250.02,"end":493.58,"speaker":"Paul Kingsnorth","text":"Yeah, well, so I was invited to give the Erasmus lecture of First Things. And I, to be honest, when I was invited, I'd never heard of the Erasmus lectures. So I went and looked up what it was, and I discovered to my horror, that it had been delivered by any number of eminent theologians for decades, including the former Pope Benedict xvi. And I thought they must have made a mistake. I almost didn't go, honestly, because I didn't think I was up to it. But they asked me to do it. So I said, okay, well, I'm going to try and say something. So something that I think is necessary and really the essence of the talk, which was designed to be provocative, that was the point. Not for the sake of it, but just because I think it was something that really needed to be saying. Something that had been itching me for a long time was very much, as you've said in the introduction, I can see at the moment around us in Western society a movement coalescing of what we might call civilizational Christians. And what this is. It's a movement of people who I think quite correctly can see that Western culture is fragmenting and is spiritually empty. And, you know, all of the things that you talk about on your channel, all the things I write about, probably a lot of your readers would agree with, even if we might have different understandings of what's going on. And people look at this and they say, what's wrong with the culture? Why are things falling apart? Why do they not hold together? Why do things seem to be collapsing? And they come to the conclusion which I think is correct. I agree with it, that there's a spiritual void at the heart of the culture. I think a culture is fundamentally a spiritual creation. It's taken me about 50 years to realize that, but I think that that's how it works. So if we agree that there's such a thing as Western culture, then we have to ask ourselves, what is it? And realistically, it's what used to be Christendom, which is the domain of the Western Church, the Roman Church. And so people then from that conclusion, they leap to. From that observation, they leap to a conclusion which is that if this used to be a Christian culture, then we need to revive Christianity to defend or promote or rejuvenate the culture. But they start in the wrong place. They start with the assumption that Christianity is some sort of tool, some sort of social or cultural tool which we can use to defend the culture, fight the woke people, fight the Muslims, fight the Russians, the Chinese, whoever we want to fight, and get our culture back to some form that it used to be in or should be in, in the. And I think it's dangerous because it's precisely the wrong way around. I think the Western culture is certainly a manifestation of Christianity. It absolutely was at the core of the culture. That's not the only thing that it comes from, but it's the spiritual core and has been for centuries. But not because people set out to build a civilization with Christianity, but because they tried to follow Christ and around them grew a culture which then became a civilization for better or for worse. And we can argue about whether it was good or bad. And I think that exactly the wrong thing is going on here. People are starting in the wrong place. They're saying, I want a certain type of civilization, so we should use the cross as a sword to build it. And the second thing I went on to say was if we actually step back and look at the values of modern civilization, or indeed all civilization, if we want to be really controversial, can we actually say that they're Christian at all? Can we really? If we look at. And one thing I did in the talk is I listed the seven deadly sins. And I looked at the fact that I think that our culture is based today in what Western capitalist modernity, on basically inflaming them all for profit. And I think there's a good case to be made. I don't think if Christ came and looked at our culture today, he'd say, oh, well, this is exactly what I had in mind. He would not. And could we really, in fact say that any giant centralized culture based on accumulation and wealth creation and forced labor and all the rest of it is Christian at all? Regardless of what you think about that, the fundamental thing I was trying to say was that we have to, I think, head off at the past, this attempt to use the Christian way as a tool to defend or promote a certain type of culture, because I think that it's exceptionally dangerous and it's going to do damage to Christianity and probably to the culture as well."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":496.62,"end":734.63,"speaker":"Jonathan Pageau","text":"No, I think. I think that definitely your critique falls in the right time. And you know, in the moment when we do are seeing this shift that's happening, there are more and more people that are either moving especially towards Christianity or at least are not hostile to it in the ways that they were before. And, and some of these characters are not, are not particularly, are not Christian themselves. And so it's fascinating because when I watched the talk, I thought, I really agree with you for 50. I think that's what I wrote in the email. I think like 50% you said, I completely, completely agree with you in the sense that. And I reread your text again and I realized I actually agree with you more than 50%. 50% was more like the critique of what you said. I definitely agree with you. Maybe I could even say that I have the sense in which when Christ talks of Antichrist, this is what he's talking about is in some ways something which is within Christianity, which is out of Christianity, but is using Christ for means that are different than for the glory of God or for the transformation of souls. And so you have the story of Simon the Magician, for example, right there in Acts, which is in some ways an example of that which is Simon the magician wants Christ so he can, you know, make miracles and, you know, and impress everyone. And that is exactly the opposite. And it's not that the apostles don't make miracles. It's that their miracles are rooted in a true faith and a true willingness to sacrifice for the highest thing. And so I think that. I see that even if you look at the images in Revelation, you have, like these two images of civilization. You have one which is the beginning beast, the beast and the. And I think that's exactly what you're describing, both in terms of this tendency to move explicitly towards our passions in any way. The way the beast is described is very much in the way you describe in your own text, the criticism of civilization saying it's greed, it's exchange, it's lust, it's all these things that are kind of wrapped into one. And everybody is celebrating this because it. It's giving her, giving them what they want. And then at the same time, the machine which is on, which is hiding under the. Which is basically these crazy systems of control that set themselves up in the moment when we are basically giving ourselves to our passions, you know, and to facilitate that as well. And so I see that. And then I also see this other image, which is the image of the heavenly Jerusalem as. And that maybe that's why I said 5050 is because I see these two images as two possibilities of what is downstream from Christ. But no matter what, I agree that to have the heavenly Jerusalem, it's not. You don't try to get the heavenly Jerusalem. You try to see the Son of Man. You try to live in the light that the Lamb provides. And then downstream from that, you do have some image of civilization. And that's maybe the question I have for you is that because you're right, you do push pretty radically in your talk. It's like you say, all civilization is wrong. And I'm thinking it seems, though, that there's like the wheat and the chaff in civilization, kind of like what Christ describes. And that, for example, our civilization, for all its evil, and I totally agree with that, is probably the civilization in which the fewest people die of hunger that has ever existed in the history of humanity. Right. It's. It's. We have another type of despair which is more kind of spiritual despair. But. But that's a real thing. It's a real thing that, that we have this virtue of taking care of the poor. That's part of the system. Anyways, I'm talking a lot, but so maybe I set you up with these two opposites and I want to know what you think about that."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":735.11,"end":778.39,"speaker":"Paul Kingsnorth","text":"Hello everyone, this is Annie Crawford inviting you to join me this January for a symbolic world reading of Til we have faces, the book C.S. lewis calls far and away the best I've written. Till we have Faces is Lewis's modern retelling of the myth of Cupid and Spirit Psyche, a mysterious tale of dark idolatry, classical enlightenment and the shocking discovery of true religious vision. In our four week online course together, we'll explore what CS Lewis has to show us about the nature of myth, the dangers of love, the limits of reason, and the secrets of genuine re enchantment. This is a book, an author and a class you won't want to miss."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":779.77,"end":840.7,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Mediweight loss is is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":844.46,"end":1121.92,"speaker":"Paul Kingsnorth","text":"Yeah, I think it's really interesting. So I mean, I have a long history of complaining about civilization. That's the first thing I don't want to try. And you know, I've made a career out of it. And I don't want to be suggesting that. Luckily Jesus agrees with me because that wasn't the point. I mean, one of the things I did want to do in the talk with seriousness and one of the reasons I wanted to give it is I didn't want to just stand up there and attack people. I'm actually looking at myself quite a lot of the time. Because if we look at the way Christ tells us to live in the Gospels, it's not the way I'm living, that's the reality of it. And the more Christian I become, the more Christ is sort of inside me, bashing away and churning things around, the more that becomes painfully apparent. And so that's the paradox we're all living in as Christians. If I look at the things we're told to do in terms of wealth and power and resisting evil or not resisting evil, it's not only the opposite of what our civilization tells us to do, it's pretty much the opposite of what I do a lot of the time. And I did try and say that a couple of times. So I don't want. I always give the impression that I'm sort of preaching as a holy man because I'm really not. I mean, it's a challenge, right? So we are living in a top down machine civilization, whatever you want to call it, there we are. It's not going away. It's existed for 10,000 years now, of course it gives us good material things, there's no doubt about that. And that's why we like it and people do like it. The question is what the costs are. And that's always the question. What's downstream of all the good stuff? We get what's literally downstream sometimes in the rivers and in the destruction of the forests and the loss of the culture and all the things that we can see happening, right? So you never get anything for free. You do get your good stuff, but you get a lot of bad stuff as well. That's just life. So there's not a lot to be gained just from saying civilization is bad and we should not live in it because we do. There's no getting away from it. That's where we are. The question is what kind of values as Christians we're actually supposed to be pursuing. That's my question. And as I say, it's a personal question for me and for us and for the culture we live in. I can't escape the fact the more I read of the church fathers, the more I read of the monastic saints, the more I read of the Phil Kalia, the more I read of the Gospels. And it's very, very difficult to. You have to try very hard to escape the fact that there is a clear division between what Christ calls the world and what he calls the kingdom. And there's no doubt about it. And he says very clearly, I've called you out of the world. And because I've called you out of the world, you're going to be hated by the values of the world. The world being the passions that build the kind of things that you're just talking about Babylon as the kind of manifestation of the great corrupt global city. And interestingly, in the book of Revelation, when Babylon is at its most corrupted, you hear this voice from the heaven, don't you? You hear Christ, and he says, come out of her, my people. It's a really interesting thought. What are you supposed to do with Babylon? You're supposed to leave because Babylon is corrupt and the heavenly Jerusalem is coming instead. So we've got this tension all the time. And the whole of Christianity seems to me like a tension. I wrote about it recently as feeling like a kind of Zen Cohen that you're walking around all the time just going, what is this? It's not a logical system here. So of course there are all these contradictions and tensions in it. But the question becomes, what does a Christian life look like? And therefore, what does a Christian culture look like? And therefore, how should we live that? And there might be a lot of answers to that. And you can only really try and do it by living it, as many people have done for 2,000 years. But I'm pretty sure it doesn't look like modern civilization. And so as Christians, obviously we're living in Babylon. So there we are, we have to deal with that. But if we start saying that the values of Babylon are actually really Christian values and we have to defend them, that's where we're in trouble. So the question for me seems to be, and I am stumbling around here because this is, I'm not a theologian or a saint or a bishop, I'm somebody trying to work this out as I go along. The question seems to be not how shall we defend all the glorious values of modernity and wealth creation and profit. And interestingly, the people who talk like this seem to me often to be defending Enlightenment values. Actually, they're defending liberalism and democracy and civil and capitalism and wealth creation. And these may or may not be good things. I'm not saying they're bad things, but they're not fundamentally Christian things. And they're not anti Christian either necessarily, but they're very modern values. So what are we doing? Are we trying to live as Christians in a Christian culture? And what would that look like? And how different would it look like from the thing that we are doing here? And I think if we confuse the values of modern, capitalist, progressive modernity with the gospel. I think we're in a real. We're in a real state because they don't seem to bear any resemblance to each other."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":1122.24,"end":1344.53,"speaker":"Jonathan Pageau","text":"Yeah, no, I think, I think you. I think you. I think I agree with you. One of the patterns that I see in scripture, and you can tell me what you think about, about this is I see exactly in some ways what you described. So in the Bible, civilization is the. The comes down from Cain, you know, and so you have the fall, and then Cain founds a city, and then his descendants found pretty much everything that we consider civilization. The arts, music and then technology, architecture, you know, ways of living in the world. And then you have this intimation that violence increases. Right. So when you get to, to. To lamech it, basically this sense that, you know, the violence has increased 70 fold, you know, that this is this extremely violent society and that it'll bring about the flood, it'll bring about destruction. And so one of the interesting things God seems to do in Scripture is that he seems to take the image of the city and the image of the civilization, technology and all of that, and then he. He puts it in the plan of the temple and the tabernacle. So he gives from heaven, he gives the plan of the tabernacle to Oholiab and Bezalel in order to build this thing. And the way that he talks about a holy Aben Bezalel is in similar way that is talked about Tubal Cain, that is their artisans in the sense of Cain's descendants. So the vision that I see in Scripture is that civilization always seems to get out of control and be exactly what you're saying. And that in fact, in some ways it's the spark. It's a sinful spark. And. And then God is redeeming it constantly in the story. And the ultimate image of that is of course, the heavenly Jerusalem. But the idea would be, I think, is that there should be intimations of that in the story. As we move forward, there should be moments where we have intimations of that. You know, for example, Christians have believed that the conversion of Constantine was one of those moments where it's not a perfect thing. It's not like the heavenly Jerusalem comes down from heaven, but that in the conversion of the Roman Empire and the transformation of some of the values that underlied the Roman. The Roman Empire, you know, like, like infanticide and, and chattel slavery and all the, all the, the dark aspect of the Roman Empire were being Transformed, not completely transformed, not fully, but that there was this, this motion. And so that is something that I kind of see happen. And so I, I'm not close to, I do agree about everything you said about our, our civilization now, but I, I get the sense that it doesn't mean that it's all, it's all evil. That there has to be something that God can redeem. And I'm not sure exact, like when we, when we talk about AI, you know what I think about AI? It's like I'm looking at it, seeing this like demon possessed, you know, thing coming towards us. But I'm thinking is like, I'm always asking myself, is it possible for these things to be redeemed? I'm not sure how, but I see the heavenly Jerusalem as that image because in the heavenly Jerusalem you have this, you actually have a top down and bottom up situation where the heavenly Jerusalem comes down from heaven. And then it says that the kings of all the nations bring their glory into the heavenly Jerusalem. And so what it suggests is that the nations have a glory that is, can be offered up to God. It's not all of it, not all of their behavior, not everything about them, but that there's something about the nation that can become a proper offering to God. And so anyways, I wanted to see what you think about, about that."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":1344.61,"end":1655.99,"speaker":"Paul Kingsnorth","text":"It's really interesting, isn't it? So I'm always very, very conflicted on the, on the conversion of the Roman Empire because the question is how much did the Christians convert the Romans and how much did the Romans convert the Christians into Romans and imperialists and actually probably a bit of both actually. But anyway, that was, that was a long time ago. So that was what happened. So there are these two images in the, in Revelation, there's Babylon, the earthly whore, basically the civilized decadence of the humans. And then as you say, there is the heavenly Jerusalem which is given by God. It comes down. And so I think there's really something in what you're saying and I'm thinking about this a lot. So I think humans have to build things and make things. That's what we do. So the way I see this, you can tell me if you think this is completely off beam. If you look at Genesis, there seems to be only one picture in the whole of the Bible of God creating the divine kingdom. And it's when he creates the heaven and earth and then he creates a garden and he puts us in this garden and we're effectively divine gardeners. And our job is to Name the animals, to be gardeners and to contemplate God. So we're not living in a wilderness, we're living in a garden. It's not the same thing. It's a created thing. But we have a task. And we choose, instead of fulfilling the task of contemplating God until presumably we're ready to eat the fruit of these trees, which hopefully we will be so that we can share in God's work, we decide to listen to the serpent who says, well, why don't you become gods yourself quickly? Because you don't need to listen to God. You can do it yourself. You can have the power. And so we do that, and then we have to leave the garden and the communion is broken. We can't contemplate God anymore. We can't even see God. We're on this earth and it's fallen, but it's not evil. It's fallen and we're in it. And we have to build now. Because on the Earth, if you don't build, if you don't wear clothes, if you don't defend yourself against tigers, you're going to get eaten pretty quickly because you're not in the Garden of Eden anymore, right? Because in the garden, in the state we're actually created to be in, we're also in communion with all the creatures. They don't hate us. I mean, as an aside, one of the stories, one of the projects I'm working on at the moment is my book of wild saints. And I'm really, really fascinated by it. Saints who live in wild places and end up with a relationship to creatures, which is like the relationship we had in Eden. So it's possible to get back there on this Earth, right? So that's what we're supposed to be like. In harmony with Earth, in harmony with God, in harmony with creatures. And we can't be like that because we're fallen. So we have to build. And it seems, as you say, that we keep building and building and building, and then because we're not building towards God, we're trying to be gods instead. The technologies that we use and the cities that we build end up being corrupted all the time because we're not pointing them in the right direction. So the question becomes, who are we actually supposed to be serving? We're supposed to be serving God. If you build while serving God, if you build reasonably, within limits, while serving God, you can create beauty and holy things, you can create a great cathedral, you can create, you know, any number of you can create an icon, you can build a House that you can live in. That's modest. And then you, you can pray and eat and do the things you do in the house. But all the time we're endlessly being corrupted. The whole story of the Bible, the whole story of human history is humans effectively continuing to try and follow the path of the serpent laid down instead of the path of God. And when you use technology and civilization and your building techniques and our technological brilliance to serve the serpent rather than God, you end up with Babylon. So that seems to be what happens repeatedly. But I think you're right. It doesn't follow from that that everything is evil and that we have nothing to offer God and therefore we can't build anything. We have to build something. We're technological animals. We can't live without creating. If we didn't create, we'd be, we be dead meat when it snowed. So this isn't, this is, you know, we're not bears. We don't have savage teeth and furry coats. We have to do this. Our brilliance and our, and our, and our terrible, terrible nature as well, is in technology. So if you build technology to serve the serpent, which means that effectively we are trying to be as gods, because that's the offer, then you end up with AI, like you said. Right. And AI is us trying to create gods and effectively trying to turn ourselves, as the transhumanists want, into immortal beings who will live on other planets, colonize the universe, and effectively literally be gods. I mean, these people in Silicon Valley are quite happy just to say this openly. They're trying to make God. They talk about it all the time. So it seems to me that as you say, you've got these two points of light. You can serve God and you can try and walk your way back towards God, which is what a Christian life is supposed to be. We're looking for theosis, we're trying to become saints. I mean, I can't imagine that happening to me. But you know, anything, miracles can happen. This is what we're supposed to do. This is the story. We're supposed to walk towards sainthood and use our techniques and our abilities within limits and reason to do that. Or we can keep following the offer of the serpent, which is what we perpetually do. And I think that once you get to the stage, this would be my critique. I suppose once you get to the stage of having this giant, top heavy technological civilization, you're inevitably that the momentum is towards the serpent. That's what you end up with. It doesn't mean that within it we can't serve God and that we have nothing to offer and that we can't build Christian cultures within it, because we can. I think the monastic movements do that. I think Christian communities do that. It's individual Christians in the culture serving the poor can do that. We have to do that, actually. But I think that the machine, once it gets to this level, if you like, seems to be. Seems to be the serpent's doing."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":1656.63,"end":1841.15,"speaker":"Jonathan Pageau","text":"Yeah, that seems that there's almost like an inevitable thing that's moving towards that. You know, in the. In Revelation, it ultimately says that the beast kills the. You know, and that, to me, is that image of. In some ways, the machine basically clamping back down. It's like, oh, you know, and fun and strangely, I mean, it's funny because it actually, it's something that you can experience personally, too. It's like when you give yourself to your passions and to your sins, and then you think that this is freedom, all of a sudden you realize, no, it's like it's a monster that's enslaving you and that it's. There's no freedom there anymore. And so that image of the beast killing the whore is such a powerful. Such a powerful image. And in the image of the heavenly Jerusalem, you know, it seems like it's a rightly ordered in the way that you said, because in the center of the city is the garden. You know, you have the tree and the water of life that's in the middle with the Lamb and the Son of Man, which is the light that is shining on the city. But then on the edge of the city, you do have stones. And it's important to understand, for this biblical symbolism, what that is referring to the fact that they are carved stones that, like, you know, different. Different metals and stones. It's important to understand that it is technification. That's what it represents. That's why the Tower of Babel is made of stones. That's why, you know, the, The. The idols were made of gold. Like, all of these things are images of human making in their. In civilizational making. So you have this order where, because the garden is in the center, then the city becomes glorious like a jewel, right? It's shining with all this. This beauty. And so I think that gives me hope, you know, that it does mean that we. It doesn't mean. It means that the things we do can be offered to God. Now, I don't know, like you said, in some ways, some of those are not my problem. Like, there's some Things that I struggle to understand how they can be offered up. Like AI, for example. @ this moment, it's not easy to see how. How ultimately it's going to. To serve. And also the other thing I wanted to say is that that also seems to be true in a civilizational way. What I see in Christian. The best moments of Christian civilization is that the monk or the martyr who gives himself, sacrifices himself for Christ, who lives ever. He lives in a way that really reflects what Christ is saying. That ironically, that yields civilization like it yields families. Like, it's like when a lot of people say, well, if everybody lived the way Jesus says, then there would be no people, right? If we were all, like, living as monks up on the mountain and then all ascetics or whatever, the civilization would stop. But that's not what happens. There's a normal hierarchy that sets itself up where these characters become like beacons, and in their sacrifice, it Yields families with 10 kids and, you know, and this kind of abundance at the. At the bottom. But again, the mistake is to think that that's the. That. That we can weaponize that. Yeah. That we can make it happen."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":1841.39,"end":1996.58,"speaker":"Paul Kingsnorth","text":"I think that's the key. I think that's the key. So it seems to me that the root of Christian culture is Christians, right? Actual Christians who are not, not. Not probably people like me who say we're Christians and technically are, but people actually living like Christians. And as you say, there's this paradox again, there's that Christian Cohen again, right? This weird paradox where the first shall be last and the last shall be first. And God's wisdom is not the wisdom of the world. And Christ is always saying these things that make absolutely no sense at all in worldly terms. And you think, I can't live like that. What is he even talking about? And so did most of his followers, right? Obviously, they leave him before. Before the end, he only ends up with 12 people. After he's told them to drink his blood and eat his body, most of them say he's crazy. Off they go, because it makes no sense in the world's terms. And yet when these people do these things that make no sense in the world's terms, they end up building a culture almost by accident because. But if they'd set out to do that, it would have been a disaster if you'd set out to say, right, let's build a Christian civilization, everyone, and let's make it look like this. And. And we're going to have this technology and these tools and we're going to live this way. Christian civilization. There's a quote I used in the talk. It's from Hillary White, the liturgical artist, and she said, christian civilization is a secondary fruit of Christian mysticism. And I thought that was exactly what was going on. It's, you know, the desert fathers. St. Anthony creates the entire monastic movement by accident because he wants to try and live the way Christ told him to live. And so he gives everything away and goes off to live in a tomb, which is certifiable behavior. You know, if you did it today, they'd section you. But that leads to the Christian monastic movement. But not because he intended it to. Because he intended to try and follow Christ. So it's as if you actually make the sacrifice and live without intense humility. Things happen because God makes them happen. That's how it seems to me. Whereas if you try with your own will to create some kind of civilization with a cross painted on it, you end up with the opposite. Because the devil is the prince of this world, which is another thing that keeps popping up in the gospels all the time. You know, the devil says, this world has been given over to me. So all the worldly projects, if they're not. If they don't come from this kind of radical renunciation that Christ teaches, they end up being the devil's projects. That's how it seems. So the weird paradox is we have to give everything away, give everything up and try to live in this mendicant way, and then God gives us what we need to build a culture. That's how it seems. And as I say, then I just keep going around this. Going around in my head, because I'm not living like that. So I don't know what that means. But this is the challenge, it seems to me. That seems to be the way it works."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":1996.82,"end":2056.07,"speaker":"Laura Diaz","text":"Tucson the weight is over. Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan. Weekly check ins and a licensed physician guiding me every step of the way and the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi Weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2056.15,"end":2230.52,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com I think, I think you're absolutely right and we can find many examples in the Bible, but also in the tradition, like there's an interesting paradox even in the case of the life of St. Anthony, which is that we always have to remember that the person who wrote the Life of Saint Anthony is, is Saint Athanasius. Right? Saint Athanasius, who under the protection of Constantine, basically, you know, defended homoousios as the, as the orthodox position and the council that basically, you know, structured the way that Christians think today. So I'm not saying that it's Constantine that led the council and the fathers were really cautious about that because one of the things we don't realize is that at the very first council there was a chair, you know, if you know the story, there was a, there was a throne in absentia for Constantine because he didn't go to the council all the time. So there was like this throne in absentia for Constantine. And that really bothered some of the fathers. And so during the second council, they put the gospel on the throne and it was a way to say no, it's like it's actually Christ that's ruling over this council. So this tension, right, it was there in the sense and maybe that is in best, the best way to understand what it is, the best aspect of what Constantine did, for example, which is that he didn't, we hope that he didn't direct, he didn't direct the theological thought, but he was able to create a frame around it and protect those that were doing it, you know, so you can imagine that the good role of one of the roles of the king would be to protect the monastery, you know, because the monks don't protect themselves. And so it's like, oh, you guys sacrifice yourselves completely, live that way. And I'm going to be downstream from you and I'm going to, you know, if I can, I'll stop the pirates from coming to, from coming to kill you. And so it's like this weird. There's a, there's a story, my brother told me this story a long time ago. It's actually is related to Zen. It was this story of these two kung fu swords. And I forget the name of the sword, sorry for people watching, but that there were these two swords and like the greatest sword that was in the kung fu world was a sword that if you put the sword in water, all the pieces, twigs and pieces of like, of grass would avoid the sword. And so, like, you put the sword in water and then everything that's floating in the water would just go around it and avoid it. And the second most powerful sword was a sword that when you put it in the water, all the twigs would come and break against the sword. And so there's this, this idea that in some ways inaction yields action, but it has to be in the right order. Right. It's like there is room for kings that defend people, but they have to be rooted in. They have to be rooted in something true, something higher than them. Or else it just becomes identity, or else it just becomes power and just becomes, you know, whatever."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2231,"end":2402.6,"speaker":"Paul Kingsnorth","text":"Yeah, yeah. No, it's very true. I mean, there's this always, this tension right at the heart of Christianity and every other faith that I know of as well. It's always the same thing. What are you going to do about the world being full of violence? Because it is full of violence. How do you actually respond to that? And Christ tells you not to resist evil, and that's, you know, it's very difficult to understand how to live that. That's the greatest, for me, that's the greatest challenge. And yet you're right about that. I mean, it's. What do you do with the kings? The kings aren't going anywhere. So do you sacralize the kings or do you let the kings rampage around? And this is, you know, that's, that's always the paradox. But again, that, that still comes from that mysticism, doesn't it? Because the monastics get to the point and the church gets to the point where the king becomes interested in them. You know, it's a very interesting question to me. Why, why did Constantine want to become Christian? Why was he suddenly interested in this religion? What's going on there? It's offering him something through what it's doing. Yeah, because of the way that it's not because it's giving him power or there's something about these people and this faith that is attracting even the Roman emperor, you know, so because they've been Christians. And so it's like I said at the end of the. Tried to say at the end of the talk, it's like, if we want a Christian culture back because we haven't got one now, we just have to try and live like humble Christians and then it will happen in God's time. It's not that we, you know, some people reacting to the talk have said, well, Kingsnorth thinks we should just do nothing and let the world burn. That's a critique I get quite a lot, and I can understand it, but it's not the point. It's not. There's no option to do nothing. You know, we're all doing something here. We are doing a thing right now. There's no. The question is what you do. You know, building a monastery is doing something. Living in a Christian household is doing something. Writing a book is doing something. Running the symbolic world is doing something. We're all doing things. It's a question of what we're doing. And then if we just try to do them with that attempt to approach that Christian humility, then I think things happen from there. Things grow out from there. There. That's how Christian cultures get built. Because people are, at their best, people are attracted to Christians. At their worst, people are repelled by Christians. Right? But at their best, people are attracted to Christians. And we've come out of a period in our culture where people have become very repelled by Christians partly because of things the church has definitely actually done and partly because of the kind of. The whole campaign of modernity is against God and against the Christian church, which has been made a villain in. In any number of things. But for whatever reason, the church has been turned into a villain. And so what do you do about that? Well, you have to just. Again, the more corrupt and decadent and horrible the culture gets, the more actual Christians are going to be really attractive because they are. You know, if you ever meet a holy person, you're really drawn towards them. You can sense it and you want to go there and you want to be with that person and. And that's what changes the world. It seems to me that kind of holiness."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2403.92,"end":2537.89,"speaker":"Jonathan Pageau","text":"I agree. Another image that comes to me is the image of the seed that Christ uses himself. He makes it clear that in order for any fruit to grow, the origin of that is death. The seed has to die. If the seed does not die, then it doesn't produce fruit. And I think that that's some ways the image. It's like you can't fake that. You can't say, well, I just want the fruit. I don't want to die. Well, that's not going to happen. Jesus Says die. Like that's putting, you know, that's skin in the game. That's not, that's not something that you can do utility with. Utility, like just with utilitarian thinking, it actually is, has to be a real self sacrifice because you, you're aimed at the highest thing and then out of that the fruit will be communion and etc. Etc. That comes out of it. And you know, and I think that, and I think a lot of the people maybe that listened to the talk were afraid in some ways that you were, because we have radical Anabaptist types who will take what you say and push it very, very far, where they obviously don't like any type of structure. They think all structure is evil, that church buildings are evil in themselves. That kind of radical idea that even the, the building of beautiful, beautiful things is horrible just for all those reasons. But that's not what I hear from you. There's a story of Justinian, a beautiful story of Justinian where Justinian, when he built Hagia Sophia, he wanted to make the doors of the. I think it was the doors of either the church or of the Ikanostasis. He wanted to make them into pure gold. And the Patriarch of Constantinople said, he said, okay, you can make them out of pure gold, but if there's just one beggar left in Constantinople after you've done that, you'll have to, you'll have to have account for that. Like, you'll have to account for that. And so because of that, he didn't make them gold. I think he made them a lesser, like silver or something like a lesser metal. Because he, he. There was this tension, like, exactly the tension that you're saying. It's like, he's like, yes, it's okay to make a beautiful thing for God, but. And St. John Chrysostom has similar statements where he's like, give to the poor and then if there's gold left, make gold chandeliers."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2537.97,"end":2711.6,"speaker":"Paul Kingsnorth","text":"Well, this is it. Yeah, John Chrysostom is a great example of this. I mean, he was so incredibly radical in his preaching that he ended up being, you know, exiled and effectively condemned because he focused on the rich, including the empress, which turned out to be a bad idea. But he was, you know, he was being a Christian and he was a bishop and he was, you know, I'm an Orthodox Christian like you, so, you know, I'm, I'm not in a position to put that I want to start attacking institutions or buildings because if I did, I wouldn't be Orthodox. You need to live in that tension. But the buildings have to serve God. And as you say, it seems to be a pretty good deal that you're allowed to have a golden door when you've fed the poor, but not before, right? Because this is the point of the whole thing. When I was on Mount Athos a year or two ago, I visited Elder Pasios cell. I don't know if you've ever been there, but it's a tiny little house and it has two rooms in it. One room was his bedroom, and the other room was a tiny little church with a tiny little icon of stasis in. And you can go into this room now and see it. And, you know, you can go into glorious Orthodox cathedrals, and they're covered in these enormous icons, and they're very stunning. And Elder Pasios church is just a tiny little wooden thing. And the only two icons he's got are ones that he drew himself because he had a vision of Christ and he met Mary, the Theotokos. And he drew what they both looked like, and they almost looked like child's drawings. And then he just pinned them up on the wood. And that was one of the most beautiful churches I've ever seen. So there's a form of beauty that can be done very simply. It's not a question of, you know, we don't have to go to the extreme where either we're building gold churches everywhere or where all building is evil and we must do nothing. Again, it comes down to that question of. To me, same question we're asking with technology. Who does this serve? And what are my limits? And am I doing this ascetically in fear of God and in love of God after I've fed the poor? Or am I just effectively following the path of civilization? And it's like there's a very fine line there. And if you fall over that line, then suddenly your church isn't very different to the skyscraper and there's beggars sitting on the steps. And then, you know, Jesus is going to come and point out exactly what the problem there is, just as he did in the temple. So it's always that fine line. Like I said, I don't think you can live in this world without building. And there's. And you have to build to the glory of God. And because I'm Orthodox, and this is why I became Orthodox. One reason I think we need the church. We need the structures, we need the teaching, we need the tradition. Otherwise we get the kind of craziness of 10,000 Protestant sects a minute popping up in America because no one can agree on what the Bible means, you know, and so I believe in that. But it's like I think you need always the self correcting mechanism all the time. And that's what I think. The monastics often are at their best. You know, the monastics and the hermits and the, and the, and the, the poor Christians who are trying to live a simple life. Always they're correcting the emperor, the emperor needs them, otherwise. Otherwise he's just another emperor. Yeah, and there's always that. I don't know whether you can ever."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2711.76,"end":2771.24,"speaker":"Jonathan Pageau","text":"Yeah, it's funny because that's what you said is, that's exactly what I see. That's the role that I see that you're playing too. It's like when I saw the talk, I thought right away, I thought this is perfect. Like this is actually the right call that we need to remind ourselves why we're doing what we're doing or whatever it is we're doing to remember what it is and to be careful of the dangers. And you know that in some ways I'm far more in the world of cultural Christians that I found myself in that world. And I feel that, I feel the tension too. I'm always asking myself, and that's why I was attracted to what you said. I'm like, I'm always asking myself, okay, what is this serving? You know, and it's hard, by the way, and you probably have an similar experience. You know, you, you make these videos, you get attention, you get likes, you get, you know, you get people supporting what you're doing. And so it's like the man, the, the, the, the temptation is right there all the time. Constantly."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2771.47,"end":2771.79,"speaker":"Laura Diaz","text":"Yeah."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2771.79,"end":2773.55,"speaker":"Paul Kingsnorth","text":"Build your brand. Build your brand."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2773.87,"end":2814.54,"speaker":"Jonathan Pageau","text":"Exactly. Yeah. And so it's like you need, but it's like, it's like you need a banner, right? You need a symbolic world banner and so might as well make it beautiful. And then it's in wet. Like, does it. Yeah, it's a, it's a, it's definitely something that, that I struggle with. But it's also, I think it's very useful and very powerful that we're reminded of that constantly. Like just remember, remember, remember why you're doing what you're doing and remember your first love too. That's a good way of thinking about it, is that even though at the outset the things that sparked, some of the things we're doing might have been pure, doesn't mean that it remains that way all the time. Sometimes we can get kind of twisted and turned away."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2814.7,"end":2943.19,"speaker":"Paul Kingsnorth","text":"Okay. What's really interesting is how easy it is to make idols of things really easily. And it's really easy to make an idol of Jesus. It's really easy to make an idol of the church and. And to create a shape for them that happens to suit you. Just like it's really easy to create an idol for the culture. You know, there's a quote from Christopher Lasch I keep using in my writing where he says, God, not culture, is the only appropriate focus of your worship. And it's really, really easy. People are always getting attached to their cultures, which is completely normal, right? Of course we're attached to our cultures. We come from a place, we like that place. We don't want it to be destroyed. We have protective feelings towards it. This is normal, human stuff. But it's not Christ and it's not God. And if you start thinking that your culture is Christ just because it has some churches in it, the question is what the churches are doing or what you're doing. And as I say, this is me asking myself this question because I'm not actually in any legitimate position to stand up and hold the culture to account because I'm not a holy man. But somebody said something interesting to me after the talk, actually, which really stuck with me. They said, it's, aren't we lucky that the Gospels were written down just a few decades after Christ by people who knew him? Because if they hadn't been, you can bet your life that later Christians would have watered them down because they're so incredibly radical and challenging that we don't want to hear them. And I think there's something to that. It's like we've always got the Gospels to go back to when we need a kind of reality check on what we're actually supposed to be doing here. And then we go back and we say, ah, yeah, I'm off the mark again for the 50th time today. And, you know, that seems to be what we need to do all the time. And Elder Pasios, again, I quoted him in the talk. He said he was a radio operator in the Greek civil war, and he used this metaphor. He said, if you want to hear God and speak to God, you have to tune your radio dial to humility, because that's the frequency on which he always operates. And if we ask ourselves if we're actually doing that, then certainly for me, most of the time, 99% of the time, the answer is no. So that's what that's what. That's the dial in which we can kind of hear the frequency that's telling us where we're supposed to walk, I suppose."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2943.67,"end":2952.91,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And what you said, it's the Grand Inquisitor to some example. It's some extent. You know, it's like that problem that Jesus is so bothersome, you know, every."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2952.91,"end":2956.31,"speaker":"Paul Kingsnorth","text":"Time I read the gospel, put him in prison. It's the only sensible thing."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2956.47,"end":2957.83,"speaker":"Jonathan Pageau","text":"It's so annoying. Yeah."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2957.83,"end":2960.07,"speaker":"Paul Kingsnorth","text":"What is he doing here? He's ruining my Christianity."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":2961.03,"end":3019.74,"speaker":"Jonathan Pageau","text":"Exactly. And that's absolutely true. I think that, you know, you mentioned this scene in our discussion now, but they made a movie version of the Gospel of John recently. I don't know when it was. I was watching with my family. And, you know, there's that scene where he tells people that if you don't eat my flesh and drink my blood, then you can't enter the kingdom. And I never realized when I read the text that it was in public, that it wasn't like with his disciples, that it was like in front of everyone. And he just says that in front of the Pharisees and in front of all these people. And then you think, well, of course people ran away. Like, that is the craziest thing in the world to say. We have the luck of. We have the chance of retrospect, of, of seeing him resurrected, to be able to look back at some of the really wild, crazy things that he said. And it's only in that light that we can. That we can say, okay, well, I can't digest this, but I have to, because I'm convinced by the power of the, of the, of the resurrection, you know, but, yeah, it's, it's, it's. It's very difficult."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3020.54,"end":3030.94,"speaker":"Paul Kingsnorth","text":"This is, like I said, it's a. Cohen. I think, hopefully, hopefully after death we get to understand what was going on properly. You know, this is. Down here, we're still. We're chewing on it. We're chewing on it all the time and trying to dive."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3030.94,"end":3081.8,"speaker":"Jonathan Pageau","text":"I think that even in the story of Jesus, there is this image that of the. Of the seed and the fruit. And I think that the image of the cross and the heavenly Jerusalem is a good way of thinking about it. Or even in the image of the heavenly Jerusalem, you have the Lamb and the Son of Man. And so you have this image of the humility of the seed that is planted. And then you do have the image of Christ as a king. You know, you do have this image of Christ as a regal figure that is Ruling over the world justly because of him also being the sacrifice. And that's the reason, the reason why he can be our king and can rule over us with all the pageantry, all the imagery of civilization is because that, it's rooted in his kenosis at the outset."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3081.8,"end":3137.27,"speaker":"Paul Kingsnorth","text":"Yeah. So who is the king? The king is the barefoot carpenter who the authorities killed, who preached things that at the time seemed to many people to, to be completely mad, but were transformed, like you say, through the sacrifice, through the self sacrifice into what kingship actually is supposed to look like. You know, that's exactly it is that without the sacrifice, which is the same thing as the humility, I suppose, or at least the humility, the sacrifice. Without that, you haven't got anything. You've just got a, you've got a simulacrum of a thing called Christianity. You've got power. You've got power and you can paint your cross on, on power, but it's still power. It's the beast, it's the serpent, it's the prince of this world. It's not Christ. And we just have to be really careful not to confuse those two things. And we perpetually do it, and I do it as well. It's easy to do, but if we do it, it's like that's the trick. It's like the adversary is just standing there waiting for us to fall into that trap again. And we do, we keep falling into it. Yeah."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3137.27,"end":3222.8,"speaker":"Jonathan Pageau","text":"And we do it like you said, we do it at every single level. We do it as much on, in our own personal life as we do it's our, in our parishes or in our, in our societies, you know, and, and so what do you see? Let's say, you know, for example, like one of the things I, I, I do love and I care about is like the, is the celebration of, of our stories, for example. Like this is something that I've, I've kind of taken on, you know, and I think Martin Shaw is also can take on, is to kind of help people remind, you know, remind people of these stories. And there is in that way, like, I really do feel a sense of care for my story, like a care for my civilizational place. And, and I, and I have this sense that there's some importance in, I'm trying to, like, I'm trying to say I think we can see Christ in these, in these stories and that's the best way to look at them, you know, like the fairy tales and all that. But I'm curious of what you think about that, because, you know, let's say one of the things that even in, like this kind of remembering of the ancient stories of the wild Christians, of the, of the saints, there is this, like, we want to celebrate that which brought us where we are today. You know, we. That's part of, of how we hold together. And so how do you see that balanced out? Let's say, what's your approach to how to balance that with the danger of pride? Let's say."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3222.95,"end":3226.99,"speaker":"Paul Kingsnorth","text":"Say, are you talking about, like, the, the stories of the culture more broadly or specifically?"}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3226.99,"end":3233.39,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, the, for example, are the histories of our nations or, you know, even the stories of the saints are. Like, I'm doing."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3233.39,"end":3233.75,"speaker":"Paul Kingsnorth","text":"I'm."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3233.75,"end":3259.24,"speaker":"Jonathan Pageau","text":"I'm kind of revisiting the fairy tales, the foundation stories, all of these, all of these aspects. Like, we have this whole aspect of our podcast which we call universal history, where we are going back and trying to show the Christian, you know, root of Scandinavian culture, of, of English culture, of. Of all these different cultures to say, you know, like, there are ways in, in which this connects together. And so how do you. I'm just curious, like, I don't have a solution. I'm just asking."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3259.24,"end":3514.22,"speaker":"Paul Kingsnorth","text":"It's a really good question. So I've thinking, listening to that, I've got a couple of thoughts. So I'm probably as interested as you in that. I mean, I'm a history nerd and I have been all my life. And that's why I write weird historical novels. And, And I just, I'm fascinated why I wander around looking at holy wells and writing about them, you know, because I just. I just love the culture manifested in the landscape which we have so much of in Europe going back so long. It's just. It's a kind of embarrassment of riches. And I'm as. Since certainly since I became a Christian, I'm more and more interested in the Christian foundation of my country, which is England and the country I live in now, which is Ireland, and how that manifests in the landscape, how that built the people. So all of this is there, and I think it's there to be rediscovered. And I think especially the early Christian stories, which really interests me, especially here in Ireland, because I'm fascinated by the possibility that the first Christians in Ireland were actually from Egypt. I'm fascinated by this theory that the desert fathers effectively sent people up here, and there's plenty of evidence for this. And so the foundation of Irish Christianity, which then becomes British Christianity, actually is the desert Christianity of Egypt rather than the kind of civilized center. So obviously this appeals to me. You know, this floats my boat. But this is why this country is full of like caves that hermits used to live in and the rest of it. So I'm really fascinated by, by that. And it's why I keep writing about the saints and it's why I write about the holy wells. And it's not just because I'm just a history nerd and I find that interesting. It's because I think we've got something to learn from this. Because I think that this is my intuition and maybe it's wrong and people will disagree. But I have a feeling that the west itself needs to die. In fact, I think it may already have died. Actually. This thing we call the west is a sacrifice and is being sacrificed so that the plant can die, so the seeds can grow. Exactly as you were talking earlier, right? You don't get the growth without the sacrifice. And I think we've got to such a point where we have created a culture that is, is irreligious and Babylon like and top heavy and it's just fading away. And I don't mean that there should be a giant catastrophe or we should destroy it or anything like that. I just think that it's dying if it's not already gone. And we have to let that happen because it's not going to be stoppable at this point. And instead of doing that, instead of like fighting to protect X, Y and Z aspects of the superstructure, we can go back to the root of the culture and write about that instead and build that and protect that so it's not an all or nothing situation. We don't say, oh well, the west is in trouble. Let's let everything burn like the joker, you know, but at the same time we don't say, well, let's get out there and fight for our right to, I don't know, form transnational corporations and, and have economic growth forever and ever and mind the asteroids with Elon Musk, right? That's not anything to do with what we're talking about. Why don't we step back from that battle at the moment, which is going on anyway, and go back to our roots, which we'll find in those stories. You know, how did these. Let's, let's tell the stories of the saints. Let's tell the fairy tales are new. Let's go and write about how Christianity manifests in the landscape. And let's do that not with a plan in mind that this is going to build a civilization, but Just because we think it's the thing we need to do. And then it will, then things will happen. You know, stories. I'm with you. You know, you know what I think about this? Stories are the way that we navigate reality. And this was the really, actually, funnily enough, this is what I'm saying now is almost a Christian version of what we did at the Dark mountain project about 15 years ago. And I certainly wasn't a Christian at the time, but that was a project which said, look, this whole modern machine is creaking and crashing, and instead of fighting over it, let's go back to the roots and examine where the stuff stories went wrong and tell some of the correct stories instead. Because I think the root of a civilization that's gone wrong is a story that's gone wrong. And so let's tell the right ones. And you're right, then that, that actually becomes to me a really exciting thing to do. You know, it's not doom laden. It's not a culture war. It's not about anger or giving up or anything. It's like, yeah, let's, let's go back to the desert in a way, in a good way and see what happens if we do that. And let's tell the stories and let's dig out these old stories that no one knows about of what our ancestors did. Not so that we can copy them exactly, but just so that we can listen to them and be inspired by them and they'll act on us. So I think that's the. I think that's the way or a way forward that is exciting for storytellers especially."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3515.58,"end":3605.74,"speaker":"Jonathan Pageau","text":"Yeah, man. I think, I think I felt this, I felt this, this problem so many times, you know, in terms of, even in terms of my own engagements, you know, I would worked in Africa for seven years, you know, and working with artisans, and it was wonderful. But there were definitely moments because I was helping the artisans to, you know, to sell their, their things and maybe, you know, to connect to Western markets. And there was always this ambiguity even in my soul, you know. And you see it, you see it manifested, for example, like, this is going to be controversial for some people. It's like between North Korea and South Korea, it's like these two places. And then it's like North Korea is this horrible, horrible place, you know, that is just, you know, extremely tyrannical and controlling and everything. And it's like, you know, we should free them. And then it's like free them so that they become like South Korea so that they Become a place where no one's having children, where everything is falling apart, where, you know, people are, Are living in despair and, and in, and in complete, you know, pornification of culture. It's like, is that, is that what we want to replace? Is that Western culture? Like, is Western culture Disney and porn? And if that's it, no, thank you. No, no, thank you indeed. And so it's. Yeah, it's definitely something that, that, yeah, that grates at me even in my own engagement sometimes when I'm thinking what you're saying, like, do I want everybody, do I want to bring what is modern Western culture to, you know, to the rest of the world? And the answer is no."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3605.98,"end":3657.92,"speaker":"Paul Kingsnorth","text":"And I, you know, my, my feeling for a long time has been that this thing that we called the west is an idol at this point. And it's also, not only does it, you know, as you say, it's brought plenty of material benefits, but it's also hugely, culturally damaging to lots of other parts of the world which have been crushed by it, but also to the cult, to the people that we were before this modern thing appeared called the Western, squatted on our cultures and sucked all of the sacredness out of our cultures and the locality and, and the distinctiveness. And we've confused this, this kind of modern, hyper consumerist industrial beast that we call the west with an actual culture. It's not a culture. It's like a giant. It's the machine, as I call it. But the machine is parasitical upon actual culture, whether it's here or elsewhere. So we ought to be on the side of culture that is serving God and serving Christ, rather than this kind of anti culture which serves the machine, which we sometimes confuse for, for the real thing."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3658.24,"end":3703.16,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that. No, I think that that's the, that's the right way to think about it. And so listen, Paul, I would say I think this is a good place to, to, to stop. Thank you. Thanks for taking your time to do this. You know, I think it was used, like I said, I was really touched by the talk and it was, it was good to work it out with you and to kind of get a sense of your, of your position. I, I really appreciate what you're doing and I think a lot of people do. A lot of people really appreciate what you're doing in. And I need to keep you humble, but I'll still flatter you anyways because I think it's important that you understand that you have an important place in this big discussion that's happening. And people that you might not know, that you might not think are paying attention to. I think they are. So keep doing what you're doing."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3703.16,"end":3709.16,"speaker":"Paul Kingsnorth","text":"That's an intimidating thought. Thank you. Thank you very much. I'll now go and do a lot of prostrations to restore my humility."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3709.16,"end":3710.56,"speaker":"Jonathan Pageau","text":"There you go. That's all I wanted."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3710.56,"end":3710.93,"speaker":"Paul Kingsnorth","text":"I just want."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3711.08,"end":3711.92,"speaker":"Jonathan Pageau","text":"Wanted actually to just."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3711.92,"end":3713.48,"speaker":"Paul Kingsnorth","text":"I need to do a sucker later."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3713.8,"end":3715.72,"speaker":"Jonathan Pageau","text":"You have to go to confession like I was."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3717.56,"end":3719.32,"speaker":"Paul Kingsnorth","text":"Lots of confession in the next week."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3719.4,"end":3719.96,"speaker":"Jonathan Pageau","text":"Pride."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3720.12,"end":3725,"speaker":"Paul Kingsnorth","text":"Pride. Thank you. No, it's been really good. I really appreciate the invitation. As ever. Always great to talk."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3725.24,"end":3740.22,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #375 - 2025-02-07 - Paul Kingsnorth - Western Civilization Is Already Dead","start":3740.86,"end":3801.9,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
