{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":0.24,"end":53.47,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am here with Father Andrew Damick, who doesn't need much of an introduction, but for those who don't know, he is head of Ancient Faith Publishing Content, and he just published a new book called Arise O the Gospel of Christ, Defeat of Demons, Sins and Death. And I just finished the book. It's a very interesting and succinct introduction to all the amazing stuff that he's been talking about with Father Stephen on the Lord of Spirits podcast and just kind of introducing people to a. A more cosmic and a more story version of the salvation that Christ brings. And so I'm really happy to be able to talk about that with him right now. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":63.61,"end":67.21,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much for having me on, Jonathan. It's always a joy to be with you."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":68.17,"end":72.49,"speaker":"Jonathan Pageau","text":"So tell us a little bit about the kind of the impetus for writing this new book of yours."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":72.65,"end":165.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. So most of my writing comes from a sense of frustration, actually, which I don't know if that's the best way to do it, but it's what I've got. And my frustration in this particular case was that I wanted a book that summarized the Gospel from a truly orthodox Christian point of view that I could use for evangelistic and catechetical purposes and just trying to relate what the orthodox Christian faith is to people, for whatever reason they might be interested in it. And as far as I know, at least in English, there isn't such a book that does that. And so I had the idea of particularly framing it in terms of a lot of the things that we talk about in the Lord of the Spirits podcast, because not just to kind of promote the podcast or whatever, but because that's what I actually believe the gospel is about. Right. And so, you know, the basic frame is that there is a cosmic war on and we are caught up in the midst of it. We're kind of in the crossfire. And the gospel is what happens to us really in response to that war. It's what God does in the midst of that war that has something to do with us as human beings. And so that's the genesis behind the book. I'm very, very interested in an evangelistic work and in, you know, education, so forth. And so I'm always looking for new ways to convey this kind of thing to people."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":165.48,"end":210.49,"speaker":"Jonathan Pageau","text":"Yeah. One of the great parts of the book, let's say, especially in, let's say, Protestant, Catholic, North America, especially kind of Protestant culture in North America, this idea that the Gospel is, you know, this how you're going to be saved. Basically, it's framed as what the individual. It's a framed as kind of the, let's say, the advantage to the individual and how you're going to go to heaven. And you need to believe these things and kind of have faith in a broad sense in this atonement, this kind of substitutionary version of Christ's sacrifice. And that way you go to heaven, but you present something which is far more cosmic and is more about the gospel being this proclamation of what's happening, this is what's happening in the cosmos. Now, how are you going to participate in this transformation?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":211.17,"end":415.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. I was raised as the son of Evangelical Protestant missionaries. And so what is the gospel? How do you communicate the gospel? That was on my mind from a very, very early age. And one of the things that I found is the way that most people in the English speaking world think of what the gospel is, is they think it's about what Christ can do for them. Right. And I mean, I could express that in very cynical terms like, you know, how can Jesus make my life better? Or much better terms like, okay, the gospel, how you are saved from hell, how you are saved from sin and death. While it's true that the gospel is related to those things, if we put it in those terms, that it's essentially about something that fixes a problem in my life, let's say, if that's what I understand the gospel is, then that means that communicating the gospel to people is essentially a kind of sales pitch, right? Because if someone's selling something to you, they come to you and say, okay, you have a problem or you have a lack in your life, there's a problem that you need to be fixed. And I have the answer. I'm here to give this to you. So again, looking at it, not cynically saying, well, I'm here to give you the answer for free. You just have to get on board with whatever version of get on board that means. But looking at it cynically, it comes across as a kind of sales pitch. And a lot of times, especially people who are not believers in Christianity, they experience it that way and they take it very cynically, like, well, you just want me to join your thing so you can get money out of me, or you just want me to join your thing because you want to. Just it's affirming for you of how many converts you can make or that kind of thing. And that's the problem with understanding the gospel as being how I get saved, because then it's Completely about what is the problem of the person in front of me. How can I sort of sell them my solution? I mean, I might really believe in it and not be profiting from it in any way, but still, it's essentially a kind of sales pitch. You have a problem, I have the solution. Whereas the gospel as it's expressed in the Bible is not that there is no point in which any apostle ever comes up to someone says, let me tell you about what Jesus can do for your life. Like, there's no point at which they say, look, you have a problem and I have the solution to your problem. That never happens in Scripture. Right. What happens is when the gospel begins being preached, they pick this word for it. Evangelion is the Greek word, Right. Which most of the time, you see that word explicated by people that say it means good news. And that is literally what the word means if you pull it apart etymologically good and news. Right. But in the ancient world, that's not how the word was used. The word was actually used in the ancient world to refer to something that was about to happen, the announcement of something that was happening and that really you didn't have much choice about, actually, it was something that was about to happen to you, in fact. Right. And I'll explain why I'm not a Calvinist in just a second."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":415.65,"end":442.03,"speaker":"Jonathan Pageau","text":"But it was about that, like the idea of a victory of an emperor. The victory emperor is coming. Everybody be ready. It is, in a way, for them, the way they were presented was it's good news. It's like, you know, Caesar has vanquished our foes. You know, now we will have these riches, we'll have this. And he's accumulated glory for Rome. And so there's this kind of sense of this vanquishing of foes and this kind of heroic gesture, let's say."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":442.03,"end":513.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the Evangelia, they usually expressed in plural, was when a herald would ride into the city and he would open up his scroll or whatever and say three things. This is the Lord whom I serve. Let's say he serves Caesar, Augustus, whoever. This is who he is. Maybe listing off all his amazing titles, this is what he's accomplished, listing off all of his victories in battle. And he's bringing this along with him. And now this is what he expects of all of you. He's coming to take over the city. And so you can either get on board with his rule or you can be put outside the rule, which in the Roman world largely meant that you were going to be slaughtered. You know, the idea of moving somewhere else to find a new government just was not a thing. Yeah, right. And so when, you know, when the apostles choose this word Evangelion, saying, by the way, this is the gospel, they are saying the same thing. They are identifying who their Lord is, Jesus Christ. They're saying what he's done, he's defeated his enemies and they're saying what he expects of you, you know, if to be part of his kingdom, part of his rule. Right. And so that's what the gospel is. It's actually a declaration of victory. It can help you really understand an offer."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":514.07,"end":545.98,"speaker":"Jonathan Pageau","text":"No, exactly. It can help you understand a lot, even of the way that the Orthodox represent, for example, the crucifixion. We always have Nika in the crucifixion in the sense that there is this, in the story of Christ, there is this almost kind of incomprehensible joining of opposites in which his death vanquishes death, in which, you know, his humiliation turns into glory. But it is nonetheless participating in the most surprising way in this idea of the king who takes his throne, of the emperor who vanquishes not just his enemies, but basically the enemy of all, which is death itself."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":546.46,"end":622.78,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. You know, there's a lot of people who have heard of this model, they call it Christus Victor. Right. The idea that Christ is victorious and which is good. Right. But sometimes the circle is not extended out very far. It's only extended into Christ is victorious over the problems of my life. Right. So I mean that, that is true, but it's really a narrow, narrow understanding. We have to understand that like I said, there was a war. You know, if it's, if it's an announcement of victory over enemies, then you have to know who those enemies are. And people in the ancient world who were living in under idolatry, they had an actual day to day experience of interacting with demonic beings and in many cases relying on them or thinking they can rely on them. Right. So. So it, it's a victory not just over sort of metaphysical problems or a victory over the problems of my life. It's a victory over actual spiritual enemies who are being defeated. Actual fallen angels and actual demonized human souls who have participated with those fallen angels. Right. So. So we're being rescued not just from a kind of internal problem, we're actually being rescued. Rescued from the domination of dark powers. Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":622.78,"end":670.99,"speaker":"Jonathan Pageau","text":"And I mean, there is an analogy between the two that is it like what we're saying? It doesn't Mean that Christ won't. If you participate in his life, you participate in the sacraments. If you live the life that Christ directed for us like that, you won't solve your problems. You will solve your problems, but that's not the limit of what Christ does. Right. The connection between these principalities which have been ruling over the world, which have kind of led the world into degeneracy and into violence, into all these. These kind of dark places, that these are real and that Christ defeated them both in you. That is the passion that has a cosmic version in these demons, but then also in the world. We've yet to see it fully realized, but we have these burgeoning images of that in the saints, in the communion of saints, and in the communion that we all participate in the Church itself."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":671.15,"end":800.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. There's a macro and a micro level to all of this. And the reason why that's important, right. Is not just so that we have the big picture. It actually affects the way people live their lives, that they understand that they're part of something bigger. You know, I'll just give you a really good example, a very small example, but one that actually affects people all the time. So as a priest, you know, I hear confessions, and a lot of times people talk about the. The evil thoughts that they have, and sometimes where they act on those evil thoughts. I mean, this is an experience we all have. Yeah, right. And most of the time they will say something like, I don't know what's wrong with me, or I can't make those thoughts go away. Right. Or something like that, you know, is, am I just not really a Christian? Or, you know, something like that. Right. So there's this sense of a closed system that they're experiencing. And they, you know, because for their. From their point of view, Christianity is about fixing what's going on in that closed system. But if you understand that Christ's defeat of demons, his defeat of cosmic enemies of God. Right. That, that, you know, mediates all way down to us on our individual level, then you'll begin to understand that evil thoughts actually come from outside. And so the fact that you keep having an evil thought doesn't mean that you have a fatal flaw. It means that the enemy continues to attack you. Right. That the enemies of God are not me or people doing bad things in the world. The enemies of God are actual spiritual beings. Right. And so it, you know, if we reduce the Gospel to how can God solve my problem? Even understood in the best possible way, then the temptation to despair is Very easy, right? And, you know, it's interesting if you read especially the writings of some of the modern holy elders of the Orthodox Church, they talk about demons all the time. All the time. You know, it's constant because they understand very clearly that the intrusive, evil thoughts that we have are temptations coming from outside, right? And the fact that we keep having them doesn't mean I'm, you know, a spiritual loser, right. It just means that the enemy continues to shoot his darts at me."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":800.24,"end":830.15,"speaker":"Jonathan Pageau","text":"Yeah, well, you read the story of saints who, you know, after 30 years of fasting and doing all, they're still struggling. They sell these thoughts that kind of intrude on them. And sometimes, like you said, it's true that even when I read those texts, I am tempted to despair because I'm thinking, okay, man, this, like, I'm not even, you know, like a tenth on the road of this amazing ascetic. But. But it's like it seems like this, that this problem is something that is. That is going to kind of follow us, you know, until we're fully glorified. Let's say it's true."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":830.15,"end":896.31,"speaker":"Fr Andrew Stephen Damick","text":"I mean, like, there's that beautiful, amazing icon of St. Anthony in the desert being attacked by demons, like physically attacked by demons. And here's a man who is super advanced spiritually, right? And yet he's experiencing these attacks. And I'm sure he didn't say. Unless some demon whispered this idea to him. He didn't say to himself, I guess I just have a fatal fl. You know. Right. You know, and, you know, part. So part of what the book does is it sets up the battlefield. Like, why is it that this. We are having this experience of demonic attack? You know, it's because of the sort of the three problems of mankind that mankind experiences, right? So the introduction initially of death, right, which that comes through the influence of a demon talking to Eve. And then Adam gets on board with that, and then the introduction of sin, which comes as a result of demonic attack on Cain because death kind of opened the door for sin to be released into the world as this evil influence. And then. And then eventually, especially after the Tower of Babel, you get the domination of the nations kind of by direct rule of demons, right? And so, yeah, this is something which."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":896.31,"end":991.07,"speaker":"Jonathan Pageau","text":"People don't know a lot about because it doesn't say that in the story of the Tower of Babel, says it later. I think it's in Deuteronomy, where the idea that God set upon the world these angels that we're supposed to manage that we're kind of. That we're these principalities that are supposed to manage the world. It also helps us in our. Like both you and I, we, we have this argument against monotheism in the silly sense, like in the simplistic sense, like there's just God, no God function through all these principalities and intelligences that come all the way down to us. But that at the Tower of Babel, these principalities were set upon the world and then they started to accept worship. And so there's a fragmentation. And the fragmentation that we see almost in the story of the Tower of Babel seems to reflect that fragmentation itself, where people started to just worship their own thing or have their incomprehensible language that was self contained. And so they worship these demons. And so this version, the book really does take you on the cosmic story. Very kind of nice and tight version of this cosmic story of the fall, of the relationship between these cosmic intelligences and the individual, how we move all the way into Christ. That's kind of solving the puzzle. And so like I said at the beginning, it's for people that like a lot of people, when I tell them go into Lord of Spirits, they look at the amount of podcasts and like the three hour podcast one after the other and they think, oh my. And even Father Steven's book, Religion of the Apostle, which is great, but it's a little like for some people it might be a little much to chew on at the outset. So your book really is a very nice, tight narrative version of this whole kind of cosmic story."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":991.47,"end":995.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Like one of the things that some people have said. So I've copy of it right here."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":995.01,"end":995.53,"speaker":"Jonathan Pageau","text":"There you go."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":995.69,"end":1094.01,"speaker":"Fr Andrew Stephen Damick","text":"Some people have said they're like, this book is really small. Yes. And it's, I think it's about like 26 or 7,000 words total. But that's actually super deliberate because it's focused specifically on what is the gospel. And you know, it starts out by saying like, what's not the gospel? Right. So it's not the offer, it's not a sales pitch. Now people do have a choice to get on board when Caesar rides into town. You can either get on board with Caesar or you can resist him and then suffer the consequences of that. Right. So you do have a choice. Again, I'm not a Calvinist, but then I explain also, like, why what's the need for a gospel? Right. So I talked about, you know, the. These three problems of mankind that all have to do with demons, death, sin, and direct domination by demons. And then I flip, I show. I flip it then and show. Okay, so here's the announcement. Here's who Christ is. Here's what he accomplished, which he fixed those three problems in essentially the reverse order. So he begins by. He releases us from domination by demons by exorcism. He releases us from slavery to sin by forgiveness, and then he destroys the power of death by resurrecting. And then having shown what the announcement to the gospel is, then I ask the question, well, how do you respond? Right. So you see this in the Bible all the time. Someone, an apostle preaches the gospel to someone, and then they say, what must I do to be saved? They don't say, oh, you just told me what I have to do to be saved. Now, what must I do to be saved? Right. Because if the gospel was what must I do to be saved? Then why would they say that?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1094.01,"end":1095.57,"speaker":"Jonathan Pageau","text":"Yeah. Or they ask that. Exactly."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1095.73,"end":1102.29,"speaker":"Fr Andrew Stephen Damick","text":"It's the announcement, oh, wait, someone's coming. He's coming to judge the living and the dead. What do I have to do to get on board with this?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1102.29,"end":1102.77,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1103.16,"end":1128.2,"speaker":"Fr Andrew Stephen Damick","text":"And then. And then, you know, very succinctly, I also then talk about what happens when you do get on board with it. You know, how is. How does this actually change you and your. Your destiny? And. And what does that have to do with. So if demons are connected with all of our problems, then actually angels are connected with all the solutions. Yeah, as a matter of fact. And we then become like them. Right?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1128.2,"end":1191,"speaker":"Jonathan Pageau","text":"Yeah, that's something which I think. I think you really illuminated for so many people, the idea that in understanding the divine council, in understanding God sitting in his divine council, as, you know, all these managing principalities that kind of sit over the cosmos with God as their king, or God as the infinite source of these smaller powers, then all of a sudden, the idea of becoming like gods or becoming like angels is not just a little metaphor that we can kind of understand as becoming more spiritual or something like that, but it is really this idea of this possibility of human beings becoming real principalities in the world and becoming managers and pillars by which reality actually shows itself. And little examples of that, of course, are in the idea of patron saints for different aspects of reality, but also patrons of places and patrons of churches, patrons of communities, as this little seed or this burgeoning image of how we will ultimately reign with Christ and become like angels."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1191.24,"end":1354.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. You know, most orthodox people and a lot of other people who have studied early Christianity, they probably know this Phrase from Saint Athanasius the Great on the Incarnation, where he says, and you could translate this several different ways, but God became human, that man might become divine. Or sometimes God became man, that man might become God with a small G or a big G, depending. Although in ancient Greek, you don't have. It's just all big theta. Actually, it's a big theta. It's not a G, you know. But what's interesting. So then a lot of people see that, like, okay, wow. So, you know, through the incarnation of Christ, if we participate in that, we can become like God. We become divine in some sense. Right. What's really fascinating is Saint Athanasius actually puts all of this in the framework of adoption. Adoption as sons, Right. And again, a lot of times people, then they'll see that and say, oh, we're the children of God. But you actually have to plug in that phrase sons of God into an existing framework in Scripture, right? Which. That phrase sons of God actually refers to a very high rank of angels. So, you know, Christ himself mentions this in Luke 20:36, which, when I was an evangelical, I don't think I ever heard a sermon about this verse. But Christ says that the sons of the resurrection become sons of God and equal to the angels. Go look it up yourself. It's Luke 20:36. So he says that those who are in Christ, those who are who rise in Christ and rise to life everlasting, they are sons of God. Again, that's a rank of angels. And he says to kind of bear down on the idea equal to the angels, which means that this process of theosis is very intimately connected with our angelology right now. We don't take on angel nature. We can't do that. We remain human, but we become equal to the angels. Which means that we. Then we begin to do their works, because their works are to do the works of God. And so if we do the works of God, then we are functioning the way that the angels do. And as you said, you know, we see this in. In the idea of patron saints who. They function exactly like angels. I mean, look at what saints do in the history of the church. They do all the things that angels do in Scripture. They appear to people, they take care of people. They. They hear their pleas. And with God's power, not their own, with God's power, they. They. They help them. You know, they. They protect them. They. Against evil spiritual beings. They guide people into knowledge of God. Like all of these things are angelic functions. They bear messages from God. These are all Things that the saints do. So they are becoming the sons of God."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1356.81,"end":1398.15,"speaker":"Jonathan Pageau","text":"And this kind of narrative, more cosmological version of the transformation of the person in no way has to stand in competition or go against the more mystical transformation that we see in the philokalia. And the notion of this kind of transformation, transformation of the person, you know, being free from the sins, you know, becoming more in the image of God in a. In a. In a. In a proper sense that is really being transformed as a being into light, into, you know, being united with this uncreated light that. This kind of more mystical vision, which in some way has been more popular maybe in the. In the 19th, 20th century because of. Just because we're materialists and we struggle with the more mythological image of that."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1398.15,"end":1398.35,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1398.35,"end":1426.51,"speaker":"Jonathan Pageau","text":"No, we need those two versions of it. One which is almost like a more technical or more theological description of the transformation of the person, and the other one which is more of this kind of participation in a cosmic story which is there in scripture the whole time and moves into the eschaton and the images of the Last Judgment and all these wonderful images that we see in the iconography that this is part of what this transformation reveals to us, let's say."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1426.51,"end":1464.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Those visions are completely integrated within orthodox tradition and in the Scriptures. The reason why we tend to disintegrate them is because of individualism, because of modernism and individualism. So theosis becomes about my journey in Christ, which is. It's not wrong, but it's super incomplete and actually can distort what we're doing. And this is everywhere. For instance, in orthodox hypnography, there's one hymn that I heard for years and years which talked about Christ going after the lost sheep and then adding it to the heavenly hosts."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1464.18,"end":1464.62,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1464.62,"end":1484.66,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Like, literally, it says that he goes after the lost sheep and then makes it one of the, you know, part of the angelic hosts. And I heard that. That hymn for years, and I. I just let it kind of fly by. And until I really realized, like, wait, this is what Sons of God means? That we become part of the hosts of heaven Then now. I mean, this stuff is now popping everywhere."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1485.7,"end":1489.5,"speaker":"Jonathan Pageau","text":"All of a sudden, the lights, little dots of light are starting to connect into a pattern."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1489.89,"end":1509.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And honestly, it's very inspiring and exciting. It's not just, okay, I'm on this sort of solitary journey to greatness, but rather, I'm By God's grace, I'm headed deeper and deeper into this vast host of divine beings."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1510.85,"end":1545.3,"speaker":"Jonathan Pageau","text":"And theologically, we understand it more easily in the sense that as we kind of rise towards God, our prayers and our love of others is. Is kind of bringing others into God with us. We kind of understand it when we say it abstractly, but when we really understand it cosmologically, then it actually appears, like you said, as patron saints who appear to people who do miracles. So it's not just like an abstract thing. It's something which actually, let's say, binds communities together with visions and transformations and miracles and all this stuff at the same time."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1545.61,"end":1595.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There are so many kind of apologetical problems that we create by accepting individualism. You know, if we could set that aside and recover this cosmic sort of mythic understanding of what's going on in Scripture, then all of these things kind of fall into place much more easily. Like, if you understand who the sons of God are, then you kind of don't really need to give an apologetic for the intercession of the saints because it's already there. Or, like, someone would say, well, why do you have saints? I see angels. Like, well, actually, the angels are the original saints. The word is being used for them in Scripture, the holy ones of God. Saints and holy ones are literally just different English expressions from two different parts of our inheritance that mean exactly the same thing, that angels are the original saints. So we're just saying that people are being added into that."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1595.4,"end":1641.45,"speaker":"Jonathan Pageau","text":"And it's such a beautiful image of this movement, you know, into the Fall and then into the New Jerusalem, for example, as this glorification in Christ of man. All of this, it just makes so much sense once you see the grand story of Scripture, that this will be part of the transformation. And so I wanted to, as we're talking about this kind of mythical understanding of Christianity, something we're both very excited about, I wanted to ask you a little bit about something else that you're working on. I know maybe some people don't know that. That Father Andrew is actually now in Universe, despite all the crazy things that he's doing, all the podcasts, all the books, managing ancient faith content, he's also back in school studying. I think it's. Is it Anglo Saxon, Northern mythology? Exactly. What are you studying?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1641.53,"end":1703.25,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so I'm studying at Signum University, which is a fully online master's degree program, and the degree is language and literature, and I have two concentrations within that. So on the one hand, there's a concentration that's called classical literature or something like that, but I'm basically steering it towards mythology. Right. And then the other Concentration is Tolkien Studies. And the cool thing is there's a lot of overlap between those two. And. Right. So I'm taking one class a semester, so that's three classes a year. The first class I took was called Tolkien and Tradition, and it's literally these two things together, looking at mythological sources alongside what Tolkien did with some of them. And then the second class I took was Introduction to Old English. So just straight, you know, learning a language and translating and stuff. And now I'm doing Beowulf in Old English. And so we're translating about 300 lines of Beowulf a week, which is super labor intensive. I mean, it's a little crazy."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1703.33,"end":1703.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1704.53,"end":1768.43,"speaker":"Fr Andrew Stephen Damick","text":"But it's. You know, Beowulf is interesting because I think a lot of times, especially before Tolkien started getting hold of it and really talking about it publicly in the middle of the 20th century, a lot of people looked at Beowulf as just being sort of a monster story, you know, like. And, well, you know, amongst our various pieces of mythology, this is not really the best of them. You know, Beowulf doesn't go on to found some great civilization or something like this. Tolkien complains about this in an essay that he wrote called Beowulf the Monsters and the Critics. But Beowulf is indeed a monster story. But the whole point of it, actually is this. This collision between a Christian world and a world that, frankly, is about monsters and dealing with monsters. So, like, Beowulf is this sort of demonic giant, ish being who lives in a kind of grotto underneath a lake in the mountains in this sort of bog area. Right. And he has this. He hates the festivity and the."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1768.59,"end":1773.11,"speaker":"Jonathan Pageau","text":"You mean Grendel? I was like, you're not Beowulf himself, let's say Grendel, right?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1773.11,"end":1774.35,"speaker":"Fr Andrew Stephen Damick","text":"Grendel, yeah. Did I say Beowulf?"}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1774.35,"end":1777.79,"speaker":"Jonathan Pageau","text":"You said it's fine. I just don't want to confuse you. I kind of got you. That's what you're saying."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1777.79,"end":1879.12,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, Grendel is the monster. Yeah. Beowulf is the hero who fades. But, you know, and it's interesting. Like, just to give you. Interesting to me, one of the interesting things about Beowulf is it's set within a Christianity that understands this mythic view of the world, and there isn't another one to even compare it to. Like, this is simply the world they live in, to give you one little example. So Beowulf kills Grendel first by ripping his arm off, and then Grendel runs away and dies down in his cave. But then his mother comes and begins to do the same evil to the high hall that her son had been doing as kind of her revenge for him. So Beowulf has to go down and deal with the mother as well. When he goes down there, he finds all these weapons down in the cave. And it doesn't say this in there, but again, this is a kind of bog monster. So there is this suggestion, if you know something about bog sacrifices, that perhaps these are things that had been shoved down in there by pagans who were making offerings to these demonic beings. Now, this is not written in the poem, but that is part of what this world includes. So Beowulf finds all these weapons down there, gets this sword, this mighty sword, and he uses it to slay Grendel's mother. And then he, while he's at it, he decides to cut the head off of Grendel, who's already dead. And then the blade melts away because of the sort of the toxicity of the blood of these monsters. But then on the hilt, there's some kind of depiction or writing there about the giants and their war with God and about how God sent a flood to deal with the giants."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1879.36,"end":1879.72,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1879.72,"end":1896.37,"speaker":"Fr Andrew Stephen Damick","text":"So like this conflict, the gigantomachy, right. The war against giants is embedded into the story with this short little reference that everyone who listens to the poem in the 8th century is gonna know. Yeah, right. This is there. And there's stuff like this all throughout."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1896.45,"end":1929.47,"speaker":"Jonathan Pageau","text":"Yeah. I think Grendel, he's even suggested, or it's presented that Grendel is a kind of descendant of Cain. I remember reading scholars talking about Beowulf saying how all of this was just a kind of cheap add on to the story. These Christian references were just kind of added on to make it acceptable to Christian audience. But I think it's those sch that didn't understand just how integrated this vision of the world, these idea of the monstrous races and the giants and how that's actually really part of the Christian story from the beginning."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":1929.71,"end":2023.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. You know, you've been doing, you've had some videos with Richard Roland talking about this question of universal history. And the truth is that pretty much every ancient mythology has a number of elements to it that they all share. Right. So like a great example is almost all of them have some kind of flood story. And a lot of people know that. Oh, like there's all, you know, maybe there was some kind of big flood, you know, and so they all talk about this, but a lot of people don't realize is that connected with the flood story is usually also a story of gigantomachy, a war against giants. It's. It's in almost every mythology that's out there. Right. You know, even. Not just European ones, either. You get it. You know, even in Native American stuff, there's giants, and then a flood comes and wipes out the giants. Right? This happens over and over again, you know, in Norse mythology, when Odin and his brothers decide to kill the big sort of primordial giant, Ymir, his toe begins bleeding and the blood floods the entire Earth and kills mostly giants. You know, like, this is everywhere. Or, you know, in the Epic of Gilgamesh, you know, Enkidu is basically like Noah. I mean, there's a Noah figure in the Norse story too, although weirdly, Noah is a giant in the Norse version. And, you know, like, this kind of thing is everywhere. And so, like, the reason that I'm studying mythology, occasionally I get people asking me, like, why are you studying all this pagan literature? You know, why would you want to read that? Right? And number one, people should understand actually that most pagan literature that we have did not come directly from pagans. Almost all of it came through Christian scribes."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2023.97,"end":2024.85,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2025.01,"end":2186.09,"speaker":"Fr Andrew Stephen Damick","text":"Who preserved it and copied it. I mean, you know, making books before the advent of printing was a super slow and expensive process. And Christians for centuries upon centuries decided to spend a lot of their resources on retaining pagan literature. Right. And it's not because they were syncretists. It's because they saw this literature as representing something true about their world that they were part of now. You know, they weren't saying, you know, you should just simply accept everything that's in here and, like, go ahead and worship these gods and, you know, whatever. They're not saying that, but rather like, so St. Basil the Great actually has this text called. It's usually called something like an address on the uses of Greek literature to young men or something like that. So he's talking about education, and he actually says the crazy wild thing that you should read and master Homer before you ever read the Bible. He actually says, now, I do not teach that. But he actually says this in the 4th century. So why would he say that? I think part of it is that the scripture is so much responding to what's happening in paganism that we have to understand that in order to understand the scripture correctly. Now, in Basil's time, paganism was really on its way out. There were still some pockets of it in the Roman Empire, but not too many. By the time you get to the late 4th century. But so it's not like Basil is saying like, you know, we need to fight against those pagans. Right. He's not really saying that. I mean, there are pagans around, but not a lot. But he is saying that this body of knowledge, this body of story is part of our story. Yeah, right. And you get, for instance, like, there's a lot of ways that, that gets sort of dealt with. You know, one of my favorite examples is, comes from, I think, a 13th century church in Norway where if you were to walk up to the front of the church, you know, to the front doors, you would see these beautiful wooden carvings on either side of the door that clearly are depicting scenes from a story. Well, it's the story of Sigurd killing the dragon Fafnir, which is a story from Norse mythology. Right. And you'd be like, well, what's going on here? And I've had people suggest to me, oh, they're trying to sort of trick pagans to come in. And like, I'm like, well, how stupid are pagans, seriously? You know, like, there's a cross up on top of this church, you know, like, not that. And like as soon as they get through the door, they're going to see Jesus everywhere. It's not like they're going to be like, oh, well, I came here thinking I was going to go ahead and worship Thor, but you know, I might as well stay for Jesus. Like, that's not what's going on. Rather, these are Christians who are saying this is in a sense part of our story, you know, and especially on."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2186.09,"end":2277.66,"speaker":"Jonathan Pageau","text":"The outer door, it's like, it's almost in the way that St. Basil said, you almost have to kind of have this, these stories, this network of stories before you enter into the church. Just like we have in the narthex and many monasteries, you know, the Greek philosophers, and this kind of idea that the pre Christian world has something bubbling in it which can then be kind of pointed towards Christ. And right now it seems like when I heard that you were studying mythology, for me, it made so much sense because as we kind of, in a way, not knowing these ancient stories and not knowing mythology was a leisure of a Christian world. Like it was the leisure of a. That was so fully Christian that we could almost forget the cosmic story around which, in which Christianity was born. But now in this, as the Christianity is kind of evacuating the public space, as it's fragmenting into all this kind of nonsense, then all of a sudden the relevance of these ancient stories and of the Pagan stories become important again, in my opinion, because we need to be able to kind of represent in the secular world this cosmic vision and how all these stories ultimately do point to Christ because people are tempted by them. People and all these neo pagans and all these people looking at other cultures and looking at Buddhist stories and vedantic stories and all these other myths. And if as Christians, we're not able to see the bubbling in those stories, the kind of, kind of frothing that is pointing towards Christ, then we're missing an opportunity to kind of find the lights in the darkness, let's say."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2278.29,"end":2282.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. One of the things I earnestly believe is that demons are coming back."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2282.77,"end":2283.41,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2283.41,"end":2360.9,"speaker":"Fr Andrew Stephen Damick","text":"Now, I don't think that they went anywhere. Right. You know, they haven't, they haven't. They have not actually all been cast into the abyss, although fortunately for us, most of them have. But there are still enough to cause massive problems, and they cause bigger problems when we engage with them in a cooperative way. And I think that as you, as you said, you know, as Christianity continues to recede from public life, that more and more people are cooperating with demonic powers. And so I think it's especially important that we understand exactly who those demonic powers are and what they do. And that is also part of why I'm reading mythology is, you know, it's not necessarily that there is a demon called Thor who does Thor things and I need to find him and point him out or whatever, but rather, if I understand the stories about Thor, then I can see interactions that people actually are having with demonstration in the ancient world. Because, you know, like, we had this idea that pagans made up stories of gods in order to explain natural phenomena that didn't understand. But that is never the way they said it. Yeah, right. That is, that is, we're imposing that narrative on top of them when we say that they all talked about actually meeting spiritual beings and interacting with them. So now we can decide, okay, I don't believe you. I don't believe you. Every single culture throughout the history of the world for thousands of years. I don't believe that any of you actually had these experiences."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2361.41,"end":2361.73,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2361.73,"end":2362.33,"speaker":"Fr Andrew Stephen Damick","text":"Or me."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2362.33,"end":2367.29,"speaker":"Jonathan Pageau","text":"But I think it's harder to. It's harder to justify that right now with the return of psychedelics and all these."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2367.29,"end":2368.93,"speaker":"Fr Andrew Stephen Damick","text":"It's getting harder and harder getting involved."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2368.93,"end":2412.06,"speaker":"Jonathan Pageau","text":"In these kind of returning to hallucinogens than having experiences which are objective across individuals. You realize that. Okay, no, no, there's something going on right now in the world. There's some Kind of there are these cracks that are forming and there's. There are these things seeping in. And we find a relationship between the Enochian story of downfall with the turn to magic and technology into hybrids and to chimera. And we can see the very same obsessions that are popping up right now, and the fact that it's actually related to people taking these substances and then encountering these beings, it's like, no, I think it's harder even for atheists and materials to argue with what's going on."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2412.06,"end":2481.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. And in the ancient world, taking substances in order to directly connect with your gods was something that was totally normal. So like some of my ancient Baltic ancestors, for instance, I don't know if they had access to psychedelics or not, but there was actually a saying that unless you drink enough beer, the God can't hear you. So there's this notion that drunkenness was kind of required for prayer of a certain kind. Right. And you know, the other way that ancient people actually directly interacted with gods was by offering sacrifices to them and eating them. And there are people now doing that again right there. Food being offered in front of idols of gods and people are eating them. So that actually puts you directly into communion with that God. It's the pagan Eucharist, essentially. Right. You know, the reason why the Eucharist works is the same reason why that works, but the big difference is who you're doing it with. Are you doing it with the God who made you and loves you and has sacrificed himself for you, or are you doing it with this lesser spiritual being who actually just wants to drag you down into the abyss with him and is going to make all kinds of false promises to you along the way? Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2481.59,"end":2526.1,"speaker":"Jonathan Pageau","text":"And there's even. It almost seems like there's even like the way that it's happening now, the way it's manifesting itself and kind of these new age movements and new pagan movements, it's almost even more chaotic than what you see in like a regular pagan cult. It's like it's completely unhinged and chaotic and improvised. And there's. It's almost like people are just. It's as if the pagans, even though they were dealing with demons, they were maybe they had found a way to maybe like hold the fire in a box or something. They were kind of had a way to tame it somehow. Like, not really, but at least a little bit. But now it feels like people are just running around with matches in houses filled with explosives and they're like, oh, look, at this effect. Look at what happens here. Oh, this actually works. This blows up. Woo hoo. It's like they just have spiritual experiences and they think that that's enough to justify their behavior."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2526.34,"end":2562.16,"speaker":"Fr Andrew Stephen Damick","text":"Right? And you know, the difference between us now and ancient peoples with their paganism is, you know, ancient peoples were doing this in community, right? They saw that the worship of the God bound them together. The God became part of their community, they became part of that God's community, right? And they had notions of gods that they worshiped that were supposedly going to do good for good things for them. And they also knew that they were there were, you know, gods who were going to harm them and so they did things to ward them off. Right? So the modern person engaging with these spirits does not have even that pagan wisdom."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2562.95,"end":2564.47,"speaker":"Jonathan Pageau","text":"No discernment. Zero discernment."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2564.47,"end":2667.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's individualistic because this is through the lens of modernism now. So it's individualistic. It's my personal journey. What's happened is this is paganism through the lens of individualistic, distorted Christian gospel selling, right? So it's now instead of let me tell you what Jesus can do for your life, it's let me tell you what this angel that I met, you know, through doing drugs can do for your life. So what we've done is we now have this reformation reduced gospel and we're now using it in a pagan way, right? And so I mean, it's just, it's utterly frightening and horrifying, right? Because even the community kinds of safeguards that pagans put in place, you know, that's not even there. This is just people in their own homes doing these things separately. And you know, because we live in a time where everything is contested and contestable, even where communities do form a of neopagans or people doing drugs together and so forth, it's still all very fluid because they're not, for instance, bound together by place, right. Most of these networks exist on the Internet. If they are bound together by place, there's almost nothing preventing them from moving somewhere else. An ancient person did not tend to move very often unless he was spurred by necessity somehow. Now it's like, oh, well, I just want to move to this place, I'm going to move there. Or I got a job in another state, I'm going to go there, I'm going to go to another country. So all of the kind of limitations that the ancient world provided, people are no longer there. And so it's just this utter explosion of spiritual engagements and a lot of it is very, very dangerous. Very, very dangerous."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2668.07,"end":2689.52,"speaker":"Jonathan Pageau","text":"And it gives you insight into the Flood. Like it gives you insight into how this type of behavior and these types of practices can lead to such a fragmentation, you know, or the Tower of Babel, like, you know, where everybody ends up. It's even worse than the Tower of Babel. It's like every individual just ends up speaking their own idiosyncratic spiritual language and there's no relationship between anybody else."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2689.52,"end":2693.6,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is what it says in scripture. Every man did what was right in his own eyes."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2694.32,"end":2695.32,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2695.32,"end":2709.42,"speaker":"Fr Andrew Stephen Damick","text":"I mean that, that's like that, you know, in the modern world. That's not a bug, that's a feature, but it really is a bug. You know, that's, that's what it's. That is the damning thing that is said about the immediate pre flood civilization. Every and did what was right in his own eyes."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2709.42,"end":2728.62,"speaker":"Jonathan Pageau","text":"Yeah, it's amazing. Yeah, it's amazing to realize just how, just how much it's like what we're going through now gives us insight into what is in the scripture and vice versa. But it's not necessarily pleasant to have that insight. It's actually quite frightening to kind of feel on the edge of the precipice and to see kind of everything toppling over."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2728.78,"end":2782.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you know, there is even a distorted version of this that's hitting Christianity too, Right. Because so Christianity is a universal message and call all. It's absolutely universal. It involves nothing less than the whole cosmos. Yeah, right. But now there is also this idea of, well, I should have my version of Christianity, maybe my nationalistic version, maybe my ideological version, my whatever version. Right. And I'll have my little sect and you know, the more positive versions of that just say, well, this is, this is for these people who live in this place. You know, we're going to keep those other people at arm's length. But this is, you know, but then the dark version where, where it inevitably goes is it becomes about conflict and it becomes about conquest. This is literally the narrative of paganism playing out under Christian guise. You know, these sort of nationalisms and all of this is a very, you know, identitarianism of every kind."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2782.72,"end":2824.38,"speaker":"Jonathan Pageau","text":"Whether it's interesting to see that there, that like you said, there are versions of it on both sides of the political spectrum. Right. There's, there's the kind of weird nationalism and this holding on to these national identities versus others and then there's the kind of consumer version of that where I want, I shop around for a church that Meets my needs and whatever has the best babysitting. That's the church I'm going to go to. Whichever church fills my needs the most is the one. And so you have virgins both on the right and the left, you could say, of these types. And one there where it's like, I'm going to go to church. That everybody agrees with me politically, that everybody agrees with my ideology. It's just a general phenomena of this kind of. This breakdown."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2824.38,"end":2855.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, you can see. So the opposite of that is the way that, for instance, the Orthodox Church talks about saints of particular places. Right. Now, some people see that and say, oh, look at these Russian Orthodox saints or these Greek or whatever adjective you want to put on. But actually the way that the church talks about saints in particular places, it says the saints who have shown forth in this land. Right. It's not that they are. That that land defines them because they belong to the heavenly hosts who are a cosmic reality."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2855.81,"end":2867.53,"speaker":"Jonathan Pageau","text":"Yeah. So it's closer to the idea of the universal history as we're presenting it. It's like it's actually a way for these particular places to kind of be joined up into the story of Christ and into the life and body and."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2867.53,"end":2903.53,"speaker":"Fr Andrew Stephen Damick","text":"You know, and that's what gives those places their particular beauty. Right. It's only as they refer to the cosmic narrative that they actually can shine forth. When the gaze gets turned back down towards created things, that's when it becomes idolatrous. That's when it becomes essentially pagan. You know, any kind of anything that draws a spiritual border between me and another person becomes a dark, distorted thing that actually doesn't have anything to do with Christ. But when we are both looking to Christ, then our particulars shine forth in their specific, beautiful way. Exactly."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2903.53,"end":2928.97,"speaker":"Jonathan Pageau","text":"And that's really the whole cosmic mystery. That's what we see in St. Maximus, you know, that's what we see in all these saints that show us how multiplicity. When it's turned towards God, when it's turned towards Christ and it starts to shine. But when it turns towards itself, just like when Adam took the apple, you know, just all the sins of pride that we see in the Bible, then you sink down in the mire and you lose that brightness."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":2929.37,"end":3030.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's hard because this problem of the universal, the particular has always been sort of with us. Right. And a lot of times when people see totalitarian approaches to things. Right. Then they resist the idea of any kind of universal. But the problem with a totalitarianism is not that it's Universal. It's that it's universal in the wrong way. It's about universal power or something like that, or making everyone think exactly the same. But Christianity is truly universal. And the way that it's universal brings out the light of everyone that's within it. Yeah, you know, that's. That's hard for us, you know, because, like, we hear the call of the universal call to, for instance, to love all of mankind. And that can. Then take us. We can become totalitarian if we don't refer that to God, you know, but. But if we react against that, which I think is, you know, reacting against totalitarianism is a totally normal and utterly appropriate thing to do. But the we. The way we need to react against it is not to say, I'm going to draw my little fortress here and I'm going to invite the people I want into it, and everyone else is not welcome. However they want to define that the right way is to say, you know what? The kingdom of God is the kingdom, and in my father's house there are many mansions. That's the way that it actually works. It's only with that king that you can actually have a universal society. You know, it's not. No other king will suffice, you know, and. And any other king that exists needs to refer his throne back to the throne of God or else it's going to become a very dark and distorting kind of kingdom. Yeah."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":3030.54,"end":3044.88,"speaker":"Jonathan Pageau","text":"And it's. It's a warning to all of us to not draw our. To not draw our life from politics, you know, and to not. Not discount it. It's important it exists. We have to deal with it. But to not feel like that this is where our life comes from, because it's not."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":3045.35,"end":3048.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All that stuff has to be relative to the kingdom of God."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":3048.23,"end":3070.65,"speaker":"Jonathan Pageau","text":"Yeah. Well, Father, I think this is a great place to end. You know, this is. I think that this call is right and everybody get, you know, get the book. It's just came out. It's fresh off the. Off the presses. And we'll definitely check in with Father Andrew again. You know, as he kind of discovers the mythological worldview more and more, we'll definitely find places to connect again. So thank you, Father Andrew."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":3071.28,"end":3072,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much."}
{"episode_id":"SW - #186 - 2021-10-26 - Fr. Andrew Damick - A Cosmic Vision of the Gospel","start":3072.08,"end":3134.01,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World. Within the zombie invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
