{"episode_id":"SW - #306 - 2023-09-22 - The Search for Participation in Contemporary Art","start":0.56,"end":648.74,"speaker":"Jonathan Pageau","text":"It's not surprising that this is what she's doing. And you can understand that in some ways what she was doing in the 1970s and what she was doing back then is what would lead to things like cutting and self harm in the modern world. Because cutting and self harm is also a desire to participate. It's a desire to re engage the world, to reawaken our engagement with the world. It's just a very deluded and deranged version which is. Which enters into this sadomasochistic paradigm that appears at the beginning of the modern age. Right. It's like all I can understand the world to be is either a world of power in which I inflict pain and violence and torture, or I am the recipient of violence and pain and torture. And if I can do that to myself, then I am in control of the nihilism that I'm living in, of the kind of dark world that I'm engaged with. This is Jonathan Peugeot. Welcome to the symbolic world. Hello to all of you. Welcome to the symbolic world. Today we're going to talk about art. I was really surprised to notice how many people watch my video on El Greco and Andy Warhol. So I thought we will push it a little further and we'll look at contemporary artists like Marina Abramovic of Pizzagate fame and a few other contemporary artists. And we'll look at how much of contemporary art, or some contemporary art, is yearning for participation, look at how they come close to it and also how they struggle to break through. And so, as you notice, a lot of things have been going on in the symbolic world. We have a new website that you can sign up to. There's a new community, a bunch of gifts even for people who sign up. And as you can see, I have behind me the beautiful mosaic that was made by my carving assistant David, and was designed by Heather Paulington. And so I'm surrounded by wonderful people, really excited to carry on with the symbolic world as we reach new levels. So what I'm going to look at is the question of contemporary art and how it moves into extremes and moves towards participation. But first, what I wanted you to think about is many of the modern artists were in some ways in the, what I call pendulum, a pendulum of deincarnation, you could call it. Where on the one hand the art tends to move up towards ideal shapes, towards idealism, towards, you know, and it also tends to move down towards either popular art or common art or everyday representations. This pendulum happens in many ways, sometimes almost contradictory, but nonetheless the Pendulum is there. And so here we're looking at an artist named Brancusi. Many of you will know him. And what's interesting about these artists is that if you look at what they're doing, some of it, you know, is not a problem in itself. And so Brancusi, one of the things he was trying to do was something like distill the essence out of the art. So many iconographers, artists like Aiden Hart, who has written much about iconography, has even suggested the possibility that, you know, there's something akin to icons in some of the modern movements. If you look at the way the face is simplified, this desire to kind of find the basic geometry of the face and to represent it is something that Aidan sees happening in icons. If you look at the difference between Roman art and Christian medieval art or iconographic art, you get a sense that the iconographic art is more distilled. It doesn't tend to show a lot of the excesses of the material world, but tends to that, say, rectify or simplify the forms. Now, this wasn't necessarily done with the same drive as the modern artist that is really trying to almost reduce to an essence, but nonetheless, there is something that you might want to see as akin. Now, this is true, but it's interesting to think about how there is a. In terms of moving towards an art, of course, of participation, you have a basic issue which is going to be in some ways the development of the personal style. And so, as Brancusi or other artists want to do this distilling, they also, at the same time, end up creating things that are so particular to themselves that their personality is impregnated completely on it. And so it doesn't have a kind of universal appeal, communal appeal, that the traditional arts would have. Like images and icons, they do distill the forms, but they do that in a way that is also calling to participation in a community. Whereas Brancusi is creating objects of contemplation, objects of aesthetic pleasure that would be in people's houses or in buildings, but don't necessarily have so much of that capacity to participate in a community. Another example is. Is, of course, Kandinsky. Now, many people have pointed Kandinsky out to me, saying, you know, isn't Kandinsky something akin to what you're trying to do? Right. He's trying to find the meaning in colors. Kandinsky created this whole theory of color symbolism, where each color represented certain moods, certain states of human existence. And then he created this almost symbolic language of colors in his Paintings where he brought all these colors together, contrasting with each other and. And existing together, in order to bring about this kind of symbolic language of color. And so there is something interesting about that, once again, in the way that my friend Aidan Hart points out that there's something of that in color in icons, where in icons, certain colors have a certain importance in certain representations. For example, we represent the veil of the Virgin with a royal color to, you know, we use gold, we use white, we use black and darkness to manifest certain characteristics. And so it's not as typified as in Kandinsky, and it's not as typified as sometimes people want to think, but there is definitely a basic symbolism of color that exists in the icons. Now, once again, the issue with Kandinsky, and this, of course, happens also with people like Piet Mondrian. Piet Mondrian is an artist who was trying to do something similar. He was a theosophist, and so, you know, a kind of spiritualist in the. In the early sense that, you know, something akin to what a New Ager would be today. And he tried to create these simple images of proportions, mathematical proportions, and primal colors in order to create this kind of spiritual experience of the painting. Now, one of the issues with both of these is that, for example, with Kandinsky, you have the problem that his forms and his colors create a very idiosyncratic language. And so in the desire to actually create something which would be universal, devoid of cultural, you know, cultural hooks, that it's not this or that person, it's not this or that seen, it's a universal language. What ends up happening is rather the opposite, is that Kandinsky creates a language which is completely idiosyncratic to himself. And that unless you've read his book on color, you would struggle to find any meaning in his paintings. Even in terms of impressions. The impressions that his paintings create on the viewer are not really exactly what he would think, think they are doing with his whole very complex theory of color. Now, the same happens with Piet Mondrian is that, you know, although his mathematical proportions, they are universal, they are very much, once again, void of the capacity to participate. And so these images, you look at them, but what are they? What are they doing? What is happening with these images? And what's important to understand in terms of the pendulum is to understand how in the early modern age, and this is something which will be repeated, early modernism, not modern age, say, at the beginning of the 20th century, something which will be repeated over and over Is that you end up having movements of artists that represent things that look very similar to each other, but for apt, completely opposite reasons. And this happened especially in Russia. So in Russia, you had two movements. You had a movement that you could call supremacism. You see this in Malevich, of course, Malevich, who was kind of continuing Kandinsky's line of representing these pure mathematical forms, these pure shapes, these pure colors on canvases in order to create a supreme, you know, kind of platonic experience of the forms in the paintings. And so there was almost like a spiritualism which is devoid of body. And you see that of course, in Mondrian as well. You know, it's trying to create these pure patterns. Pure patterns that are. That are spiritual, but that don't land, that don't incarnate in the world the way patterns actually usually incarnate in the world. Right. You don't perceive mathematical proportions. You perceive them. You know, if you look at the golden mean, for example, you know, the golden mean appears as different proportions, the proportions of the body, the proportions of buildings, you know, that are participated in. You enter into the building and the fact that your body is made of certain proportions connects with the proportions of the church. And so there might be a little bit of that in the painting, but the painting is, Is something that you stand in front of and you look at that weird activity of just visual experience is something which is not integrated with other aspects of reality."}
{"episode_id":"SW - #306 - 2023-09-22 - The Search for Participation in Contemporary Art","start":648.82,"end":708.11,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on north oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio. And you can trust me. This isn't just another weight loss clinic. I. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results, call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #306 - 2023-09-22 - The Search for Participation in Contemporary Art","start":708.11,"end":2208.31,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com so now what is interesting about Russian supremacism is that it gives birth to a movement that is its opposite, which is called Constructivism. And the constructivists are also using these geometric shapes, but they're using them in an almost reductionist manner in a Marxist way. So on the one hand, you have this kind of idealism, this high spiritualism in the supremacist, and now this landed very, very practical use in Constructivism. Now you look at this and you might think, okay, so what's the difference, right? What's the difference between this, which is constructivism and this, which is supremacism? And that's my point. My point is that, you know, these extremes manifest, manifest themselves in a very surprising way where people, on the one hand, someone who wants to create idealistic, spiritual forms, and the other person who wants to create Marxist, working class, you know, reductionist objects that are made of real things, you know, that are. That are completely material in there for even the reason of their being will end up making something similar. And so for the same reason, what you end up seeing is the constructivists end up using the tools of modernism and the design tools of simple geometric forms in order to create propaganda, whereas something like creating propaganda out of abstract geometric forms, you. Is something that the supremacist like Malevich would have found completely abhorrent and the total opposite of what it is they're trying to do. Now. This, of course, will continue on into the modern age. And when you get to the 1960s and 70s, you have the exact same problem in the United States and in Europe as well. You end up having two movements, one which is called conceptual art and the other which is called minimalism. And what happens is you have these two extremes. And so conceptual art, you know, this is supposed to be very smart. So Joseph Kossuth, you know, he puts a chair in the gallery and then puts a picture of the chair and then puts a definition of the chair to kind of help you understand that, you know, how these objects are actually ideas and that the idea is what is more important than the physical instantiation of the object. And so, you know, it's super interesting because this is a very, very boring thing. It's a very boring statement. And it's also a cold, clinical action that is supposed to create just this reflection on the relationship between different representations of an idea in the world and different, you know, putting out there in terms of the Creation of an art object, Right? Because this is the problem now. This chair, you know, is not an actual chair, right? It's not a chair that you sit on. It's a fetishized chair that is used in the gallery in order to create a artistic experience, I guess. And so, although, again, you have this problem of the alienation which the art object end up creating in the world. And so then you end up having all these tropes of trying to kind of break free, break through the issue that the gallery space provides. And, you know, the art space provides the most extreme version of this kind of conceptual art that is trying to be revolutionary. If you remember my last lecture on Ariel Greco and Andy Warhol, is, of course, Piero Manzoni, who did the. You can read it for yourself. He created cans of art that contained his own excrement. We don't even know if they really did, but that was the point. The point is to have these cans that contain the excrement of the artist and put them in the gallery. He was kind of taking Duchamp's gesture to an extreme, but Manzoni did all kinds of things like that, where he. He would take a vial of glass and fill it with Air in Paris. You know, just have a vial of glass, open in Paris, close it, and then show it all over the world and call it, you know, air from Paris or something. And it was this desire to kind of expose, in some ways, almost the very mechanisms of art and the very mechanisms of how art is a fetishized representation of. Of something that has lost its purpose. So it's not clear exactly what his point was in the sense that. Is he denouncing it? Is he participating in it? Maybe he's doing both at the same time, you know, but he can perceive the problem of participation and the problem of the space, the art space itself as this strange space where we put things there in order for us to just look at them, and they don't have a kind of integration into. Into the world. And so this conceptual art, this high, high conceptual art, will at the same time exist with other artists that are doing what we call minimalist art. And here we're looking at pure reductionism. So if you look at an abstract painting by Frank Stella, for example, and so, you know, abstract lines on a canvas, and it might make you think that this has more to do with Maledich, but someone like Frank Stella would be the very opposite of Malevich. He would say that my paintings are just paint on a surface that's all they are, they have no meaning. They have nothing except for just being paint on a surface. Now, obviously, you know, at this point, hopefully everybody can understand that this is a, of course, a ridiculous gesture. It's a ridiculous gesture to think that you can have just paint on a canvas. The whole question of relevance and of wondering why I would care about paint on a canvas and not care about paint on a wall or not care about whatever it is, is, of course, re engaging and is a kind of strange, almost blind spot of an artist like Frank Stella, where the putting in the gallery of this canvas with abstract painted lines on it cannot avoid entering into the whole question of meaning, of prestige and of relevance and the question of culture and why we would have these objects that we elevate above other objects and that we see as being kind of fetishized, as cult, as culture objects, rather than just everyday common day objects. And so you can see how the pendulum calls each other, right? The pendulum just calls one extreme to the other and sometimes even in the same object. And so without the whole structure of art and the whole structure of culture and this whole idea of these objects of contemplation and that are fetishized and put above common day objects almost in a religious way, Frank Stella could not be making his paintings. And so even though he makes a reductionist move, the very fact that we care about his reductionist move, you know, makes his art participate in the other extreme all the time. And you see the same thing with any of the minimalist artists here. More examples, Carl Andre, Donald Judd, who created these simple materials, they would just create these forms. And, you know, Donald Judd, his boxes are made out of plywood. They're made out of very common materials and put up in galleries in very simple way in a very reductionist gesture. Once again, you know, there is very difficult for them to avoid this pendulum. Now, one of the things that happens, and it's interesting to start thinking about, is that there is in the 1960s especially, and then in the 1970s, you have almost like a breakout where I think many of the artists started to realize just how sterile a lot of this abstract art was becoming, this conceptual art, these minimalist art, how sterile and just, could I say fetishized in the weirdest way that these objects started becoming. And so what you have is artists that almost try to start to break out. And in that group, you have performance artists who start to use art almost in a ritual fashion. And this is what I mean by the question of ritualization. So this is Joseph Beuys Joseph Beuys was an airplane pilot in World War II, and his plane crashed. And he has a whole story about what happened to him. And so his art tends to deal with these issues, right? With the issues of the. Of the war, the issues of survival, the issues of the human person put in contact with animality. And so some of it is a little simplistic because it's almost like his own process of healing through what he went, you know, like the felt blanket that he would have had in the military, the sled, a flashlight. You know, there's a sense in which he's creating these spaces that are. That are just putting things together in a way that is, let's say, remembering participation. Right? So it's. The object in the gallery is obviously just fetishized like all the other art objects. But because he's trying to bring about a memory of the war, a memory of, you know, how these objects participated in his own life, then there's something going on. Now we're going to get back to Joseph Boyce. But of course, the most famous of the performance artists, especially right now, is, of course, Marina Abramovich. And it's interesting to think about her and her work and what she was trying to do, because in some ways, she was also trying to kind of break through the problem of art. Art especially, you know, represented as here's the art and here's the public. And now we go in and we are these passive. These passive almost, you know, consumers. And we just look at these art objects and there's no form of connection to the world and to life. And so what she was trying to do, you know, she was trying to do a lot of things, but one of the things she seems to been trying to do is to try to break the breakthrough, that problem. So she did very strange performances. One of her most famous performance is shown here, where Marina Abramovic stood in a gallery for six hours, and she put on a table a bunch of objects. And all those objects were objects that a certain amount of people in the space with her were allowed to use on her. And so you had feathers, you had paper, string you could kind of see, but you also had more dangerous objects, like a gun, like a knife. And she just stood there for six hours. She wasn't allowed to react. She just had to take it. And then everybody in the gallery was allowed to do whatever they want. They were absolved of any responsibility. Legally, of course, probably some of this is quite staged. I don't want to question her method, but of Course, as you can imagine, the situation starts very lightly and then accelerates. And it ends in moments where, you know, she's very much in danger, where a knife is used on her. You know, there's a. She's stripped, she's put on the table. You know, all these things are happening to her. You know, someone, you know, kind of threatens her with a knife. And so in the end, someone tries. Pulls a gun out. And then someone reaches for the gun, takes the gun away. And so, you know, it's like, intensity. Nice Hollywood movie. But what it seems like she's trying to do is trying to break through the problem of this passive relationship to the art object. Now, she's doing it, obviously, in a very modern way. She's doing it in a way which tends to reduce human. She now becomes the passive and the viewer becomes active. And the whole relationship is one which seems to be framed on the possibility of sadism and a kind of passive masochism. And so, of course, the relationship that she brings about is a very tortuous modern relationship, but she's trying to bring back, you could say, something like, the stakes. Like the stakes of art. What are we doing? Imagine in the ancient world where you built a church and people would go and worship, and there would be. These relics would be taken into the church, and people would light candles, you know, and then people would. People, when they were angry at the king or whatever, they would deface the statue. And there was this whole relationship of art which was seen as participative and connected to life. And so it seems like she is trying to re. Engage that in a very perverse way. But nonetheless, you can see that there is a sense that there's despair in the art world, that we realize that this is a problem. What are these paintings? There's nothing wrong with decorative art, but is that what it is? Is that all that these paintings are? I don't. Most of the modern artists don't think so. They think they're doing something extremely important. But in the end, these art objects end up just being passive objects to look at, to trade, to exchange, to make money off of. And so artists like her try to break that with this type of activity. And so she's famously known for doing all kinds of weird things. Here's a performance where she holding a bow, and her friend is pulling on the arrow. And for six minutes, he just holds the arrow stretched out. And if he would let go, she would die. Of course, the arrow would go into her heart. And so it's all about, again, the same weird problem of how to represent a kind of, you know. And this is not just entertainment, right? This is not just a performance in the sense of a play, right? Or a ballet or something that is without stakes, that it's just people doing things and we watch it and we go home. There's a sense in which she's putting herself in danger while she is creating this performance. Of course, like I said before, the relationship seems to be reduced to a kind of sadomasochism and which is very close. You know, it's funny, people don't realize to what extent sadomasochism is related to modernism and to what extent in the Enlightenment, at the birth of the Enlightenment, appears both characters, right? Marquis de Sade and Sasser Mazak, the two originators of what we could call sadism and masochism. Because there is already a problem once the Enlightenment and its pendulum starts to swing. You can see the first fruits of that in this reduction of relationships on the idea of acting purely on someone, right? Being the complete actor, where the other person is a complete passive puppet for your desires. And on the other hand, the opposite of becoming that pure puppet for someone else's desires, of just becoming a passive recipient of other people's desires and violence. That. That is something which would inevitably happen at the birth of modernism. And so Marina, whether she knows it or not, is putting on the scene this relationship, this kind of weird, sadomasochist relationship that the modern world has in a desire to re. Engage the stakes of art and re. Engage, I think, a kind of participation, at least the stakes of art. And so much of her art is. And so she became very famous because she did some weirder stuff. Now, this is one of her performances where she just sits in a galley space with a bunch of cowbones and she spends six hours a day or eight hours a day, whatever, trying to wash the blood from the bones. That's all she did. She would sit in the galley and she would just try to wash the blood off the bones for hours. And it creates, again, this very dark image of what it is to be human, what it is to participate, you know, Is that what human life is, right? Is that what human life is is to try to wash the blood off of bones? Right? The imagery is quite stark and it is quite. You know, it's actually a very good image of what contemporary life is and what the contemporary world is. This is what the world of participation in the modern world, the analogy or the metaphor for. For participation is now she got herself in a lot of trouble in the last few years because she did a lot of weirder stuff. Things that are closer to the occult, things that are closer to rituals. Now you can understand whether she's sincere or not, like whether or not she's doing it on purpose or not. What she's doing is coming closer to resembling rituals because intuitively we understand that we. Ritualization is a form of participation which is closer to the way that we understand what art is. That is, it's a reduction of the world, a compression of the world into a kind of dance, a kind of ordered gesturing, ordered object making. It's a reductive object, right? We compress things into images. We compress. The cup that is used in the liturgy is a kind of compressed cup. It's like the cup of cups, right? It's a ritualized cup. It's not just a cup you use every day, but it is. But it is a condensation of cup. And so there's a inevitable, almost sense that what will happen is as there's this desire to break out of just the passive relationship to art, things that people are doing. These performance artists will often start to look like ritual now, whether they themselves conceive what they're doing as rituals. Nonetheless, it's participating in the same aesthetics. And there's no surprise that the rituals that they will engage with will be rituals which will reflect the sickness of the modern world. And so she got, of course, also into a lot of trouble with these performances she did with spirit cooking or whatever. You, you know, she's done a lot of things. She would write up all these absurd recipes that look like magical formulas using human fluids and stuff mixed together in order to create food. And she does a lot of things with pain where she would film herself just putting her hand over a candle or whatever and just burning herself. You know, I mean, it's not surprising that this is what she's doing. And you can understand that in some ways what she was doing in the 1970s and what she was doing back then is what would lead to things like cutting and self harm in the modern world. Because cutting and self harm is also a desire to participate. It's a desire to re. Engage the world, right? To reawaken our engagement with the world. It's just a very deluded and deranged version which enters into this. This sadomasochistic paradigm that appears at the beginning of the modern age, right? It's like all I can understand the world to be is either a world of power in which I inflict pain and violence and torture, or I am the recipient of violence and pain and torture. And if I can do that to myself, then I am in control of the nihilism that I'm living in, of the. Of the kind of dark world that I'm engaged with. So you can kind of understand why this is happening. It doesn't reduce from how dark it is. But of course, the most important to me, the most important thing that Marina did recently that kind of shows us an image of the modern world and what is going on is the event she did at the Museum of Modern Art in la. I think that's where it is. And so she did this performance with the singer Blondie, of all people, where now we had a full on scale desire to re engage participation. And so she created an art event which was also eating. And so remember all the things that I've said about eating as an act of participation and communion, especially as the kind of highest ritual act and the highest act of participation, participation. But that is a form of ritualized eating, because eating is so close to our, you know, our engagement with the world. And so now what she does is she creates a feast of eating. And I'm not going to show you all the pictures because they're quite disturbing, you know, where she engages all the tropes of cannibalism, you know, and all the tropes of, of human sacrifice into her event. So she had these cakes made of herself and of the Blondie singer. And the cakes came in on these tables and now with a knife, they stabbed them and cut them and cut pieces and handed pieces of their cake to the people. And you can see how it's a parody, of course, obviously of communion, a parody of the Lord's Supper, but done in a kind of dark, carnivalesque way. But that is nonetheless right. Trying to like in their own perverted, disturbing way, trying to break through the problem of the passivity of the art, of the art object, and the passivity of the entertainment culture and of representation culture. And so during the event on the tables, they had actors, artists who just stuck their head through the table and their heads were like the centerpiece, almost like a pig with an apple in its mouth. In the middle of the table as people were eating, they would just sit there and stare blankly. And they had naked women lying on tables with skeletons on them and just very dark and disturbing things. And so close to ritualization that of course, during the 2016 kind of frenetic thing around pizzagate People started seeing these images and freaking out. And the thing is, with good reason, you know, it's so funny that someone like her engages with tropes of occult cannibalism, all these very, very dark images, and then defends herself and says, you know, oh, I'm just an artist. This is just art. But her whole project is about breaking through the just art. Like, breaking through through the idea that artists are just like innocent people who represent things. She's trying to break through. She's trying to reengage. She's trying to use images of her own self harm and her own, you know, doing all these very dark, disturbing gestures. And then she's surprised when it breaks out and that people react in a way that links it to the very things that she's using as her source material in order to create these things. And so whether or not she's an actual Satanist or an occultist, like I've said often in these videos, like, I don't have access to that and to be honest, I don't care. But the tropes that she's using are those. If you use tropes of cannibalism and you use tropes of human sacrifice and you use tropes that are magical spells and, and magical formulas in your recipes and whatever, then don't be surprised if people react to that as if that's what you're doing."}
{"episode_id":"SW - #306 - 2023-09-22 - The Search for Participation in Contemporary Art","start":2208.55,"end":2271.27,"speaker":"Laura Diaz","text":"Tucson the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight so safely. With real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. To Tucson. Your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book Your free consultation today. That's mediweightloss.com Ah, so anyways, it's just."}
{"episode_id":"SW - #306 - 2023-09-22 - The Search for Participation in Contemporary Art","start":2271.27,"end":3285.37,"speaker":"Jonathan Pageau","text":"Funny to see how she. Then she tried to play the victim. And you can see there's all these articles, you can find them online where she's playing the victims, like, oh, stop harassing me. I'm just an artist. You know, all these conspiracy theorists that are saying that I'm doing these dark things. Well, you are doing these dark things. You might not take it seriously. Maybe you're just doing it, you know, to be an artist, whatever that means. But like I said, the tropes, you're engaging, those are the tropes. Those are the tropes. So, you know, obviously I don't want people to harass her or whatever. I wouldn't want. I don't want that to happen. But, you know, nonetheless, this is what is going on in her work now. One of the things I want to do is return to Joseph Boyce. Because Joseph Boyce, you know, understood what he was doing very much as ritual. And he was almost using kind of shamanistic, shamanistic thing. He did these performances where he would lock himself in a room with, like, wool, with a wolf, and he wore this felt blanket and would, like, engage with the wolf in certain ways and was trying to almost create these rituals. And one of the problems that they were trying to deal with, these artists was, of course, World War II, and Joseph Boyce was a German artist. How to deal with the scandal of World War II, how to break through the guilt and the shame and all the things that happened that he did as a soldier, that Germans did. And so trying to create these almost rituals of atonement in order to get through that. And so he did all kinds of stuff, you know, kind of absurdist things. Now, of course, the problem with this is the same problem as with Kandinsky, is that you can totally understand the desire to re engage rituality. You can totally understand the desire to also feel like there's no way to atone for the sins of your people, for your own sins, and try to create rituals of atonement and of transformation. But when you do it in a gallery and you do it in a space that is just there to hold art objects, when you do it in a language that becomes so idiosyncratic that nobody can participate in it except for you, that people are looking at you ripping up pieces of paper and writing on billboards and skinning a hair, like he did all kinds of stuff playing the piano, absurdly, you might think that you're kind of doing something that's breaking through, but ultimately this will remain with you, right? It will not become a true language of participation. Another artist that I personally enjoy. And like I said, it's just because each of these artists has a little hint that there's a desire to move away from a kind of fetishization of art and the kind of meaning, not meaninglessness, but this idea of art for art's sake, that this pure art that just exists is an artist called Anselm Kiefer. So Anselm Kiefer did things that were similar to what Joseph Boyce was doing. But his whole, let's say, theme is about the possibility of using art as a kind of medicine, where the representation of the images could take, let's say, culture and break it down or bring it down into the dark place and then try to have it rise back up. And so he would represent some of these Nazi. Nazi building, this Nazi architecture, and would cover it with tar. Would. Would try. Would cover it with, like, all. With actual material, not just paint. You know, he would. He would have ash, and he would put sand and straw and all these things on the paintings and would, you know, and trying to, in some ways, you know, re. Baptize or refound these buildings that are there, right? What do you do now? You have these Nazi buildings that are there in Berlin or in other places in Germany. And how do you get through this? Like, do you destroy them? Do you just get rid of them? And so his sense is that there's a kind of deep duplicity in his art where he is trying, in some ways to recast very, with hesitation these objects and almost trying to act like a kind of traditional healer and heal these art objects. Now, once you understand that's what he's doing, his art, the key to his art opens up very simply. He represents, you know, these lead wings, or sometimes you represent a lead artist palette, painter's palette that will be stuck on top of his. Of his images. He'll represent airplanes, sometimes war airplanes, as this dual symbol of something which is both dark but also rises up. And so there's this ambiguity about his work, but the ambiguity seems to be wanting to kind of push through and to break through the problem of modernism and the problem of World War II. The iconology that he uses is actually quite. It's a little simplistic, you know, it's a little over the top. So here's a simple example, right? A man lying on his back, and then out of him is coming this thing, a flower, you know, a kind of stream. And this is going up now, becoming a flower that dies. And the seeds now fall back on the earth. And so you can kind of see this cycle of death and rebirth that he's trying to show in the image here. This is actually the Louvre. You can see that there's a bunch of books, right? And the books are kind of stacked and. And piled, and they're made of lead, and so they're dead. You know, in some ways they're kind of like the problem of, you know, I talk about this, the problem of culture and the problem of the problem of art as this supplement, as this kind of dark aspect to culture in general. And so he gets that and then he shows out of it, you know, a nonetheless kind of lent flower. And so if you had seen this in person, the very center of this dead flower is gilded. It has gold on it. And then a few of the seeds that have fallen back onto the trees, onto the books are also golden. And so a lot of it is lead. But you have this kind of little hope piercing through this dead culture. You see the same in this image as well. So the sunflower comes up, and then the sunflower drops its seeds back onto the ground, and you hope that some of it will be reborn. The sunflower seeds are also stars. In his kind of imagination, you can understand, you know, here it's something like the Milky Way, this idea of, like the principalities coming up and then acting back upon us, you know, so there's something about his work which is obviously a little kitschy, a little New Agey, a little simplistic in its kind of basic imagery, something that you might find in a kind of second rate Jungian type of thinking, but the desire to represent this kind of decadence and this breakdown of culture and the weight of history and how in this death that there might be something that is reborn, I think is a desire and a hope that for sure I share. And so I do find some resonance in his work in that sense. And I think that understanding that is something that has pushed me towards some of the things that I'm doing now. The problem, of course, with Kiefer, and just like the problem with Joseph Boyce or the problem with Marina Abramovich, is that the spaces in which they create these things, they are artificial spaces themselves, right? The museum, the gallery, these are kind of fetishized spaces. They aren't spaces of. They aren't the public square, they aren't the church, they aren't the civic Buildings, they aren't the things that we kind of recognize as holding our identity, holding our participation. And although the artist created these gallery spaces, not the artist, but first the art dealers created these spaces just for art, in order to sell art. And those spaces became, you know, like just places to see art and to visualize is its desire to break through. Now, I don't think they succeed. I don't think they succeed because they're trapped inside the art world. They're trapped inside a weird. Like Kiefer, for example. His. His paintings are very much on the art market. They're objects of speculation for art dealers and art collectors. And so, just like all the other artists, he probably manages how many pieces he puts out in the market, calculates his moves in order to make sure to make the best killing in terms of selling. All of these things are inevitable in the art world. And then collectors will want to see shows by this artist in order to make their collection be worth more. So there's this strange. This whole strange things in which they participate. And the same thing with Marina Abramovic, you know, she has this art foundation and then she has it funded by these elites in order to make performance art that exists only within the space of the artist and the space of art, and doesn't really land right. It doesn't turn into folk dances, it doesn't turn into things that people imitate. And in some ways, she probably doesn't even want that to happen because she doesn't totally understand the way that patterns embody themselves in the world. And so. But what you can see is at least the desire to kind of break through. And I think that once you see that, you can understand why there are ways to do it, that there is a possibility of reengaging. And at least in my vision, it starts with liturgical art, because the liturgical space, the church, is still a true space of participation, although in some churches in Europe it has become a fetishized museum. Most churches, at least, are still. And sometimes the ones that are the least beautiful or that aren't as beautiful as the great cathedrals, for example, are spaces of true participation. And so the possibility of creating objects within that world can anchor them in terms of their beauty, but then also in terms of their participation. Now, in order to give you a bit of hope, it's not like these contemporary art movements were the only movements to exist in the modern world. There were movements that tried to also integrate the different forms. So there are art movements that tried to, you know, resist this fetish adjacent that happened in the. In the modern world, you know, you can see that, of course, in movements like the Arts and Crafts movements and also Art Nouveau, which tried to link the architectural, the object, printmaking that tried to kind of integrate that into the world. Now, I think that the Arts and Crafts movement and Art Nouveau succeeded much more than the modern artists in avoiding the extremes. Now, of course, one of the issues with. With the Arts and Crafts movement and Art Nouveau is there was nonetheless this kind of. How can I say this? There was a lack of anchoring a little bit in terms of form. There was a fantastical movement, especially in Art Nouveau, where we kind of moved toward these fantastical shapes that moved into extremes and were very hard to embody in the long term, for example. So it's not surprising that Art Nouveau was like a flash that really tried to integrate, but then didn't really succeed. In the end, it ended up falling apart. And also because there was so much emphasis on ornament, you know, you see that with William Morris and some of the Arts and craftspeople, there was so much beautiful ornamentation. You can see that, you know, in the. You can see that in these interiors, for example, where there's a rich use of fabric, of ornamentation, trying to kind of integrate these things into the common life, beauty into the common world. So not just beauty for beauty's sake, but beauty in a chair, beauty in a curtain, and something that is part of the everyday life. And so there's still some of that. People can still kind of hold on to that a little bit. But there was such a kind of excess, you could see, say, in the aesthetics in terms of. I mean, here it's like gilded peacocks on the wall. You know, this type of gilded surfaces and extremely designed surfaces are things that maybe should be reserved for civic spaces, for churches. But of course, because Art Nouveau was a modern movement, it got focused on homes. And it's okay for your home to be beautiful, but if you push it too much and you create these excessively lavish homes that aren't for a king, for example, that are trying to be a model for the way in which we exist, it's going to be difficult to kind of hold on to that. But there are some things from these movements that we can nonetheless capture and kind of vision in order to think differently about how art participates in life and to understand that the possibility of integrating beauty into the everyday, into the everyday object is something which is not. It's not impossible. Because the Arts and Crafts movement and the Art Nouveau movement was able to make beautiful lands, beautiful pots, beautiful different objects of just participation in the world. And so there is a bit of excess. And so you can understand why the modernists tend to think that because of industrial. The industrial process, that these types of ornamentation have become impossible, that we should really move towards a kind of simple, simple geometric forms. So hopefully this was just a bit of fun for you to kind of understand and see that not only does the modern world and modern art really emphasize these extremes, often this pendulum of abstraction, high, high abstraction, but then also materialist, varying reductionist concerns, but that there were desires and there's artists that tried to break through this just passive, weird art object, tried to re engage participation, but would often do it in a way that would nonetheless re engage these extremes, extremes of idiosyncrasy, extremes of sadism and masochism, in the terms, in the case of Abramovich, and create these obscure languages that nobody understood. Although there are some, like Anselm Kiefer that I showed you, who were reengaging images that you could recognize a wing artist's palette, human body, these things trying to be reintegrated. A little kitschy, maybe a little New Agey, but at least you can perceive the desire, right? This desire to break through. And ultimately, I do think that liturgical art is the way out, at least for, you know, not to become a famous artist and to become. And to become known and to be shown in magazines or whatever and in different publications, but in order to really participate in a community, beauty making, meaning making within the community, this seems to be at least the anchor of a way out. And so thanks everybody for your attention. I hope you enjoyed it and I will talk to you very soon. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
