{"episode_id":"SW - #323 - 2024-01-18 - What It Means to Be Born Again","start":0.4,"end":1106.03,"speaker":"Jonathan Pageau","text":"Christianity is revealing to you the pattern of reality, of how it is that complexity works, how it is that any type of unity and multiplicity cohere. But that also means that you. You know, it is calling you to actually participate in that in a real way. This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. As we are coming closer to theophany and in the Western tradition, epiphany, which in the Orthodox Church is mostly surrounding the baptism of Christ, I thought we could look at one verse in the Bible which talks about the baptism of Christ. I chosen a virgin in the Gospel of St. Matthew, could have chosen another version in another Gospel to see just how much it packs in terms of understanding so many things related to Christianity, whether it is this idea of the new birth or being born again, the idea of the new creation, you know, what it is that Christ represents in the. In the story. All the meaning of theophany and the baptism of Christ is of course contained in the icon of the baptism of Christ. But what I thought is we'll look at the text first, and then maybe we'll come back to the icon a little bit later to see what it is that the icon contains in terms of this mystery. Now we'll go into the Gospel of Matthew, chapter three, where it says that as soon as Jesus was baptized, he went up out of the water. At that moment, heaven was opened and he saw the Spirit of God descending like a dove and alighting on him. And a voice from heaven said, this is my Son, whom I love with him, I am well pleased. Now, of course, this is seen in the Orthodox tradition and in Christianity in general as the revelation of the Trinity, which is that we hear the voice of God, the Father of God above, who says, this is my Son. And then we see the Spirit descending like a dove on Christ that comes out of the water. And so it's seen as a revelation of the Trinity. But there's also something else really going on here, which is that when Christ comes out of the water and the Spirit of God comes down on him like a dove, what we're seeing is a reference to two stories in the Old Testament at the same time. First is the very beginning of Genesis, where it says that the Spirit of God hovered above the waters. So at the beginning of Genesis, you have this before creation even starts, you have this image of these chaotic waters underneath and of the Spirit of God above the waters, right? It's a basic cosmic image of heaven above, because there's no difference between heaven and Spirit and air. All of these things are related. So when it says Spirit in the Old Testament, or in the New Testament for that matter, it is the same as wind or what's above this invisible thing that moves above that you can't see moving, but you see its effects. And so this is what is above. And then below are the water. So it's referring to that, but then it's also referring to the end of the flood, of course, because at the end of the flood, Noah sends out a dove, and then that dove finds a branch by which it is able to know that the flood has abated and that the new world has begun. And so what is all going on here? So, of course, what we're seeing is a new beginning. We're seeing a new creation. In this particular instance, Christ appears as the tree, the branch that. The branch that the bird comes and finds. And when we hear the word branch and when we hear the word tree, we always have to remember that a tree is the pattern of reality itself, that it is the fractal pattern of reality, of unity splitting into multiplicity, and that new unity and now splitting again into multiplicities. The structure of a tree, which is that exactly one and many joining together in a pattern of hierarchy. That is how reality lays itself out. That is the structure of the world. That is what connects heaven and earth together is this embodied structure that manifests itself, right? And so you can say that the tree is the connection between heaven and earth. It is the invisible principles of reality manifesting themselves in an embodied form so that you can see the pattern of the heavens, the pattern of reality in. On the earth, connected to the earth. So it's like a bridge between the two. Between the whole completely invisible patterns and the, you know, the chaotic, primordial earth. And so in this context now, Christ appears as this new connection between. Between heaven and earth, as a connection between heaven and earth. And so what, like I said, was joined together is the first chapter of Genesis. That is the actual creation of the word of the world. And now the. The second world, which is after the. The death of the first world, the flood, and the beginning of a new world. So Christ is manifesting the beginning of a new world. And then when we hear that the voice of God above saying, this is my Son, that is, this is the one that I have engendered. This is the one that I recognize as my own, the one that is manifesting my identity now into the world. That is, of course, the idea of what the Son of God is. We have a relationship Again, between this idea of the Son of God and the branch, the. That the bird finds in the world, that manifests the pattern of a new order which is being born in reality. Of course, this is related, of course, in the Old Testament. It's related somewhat, of course, to the voice of God as well. That pulls reality, pulls the world, pulls creation out of the waters, that separates the waters, that pulls the earth out of the waters. All of these things are being referred to. Of course, it's amazing because it's using images. So it can be very simple with just this one verse and bring out of our knowledge all of these other images that appear in the Old Testament. Okay, now, so what we're seeing importantly is to mostly to understand that what we're seeing is a new beginning, a new connection between heaven and earth, or revealing the connection between heaven and earth. And this can be represented in many ways. It could be represented as, for example, a new creation, a new kingdom. Right, the kingdom. A new kingdom is also very important to understand how it connects, which is that a kingdom is similar to a tree. That is, a kingdom is the way the world lays itself out in an orderly way, connected to a principality, connected to a king, which unites all this multiplicity together. So a tree, a kingdom, you know, and then, of course, it can be represented as a new birth, as a new beginning. And so once you start to see these images come together, there are a lot of things in the Bible that will start to make sense, even though it sometimes they seem obscure at the outset. And so, you know, what I wanted to do is to look at another text in Scripture, one which is very popular, especially in kind of American Christianity, and, and see how we can make sense of it based on these images that Christ himself brings up. And this is, of course, John 3. So we're not going to read all of John 3, but I want to read a part of John 3, starting with verse 3, where Christ encounters Nicodemus. So it says now, there was a Pharisee, a man named Nicodemus, who was a member of the Jewish ruling council. He came to Jesus at night and said, rabbi, we know that you are a teacher who has come from God. No one could perform the signs you are doing if God were not with him. Jesus replied, very truly, I tell you, no one can see the kingdom of God unless they are born again already. It's like if you just look at what is being said here, it is very obscure, despite the fact that some people will tell us that this is as clear as crystal this is very simple, right? You can't see the kingdom unless you're born again. This is simple and obvious. Of course. Nicodemus asked him, how can someone be born when they are old? Surely they cannot enter a second time into their mother's womb to be born. So Jesus answers, very truly, I tell you, no one can enter the kingdom of God unless they are born of water and spirit. Spirit flesh gives birth to flesh, but spirit gives birth to spirit. So he continues and said, you should not be surprised at my saying, you must be born again. The wind blows wherever it pleases. You hear its sound, but you cannot tell where it comes from or where it is going. So it is with everyone born of the Spirit. And of course, Nicodemus asks, how can this be? And so Christ continues and reproaches him, you know, and says, how don't you know these things? You are a teacher of Israel. How is it that you don't know these things? So what is it that Christ is talking about here? Of course Christ is referring. If you've read the Gospel, and you've read even The Gospel of St. John, if you read the other Gospels, you know that he's referring to the baptism. He's referring to his baptism. He's referring to what it is that happened to him at baptism. But then in the same way, he's not just referring to that, he's referring to what it is that baptism means, to what it is that baptism is manifesting in the world. Because he says, you have to be born of water and spirit. That is what happens in the story of Christ's baptism. He descends into the water, and when he comes out of the water, the. Then the Spirit comes down upon him. And so the first thing in the image of baptism that has to happen is what happens at first. Saint John, what Saint John is doing, Saint John is clearing the way, right? Saint John is the one that baptizes. He's clearing the way. He's making a level. He's removing the old structures, he's removing the old things, and he's making the world level. He's making things straight, paving the way for the Lord to come. And so that is the first part of the process. You have to remove the old things, and then you have to be born again of the Spirit. You have to be born again from heaven. That is, you have to receive a new identity which comes from above, a new connection which comes from above. And so that is exactly what Christ is saying that needs to happen now. This has to happen at every Level, right? It's something that happens at every level of reality, but has to happen if you want to see the kingdom of heaven, if you want to be in the kingdom of heaven, if you want to participate in the kingdom of heaven, you have to remove the old kingdom, and then you have to be connected to the new kingdom, which is the kingdom of God. And so what's interesting about what happens, of course, the way that Christ reveals it is that it is happening at every level. It has to happen at every level of reality. And so it, of course, has to happen internally. And this is usually the way that a lot of kind of modern evangelicals will deal with it. They say this thing has to happen internally. That is that you have to remove the sins, right? You have to confess, confess the sins. You have to kind of remove the old man, and then you have to attach yourself to this, to the Spirit, you have to attach yourself to that which is above, and then you can live in the kingdom, and then the kingdom will be manifested within you. Now, that is of course true, but it also has to happen, you know, in terms of your actual participation in the Church. And so you have to actually be baptized. That's why Christ is actually baptized, even though Christ didn't need it. Christ is actually baptized. To say, for this to happen, it's not just about a kind of mental game or a mental thing or just a conviction. You also have to embody it in the world by being baptized and by receiving the Spirit from above. Now, in Christianity, this has become two sacraments, which is the baptism and Chrismation, baptism and confirmation. That is, there's a baptism from below, and then there is this receiving of the anointing right from above, the receiving of that which comes from above. And this, of course, in Orthodoxy, is seen as what we call Chrismation, which is an anointing on the person's body, which is this image of light which comes down, which influence which comes down from above. And this has to be, let's say, connected with an actual participation in the body of Christ, in the body of the Church, and an actual connection to an authority which is the fractal representation of this whole thing. That is, you can't just be on your own. You also have to have someone who is manifesting this authority of God down upon you that you participate in. And so you can see that the simple little verse of Christ is representing not only the way that we are transformed and enter into the kingdom of God, not only the way that we do it internally, externally, by actually being Baptized and by receiving the spirit. But then it is really just once again an image of everything, an image of reality. And so, you know, if you want, if you want to make a meal, that you also have to do that. That is that you have to level the ingredients so that they become a kind of potential for the recipe. And so you have to remove the peel, you have to take away the stems, you have to take the bone out or remove the skin or whatever it is that you're doing to the ingredients. And then you have to align it, attach it to an identity which comes down from above. That is, whatever it is, the recipe that you're doing will then create the kingdom of that recipe within, you know, that you're going to make. But that's true of anything. It is just an image of the revelation of how reality works. That is, if you want to participate in any kingdom, in any form of, of participation, whether it's a family, a team, anything, then this is the process. There has to be a baptism, which is that you have to remove your attachments to the things that came before. You have to level the remainders of those of. You have to clean out the remainders of your previous attachments. That's the same thing that happens if you start a new job. You have to cut your attachments to your old job. You have to, you know, take your things out of that office, you know, take the, take all this stuff out so that you're not, you're not connected to that ancient identity anymore. And then you have to come out of that transformation process, come out of the waters and receive the new identity that you're going to participate in. So hopefully this is helpful to understand that like I say over and over, Christianity is revealing to you the pattern of reality, of how it is that complexity works, how it is that any type of unity and multiplicity cohere. But that also means that you, you know, it is calling you to actually participate in that in a real way, which is, it's not just showing you the pattern of reality abstractly, but calling you to be baptized, to be Chrismated, and, and to enter into the kingdom in a very explicit, practical way as well. And so I wish you all a blessed theophany. I hope that this was helpful to you and thanks for your support, everyone. I really appreciate it in these strange times. And I will talk to you very soon. Bye bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support. I want to invite you all to the very first Symbolic World Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing Mythology Father Stephen DeYoung of Lord of Spirit fame. There will be Richard Rowland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt Poor Robbins. This event will be the chance of a lifetime to capture and embrace our current moment. So Join us from February 29th to March 2nd, 2024in Tarpon Springs, Florida. Visit thesymbolicworld.com summit for more information. I will see you there. So they brought their boards to pen the wings and bodies of Aga."}
