{"episode_id":"SW - #105 - 2020-06-21 - May Q&A","start":12.56,"end":6800.48,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. It's good to be with everybody. I hope you're all doing well in this strange times and this strange confinement mode. As we kind of feel like the confinement hopefully is ending. I'm seeing around me people just starting to live their lives again, you know, seeing stores open, seeing restaurants open and kind of put tables outside, you know, and everybody kind of pushing the limit a little bit. So I hope everybody's doing okay. And if not, you know, at least we have this weird online space that we can kind of connect with people and. And talk about how crazy these times are. I thought I knew 2020 was going to be crazy, but I really. I didn't think it was going to be this crazy. So here we go, guys. A few little news items. As you know, on my website now, we are posting articles. We have several people writing articles on symbolism on different strains, different aspects of symbolism. It's been really great. People have been stepping up. The articles are wonderful. Was it today? I think it was yesterday. Yesterday, Nicholas Kotar, who's been on my channel, posted an amazing little article about fairy tales and. And the situation right now and the clampdown and vaccine. So I think it's called something like, you know, why fairy tales might be better than vaccines. So check that out and check out the other articles that are there as well. People have been putting some great efforts into that. And so what else is going on? Well, the. My graphic novel that I'm working with, with Corn Nielsen, we. We are really moving along on that. On. On that. On that front, what's been great is that that this has actually been positive. Like this weird clampdown has been positive because. Because Cord is working from home, then he has a bit more time to work on the pages. So we've seen things come kind of speed up. We might have found our colorist. I put out on social media a few pages. I think I put out one page that he colored, which was just beautiful. I don't know. His name is Felipe Carton. I hope I'm pronouncing that right. And I think we're probably gonna go have the colors done by him. Unless something happens and he doesn't want to do it or doesn't have time or whatever. But for now, we're pretty excited about what he came up with in terms of color. What else is going on this month? The. The May patron only video is a kind of deep dive into Dante and the Divine Comedy. And I did it with a scholar from McMaster's University who's an expert on. On Italian culture. So we kind of dive into Dante and talk about the. How this universal pattern appears in the comedy and how it's related to other writers, such as, of course, a Gregory of Nisa and Senate from the Syrian, but also some Muslim authors like Ibn Arabi, who wrote a similar text about a century before. So maybe a bit less than a century before. So. All right, so we're gonna, we're gonna go, guys, we're gonna start as usual. What do I usually do is I start as, you know, people who support me. $10 more. You get to ask questions in advance. And I'm gonna go through the questions on my website, on Patreon and on subscribestar, and then when we're done, I will go through the super chats and see what's there. Sadly, I know a lot of people might be annoyed that I not answering questions directly from the chat. It's just, it's just too hard and too much these questions that are coming in. I already, I already have like almost 30 questions in the. The advanced question, so it's hard to answer anymore. So sorry about that, guys. All right, so here we go. Okay, so first question on my website. So Bogdan asks. Thanks for doing these Q and A, Jonathan. They've been so helpful for me and my and many others in the last few years. Thanks. My question is, is it incorrect from an orthodox Christian perspective to venerate pagan gods spirits in the same way we venerate saints through icons? I have recently been thinking that the first commandment does not deny the existence of other gods, but rather states that we should not worship these gods as the highest. In your talk with Benjamin Boyd's on Art and Orthodoxy, you said something similar when addressing Jordan Peterson's tweet about the nature of God, that these God spirits exist sometimes as principalities and have consciousness and personality. In that case, how should we behave in regard to these entities? Can you point me to some writings of theologians or church fathers on this subject? Thanks again. So the way to understand this is that, no, you should not venerate pagan gods and pagan spirits as a Christian, because these gods, they are. I kind of, sometimes I use the word wild principalities, you could say demons or principalities that are not connected to. That are, that are not connected to the main narrative, that aren't connected to the story, you know, that are fallen principalities as a Christian. And so, and so the best way to understand it is that we, as Christians, we do have the notion that there are principalities that order the world and that act as, let's say, as patrons for different aspects of reality. And, but these are angels, right? They're, they're, they're angels. And so in the Christian story, you have the idea that there are angels which are submitted to the highest God and who are, you know, are submitted to God and so are acting according to his will, manifesting the will of God. And then you have the idea that there are also fallen angels or demons or principalities that are creating parallel hierarchies that are, that are, or creating upside down hierarchies that are taking power for themselves, that are trying to attract power to themselves, Something like that. And so the best way to understand it is that we're not meant to venerate these smaller things. We can recognize God in his angels. We can see God in his angels. There are a few angels in the Orthodox Church to which we, that we venerate, that we ask for intercession. These are usually angels that have manifested themselves explicitly in Scripture, but we tend not to emphasize that too much. And it can get, it can get tricky when people do that, you know, because it, it creates this strange kind of angiologies and, and it also usually ends up looking like magic somehow. And so the best way as a Christian is to venerate the, the angels that are recognizing tradition as being legitimate angels because we have manifestations of them in Scripture or, or very strongly in tradition. And then, then you can venerate the saints because they are also acting as principalities to a certain extent, that they are reigning with Christ. And so in the Catholic Church, you see a little more, because in the Catholic Church you really have this idea that saints become patrons of certain areas of reality, that, that as we are the body of Christ and that we are ascending, let's say, into Christ, that we are becoming like Christ and we are also reigning with Christ, that we, you know, Christ talks about that. The idea that, you know, that the disciples will be reigning with him, you know that in the kingdom. And so you can see that in the notion that then saints will become according to their story, according to their own pattern, then they will become patrons of that pattern of that aspect of reality. That's a little more, you see that more in the Catholic Church. In Orthodoxy, it's, it's more fluid. It's not as systematic, just like everything is not as systematic in, in Orthodoxy as it is in, in the Catholic Church. So hopefully that answers that so asked. Did you ever have a red pill Moment in regards to symbolism. Of course. Yeah. And I think I mentioned that before. I mean the moment that really shifted me is, you know, Matthieu, my brother and I, we were reading different things. We're kind of on different sides of the question, reading different authors, different, interested in different things. And then one day Matthieu read a book called the Crisis of the Modern World by Rene Guinon, who's a French author. And he, he just said, Jonathan, you have to read this book, you have to read this. And I remember when I read it, it just, it really was like a red pill moment. It's like it just reading that little book's not very long and it could have been written yesterday to be honest. It just change the way I thought. I could just feel it happening as I was reading the book. It was completely just shifting my mind and. Yeah. And then there was just no looking back from there. And I mean, since then I've kind of distanced myself from that author. But nonetheless, I have to admit that it was by reading him that that it started. So. So what is the symbolism? David Flores asked what is the symbolism of hot and cold water? So this is something, I was talking about this today. I was Talking to Neil DeGray today, who's in the chat as Dirt Poor Robbins. And we were talking about, I was trying to, trying to explain the issue of. And it has to do with this, this question of fractal. So what happens is that every aspect of reality has, although it manifests something, there's also then you, when you go inside it, then you can find subtlety which will divide into different aspects. So it's the same with something like fire. So fire has light, but it has heat. And those two things act as complementary. Right. And so it's the same if you have something like cold water and hot water, then the cold water is more akin to, let's say water. And then hot water would be more akin to light or more akin to fire, you know, but it's not the same. But it's just that in the symbols of water, it separates again into two. So that is the best way to understand it. And so you can understand that for example, water, water dissolves and fixes, right. Depending on the circumstance. But if you separate it, then you can see that water, when it's cold will fix, when it's hot will dissolve. And so you can understand that fire also does that. It also fixes and, and, and dissolves depending on the situation. And so you can go into this, to the symbolism and you can tend to, you can separate it into different, more opposites within the. The thing itself. So hopefully that makes sense. All right, so Josh the mover says, what do you make of the end is night section of YouTube and that whole mindset, I presume they are the clock. That's correct twice a day. But then, Alex Jones predictions come true more often than CNN predictions do. Strange world. If we're truly in the upside down clown world, is it perhaps time to make the fringy. To take the fringy doomsayers seriously? The thing about, the thing about the kind of end is nigh aspect is that the, the pattern by which these types of stories or these types of perceptions present themselves is usually not totally off, right? It's not totally off. It's just that sometimes it's taken so explicitly that it ends up being strange. But you know, for example, you know, I've. I did a video on, on 666 symbolism. And some of it I could see that the intuitions that when I was younger people were having about the idea of a microchip or the idea of, you know, that you would have a code bar. When I was younger, people would say like, oh, they're going to print a code bar on your hand or your forehead, you know, that they'll scan. And so it's like the actual predictions are often a bit off. But the intuition of the idea of something which is calculating you, something which is accounting for you completely, that you're, you're all of your being reduced to a number is something which it seems like it has, it has a right intuition. And so there's a lot of that going on right now. Like a lot of the weird conspiracy theories that are coming out really regarding the situation right now, a lot of them are excessive in their details, but are not necessarily excessive in their intuition about the pattern. And so, you know, there's some. There's some things which probably if I talk about, I'm afraid that I'm just gonna get. I'm just gonna get banned from YouTube. So many videos have been. Are being deleted from YouTube if they say certain things or if they talk about certain things. But I might. I'm not sure how to deal with this. But there are some of the intuitions people have had about, you know, about the founder of Microsoft and his attempts, you know, to get involved in this. There are some intuitions about that in terms of the way that they're thinking. The problem of. The problem of the supplement. And I talk about the problem that the positive aspect of the garments of skin. I talked about the positive aspect of vaccines. But there's also a negative aspect and there's also a negative aspect of this adding of layer of death on the outside. It's that it's also the place in which something from the outside can come in. Right. It's also the. The darkness of this layer on the outside is also a place of subterfuge. It's a place of trickery. And so, so the way that people are thinking about it is not completely off. Right. And so it doesn't mean that that's exactly what's happening or that people can guess the intentions of everybody. That's what I often get annoy me about a lot of these theories is the way that people somehow without the information they, they. They tend to guess the reason for things. But like I said, a lot of the intuitions are right. So I might make a video about this at some point and just take the risk that that YouTube's gonna ban it, but we'll see. Or maybe I'll make it put it up on Bitchute and then try to spread the link around or something. But. But right now I. It seems like there's very little point in doing that. I'll just get. I'll just get banned. So. Yeah, okay, so I was talking very and kind of very dark in a so terr. Only people that have been watching my content for a while are probably going to understand what I just said in my last answer. But you know, sorry guys. For now that's what, that's what's going to happen. All right, so Luke Fleischmann says. Hey Jonathan, thanks for everything. Maybe a silly question, but I was curious if there are similarities between the giants, Nephilim and the fool and if there are, how might they intersect? I have some thoughts on this, but curious on what your take is. Thanks. Well, I mean they intersect in the sense that the, the Nephilim are in a way they're an excess, they're a monster, they're an exception. So that is something that you find in the fool or the clown. This idea of being exceptional and, and of being, you know, of being a caricature of something. And so the Nephilim in a way because they're too big. The idea of giants in general, but it's not just giants. Also, all the whole symbolism of giants or dwarves, like those usually are the same symbolism. It's just a, just like an excess in one direction of big or an excess of small. Like the idea of a caricature of a. Of a. Of a. Of a person. And. And so that is something which is related to the fool as well. All right, so Keenan Cronin asks, what do Paul and the Fathers mean? That we should pray without ceasing or continuously? It seems linked to Adam's walking with God in the garden. But do you think it's ever possible to get to that point in this life where we are truly praying without ceasing? I mean, some saints have definitely reached that. I. Not myself, but the whole idea, the whole practice of hesychasm and the practice of the prayer of the heart has to do with the. This idea of praying without ceasing. So when you look at what some of the hesychastic fathers talk about, the mystics of the Orthodox Church, they have this idea of the prayer of the heart. And so the notion is to pray first consciously. So they pray a. It's a. It's a simple prayer. It's Lord Jesus Christ, the Son of God, have mercy on me, a sinner. Or sometimes it's shortened to just Lord Jesus Christ, have mercy on me, or sometimes just Lord Jesus Christ. But the idea is that there's a. There's a basic prayer which is structured. It's structured as the pattern of reality. Maybe one day I can do a video on that. But it. It's structured in the sense, it's structured as a rhythm. So it's like an. It's like a. It's like an opening yourself up, ringing in, and then also then kind of asking forgiveness for, For. For your incapacity, let's say. So it's like a. It's like a up and down. Anyways, the point is that the saints, when they pray that they'll pray it. Like, they'll pray that prayer and then they'll make it fit with their breathing. And so they pray and they breathe at the same time. And then what you see in the text is that at some point the prayer enters into the heart, which means that the whole being of the person becomes prayer. And so they. At some point the prayer becomes like the pattern of all their actions. And so behind all their actions, there's this basic pattern that has been written on their hearts. And then everything they do becomes a version of the prayer. Every action they pose becomes a repetition of that prayer, and their whole being becomes prayer. And so that's what you see. That's what you see in the text, that's what you see in the descriptions of those that have been transformed that way. And so I think it's possible because we have many testimonies of people that have gone through this transformation. But it is not easy, and it is not something that you should go about willy nilly. And it's something that you need someone to guide you on the path, too. All right. Okay. So Eddie T. Asked, why in the Bible do some men, such as Job, render their clothes and shave their heads when they get bad news? In that sense. In that sense. I've talked to you about how nakedness is. There are two nakedness. There's two versions of nakedness. There's two versions of nudity. There's one version of nudity, which is the nudity in the garden, which is innocence. Nudity of innocence. And then there's a nudity of scandal. And the nudity of scandal is. Well, it's mostly, you know, the nudity that you would experience if you went outside and took your clothes off. And so you see that in the story. I've talked about this before as well. You see that in the structure of Genesis, where you have Adam and Eve that are naked in the garden, and then they fall, they have to cover themselves. And then you have the whole story. You have the flood, and after the flood, you have Noah, who gets drunk and removes his clothes in his tent, and then his son sees him naked. And that is seen as a shame, as something that's a shameful nakedness. And then in scripture, you'll see all these references to the idea that you should not see the nakedness of your father or your mother. And. And so this idea that if you. Let's say, like, if you have intercourse with your father's wife, you know, or your brother's wife, then it's seeing the nakedness of your. Of your brother, right? And that is a form of shaming. It's like you're entering into a shameful. A shameful revelation, okay? Something like that, right? And it's the same reason why we. We hide the two opposites. Like, you hide the. You hide this mystery that's in the cup in the altar, right? You hide that mystery. Those are the things you hide, the mysterious thing. But there's something else you hide. You also hide. When you go to the bathroom, you hide that stuff too, right? And so there's this weird thing about the two extremes, right? And so when you see characters that do things like. Like rip their clothes off, shave their head, put ash on their head, it's to signal. To signal their lowness, to signal that they are really, really at the bottom right, that they are. It's almost like they're shaming themselves. They are, they, they are doing it to, to annihilate themselves, right? To kind of annihilate themselves in front of everybody. It's something like that. And then you see that in, in, in Christianity you see moments where that same action of rain of like let's say removing your clothes in public, which is an act of shame, that that act is joined with the mist, the mysterious one. And then it, it's very odd, like saying France of his would do that, you know, and he would tell his, his followers to do that. When he started on his journey, he, he disrobed himself in public and he would ask his. And it was just to shame like it was for him to be, to be the lowest of the low. And in that descending, he was able to connect that with, with the highest. But that's. Yeah, that's tough. That's tough. Don't do that, guys. Don't do it with St. Francis did just. It's not. Most of the time it's not good. All right, okay, let's keep going. Okay. It seems a white ear to ask. It seems like modern non denominational churches view cultural relevance as an extension of the mission work of St Paul, who became all things to all people for the sake of the Gospel. These churches see themselves as speaking the cultural language in terms of music, visual art and branding, social media, engagement, etc. In your opinion, is there any merit to this approach as a church or is any step in the cultural relevance direction is a step away from what the church is intended to be? I wrestle with this question. Thank you for your thoughts. Now this is what I think about that. Now if you look at, if you look at early church, if you look at the early practices of the church, one of the things that they did was exactly this. They transformed Rome into a Christian city or a Christian, not just Rome, but Rome as a whole idea of the Hellenist, Hellenistic city. They transformed that idea into a Christian ideal. And they did that by taking the forms of the Romans and filling them with a new meaning. Okay. And so you can see for example, that the church structure, the basilica that the Christians use in the 4th century is a building that existed before it was like a public square building. It's kind of a public building that existed in Rome. And then the church took that symbolism and transformed it. In the basilica there was an axe at the end, just like in the church. And now the axe in the, in Christianity has taken On a whole more like a fuller meaning than was there in the Roman times. Okay? So, yes, that is possible, and that is exactly what Christianity does. Now, the problem with the modern way of doing it, and some people might disagree with me, but what I've seen is that it's almost like a, it's almost like a reverse. It's almost like an ups. It's like a weird reversal where it's not so much that they take the forms of Rome and they fill them with light, you could say it's rather that they take the light and they diminish it so that it's going to fit in these, these vulgar forms. And so that's why read, read a hymn from the 10th century and then read a hymn from, you know, some mega church. And it's embarrassing. Like, it is embarrassing to see how low the message has been dropped. It's, you know, you know, the joke in the Simpsons about, you know, it's just basically a, it's just basically a pop song. And you've just changed the word baby with Jesus. Like the, that's what it feels like. That's what a lot of this stuff feels like. It's like you, you reduce the light to make it fit. And I think that that's not the right way now. I, I, I don't think that it's impossible, like, I don't think it's impossible to fill these forms with light to a certain extent. I just don't see a lot of people accomplishing it. And I see, like I said, I see the opposite happening. So, you know, prove me wrong, guys. I'd be happy to see things transformed. Okay, so Tan Mooseman, what a name, asks what is the symbolism of wailing, mourning? And why in other cultures, specifically in the Bible, have there been professional whalers, mourners at events like funerals? This has to do with, it has to do somewhat with the symbolism. I talked about that someone asked about disrobing. You know, wailing is a form of noise making which manifests despair because it's not coherent. A whale is not musical. A whale is not, is not meaningful in terms of, of a song. So it doesn't have a, it doesn't have a rhythmic pattern. It also doesn't have words to it. It's like a, it's a moan. It's a whale. And so this moaning and wailing is, is a manifestation of the despair or a manifestation of the morning itself, right? Of this, this, this, this, this kind of moment, of this moment of realizing death. This moment of, of accepting death or, or dealing with death has to do with wailing, you know, and so I think that that's why, you know, and I think that it was important for people to, to wail and to mourn at funerals, to fully realize. Fully realize the, The. The. The moment. And I think that the idea of a professional whaler mourner was like. It was. It was almost like. It was like putting gas in the car. It was. It was like getting people to do it, you know, and so it just like, you know, it's not a. Have you ever been with someone when someone. Have you ever been in a situation where, you know, you're talking and things are getting emotional, then one person starts to cry, and then you can't hold it back, so then you just lose it. Right? And I think that that was the point of professional whalers is to. Because they thought it was important for people to cry and to. To. To mourn that they had. They had someone come in to like, jumpstart the process, to get. To get others to. To engage. All right, so I think we're done for the website. I'm going to move on to subscribestar. All right. And so Logos Living asks. Hello, Mr. Peugeot. Enjoyed your work for a long time. Can you explain the symbolism of saving yourself for marriage? Why is celibacy until marriage important for men? Apologies if you've already covered this in a different video. So, man, this would get tricky really fast. It's definitely. It's definitely a Christian thing that's really important to understand. A lot of people somehow think that this is a. This is like a universal biblical value. It's not. You don't see that at all. In the Old Testament. There isn't at all this idea of. Of at least men remaining celibate, you know, until marriage, that it was somehow important in. In. In the Christian tradition. You see in the works of the early fathers, the. The importance of celibacy has to do with the fact that we need to rein in our passions. We need our passions not to rule over us. And marriage is seen as a form of asceticism. This is something which a lot of people will struggle to. To understand, but that is the reason for. For marriage is to be. Is so that you bind your passions into one relationship so that they don't pull you in every direction. And so the idea of remaining a virgin until you're married is exactly for that reason. It's so that your passions are bound into this one relationship, first of all, so that you don't scatter yourself. You know, you don't, you don't have a wild scattering of your, of your seed in terms of your attention, in terms of your passions, in terms of all that. But then there's also the idea that in marriage, marriage has a sacramental purpose. And you also have this sense that the image of the bride and the bridegroom that you find in Scripture, that you. That are Christ and the church that St. Paul talks about now also enters into the symbolism of the, of the, of the marriage as well. And so in containing yourself and then being united with one person who is your body, then you are also participating in the pattern of the church itself. You, you're reenacting, you're participating, and you. And it's a form of spiritual transformation. So that's as much as I can say about that. All right, so, Nicola asks, zombie apocalypse trope seems like a mockery of Christ's resurrection in many ways. Yeah. Is there a chance that when people imagine zombies, they are actually making a subconscious effort to portray hell, they would find themselves in the Last Judgment. Is it possible that by marking the Christ's resurrection, zombie displays the flip side of it and only the flip side of it? It's a, it's a parody of the resurrection. The, the zombie is a residue of the resurrection. You could see it that way. The idea of the dead rising and the idea of the dead living again is really a Christian notion. Like the resurrection is really a Christian, A Christian notion. And so what you have in this is why, you know, you have to understand that because Christianity is a union of spirit and body. And that's why we don't like Gnostics, because Gnostics degrade the body. Gnostics degrade created things. And so Christians, no Christians believe that, that God and the world are meant to be joined together and that. And that the body is meant to be transformed and to be, to participate in the kingdom somehow. And so when Christianity goes awry, that's why it's something like Christianity, which also will give materialism because it's as if the, the value of the, the created world remains. You remove God, but then it starts to. It also starts to decay into fragment. And so the zombie apocalypse become the ultimate caricature, the ultimate, you know, residue of the notion of the resurrection. It's like a materialist resurrection. And it's. What it gives is a kind of living death. And, and it. All the tropes that I've talked about in my different talk. So, so that's how I see it. So, XRD asks, hi, Jonathan, do you have anything you haven't been asked about and you'd like to talk about? Maybe something that's too big for a tweet and too small for its own video. Take care. Well, I'd have to think about that, xrd, because I don't know, I tend to talk about things when I think about them. So I'll try to think about it until the end of this. If I think of something, I'll mention it. The Christian Chad asks, hi Jonathan, hope you and your family are safe and well. I see on the Internet a lot of discussions taking place saying things like, all bad ideas come from France. What? And I'm sadly sympathetic to this point of view. What is it that English speakers get wrong about French speakers? Oh, mercy. There are plenty ideas. There are a lot of bad ideas that come from France, that is for sure. But you know, there are plenty of bad ideas that come from English speaking world as well. You know, all of you guys, you know what, the 60s, that's your fault. French Revolution, we'll take that, we'll take that on us, you know, but it's true that a lot of the bad ideas came from, from France. Some people will say, though I, I have to say some people will say that the 60s were influenced by, by French thinkers that were, that were prevalent in France. Maybe, okay, we could maybe like Jean Paul SAP and all of those people. Maybe, maybe, maybe, maybe, maybe. But there is something about France. It seems like France went off the rails and it hasn't, it hasn't come back. But there, there are several Frances and that's something that people don't realize. It's kind of like in the U.S. you know, there is, there is still a counter revolutionary France. It's still there. There still is a, there still is a royalist France. There still is, you know, a southern spirit of objection to the revolution in the south of France, for example. It's still there, you know, and a kind of hostility towards the history of how French identity imposed itself. So, yeah, there are a lot of bad ideas coming from France. Okay, so Adrian Malion asks. Hi, Jono. Jono, long time listener, first time questioner. My, my question is about King Arthur, specifically the Round table. Is this not a problematic structure associated with oligarchy and democracy? Surely not fitting of a king who rules with authority? Is this an incoherence within the mythological structure or is this problem played out within the story? For example, is the lack of proper authority the cause of Guinevere's unfaithfulness. There is a hierarchy of virtue established within the story. How close the Grail knights can approach the Grail proportionate to their sin. But why is the hierarchy of authority in the story so mighty? So I would say that I don't think you're right. I think you're wrong in terms of the, the cause. It's. In the story, it's seen that the sins of the, of the knights and including the, the unfaithfulness of Sir Lancelot and the other sins that are, that happen. That happens. They're the cause of the disbanding of the, of the Round Table. Right? That, that the fact that the Round Table is broken or that it's, it's falling apart is, is seen as, as caused by the sins. And so the, the Round Table in the story is definitely seen as something positive like. So a way to understand that is to understand it in some of the words that Christ says. There's a place in the Scripture where Christ says, I no longer call you my servants, but I call you my friends. And this is a really crucial moment in Scripture and it's a crucial moment to understand the purpose of hierarchy and the purpose of this relationship. Ultimately, the purpose of God is to call us into participation with God. The purpose of Christ is that we be united with him fully to an extent, that he can call us his friend, that we are co rulers with him. And so now this is a tricky thing because you could say it like, King Arthur can have a round table and King Arthur can have this sense of an equality to the extent that all the people in the table don't take that for granted. So I, I always say something like, when Christ says to the disciples, I no longer call you my servants. I, I call you my friends, the disciples. It was true. And it created a weird kind of roundtable situation. But it would not have been proper for the disciples to say, my buddy Jesus, like some people do today. That would not have been appropriate. It's like the upper, the higher party is the one that calls you up to participate in their authority. It is not those that are below that are there to, let's say, jump up and take their place in the Round Table. And so I think that that's the way to understand the Round Table, to understand it that the union between the king and his knights was so perfect that the king was able to bring them into his authority and he was able to make them participate in his authority in a way that created this, this kind of, this kind of equality. And so you can see it, even this is going to be tricky for a lot of people. Maybe I might be pushing it a little bit, but you can sort of see that in the idea of the, of the Trinity itself, which is that there is this, this notion that there, that there is a hierarchy of, of roles in the, in the, in the Trinity, in Christ declares often that he is there to do the will of the Father, that he is completely submitted to the Father. But in that submission to the Father, there's, there's an equality also that is manifesting itself, you know, because he's fully, he's fully, fully manifesting everything of the Father. And so maybe that's the best way to understand it, maybe not. That's what I've got for you guys. All right. Okay, here we go. So Samuel asks how important do you think a good translation of the Bible is to symbolic understanding? Can we lose the symbolic pattern of a story to a skewed translation? And thinking of in particular traditional Jewish concepts like shiol and Gehenna, different translations for behemoth being water buffalo or wild beasts in Job or names for God like Elohim. Hope you are well, all the best Sandals. Yes, I, I agree. I think that, I think that the quality of a translation is extremely important. And so you will, that's why you will see for example, if you look at the story of the 70 of the Septuagint, you will see that, you know, according to tradition, the 70, the Septuagint was translated by 70 scholars and they all translated it on their own independently and they all came to the same translation. Right? So that's kind of like the, the, the, the tradition or the, the legend around the separate. But what it shows you is how important a translation is. That's why if you, you know, you've met English speaking Protestants, sometimes you'll find them who will say things like, you know, the King James is inspired, right? Or you find Catholics who say that too like that, that Jerome's translation is inspired, right? It's inspired by God. And so that's why, so it is, it's super important because it, it, first of all, there's a question of authority and second of all, there it will flavor the Christianity. You know, it will, it will affect the way that Christianity lays itself out. I think one of the advantages of the modern world, it's a disadvantage too, but it can be an advantage for someone who is traditionally minded and has, doesn't have the desire to undermine Christianity. Then some, something, you know, like Bible. The Bible websites that have, you know, that have transliterated versions that you can click and you can see the Septuagint, you can see the, the, the Hebrew with the English, and you can look at Strong's, Strong's definitions and all of that. It can be really useful, you know, because there are meanings in scripture that, that might have been veiled for a little while and that we can, we can notice, you know, and there are, there are modern translations today which seem to, to have ill intent in their translation or rather adjusting intent. You know, in, in, in Genesis, in the creation narrative, there's a place where, when God creates the, the fish, it says that he created the sea monsters. And the sea monsters is the, It's a word, it's a tannin, which means the sea serpents. And so in Genesis it says God created the sea serpents. The word means serpent. It's basically saying the, you know, God created the dragons on that day. And now in like, niv translations and all these, these new translations, they just write sea creatures, the large sea creatures or something like that. But you're missing the whole point if you don't, if you don't have the idea that it's a sea serpent and that it's a giant sea serpent and that other places in scripture that serpent, sea serpent is called the Leviathan, you know, and that these, these sea monsters. You're just missing the whole point. You're not, you're not going to understand what's going on in that verse. If you, if you miss that, it's not going to make you be completely out. I mean, you can still, you can still be a Christian and everything. It's just, it's just that you're missing out. All right. Okay, so Dorothy, KK asks. Hi, Jonathan. Thanks for all you do. I've learned really much since I follow you on YouTube. Have a question about the dancing sun miracle at Fatima and other Marian apparition places, I've been told. What is the symbolism behind it? It reminds me of John the Baptist dancing in the womb as Mary visits Elizabeth. One could call that first apparition of Mary as the mother of God. But why the sun? I don't, I, I'm gonna, I'm gonna betray how orthodox I am because I've never been interested in the Fatima, in the Fatima miracle. So I don't know what it is. So I don't know, like, I don't know what, what it is that happened. I'd have to look, I'd have to look at it. Because I don't know. Is, is it even recognized? Is it recognized the, the Fatima? I think it is. I think it is recognized. So anyways, I would have to look into it. I don't know, I don't know about, about that miracle. So I don't know exactly what, what it is and what happened. So I'd have to check that out. Sorry. All right, so I think, think I'm done with. I think I'm done with subscribestar. So I'm going into Patreon. Here we go. All right, we've got a lot of questions, guys. So. Okay, so Daniel DeMarco asks. Hi, Jonathan. Thank you for all your time and wisdom. Also thank you to Matthew. I'll try to pass that on. Is symbolic interpretation, in particular a vision of the structured reality, something we can apply to our everyday life. Can it help us when interacting with family, friends and co workers? Can it help guide our decisions and how we spend our time or the direction of our careers? If so, would you please give an example? Or is it just less exclusively a tool for seeing meaning in the Bible and other ancient or symbolic texts and that meaning in turn is what we apply to our everyday life? No, I think, I think that symbolic living, you could say it that way, is definitely a way that it's definitely something that you can use to, to structure your life and you can do it. It mostly becomes important to the, to the extent that our world has become so unbalanced, you know, and so wild that you. That we've kind of lost. We've kind of lost these basic things which ancient people used to take for granted. And so I do think that, for example, when I talk about the balance between unity and multiplicity, when we talk about hierarchy, when we talk about. I talk sometimes about how you organize a hierarchy in your home. Your home is organized as a hierarchy, that your world has this hierarchical structure. And so if you can live in that, it does a lot of things. First of all, it helps you to feel calm knowing that there's an implicit order that's there. But also one of the things that I'm trying to help people understand, even in when I talk about hierarchy is also the role and the purpose and the value of the margin. And so one of the things it can make, it can help you is if you are someone who tends to be chaotic and attracted to the margin, let's say it can help you understand why we do need these patterns of order. You need your home to have order to a certain extent. You need your family to have order, you need there to be hierarchy in your life. But if it's the opposite, if you're someone who is hyper organized in this, it can also help you to understand the. The need for this potential on the edge, the need to leave that be, the need to also engage the spice of life to a certain extent, and that this is also part of reality. So I do think that it can help you live your life. All right, so angel asks. I'm currently reading Christian and Oriental Philosophy of Art. After seeing it in your book recommendation list and re watching one of your older Q&As, you said that there were some things in it you found to be problematic and you didn't agree with my question. Could you elaborate? And what is the right mindset to have when reading that book in order to not get lost in the weeds or be misguided? Thank you. I'm not sure I remember what it is that I said. Okay. Yes. There are a few things in Kumar Swamy's vision that I don't totally agree with. One is he. He. He does have a tendency to. To favor the abstracting qualities of art. And so he tends to talk about. For example, an example he gives is he. He gives this example of a Maori chieftain who's asked to paint a self portrait of himself. And then another guy paints a. Draws a portrait of the same chieftain and the marriage chieftain because he's. His face is all tattooed. And so the. The married chieftain draws the tattoo on his face in a pattern, like a perfect pattern. And so it's like this abstract pattern with eyes, you know, and then the other guy does like a realistic portrait. And then what, what Kumar Swami shows is to what extent the Maori chieftain understands the transcendent and that he understands that his being, that his self, you know, that is, he would, you know, that as a. Something like his. His atma, you know, like his. The core of his being. How it's more important than the details or the, you know. And so I agree with that to a certain extent. But I think that in the Christian tradition, what we find is a balance between the two. So for example, in Islamic architecture you have like a square with a dome, right? You have an octagon with a dome. Whereas in Christianity you also have this pattern of the square and the dome. But then there's also room for, you know, improvisation within the, the very, very tight pattern. And so I think that, that I believe the highest form of art is the unity of the two and the kind of breathing in and breathing out. Relating to the abstract pattern. And then it's, it's kind of application to the world and it's, it's molding to, to the specific, the specifics of reality. And so that's one thing, but it's still worth reading. Like you know, you're not going to find a lot of, of theory, art theory books that are that interesting, you know, in this, in the sense. And Kumaswami is a genius like he was. And he was a, he was an actual genius. So he's worth reading. So Paul Dumas asked. Hi, I'm currently reading the Crisis of the Modern World. Strange, we talked about that before by Rene Guinon. After that I plan to read the Reign of Quantity and the Sign of Times and Symbols of Sacred Science. What should I be careful about and what should I pay attention to regarding reading to get the most out of it, in your opinion? So Guinot is. Probably had the best symbolic mind in the 20th century for sure. I mean his capacity to perceive symbolism is, is really unmatched I believe. You know, also because he's able to perceive all kinds of different symbolisms. Like if you see my takes, they're usually very space related. I usually use space related. Geometric symbolism is mostly what I tend to engage with. Whereas Guinot was able to view all kinds of aspects of symbolism that kind of escape me. Like number symbolism is something that I don't get into so much anyways, he was a genius, but he was also, he was also off on a lot of points and he was mostly off, I think on his desire to hit the. I think he was off in the fact that he was able. He didn't realize that what he was doing was going to bring about a kind of weird syncretism. And you can see that the perennialists, the people who kind of follow his writings, they become like, it's as if they're in another religion. It's as if there's this weird perennial religion and they, they talk almost with disdain about the actual traditions and they kind of, they think that they stand above all these religions and that they're somehow above them. And I find that really distasteful. I find it not only distasteful, but I find it, I find it bad for your soul. Like it's just not good. And so, so there's a lot of things that you know, gets wrong in, in that sense. You know. Also, you know, I think that I, I am a Christian. Like I think that Guino also had in him a strain of anti Christian thing that he took from his, you know, that he took from where he came from. He, he had backgrounds in occult stuff and in freemasonry and stuff. And so he had a kind of weird anti Christian, a weird anti Christian bent that I just can't, I just can't accept. I do believe that, that, that you do not have a higher mystery than, than the, than communion. That there just isn't. The symbolism is all there and I don't know how you couldn't see it. Like there is no, there is nothing that contains more than, than, than communion. So anyways, that's what I think. I think that he, a lot of people have said this about him. I think he didn't understand Christianity well enough. All right, so leftistness asks how do you know that Christian moral claims are based on a transcendent ethic instead of based on man's collected knowledge of what best allows them to survive their environment? Do you lose explanatory power when you try to describe that which is transcendent in material terms? If so, how do you rationally justify your moral positions? Well, I would say, I would say that Christianity isn't about ethics. I'm gonna have to just say it out. I mean, I think I've been flirting around this for a while. Christianity is not about ethics. Christianity is not. This idea that somehow religion is about ethics is just wrong. It's just not. That's not what it's about. I'm not saying it's unethical. It is. The basic of what we consider to be ethics today, I think comes from, comes from Christian understanding, but Christian. I don't think that Christians have moral claims. I don't. At least not when I look at Christianity through the lens of orthodoxy. I don't see moral claims. What I see, what I see is that all the law is, is resolved into two statements. Love God, love your neighbor. Right? And loving your neighbor is the means by which you manifest your love for God. And, and everything comes out of that. All of the moral positions will, will come out of that. That's what I, that's what I think. And so, and so the Christianity's. And so the rules are there to just point. Like all the laws in the Old Testament and all the laws in the, in the, in the New Testament or in the Church are there to, or point us to a way of being. Not, not a bunch of stuff you need that you're allowed or not allowed to do. It's a way of being that transcends any, any action or any question of what's right or wrong or all of this. Now I'm not saying right or wrong doesn't exist. It all, all of this is, is real. But that's not, that's not the thrust of Christianity. The thrust of Christianity is the transformation of people, of, of bringing people into the life of God, bringing communities into the life of God through the, the lives of the prayer, the, the, the, the love of the saints for each other. And that's what, that's what it's about. So, so yeah, so that's, you know, that might be a reason if you, if you, if you listen, watch my videos, you'll notice that I almost never talk about morality because I find morality to be, to be secondary to what Christian in, in Christianity. Like I said, I'm not saying that, I'm not saying that there aren't things which are moral or immoral. But that's not the, if you start with moral claims, then you, then you lose. You can't win. If you start with worship and you start with transcendence and you start with, with the desire to be united to the triune God and to be united to your neighbor in a manner which manifests the unity of yourself with God and even the unity within God himself, that then will create a moral world that will tumble and like come out as morality. You know, and like I said, there's, there are rules like there are plenty of rules in the church or plenty of, of rules that say this is a sin, this is not a sin, that's not what it's about. But it has to go, to go higher or else, or else it doesn't, doesn't matter. And I, and, and, and to, to remain in your question, I would say that that doesn't contradict the idea that it's also that, that it also reflects man's collected knowledge of what to allow for them to survive. I don't see, I see no contradiction in the fact that, that it would also manifest itself like that. Right. They're just, they're just different levels. All right, so Simone LaBerge says, could you talk about the dog headed St. Christopher? Thanks in advance. Well, I think I've talked about St Christopher quite a few times. So what I'm going to do is I'm actually going to hold back a little bit as I'm working on this, this comic book about kind of a very, very, let's say, loose retelling of the legend of St Christopher, I am going to, when I, when we get close to putting it out What I'll probably do is, is I'll make a bunch of videos talking about the meaning of St. Christopher. In the meantime, if you want, I wrote a series of article on, series of articles on the orthodox art journal called the Meaning of the dog headed icon of St. Christopher. I think it's called. If you write my name in St. Christopher in Google you'll find that article. I wrote two articles on the meaning of that. All right, so JL asks. Hey, Jonathan, I've been observing a recent increase in people engaging with the work of Oxford, England Owen Barfield. I was wondering if you have given any of his thought your attention and if so, how does it fit with what you study and teach, if at all? No, I have not read Owen Barfield at all and a lot of people are telling me that I should. So maybe I should. But no, I, I, I just haven't read Owen Barfield. So you'll just be another person telling me that I should, that I should read Owen Barfield. All right, keep going. Okay. Okay. Charlie Longoria asked, am I correct to separate the two beasts? God shows Job the behemoth and Leviathan symbolic representations of chaos and order. The BMW being order and Leviathan being chaos. No, I don't think that's right. I don't think that's right. I think the way of understanding the, the beasts is to understand the, the aspect of both the earth and the sea that are destructive or that are at the limit of what they are, you know, at the limit of what the earth are, is, and at the limit the sea is. They're both images of that. And so in a way they're both images of if you, if you, of potentiality, right? Of like raw potentiality that if you, that you can't control. Right. And so that's why they're kind of these beasts on the edge. And so that's true as much about earth as it is about ocean, as it is about the sea, you know, they're related in that sense. All right, so you could have, you could have beasts of, of the four elements, something like that. You know, you could have different beasts that represent the rawness of the, of the elements, right? The, the, the potentiality. All right, so Vic Serta asks, While reading Isaiah 14:9, I was confused to see a reference to thrones in Sheol, which to me implies a sort of hierarchical structure within the realm of the dead. What do the thrones in passage, in the passage mean? I'd have to read it. So it talks about the realms of the Dead below is all a stir to meet you at your coming. It rouses the spirits of the departed to greet you, all those who were leaders in the world, it makes them rise from their thrones, all those who were kings over the nations. So I don't know. I don't know if the. The purpose is really to. To. To talk about. I mean, you could understand it that. You could kind of understand it that way. You could kind of understand the notion that you have the throne below. And so the idea is that you have death below, you have the dead below, you have the. The. That which is. Is below and is stirred up as God comes. So God comes from above, right? And all that is below, these dead spirits, this death, all of this rises up in order to join with God, in order to greet God. Okay, so. So this has to do with the idea of the. Of potentiality or chaos at the bottom rising up, right? Of emerging. Let's use that emerging to meet the pattern. So. So it's like you pull the earth out of the ocean that God does that in Genesis, you gather the dead up, right? And then God comes down and joins with them. So you could understand that the imagery in this. So you have the dead below and the throne below, and those who are the kings of the nations are below. The nations are below, and they're. They're. All of this is below. And then God comes and all of the past and all of that is dead rises up to join, to. To be united again or to be. To find life again or to. To. So it just follows the same pattern of. Of creation. Just follows the same pattern of creation. So that's how I would. I would see it. So I don't think the idea is to show the hierarchy in Sheol, although I'm not against the idea of there'd be a hierarchy in Sheol, you see it in Dante, but. But rather it's mostly to understand that which is below, that which is dead, rising up, you know, from death in order to join with that which is above, you know, so. So a seed falls into the ground and then all this dead stuff that's there rises up, right? And then it joins with the seed. The seed forms it again, gives it life again. And then that earth, that dead stuff, becomes a tree, right? It rises up because of a pattern that a little seed that has a pattern in it fell into the ground and is. It is bringing it up into. Into a tree. So that's an example of that maybe give you. So that I'm always afraid because I always figure that you guys that have been watching these Q and A's, that, you know that I'm always talking about something, but sometimes I'm afraid, because the problem of religious language is that sometimes it becomes so internal that, you know, people forget that it's actually talking about something. So I. I have to remind myself to give you examples like that in order to. So that it's not just an inner discussion about scripture, but it really is about how the world lays itself out. So Sander Kudert asks, what are your main struggles at the moment? You guys rarely ask personal questions. Yeah, things are crazy. I mean, everybody has weird struggles right now because of this. This lockdown. But I think that, you know, I know you guys know about my. The flood that we had last year. So we're actually just started rebuilding our house two weeks ago. And so right now we're like, right into the. The thick of things. And so it's a bit crazy because, you know, I've had to borrow huge amounts of money, which is fine because I've always been dead averse, so I'm not in danger. But I did have to borrow huge amounts of money, so it's always stressful. And also, you know, right now, one of my best friends, one of the people that I love the most in the world, who's just an amazing. My cousin Pascal, who's an amazing Christian and wonderful father, just like. Just someone who you admire and that I've admired my whole life. And I. You know, we found out a few weeks ago that he had a stage four pancreatic cancer. And so that's taken up a lot of my, just brain energy and, and my prayer and my tears. So. So that's what I've been kind of. That's what I've been kind of dealing with. You know, he's young, he's in his 40s, and just hit like a, Like a, Like a freight train, you know, just trying to deal with that. So. So I'm gonna go see him tomorrow. I try to go see him as much as I can. He lives about an hour and a half away, so it's not that easy to get there. But. But, but, yeah, so those are the. Those are my main struggles at the moment, I would say, but more personal stuff. All right. And so thank you for your prayers, guys. Thank you. Thank. I see people in the chat are saying they'll pray for him, so thank you. All right, so Christopher Serretta asks. Hey, Jonathan. In a cut chapter from Dostoevsky's Demons Denialists privately confesses his misdeeds to the Holy Fool. The nihilist asks forgiveness and is surprised when the Holy fool asks his own forgiveness in response. In sinning, each man sins against all. Each man is at least partly guilty for another sin. It pains me to strip down such a beautiful passage, but the essence is in that one line. Is Dossier expressing a Christian concept here or is this more of his own philosophy? No, I think he is. I think. I think this is. This is really hard. It's hard. This stuff, this aspect of Christianity is hard because it's just really difficult to do. You read it all the time in the Church Fathers where they say, take other people's blame on you, right? And it's like, how do you do that? It's really difficult, you know, within the world of Twitter, like, who does that? But the idea is. The idea is that there is. This is the strangest thing. It's like that. The idea is that there is a strange power in doing that, like that. If you can take other people's sins on you. A lot of people will say that this is almost like blasphemous because it's. That's what Christ did. But there's something about how we can somehow participate in that, that we can take the blame and that when you. If you do that, if you do it properly, if you don't do it out of ill intent, then you can actually save people. You can actually. That you can actually participate in their salvation because that gesture will transform them, you know, and that. If you. Yeah, yeah. But that stuff is hard to think about because that's an aspect of Christ which is just. You can see it like, you can see because that's it. That's what Christ did. That's what Christ did. That. But it's hard to understand. I've never. I rarely find people that I felt when they're able to explain it in a way that is not just a weird. Like a weird magic trick or something. Like. It's not a magic trick. There's something about a deep, deep pattern about reality which is in that mystery of the capacity to take others blame on you and how it transforms the world. So. Yeah, okay. Robert Smith asks. Robert Smith. Sorry. Hi, Jonathan. I was wondering about what is the symbolism of Ecclesiastes 12. Remember him? Before the silver cord is severed and the golden bowl is broken, before the pitcher is shattered at the spring and the wheel broken at the well, and the dust returns to the ground it came from, and the spirit returns to God. Who gave it. Yeah, that's it. Like, that's it. Like, that's the symbolism, guys. That's. That's the. That's the. That's the. The symbolism of everything right there. It's actually a really beautiful little passage. So the idea is you have to remember. That's what forgetting is, right? Forgetting is the cutting of a cord. Forgetting is the breaking of a bowl. It's the shattering of a picture. That's what forgetting is. A broken wheel. Think about a wheel. So you have a wheel. You have a center, you have spokes, right? And the wheel, the outside of the wheel has to remember, has to stay connected to the center. The string has to stay connected to what it's attached to. The bowl has to remain attached together for it to hold what it's going to hold. And forgetting is the breaking apart of that. And so the idea and the ultimate version of that is to remember before the dust returns to the ground where it came from, that means you, right? The dust going back to the earth means you. Before you break apart, before your body dissolves, before the. The line is cut, you have to remember God. And that is how things stay together. That is how the world remains together. And when that happens, so when memory is lost, when the unity is broken, then the dust returns to the ground and the spirit returns to God. There's a separation of heaven and earth. So that's. That's it. Like, that's death. Death is the separation of heaven and earth. But if you remember God, that's when heaven and earth are united. And so it's a beautiful passage. All right, guys. So Justin Seligman asks. Hi, Jonathan, how do you see your Platonic Christian ontology work itself out in gender hierarchies, particularly those of husband and wife? I'm asking as a husband and father and as one who's tired of the ongoing complementarian egalitarian debate in Western Christianity, as I don't think either side has it right, I think. I think that it's. I've mentioned this before. I think that the Christian vision of hierarchy is not one which is not one where. Like in the. Like, for example, in the Hindu hierarchy, where as you go down, there is an absolute devaluing, right? As you go down, there's like a dilution as you go down. But rather the purpose of the hierarchy is so that that which is above loves that which is below and makes it participate. So if you can see. So you can see in the Bible, you'll see two images about the relationship between man and wife. You'll see a hierarchical relationship. You see that in St. Paul, and you see it, you know, in different patterns in the Old Testament. But you'll also see in Genesis the idea of, you know, the woman coming from man's side. And you'll find in the church fathers the talk of how, you know, the reason why God took the woman from the man's side is so that she would be equal to him. And so it's the same question, it's the same reality as the round table that we talked about before. It's the same reality that in the relationship between the husband and wife, the ultimate purpose is that it be like the round table, that the man takes his wife into his life in a manner in which they become equal. He makes her his equal. But it's not a revolutionary move. It's not. You owe me. Give me what I'm owed. Like, you know, I'm a, you know, you're not treating me the right way like that kind of that. So there's a. The purpose of the whole thing is so that. That is that there be perfect unity. And that that unity does end up looking something like equality. But it also. But it can't be an equality of, like I said, of quality, of revolution, like a revolutionary equality. So I hope this makes sense. Hopefully you can get it to make sense also in. In. Because I talked about the roundtable before, because that's what it. That's what it's. It's the same. The same pattern. All right, so Dionysus asks. Hello, Jonathan. Through contemplating the field of my experience, I can now see how it is in the most fundamental level comprised of the manifestations of logo meaning. I can also see how language, the word, can be seen as the point where a logos coalesces. But I can also observe that I'm contemplating something deeply new. Logo manifests to me before I attach a word to them. So it seems that though a logos is intertwined with the word, once it is defined before that point, it is still manifest and thus not always arising from the naming as such. How dependent is the distinguishing of logo to concrete language? Could you share your own observations? Thanks. Yeah, I think that's important. What you're talking about is important to understand. You know, when. When I talk about naming, you could use another word which might be better identifying. Right. Identifying is probably a better word than naming, though. Naming has value because in scripture there's this speaking out. And so what you're doing when you perceive the logo is identifying them, but it's a way in a matter of the giving of name. But it's. It doesn't have to be an explicit, like wording, but it has to be an identity giving or an identity realizing. Realizing of identity. Okay. Now another aspect of that which is important is that we need to understand that there is a sense of perfect language. You would say there's a sense in scripture of this direct language, which is the idea that when God speaks, then reality is that which God speaks. There's no. There's no distance between the word of God and the manifestation. And you, you get the sense also that when Adam named the animals, he was also. He was identifying the animals. Right. He was participating in their. The revealing of their identities. But modern languages are not like that. You could understand that, like modern languages are fallen or something like that. Then modern languages have buffers. Modern languages are systems built on systems built on systems. And so they are far away from the primordial language, which we can only imagine. That would be a direct naming. They're quite far. And we've taken them farther still because we have, let's say, all these languages which are built on systems built on different systems built on each other. And then now we have systems like computers, and then they have software and then hardware and software and then software on software. And so it's like all these languages just keep piling up. And so we get further and further away from the notion of a direct connection between identity identifying and the Logos. Hope that makes sense. That was a bit abstract. Sorry, but the question was abstract. So. All right. So A.J. del Torio asks, hey, Jonathan, I'm a Protestant who is beginning to appreciate the mystery of the bread and the wine. Sometimes I'd be curious to hear, to say more on with the rituals around receiving it in the Orthodox Church. So much of the liturgy consists of these practices. So if possible, I'd like to better understand the significance of them. Thank you. Sure. I mean, I. Hopefully I will one day. So much to talk about, AJ So hopefully I will get to more talking about liturgy. I. I've talked about liturgy, you know, here and there. But maybe one day we could do a deep dive into liturgical practice. So Armand Smith says, does it seem inevitable that as mankind, mankind loses its ability to properly lower heaven, as Matthew puts it, we build machines to raise ourselves further and further into the material heavens. I totally agree with that. I think that it is definitely inevitable. I think that one of the things we're seeing in modern techno society is definitely a Tower of Babel motif. You know, and you see it especially, especially in this weird AI idea. You know, the idea of. Of the. Of how AI will. Will become sentient and that AI will be. Become like, almost like a God, you know, and you can see that that's really what people think. And so I agree, you know, and I think that if you want to understand, all of it happened before, like the story. I mentioned this in a video which a lot of you didn't watch. It didn't get a lot of views, maybe because of the title. It was called How Art can Help Save the World or something like that. And I wasn't just talking about art in that video. I was actually talking about technology mostly and techn. You know, the idea of human building, human making, and how in the time of Noah you had a cycle of techn. Technology and that cycle led to the flood and now we're repeating the same cycle. Very similar. You know, it's like when. When someone like Sam Harris says that, that, you know, religious texts can't help us today because they don't talk about all the things we have to deal with. They don't talk about nuclear weapons and all the stuff we need to deal with. And I'm like, dude, you're wrong. The Book of Enoch talks exactly about all that. It doesn't have to talk about specific technologies to talk about the problem of technology and the problem of the modification of nature and what that leads to. So. So yeah, so check out that video if you are interested in that. All right, so Chasen Lindsay says, is there any significant difference between necromancy and the creation of golems or are they fundamentally the same thing? After hearing your description of necromancy and its relationship to archaeology, that is using dead residue as a means of. To influence the world, I can't help but see the creation of golems as just another version of the same process. The only real difference seems to be the physical materials used to accomplish the agenda. So is there a difference between zombies and robots? Would a cataloging history be a positive form of necromancy? If not there is any positive form of necromancy or gold making, I suspect the answer would look something like resurrection. Thank you for any insight into this. I think there is quite a difference between necromancy and the. The story of the golem. You know, the story of the golem is probably more related to. It's related to creating an exterior form and giving it a life. Giving. Giving it a. Giving it a life. And so it has more to do with creating a weapon. Or taking something from the outside and using it as a guardian. So let's say like a good example of making a golem so it doesn't become very abstract is hiring a bunch of northern barbarians, you know, in order to fight for the Roman Empire, right? That's the creation of a goal because you're taking some from the outside and you're trying to put enough of your life into it so that it will then defend you from the outside stuff. Right? Okay. So that would be more like the making of a golem. Whereas necromancy, it's not complete. I guess when I think about it now, I'm thinking it's not completely unrelated because there is an aspect within which that which comes from the outside is somewhat. It's kind of dead to you to a certain extent. It's not part of your, your identity. So there's something related to that. But necromancy seems to have the, the, a kind of subversive, A kind of subversive goal in it, you know, because it's, it, it is, it's like a, it's like the creation of a monster. So, yeah, you're right. So the idea of a zombie is better. Right. So it's like you, you, you raise this, these dead things and then they just start to, to eat at meaning and they start to devour the inside. Whereas the golem is meant to like, defend you from the outside, but not, not the necromancer. The necromancer, I think, is more like a, like a, is more like a cannibal, is more like it trying to eat meaning from the inside. That's as close as it's going to get. Weird, weird subjects to talk about. But. All right, so Dom Palermo says, hi, Jonathan. Considering Logos and the importance of the word of God remembering Christ silently drawing on the ground in response to the accusers of the adulteress, and also silent on occasion in the face of Pilate and high priests. When asked for the truth, what can you share about the heavenly meaning of silence? What other images point as guides for when silence is appropriate or inappropriate? Well, there is this idea that silence is higher than word like that science is this, that silence is the source of speaking. Right. And so that's why monks are silent. That's why, you know, and there's a sense that even if you speak like you would have to speak out of the deep silence, like that's where you would have to speak out of and not out of the chattering voices that are in your mind, you know, like the Chattering thoughts. And so silence is extremely important. It's extremely important. Now in the, in the face of Pilate, it's, it's a little more complicated because there is also something about how Christ in, in his ministry, there's like a dual aspect to him. Like, there's an aspect where he's hiding himself from. From the world. He's kind of hiding. He's hiding his true nature. And then there's an extent to which he's showing it in some secret moments. So I think that. And it has to do also with like, the danger of someone giving testimony for themselves. And so I think that there's something about how Christ remains silent is. It has something to do about his. How his divinity is hidden, is hidden in him, has something to do with that. So Luca Ascovic asks, what is exactly the meaning of the quote again? I tell you it is easier for a camel to go through the eye of a needle than for someone who is rich to enter the kingdom of God. Is it really that impossible for a rich person to enter the kingdom of God, or is there a higher symbolic meaning? I think there's definitely a higher symbolic meaning in terms of the camel, but I'm not going to go into that now. It would be really complicated. It's. That's, that's going into really complicated symbolism. But I mean, it's not, it's. It's not in terms of the symbolism. It's not that hard to understand. It's. The idea is that. So if you understand the world as a wheel or as a mountain or all of this. You know, I've talked about this in several instances where if you want to reach the middle of the wheel, you have to move away from the center. So there's a lot on the edge. There's a lot at the bottom of the mountain. There's a lot of mountain. There's a lot of stuff. It's big and there's quantity. So in order to move towards the kingdom of God, you have to. You have to eliminate. And so that's what's. So a rich person. It's difficult for them to do that because they're big. They have stuff. They have all this stuff that they're attached to. So all the stuff they're attached to, they can't get to the little point, the little hidden seed that is really the most important. The pearl in the field, the mustard seed, all of these images of the little. The little is like the mystery hidden inside the world. But in order to, to access that you have to eliminate, you have to cut out the fat, you have to remove the fat, or else you won't be able to identify the really important part. So that's where all the ascetic practices in the church come from. And it's important to understand that it's not wrong to be rich. And you'll see that later also in scripture, in the Christian tradition, it's not necessarily wrong to be rich, but it is makes it difficult because you have all this stuff that you're attached to. And so. But then always remember that when Christ after Christ says that, the disciples asked him, well, and then who can be saved? And then Christ says, what's impossible to man is possible to God. So there's, there's another mystery in that as well, which is that you could say something like, the whole purpose of God is also to get that camel to go through the eye of a needle to. Like that. That's also what the Incarnation is like. That's what the Ascension is. The Ascension is like a camel going into the eye of a needle. So there's a mystery. Like I said, I don't want to go into it too much, but in that text, there's a lot there. Maybe one day I'll write an article about it or something. All right. Okay. So Isaiah Hale says, why is an Orthodox like a pirate? Well, Isaiah, I know where you got that, which is that Andrew Gould, in my interview with him says that Orthodoxy is a lot like pirates. And I have to tell you, I disagree with him for as much as I love Andrew, which is why I said, like, oh, we'll do another. We'll do another interview and then I'll ask him to, to talk about that. But I don't agree, I don't agree that the Orthodox are like pirates at all. So I was really curious about how, like, what he meant by that. So, so maybe one day I will do my. Have my second interview with Andrew and then I can ask him why in the world he thinks that the Orthodox are like pirates. All right, guys, man, it's 10:40. It's late. It's late. It's late. All right, all right, so let's, let's go quickly into the, into the, into the super chats and see. Start with, make you. And I think I got the. I think I've got the right, the right one. Hopefully I'm not going into stuff that's not. All right. So I think it starts with Andre Johnson. For $5 USD, would you describe the afterlife? How would you describe the afterlife to a materialist. What's wrong with saying that death is just lights out? Well, I've never experienced the afterlife, so I don't know how I would describe it. I would describe it. I would. I don't think there's an afterlife. I don't, I don't know what that. I don't totally know what that word means. It's a very odd word. I would say that. I would say that life doesn't, Identities don't totally depend on. I don't know how to say this because I don't, I don't necessarily see this idea of the afterlife the way that like, like the modern kind of way of understanding it. Let me think about that. Let me think about how I would describe the afterlife to a materialist. All right, so cabal for $5 asked, could you elaborate on marrying the foreigner specifically as it pertains to a man marrying a female foreigner? Thank you. Well, yeah, in scripture you have the sense that if you marry the. A foreigner, then you are moving away from yourself, right? You're, you're bringing in outside influence and that, you know, in, in in Proverbs especially, Solomon warned against that. Like, warns against marrying the foreign woman, the strange woman he talks about because then the fruit he talked about, then the fruit of your labor will go to the corner, right? You can understand it. It's like you take something, you marry someone from the outside, but their attachment is also to. Is still to the outside. And so that which you hurt your children with her, and also your, the fruit of your work is going to tend to move out towards the outside. And so that can be extremely dangerous to, to. To your integrity. But there are also places in scripture where it, it can be also seen as the, the very capacity to move into the outside, right? And so, for example, when Christ marries the, the, the Samaritan woman, there's a scene in. When Christ meets the Samaritan woman at the well. There's a mystical marriage that happens in his relationship with him. It's hard to explain here, but the, the whole trope of the scene is related to how the patriarchs found their wives at the well. And then Christ off talks about, quotes almost the text in Proverbs, which talks about the foreign woman because it, in the, the text it talks about the foreign woman. Solomon says, keep your fountain to yourself. Don't let your fountain run into the streets, right? So he's talking about the problem of letting your water go out into the streets so that it's diluted that it Gets muddied or it goes out and you lose the purity of your water. Right. And so he uses that specific image to talk about not the reason why not to marry the foreign woman. But then Christ says, I will give you a fountain that will spring into eternity. And so Christ is actually marrying the foreign woman in that story. It's really crazy to realize that's what he's doing. But he's saying, I have a way to make you participate without me losing the value of my water. Right? That it will spring into eternity. And so that's the meaning of marrying the foreigner. It has both a positive and a negative. And it can still today, still be positive and negative. It's not a one way street in terms of that, that question. All right, so lessons for life for 666 pounds says, I heard a Nation of Islam leader claim the devil equals devalue. Is there any truth in this? And is the television tell lies vision? No, no, do not listen to the Nation of Islam leaders. Just don't. They, they, they are not serious. Very not serious. And so sorry if, if they're a nation of Islam and I'm sure there are no Nation of Islam people who follow my channel. But these two, the, these devil is. And value and the value devalue or whatever, it's just not, they're just not the same roots. They're just not the same languages. They're. You can't, can't just make up relationships of language like that. It just, it's not helpful. Tell lies vision. Sorry, man. No, that's when symbolism goes off the, goes off the, goes off the hinges in my opinion. All right, so, so David Furtado for 5 BRL. I know what BRL is. All right, so what is the difference between marriage in the Bible compared to marriage two today? What exactly is the meaning of sex outside of marriage? Man, you guys are, you guys are bringing me into troubled waters. The marriage in the Bible is basically you taking a wife that, taking a woman that does not belong to someone else. That's what marriage is in the Old Testament. It is a, it is a taking of a woman who doesn't belong to someone else and having a kind of covenant with her. Right? There's a promise, there's like a promise that I will take care of you. And so that's really what marriage is. Now. Marriage today in terms of the Christian marriage has a far more sacramental reality. And the marriage is seen as a manner in which to enact or to live out an aspect of the Truth of God. And so it's very different. And so that's why in Christianity, we have the idea that you shouldn't have sex outside of marriage. In the Old Testament, you. You didn't really have that idea. It's just not there. You know, there's a. There's a crazy proverb that says something like, where it says, you know, why would you go. We talked about the strange woman. It says, why would you go to the strange woman? Like, why would you go to the strange woman when a prostitute costs so much? You know, it's like it just wasn't. It wasn't the same. The same vision. Right. Whereas in Christianity, that would be completely unacceptable. Right. Because we really do view the relationship and the wedding relationship as a manifestation of the mystery of God and the soul, the mystery of Christ and the church. And so it's a way to enact the pattern at the different levels. And we believe that it is the way in which you will be transformed more fully if you live within that union, like a. That you live a form of promise within that union. You know, whereas in the Old Testament, it was. It was. This is. People are going to stone me for saying this stuff, but it's just. That's what was there. The Old Testament, it was the. It was the wife who was not allowed to, you know, be with another man. It. It doesn't seem to go both ways. Like, it just doesn't seem to go both ways in the Old Testament, but the New Testament and in Christianity definitely does. It definitely does. All right. Okay. So sad. Dab sav. All right. Great name there, my friend. So for $10 on order in chaos, Zeus justly exiled mamas from Mount Olympus after much haranguing symbolism happens. Well, all right, so Chandler Turner for $2 says, have you read Nietzsche? If so, any thoughts? I have read Nietzsche, and it would be too complicated to get into that here. Maybe one day I can do that, but I don't think I'm gonna get into Niji too much. I mean, I think Nietzsche is a. Is what he is. He said what he said he was. He understood the symbolism of. He understood what the symbolism of the modern world was, and he embodied it like he of all people. He understood what materialism meant, he understood what it led to, you know, and he lived it out to his own madness. I have to say, sadly, so. Sadly. Whatever. Jimmy D thing. All right, I'm out of control here. Jimmy d. Thing for $5 sa lent. So Easter, Passover and Ramadan all took place during the Quarantine this year. That doesn't seem like a coincidence to me. Is it providence? I would say that it should be. Like. I think that hopefully people took it as providential, no matter what the intentions or no matter what other things are at play within this quarantine. But hopefully people took it as a time to renew in prayer and to. And to understand what's truly important. You know, hopefully that's what happened. All right, so Brad's Pit for $20. Brad's Pit is always there. What are your thoughts on flips without repentance? God, eg. Soviet Union restricting divorce, abortion under Stalin. Is that the spirit of Antichrist we talked about in another video? A moral order from experience, not God? I mean, the thing about, let's say, something like the Soviet Union. There were things in the Soviet Union which were not bad, you know, and so if, like. So if you restrict divorce and abortion, then, you know, that was like, it maybe an excess of order and a desire for society to function well. And so it might have been motivated for. For bad reasons, you know, but the. The problem of, like. Yeah, so. So a good. A good. I think you've got it right in your thing, which is the problem of moral orders. We talked about this. Like, the problem of ethics is the delusion that that's enough. Like the delusion that if we have an ordered society, that if we can find the rules, that order society, that that will be enough to preserve us. But it's not. It isn't. Ethics are not sufficient. Morality is not enough for the world to exist. Morality has to be pointed up towards something more. So. So, yeah, yeah, I feel like I'm getting myself. I don't know. I feel like I'm getting into trouble in this Q A for some reason. All right, I think this is going to be the last one, guys. 11. I can't believe I went for two hours. Usually I can't deal with two hours. So this is gonna be the last one. All right, so shot in the dark 90 for $20 says you said that the revolutions devour themselves. They. A nation whose identity and origin is wrapped up in revolution, destined to destroy itself. According to this pattern. Is perpetual society, social decay, a future rather than a bug? I think so. I think that. That nations based on revolution are going to destroy themselves. That's for sure. According. Yeah, I think so. Now it's perpetual social decay, a feature rather than a bug. I would say that it. It is to a certain extent. I think that it's the pattern of. The pattern of Decay is one which is always gonna. It's always there. It's not going away. You know, the idea is how can we minimize the. The. How can we minimize the. The. The excess of the pattern? Right. Can we avoid the really high highs and the really low lows? Right. How can we avoid things breaking down completely? So, you know, you see, you see that the totalitarian states in the 20th century just completely fell apart, you know, without much of a residue. And so, yeah, there's not. That's. The idea is to avoid that. To find the balance between unity and multiplicity, find the balance between order and freedom, or order and forgiveness or, you know, a kind of malleability in order to prevent the major breakdowns. But it's a feature of the story. It's not. It's there, you know, the idea that things are going to get worse and then there's going to be an end and then there's going to be. Is there in the story. It's there in the Bible, and it's there in other cultures as well. So it seems to be. It seems to be. It's not going to be going away. All right, everybody. So, man, I think this is the longest Q A that I've ever done. I can't believe it. So hopefully I haven't alienated anybody beyond belief here in this, in this last Q A. I'll have to listen to it tomorrow. And I appreciate everybody, I appreciate you guys being there. And I. Everybody who's been supporting me in the last few months, I've just been astounded and just so grateful that people, despite the chaos, despite the madness, that people, despite that, still want to support what I'm doing. So I want to say thanks. I want to say thanks to all the moderators who are there and who are going through all the insanity of the chat. And I know that sometimes they can't even follow discussion because it gets too crazy. And I know that some people, like Lisa, for example, is getting up at three in the morning to be a moderator on this. So I appreciate that. And Brad Heisman, who is for the first time a moderator, but who's been a moderator on the Facebook group for a long time. So thanks, everybody, and I will see you again next month. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
