{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":0.64,"end":11.2,"speaker":"Jonathan Pageau","text":"So since last year, I've received many emails probing the question of symbolism and its relation to the Christian's insistence on the historical existence of Christ."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":12.64,"end":14.64,"speaker":"Jonathan Pageau","text":"Just last week I was sent something."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":14.64,"end":140.97,"speaker":"Jonathan Pageau","text":"Which summed up much of the issue. And so I'd like to read the main parts of this letter that I received last week, and then I'll try to answer some of its concerns. This is Jonathan Peugeot. Welcome to the Symbolic world. Okay, so I'm 20 years old and I spent all of my grade school years at a fundamentalist evangelical Christian private school in Fort Worth, Texas. There I was educated and immersed in a deeply conservative theological tradition. However, after I graduated, I began to doubt my faith and progressively adopted a rationalist, positivist worldview and became an atheist. I had been an atheist for a little over a year when I came across Dr. Peterson's lecture videos. And with those, your videos. Dr. Peterson's perspective opened my eyes to a very different, essential conception of religion from the one that I grew up with and helped me rediscover a sense of meaning and purpose in my life. After wandering aimlessly as an atheist, I had begun reading other great thinkers to help further my newly developing understanding of religion and Christianity, like Carl Jung and William James. Here is where my problem begins. I would now say that I certainly believe in God an objective morality. I would also say that I believe that Jesus Christ is the Son of God and the source of salvation. But I think perhaps that this is true in a symbolic sense rather than in a physical, literal, historical sense."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":141.61,"end":143.09,"speaker":"Jonathan Pageau","text":"More and more, I am convinced that."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":143.09,"end":162.47,"speaker":"Jonathan Pageau","text":"The symbolic reality actually points to the truest reality. But this conception is difficult to square with the way that most people interpret Christianity. For example, my peers and teachers from my old school would not consider someone with these ideas a true Christian, because."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":162.47,"end":164.79,"speaker":"Jonathan Pageau","text":"To them, salvation depends on a faith."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":165.67,"end":188.62,"speaker":"Jonathan Pageau","text":"In the literal life, death and resurrection of Christ. I noticed that this specific point was also emphasized by one of your fellow speakers, Fr. Theodore Paraskevopoulos, in the Resurrection of Logos Talk. All this being said, I'm just trying to learn, and I know that my overall grasp of these things so far is totally miniscule."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":189.18,"end":190.94,"speaker":"Jonathan Pageau","text":"This leads me to the questions I."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":190.94,"end":192.5,"speaker":"Jonathan Pageau","text":"Have for you, if you're still willing."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":192.5,"end":193.74,"speaker":"Jonathan Pageau","text":"To try to answer them."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":194.38,"end":199.58,"speaker":"Jonathan Pageau","text":"1. In your view, what beliefs really make someone a Christian? 2."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":199.98,"end":201.46,"speaker":"Jonathan Pageau","text":"How much of the Bible do you."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":201.46,"end":203.98,"speaker":"Jonathan Pageau","text":"Think is symbolic truth versus physical fact?"}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":204.3,"end":204.7,"speaker":"Jonathan Pageau","text":"3."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":205.26,"end":217.55,"speaker":"Jonathan Pageau","text":"Do you personally believe that Jesus lived historically and physically rose from the dead as told in the Gospels? 4. If you think that the Gospel story is symbolic, how do you get along with your Christian community."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":218.11,"end":220.99,"speaker":"Jonathan Pageau","text":"And lastly, five, for what reason do."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":220.99,"end":240.64,"speaker":"Jonathan Pageau","text":"You align with orthodox Christianity specifically? So I've seen similar questions arise around. I've seen similar questions arise around the type of questions that have been asked of Dr. Peterson. And I've seen on different study groups."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":240.64,"end":242.24,"speaker":"Jonathan Pageau","text":"That people have felt a bit confused."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":242.4,"end":246.64,"speaker":"Jonathan Pageau","text":"And frustrated by some of the answers, or at least felt like those answers."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":246.72,"end":250.4,"speaker":"Jonathan Pageau","text":"Didn'T fully answer their concerns."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":250.4,"end":259.52,"speaker":"Jonathan Pageau","text":"And so I'm going to try to answer this as much as I can, and I'm going to try to answer those, the questions that were posed all simultaneously."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":260.72,"end":262.56,"speaker":"Jonathan Pageau","text":"So I think that the problem firstly."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":262.56,"end":271.79,"speaker":"Jonathan Pageau","text":"Arises because we still hold on to a kind of symbol simplistic materialism, kind of 19th century modernism, which thinks that."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":272.27,"end":287.87,"speaker":"Jonathan Pageau","text":"The fullness of everything exists completely out there, exactly as we perceive it. A kind of neutral range of measurable phenomena which we can then add meaning to. So in this view, symbolism is opposed."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":287.87,"end":294.29,"speaker":"Jonathan Pageau","text":"Or at least it's divorced from this truly objective world. And if in stories and myths, in."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":294.29,"end":299.41,"speaker":"Jonathan Pageau","text":"Music or in art, we find these patterns of meaning, they're like an abstract."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":299.41,"end":303.37,"speaker":"Jonathan Pageau","text":"Layer that we, let's say, subjectively add."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":303.37,"end":306.93,"speaker":"Jonathan Pageau","text":"On to an idiosyncratic and random world."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":308.61,"end":311.97,"speaker":"Jonathan Pageau","text":"The problem is that that's just not how it works."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":315.17,"end":318.17,"speaker":"Jonathan Pageau","text":"The problem of believing we're only, let's."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":318.17,"end":320.93,"speaker":"Jonathan Pageau","text":"Say, enumerating physical facts in a story."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":321.17,"end":339.38,"speaker":"Jonathan Pageau","text":"Is problematic because there's constantly an overwhelming and seemingly unlimited number of facts all the time around us. When we look into the world, there is this field of potential being. And so we have two faculties that."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":339.38,"end":340.66,"speaker":"Jonathan Pageau","text":"Help us to deal with that."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":341.22,"end":373,"speaker":"Jonathan Pageau","text":"The first faculty is attention. It is our capacity to focus on something. We focus in and limit the world within our purposed activity at any moment. And so we don't hear or see the same things when we're cooking or marveling at a sunset or shaving. Let's say. The second faculty we have to deal with, the unlimited number of facts, is memory. Most of the things we encounter around us just vanish."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":373.08,"end":374.24,"speaker":"Jonathan Pageau","text":"And they're specifics."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":374.24,"end":579.68,"speaker":"Jonathan Pageau","text":"We don't remember them. Our memory only remembers the things which are important to us. For one reason or another, our memory will string things together, string events together into coherent hierarchies and narrative structures. These structures or these stories, they're already patterns. We often don't perceive the patterns. But the structure of why we remember something or how we then order events for others is already symbolic. Symbolic in the sense that they are ordered and patterned around things that have meaning. And then you have to see that there is a Kind of positive feedback loop between attention and memory, and then between attention and memory relating to other people. I mean, everybody's aware of this. I mean, you know people and I know people who, when they tell you, let's say, how their day went, they'll just ramble on and on about disconnected and irrelevant things that happen to them. And when you're listening, I mean, it doesn't take long, like 10 minutes will do. And you. You just wish you could run away or you feel like you're going to die of boredom. So symbolism is not opposed to a kind of neutral physical reality. Rather, symbolism is the very manner in which we perceive and organize the unlimited field of information. One of the first things that I remember that struck me when I began to attend an Orthodox church. I went to a talk that was given after a service, and one of the parishioners was explaining how the Greek word symbol refers to a place where two things meet, where two rivers become one river, for example. And that symbolism does not come about by adding a kind of metaphoric meaning on top of events, but is the very bringing together of events, the formation of analogies, the process of synthetic compression of multiple level of events, of patterns of relationships. And it's the bringing of all those things together which constitute symbolism, but also constitutes the very manner in which we engage the world. And so, if some people are interested in pursuing this, I put a link in the description of an article that I wrote which talks about this more in more detail. And so, see, there is no reality which is not symbolic. The nature of our existence in the world is symbolic. Events coalesce around centers of meaning through our attention and our memory. We all experience this constantly. And if one is attentive, what it does, it makes the world a magical place. I mean, let me give you an example. We learned recently that my wife is pregnant. This was not planned at all. It was a complete surprise. But a few weeks before she became pregnant, three people close to us had."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":579.68,"end":582.16,"speaker":"Jonathan Pageau","text":"Dreams of her being pregnant."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":584.24,"end":592.38,"speaker":"Jonathan Pageau","text":"And then the day that she did a pregnancy test and found out she had decided not to tell me right away and wait until we had a."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":592.38,"end":593.18,"speaker":"Jonathan Pageau","text":"Bit of time together."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":593.74,"end":607.98,"speaker":"Jonathan Pageau","text":"That evening we went to an event where we ended up discussing with a couple that we barely knew who had brought their newly born child. And the man was asking us if we planned to have another child. And I was like, no, we're done."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":608.62,"end":609.38,"speaker":"Jonathan Pageau","text":"Three is enough."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":609.38,"end":612.54,"speaker":"Jonathan Pageau","text":"And I utterly embarrassed myself, it seems."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":614.39,"end":616.31,"speaker":"Jonathan Pageau","text":"Saying that we're not going to have any more children."}
{"episode_id":"SW - #007 - 2018-07-02 - Symbolic vs Literal Interpretation of The Bible","start":617.91,"end":884.75,"speaker":"Jonathan Pageau","text":"And then when we were leaving the event. And we went into the car. I started the car and the radio was already on. And then right away, as the car started, the song that was playing on the radio was a song about a woman who was pregnant and going to have a baby. And I mentioned that to my wife. I said, that's weird, you know, considering the discussion that we just had with that couple. And so this type of synchronicity, this type of events coalescing in a manner which is not causal in any scientific way, is something that happens to everyone. And it's only maybe the pathological fedora wearing atheist who would deny this to himself. Now it's easy to look back and say, well, if my wife had not been pregnant, then all her friends would not have remembered those particular dreams. I mean, we dream all the time, right? At the same time, if she had not found out that she had been pregnant, that event where we discussed having another baby and then hearing that song on the radio probably would not have stuck in, in my memory very long. I mean, we had all kinds of discussion that evening with other people. And so the cynic might say it's only because she is pregnant that all those former events became important and were noticed by us in forming a pattern. And the answer to that cynicism is yes, that's right. And you cannot escape that. The process of putting together important things is how reality works. Because our existence in the world is symbolic. Human consciousness orders and gives meaning to an indefinite potential of existence. The world does not unfold randomly. And if in some ways it does. Consciousness, attention, and, and our memory does everything it can to fit things into a pattern, all the random things vanish in the margins of our perceptions. And if there is something truly random, something which both forces itself on our attention and then pushes itself into our memory, we formulate that thing into the category of chaos, of tragedy, of suffering. It's a monster. And we have to contend with it so that we can continue. I mean, if I am forced to remember something which is truly random, it's probably a car crash, an accident of some kind, or something that completely disrupts, erupts like a revolution into the regular pattern of my experience. Now, in terms of remembering events, there's a personal way of remembering events, there's a communal way of remembering events, a broader social way. And I would even contend that there is a cosmic way of remembering events. And all these levels of attention and memory will not appear the same. The more we move away from the idiosyncratic how my day went stories, the more we move towards remembering events which have universal significance, the more this memory will appear symbolic, condensed. It has to be so that it can be attended to and remembered by larger and larger groups over larger and larger spans of time. There are specific idiosyncratic objects or ways of doing things which much, much which must disappear, which must be made to fit with a larger and more universal image or universal images so that they can be remembered. So, for example, in the Bible, you can actually see that in the very unfolding of the large story, the more you go back, let's say, towards Genesis, the more the stories appear condensed, symbolic, universal. The forms are compressed through images that reveal more and more meaning. So does that mean that what's in the Bible."}
