{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":0.16,"end":59.17,"speaker":"Announcer","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":59.25,"end":72.37,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com People think, oh, how can you moralize people's. People's adultery? It's like, it's not even moralizing. It's actually, this is if you did it, went into any deal with anyone and you break, that's illegal. Like, that's you breaking the law."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":72.53,"end":119.2,"speaker":"Fr Josiah Trenham","text":"People, I'm like, especially in Southern California, a lot of people have swimming pools. Most of the people who have swimming pool have contracts with a pool cleaner. He comes once a week, he cleans your pool, he puts some chemicals on, you never see him. But if you break your contract with him, he's gonna sue you. In California, where we did this, we're the ones who created no Fault Divorce, 1969. Actually, once again, Ronald Reagan. Ronald Reagan, Governor of California, who did it. If you break your pool contract, you're going to go to court. But you can break your sacred vows that you made, usually in front of a minister of God and a congregation. Nobody watched you sign your contract with your pool cleaner."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":132.64,"end":188.15,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. It is a joy to be here with Father Josiah Trenum. Everyone watching this knows about Father Josiah. He's been such a great voice for orthodoxy and just general reason and common sense online. But also in his wonderful parish in California. He is organizing a conference that I am very excited to be able to participate in. It is a conference on Marriage, it is not going to be limited to the Orthodox Church. It's really going to be like a wide conference on the importance of marriage civilizationally, you know, obviously as Christians as well. It is October 10th, 11th, finishing on the 12th, and it is. Where is it? Father?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":188.63,"end":193.91,"speaker":"Fr Josiah Trenham","text":"It's at the historic Fox Theater in downtown Riverside here in Southern California."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":194.63,"end":224.13,"speaker":"Jonathan Pageau","text":"And so and the website is themarriageconference.com you can go there, check it out and look it out. And today Father Josiah and I are going to talk about exactly that, which is the importance of marriage as a civilizational institution that is universal and also its specific culmination in Christianity of Father Josiah, thank you for coming. And also tell us why you want to talk about marriage so much all of a sudden."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":226.85,"end":302.53,"speaker":"Fr Josiah Trenham","text":"Well, it's great to be with you. Jonathan 1 I get to talk with you and I'll talk to you about anything. Whatever you want to talk about, I'll talk to you. I do love the subject of marriage, and it's not recently that I've been interested in talking about it. It has been kind of, well, kind of a personal obsession since I was 15 years old. I'm pushing 60, so it's been actually pretty long time I've been thinking about marriage. But the longer I have served as a pastor, the longer I have served as a priest, the more deeply convicted I've become that the decline of valuation of marriage and its significance in the west is intimately associated with misery of all sorts of and that if there's going to be any recovery of sanity and healthy human functioning in the west, it's going to involve a reclamation of marriage, for sure. I feel that more strongly now than I ever did before."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":304.37,"end":353.44,"speaker":"Jonathan Pageau","text":"One of the narratives we've heard in the past few decades, I mean, probably since World War II, is in some ways this idea that the nuclear family is an artifice, the idea that marriage is actually a very superficial thing. It's an artificial you know, we've heard different attacks on marriage. This notion how can I say this, that it's not a universal institution, right. That it is in some ways an institution of patriarchy and somewhat hostile to women, all of that. And so, you know, when you hear that and that that's been going on for decades now, now we kind of see the result of that. We see the demographic collapse. We see the misery of people, the loneliness of people, you know. So what is your take on those attacks on marriage that have been going on?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":354.96,"end":619.31,"speaker":"Fr Josiah Trenham","text":"There's a lot to that. Let me begin by responding to what you were initially saying about the universality of marriage. Marriage has always been at the very core of living the Christian life. However, traditionally in traditional Christianity, it has a different place than I would say it's had, let's say, in 20th century American Christianity. So in the history of the church, marriage has always been front and center, for sure, but not exclusively. I remember I was raised as a Presbyterian. When I was a young man in college, I had a dear friend who clearly had a calling to the monastic life, clearly had a calling to the single life. And he pulled me aside on several occasions over the course of our studying together to share his angst, because there was no place for him in his Protestant world. He didn't want to get married. And if you weren't married, somehow in that period of time, you were viewed somehow unnaturally. As a matter of fact, today I'm giving you this interview on the feast day of St. John the Baptist, the 24th of June happens to be his birthday. His birthday is the third most celebrated birthday in the history of the human race. The Lord's birthday, of course, Christmas is the most celebrated. The virgin Mary's birthday, September 8th, is the second most celebrated. But John the Baptist's is the third most celebrated birthday, and his life is the third most cherished life. I mean, in our tradition, in the Orthodox tradition, there is no such thing as a church without icons of St. John the Baptist, like everywhere on the Iconos dos and everywhere else. And he functions kind of as a. As a witness, as a standard for monastics, especially people who have a calling like he did to complete consecration. And so he forewent marriage. He never got married. He gave himself 100% constantly to Christ. And so our monks and nuns follow him. And yet today I was celebrating the liturgy before I came on with you in my sermon today, I was pointing out that the Archangel Gabriel, when he came to Zacharias to tell Zacharias about the upcoming birth of John and what he was going to do, he summarized John's public ministry under three phrases, all beginning with the word turn. He's going to turn three groups. He's going to turn people to the Lord in general. That's going to be number one. That's a beautiful calling. He's going to turn the hearts of fathers to their children. Don't miss that. I mean, here's a guy who doesn't have a family, and yet his ministry is going to be to families. He's going to. Even though he himself had no biological children and lived in the desert and ate bugs. He ministered to the married, he ministered to those who had families. And he taught fathers to consider it a great honor to invest themselves in their sons and their daughters. He turned the hearts of men to the children. And then he's going to turn the disobedient to the wisdom of the righteous. He's going to bring people in general to start considering ways that are time tested. So I just want to say that initial volley for us, marriage is fundamental. It's foundational for Christianity. It, together with monastic life are the two kind of foundational bedrocks for building your life in this life. And they're not always that separated. They kind of interweave, they have a symbiosis, they both help each other all the time. And in many, many ways, marriage has always been the natural for those who aren't called to the monastic life. This is the natural context in which all the beauty of life develops. And to see that abandoned as though somehow it was something that was man made, or even worse, maybe made by politicians and therefore can be altered and adjusted and you can take these parts and dump those parts, that's nuts. That's just absolutely nuts."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":619.47,"end":701.49,"speaker":"Jonathan Pageau","text":"It's interesting what you said about the relationship between monasticism and marriage. I've been thinking about that quite a bit. Because one of the things that is confusing for people outside the church is they look at the literature of asceticism, you know, and they have this sense that in some ways maybe Christianity is a kind of anti life thing. You saw that in Enlightenment thinkers, that maybe one of the causes of the fall of the Roman Empire were all these people going to join monasteries. But our experience actually shows us, strangely enough, the opposite, which is in some ways those that give themselves to the monastic life and in some ways offer their bodies and themselves to Christ alone, they end up becoming the anchor for the communities who then just populate the world. They end up being like moral hooks that people can look to and kind of see as examples. But the funny thing about the example is that the asceticism of the monk who's completely, you know, who completely denies, let's say, marrying a woman or being part of a marriage gets reflected in life as the asceticism of marriage, which is then the people look to the monk and though they are married with one person, they see that asceticism reflected in their married life. Which people don't tend to think of marriage as a form of asceticism."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":703.42,"end":815.91,"speaker":"Fr Josiah Trenham","text":"No, they don't. Because much of our opinion about Marriage has been, you know, by osmosis, absorbed by our fallen culture and very secular culture that doesn't have a vision for marriage. Obviously, Obviously, marriage is tanking. I mean, it is absolutely tanking. It's a minority status today. Like 41% of Americans are actually married. 41% of households. That's nuts compared to when I was born even. I mean, I know I'm old, but not that old. I was born in the 60s, and 75% of homes were occupied by a husband, a wife and children when I was born in California. That's nuts. You know, it's been my experience that this symbiosis is very intense. The church even teaches in her canonical tradition that if there's any monk or nun who criticizes marriage at all as a reason for becoming a monk or a nun, they have fallen into heresy, and any offering that they're offering in their menat is gone. St. John Chrysostom dedicated a whole book that he wrote called On Virginity. In this text, he labored to argue that those who are choosing the monastic life, if they do it with criticism at all of the married life, that they have just stolen the value of monastic offering. Because the reason monasticism is so precious is because you don't have to do it. It's a free love gift. You're offering to say no to the great happ. Happiness of marriage in order to give all of your energies as a free gift of your love to Jesus and to the church. If all of a sudden marriage is evil, there's no gift at all. It's the only option. If marriage is evil or in any way tainted with sin by definition, then you have to. True Christians have to become monks, and none which just guts the value of monasticism itself."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":816.23,"end":887.41,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But one of the things that I've seen seems to be like, one of the causes of the fact that marriage has fallen ap and marriage has become so difficult is because we've. We have this sense in which marriage is the place where I will get everything that I want, right? And so I have needs. I have all these. These needs, these sexual needs, these emotional needs, these needs of accomplishing myself. And I see marriage as the culmination of that. The place where I can get, you know, make myself get what I need for myself. Where, in fact, you know, as I mentioned before, it seems like marriage in the traditional, in Christianity is in some ways a form of offering. Right. It is a form of sacrifice, which has great joy in it. Right. It's not that you sacrifice yourself and it's just this. You know, it's actually that in the. In the offering, there's this great. There's this great joy that comes out. But we. I mean, and I. And I say that for myself as well. Like, when I went into marriage, I had completely had that. I had completely absorbed this idea that marriage was for me to get everything that I wanted. And, you know, and for several years, I suffered quite a bit from that, you know, in my own marriage."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":887.65,"end":971.77,"speaker":"Fr Josiah Trenham","text":"Yes, well, you're not the only one, Jonathan. I share that, too. When I was young and I was thinking about getting married, I wanted a beautiful wife. I wanted to have a woman who loved me. And. And, you know, I'm very sympathetic with that. There is a lower form of love and ambition, Eros, for instance, that is very important. It's very important. It's not as though the church is saying that marriage doesn't have that aspect of being able to be loved and to be possessed by someone and to possess them joyfully with love. The Church is just saying, look, that's the entry door. That's the entry door. But the house is much larger than that and much more beautiful than that. And even the entry door, as legitimate as it is, becomes much less relevant the older that we get and the more mature, I should say, in our relations that we get. I love that image that C.S. lewis uses in his book the Four Loves. He's describing Eros, and he says erosion is very important. He reminds us that it's very dangerous. Right? I mean, Cupid has a bow and arrow. It's not to give you chocolate. You're going to get shot and you're going to bleed out."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":972.17,"end":973.21,"speaker":"Jonathan Pageau","text":"You're going to suffer."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":973.45,"end":1033.09,"speaker":"Fr Josiah Trenham","text":"Yeah. But he says Eros is the powerful shot that gets the train of marriage and family life moving down the track, he says, but it can't sustain it. Now, for that, you need really more mature loves. You need storge, you need Philia, you need agape. If you're going to keep your marriage going and it's going to mature, you know, you can have a place for Eros, but really, these other loves have to become larger and more important in order for marriage to become what it can be. And once it's growing, wow, what can't it do, really? I look at my 37 years of marriage and I think it's tamed me. I still have a lot of work to do, but it has tamed me a lot. It has taught me patience. It has expanded my heart from the little tiny stone that it was to now just a little bit bigger stone. It's done a lot of things to me that I never dreamed it could have done."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1034.45,"end":1097.94,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And I think we can. In some ways, we're in an amazing situation. You know, it's sad to rejoice of the situation. What I mean is that there are some warnings that you can see in the fathers or in just holy people all through the centuries about the dangers of letting our vision of marriage go. And in the past few centuries, we have. So we went down that path. We had that experiment, and now we know what it looks like. And so in some ways, it is a great time to talk about this because we actually have. We've run the experiment, folks. We have the results, and we know what it looks like. And, you know, the image. I mean, there are so many dark images that populate our world right now. Like, you know, the image of the single or divorced person in their late 40s swiping on Tinder, you know, trying to, like, find to get dates. It's just this sad."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1098.26,"end":1099.62,"speaker":"Fr Josiah Trenham","text":"It's just like this sad."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1099.7,"end":1123.92,"speaker":"Jonathan Pageau","text":"This sad thing. And there are just a lot of these images. Like, that's just one. But there are a lot of these images that have populated popular culture now for several decades that show us to what extent, to what extent putting effort and living a family life and marriage is the way to go to actually live a satisfied, joyful life."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1125.2,"end":1377.59,"speaker":"Fr Josiah Trenham","text":"You know, I agree with you. We have abandoned not just living marriage, but we've abandoned champion. We don't have champions, really, of marriage, at least not in the public square. We have a lot of interesting people. We do. And some are even raising the alarm about declining birth rates, which is a great concern and which is one of the concrete fruits of abandoning marriage, is that we just aren't having children. We're not only not in love with marriage anymore, we're not in love with parenting anymore. And we're trying to find alternatives which are not working well. But even those who are discovering the importance of childbearing haven't quite been able to move to the next step, which is that before you address parenting, you have the issue of marriage as a universal institution, something that God himself made for the human race. And until we take a hard look at what we've done to marriage, and I would say you're right, I think it is several centuries in the making. But I'll tell you, the mid 20th century, from the 50s until where we are now, especially with the outbreak of the sexual revolution in the 60s, we have gone from not respecting marriage to full frontal assault. Full frontal assault. And now we can't even talk about its integrity. I mean, look, I don't mean to be disrespectful in any way, but when the champions, the two great conservatives, conservative political champions of America are Ronald Reagan and Donald Trump. Ronald Reagan was the first. Ronald Reagan was the first twice married president the United States has ever had. And Donald Trump is the first three times married president that we've ever had. Something is wrong. Something is wrong. If we can't discuss the important. I can understand if they presented themselves as, you know, thank you for, for trusting me. Even though I have failed in the most important earthly arrangement that I committed myself to. That institution where your word means the most way more than business arrangements is in marriage. You make sacred oaths when you get married. All cultures do. It's the test about integrity. I would be more sympathetic if we had political leaders who were trouncing on marriage and they said, look, forgive me. I'll give you an example. I'll give you an example. I had the privilege of meeting a British politician recently that I really like. I'm sure you know, Nigel Farage. I like Nigel very much. And Nigel has a lot of good things to say. I'm very interested in some of the things that he says. And I was. I was at a. I was asked to participate and speak at a conference and I knew he was going to go. I didn't really want to go to the conference, but I told him, I said, look, if you can give me 10 or 15 minutes with Nigel by myself, I'll go. So they did. They were super kind, super wonderful people. Very kind. And in my conversation with him, I appreciated his humility. You know, he said. And I've heard him say it elsewhere, matter of fact, he said it at ark last time we were there. He said, I'm not an example. He goes, I believe in this. I champion marriage. I know marriage and family life are so important for culture. He goes, but please don't look at me. Don't look at me. I have failed in this area. I have, you know, some things in my past that are really not great. And I'm humbled by that. I'm like, that's beautiful. He's holding up the example, as any person in leadership should. If you don't honor marriage, you're not helping your land. But he's doing it with humility. But we have others who, you know, it's just not talked about it just can't be talked about. And that's tragedy because. Because we have guns from all sides pointed at marriage. Guns at all sides. The legalization of adultery, which happened in my lifetime, I mean, that's. Can you imagine a culture where it used to be illegal to be adulterer?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1377.75,"end":1379.35,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1379.35,"end":1381.75,"speaker":"Fr Josiah Trenham","text":"That's the legalization of adultery. The."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1383.75,"end":1417.27,"speaker":"Jonathan Pageau","text":"Breaking contract. So funny. People don't. Don't realize that even like just normal. Not even outside of morality, like just normal contract. You have a contract with a person. This is a promise you make. You sign a piece of paper. It is illegal to. It is illegal to. If you go outside of the contract, you're breaking the law. Like it shouldn't. People even, even people think, oh, wow, can you moralize people's. People's adultery? It's like, it's not even moralizing. It's actually. This is. If you did it, went into any deal with anyone, and you break. That's illegal. Like, that's you breaking the law."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1417.43,"end":1516.82,"speaker":"Fr Josiah Trenham","text":"People. I'm like, especially in Southern California, a lot of people have swimming porn pools. Most of the people who have swimming pool have contracts with a pool cleaner. He comes once a week, he cleans your pool, he puts some chemicals on. You never see him, but if you break your contract with him, he's going to sue you. In California, where we did this, we're the ones who created no fault divorce, 1969, actually, once again, Ronald Reagan. Ronald Reagan, wow. Governor of California, who did it. It. If you break your pool contract, you're going to go to court. But you can break your sacred vows that you made, usually in front of a minister of God and a congregation. Nobody watched you sign your contract with your pool cleaner. Hundreds of people, hundreds of people come to witness, making sacred oaths to get married, and the consequences aren't even close. So what, you violate your pool contract and they get another pool cleaner? You violate your marriage and you have children. The consequences are irrefutable. The outcomes for kids in divorced families in every measurable category, atrocious. Atrocious. No. We really need to have our hearts altered. We need to do exactly what you said, recognize the time is up. We've done the experiment. Let's evaluate the results and let's make the proper conclusions. We don't need to beat anybody up. We just need to make the conclusions and reorient our heart's disposition."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1517.22,"end":1608.31,"speaker":"Jonathan Pageau","text":"Yeah, and I think that that's an important point because you're right. In some ways, we're all quite broken. You know, everybody is affected by these problems of the sexual revolution. Everybody has been tainted by it. You know, we have. None of us can just stand up and say we're glorious examples of everything. But I think that, like you said, to be able to reorient and say this is the ideal and we will pray for those and we'll weep with those who struggle to keep it, and we'll continue to have mercy, but we cannot compromise on what the ideal is because to do so, like you said, we've seen the results. We know what it looks like. And on every front, in terms of people's mental health, in terms of the existence of communities, in terms of children's mental health, all of this is just breaking down. Everybody is living with the consequences of this now for a few generations, over and over in Quebec, it's crazy. Like here, where we are, you know, these reconstituted families are just. It's become. It's become completely normal and, you know, and it's taboo to talk about it, but, you know, the abuse rate in a reconstituted family is so much higher than with. So we have this mythology of, you know, the abuse of families and how families are these little, you know, these. How can I say this? Like these nodes of abuse and power and all of that. But man, reconstituted families, it's beyond. It's beyond anything."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1610.87,"end":1648.22,"speaker":"Fr Josiah Trenham","text":"So not only do we have to, I think, make the evaluation, conclude the experiment and draw our conclusions from them, so to speak, but also we need people who have experience and who are knowledgeable to lift their voices and to say, you know, we need to address marriage for what it is. It's a pre political, divinely created institution and it can't be discarded any more than you can discard your own humanity. We're trying that now too, and it's not going well."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1648.22,"end":1649.3,"speaker":"Jonathan Pageau","text":"It's not going anywhere."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1649.3,"end":1733.73,"speaker":"Fr Josiah Trenham","text":"It's not going well at all. But they're connected. The two are very commend. You know, marriage is a paradisal institution. It wasn't exactly as it is now. The fall had tremendous consequences on marriage. But it's not something that God made up later. It's something that when he made humanity without marriage, he did not say his creation was good. His creation, everything else was good. He looked at everything else. But when he had Adam and he brought all the animals to Adam, and Adam showed his incredible intelligence, his prophetic insight, and his ability to discern the purposes of God's creation for every animal. And he gave a name, which is what naming really means. It's defining. When he did that and he looked around, he could not find rest until God looked at him and said, you know what? This is not good. The only not good in creation. A not good without sin. That's amazing. How could there be a not good when there's no sin? Well, it's a not good because it's incomplete. Then he made Eve, and then Adam looked at her and it was very good. It went from good to very good. This is all foundational stuff. To ignore that or to pretend that somehow the political sphere or the state is the origin of marriage or can control and regulate marriage. This is ignorance. This is ignorance."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1734.37,"end":1751.02,"speaker":"Jonathan Pageau","text":"Yeah. One of the things also that people say. They say that the nuclear family is a modern invention. That in fact, in the ancient world you had extended families and that the extended family was really the family and all of that."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1751.17,"end":1751.41,"speaker":"Fr Josiah Trenham","text":"That."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1751.81,"end":1794.83,"speaker":"Jonathan Pageau","text":"And what's fascinating about. Because I hear people use that argument all the time, even in kind of. Even in weird progressive circles, people will use that argument to kind of defend an alternative vision of society. But it doesn't hold up. Because the extended family, of course, but always the nuclear family. It's like, there's the marriage, there's the family, and then the extended family is this large blessing that comes and kind of supports. Obviously you need that. But if you think that you can have the extended family without the nuclear family, that's absolutely ridiculous. You can't have the village without the nuclear family. You're not going to have a bunch of children that nobody knows who their parents are, running around being raised by a village. That's completely ridiculous."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":1794.99,"end":2030.03,"speaker":"Fr Josiah Trenham","text":"You know, this is a criticism from, you know, the 1950s and kind of the morphing of the American family into this. Two kids. We have two kids. We really don't have connections to other generations. That's not our way. In the east and in the west, in the formation of marriages, we're very clear and we combine both the reality that in the coming together of a man and woman, a new family is constituted that is, in a sense, independent and unique, just like the family from which they came, but with an abiding relationship to their progenitors. That is very expressed in our tradition, in the orthodox tradition, in what happens when people are crowned. The crowning has three basic references. It has the obvious kind of Greek victory. You know, you've run the race and you've come. The race in this case is the race to get to marriage in an honorable way. When we take the crowns off of a couple's Head. The priest says that these crowns were put on your head as a reward for continents. This means the church recognizes that when you found your beloved, of course you've been as your hearts are growing closer and your emotions are growing closer, it's natural for your bodies to grow closer. It's God's institution for the propagation of the race. But you honored him by respecting that. That is equality of married couples. And that took investment, that took some measure of marital asceticism. And so you get a crown for being dignified in your courtship. That's one of the purposes of the crown. Another purpose of the CR is to bear witness that you are entering into a relationship of self sacrifice. That love which is at the basis of your union will show itself in you laying your life down for the other. You're choosing your spouse to be your chief neighbor. And Christ teaches us to love our neighbor as ourselves. And your spouse is going to be that. And so you get crowns like the forty holy martyrs did when the crowns came down from heaven. Because you're entering into a martyric relationship. The husband's supposed to love the wife like Jesus loves the church and lays his life down for her. That's serious business. And the wife has to respect the church and that respect her husband like the church respects Christ. And that also especially because we husbands, a lot of times we make it very difficult. It's very hard for the wives to respect us. But they have to, right? And they're crowned with a blessing, a martyric blessing. But it also has a third reference. And that third reference is to being crowned as a king and a queen over their new realm, over their new kingdom, which is their home. It might be 200 square feet. When I got married, I had a 400 square foot apartment. I had to like suck in to get into the kitchen. It was very narrow, but I felt like I was the most wealthy king. We had $400 in the bank when we got married. Like, that's it. But we had our health. We knew we're gonna, we're gonna get jobs. We did right away. But we set all the rules, brother. We set all the rules. And we decided, you know, when we were going to pray and when we weren't and how we were going to raise our kids and when dinner was going to be right. This is our kingdom. That concept is so fundamental. It's actually in English, common law. I mean, this is what's behind the fact that a police officer cannot enter your house unless he has a warrant from a judge. Because That a man's home is his castle. He said he's in charge there. This is a. A great mystery. So when you. When you're crowned and in the crowning prayers, the priest turns and he blesses your parents. So your parents are there. They're assumed to be watching and giving their consent. As a matter of fact, a priest can't marry a couple unless he has the consent of the girl's father. The canons forbid it."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2030.18,"end":2031.06,"speaker":"Jonathan Pageau","text":"It really."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2031.14,"end":2051.46,"speaker":"Fr Josiah Trenham","text":"So, yeah, so they're involved, the parents are involved, and they're the ones respecting. And it's the joy of a parent to see their children become their own family. But they don't lose. You don't lose your connection to your parents. I mean, I have. A bunch of. My kids are married and they have given me grandchildren. Our relationship changed, but it's. It's better. It's deeper even."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2052.18,"end":2122.84,"speaker":"Jonathan Pageau","text":"Yeah, I think. I think a lot of the images you brought up are beautiful. I've been telling people. That's why in fairy tales, it's always princes and princesses. People think that it's an arbitrary thing. No, it's because exactly of what you said, which is that in some ways, when the man and the woman join together, they become principalities for the kingdom on which they reign, which is their own family, no matter what level it is. You know, this union causes a little kingdom to exist. And it's important to kind of understand. It's very beautiful. And there's such a joyful element to realize, you know, this image that. This idea that when Christ blesses marriage, like he says, you know, you leave your father and your husband, you join together. And ultimately, when you see in Christian imagery, you become even like a little image of the church. Like, you know, you become a little image of the relationship between Christ and the church in your little microcosm. So it's a cosmic thing. It's not just that. Not just a question of practicality. It's not just a question of emotion, although all of those things are true. It really is a participation in the cosmic order."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2124.2,"end":2226.06,"speaker":"Fr Josiah Trenham","text":"You know, in the west, in the marriage rite in the west, too, there's an action that I really respect and I like at the end of weddings in the west. And sometimes we Orthodox use this too, in the west, when the couple is now married and they're about to leave and they're going to recess out of the church. In our tradition, we usually are singing God grant you many years. It's very triumphant, very beautiful. But they step down and they go to and they greet their parents. And I always tell the couple, if the couple's going to do that, I always tell them, look, you go together, you're going to go greet the parents, the wife of the bride, but you're going together. Don't separate. Your hands have been put together in the service itself. The priest joins them and then you keep them together and he blesses your hands. Now you go together as a new independent family and couple and you greet your parents for the first time as an equal. Marvelous. It's majestic. You know, typically we would kiss our parents hands, but we're doing it together, you know, looking them eye to eye. And then you go to the groom's parents and then you come and then you walk out as Mr. And Mrs. You walk out, you know, as this new couple. It's the same idea as in our tradition, that you have just become something that is extremely valuable. You may be going home and moving into the apartment above your parents. That's very common. Yeah, very common. If you asked me, do I have an apartment in my garage and is one of my daughters with her husband living there right now? The answer would be yes. The answer would be yes. But independently, right?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2226.14,"end":2339.22,"speaker":"Jonathan Pageau","text":"Yeah. And I think there's so many things, because one of the problems that we've seen in. I've seen that around me is people, they, they say, what's the. Like, what really is it like? What is this like we have this, this ceremony, you know, I love her, we live together, you know, we, we're. We're faithful to each other. Isn't that enough? But I think what you've said and the way you've described the marriage ceremony helps you understand, for those people that watch my channel, understand that origins have a different quality to them. You know, that in order to manifest the transition from one world to another. Right. No matter how you think about it, whether it's America separating from England and becoming its own thing, whether it's your own baptism where you leave the old life and you enter into a new one. It has to be marked in a certain way. It has to be a moment that is. Is marked in time, marked in place, you know, let's say, stamped with a kind of vertical relationship where we invoke God to bless this new reality. You know, it really becomes like a little image, I think of Jacob when he discovers the Bethel, like the house of God and there's these angels moving up and down and God says, this is your, this is going to be the beginning of you. Like this is the house of God. But it's also the place from which you will bless all the nations and all of this sense. And so that's what marriage does for a couple. It basically says, like you said, it's basically marking the moment when you are no longer two separate people, but now there is a being that is formed, that is the joining of the two together. And that being is more than the individual parts. Right. It is something that is mystically one in a way, that is real. It's not an illusion. It's not something. It's something that. That will then, like you said, found a kingdom together."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2339.3,"end":2339.78,"speaker":"Fr Josiah Trenham","text":"Yes."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2339.86,"end":2344.02,"speaker":"Jonathan Pageau","text":"So yeah, it's a very. It's a powerful. It's a powerful thing and very important."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2344.5,"end":2612.62,"speaker":"Fr Josiah Trenham","text":"There's little aspects, I think, Jonathan, there's aspects of marriage that are very attractive to people still, even in this anti marriage culture. Even though marriage has been, you know, being shot and legislated against for decades now. And then that has to stop. Please, Lord, let that stop and let that reverse course. People like little aspects, right? They love the sex part, they love that. They love being together at least sometimes part. They like that. They like companionship. Who doesn't like companionship? And even though if you're not married, the potential for developing that companionship into really a friendship that's worthy of that name is less. Marriage gives you that opportunity to really develop friendship. But I think what they're missing is an appreciation. And I think we can conclude from this experiment that this is true. What I'm about to say. Marriage and sexuality is such a big deal that if you don't get it right, it will ruin your life. It will ruin your life. God created marriage in his wisdom to be able to unify a whole bunch of extremely important things together. Let me just in my mind tell you what I think those are. It starts at the top with desire. So the desire that exists in a man for a woman and a woman for man. St. John Chrysostom describes marriage from the position of a father watching his daughter run to her husband. He says the way that a parent should view it are it's two halves running to make a whole. It's a sense of incompletion and a desire to be whole and be complete in a one flesh union of life with this other person. So that desire, it also has a sexual component which is extremely powerful. Don't we know it? I mean, look at our society. The desire is so powerful that people can't contain it without the norms of the church, without norms of basic morality. That most societies have had since we've abandoned those, sexuality has gone wild and desire has spun out of control and wreaked havoc, has wreaked havoc with the epidemic of single moms who are abandoned with their children, with children who have no fathers, which is kind of like the most foundational cause of disorder in their life. So if we start with desire, we might go then to the concept of union and sex, which is so powerful. Remember though, that those two joining union, sexual union and desire is very important. Our culture doesn't even get that anymore. Our culture today has separated the impulse, the sexual impulse from union. With the explosion of autoeroticism, I mean, look what's happening in some of the Asian countries. Radical social dysfunction, because people have even broken that they have desire, but they've turned it in on themselves through digital life. And they're not even allowing that to push them towards another. So that's the first union, I would say. You have desire, you have union. God puts in their love, right? That's a different kind of desire and much more noble than just the sexual desire to desire someone for the benefit of them, that's huge. So marriage has desire. It combines desire with sex. It combines sex with an actual union with a person. And that union with love as the motive. And that love with some definition to it. There's a lot of people say, well, I love my partner, but we define the love. It's a love of substance, what we might call commitment. So love marriage keeps that defined. Well, for us, it's commitment. That commitment is a particular kind of commitment we call marriage, which is a whole life's commitment. Sometimes people don't fully embrace that and they get married and they keep little pieces of their life to themselves and they don't let their spouse look into it. You know, maybe I have my checkbook and you have yours and we don't look at it. I mean, that's not the end of the world, but it's pretty stupid. Just as a pastor, it's a marker. It's a marker of something unhealthy if there's portions that you're keeping from your spouse. That's not what marriage is. Marriage is a full blown sharing of all aspects of life. You can divvy up those aspects, but you can't on principle say, stay out of that part of my life."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2613.34,"end":2614.54,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2614.86,"end":2642.21,"speaker":"Fr Josiah Trenham","text":"Marriage, all of these things are incredible. And if you tear them apart, if you tear desire from union, union from love, love from commitment, commit from marriage, marriage from children, that's a natural step children to parenting. Parenting is part of the package. And all of that in permanence, all of those things together are the. Is the miracle of marriage. That is what God has done. If you take any one of those things outside of the bonds of marriage, you're going to have trouble."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2643.57,"end":2753.17,"speaker":"Jonathan Pageau","text":"Yeah, that's amazing because you can just play it out in your mind and look at all the examples of all of those, all of the things you mentioned and how in our society they've all been broken apart into their separate little thing. And you can see the misery that it, that it brings. And it's interesting because the commitment part, I kept thinking about that people also don't realize this as well because one of the problems we've had is that love has been reduced to kind of emotion, like something that I feel. And it is that to some extent. Obviously, you know, you need the feeling. It's an important part of it. But when you have the commitment, what happens is once that feeling is put to the test and you, you kind of anchor yourself in the commitment, you have this refining. And it's hard to describe to someone who hasn't experienced it, but you know, once you've gone through these refining processes, you discover whole aspects of what a person is, of what it is possible with, like what possibilities God has put in us. When you are able to work through those emotions and the taming of those emotions, even in your relationship, let's say with your spouse or, or your desire. And all that has fruits all through your life, right? It's like the reigning in of your sexual desire, for example. It's not just about sex. It ends up pervading all your capacity to rein your passions in, to control yourself, to aim, to focus. Right, to aim towards proper things. And this is something that the ancients knew very well. Like you read, I remember reading like an old, old salesman's book. It was really funny and, and it was, it was saying like, if you want to be a good salesman, one of the things you should do is you shouldn't have sex the day just before a big sale. And like from. For a lot of kind of, let's say early modern or like 20th century, we did this."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2753.17,"end":2753.93,"speaker":"Fr Josiah Trenham","text":"So that's ridiculous."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2753.93,"end":2803.17,"speaker":"Jonathan Pageau","text":"That's the dumbest, craziest thing. But like ancient people had understood this energy, like if it's sexual energy, if it's focused, if it's sacrificed to something higher, if it's put in service of something higher, actually yield in all through your life in all kinds of things. And all kinds of, of. And you can see, like you said when you talk about, let's say South Korea as a good example, where the, the, the kind of auto eroticism out of control also leads to a kind of just a basement of human intention in general where people have no motivation, have no desire, have no ambition, have no kind of drive towards anything because they're just, just drowning in their own pleasure. It's like all of these things go together in ways that it's, it's, it's, it's so hard for modern people to kind of re. To put back together in the way that ancient peoples understood just naturally."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2803.57,"end":2935.13,"speaker":"Fr Josiah Trenham","text":"Yes. You know, I did a trick once on my parish. It wasn't very nice, but it was a lot of fun. It was about 20 years ago and back when it was before email or we, what was it called? WordPress, something like that. I can't remember what the technology was, but you could start writing messages on, you know, and doing these little blogs. And so I would always write some patristic quotes to my parish. And I was in the middle of a study actually on Roman marriage, pagan concepts of marriage, which, forgive me, is so far superior to what we have in the West. So far superior. Just take the word monogamy. You know, if you talk to Americans about what monogamy is, is honestly what they're going to tell you is they might know that monogamos means that you have one wife or one husband. But they think that means at a time. Right. I have met numerous people who think they're monogamists and they've been married five times. It's just that they weren't having these multiple times at the exact time. Okay. And so I was reflecting on the Roman concept, the pagan. They knew what monogamy was. It was so serious. We have many tombstones from the early centuries of the Roman Empire in which a woman was just called, she was, she was the wife of one husband. Paul uses that exact language as quality for ordination. It's one of his, but it was a very common Greco Roman reference to the fact that, that you got married once and you made it work. And if you did, it was extremely significant. And you might not be super faithful, you might not have a lot of love, you might have a mistress or worse, you know, maybe you even have a boy, but you don't mess with your marriage. You know, from a Christian perspective, of course, that's greatly debased. But in their minds, you still have to take care of your wife. You know, you have to provide for your wife, you need to get along with your wife. You need to provide the household for your wife, you need to take care of your children. Children. If you don't, the state will collapse. They knew that."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2935.93,"end":2938.33,"speaker":"Jonathan Pageau","text":"Yeah, society will collapse. That's for sure. That's right."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2938.33,"end":2954.33,"speaker":"Fr Josiah Trenham","text":"Absolutely. These are pagans, right. They're supposed to be stupid. They're not stupid. They're not stupid. They knew a lot better than us the idea that we can be doing what we're doing today and it's not going to have terrible consequences. No, they knew. Traditional cultures know this."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":2954.49,"end":3018.56,"speaker":"Jonathan Pageau","text":"Yeah. So what do you say to people, because this has been something that I've seen a lot in my friends and, you know, and in younger people as well, is that they have this idea that people should. People want to get married, but they have this weird idea that marriage has to be this big, huge thing that they cost a fortune. And therefore people just wait and then they live together and they have kids and then they get married as a kind of culmination of their relationship. And, you know, and that they can make a big. A big, big deal about it and a big feast. And there's even in the Christian world, you see that. By the way, I grew up in. In. Not my parents particularly, but in a world where people would say, finish your studies, don't get married. As if being married young will ruin your life or something like, wait. And so you're pushing these young people that are just. Can you imagine? You're 19, you're 20, you're just exploding with desire, and you're telling these people, wait until you finish your PhD by the time you're 25, 26. And so, I mean, I'd like to hear you talk a little bit about that. That narrative in our society."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3018.88,"end":3020.32,"speaker":"Fr Josiah Trenham","text":"You're trying to get me in trouble."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3020.88,"end":3021.6,"speaker":"Jonathan Pageau","text":"Well, why."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3022.16,"end":3040,"speaker":"Fr Josiah Trenham","text":"I'm not trying to get you in trouble. I think it's important. If I cared about getting in trouble, then I would not answer the question, Jonathan, because I have gotten in trouble on this very subject my entire priesthood. I agree with you. Before I answer that, though, I never told you how I tricked my people."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3040.56,"end":3041.32,"speaker":"Jonathan Pageau","text":"Oh, yeah, yeah."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3041.32,"end":3092.78,"speaker":"Fr Josiah Trenham","text":"I meant to tell you that. So I was sending out reflections, and I usually. I love St. John Chrysostom, so I'm always quoting him. So I sent out five reflections about marriage and family life and that kind of thing, and about God's providence in arranging things. And I put the quote, beautiful quote. And then I put St John Chrysostom. I did it for a whole week, five times the next week, I told them, I'm really sorry. All of those were quotes from Seneca. Every quote was from Seneca. Right. A contemporary of St. Paul, the great Roman. And his words were so beautiful, no one could tell it wasn't St. John Chrysostom. The points were the same. The respect for. Prof. Of course, he didn't understand. I'm not suggesting that he understands Providence exactly as he do, but there was a lot more in common that we have today with secular than we have with today."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3092.78,"end":3095.22,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Or even a lot of Christians today."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3095.59,"end":3196.11,"speaker":"Fr Josiah Trenham","text":"In, let's say, and knew how to get married. The Romans knew how to get married. And the involvement of the way that we do dating today, this radical individualistic approach to dating and to marriage formation, it also is part of the package that needs to be reevaluated and dumped. Frankly, the best way to meet people are through friends and family who know you and know them. This is the best way. I have a good friend. He's Indian. He's from India. And he tried so hard. He came to America, he's working. He became a professional. And he's like. And his parents were like, well, you need to get married. Let us help you. He's like, no, no, I've got this. I've got this. And he tried and he tried and he did the whole kind of dating thing, and then he just wore himself out. So finally he cried uncle. He called his parents and he said, okay, I give up. Arrange me a marriage. But the only one thing I ask is make sure that you consult my brother, because he had a. He was a very close. One of his brothers. He said, please make sure my brother agrees. Anyway, so they did. Taken care of. They made the beautiful arrangement, and he's lived in the happiest marriage since. For me, it was the great witness of the two styles. Right, Right. It's a competition between the two styles. He got worn out and completely depressed by doing the American, Western, secular thing, and he finally gave in and he let his parents have a. An important part. Who knows you better than your folks? And if they love you and you have your brother to help as well, that's, that's. The chances are a lot higher, a lot better."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3196.11,"end":3213.25,"speaker":"Jonathan Pageau","text":"Yeah, well, at least take it. I mean, we don't necessarily need to have arranged marriages, but at least take the advice of the people that know you. That is for sure. Like you said, your parents, parents grew up with you. They know your temperament in ways that you might even not know about yourself. You know, and so they're definitely, that definitely is a huge part."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3213.25,"end":3296.43,"speaker":"Fr Josiah Trenham","text":"Their suggestions are important and it's better than scrolling social media feeds and, and looking for pretty girls and then, you know, cold texting them and saying, hey, can we have a date? I mean, that's not a great recipe. It's just not, it's what people are doing everywhere. It's just not a great recipe. You know, when my wife and I were dating, we were very young. I met her when she was 18. I was 18 too. I was about to turn 19 and I wanted to get married and my parents didn't oppose it. Most of the parents of my friends thought I was nuts, we were too young. But I had already decided who I was. I had my fundamental moral commitments made. And that's very important. If you're gonna. I think it's good to date young. It's good to form your relationships with your spouse. There's a thousand reasons young marriages have benefits, but they shouldn't be engaged in unless you really are out of the adolescence stage. We have this strange, you know, childhood and adulthood. This is the traditional concept, you know, since 18th century and the growth of wealth in the west, this, this concept of adolescence, this nebulous period between being a child and adult has gone from like a year or two to like 15 years. I mean, now you have adolescents in."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3296.43,"end":3298.27,"speaker":"Jonathan Pageau","text":"Your network, 25 year old adolescents."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3298.27,"end":3374.04,"speaker":"Fr Josiah Trenham","text":"Yeah, we have 30 year olds playing video games, really. And not sure if they, if that should be, you know, a component, major component part of their life. They think it's legit. I laugh at that. I'm like, you know, please, you're never going to be able to get married in that mentality because you really haven't decided who you are yet. Yet. If you have decided that if your commitment to God has been made and there's nothing that's going to tear that apart, you're ready to go. If you have a work ethic, you're ready to go. Maybe you don't have all your education done, but that doesn't mean you can't do it. My wife and I, we did our education, we got married in College. She was 10 days past her 20th birthday. I was 20 also. And she knew what I was going to be and how I was going to live. And she liked it. And I knew who she was. And she's the same person today, except more patient because she had to put up with me for all these years. And it blessed us because now we're able to go through so much of our lives together and make decisions together. When you go and you don't get married till you're 35 years old, you've already formed hard and fast opinions about all sorts of aspects in life. No, I like my kitchen arrayed this way. This is how I do my refrigerator, and this is how I do the closet, and this is how I live in my house, and this is what I do with the bathroom. All of those things become major issues."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3374.36,"end":3374.92,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3375.24,"end":3382.28,"speaker":"Fr Josiah Trenham","text":"Because you're so like, formed and now you have to somehow merge with another 30 year old. It's tough. It's very tough."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3382.76,"end":3480.64,"speaker":"Jonathan Pageau","text":"Yeah. And there's also, you know, this is something that I've. I've seen. There are these two competing images. One is this idea that this 1940s 50s idea of the woman in the home that's just at home kind of basically cleaning the house and taking care of kids. To me, that actually doesn't seem like a particularly traditional image of what a woman is in a traditional society. But then we've opposed that now with the woman who goes out, does all her studies, has a career, and once she's had a career, then she has children. And now we have this problem, which is, is all of these women in their 30s going to fertility clinics because they, they've waited too long. It's like, it really is a huge issue. And so I've been trying to advocate in some ways, even to my daughters or to people around me, which is that the women in the ancient world were involved, like completely involved in the world. And having kids was part of that. And they would have kids, but they would still be involved in church and community. Like the idea that they're at home, home, just at home with kids, like, that's a ridiculous. We don't need to give in to that. And women can have all kinds of activities and also raid their kids and everything, but the idea that you should wait to have children until you're older, that is definitely an error. That is a huge mistake that we've given into. Even Christians again, like I said, I grew up in a world where that was totally normal. The idea that you had to wait until a woman finishes her master's degree and then. And then had children. Like she's like already in mid-20s, like going toward the end of the year 20s, like, oh, what a weird way of thinking."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3481.84,"end":3692.4,"speaker":"Fr Josiah Trenham","text":"Well, I agree with you. Having a child, though, even in the way that we're talking about it right now. I'm sorry, but children are the most amazing reality. These are eternal Beings made in the image of God. And you, God used you to be married. And to have a child is an incredible miracle of collaboration, co creation with God. God doesn't do it without us. And forever, that child you've descended into one in your lovemaking. With the blessing of God, you've now become three. So there's the power. Chrysostom says the power of unity is expressed in the childbearing. It explodes, you shrink to one, you become three. And then that person is a perpetual bridge between you three forever and bears witness to your union. So every time you look at your children, you see a little bit of her and a little bit of him, right? The husband and the wife are in that person. And that child bears witness and will continue to bear witness in unique ways, ways for all eternity to their oneness, to their unity. So a single child, forgive me, is worth more than any job. I just don't buy it. A human being, a single human being, is more worth to God than the entire cosmos. Saint Simeon, the New Theologian, says that that's how valuable we are. So to have a child, to have two children, to have five children, this is the greatest thing. And I'm sorry, it's not just for the mom, it's also for the dad. I mean, why do men work? Work is way over glorified. We work so that we can have children and take care of the children. We work so that we can provide for our home. And forgive me, 80, 90% of men, they don't work in glorious jobs. It's not like they, they want to write books about how significant their jobs are. I mean, I'm not downplaying work. Work itself, if you do it for God and you do it for those that you love, is very satisfying and very beautiful. All I'm saying is that it's way over glorified in our culture. The public square is way over glorified. I'm sorry. The domestic sphere is the beautiful realm. Is the beautiful realm. And that's where even husbands get their, their motivation to come home and have your kids sit on your lap to call Daddy. Yeah, it's amazing to pinch your face to give you a kiss. I mean, then you, you feel alive and you feel like getting up. If you don't have any kids, it's hard. Unless you have a really meaningful job, what gets you up? Why are you going to go out and lay tar so that people can drive their cars over it? I mean, there's, that's great if you're doing it for Your family. And you're doing it because you want to contribute to. To, you know, the functioning of your local community. That's great. I'm not. I'm not trying to discount that. All I'm saying is that not only do we have to make an argument for, you know, respecting the domestic scene, we have to come to love kids again. We have to love human beings again. Human beings are the most incredible reality in the world. Young ones, middle ones, and even old ones, our elders. We're trashing the young and we're abandoning the old."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3693.04,"end":3695.08,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And that comes with it."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3695.08,"end":3696.16,"speaker":"Fr Josiah Trenham","text":"So that we can work."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3696.64,"end":3715.46,"speaker":"Jonathan Pageau","text":"Yeah, so we can work. And so, Father, what are you. What are you hoping with this. This maybe could be our. Our last question. What are you hoping with this conference? Like, what is it that you. You're trying to do? Tell us a little bit about the people you're inviting and what it is you hope to. To what message you want to bring forward."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3716.33,"end":3719.77,"speaker":"Fr Josiah Trenham","text":"Can we start with you? Since you're coming, could you tell us what you're coming for?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3720.49,"end":3766.3,"speaker":"Jonathan Pageau","text":"Oh, I'm really excited. I mean, I think this is great. I think the fact that you're the person organizing this gives me a lot of confidence about the vision that will be proposed. I really want to help people see the beauty, the kind of cosmic beauty of the image of marriage and how it's something that is there from Genesis 1 until the end of the book of Revelation. This image of the union of heaven and earth, of the bride and the bridegroom, it's just the story. And so I think being able to see it as this beautiful cosmic dance is definitely what I want to bring to this conference so people can realize that it's not just, although it is our life and our emotions, but it is one of the greatest ways to participate in the plan that God has for the world."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3767.98,"end":3795.6,"speaker":"Fr Josiah Trenham","text":"That's the conference right there. That's hilarious. I love that. That, you know, we Orthodox, we go to conferences. You know, we go to a lot of conferences, different Orthodox speakers. It's wonderful. But remember the numbers that we've got in this country. There's about 70 million Roman Catholics, about 70 million Protestants, and about 1 million, 1 million Orthodox in the United States. I don't know how many in Canada. Do you know how many Orthodox there are in Canada?"}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3795.6,"end":3796.88,"speaker":"Jonathan Pageau","text":"I don't know. I have no idea."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":3796.88,"end":4070.45,"speaker":"Fr Josiah Trenham","text":"Anyway, so we're. We're tiny compared to the Catholic and the Protestant world, but we share a lot of common virtues and important teachings. And I can't think of one that was more important to come together and to co labor on than to address the experiment. I love the way that you put that at the beginning of this talk. Address the failed experiment of abandoning marriage. Identify the many evidences that we have made a very bad mistake in abandoning marriage. And not just abandoning it, attacking it. And then coming together to lift up powerful champions who love marriage, who have thought deeply about marriage as an institution for the human race and as a bedrock of any successful society. Come together, make our unique contributions. This is not about the interior mystical life of the sacrament. This is about the public place of marriage. In any civilization that's going to thrive and is going to honor God and human beings, marriage has a central place which it doesn't have today. So I'm hoping people like yourself, like the esteemed Archbishop Salvador Cordiglion of San Francisco, the Roman Catholic Archbishop of San Francisco, he is a real fighter for marriage. He's a San Diegan, he's a Catholic Californian and he's been involved in the front lines of defending marriage here. California has kind of led the way in decimating marriage. Yeah, we're the ones who propagated no fault divorce. You know, we're the ones who have been wanting to promote a whole political redefinition of marriage. What's called now same sex marriage. He Archbishop Cordiglioni was behind the Proposition 8 here which was a huge controversy about 10 years ago ago. Actually more than that now I guess is more like 14 years ago in which we defined, we just reaffirmed natural marriage as between a man and a woman. No one thought we could do it and we did it pass Prop 8, the most crazy secular state in the union. California passed Prop 8 and it was only undone by our Supreme Court. Our state Supreme Court decided that they were going to impose some new who never before heard of right to same sex marriage. But it was Archbishop Cordiglioni who was really leading that fight. And after that he came onto the position of the Defense of Marriage Chair for the usccb, the United States Conference of Catholic Bishops. He's done a lot of work. I interviewed him about this in 2012 actually. It was one of the first videos I did on my channel. He's got a lot to offer. We're also really thrilled to have the leading sociologist of marriage in America, Dr. Brad Wilcox from the University of Virginia. Virginia. He has done so much work. His, his book, his best selling book last year Get Married was well received and he makes an argument for human thriving in numerous aspects of marriage if how marriage is designed to really enrich your life and make you more human. And he posits and then destroys many of the myths, some of which you've raised many of the myths that if you, you, you know, the more sexual partners you have, the more satisfied you'll feel that if you get married, boredom is going to come into your life, that you're going to be going to poverty if you get married. He confronts those myths and then he shows you the, the real reality which not true. It's just not true. It's exactly the opposite, in fact. So he's going to come a very fine Protestant theologian, a young and budding Protestant theologian and YouTuber Dr. G. Gavin Ortland, who has a very strong formation in the Protestant world. He's going to come and talk about the significance of love and marriage. I think this is going to be also very valuable. We're going to have some great live music from the Dirt poor Robbins from the Grades are going to come and sing, you know, this, their thematic music you really turned me on to actually. And I'm so thrilled that they're going to come. I think it's going to be really edifying. A lot of visitors are going to come. A lot of VIPs from California are going to come and I'm hoping that lots of people will come in order to rekindle or maybe for the first time, maybe for the first time have someone stand up and say, you know what, it's time to set the vision for marriage and to reaffirm the glory of marriage and its centrality in any good culture, any normal culture."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4071.57,"end":4112.2,"speaker":"Jonathan Pageau","text":"That's amazing. I'm really excited, everyone. So sign up. Come to the event. I think tickets are already on. People told me they already have their tickets, so tickets are on sale. They're probably going to go. So, so I'd love to see you there. Love to meet you there. And there'll be, you know, the have dirt for Robbins there. Father Josiah, all these, the, these wonderful people. It's going to be, it's going to be a powder keg of. I think it's going to be great. I can't wait to, I can't wait to go. So thank you for doing this. Dot com. Go there. Get your tickets, everyone. Thank you for your attention. Father Josiah, thank you as usual for your, your wisdom and your thoughtfulness and I can't wait to see you in California."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4112.68,"end":4113.72,"speaker":"Fr Josiah Trenham","text":"Can't wait to have you."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4114.76,"end":4129.8,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4130.36,"end":4194.39,"speaker":"Announcer","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthy, healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4194.39,"end":4199.24,"speaker":"Fr Josiah Trenham","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4199.88,"end":4203.64,"speaker":"Jonathan Pageau","text":"In the Equinox Active, an SUV that will help you get away with confidence."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4203.88,"end":4216.96,"speaker":"Fr Josiah Trenham","text":"Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4216.96,"end":4218.52,"speaker":"Jonathan Pageau","text":"To be with Chevy SUVs."}
{"episode_id":"SW - #405 - 2025-08-29 - Fr. Josiah Trenham - Marriage - The Bedrock of Civilization","start":4218.92,"end":4221.32,"speaker":"Fr Josiah Trenham","text":"See Watson or O'Reilly Chevrolet."}
