{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":0.32,"end":81.65,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I'm really excited to be here with Nathan Jacobs. I met Nathan several years ago as he was putting together a movie called Becoming Fully Human. It was really exciting to see that he was aware of the spiritual crisis that we're going through, let's say, in the West. And he was trying to kind of talk about it and propose some solutions. But Nathan is also a scholar who is associated with several universities. He's written papers, books. He is a visual artist. He makes paintings and illustrations, commercial art, and ultimately he's also a movie maker and also in a narrative sense where he has made just a regular story movie and is also working on some projects now. So I think he's the perfect person to talk about the moment right now, the moment in culture, re enchantment and how Christian spirituality is related to that. This is Jonathan Peugeot. Welcome to the symbolic world. So, Nathan, thanks for. Thanks for joining me in this conversation. I'm happy that you were able to find some time to talk to me."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":81.73,"end":85.89,"speaker":"Nathan Jacobs","text":"Yeah, my pleasure. It's been a while, but I'm glad that we're able to talk."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":86.35,"end":101.23,"speaker":"Jonathan Pageau","text":"So. So maybe tell people a little bit like a very quick. I mean, it's difficult because your journey is extremely complex, but maybe tell people a little bit about your journey of how you connect your art making with the scholarship and also with your own spiritual path towards Orthodoxy."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":101.55,"end":106.99,"speaker":"Nathan Jacobs","text":"Sure, yeah. That is a long journey. I'll see how brief. This is a long form, you know."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":106.99,"end":108.55,"speaker":"Jonathan Pageau","text":"Yes, it is a long form discussion."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":108.55,"end":609.49,"speaker":"Nathan Jacobs","text":"So you. Okay. But I'll try to not spend all of it on that. So I'm sort of a. I suppose you could say I'm an artist turned scholar turned filmmaker, which I really see as the convergence of those other two phases of my life. So in terms of art, I started in fine art, a very classical sort of fine arts, painting and drawing. I went to the Maryland Institute, College of Art in Baltimore, where I studied that. And that was really sort of what I was all about. Right, the visual arts. But. But then what happened for me is I ended up going into a type of existential spiritual crisis, specifically asking questions about immortality, the afterlife, God, whether I have free will, things like that. And that was induced, rather peculiar. I'll skip that story. But suffice it to say, I was very interested in things like hallucinogenics. And those played a heavy role in awakening those questions in me. And that started me down this road of inquiry about philosophy and religion. And that road took a lot of twists and turns. I had a Christian background. My mother was a Missouri Synod Lutheran, so very conservative form of German Lutheran, you know, her being German and Lutheran and then. But, you know, over time, and my father was not anything, which you know, sort of created a certain dissonance in the home, obviously certain things being instilled by her, but that created at least an inkling. She was very interested in apologetics. So I'd heard arguments in favor of Christianity and Christ and things like that. So I took that seriously as something to be considered. But as I dove into historical Christianity and sort of going down to its roots largely in the roots of Western Christianity started in Augustine, sort of worked my way out into the ancient influences in philosophy and then forward into the way that developed in Scholastic philosophy and then on into modernity, the more I became disillusioned with Christianity, actually, and over time became an opponent of it nonetheless. I had certain spiritual inklings about the world. I was convinced that God existed. I was convinced also that there was a significance to Christ, but I just wasn't quite sure what that really looked like. And so my own views were very. I suppose the charitable reading would be idiosyncratic. The uncharitable one would be heretical. Nonetheless, I dove into all these different philosophies and that journey went through bachelor's in philosophy and masters in church history and systematic theology and things like that, on into PhDs, a pair of PhDs. And so I ended up doing that whole journey and along the way, sort of started out hopeful that maybe there was something in Christianity, became an opponent of Christianity, an advocate of the God of the philosophers and all sorts of ideas that would not be in keeping with historical Christianity. Until in my doctoral studies, I discovered the Eastern Church Fathers. And I recognized this radical difference between the worldview I was reading about there and what I had studied for years in Western Christianity. And that initially just intrigued me in its own right, because I thought I had mastered the systems of Christian thinking. And so what on earth am I staring at here? So at first it was just intrigue, and then over time, the more I dove into it and explored, well, specifically metaphysics. Metaphysics is my area of main interest, and the metaphysics that was there, over time, I became persuaded of the worldview itself. And then when I discovered it was still a lived practice, right, there was actually an Orthodox church, gorgeous Orthodox church, only two blocks from where I lived at the time. So I went in there and saw, sure enough, I sort of scrutinized it because I was skeptical that there was still a through line between what I'd been reading in ancient writers and that. But sure enough, there was. That ended up sucking me in. And you fast forward seven years later and I'm an orthodox Christian. But along the way, also in there, I had this convergence with film where I had this opportunity. I had always loved movies and I loved the idea of making movies. And it was for a variety of reasons. Part of it was because I saw them as sort of the contemporary cathedrals, right? These works of art that required so many different artists and skill sets and talents to come together, which is why all those credits are there in the end, that come together and make something that one person couldn't make on their own. And so I just love that and I love that mode of storytelling and all that. But it's, you know, who does that for a living? That's not a real job, right? Like, people don't really do those sorts of things. But I had this opportunity because of certain artists I was meeting in the. In the film world along the way in my journey of studying philosophy and theology who were impressed with my talents. I had a background in not only art, but I paid the bills during my time of academic study in the commercial arts arena, doing digital art. As you mentioned, I was a 3D character modeler. I worked in the video game industry. They saw my work and they were impressed with that. They were willing to work with me at some point. I just couldn't resist the idea of I get to make a movie so its own long story. But I pulled together a team and resources and all this and eventually did the heavy lifting to get off the ground. My first feature narrative movie, which was Killing Poe, this, which is an ensemble college comedy. It's nicely layered the way like a Wes Anderson movie is layered, but it's not. It's not terribly deep. I wouldn't point to it as, you know, this is, you know, rich philosophical content, even though I think it's a good movie. But all of those things, once I had you sort of fast forward. I'm an orthodox Christian. I'm a college professor. I'm well published in philosophy, you know, in areas like not only modern philosophy, like Immanuel Kant, but also ancient philosophy of the church fathers. And I've made a movie now. What emerged was a group came to me who was interested in this trend in culture, considering the religiously unaffiliated. And they said, you seem like a great candidate to do something on this, right? Because you. Well, first of all, you're a former nun, right? Religiously Unaffiliated, I suppose I should define that. Right. The nones. N o N E s. Right. People who have no religious affiliation, as opposed to like a Catholic nun. You always need to get that out of the way in this topic. But so they came to me about that trend and they said, you know, you're a former nun, you're an orthodox Christian now, you teach in colleges, so you have exposure to this demographic, or at least a large portion of this demographic. You're an artist, you're a filmmaker. We'd be curious to see what you would do with this topic. And so I pitched really sort of an experimental documentary type film that would look at this group and open up a discussion both for the nuns themselves and for folks who are religiously affiliated. And. And lo and behold, they said they'd finance it. And that's what became Becoming Truly Human, which was the documentary that you referred to. And I thought that was just going to be this sort of brief aside where I stepped out of academia for a year, hit pause. I was teaching at University of Kentucky at the time in the philosophy department. And then I just go back to teaching. But anyway, that just sort of opened doors where folks said, we really like what you do and your unique voice in film and we'd like to get behind you. And so I decided to take the risk of jumping out and saying, well, I'll keep sort of affiliated in the Academy and continue to publish and speak and things like that, but I'm going to try to try this road in film because I love the convergence of ideas and art in this storytelling genre. And so anyway, fast forward now. You know, I have an arrangement. I now do this for a living. I have a first look deal with a subsidiary of Lionsgate, the movie studio. And I'm working on a host of other projects that are in development now. So I still publish, I still speak. I'm associated with Vanderbilt Divinity School, specifically their arts and culture program over there. But I suppose I can say I now make movies for a living or something like that. Anyway."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":609.65,"end":615.73,"speaker":"Jonathan Pageau","text":"Yeah. Which is a crazy thing to say in a certain matter. Like you said, not a lot of people get to say that. So that's wonderful."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":616.21,"end":618.69,"speaker":"Nathan Jacobs","text":"That's right. So there you have it. That's me."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":618.77,"end":664.1,"speaker":"Jonathan Pageau","text":"And so I think that you're really at an interesting point of convergence. A lot of the people that are re watching this video have been feeling this change in culture, let's say a return of narrative. They've been noticing it. A return. A kind of re. Enchantment in the world and noticing how that's a storytelling, especially how right now in Hollywood, in a lot of the movies that are coming out, there's a lot of politics in it. There's a lot of almost propaganda, like it's pushing towards certain ideologies and everything and realizing that good storytelling is one of the solutions to that problem. And how. So how do you see that? What is your perception that say of the place of storytelling right now in culture and how it can affect the world?"}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":664.9,"end":893.35,"speaker":"Nathan Jacobs","text":"Yeah, I mean, I do think that one of the things that you're starting to see is this shift in how folks take in information. And so much of that has to do with the general impressions. The fact that we can sort of dive into and become engrossed in an entire world. And by an entire world, I mean, on the one hand that goes to things like video games, right? We have these essentially virtual worlds and obviously we're moving into things like Metaverse, where it's even more so. But even I would say when you look at things like the phenomena of binge watching, where you end up being able to tell long form storytelling in episodic ways, that's a totally new phenomenon. And actually just sort of on that one of the show I'm working on a show which I don't think I'm at liberty to say what it is, but we're in the midst of writing season one, which will hopefully be launching probably a year from now. But it was such a shift in my mind from everything I'd learned about movie writing, script writing, to writing for an episodic series. Because in movie writing you're always up against the script page limit. Don't go over 100 pages. Right. And if you can come in under that, that's great. And usually that means a lot of condensing. Every line has to be very precise. And get rid of that thing here. And where can we cut? Whereas as soon as I started working on an episodic series, it was strange to realize you get to just sit there and live with characters and let them have inconsequential conversations insofar as you're just developing these characters. I actually remember the first notes I got back on. The first episodic script I wrote was, hey, could you add. Could you add this one, like long contemplative speech in this part here where they meander about? And I thought, I've never received a note anything like that. Can you add a disposable speech? That's them contemplating the existential place in which they find themselves. But that's part of the whole inhabiting those worlds and getting to know those characters in a way that you can't in the shorter form of storytelling. And so I think what you're starting to see in those areas as well is something that used to be restricted to novels. Right. You wouldn't be able to do that in a movie because it was just people didn't have the attention span for it. Plus it was typically in a theater. Right. The technology has advanced in a way where we're starting to be surrounded with those sorts of opportunities to engage in those worlds. And so I think what you're starting to see is that the ways in which people take in story and see the world and inhabit worlds and find characters that they identify with and get to know is really revolutionized by, on the one hand, the technology and the place in which we find ourselves in history. But then I think even Covid has changed it even further because people were forced into their homes, and what do they retreat to? And so sitting here on the inside of sort of the movie industry, I'm hearing all the conversations that are taking place about whether or not theatrical is forever changed and sort of forever in a different place, if not dead, and whether episodic and all of these streaming things are the new way to go, which, on the one hand is disruptive and scary for folks who have nostalgia for movies like me, I love going to the movie theater. On the other hand, I think it's actually going to amplify in some ways the ways in which we take in story and take in story in a long form that is much different than what we typically have in the past in this sort of visual medium and so on. So I don't know if that goes to the question that you're asking."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":893.35,"end":985.31,"speaker":"Jonathan Pageau","text":"I mean, I think kind of maybe one of the things that I've seen grow in the past 20 years, maybe 10 years even more so, is something like fandoms, for example. So one of the things you see in fandoms is you see people who attribute identity to these fictional world. They attribute. They put their identity into. Into these kind of these. Whatever it's manga or whatever, it's Star wars and all these different fictional worlds, and they have a desire to a certain extent, to participate. And so the whole aesthetic of fan fiction, the whole aesthetic of cosplay, and one of the things that I've noticed is that this seems to be marking a difference from just passive entertainment, where people are looking to find worlds in which to inhabit. Because in a way, they are dealing with the nuns problem. That is, they're dealing with a lack of cosmic story in which they can participate, which is something Christianity afforded us. And now they. Because the scientific kind of materialist world doesn't have much that to offer. You have a. You have a scientific materialist type who's obsessed with like My Little Pony or like. Or Star wars or whatever it is that people get obsessed with. And so that's been my kind of reflection about how people are starting to notice how stories are. That world building in the fictional sense is actually something which exists in our actual life and we need as a narrative frame in which we can inhabit."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":985.71,"end":1404.01,"speaker":"Nathan Jacobs","text":"Yeah, well, I noticed this in a slightly different way, actually, initially, not because of so much film, but as much as the research with the nuns. And this kind of goes to a project that I've been. That is currently in. Well, it's more than in development. It's sort of in the financing stage in preparation for production. But. And again, I can't really say specifics about what it is, but I think the background of it sort of goes to this and was the first time I was awakened to the phenomena that you're talking about. So when I was working on becoming truly human. You've seen it, obviously, I won't presume that everybody who's listening to this has seen it, but there's a series of interviews with nuns, right? This group of nuns that's supposed to be a representative sample of folks who are religiously unaffiliated. And in preparation for that, me and my producer, we went out and we screened, interviewed, I don't know, 60 plus religiously unaffiliated folks with sort of standard form, types of questions that we wanted to know where they stand on this, this and this. And over time in that data gathering, there was this sort of odd data point that emerged out of the process, one that I. It doesn't show up in the documentary, but it definitely made an impression on me, which was that 100% of the nuns that I interviewed believed in ghosts. And that was a surprise to me. And what was especially surprising was, okay, in general, the nuns are not atheists, right? So 90% of the nuns, on my finding, and that's actually the same with Pew in their finding, 90% of them believe in at least God or a higher power. Only 10% would identify as atheist. But even the atheists, right, who were like, I don't believe in God. Science, science, science. My apartment is haunted, right? And I thought that was so bizarre and so interesting. You know, even the atheists believe in ghosts. I thought, well, so this is. Is this an anomaly? Right. Of my sample. But then I saw this. This article, I think it was in New York Magazine by Clay Rutledge, sociologist who had also studied the nuns. And the article was titled something like, don't believe in God? How about UFOs? And the whole article was about the fact that if you think who the nuns are, are scientific, materialist, mechanical philosophers or something like that, you don't understand who the nuns are. And he talked about. His entire study was about how the way in which, as folks diverge from religion, there's this increased interest in the paranormal and the occult. And that was what his entire study was. And so looking at his research, I saw that he saw the same pattern there. And it's interesting because one of the patterns that you began to see there was. Well, there were really sort of two things that Clay identified which I had also noticed. The one is that as the narrative of religion was diverged from, there was a different search for a cosmic narrative that began to fill in. There was a sort of ad hoc worldview being formed concerning karma or fate. Right? The cosmos bringing about certain. Certain things to me, right. That are meaningful. There was a belief that the world itself is spiritual. There's the belief that our world is haunted. Right? And some of those spirits are good, some are evil. And then that was sort of. That paranormal occult sort of worldview was what started to fill in that gap. And it wasn't only just ghosts, right? In paranormal culture, there's several subcultures, right? There's alien culture, there's cryptozoology culture. And what you're starting to see, if you pay attention to the subcultures, is them talking to each other and starting to form new narratives based on the ways in which. Well, maybe there is a spiritual dimension to the Mothman, and it's not just some sort of strange crypto creature or something like that. Anyway, you're starting to see these new narratives emerge out of that from the dialogue between them. But one of the things that's also interesting is in Rutledge's research, what he was looking at specifically was also the connection between the subjective sense of meaningfulness and the delving into the paranormal and the occult. And what he found was there was an inverse relationship where the more you went into the paranormal and the occult, the lower your sense of subjective meaning went. And that's not surprising to me because I believe the occult is demonic. And so. So if it's really true that that's a spiritual vacuum of darkness, right. The deeper you go into it, the less meaning you should feel, right? It should cause that sort of vacuum, like state. But what Rutledge also at least speculates about is that then the turn towards certain social issues, like social activism or whatever it may be, starts to become the new sort of phase on the heels of that, right. As the paranormal and the occult begins to disappoint and fail to provide a satisfying narrative, there's a new narrative that emerges that sort of drives you in that direction. And then also I would point to. There was a dissertation. I'm blanking on the name, but I could dig it up. Dissertation that I looked at in Student Grand Rapids. Not in Grand Rapids in Michigan someplace anyway. But on reconversion of nuns. So folks like myself who ultimately ended up turning to religion and the ways in which ultimately their final turn, you know, when they finally discover a religion that they can embrace, they embrace it fully, much more fully than a lot of the folks who are sort of culturally this or that religion. And with that, all of a sudden, their beliefs adjust, right? So if they were, you know, heavily, you know, let's say, left leaning in their politics, all of a sudden, they might abandon some of those things as they engage in certain religious beliefs because those were actually symptomatic of the search for something else. It wasn't that those beliefs were driving them. And so what you see is. You see all these phases of. Of narrative trading going on where it's. The religion is providing one sort of storytelling and way of looking at the world. Paranormal comes to fill in the gap. When you abandon that, if that fails, you turn to a certain social narrative. And if you rediscover religion, you quickly abandon that one too. And I think all of this really does go to the point that you're talking about, of the sense that the idea of having some sort of framework by which to understand the world, some sort of storytelling that holds it all together and places me within a story. It seems to be something that humans just absolutely need. We can't get away from. It's part of our very essential nature to look at the world in that. In that way."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1404.41,"end":1479.04,"speaker":"Jonathan Pageau","text":"Yeah, you're totally right. You know, the. Just. Just now with Klaus Schwab just published his latest book called the Great Narrative. And so it's like the World Economic Forum basically telling us the primacy of narrative and how the world needs a story, you know, in which to inhabit in order to Kind of get through our problems. And it's. And it's like, yeah, they realize that this is necessary. Now the question is, what will that story be? It's interesting, like you said, that the. What we get, let's say, as Christianity wanes, although at first it looks like atheism, it ends up being something more like a kind of confused or broken down paganism of all these stories and conflicting narratives and the fact that people are obsessed with unexplained phenomena, right? So it's like an unexplained phenomena can obviously not give you unitive meaning. It's the very name unexplained phenomena means that you're constantly peering out in the darkness, like with squinted eyes and trying to figure out what these, what these things are, you know, and so, so obviously it's going to lead to this kind of, this kind of breakdown in meaning that people experience or the kind of nihilism, a kind of weird nihilism that still believes in ghosts and all these strange phenomena, right?"}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1479.04,"end":1618.79,"speaker":"Nathan Jacobs","text":"I mean, I do think this is an interesting contemporary misunderstanding of mystery, right? Because oftentimes what folks who are interested in that, that sort of unexplained phenomena, it's mystery is something that draws them in. And yet when you look at the concept of mystery in the ancient world, as I'm sure you know, like this concept, you know, mystery, the word itself, you know, originally, like moin, it's a verb that means to shut. And it. And it refers to the mystery cults, right? The initiation into mystery cults, where you shut your eyes, your mouth, the initiation ritual. And that's where, you know, Plato starts to use that to refer to the mysterious one, which is basically the initiated. It's not the person who doesn't see, right? It's the person who's been initiated. So they are familiar with the mysteries. And then in Christianity and Clement of Alexandria, for example, mystery then starts to be tied with people who again, are initiated and are Gnostics in the good sense, right? In the sense they're in the know and they all of a sudden are able to see patterns that were there before. So when you look at the Old Testament texts, they're cryptic, strange stories about people drowning and, you know, and giants and all sorts of bizarre stuff. And what does all this mean? And at least the way Clement and then, you know, Origen does the same thing, the way they look at it is that those stories, like in the Icon of the Transfiguration, where Christ, you know, goes up on Mount Tabor and he's transfigured and the apostles are there, or certain apostles are there who see this uncreated light. And then Moses and Elijah are also there and they're bathed in this light. At least the sort of spiritual reading of that was that the texts of the, you know, the law and the prophets are just cryptic texts, the true meaning of which is evasive, unless you actually see them bathed in the light of Christ. And so having been initiated, you being the initiated ones into the mysteries, actually now are in a position to understand what the patterns are there. You can actually see them properly. And so the irony is, oftentimes people today will completely misuse the term mystery because it means that stuff that nobody really knows as opposed to what it actually meant, which was you're initiated to know the stuff that people otherwise wouldn't."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1619.91,"end":1675.46,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, I think the fact that there's a notion that it's hidden or that it's secret or that it's a mystery and there's a little bit of the way we understand it now which is that the, the insight you get is beyond rational discourse and it's more experiential. And so once you have that insight, you can't, you can't communicate communicated at the level of the insight that you have. And like you said, then through that perception and light you can then see the patterns in the world. Whereas the occultist and the cryptic zoologist is only obsessed with. It's almost the opposite, right? It's almost the opposite. It's like facing all these things that I can't understand out here in the world, all these phenomena that are opaque and thinking that that's the mystery. It's like if I could understand the mechanical causality of Bigfoot, like if I could understand what species he is, then I would. Like what, like what would it."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1676.18,"end":1683.06,"speaker":"Nathan Jacobs","text":"Actually, he would cease to be interesting, right? He would cease to be interested. If I could understand the mechanical."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1683.06,"end":1743.84,"speaker":"Jonathan Pageau","text":"Like if I could add BigF to the encyclopedia, like, all right, but then, okay, like that's very much the opposite of, of, of. Like you said that this, this idea of moving into the, moving into the initiated mystery of, you know, of the light of the divine. Let's say that you find in the ancient stories it's very fascinating to see the opposite. Like I have a right in my town. They opened a school of witchcraft. Like it's like a two minute walk from my house, you know, and you can see it like just how. And it's also, it's also the Everything people criticized about Christianity, you know, is just there in your face. It's all about application. It's like, you know, can I get this? Like, what can I do to get this for myself? Like, can I get this some, something that they want, like a lover or something? And you think, wow, man, all the things that people accuse Christianity of is all there in this weird occult stuff, but it's lacking the higher principle that unites it all together into like one coherent story."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1744.4,"end":1745.04,"speaker":"Nathan Jacobs","text":"That's right."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1745.28,"end":1746.08,"speaker":"Jonathan Pageau","text":"Very interesting."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1746.96,"end":1826.78,"speaker":"Nathan Jacobs","text":"Yeah. And I suppose one last thing on this. I mean, one of the things that I noticed early on when I first started looking at the religiously unaffiliated was it was interesting to me to see the perception of the phenomena by, well, both on the one hand, sort of classical apologist, old school, sort of boomers, evangelical types, and then on the other side, the new atheists. And they both were interpreting the data the same way, which was that they're like, okay, this means that there is a dispute going on between Christianity and atheism and because those are the only two apparently talking, but there's a dispute going on between those two and, and the atheists are winning. And now this large spike means that they're all becoming atheists. Right. Thanks to the, the, the insightful arguments of the new atheists. And what was fascinating to me when I looked at that is I realized two things. First of all, that's not true. And incidentally, just as a slide before I finish this point, it is interesting that with my documentary, which sort of gives a platform to the nuns, the people who hate it the most are the new atheists on the one hand, and the very staunch evangelicals. Yeah."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1826.78,"end":1828.38,"speaker":"Jonathan Pageau","text":"Because they're of the same nature."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":1828.83,"end":2022.63,"speaker":"Nathan Jacobs","text":"They are of the same nature and they're looking for the same thing. Right. They're expecting to hear the same thing. And so when it completely disappoints in that sense, they're really upset because it doesn't reinforce what they're expecting to hear. Which they're expecting to hear exactly that. Right. There's been this debate and new atheists are winning. There's just no good answers and so on. But I think the more accurate assessment of what's going on is that there's a real sense in which the new atheists and the classical sort of evangelical apologists, they are cut from the same cloth. They're just modernists. There's nothing you're going to find in that discussion that you can't find in John Locke and Bishop Berkeley. And you Know, and, you know, Spinoza and Hume and whoever, right? It's a modernist discussion just sort of reheated and put into the. Into the culture in its final phase, we could say. Right, in its final phase. And so the problem is, though, the nuns. It's not that the nuns are looking at the discussion saying, oh, I think these guys are winning over here. They just don't connect with it. They're not modernists. And so what's happened is not that one side is winning the debate, it's that both sides have lost the audience. And so what you get is these nuns who. These folks who have disconnected and are like, well, I don't connect with the faith I was raised in. There's something that's sort of missing there, which I do think is a mythologizing piece that you mentioned. And so I've disconnected and gone on this journey, but I also don't connect just as much. I don't connect with the new atheists. Right. That. That's something I don't connect with either. And so I think what you find is the nuns are really. Because they don't have a clear guide through those things. They're just sort of spiritual ships at sea. And I think that there's something good and there's something bad that's emerged out of that. I think the good thing is that they function on what you might call intuitions, right? So there are certain moral intuitions that there is right and wrong. Now, they're not doing it super sort of analytically, right? But they have this vague sense that there really is real right and wrong. They have a vague sense that there's meaning in the world. They have a vague sense that. Meaning that what they mean by karma is obviously not, you know, an escape from a cycle of rebirth because most of them are unsure what happens when you die. So. But they do mean, like, what goes around comes around, right? Good deeds somehow come back to you in the cosmos and things like that. And so there they have this intuition that justice and reward is somehow tied into this whole system. So they have these. They have a sense of the world is spiritual, that they're spiritual. They don't really know what to do with that on a practical level, but there's all these sort of vague intuitions. And I think, on the one hand, I think there's something good and right about that. Right. I think we are not just minds. And so when we function like rationalists who neglect these other sort of ways of intuiting things about the world, we really Neglect something very important about understanding the world. And so there's something to be said that's positive there. But I think the problem is just like, if it's. You're purely a rationalist and you ignore those things, if it's just intuitions without the guide of reason or anything like that, you run into other problems. And that's where you just get neo paganism, which is exactly, you know, what you're talking about there."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":2022.63,"end":2111.99,"speaker":"Jonathan Pageau","text":"Yeah. And the kind of New Age mush or people, you know, falling into gurus and all that kind of stuff is just. Yeah, it's a. It's just all these different things that are going on as the Christian narrative is being pulled out of society. We're seeing all these things going on. But I, I do feel like there is a. At least I've seen in the past few years, there's been a new space that's been opening up for, say, for talking about Christianity in a new way or it's not a new way. It's really the old way, but it's, it's the new way that it's the way that people haven't heard, which is exactly, let's say I imagine the same Fathers that you discovered. St. Gregory, St. Maximus the Confessor. All these Fathers seem to be offering a solution to the, to the problem, like to the problem of consciousness, even the problem of, you know, the limit of the viewer. All these questions that are happening in the different fields we can find in someone like Z Maximus. You know, I did a conversation with Father Maximus Constance just a few weeks ago about Zimax the Confessor. I was really surprised. Like, it went up to. It went up to like 20,000 views super fast. I'm like, this is a bit opaque a subject, but. No, it's not opaque. A subject like Saint Maximus is really key to the issues that we're going, that we're, that we're dealing with now. And so, I mean, maybe you can talk a little bit about how your encounter with the Church Fathers, let's say, shifted your own worldview and how it kind of led you out of this, this. Of the rationalist mind."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":2112.55,"end":3169.02,"speaker":"Nathan Jacobs","text":"Yeah, yeah. I mean, no, that's a, that's a big topic, but sure, let's, let's, let's give it a whirl. So I think, you know, for me there were, there were a couple of different things that was happening and I don't know that I can talk about the way they, they were such an antidote to where I was at without talking about exactly where I was at. So when I dove into, you know, historical Christianity, optimistically, like I said, I thought there's some significance to the person of Christ. I'm pretty sure that's true. So maybe, you know, maybe delving into historical Christianity will be the right road to get to whatever it is that I'm looking for. But it was heavily disappointing. And I think one of the things. As I dove into Western Christianity, I started finding certain patterns in the metaphysics that I found deeply disturbing. And those deeply disturbing patterns, they concerned anthropology, they concerned creation generally, and they concerned the doctrine of God. And so I'll try to go as quickly as I can through these things, knowing that it would take much longer to go at the depth I'd like to. But I'll start with sort of the anthropology of it, right? So obviously most folks are familiar with the doctrine of original sin and the entire idea that somehow we're guilty for Adam's sin and we're somehow crippled and incapable of doing things that are pleasing to God. And. And when I really looked at Augustine, what. What was notable to me there was that what you find is what's typically referred to as this nature grace divide, the idea that nature can't, of its own right, ever, you know, in itself be pleasing to God. And the context for this suddenly became clear to me as I was looking through and looking at the work of Augustine, because Augustine had essentially introduced this framework of merits and demerits and. And the sort of thing that became normative for the ways in which Catholics understand our relationship to God. And then that became, you know, came to the fore at the center of the Reformation. So essentially, Augustine was looking at the question of, you know, Scripture talks about righteousness or, you know, justice in the Vulgate, it's Justitzia, right? And so what is it talking about, right, that, you know, this justice of God or attaining justice, what does that look like? And Augustine ended up developing this concept of the order of affections or the order of loves. And the idea is that whenever I engage in activity, there is a certain draw or a love to a perceived good. But many goods are in conflict and we can't have them at the same time. So if I'm resting on the couch and I'm enjoying myself, I'm at ease. But then I think I should get up and work out. I now have conflicting goods, right? I have the good of ease and comfort, but I have this other good of, well, whatever it is, vanity, but let's say of health, right? And Those can't be had simultaneously. And so when I make a choice, there's a certain hierarchy of affections that begins to emerge. And so the idea is that Augustine presumes that every choice we make has a hierarchy of love. It's reflective of certain priority of those loves. And he suggests that the just man, building on the Latin justitia, which means that you render to each its due, that the just man, his internal order of loves is reflective of the external order of goods in the world. So Augustine presumes that goods are not just subjective, they're objective, right? God is really superior to creatures, angels are superior to man, man superior to animals, and so on and so forth down the chain. And so he suggests that the order of loves of the just man mirrors the order of goods in the cosmos. And so early on when Augustine is dealing with this question and he's like, okay, so what do I do if I look inside and I realize I have disordered loves? And early Augustine, pre Pelagius, he says, well, you just will to fix it, right? You just change it, right? And then the Pelagian dispute comes along and there's this entire dispute prompted, well, less so by Pelagius, but more so by his disciple Celestius. But nonetheless, the Pelagian dispute kicks off and Augustine's facing this question, well, in what sense is salvation from God? Or in what sense is it from grace? If it's just me willing certain orders of loves and those things are pleasing to God, what is God doing in this? And so this is where Augustine, dealing with the Pelagians, introduces this framework that really suggests, well, actually my order of love, it's actually not in my control to make it just. What I need is I need God to come in and I need him to fix that order of love so that I can do deeds that are just and that are pleasing and meritorious before God. And this is where the sort of later development of the concept of original sin comes from, that there's not only an inheritance of Adam's guilt, but there's also an inherited disordered order of loves that I can't fix. Now, Augustine admits, like, sure, you can go ahead and you can choose to steal or not steal, murder or not murder. But insofar as it's coming from these disordered loves, it's never pleasing to God. This is a necessity of sin, right? It's always corrupt, it's always sinful and so on. And so you need this sort of supernatural intervention where God flips those order of loves and suddenly gives you internal affections from which you can do things that are pleasing to him. And then to make sure that Pelagius didn't have a leg to stand on, he suggests that even in Eden before the fall, even though Adam could have done things that were pleasing to God, it was only because of this prior grace that you know, comes into the, that that's there already from the outside, what he calls original righteousness. The other stuff post fall is called, at least you know, by the time of Trent, called provenient grace. But in, in Eden it's, you know, this original righteousness that's there, that's holding Adam's order of loves together. Well, the end result, what you get there is you get, you get a couple of different things that start to emerge, right? The one thing that you get is this sense that nature really doesn't have the resources in itself to ever be good, ever to be truly pleasing to God on its own. There's always this need for this sort of supernatural intervention that adds a little something to nature in order to hold up the capacity to do good. It's true pre fall, it's true post fall. And this is what's called the nature of grace divide that nature is in complete on its own. It's capable of sort of rising up to the level it should to produce merits, you know, before God. And then that brings with it also an inevitable, both anthropology and theology. So on the theology side, what you end up getting is you get Augustine insisting that essentially somebody who is corrupt, let's say me, I'll pick myself so as to not pick on anybody, right? I come into the world and I have guilt from Adam. Well, I'm already not ow anything from God other than justice or punishment because I'm guilty for sins. But then also because I have these distorted order of loves. Even if I try to do good things, I end up doing corrupt things that are sinful. And so again, I'm only owed punishment from God. And so what's needed is an act of mercy on God's part. But because I'm already owed punishment, God doesn't have to give mercy. And so this introduces a sense of arbitrariness on God's part where he could show mercy, he could not, right, sort of up to him. We should be grateful if he does not, surprised if he doesn't still praise him for his justice if he damns me, all that sort of stuff. And that's sort of the initiation of this type of volunteerism that happens in God where it's all in some sense arbitrary, in the true sense of arbitrium. Right? It's just God's choice, what he wants to do. And then also on the nature side and the anthropology side, it ends up creating this sense that any optimistic notion of human nature is inherently flawed. It's inherently flawed because if we really understand what I am, without this sort of supernatural underpinning, I can't do anything that would ever be pleasing to God. And so there's that necessity of sin that's sitting there. And this is the sort of way of looking at God and at man. And some of the doctrines that emerge that struck me as in inherently problematic. I realize that many Christians are committed to, you know, trying to defend God. And so they want to say, well, you know, they'll. They'll go to the, you know, the defense that says, well, sure, you know, I mean, you know, you know, God is just. And we should be thankful that he saves anybody. Right? And that's sort of the nice formal argument. But when we really look at this question, I think, you know, the more honest folks who are like, well, so if I come into the world crippled, incapable of doing anything pleasing to God, and God decides to send me to hell and I'm going to burn forever, and I had no capacity in order to undo that, that just seems actually evil, right? It seems. It seems unfair. It seems unjust. It doesn't seem good. And also, I think there's, you know, anybody who wants to look at human nature, and I say, I think there's something in there that is good, even though we're all flawed and we have problems. You know, the Augustinian anthropology is so pessimistic that it's really hard for folks like that who see something in humanity that. That's always redeemable, that. That strikes us as problematic to read Augustine in the Confessions, like, going on and on about, you know, the pride of an infant that has the audacity to gnash its teeth and demand that it has its mother's breast. And, you know, just seems too cynical of an anthropology. And also in terms of the cosmos itself, I think myself, like the other nuns, it's very difficult to suggest that somehow there is this innate deficiency in nature that you see in Augustine. Anyway, this is a much, much longer conversation. But the point is that what I started to see in. In God, in the picture of God, what I started to see in the picture of man, what I started to see in the picture of the cosmos, it just seemed untenable to me. It seemed to violate the intuitions that I had in terms of what I saw as the sort of redemptive root in human persons. It seemed to denigrate in some ways the goodness that I saw in creation. And the real problem with the theology of it was that everything that I embrace in terms of the most natural tether that I had to God was actually in the realm of conscience. The entire idea that somehow I look out into the world and I see these transcendent values like beauty or I see moral values or things like that, those were the things that, from where I come down philosophically was the idea that those are the intuitions that grab hold of something transcendent, a transcendent root that's not just there in the material facts and which are my clearest through line to identifying who God is. And so if there are certain doctrines that are emerging that are obviously violating my moral intuitions, which things like original sin did, then this seems problematic as embracing this as somehow a true theology. So long prelude to reaching the Eastern Church Fathers When I started reading the Eastern Church Fathers, I found that so much of what they considered problematic, or what I considered problematic, I should say, in this sort of Latin, Augustinian, Western Christianity and I had rejected and overtly opposed. I found first of all not only did they not have those doctrines, they did not have the doctrine of original sin the way Augustine did. They didn't have the nature of grace divided the way Augustine did. They did not have an arbitrary deity the way Augustine did. And I say Augustine, but I mean it flowers of course into the Scholastics and beyond, into Reformation, post Reformation Scholastic theology, Catholic and Protestant. Not only did they not have those doctrines, when they did speak on those topics, I saw a very different sort of theology that was there, a very different way of looking. So I saw for example, that in their anthropology I thought it was fascinating that when they looked at the doctrine that man is an image of God for from Genesis that were an icon of God, that you really had this robust theology of image, right? So Plato talks about two different types of image. One that is sort of non substantial, like shadows, right? But then these other types of images, like reflections, have some sort of, you know, substantial connection. They're substantial thing. And Plato, of course, he's always interested in definitions and essential properties, right? Squares, four sided, whatever it may be. When he's looking at the definition of what is an image, something that really intrigues him is the fact that images are essentially referential, right? It is an image of. And you need to fill in the blanket and refer to something that's not it, namely its archetype. And I see this. You know, this comes through in some of the ancient talk of idolatry as well as images in the Old Testament. But the Church fathers really see it as significant anthropology, because if what we are is images of God, they presume that essential to us as human beings is that we have a connection with our archetype, which is God. And so the stark contrast between nature, grace is actually that there is an essential, unbreakable connection between me and God. And it's that connection that actually makes me susceptible to participating in God. And so the fall, rather than being sort of this loss of some, you know, arbitrary gift that God may or may not give, really had to do with just a distortion or a covering or a tarnishing of something that's there. And redemption had to do with sort of untwisting that or unbury. Because essentially human nature was this sort of root connection with God that could never be broken or destroyed, which was such a stark contrast with the nature of grace divide when talking about God. You know, the idea that God essentially wills the good of creatures such that people like Athanasius suggest it would be unworthy of God. Right. It's out of step with God's character if, you know, if humanity falls, demonic schemes take over and he doesn't redeem us. Right. Like that's inconceivable. And in fact, it's interesting when you look at certain things, like the Philippellia of Origen, which is edited by, you know, of Caesarean Gregory of Nazianzus. So it's sort of a proved text of origin. The ways in which, when they look at this, it's really sort of certain readings of scripture, such as Romans 9, where God maybe sort of just chooses Moses to bless and Pharaoh to destroy, which is a sort of common Western trend, at least in certain theological circles, they dismiss that as obviously false. Like it's not even a possible reading worth entertaining because it's so out of step with how they see God. So far from an arbitrary character. There's this sort of insistence on the goodness of God that drives toward the providential care for and redemption of the creature. And that is this relentless pursuit that sort of always serves as a buttress against any sort of arbitrary dealings with humanity of the kind that you would see in the Augustinian theology. And then with that, you see this intersection between nature and man, where it's not just the idea that we are made to participate in God. That God is some way meant to be eminent within us as icons of God, but that's also meant to go from us to the rest of the cosmos. So far from this sort of lowly picture of nature as some sort of thing that is on this lower level of a nature grace divide, Nature has again this sort of destiny of participating in God, becoming a conduit or vehicle for God and the tether to that which is the icons of God. Man, for example, have this unseverable connection with it. And then even in terms of redemption, what you see is that redemption is really seen as the Creator, God himself entering the creation in order to redeem it and restore it from within. Because God is so relentless in that pursuit of the creature. So when I started to see that picture, the contrast was so stark between the systems of Western scholasticism, which then persisted in various forms in modern philosophy, people like Leibniz, and what I saw in the Eastern fathers. And that shift that took place was so monumental. What I really saw there was that all of the intuitions that I had from the God of the philosophers and I was trying to construct, you know, this something that was a cohesive way of holding together my moral intuitions, spiritual intuitions and all the rest. I realized that I didn't need to construct it. Right. It was already there in these fathers. And not only were they claiming that it was there, it wasn't just sort of a system of philosophy according to them, right. It was the system of the cosmos. Right. Because it was rooted in the very facts of the nature of the world itself and this event of the incarnation."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3169.18,"end":3244.85,"speaker":"Jonathan Pageau","text":"So that's. I mean, I think I totally, obviously, I totally vibe with what you're saying in terms of the difference. I find it interesting that. Cause when you were talking about this hierarchy of loves, I actually just did a conference for. For a college here in Ontario about Dante and his hierarchy of love. And I feel like there's still like, even in the west, there was still some cause in Dante you get a sense in which the world, you could see it in different ways. Like you could see the world as this permeation of God's love that descends through different intermediaries all the way down into hell. Or you could see it the other way, which is levels of separation depending on how your loves are oriented. So it seems like there's still possibility within even the, at least the Western storytelling to find versions of something which is more like the notion of God's love, which actually fills up the world and is, you know, like the idea that. Like St. Ephrem's notion that the fire in hell is God's love, basically, you know, that it's actually this. This fullness of reality. And so, anyways, I just thought of that because I just did a conference on that. On this idea of how the goods fit into each other in Dante's scheme, let's say."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3244.93,"end":3361.92,"speaker":"Nathan Jacobs","text":"Yeah, well, I do think you're right. When you look at. Also, I mean, another place you can look is Bonaventure. Right. So you do see especially, I think, in Franciscan strands, especially, but not exclusively in the Franciscans, I think you do see these remnants of this sort of cascading divinity, which is really, I think, the picture that's there where when you look at the Eastern Fathers and you look at the idea of what the cosmos untainted, you know, unfallen is supposed to be, and then what is supposed to become again through redemption, what you really do see is this sort of, you know, this trinitarian sharing of divinity. Right. In the sense that you have the Father who has, you know, the divine nature and gives it to the sun by beginning and spirit by spiration. And then that these are supposed to then cascade down into the hierarchies of angels. Right. You know, that, you know, the nine. The nine hierarchies that you see there, where there are higher angels and lower angels and some have a greater capacity for God than others. And it sort of cascades down into these, which then cascades into the lower order of angels. And then they're ministering spirits who are supposed to, in some ways, cascade, administer to us as human beings. But human beings being this sort of hybrid of spirituality and organisms who have within us the material of the cosmos is supposed to then cascade from us to lower things, you know, such as animals and plants and all things are supposed to participate to whatever degree they're. They're able. Right. And this is where I think an analogy I always like to use is to think in terms of, you know, the sort of creative genius of a musician. Like, let's say, you know, we'll just use Bach as shorthand. And if we had Bach here and we wanted to show forth his genius and let an instrument participate in it. If we handed him a triangle, Right. He. He can't do too much with that. Right. I'm sure he could do things that would impress us more than I could do all that. But it's very limited. It's inherently very limited in its capacity. Yeah."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3361.92,"end":3363.44,"speaker":"Jonathan Pageau","text":"And the nature of the object itself."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3363.76,"end":3367.12,"speaker":"Nathan Jacobs","text":"Yeah. And whereas we give him a piano. That's a totally different story."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3367.52,"end":3385.86,"speaker":"Jonathan Pageau","text":"Yeah, but the triangle can participate in the good fully, right? To the extent that it can, like a rock can participate in the good fully to the extent that it can actually. It can't participate more in God without actually abandoning its own nature, like it has to in order to preserve its identity. It has to be at its level, let's say."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3385.86,"end":3946.67,"speaker":"Nathan Jacobs","text":"Yes. And yet then if we place it in the context of an orchestra, it has a greater share in it. Right. In the sense that now the triangle, even though it's still bound by its inherent limitations, it's sort of wrapped up in this larger participation of an orchestra itself. And that's really what you see there when you're talking about this cascading divinity, all things participating in God to the extent their nature allows it. And yet, because there is this broader participation in the whole of the cosmic organism, even the things that are lower and have limited capacities, like rocks, end up participating in greater degrees than they could on their own. So I think you see that that's clearly the picture of the Eastern Church fathers and the way they see the cosmos. And I think you're right to see people groping toward that or trying to retain that in some ways in various aspects of Latin. But I think this goes to another area that struck me as critical in terms of difference between east and West. And this has to do with the topics of divine simplicity and the essence energies distinction that you end up seeing there. So in the Latin west, one of the sort of critical moments that happens in Augustine's own thinking is this idea that God is a super, super simple essence. Right. Is the term that he ends up using. And this is largely due to his. The influence of Platonism. Now, I'm not doing the dirty trick where you say, like, oh, it's Platonism. So it's actually big fan Plato, big fan. A lot of truth there. Big fan. And I think there's a lot of resonance in, you know, between Plato and the Eastern Church fathers and things like that. But Augustine probably had a little too much fondness for Plato. I believe the quote went something like, I am convinced I will find nothing in the writings of the Platonists that conflict with Holy Scripture probably is a tad too optimistic right there. But nonetheless, this idea that working within a certain understanding of Platonism, the framework Augustine ends up adopting is that really what you have is you have the forms, these archetypes that are the models for material instances. You have the archetypal square of Four sidedness, equal length. And then you have instances of square and the instances are always related to materiality. And that's where you get definite size and get color. And you can also have imperfections and number and all that sort of stuff. And yet the forms transcend all of that. And so they transcend those sorts of accidental properties. But then for Augustine, you know, God is, you know, the good or the form of the good that transcends even those other forms. And so there's a certain simplicity that emerges there that's even above that of the forms. Because a square, for example, has four sidedness equal length. It's complex, right? So it's essential, but it's not simple. And God is beyond even that. Well, that creates all sorts of challenges that basically set the tone for most of what the Scholastics are going back and forth about. It sets all sorts of challenges for Scholastic theology precisely because when you start to ask these questions like, I mean, there's obvious ones like the Trinity, if you have super simple essence, how do you have several persons? But even issues like divine knowledge, right? If God doesn't have accidental properties, because accidental properties like, you know, color or size, the shifting properties are properties of matter and God is above all that, and God can know that. I'm, you know, waving my hand right now, isn't that a shifting property in God? Or if I make a free choice, and my choice could be otherwise, doesn't mean that's, that's a property in God that could be otherwise. And, and so how do you have God have knowledge of the world? Or how do you have God make free choices himself, if free choices are choices that could have been otherwise? And, and all these sorts of things that unfold in Scholastic thought that become major problems for how to embrace this sort of form of, you know, this form of theology, or you know, the Platonism, the simplicity doctrine, while still affirming the things of Christianity. And one of the things that you begin to see is one of the standard solutions in terms of how they deal with this is basically internal relations versus external relations. And so the Trinity is an internal relation, the super simple essence relating to itself as Father. And in this sense it produces a relation, also an identity not only as Father but also Son, and the love between those and things like that. So it tries to make the Trinity not an additional property or something like that, but a relational sort of phenomena out of sort of the essence self relating. And then you have external relations where, you know, God is the first cause, affects the material world in a certain way. And the effects are external relations of God that it in some ways sort of solve this problem. And that's how they try to do it. Incidentally, personally, I think most of these solutions don't actually work in solving this problem. But nonetheless they, they do their darndest to make sure that they, they, they try to make them work. But I think the big challenge that you see is because of the doctrine of simplicity and that particular form of the doctrine of simplicity, God is never really eminent in creation in the way it would be in the Eastern fathers. So grace, for example, officially, according to Catholic Church, right? It's created, right? It is created grace. And why is it created? Well, because it's an effect, right? When you're talking about the presence of God, he's present via the effect. So my order of love shifts because of provenient grace. And now I have an order of loves from which I can, if I freely cooperate, you know, produce deeds that are meritorious before God. But that's not in, in any way a part of God in me, right? This is God is in me via the effect that has been wrought upon me. And that's why grace is ultimately created, because it's all creature over here. Whereas for the Eastern fathers, yes, they talk about divine simplicity, but when you look at their talk of divine simplicity, there's all sorts of ways in which it's very different than that. So Gregory of Nyssa is very clear that, yes, the divine essence is simple, right? Whatever God is is one thing. This sort of, you know, the divine nature is simple. But he says, you know, but the persons aren't. Right. There's three of them. And then you see people like Basil of Caesarea saying, well, the essence is one, but the energies that exude from it, you know, those are, you know, how many they're. They're innumerable. Yeah. And so they start to draw these sorts of distinctions. And the reason this is critical is because when you look at the. I'm sure you know this about the essence energies, but rather than presuming that all your listeners do, I mean, the basic concept of this essence energies distinction is the term energy emerges from Aristotle, right? And it's initially emerges in the context of the unmoved mover and refers to a certain type of activity, right? So Aristotle being convinced that all this mutative changing stuff in our world has to stand upon something that's unchanging, that doesn't mutate, he had to draw, develop a term that refers to that type of perfect, non mutated Activity that his God would do. And so he draws the distinction between kinesis, which is progressive, incomplete change in motion, like building a house, you know, goes through stages and abandon it, versus complete or perfect activity, like seeing every time I look at you, it's complete in that moment. And then the Alexandrian Jews thought this was really useful way of talking about God and his activity. And so they start to embrace this. But unlike Aristotle, who had said that God's essence is energia, he is just nothing but pure, perfect activity. The Alexandria Jews drew a distinction between God's face and his back. Drawing from the story of Moses, right? Show me your glory and he can't show you my face. Nobody can see my face and live, but I'll show you my back. Which became interpreted, at least in people like Philo of Alexandria, like the distinction between God's essence, who he is in himself, and the energies, those aspects that exude from God and come down to us and convey who he is. And then that distinction plays its way out in a couple of different ways. In Alexandrian Judaism, there was also this notion of transference, where the operative powers that express a nature in some ways communicable. So the favorite metaphor or the favorite analogy for the church fathers is always fire and metal, right? That you stick metal and fire and then it starts to glow and burn and remove it. And now it has the energies, right? Or the energy of fire in it, of heating and lighting. It's still metal, right? But something of the nature of fire has been communicated to it. And that became the way of explaining things like demoniacs. How are. How. How are. Demoniacs have secret knowledge or superhuman strength or whatever it is, they're participating. They're energized by those things. They're participating in a foreign nature and the energies of that foreign nature. And it also became how they explained prophets, right? Energized by, you know, God or. Or by the holy angels and second Maccabees. Yeah, Holy was that energy is the Maccabees for war. And so. And that ends up in the New Testament and then in the church fathers. It's critical because they understand this is part of how you have two natures of Christ that don't get confused. And yet they commune with each other, right? The one energizing the other. And it also became critical to their understanding of us. And what is it that we're doing in Christianity? What is it that we hope for participating in the nature of God?"}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3947.71,"end":3960.67,"speaker":"Jonathan Pageau","text":"Now, the reason there's a way it's important to specify that the energies of God are God. They're not seen as a lower. Even though there's a distinction, they're not seen as a lower form of divinity or as some kind of."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":3961.71,"end":4085.44,"speaker":"Nathan Jacobs","text":"Right. And this is the critical point. This is where I was going with this. This because. Because there's a tendency to think in very binary terms, you know, in a Western context of there's the divine nature and then there's creatures. And what you get is a much more complex ontology when you're talking about the Eastern Church fathers. Yeah, there's the divine nature. There's the hoopasis, the subjects that have it and give it stasis. And then there's also these divine energies that exude from it. And what's fascinating is these are called, you know, by people like Maximus the Confessor. Right. These are the works of God that precede creation. Well, if they precede creation, then they're not creatures. And then you have this strange language. Like they're the things around God that are God. They're the processions that the energies. And so you get all these sort of strange. The strange foreign language to us that's there in people like Pseudo Dionysius and the Cappadocians. And yet, as you pointed out, everything about that ontology says these energies are God. And so, just like on the one hand, you know, you don't get to peer into my mind as it is, but you do encounter these things that exude from it. Right. The energies, as I'm speaking right now, these are activities or operations in my mind, and they are part of me. Right. And they are expressions of that mind. They are punctuated, finite, particular expressions of the nature of my mind. And so in the same way, the divine energies are that. And the reason that's critical is because if. If the energies themselves can be participated in by creatures. Right. An image of God or an image in general, an image is capable of participating in the attributes of that which it images. Right. Its shape, its color, things like that. If we are images of God and so can participate in God's attributes, which of the Eastern Church fathers refer to the energies, not to the divine nature, then what that means is those parts of God which is one of the words Maximus the Confessor uses. Right. Can be resident in you and in me and in a relic and in an icon. Right. And in nature, you know, in some."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4085.44,"end":4088.92,"speaker":"Jonathan Pageau","text":"Ways, necessarily so, because it's that which makes it exist."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4089.56,"end":4093.48,"speaker":"Nathan Jacobs","text":"Right, right. That, that. That does make it kind of important."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4094.04,"end":4097.52,"speaker":"Jonathan Pageau","text":"Yeah, but, but this Is where there that."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4097.52,"end":4161.41,"speaker":"Nathan Jacobs","text":"That divide right there. Even though it's obviously, it's a lot of metaphysics that I just went through, that divide is critical. So that even though you might find in the west this sort of hierarchy. And this notion of participation in this memory of a certain theology that's essentially Christian, the very fact that grace is created in the Latin west. And it's primarily just an effect on the creature as opposed to in the east, where it actually is God imminently present in the creature. It's part of God in the creature. That is such a, you know, a critical distinction in terms of ontology that has, going back to something you mentioned before, Remythologizing the world. And this is a critical feature of if you're going to talk about a mythologized world and talking about the sort of spiritual dimensions of nature like I talked about with the nuns, or spiritual dimensions of you or me. And the spiritual potential of the cosmos itself. This is where that sort of thing that you find in the Eastern Fathers, I think, is so critical to seeing how different the worldview really is. Even though it sounds very similar on."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4161.41,"end":4305.2,"speaker":"Jonathan Pageau","text":"Many points, I think in many ways it also comes, let's say, comes at a point where, let's say the strong dualities of modernity are kind of breaking down. And we can see already the problem of this created grace problem, or the creature as outside God, is also is the problem of a kind of radical duality. Even though it's maybe not formulated that way explicitly at the highest level. It ends up playing out that way where you have God above and then all these things that are created out there. And there's an arbitrary relationship of will between God and the world. Whereas this kind of way of mechanically describing also the phenomena in reality is breaking down. It doesn't break, doesn't hold. Like, it doesn't even hold in terms of cognitive science and in terms of the quantum physics and these new. These kind of limits of science that people are reaching. It just. It doesn't hold. And you need the notion of rather, the inevitability of meaning is something that I talk about a lot. Like the inevitability of identity and the inevitability of hierarchies of identity for the world to actually exist is becoming more and more apparent. And what, let's say the ontology that Saint Maximus proposes for us. It gives us a very powerful solution to avoid duality, to really have true non duality. You know, how people love non duality. The same access actually offers us a True non. Duality, which is not a collapse into a monad, but rather this like. Like you said, it's like this procession of energy, this procession of grace that comes down from God and brings everything back into God, doesn't deny the multiplicity of existence, but ultimately makes everything participate in this is hierarchy of meaning, this hierarchy of purposes. Maybe purpose is a better word even than meaning. Like it's all. Everything that exists has a ultimate purpose and that ultimate purpose is actually God. To the extent to which it can embed it into all these other things. Like a symphony is. The way you've portrayed it as a symphony is much better way to understand it. Like it's all playing together, like to kind of become the. Let's say the creation is becoming the lover of God, you could say, in a way that is fully unitive, like bringing it together into. Into him, as in a mysterious union. You could say, yeah, yeah."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4305.2,"end":4408.23,"speaker":"Nathan Jacobs","text":"In terms of. I mean, in terms of the sort of breaking down of the modern framework. The book. I just signed a contract with Cambridge University Press for my next book, which is called the Inevitability of Leibniz. And it's because I really do, when I look at Western. Not just Christianity, but Western philosophy, to whatever extent, it's an inheritor of the scholastic discussion that preceded it, which I really think it is. I mean, I think when you look at rationalists and even people like Descartes, like people like Leibish, people like Descartes, there really is. The conversation is still, you know, the tone of it is still set by the scholastic discussions that preceded in the Augustinian roots of those discussions and so on. And there's a real sense in which I think Leibniz's system of thought as repugnant as so many people find it to be. There's a sense in which I don't know that there's an escape hatch if you're going to embrace the Western premises concerning divine simplicity and the sort of theology that's there. And that's so much of what that book is going to be about is about the sort of rudeness that Leibniz has. He doesn't emerge just sort of ex nihilo. Right. You know, out of nothing. He's. He really is an expert in the scholastic thinking and systems that preceded him and of his own day. And he's a systematizer of them. Leibniz is explicit about this, that he's a systematizer of them and his entire, you know, theodicy and the idea of, you know, Ours being the best possible world and all that, and proceeding from these divine decrees of God, assessing all the possible analytical, you know, outcomes that are there and choosing the best. And so I think there's a sense in which there's no obvious escape hatch from Leibniz if you're going to accept the Western premises."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4408.39,"end":4435.6,"speaker":"Jonathan Pageau","text":"Do you think that some of the, like, multiverse type discussion and the infinite universe type discussion is a way that materialists are trying to deal with this problem? The idea that everything that exists can exist like that, you know, all possibilities actually physically exist somewhere in a vast infinite universe. That kind of, that kind of. I think it's nonsense, but it's like, it seems like it's people trying to grope with this problem. Like the problem of existence itself, you could say."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4436,"end":4542.24,"speaker":"Nathan Jacobs","text":"Yeah, well, I mean, I do think, I do. Well, I agree with you that I think it's nonsense, but. And I do think there probably is some of that. But the problem, the problem you inevitably run into is, you know, at least with a multiverse theory, at least when it's used as a way to try to explain existence itself, right. It always runs into the problem that everything about the multiverse theory requires the prior features of mathematics. And the features of mathematics are things that, as far as we can tell, are only accessible to and produced by and, you know, entangled with, you know, mind. And so you still don't sort of escape this sort of mental phenomena. And I do, I toy with this whenever I'm talking about ways that people try to, to escape liveness is that they'll, they'll either go to the absurd and they'll just choose randomness. And for some reason randomness is better than picking, this is incredibly rationalistic, you know, rigid system, or they'll end up, you know, just trying to multiply, you know, the number of possibilities that are there, similar way the multiverse does. But there's something that's inescapable about it once you've embraced sort of rationalist framework. And that's where I really do think the only way to truly escape it is to avoid the type of rigid ontologies and dichotomies that are there in the first place. And that's where you really do need the sorts of things that you find in people like Maximus and in the Eastern church fathers, which really do find an alternative, provide a very real alternative way of looking at the cosmos and at ontology and the ways in which God and world interact. I really do think that's, that's the only real Escape hatch. I don't think there's. I don't think there's another great look."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4542.32,"end":4589.69,"speaker":"Jonathan Pageau","text":"We'Ve been going for a while. So I think that's a good way to end, is like, there is no other escape hatch of likeness. So listen, Nathan, this was a really wonderful discussion. I really appreciate it. And we'll definitely. I'll definitely be keeping tabs on your upcoming projects. And once you are allowed to talk about your projects, you know, it would be nice to have you back into. Because one of the things I'd like to help people think of is how is it that artists today, especially artists that are Christian, how can they create in this world? Like, how is it that they create something that is both connected to the world in which they live, but is pointing towards the good and the true and the beautiful? And so that'll be our next conversation if. If you're okay with that."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4589.85,"end":4592.89,"speaker":"Nathan Jacobs","text":"Oh, yeah, yeah. I'm absolutely okay with that. Happy to do it."}
{"episode_id":"SW - #219 - 2022-02-14 - Dr. Nathan Jacobs - Theology for Those Who Don’t Fit","start":4593.29,"end":4674.33,"speaker":"Jonathan Pageau","text":"All right, so thanks for your time and everybody. Hope you enjoyed this. You know, you can find Nathan online. You can look, Nathan Jacobs has his website. You can see his writing, you can see his visual art, and also, you know, the two movie projects that we talked about. And so thanks, everybody for your attention and we'll talk very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar. All those links links you can find on my website or in the show description. So thank you and I will see you soon."}
