{"episode_id":"SW - #124 - 2020-11-16 - Jonah and the Upside Down World","start":0.88,"end":1709.48,"speaker":"Jonathan Pageau","text":"So I'm sure none of you will be surprised to find out that the story of Jonah is one of my favorite stories in Scripture. It is a story that I've thought about for many, many years, for 20 years. And I've explored also an iconography. I've made a few versions of the icon of Jonah in the fish. And I also recently made an ink drawing that I colored. And, you know, it just kind of plunged me back into the story of Jonah. And so I thought we could go over the story of Jonah, especially looking how the story of Jonah shows us the interesting inversions or the flips that happen at the edge of the world. We see it very clearly in the story of Jonah, how this is related to resurrection and how it is related to repentance as well. So we're going to look at all that together. This is Jonathan Peugeot. Welcome. Welcome to the symbolic world. So for those who do not know the story of Jonah, I will try to recap it as fast as I can. So Jonah is a prophet. He's a prophet of God. And God calls upon him to go to Nineveh and to tell the people of Nineveh that the city is going to be destroyed. And. And so Jonah doesn't want to go. He doesn't want to go to Nineveh. And it doesn't say in the text why he doesn't want to go. But there's a few things that you need to understand is that Nineveh is the enemy of Israel at the time. And so if you had to name the biggest enemy, it would be the Syrian empire, of which the capital is Nineveh. So God is telling Jonah to go there and tell them that God will destroy the city. So instead of going east, which is where he would be going if he went to Nineveh, Jonah ends up going west. He goes to Tarshish, which is related, it seems, to Spain. And so he leaves on the Mediterranean on a boat to go to Spain, going the opposite direction of where he's supposed to go. Now, you have to see it in terms of cosmic symbolism already. Instead of going east towards, let's say, the rising of the sun, he. He goes west towards the setting of the sun, and ultimately to the dark place or the bottom of the world. The bottom of the ocean is also related to the west, especially for people at the time. The west would have been seen as ultimately the place where the ocean is, where the great, you know, Leviathan is, the great serpent of the Oceanus, is at the edge of the world. Because the western ocean was seen as this. This massive flowing ocean that's on the edge of the cosmos. And so Jonah goes out and gets on a boat and leaves. Now, while he's on the boat, there is a storm, a massive storm. But interestingly enough, Jonah is asleep at the bottom of the boat. And during that time, the people in the boat are freaking out, and they're invoking their God and they're praying, and they're like, what's going on? Why are the gods angry at us? What have we done to anger the gods? And then they realize that there's one character who's not there yet, who's not with them. He's asleep at the bottom of the boat, and that is, in fact, Jonah. So they pull Jonah out, and they say, why you have to invoke your God as well? Because, you know, we need to figure out what's going on. We need. If one of our gods is angry, you know. So Jonah says, look, I don't even have to do that. I'm not going to invoke my God anyways. He doesn't want to. He says, I'm the reason. I'm the reason why the storm is coming because I disobeyed my God. And so Jonah says, toss me over the boat and everything will be fine. So the foreign mariners, these guys who are not at all Israelites, they don't want to do it. They don't want to throw them over the boat. That would be horrible. And so they try to find other solutions. They try to pray. They do all these other things, but ultimately they have no choice. And they end up listening to what Jonah says. They throw him over the boat. And so when they throw him over the boat, Jonah is swallowed by a giant fish. And the fish takes him down into the water, and he stays there for three days. At the end of the third day, that is when Jonah has his repentance. So he goes to the bottom of the ocean, and he has his this transformation. So what I'm going to do is I'm going to read for you Jonah's prayer, and we'll come back to it afterwards in terms of interpretation. But it's one of the most beautiful text to try to understand this flip that happens at the bottom, this flip that happens at the end. So Jonah prays. He says, I called out to the Lord out of my distress, and he answered me. Out of the belly of death I cried, and you heard my voice. For you cast me into the deep, into the heart of the seas, and the floods surrounded me. All your waves and your billows passed over me. Then I said, I am driven away from your sight, yet I shall again look upon your holy temple. The waters closed in over me to take my life. The deep surrounded me. Weeds were wrapped around my head. And at the roots of the mountains I went down to the land whose bars closed upon me forever. Yet you brought up my life from the pit, O Lord my God. When my life was fainting away, I remembered the Lord, and my prayer came to you unto your holy temple. Those who pay regards to vain idols forsake their hope of this, of steadfast love. But I, with the voice of thanksgiving, giving will sacrifice to you. What I have vowed, I will pay. Salvation belongs to the Lord. And then God spoke to the fish, and the fish vomited Jonah onto the dry land. So, of course, now Jonah has no choice. He goes to Nineveh to warn the city that God will destroy. But when Jonah gets to Nineveh and he tells the people of the city that God will destroy the city, the king tears his clothes and, you know, puts ash on his head and does all these penitent gestures and tells the whole city that they need to repent. And so the whole city fasts. It says in the scripture, even the animals fast. So the entire city fasts because of this news that the city is going to be destroyed. And then Jonah, and then God doesn't destroy the city. And you'd think Jonah would be happy, but of course, Jonah is not happy. Jonah says, I knew you would do this. I knew you would not destroy the city if they repented because you're a merciful God. And so he's extremely annoyed, and he decides to leave and goes east of the city, goes out of the city, and then he comes to a place where it's not covered. And so he sits there, and there's the wind and the sun. And he said, you know what? I just want to die. I'm just going to die here, okay? So he sits there, and during the night, God makes a plant grow. And this plant grows up kind of like a vine and ends up acting like a shade over his head and covers him from the sun and the wind. And so Jonah feels good about that. He's happy about to have this tree. But then again, during the next night, he. God. God destroys the plant. And so he wakes up and the plant is dead. And now God is extremely angry, and Jonah is extremely angry. And once again, he says, that's it. I'm done. I just want to die, you know, this is over. And then God answers him and says, so you are so worried, you're so annoyed that I destroyed this plan plant, yet you would want me to destroy the city which has, you know, countless people and animals. And then he says a strange thing about how they do not know their left from their right. And that is how the story ends. Now there's so much in this story I will not be able to. To, let's say, go through all the elements, all the symbolic elements. I want to draw a thread through it. And so don't call me out and tell me I forgot some elements, because I'm going to try to remember as much as possible, try to get into as much as possible. But obviously there's a limit. And so one of the interesting things about the text and is. Which was important to understand is that it seems very much that this story is a comedy, that everything about it is kind of upside down. It's meant to be funny because everything Jonah does is. Is kind of upside down. And you can. We'll see it as we go through how everything manifests itself in a. In a funny upside down way. But that it. This calm, this comedic aspect is related to the turning. We've talked about this in terms of the notion of the fool, of the world, of the fool. And so this turning is related to the comedy. And we'll see how this turning is going to. Is going to show us what is the. Some aspect of the mystery of the resurrection and, and repentance, of course, as well. Now, of course, the first thing that I mentioned is that right away at the beginning, Jonah decides to go the other way. He goes west instead of going east. And then he ends up on the waters. And so being on the waters and being in the land of the foreigner, from now on, he's going to face a kind of upside down world, but not necessarily in a negative sense, just in the sense that he is going to be. He's going to be in it all constantly in a strange upside down position compared to the people. So here he is in this boat. He is of course, asleep in the boat. Being asleep in the boat is already related to death. Him being down asleep at the bottom of the boat relates this to the ark, the ark of Noah, which has the animals inside the boat. His body is related to the boat. The idea of the bottom of the boat is related to the body. You have to understand also that when Christ is also asleep boat during the storm, this is all connecting to Jonah. So Jonah, in you Know, for example, in the story of the flood, Noah is the innocent one. And Noah goes through the flood on the ark to survive the flood. Now in this case, and he goes to move away from these strange hybrid mixture, mixture of these, these foreign tribe that have become warrior like that are Cain's descendants. Now here we have this upside down situation where Jonah is responsible for the flood and he's the one hiding in the boat. And the foreigners are the ones who are invoking God and trying to find the reason why there's a punishment on their, their boat. And so they, they, they, Jonah has to say, I'm the one responsible, right, and toss me out. They tell him to invoke his God to get God's mercy, but he says, just toss me out into the water. And the people don't want to do it. They don't want to toss them out into the waters. Now you have to see this, this structure as opposite and in a kind of a mirror image of what's going to happen when Jonah goes to the city, because in the city, he then blames the people of the city for the disaster that's about to happen. And when God saves them, Jonah is angry. Jonah wants God to destroy the city. Whereas here he is with these foreigners who don't even believe in God and they don't want to destroy him, who is the cause of the, of the, the suffering. And so you have to see the whole story of Jonah as this kind of, this kind of interest, this strange flip that's happening in the story. And so Jonah ends up. So they finally accept to throw Jonah overboard, and then he is swallowed by this monster which brings them down into the bottom of the ocean. Now, of course, he stays there for three days. This is something which will be brought back into Christianity in terms of the three days in the fish. But one thing I didn't notice when I told you the story is that when Jonah goes to Nineveh, it says that it takes him three days to cross the city and to kind of give his message. And so these three days are the same. There's a relationship between death, this animal garment of skin that he's now wearing. So Jonah is actually wearing a garment of skin, you know, as this fish which is protecting him underwater and the city, which is also in the ultimate, let's say, garment of skin which he's going to face later. So three days down in death in the, the garment of skin of as the fish, three days crossing the city, which is also related, like I said before, when you Talk about the city and the foreign city. It is related to Cain, to all this imagery which comes from before the flood. And so then Jonah has his. After three days, Jonah finally has his moment of repentance. And in this moment of repentance, there are powerful, very beautiful, beautiful jewels in the prayer that Jonah utters. Some amazing analogies which can help us see what is the. These analogies of death and of covering and of garments, of skin. And so he says, I called out to the Lord out of my distress. Now we have to understand the importance of understanding the idea that calling out unto the Lord is also an acknowledgment of distance. And so when you are far from the center, that is, when you call out unto the Lord. And so this is something which happens in Scripture. For example, after the fall, we see that there's the. There's the fall and the descendants of Cain, the murder of Abel, the descendants of Cain, the building of the city. And as this is, as they're leaving the garden, getting farther and farther away, it says, this is when men started to call unto the Lord, because there's this relationship between distance and calling to that which is high. It says, I called out to the Lord in my distress, and he answered me. So then he repeats it, and he says it in a different way for you to understand the. The distress. He says, I called out of the belly of death, and you heard my voice, for you had cast me into the deep. So distress, death, deep, the heart of the seas. You know, this idea of the bottom of the ocean or the edge, the bottom of the world. And it says, the flood has surrounded me. So look at all the images, amazing images which are brought together. Distress, death, deep, flood. And then he talks about these billows that have passed over me, right? So being underground under the water. And this is related. And he says, I am driven away from your sight. So here again is the distance. I am very far away from you, from you. You cannot see me. But he says, I shall again look upon your holy temple. And so now he's starting to give you images of what the. So he's at the bottom, and he's giving you all these images of the bottom. And now he's going to start to show you what are the images of what is above. And he says, I will look upon your holy temple. So the temple becomes an image of the place from which the voice of God comes, or the. The place from which the voice of his voice that's calling to God is heard. Okay, so he says again, the waters closed in and took over, took my life. The deep has surrounded me, right? This idea of being around, of, of wrapping around the deep, the fish, all of this I keep repeating, but there you go. But then he says, ah, weeds were wrapped around my head at the root of the mountains. Okay, so remember again the image of the high place and the low place. So he's descended at the bottom of the waters. He is down at the bottom of the, the mountain. And he talks about, he talks about the place where the bars closed upon me forever. And so the bottom of the world, the bottom of the ocean at the bottom of the mountain is also a prison of bars. And the bars are also related to iron. This idea of the city, we'll see it, you know, it comes back later in time in terms of Nineveh. But the city, what are the other images? Okay, and then, then, then he turns away and he says, then you brought up my life from the pit. Oh Lord, my God, when my life was fainting away, I remembered the Lord and my prayer came to you into your holy temple. So remembering, this is what I've been telling you guys from the beginning. The relationship between the margin and the center, between the low place and the high place, is memory. If you remember God, if you remember the thing that unites you, remember the thing that unites us together, it doesn't matter to a certain extent how far you are. It's the connection. Memory is being connected to something, even if you're far away from that. So remembering God is right away being connected to God. And so it depends on different places. For example, in the story of Noah after the flood and after they've been in the ark for very long, instead of saying Jonah remembered God, it says, God remembered Noah. And so remembering Noah and then Jonah remembering God, he is this, this connection, you can express it from one way or the other, right? You can express it kind of bottom up as emergence, if you will. And you can express it top down as a more hierarchical way of seeing it. And so he remembers and his prayer goes up to the holy temple once again, I told you the, the connection of the place of God as the holy temple. Imagine as something like the Garden of Eden at the top of the hill. And so, and then he talks about, he talks about those who pay regard to vain idols forsake their hope of steadfast love, but with the voice of thanksgiving, will sacrifice to you what I vowed, I will pay. Salvation belongs to the Lord. And so he talks of course, about, let's say, a Fake world of idols. But what's important to understand is the idea of thanksgiving, because one of the things that connects you to the center, also connects you to God is the idea of giving thanks for that which you have received. When you are bitter, when you are. When you forget what you have, when you forget what you have received, that's when you fall into fragmentation of death. When you remember what you have received, when you remember what. How you're connected together and you're connected to your origin, then you have hope, and you have hope of love, right? Hope of steadfast love. And he says, what I avowed, I will pay. And so he's actually saying, basically, I said I would, you know, I'm supposed to go to Nineveh. I haven't done what I said I would do, I will do. And then, of course, salvation belongs to the Lord. And that is when God speaks to the fish, that's important that he speaks to the fish, because there's this creation of the world, but it's represented in a very beautiful upside down way because it says, the fish vomited Jonah up onto the dry land. And so the fish, you can imagine the fish as kind of the earth coming up above. As God speaks, the fish comes up above, but then he vomits Jonah over onto the ground. So the humor continues right after this very powerful and beautiful prayer. So there's this upside down instead of, you know, instead of vomiting is a. Is a kind of meaninglessness, right? It's like. It's like spouting gibberish as something which was supposed to go into your belly, to be integrated into, is not integrated, and is. Is thrown out and is kind of thrown out as trash. So here's Jonah as trash on the side of the. On the side of the ocean, outside of the sea, and he decides to now go to Nineveh. So when he gets to Nineveh, this is, of course, what I mentioned before. There's a very strange thing which happens, which is that Jonah is made to be a false prophet. And this is where all the upside down thing is, is just becomes hilarious because Jonah said, you know, a lot of people say that Jonah told the city to repent and that if they repent, if they don't repent, God will destroy the city. But that's nowhere in the text. It doesn't say that. It just says, tell Nineveh I'm gonna destroy the city. And so he goes and says he's gonna destroy the city, they repent, and then God doesn't destroy the city. So Jonah is actually made to be a false prophet. And this is this strange upside down thing where in becoming a false prophet, he actually ends up saving the city, being what looks like a false prophet. He ends up being the one who saved the city, but also saves the foreigner. He is actually saving the foreigner by going through these weird tipsy, turvy thing. Now this is a little contentious for some people, but you can understand that there's something about that in the story of Christ that to the Jews, Christ appeared to them as a false prophet and they condemned him as a false prophet. But Christ ended up saving the foreigner, ended up not just saving the foreigner, but saving the city. Christ saved Rome. And Rome is really this image, the ultimate image of the city is of course Rome. I've note, I've mentioned to you before that there's a relationship between Romulus and Cain in have wanting to kill your brother and then after killing your brother, founding a city, there is a direct relationship. And this is a relationship that is until today still understood by Jewish scholars. Today they see Rome as being related to Cain and also to Esau, to this older brother which falls. Anyways, I don't want to go too much into that, but this is the interesting part. And so he becomes a false prophet and then the city is saved, the foreign city is saved. And of course Jonah is not happy with that. He is he, because he's been made, he's been made a joke, right? He's been turned into a joke. He's not happy of being turned into a joke. And so he goes now follows the. It's really, really fascinating. He actually follows the backward movement all the way into the Garden of Eden. Now you have to see that this is what has been happening all along. Jonah leaves the bottom of the flood, leaves the bottom of the water, is thrown up upside down, goes into the city which precedes the flood, right? Cain builds the city and the technologies which brought about the flood, goes into the city, saves the city despite himself, then moves out, goes east out of the city and goes into the land where it says that the light is hitting him, the sun is hitting him and the wind is blowing. So he's actually moving towards the spirit. But it's all in a kind of weird, ironic and upside down way. He's moving closer to the spirit. But he's not happy with that, right? He's not happy. And so God makes, you know, God makes this garden for him. He makes a tree grow and he. There he is under the shade of the tree so being in the shade of the tree or the shade of the vine is not just about being in the garden, but is mostly about covering. And so now we have come to a little mystery which is also hidden in the story, which is the three coverings. He. Just like in the temple, there are different veils. A veil of linen and a veil of wool and a veil of animal skins. Within the temple, here again, we also have the three coverings. We have a covering of a leaf, just like the fig leaf that Adam and Eve put on themselves as they were falling. Then we have the covering of the city, which is the covering which comes later as Cain falls and creates a social covering. And then at the edge of the world, you have this kind of monstrous covering, which is this kind of covering of death itself, which is represented in the tabernacle as these strange gopher skins or these skins that we don't know what the animal is of. And so the structure of the different coverings in the story of Jonah is the coverings that are found in the Genesis story, but are also the very structure of the tabernacle itself. All right, so back to the description. God kills the tree, puts him again directly in contact with the spirit and the son, but he can't handle it. And so he wants to die. He wants to go back down. He actually. He's in the garden. He's in the presence of God in the spirit and the light. And he's like, no, man, I want the tree. I want to die. I want to go back down into the belly of the whale. And so the whole thing is, you know, as in the Garden of Eden, God told Adam and Eve, if you eat this fruit, you will die. Well, here's Jonah, who's past all this. He's gone all the way up, and now he actually wants to die. And so God reproves him and says, you know, and this is one of the greatest mysteries. He says, I'm going to save the city. Are you angry that about. Are you angry that you. That you don't even have the garden? I don't just want to save the garden. I just don't want. I don't want to just save the high place. I want to save the low place. I actually want to save the city, not just the garden. And so there's a very profound mystery. And then he says the strange thing about not being able to tell the difference between your right and your left hand. And I think now this is a little more speculative in my terms. I think that this is referring directly to the Garden of Eden. It's referring directly to the idea that there's an analogy between these people that have repented and now they can't tell the difference between the right and the left hand. I did it opposite the right and the left hand. That is the tree of knowledge of good and evil. They can't tell the difference. And that there's a strange analogy between that and let's say, being saved and being above the difference between good and evil. That is at least what seems to be being suggested. And also because God says he's going to also save the animals, which is related to this notion of death and the garments of skin as well. Something that I've. I talked about quite a few times. And I talked about how, you know, as the mystic goes up the mountain, when I talked about Moses who sheds his garments of skin, but then when he reaches the very top, he receives them again in the. The pattern of the temple. So to God in the end says he wants to. Not just, he says, don't just be angry about the tree, but I want to save the city and I want to save the animal, even the outer covering. And so that is really. That you can see why it's really one of my favorite stories. And like I said, I just skimmed across the surface. There is so much more going on in that story that we could talk about. But. But it is definitely one of my favorite stories. And so if you, if you, if you like this story, go ahead and check out. Like I said, I've put out this image as a print and I've also put it out on different apparel that you can get. And so, yeah, so I'm just excited. Hopefully I'll have the chance to make another version of this carving because it is really not only one of my favorite stories, but also one of my favorite images. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there. To get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
