{"episode_id":"SW - #304 - 2023-09-08 - The Subtle Bodies of Angels","start":0.16,"end":1343.81,"speaker":"Jonathan Pageau","text":"So once in a while, in a Q and A or in a video, I will mention in passing something like subtle bodies. Usually the context where I will mention that is when we talk about angels and the manner in which the Church Fathers describe angels. And so I thought I could maybe give some of my own insight on this question. Now, it's important to understand that my insight is mostly there to help connect the ancient way of thinking with a more contemporary way of thinking. Because sometimes we look at the ancient way of thinking and we're such materialists that we struggle to see what it is that the Fathers or the ancients are referring to when they talk about something like subtle bodies. This is Jonathan Peugeot. Welcome to the symbol world. And so what do we, first of all, what are we talking about when we're talking about subtle bodies? So the idea is that there are some beings and angels are the way that is usually described, that do not have corporal bodies like we. They don't have physical bodies like we do. But they're not also completely spiritual. That is, they exist in a kind of intermediary realm in which they have what we could call, or what the Church Fathers call subtle bodies. Now, the Church Fathers don't completely agree on this. You'll find obviously different types of descriptions. And some of the Fathers tend to oppose materiality and immateriality very clearly. And so in that sense, that they'll say angels are immaterial. But sometimes there's an intermediary like you talk about, let's say, spirit, soul and body, mind, soul and body. It depends how you translate it. But sometimes there's like a triple idea, and you have this in between space, which is what we could call the space of subtle bodies. Now, I'm going to read a little text from you from St. John Damascene, and it'll help you see why it is that it can cause subject some confusion. All right? And so, so here's St. John Demin on angels. So he says that. That God, he himself and the maker and creator of the angels, he is the maker and the creator of the angels, for he brought them out of nothing into being and created them after his own image, an incorporeal race, a sort of spirit of immaterial fire. In the words of the divine David, he makes his angels, spirits and his ministers a flame of fire. Now, notice already the problem that we've got here now. You know, we say angels are wind and fire. And so the way that we understand wind and fire is that they are material things. And so we have lost in some manner the analogy that the ancients used to use about the things which were invisible, the things which were ungraspable even in the physical world, as ways to signify that which is immaterial in the strict sense. That is, things that don't have bodies, like ideas, like, you know, like virtues, like, you know, the things that activate bodies, they themselves are not embodied. You could say they. They don't have bodies. But. And so you can see already the problem. So it's like, you know, these angels are. Are made of. Of wind and fire. And so already a materialist can read that and think, well, they are material. They do have bodies. They're made of wind and fire. But you can see even he makes this effort to say that they are a sort of spirit of immaterial fire, right? And so he's using the analogy of the physical world to describe something which is incorporeal in the strict sense, okay? And so he later goes on to try to explain this, and it's difficult, right, because he says the angel's nature is rational and intelligent and endowed with free will, changeable in will. For all that is created is changeable, and only that which is uncreated is unchangeable. And so the very definition of creation is that it is changeable, only God is completely unchangeable. All right? And then he continues on to describe this saying that they can turn towards goodness or towards evil, but they are not susceptible to repentance because they, the angels are incorporeal. All right? So here is a good description of something that can confuse someone. And so he says, talking about angels, again, seeing that they are minds, they are in mental places, they are not circumscribed after the fashion of a body, for they have not a bodily form by nature, nor are they extended in three dimensions. But whatever post they may be assigned, there they are present after the manner of a mind and energized, and cannot be present and energized in various places at the same time. And so, you know, this can cause serious confusion because you could think, well, that means that angels are. You might think that it means that angels are physically located, that they have. That they're in certain places in certain time. But that's not what he's saying. He's saying they are in mental places and they are circumscribed by mental places. And so, you know, the idea, you could understand it very simply that you know something, you know, a mental activator. Let's Say the angel of a virtue, let's say the angel of hope, cannot also be the angel of faith because they are circumscribed by. They're an activating principle for hope, for that aspect of reality. That is, they're given a role. They have a role in the world to manage certain aspects of reality. And they are circumscribed by that role, not circumscribed physically in the world. But it's because we're so not used to thinking that way, we struggle to understand what it is that we mean. And so, you know, that's why many of the church fathers will talk about the notion that angels have what we call subtle bodies, which is that they're not completely incorporeal in some ways, God only is completely incorporeal, but that their bodies are not also circumscribed in flesh, but they have more fluid bodies, more subtle bodies. And so it's difficult again. And one of the reasons why I'm talking about this is because I was reading Perelandria again and there's some really wonderful. C.S. lewis's book. There's some wonderful insights in that book. And also out of a silent. Out of the Silent Planet, there's some wonderful insights. But some of them can be very, in my opinion, can be misleading because the perception of these angels is. Really. Uses a lot of material. But maybe he's doing it just because he knows the story and there's no other way to talk about it. But he talks about, you know, beings that are kind of made of light almost in a physical way. It seems like that's what he seems to be describing that are, you know, that are kind of like in other dimensions of all that kind of stuff. But I think that when we go down that line too much as materialists, we lose an understanding of what it is that we can mean by a body of light or a body, a subtle body. You know, it's like a body of light means that it's a body that projects meaning onto other bodies. It's a body, a spiritual body, that is circumscribed because it's doing a certain thing. But it's also. But it's projecting light on other bodies. It's making sense of other things. And so you can understand. And so we all, like, you know, you. All of us have subtle bodies in that sense. All of us also have a physical body, but also a subtle body. That is ways that we influence the world without being directly physically connected to them. And so our very capacity to make meaning is in some ways a form of subtle body. So a good example would be, you know, when you look at, you know, stories of fairy tales or kind of fantasy stories where they talk about magicians who act at a distance, you know, and so you could come up with really elaborate, you know, weird kind of new age, materialist, spiritualist ideas about some, like, subtle substance. Right. Was it Edgar Case came up with the idea of ectoplat, which is an actual physical substance, by the way, which is a subtler physical substance that can make the magician, you know, act at a distance, like all that kind of nonsense. But the idea of action at a distance through a subtle body is something that you do every single day. And it is quite normal. All you need to do to experience it is to, I don't know, ask your child to bring you a glass of water and then watch the child bring you a glass of water. That is a subtle body. That is action at a distance through meaning making, through intelligence, and not through actual physical, you know, like physically taking your child to the water and then having them bring the water to you, you are using your subtle body to affect reality. And so that is the best way to kind of understand what subtle bodies are. They're related to meaning. They're related to meaning making. And they energize, you know, like a mind energizes a body. They energize bodies to. To move according to the role that they play, according to the intelligence that they participate in. And so that is honestly, like the. Just the best way to understand a subtle body. So you can think about subtle bodies like try to find example, examples of subtle bodies in the world. And so a story, for example, is a subtle body. A story is not encompassed in the world. You can't, you know, you can write down the story, but even the writing down of it is not the story. The story is a series of. Of a series of intelligent points that are brought together in. In a coherent whole. And that has an effect on people. And so if I tell a story, I can affect you through my subtle body so that it will change the way that you act. I can bring you under my, you know, under my spell, if you will, or under my management by using tools of meaning and tools of. Of intelligent projecting, right? And so that is the kind of the way to understand it. So, you know, you could say something like, let's say especially the. The notion of angels that often. Especially the lower angels, right? So let's say the angels and the archangels and the, the guardian angels, you know, we in some ways are their bodies, you know, because they act on us, they receive from God and they act on us. And then we embody the patterns that they rule over as we function in the world. But it's, it's a, it's a dangerous way. It's a dangerous to think that that's the only way to understand it. Because the higher levels of angels, they don't act directly on us. They act through other angels on the bodies. And they also act through intelligent means for humans to. Or to other humans. And so very, very high angels are so subtle that the type of pattern that they manage is so high that it manages other patterns the best way to understand it. And so it's like one angel has other angels below them and then those angels also act on the world, etc. Etc. Until you get to the corporeal world, which is managed by this hierarchy of agency above it, a hierarchy of patterns that comes down upon reality. And so you could say that all these other levels are in some ways the bodies of the higher beings, but they're not necessarily corporeal, they're not necessarily physical bodies that extend into three dimensions. St. John Damascene says that they don't extend in three dimensions. You know, the angel of Hope does not extend in three dimensions. It acts through us and it finds its anchor through us. But the way that it act on us is like a mind energizing the world. And so I think it's important and I hope that you can kind of understand and it would be a good example to think, think of examples of subtle bodies. Like, for example, you know, if you, if you write books, even the Internet is very much an. A participation, a subtle body. That is the type of influence that you have online by writing posts, by posting things, by, you know, writing comments. These are subtle influences. They're not like, how can I say, there's not like me hitting someone over the head with a baseball bat, their action at a distance. They're subtle, different subtle influences that are an extension of my own subtle body. And so a good way to understand, let's say the subtle body is, is to understand the notion that one part of the extension of me, one part of the manifestation of me is one which is related to meaning and to, you know, to, to meaning making. That's a good way to understand it, to spirit in that sense. And what's also, let's say the last part of what I want to say is that although I'm pushing towards helping you see the difference, right? To not confuse. When the. When the Holy Fathers say something like that the angels are made of immaterial fire. To not confuse it with a type of corporeality in a science fiction way, that they're there, but they're in another dimension of that kind of nonsense. It really is about how minds activate bodies, but it's not completely disconnected from the analogies that are used. And that's probably what makes it so difficult for us to understand it, is that in some ways, some of the analogies that we use are proper analogies because they are really direct images of what the incorporeal aspect is representing. So let me give you an example that's very simple, which is that in the Orthodox Church, we have a practice which is called the Jesus prayer. And the Jesus prayer is a prayer that you repeat, lord Jesus Christ, Son of God, have mercy on me, a sinner. And in the traditional, ancient practice, the monks would look at their navel or look at their center, and then they would breathe in at the first part of the prayer, they would breathe out in the second part of the prayer. And through that breathing and rhythm, they would try to make the prayer enter into their heart, and the prayer would align with their heartbeat, so that in some ways, their heartbeat was becoming the prayer. And so now you have two things going on here. On the one hand, you have the physical action, which is the repetition of the prayer, the breathing, the standing still, the looking at your center, right? The coordination of the. Of breathing in spirit and then pushing it down through attention. You know, like breathing and pushing the breath down into your center with the prayer. That's a physical action that you're doing. But as you're doing that, you are also doing the subtle action, which is, you know, in a more In. In a more kind of psychological sense or in a more purely spiritual sense, you are trying to make that prayer enter into your center of your being. You're trying to replace all the flighty thoughts, all the. All the. All the kind of distractions that you have in your being and replace it with that prayer. And so the physical action of doing this practice is aligned with the more, you know, subtle action of entering the prayer and the thought of Lord Jesus Christ, have mercy on me, a sinner, bringing that past your thoughts into your core, into the center of your being, and in some ways, replacing your thoughts, replacing all the distraction, all the chaos, all the passions with that prayer, so that it becomes, in some ways, the basic pattern by which you exist and the Pattern of the prayer itself, that is the pattern by which you should exist, which is an invocation of Christ, an invocation of the ideal, and then a recognition of my distance from the ideal. And so it's like, that's actually the pattern of reality. It's a little hero's journey, right? It's like you recognize your loss and you come back to the invocation. You invoke, you recognize your distance, and then you try to remember and come back to Christ. So the idea of remembering God through this prayer, all these things are all spiritual things that we do. They're all a spiritual practice that we do, but they are in line with the analogical physical action that we do. And that is what makes the subtle body question. The most difficult to understand is that it is not completely disconnected from the spiritual part. The analogies are not arbitrary. They are important. And they can sometimes be very strict analogy between the two. And so that means that. That means some things that might be a little tricky for materialists and modernists to understand. That means that when someone experiences this type of agency, this type of subtle being, it is possible that they experience them in a way that is very close to or really is a seeing or a hearing or a physical manifestation. Because the. The analogy between the physical manifestation and the spiritual meaning is not completely arbitrary and impossible. So what that means is that it is possible to see an angel. It is possible to hear, you know, an. An angel. All these things are. Are possible. And they don't take away from the understanding that the way that it happens is through a kind of analogy that is, it is pointing towards true incorporealness and true spiritual realities. And like I said, I know that that last part is the part that might stretch you beyond your limit, but if you can't go there yet, if you can't go all the way there, you might as well at least try to understand the first part and that, you know, understand that some of these things are documented in the sense. Let me give you an example of an interesting documented case. I forget the name of the missionary, but there was a missionary who went. I think it was in Papua New guinea or somewhere in the third world. I heard this from, from Paul Vanderklee, and then I found the story later that forget where. Where I saw it, though. So this missionary is there with these people from another culture, like a more traditional culture. And the people from the culture say, you know, you know, the. The Goddess is appearing at this place right now. The Goddess is there, and the missionary is like you know, whatever. And so they, like, take the. The man, the missionary, to the place where the Goddess is appearing, and they're like, look, the Goddess is right there. The Goddess is there on the beach, and everybody can see her, but the missionary can't see her. He can't see the Goddess. And so, you know, you could come to two conclusions, which is one, everybody is delusional. Everybody is having a delusion. Okay, you can come to another conclusion, which is that those people have been trained to, let's say, notice subtle patterns in reality through which they're capable of seeing with their eyes or the eyes of their heart. At least they're able to see the agency manifesting itself in front of them as the Goddess itself. And so, all right, so I don't think I've ever put you guys as far as I'm doing now, but, you know, I think that. Meditate on it, think about it, and you'll see that, you know, if you. If you watch the discussion where I've talked about with Rafe Kelly, where we talked about the possibility of seeing a face in the clouds, and that that face could speak to people and that that face could speak to a group of people, they could all see it, and it would all be, in some ways a principality communicating with them. And that that is completely possible. And that it is not doesn't contradict a kind of more material causalities. It has to do with the capacity to notice subtle patterns that are kind of manifesting themselves in the world. So. So anyways, I think I've said enough, and I think I've kind of pushed you enough. Feel free to comment and to engage in the discussion. If you want to also engage in the discussion on the circle community of the symbolic world, that could be fun to do. And so. So, yeah, so I hope you enjoyed this and I hope that it was at least a little useful to you, and I will talk to you very soon. Bye. Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
